["Years of ivory poaching have left elephants and rhinos among the world’s most endangered species. A concerned yet misinformed meme is misrepresenting conservationist efforts to protect these animals.", "“This is one of the best things I have seen in a while. They use the same pink dye that they use on bank notes. This makes the Ivory unsellable and it can’t be consumed. (the animals are not harmed and it is saving their lives),” reads the January post, which was a share of a post that originally appeared in 2016.", "Some conservationists have used procedures that poison rhino horns to devalue the horn and deter ivory poaching. The process does include a dye, but it does not alter the long-term surface appearance of rhino horns.", "“To devalue the horn, it is treated by infusing it with a compound made up of ectoparasiticides and indelible dye that contaminates the horn and renders it useless for ornamental or medicinal use,” the Rhino Rescue Project says in describing the process on its website.", "Researchers found the procedure gave rhino horns a neon pink tint when they passed through airport X-ray machines, making it difficult for poachers to transport affected ivory.", "The news agency AFP explains the process in a 2013 video.", "USA TODAY reached out to an account that recently shared this meme for comment.", "The process and its effectiveness in deterring poaching have been debated by conservationists.", "The International Fund for Animal Welfare has written that poisoning ivory could increase black-market prices and heighten poaching threats. The sedatives and procedures come with significant costs for conservationists and possible health risks for the animals. There are also ethical complications that come with poisoning ivory that humans may consume, even if they do so illegally.", "Even if the procedure is successful, the animal welfare fund stressed that horns and tusks grow quickly, making it “logistically impossible.”", "The Rhino Rescue Project called misinformation about tusk dyeing that makes rhino horns pink “nothing more than a frivolous Facebook or Twitter rumour.”", "More:Fact check: False claim that Pelosi travels weekly on 200-seat Boeing airplane", "On its FAQ page, the project explained that conservationists don’t stain rhino horns pink because the dye would not last long enough to be effective and because the visible discoloration would make other wild animals vulnerable to predators.", "The images in the meme are altered. Earlier versions of each image show neither the elephant nor the rhino had a bright pink horn or tusks.", "Save the Rhino acknowledged social media confusion about the practice in an August 2015 article, which it says first surfaced in April 2013 on Take Part.", "“This photo has been digitally altered and is not an actual photo of a rhino at Sabi Sand. (Photo: Heinrich van den Berg/Getty),” the original image caption read.", "Since then, the altered image has circulated on social media with no disclosure that it was doctored.", "More:Fact check: Social media users confuse Shriners Hospitals' Kaleb with another boy who died", "A viral meme depicting a rhino with a bright pink horn and an elephant with bright pink tusks is not authentic. Conservationists have used a procedure that uses poison and dye to render rhino horns worthless, but that procedure does not make rhino horns or elephant tusks appear bright pink. We rate this meme ALTERED because it uses doctored images to misrepresent the procedure.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook."]