["State Sen. Jim Tedisco claimed the state of Maine raised the minimum wage for tipped workers in 2016, then lowered it less than a year later. (Buffalo News file photo)", "New York state leaders are thinking about raising the minimum wage for workers who earn tips in addition to their hourly rate.", "Sen. James Tedisco, a Republican from Schenectady County, says that idea didn’t work when it was tried in Maine two years ago.", "\"The state of Maine passed an initiative that abolished the tip credit,\" Tedisco wrote in a blog post, \"but less than a year later reversed that decision due to restaurant employees organizing en masse against the measure after they saw a significant decrease in earnings.\"", "The state Department of Labor will decide later this year whether to end a practice that allows employers to pay tipped employees less than the state’s minimum wage. Tedisco is against the idea, saying it could do more harm than good for the state’s restaurant industry.", "He says restaurant workers in Maine were able to reverse an identical proposal in their state. Is he right about what happened?", "What’s happening in New York state", "The state Department of Labor is holding hearings across the state through June to consider raising the minimum wage for tipped workers. The proposal would not ban tipping.", "Tipped workers currently make between $7.50 and $10.85 an hour without tips depending on where they live and the industry they work in. The minimum wage for everyone else varies between $10.40 and $13.50 based on location and industry.", "Tips are meant to make up the difference between what tipped workers earn and the statewide minimum wage. Employers have to fill the gap if tips do not.", "Gov. Andrew M. Cuomo believes the proposal may help employees who struggle to make the minimum wage with tips. If the Department of Labor agrees, the agency can raise the minimum wage for tipped employees without approval from voters or the state legislature. They already did once in 2015.", "What happened in Maine", "Maine tried to do the same thing in 2016 — sort of.", "In a 2016 ballot initiative, Maine approved increasing the state’s minimum wage as well as gradually raising the minimum wage for tipped workers until it reached $12 in 2024. The measure passed by a slim margin.", "By the time the new minimum wage took effect at the start of 2017, restaurant workers had already organized a campaign to restore the lower wage for tipped workers. They argued that a higher wage would give patrons less incentive to leave a tip. Fear became reality for many workers, according to Joshua Chaisson, a server in Portland, Maine, who co-founded Restaurant Workers of America to oppose the wage increase.", "\"Individuals were coming into our restaurant and simply asking us, ‘You make minimum wage, do you still think I should tip the same percentage?’ \" Chaisson said.", "He was one of hundreds of restaurant owners and workers who showed up at the state capitol in Maine that April for a public hearing on the wage increase.", "\"Several of us had brought pay stubs forward from the first quarter of 2016 and the first quarter of 2017 showing we had actually lost money in the same identical quarter from year to year,\" Chaisson said.", "In June 2017, the Maine legislature passed a new law making the minimum wage for tipped workers half of the regular minimum wage.", "One of the bill's sponsors, Sen. Roger Katz, gave credit to restaurant workers for the new law.", "\"Hundreds of restaurant workers have spoken, and we have listened,\" Katz said in a statement. \"Over the session it has become abundantly clear that those working in the restaurant industry overwhelmingly favor the tip credit system.\"", "Our ruling", "Tedisco said the measure raising the minimum wage for tipped workers in Maine was reversed in less than a year.", "Tedisco is right. Voters in Maine raised the minimum wage for tipped workers through a ballot initiative. State lawmakers reversed that decision less than a year later after pressure from restaurant workers who were against the wage increase.", "We rate his claim True.", "\"Save the tips in NY!,\" Blog Post from Sen. James Tedisco", "Phone interview with Joshua Chaisson, co-founder of Restaurant Workers of America", "\"After success in getting tip credit restored in Maine, it’s time to go national,\" Jan. 11, 2018, Portland Press-Herald Op-ed", "\"Maine restaurant workers successfully lobby to lower the minimum wage,\" June 29, 2017, Fox News", "\"Governor Cuomo Announces Hearings on Potentially Eliminating the Subminimum Wage for Tipped Workers,\" Jan. 25, 2018, Press Release", "\"Governor Cuomo Unveils 5th Proposal of 2018 State of the State: Examine Eliminating the Minimum Wage Tip Credit to Strengthen Economic Justice in New York State,\" Dec. 17, 2017, Press Release", "\"New Minimum Wage and Overtime-Exempt Minimum Salary Take Effect in Maine Jan. 7,\" Dec. 15, 2016, Press Release", "\"Maine Lawmakers Repeal Part of Minimum Wage Law That Voters Just Passed,\" June 28, 2017, Tribune News Service via Governing Magazine", "\"Push to restore lower base wage, tip credit for Maine tipped workers gains momentum,\" May 10, 2017, Bangor Daily News", "\"Restaurant Workers of Maine group opts against minimum wage increase,\" Nov. 4, 2016, Bangor Daily News", "\"Maine votes to raise minimum hourly wage to $9 next year, $12 in 2020,\" Nov. 9, 2016, Bangor Daily News", "\"Your Vote 2016: Raising the Minimum Wage,\" Oct. 14, 2016, Maine Public Radio", "\"Referendum launched for $12 Maine minimum wage by 2020,\" April 16, 2015, Bangor Daily News", "\"State orders minimum wage increase for tipped workers\", Feb. 24, 2015, POLITICO New York", "Maine Ballot Question No. 4 Results, Associated Press via The New York Times", "LD 673 by State Sen. Roger Katz", "\"Senator Roger Katz Seeks to Restore Tip Credit,\" March 8, 2017, Press Release", "Maine Minimum Wage Frequently Asked Questions", "\"LePage signs tip credit restoration bill,\" June 26, 2017, Portland Press-Herald", "\"Legislative panel sides with restaurant owners, workers in backing revival of ‘tip credit’,\" May 11, 2017, Portland Press-Herald", "\"Hundreds of Restaurant Workers Crowd State House in Debate Over Minimum Wage,\" April 5, 2017, Maine Public Radio", "\"Maine tried to raise its minimum wage. Restaurant workers didn’t want it.,\" June 27, 2017, Washington Post", "\"Tip Credit Restoration Bill Receives Initial Approval in Senate,\" June 7, 2017, Press Release", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]