["About this rating", "On 11 November 2016, click bait site Observatorial posted an article reporting that a member of the Black Lives Matter movement shot himself by accident while taking a selfie of himself holding a gun in protest of the results of the U.S. presidential election:", "Taking a selfie with a loaded gun ended tragically in Washington, when a man accidently shot himself in the face while taking a picture. His girlfriend was next to him when the gun went off.", "The man apparently had been greatly against Donald Trump, and many of his selfies included violence and profanities directed toward presidential candidate Donald Trump. According to his girlfriend the photo was supposed to be a joke about killing himself if Donald Trump were elected president.", "As she told the police, this was not his first selfie with the weapon. The fatal accident took place over the weekend, police in Skagit County said.", "There was, sadly, a fatal accident in Skagit County involving a gun and a selfie, according to the Skagit Valley Herald, the paper cited by Observatorial. But the report mentioned nothing about politics, and it took place on 28 February 2016, months before Trump won the election:", "A 43-year-old Concrete man died Sunday after accidentally shooting himself in the face with what he thought was an unloaded gun.", "The man and his girlfriend were at a residence in the 46000 block of Baker Loop Road taking photos of themselves with the gun when the incident occurred, Skagit County Sheriff’s Office Chief of Patrol Chad Clark said.", "The girlfriend reported that the pair had done this several times during the day, with the man apparently removing the bullets and then reloading the gun multiple times.", "After the last time, however, a bullet apparently remained in the gun, Clark said.", "The image used by Observatorial has no association with the incident described above. The image of the man holding a gun to his face while taking a selfie in a mirror has been online since at least 2012, years before Trump became a presidential contender in 2015.", "The image appears to have first surfaced on Reddit on 21 December 2012. It is unclear who is depicted in the photograph or what his fate was, but the picture has since become part of an anthology of \"selfie fails,\" an Internet phenomenon of poking fun at people doing unwise things while taking pictures of themselves. In 2014, BuzzFeed included the picture in a series of 27 photographs of people doing things such as lighting the fumes from an aerosol spray can on fire or pouring chocolate syrup on themselves.", "Furthermore, there is no indication that the pictured man has anything to do with the Black Lives Matter movement. The inclusion of the movement's name (and the racial tone of the word \"thug\" in the headline) seem to have been done for the purpose of inflaming racial animosity after a contentious election in which racial animus was often a focal point of controversy.", "The Black Lives Matter movement didn't develop until a year after the photograph first appeared on the web, with the 2013 acquittal of George Zimmerman for the shooting death of unarmed teen Trayvon Martin. It was galvanized in 2014 after the police shooting death in Ferguson of Mike Brown, another unarmed African-American teen. The appearance of the photograph on the Internet precedes the Black Lives Matter movement and the two have nothing to do with one another.", "Randy.   \"BLM Thug Protests President Trump with Selfie ... Accidentally Shoots Himself in the Face.\"\r\n    Observatorial.   11 November 2016.", "Skagit Valley Herald   \"Man Accidentally Kills Himself While Taking Photos with Gun.\"\r\n    2 March 2016.", "Rhoades, Logan. \"27 People Who Should NOT Be Taking a Selfie Right Now.\"\r\n    BuzzFeed. 13 June 2014.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]