["We could find no evidence to support the minister’s claim about his sector’s contribution to the national GDP. Available data shows it is at most 10%, not the 24% the minister said.", "In highlighting the importance of tourism to Kenya’s economy, Balala was largely correct about how many people are employed in the sector – approximately 1,6 million – based on available data.", "However, there is no tourism satellite account for Kenya, regarded as the international standard for measuring tourism’s economic value. This makes accurate estimates difficult.", "Kenya’s tourism industry has, like that of many other countries, had a horror year, with some official projections estimating losses could reach as much as KSh13.5 billion (US$125 million).", "Describing the industry as “on its knees”, tourism minister Najib Balala on World Tourism Day in September 2020 called for more investment.", "Restrictions put in place in the country due to the Covid-19 pandemic have been gradually rolled back, with international flights resuming on 1 August.", "As the country works to rebuild tourism, we fact-checked two significant claims made by Balala in May 2020 about its value to the country.", "Tourism forms 24% of Kenya's GDP", "The claim was published on the minister’s official Twitter and Facebook accounts, and was greeted with incredulity from a prominent economist.", "We reached out to the minister to ask for the source of these figures and will update this report should he respond.", "For data on how different sectors contribute to Kenya’s economy, John Kinuthia directed us to the annual economic survey from the Kenya National Bureau of Statistics. Kinuthia is a senior programme officer at the International Budget Partnership, a public finance thinktank.", "The data from the statistics office shows that in 2019, the biggest contribution to Kenya’s gross domestic product, or GDP, was by agriculture.", "“Agriculture remained the dominant sector, accounting for slightly over a third of the total value of the economy,” the agency said in the 2020 edition of the survey.", "The growing of crops contributed 27.8% to GDP. When animal production, agriculture support services, fishing, forestry and logging were also considered, this share rose to 34.1%.", "The data showed other key contributors were transport and storage (8.5%), wholesale and retail trade (7.6%) and manufacturing at 7.5%.", "But the survey does not have data on the GDP contribution of tourism, Kinuthia noted. Africa Check asked the statistics office why this was the case.", "The bureau had no data on tourism’s contribution because it “cuts across many sectors”, Collins Omondi, the acting director general, said.", "This included accommodation, air travel, transport and the service industry. Only a tourism satellite account would accurately show the contribution of tourism to the GDP, Omondi said, adding that Kenya’s Tourism Research Institute was working on capturing this data. Local media have also reported this.", "A satellite account is a widely accepted and comprehensive measure of tourism’s economic value.", "Other data sources however suggest tourism makes a far smaller contribution to the Kenyan economy. These include:", "Between 0.7 and 0.8%, according to a June 2020 report from the planning department in the treasury. This covered 2016 to 2019. The data however appears to use the gross value added in accommodation and food services as a proxy for tourism.", "An average of 10.9% between 2011 and 2014, according to a 2017 report by the United Nations Conference on Trade and Development.", "10%, according to a 2018-2022 tourism sector plan from the tourism ministry.", "9%, according to a May 2020 national tourism policy draft.", "One of the more detailed estimates is from the World Travel and Tourism Council, a London-based non-profit organisation that represents the private sector. In a March 2020 factsheet, it gave the contribution of tourism and travel to Kenya’s GDP as 8.2%, citing the UN and national sources.", "This estimate is also used in an undated World Bank report assessing tourism’s contribution to the Kenyan economy. But the report says the figure may give a “partial picture” as it “neglect[s] impacts of backward and forward multipliers as well as dynamic effects on economic structure”.", "We asked the international tourism council how it calculated the estimate on Kenya. It sent us its methodology, which showed it considered the direct, indirect and “induced” contribution of tourism to the GDP.", "This spanned accommodation, food, transport, cultural and sports services. For indirect contributions, it included “all public and private investments” in tourism such as infrastructure, marketing, aviation and security.", "In countries where there were data gaps, the organisation said these were filled by “supplementing data with estimates derived from the typical relationship between the missing information and other economic and travel and tourism indicators”. (Read the full report here.)", "While only a tourism satellite account would give a definitive estimate of tourism’s contribution to GDP, there is no evidence to support minister Balala’s figure of 24%.", "We therefore rate his claim as incorrect.", "Tourism employs about 1.6 million people", "This claim was also shared on the minister’s social media accounts. The most recent data on employment from the national statistics office shows that 18.1 million people were employed in Kenya in 2019. Of these, 3.1 million people were formally employed.", "The minister’s figure would work out to a share of at least 9%. (Note: The employment figure of 18.1 million did not include small scale farming and pastoral activities.)", "Only a tourism satellite account could accurately compute how many people were employed in the sector, Collins Omondi, the acting director general of the Kenya National Bureau of Statistics, told Africa Check.", "Other data we found suggests the minister was more accurate with this claim.", "Tourism accounted for an average of 9% of direct private and public sector employment between 1995 and 2001, according to a 2009 paper on the economic contribution of tourism in Kenya.", "Dr Elisabeth Valle, who co-authored the study, told Africa Check she did not have more recent data. She is a lecturer in the department of applied economics at the University of the Balearic Islands in Spain.", "Valle directed us to the tourism satellite account as the best source of information on unemployment. But the available data only covers countries from the Organisation for Economic Cooperation and Development, of which Kenya is not a member. We also came up empty with the UN’s World Tourism Organization.", "The tourism ministry’s own 2018-22 plan gives total unemployment at 9.2%, while a draft national tourism policy says it is 10%.", "In March 2020, the World Travel and Tourism Council gave the same estimate as the minister, of 1.6 million people.", "Africa Check has previously outlined the challenges of defining a job and capturing the informal sector. In the absence of a tourism satellite account we cannot definitely say the minister is correct, but his numbers here appear close to what the available evidence shows.", "We will therefore be generous and rate this claim as mostly correct.", "Please complete this form to receive the HTML sharing code.", "We examine three claims in a Cape Talk interview with the National Sea Rescue Institute on world drowning prevention day.", "Covid has trained a spotlight on causes of death and how deaths are recorded across the world. We disentangle what paperwork has to be filed...", "In a widely listened-to podcast, the BBC made the startling claim that more than a million Africans die each year on the continent’s roads. ...", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "For democracy to function, public figures need to be held to account for what they say. The claims they make need to be checked, openly and impartially. Africa Check is an independent, non-partisan organisation which assesses claims made in the public arena using journalistic skills and evidence drawn from the latest online tools, readers, public sources and experts, sorting fact from fiction and publishing the results.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "© 2023 - Africa Check - All rights reserved.", "We will never charge you for verified, reliable information. Help us keep it that way by supporting our work.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "Support independent fact-checking in Africa."]