["About this rating", "Jenny Cudd, who was accused of being a part of the Jan. 6, 2021, riot at the U.S. Capitol and charged with two misdemeanors, asked a judge if she could go on a vacation to Mexico.", "In a court filing from Feb. 1, 2021, Cudd’s attorney requested that the judge let Cudd travel later in the month to Riviera Maya with employees of her flower shop. The trip, she noted, was prepaid, and she would travel to Mexico on Feb. 18, and return four days later:", "Prior to the alleged offense at issue, Ms. Cudd planned and prepaid for a weekend retreat with her employees for the dates of February 18 through February 21, 2021, in Riviera Maya, Mexico. This is a work-related bonding retreat for employees and their spouses [...] Ms. Cudd has appeared at her scheduled court appearance, remains in constant contact with her attorney, and has remained in contact with pretrial probation, as ordered.", "Cudd had boasted about participating in the attack during a video she recorded inside the Capitol. She said, “We did break down Nancy Pelosi’s office door.” In an interview with a local television station two days later, she said that she did not personally destroy anything and did not go into any offices. She also added she had walked through an open door after the barricades were broken down.", "Cudd was arrested a week after the riot. In a Jan. 12 complaint, the FBI cited her statements on social media and in the interview. She was charged with misdemeanor counts of entering and remaining on restricted grounds and disorderly conduct or violent entry. Cudd was granted a pretrial release on the condition that she was not allowed to travel to Washington, D.C., unless it was for a court appearance or a meeting with her attorneys or pretrial services officer. She was not allowed to travel outside Texas, where she lived and ran her business, and international travel must be approved by a judge.", "On Feb. 5, a federal judge granted Cudd's travel request on the grounds that \"the Defendant has no criminal history and there is no evidence before the Court suggesting the Defendant is a flight risk or poses a danger to others.\" She was required to \"provide her itinerary to her supervising Pretrial Services Officer and follow any other instructions provided by Pretrial Services.\"", "Given that Cudd’s request to travel was documented in a court filing, we rate this claim as “True.”", "Feb. 8. 2021: Added update that Cudd's travel request was approved by a federal judge.", "Nur Nasreen Ibrahim is a reporter with experience working in television, international news coverage, fact checking, and creative writing.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]