["About this rating", "Since 2014, David Muir has anchored the weeknight edition of the nationally-televised ABC News program \"World News Tonight.\" Muir became the subject of misleading online advertisements as early as Dec. 16, 2020, when the website InvestmentGuru.com appeared to be paying to promote an ad that showed him shirtless:", "Readers who clicked the misleading advertisement were led to a 153-page story with the headline: \"Meet The Better Halves of The Most Successful Celebrities Out There.\" After readers clicked \"Next Page\" 150 times, Muir appeared on page 151. However, the story made no mention of Muir \"revealing his partner.\"", "Aside from his private life, there have been many rumors surrounding David Muir. The first big rumor started in 2010, where it was reported that he was being considered to replace Barbara Walters as a co-host on The View. However, the one rumor that has stuck around the most for being his partner is Kate Dries.", "Kate currently works where David anchors ABC World News Tonight and co-hosts 20/20. In 2015, Kate wrote an article about him titled, Report Indicates My Boyfriend David Muir Is a Monster. However, David has never actually confirmed to be dating her.", "Further, the photograph of a shirtless David Muir that was featured in the online advertisement was fake:", "The picture was doctored from this screenshot of a real ABC News \"World News Tonight\" broadcast:", "Muir was not the first prominent figure to be the focus of a shirtless, topless, or naked hoax. We previously reported on similar claims about U.S. Vice President Mike Pence, former Democratic presidential nominee Hillary Clinton, and former President Bill Clinton.", "However, perhaps our most visited page involving a topless picture was about the Disney cartoon film \"The Rescuers.\" It was true that a real picture of a topless woman quickly flashed across the screen during the 1977 film. After discovering the topless woman in the film, Disney announced a recall of the VHS version in 1999, citing an \"objectionable background image.\"", "Snopes debunks a wide range of content, and online advertisements are no exception. Misleading ads often lead to obscure websites that host lengthy slideshow articles with lots of pages. It's called advertising \"arbitrage.\" The advertiser's goal is to make more money on ads displayed on the slideshow's pages than it cost to show the initial ad that lured them to it. Feel free to submit ads to us, and be sure to include a screenshot of the ad and the link to where the ad leads.", "Jordan Liles is a Senior Reporter who has been with Snopes since 2016.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]