["About this rating", "On 17 February 2016, the entertainment web site World News Daily Report published an article reporting that a Detroit woman had set a new world record by having fourteen children with fourteen different fathers:", "According to the internationally recognized authority on the cataloguing and verification of world records, Anita Sullivan has just become the first woman in recorded history to conceive children with more than thirteen different men.", "“I’m extremely proud to have broken a World Record,” Ms. Sullivan told reporters.“My mother always told me that I was lazy and worthless, and that I would never accomplish anything in my life. Now, I’ve shown everyone that she was wrong, and that I can even be the best in the world when I put my mind to something. In fact, I’ve just accomplished something that no one had done before!”", "There was no truth to this story. The World News Daily Report is a fake news site that does not publish factual stories, as noted in their disclaimer:", "WNDR assumes however all responsibility for the satirical nature of its articles and for the fictional nature of their content. All characters appearing in the articles in this website – even those based on real people –  are entirely fictional and any resemblance between them and any persons, living, dead, or undead is purely a miracle.", "World News Daily Report also used an unrelated photograph to accompany their article:", "The image doesn't show this fictional woman's numerous children; rather, it is a stock photograph of children, presumably from different families.", "In fact, it appears that World News Net Daily just lifted the picture from a story in the Milford Mirror about a new mother who had given birth to the first baby of 2015 in Milford, Connecticut:", "Let's make this real story go viral!", "Posted by Karena Bennett on Thursday, February 18, 2016", "Another fake news clickbait site, TMZ World News, used the same headline, language, and quotes, but a different photograph and name (perhaps in an attempt to lend authenticity to a story that was equally fake).  The photograph in that version was stolen from another \"first baby of the year\" story, from 2007.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]