["A photograph of Rahul Gandhi with a black eye is circulating on social media with the claim that the Congress President was thrashed in his Lok Sabha constituency Amethi. From a Facebook group I Support Yogi, the post drew 2,600 likes and over 500 shares at the time of writing this article. The caption used to share the image reads – “राहुल गांधी का आज अमेठी में जोरदार स्वागत हुआ।कुछ ज्यादा ही पेला है (Rahul Gandhi was welcomed in Amethi today with immense pomp. He was attacked quite a lot.)”", "Another group मेरा वोट मोदी को ( Modi Voters जुड़े ) also shared the photograph.", "A few other groups that circulated the post are मोदी है तो मुमकिन है and Jai Ram Thakur (जयराम ठाकुर ) CM of Himachal with modi ji.", "On Twitter, the photograph has been shared with a different caption – “राफेल से टकराकर पप्पू की हालत.”", "राफेल से टकराकर पप्पू की हालत 😫 pic.twitter.com/lTHOC0Gghq", "— Sunny deol (चौकीदार) (@Sunnydeolsir) May 9, 2019", "A reverse-search on Google takes one to an article published by Postcard News that carried an image similar to the viral photograph. The logo of Republic TV was superimposed on the image. We used Google search operator ‘site:’ to locate the photo on the media outlet’s website.", "Rahul Gandhi’s clothes are the same and the background of the mountain also looks identical. The mountain in the photograph is Mount Kailash. Several websites have used the same image across the years. When we juxtapose both images, the similarities are evident. In the photoshopped image, the tilt of Gandhi’s face has been adjusted. His eyes have been painted blue-black to portray him as injured. Furthermore, his face has also been bloated in the digitally-manufactured image.", "A double reverse-search of Gandhi’s image led us to the original photograph. Among the media organisations that have used the photograph in the past was Economic Times. A side-by-side comparison of both the images reveals that Republic had superimposed Gandhi’s photograph on a background of Mount Kailash for representational purposes.", "The ongoing Lok Sabha elections have witnessed several cases where Congress President Rahul Gandhi was targetted using misinformation of varied kind – false claims, photoshopped images and clipped videos.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]