["About this rating", "A secularist group asked East Central University to remove Christian-specific symbols from their chapel, and the school temporarily agreed before reversing their decision. If the group pursues legal action, a successful lawsuit could potentially force East Central University to remove the symbols for good.", "No legal action has been initiated East Central University over the issue, and no court order has been issued forcing East Central University to remove Christian symbols. As of 23 August 2017, the symbols have been restored to the chapel (including a cross that was never removed in the first place).", "During the summer of 2017, controversy and confusion surrounded a chapel located on the campus of East Central University, a public school in Ada, Oklahoma, regarding a request from a secularist group that the school remove a cross and other Christian-specific symbols from the university's chapel. The case has been pursued in particular by local pastor Randall Christy, and the confusion has stemmed from some misconceptions about the group behind the request and the denominational status of the chapel.", "Some readers following this story appear to think the organization that requested the removal of the symbols is an anti-Christian one or a \"hate group\" (it is not), while others appear not to understand that the chapel is non-denominational and therefore not specifically a Christian facility. As of this writing (23 August 2017), East Central University has not been forced to remove a cross or any other Christian symbols from their chapel (although they did temporarily agree to remove some of the symbols before changing their minds and restoring them), but it's possible that future legal proceedings (if initiated) might require them to do so.", "On 20 June 2017, the group Americans United for Separation of Church and State wrote to East Central University (ECU) President Katricia Pierson, asking her to remove religious Christian-specific symbols from permanent display in the chapel on the basis that the chapel is a state-owned property located on the campus of a public university:", "We have received a complaint that East Central University’s Kathryn P. Boswell Memorial Chapel has permanent religious iconography on display. These displays include Latin crosses on the top of and inside the building, Bibles, and a Christian altar. While it is legal for a public university to have a space that can be used by students for religious worship so long as that space is not dedicated solely to that purpose, it is a violation of the Establishment Clause of the First Amendment to the U.S. Constitution to display religious iconography on government property.", "The university partly acceded to this request, removing a Christian altar, a crucifix, bibles, and hymnals from the interior of the chapel. However, on 30 June 2017, ECU announced that they would be halting the further removal of other Christian symbols from the chapel and would establish a committee to determine how to proceed:", "We moved too quickly. We regret not taking time to pause and thoughtfully consider the request and the results of our actions on all of the students, faculty and community members who we serve.", "This requires a more thoughtful and deliberate approach to the request. That will be our next step. ECU will not take further action until the committee has had ample time to discuss and establish policies or guidelines for religious expressions in the art, history, architecture, study and areas of worship on campus.", "A spokesperson for ECU confirmed to us that administrators had since restored to the chapel all the items that had initially been removed.", "On 5 July 2017, Oklahoma state Attorney-General Mike Hunter wrote to the head of the Regional University System of Oklahoma asking that the matter be referred to the Attorney General's office, arguing that:", "I am writing to make it clear that the United States Constitution does not require Oklahoma's public universities to efface building features or remove other items simply because they are connected to religious expression or heritage. The Supreme Court has made it clear that the Establishment Clause does not require government institutions to adopt an attitude of hostility to religion, religious symbols, or religious people ...", "As the State's chief legal officer, I am committed to providing all legal resources necessary to represent and vigorously defend ECU and the State of Oklahoma in the event a lawsuit is filed. The highest priority must be placed on ensuring the defense of Oklahomans' religious freedom under the law.", "The following day, ECU announced that state Attorney General Mike Hunter had taken jurisdiction over the matter.", "A spokesperson for Americans United for Separation of Church and State confirmed that the group would be taking further action on the Boswell Chapel case, and provided us with the rationale behind their request.", "Our legal department is working on that ... I believe they're continuing the exchange of letters with the Attorney General's office.", "This is a public university. It's not a private religious college ... We're not arguing that it's unconstitutional for a public university to have a chapel, because a lot of them do. But they usually don't have religious symbols fixed to them permanently.", "Normally what happens with a chapel [in a public university] is [that] it's open to lots of different religious, and perhaps even non-religious, groups. And those organizations bring their religious symbols and display them temporarily while they're having a religious service and they take them with them when they're gone.", "The whole idea of a chapel is that it's supposed to be non-denominational and inter-faith, and our argument is that [permanently] displaying a large Christian cross on a building in a public university is a violation of the separation of church and state.", "So East Central University has only been asked to remove the cross and other Christian symbols from their chapel. While the school initially agreed to remove some items, they have since restored those items to the chapel and transferred handling of the issue to the Oklahoma Attorney General's office in anticipation of a lawsuit by Americans United for Separation of Church and State.", "If such a lawsuit proceeded (which seems quite possible in this case), and a court agreed with Americans United, East Central University would be forced to either remove the symbols from the chapel or appeal the case. Ultimately, it is possible that a federal court of final recourse (which could be the United States Supreme Court, but may not be) could definitively force ECU to remove the cross and other symbols for good.", "But as of 23 August 2017, such a potential outcome is a long ways off.", "Jaschik, Scott.   \"Flip-Flop on Church and State.\"\r\n    Inside Higher Ed.   3 July 2017.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]