["About this rating", "An old photograph showing a relatively large crocodile is frequently shared on social media accompanied by the caption: \"The only known photograph of the 28-foot crocodile that was killed in Queensland, Australia in 1957\":", "This is a genuine photograph of a crocodile. However, it was not 28 feet long, nor was it killed in 1957. This photograph was actually taken decades earlier and shows a crocodile of undetermined size that appears larger due to forced perspective.", "The picture was likely taken in 1914 along the banks of the Roper River in the Northern Territory of Australia. While we have yet to find the original source of this picture, we did find a scan of it that seemingly shows its original caption: \"Miss Cross and Mr Joynt near crocodile, Roper River 1914, CMS Hart Collection, Darwin.\"", "We've reached out to the National Library of Australia and the Northern Territory Archives Service and will update this article if more information becomes available.", "The original caption does line up with other information we were able to find about R.D. Joynt, a reverend who did missionary work in the early 1900s in Australia and published a short book in 1918 about his expeditions entitled \"The Roper River Mission.\" We were not able to find much information about \"Miss Cross.\"", "While we have been unable to find any information regarding this crocodile's specific size, it's very unlikely that it was 28 feet long. For one, there's never been a crocodile recorded at this size. The current largest, living crocodile in captivity is an 18-foot Australian saltwater crocodile (Crocodylus porosus) named Cassius. The previous record holder was \"Lolong,\" who died in 2013 and measured more than 20 feet in length.", "The Guinness Book of World Records notes that the aforementioned species of crocodile can grow to more than 7 meters (nearly 23 feet) in the wild:", "The largest species of crocodilian in the world is the estuarine or saltwater crocodile (Crocodylus porosus), which ranges throughout the tropical regions of Asia and the Pacific, including the northern coast of Australia. Average adult sizes for male and female C. porosus are 4.6–5.2 metres (15–17 feet) and 3.1–3.4 metres (10 feet 2 inches–11 feet 1 inch), respectively, with outsize males occasionally achieving 6 metres (19 feet 8 inches) or, on rare occasions, even 7 metres (22 feet 11 inches). One of these really large males may weigh as much as 1,000–1,200 kilograms (2,204–2,645 pounds), also making these animals the heaviest reptiles.", "The crocodile in the above-displayed photograph may also appear larger than it actually is thanks to an optical illusion known as \"forced perspective.\" The two people in this photograph are likely standing a few feet behind the crocodile. Because they are further from the camera, they appear smaller in the frame. This makes the crocodile in the foreground appear unusually large. We've covered several other examples of \"forced perspective\" photographs over the years.", "This photograph does not show a 28-foot-long crocodile that was killed in Australia. However, the accompanying caption — \"The only known photograph of the 28-foot crocodile that was killed in Queensland, Australia in 1957\" — wasn't made up out of thin air.", "In 1957, Krystina Pawlowski shot and killed a crocodile that was reportedly 28 feet long. While stories about this near-mythical-sized beast are popular in Australia, the size of this crocodile has never been confirmed and still draws skepticism from researchers.", "Adam Britton, a zoologist who specializes in crocodiles, wrote in 2010:", "I've never counted \"Krys\" because it's just a story — there's no evidence at all to back it up, and it just seems so far outside the maximum possible range for this species that I'd need some pretty solid evidence to believe it. That's why it never appears in any official statistics.", "A \"life-size\" replica of this 28-foot-long crocodile, nicknamed \"Kris,\" can be seen in the town of Normanton in Queensland:", "Photo by: Auscape/Universal Images Group via Getty Images", "Guinness Book of World Records.   \"Largest Crocodilian Species (Living).\"     Retrieved 7 November 2019.", "Britton, Adam.   \"Australia's \"Monster\" Crocodile.\"     Crocodilian.blogspot.com.   8 August 2010.", "Stephens, Kate.   \"World's Largest Croc Replica Gets Fresh Paint Job.\"    ABC.net.au.   13 September 2013.", "Reid, Robert.   \"Death of a Monster.\"    The Australian.   28 November 2008.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]