["A viral image posted to social media in 2016 that has recently resurfaced purports to show the meeting point of two oceans in the Gulf of Alaska.", "The Facebook post, shared on Jan. 10, 2016, with more than 4,300 shares, features a photo of a light blue ocean next to a darker one.", "A text above the photo reads: \"This is the Gulf of Alaska where 2 oceans meet but do not mix. Tell me there is No God and I'll ask you 'Who commanded the mighty waves and told them they could go no further than this' ! What an absolutely AMAZING God.....\"", "Some users on Facebook have shared other versions of the claim in the form of a video that similarly purports to show a phenomenon where the Atlantic and Pacific oceans meet.", "One user who shared the video on Feb. 15 claimed it was taken on cruise ship at the tip of South America.", "\"Why do these waters not mix? Because there is a huge difference in salinity between the clear water that comes from melting glaciers, which is cool and low in salt, while the water from the second ocean has a high salt concentration,\" the user captioned the Feb. 15 video. \"Therefore, the two oceans have different densities, which makes them almost impossible to mix.\"", "USA TODAY reached out to users who shared the image and video for comment.", "Fact check: No, Coca-Cola does not get rid of head lice. That's a myth.", "The image of the dark and light blue ocean is authentic and was captured by Kent Smith, who shared the photo to Flickr on July 4, 2010, and tagged Alaska as the photo's location.", "Smith explains that his image first went viral on Tumblr in 2011. From there, it was shared by Yahoo! News' \"Snapshots of the Week\"  and in an article by the Anchorage Daily News in 2013.", "\"I thought this was the most unusual thing I saw on the Alaskan cruise in the water,\" Smith captioned his photo. \"These two bodies of water were merging in the middle of the Alaskan gulf and there was a foam developing only at their junction.\"", "He adds that he is \"pretty confident\" that the image depicts the result of the melting glaciers being composed of fresh water, and the ocean has a higher percentage of salt, causing the two bodies of water to have different densities. He has posted similar photos of the phenomenon to confirm that they are not photoshopped.", "The video included in the posts that shows a similar phenomenon of seemingly merging oceans was captured by Steve Pearson in the Strait of Georgia near Vancouver, Canada, on July 4, 2015, according to AFP.", "\"The river water (Fraser River) flows into the ocean water (Strait of Georgia): a short video clip shot from the BC Ferries boat from Nanaimo, Vancouver Island (Duke Point) to Vancouver (Tsawwassen),\" reads the video's caption.", "Fact check: Users cannot block Facebook community standards through settings", "As Smith noted in his caption, the image shows what happens when fresh water from glaciers melts close to saltwater from the ocean, and why it's difficult for the two bodies of water to mix because of the different densities.", "Large eddies, known as moving currents, in the Gulf of Alaska carry glacial sediment and heavy clay from different rivers throughout Alaska, and those materials are lifted up and carried out into the gulf, according to Only In Your State.", "It is false to claim that the two bodies of water never touch. They eventually do mix, and they appear as separate only where there are strong gradients coming out against the saltwater.", "The video included in the posts shows a similar situation that takes place near Vancouver.", "According to a 2013 study by Ocean Networks Canada, the Fraser River reached the ocean near Vancouver, and the fresh water it carries mixes with the ocean water to \"form a thin plume of buoyant brackish water.\"", "\"In the early summer when the Fraser River carries high sediment loads, the plume is easy to distinguish from ocean water by its distinct light brown colour,\" the authors of the study wrote. \"It can be highly reflective and opaque to sunlight, and because it is a mixture of river and ocean water, it can be quite 'fresh.'\"", "Fact check: Viral video doesn't reveal sights, sounds of Mars from Perseverance rover", "Images and videos claiming to show where two oceans meet but don't mare FALSE, based on our research. While the images and videos are authentic, the phenomenon is the result of fresh water from a glacier or river mixing with saltwater from the ocean. The two bodies of water appear separate because of different densities.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook."]