["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "As a businessman, Lt. Gov. David Dewhurst claimed in an Aug. 19, 2013, interview, he knows how to keep Texas’ job growth going.", "\"Soy un hombre de negocios, el único official estatal quién es un hombre de negocios,\" he said on the Houston Univision 45 show \"Conexión Texas\" – \"I am a businessman, the only state official who is a businessman.\"", "Dewhurst, whose fluency in Spanish dates to his 1970-74 Central Intelligence Agency posting in Bolivia, phrased the same claim in a tighter way in another part of the interview, saying he is the only state elected official who is a businessman: \"Yo soy el único hombre de negocios eligido estatal.\"", "Currently running to keep his job as lieutenant governor, a post he’s held since 2003, Dewhurst makes a similar statement on his campaign website, saying he’s \"the only businessman elected to statewide office.\" D magazine quoted Dewhurst in a June 23, 2011, blog post, as saying, \"Out of 29 elected state officials, I’m the only traditional businessman.\"", "Dewhurst built a multimillion-dollar fortune as an energy entrepreneur and investor in Houston after his service in the Air Force and CIA.", "According to Spanish-English dictionaries and consultation with our colleagues at the Austin American-Statesman’s weekly Spanish newspaper, ¡Ahora Sí!, the adjective \"estatal\" would translate simply as \"state.\"", "By email, Dewhurst campaign spokesman Travis Considine told us that a June 29, 2013, quotation in a Dallas Morning News news blog post represented what Dewhurst \"typically says in English\": \"I’m the only traditional businessperson elected statewide.\"", "In the \"Conexión\" interview, Considine told us, Dewhurst was referring to Gov. Rick Perry, Attorney General Greg Abbott, Comptroller Susan Combs, Land Commissioner Jerry Patterson and Agriculture Commissioner Todd Staples, whose occupations Considine said were, respectively, rancher, lawyer, rancher, retired military and rancher.", "The Texas secretary of state’s office lists 27 statewide elected positions, and the Texas Legislature has 31 senators and 150 representatives, who are members of state government and make state law even though they are elected from regions rather than statewide.", "We pulled together information on Texas officials’ occupations from news stories, biographies on state websites and interviews with officeholders’ aides. A full list of sources is at right.", "Texas’ top statewide offices", "Among the five executive statewide elected officials Considine named, Staples describes himself as a \"former rancher and businessman\" on his campaign website. Staples, retired Marine Lt. Col. Patterson and state Sen. Dan Patrick of Houston, a radio host and station owner, are each challenging Dewhurst for the 2014 Republican nomination for lieutenant governor.", "Staples’ campaign manager, Cody McGregor, told us by phone that Staples started and owned a real estate firm from 1986 until 2007, was part owner of a plant nursery and started and ran a cattle-raising operation.", "Before entering public service, Perry farmed cotton and wheat, raised cattle and served in the Air Force, according to news stories from the Austin American-Statesman archives and NPR. Spokespeople told us by email that Abbott is a lawyer and Combs was a lawyer and rancher.", "All statewide offices in Texas", "Among the 27 state officials elected statewide, we spotted an accountant and an investment banker. That group includes the officials above plus the Texas Railroad Commission’s three members, the Texas Supreme Court’s nine justices and the Texas Court of Criminal Appeals’ nine judges.", "Members of those courts are lawyers and judges, as required by state law -- specifically, each must have 10 years’ experience as a practicing lawyer or judge.", "Railroad Commission chairman Barry Smitherman, a candidate for attorney general, was an investment banker and briefly a prosecutor in the Harris County District Attorney’s office, according to a June 26, 2013, Texas Tribune news story. His colleagues are Christi Craddick, described in her biographical entry on the commission’s website and Statesman stories as an oil and gas lawyer and former advisor to her father, then-House Speaker Tom Craddick; and David Porter, an accountant whose biographical entry says he \"built a successful small business around his CPA practice.\"", "Adding in Texas’ two U.S. senators, federal officials elected statewide, would bump the number up to 29, matching Dewhurst’s 2011 statement. Republican Sens. John Cornyn and Ted Cruz are lawyers.", "State legislators", "The Senate’s official guide to senators and the House Chief Clerk’s Office list of representatives’ biographical data give business as an occupation for dozens of members of the current (83rd) Legislature. Others are listed more specifically as owning companies, restaurants, agencies or firms. Here, too, \"lawyer\" is a common occupation, but there are also engineers, contractors, educators, insurance agents, ranchers and doctors.", "Our ruling", "Dewhurst said he’s \"el único official estatal quién es un hombre de negocios,\" which his camp would translate as \"the only statewide elected official who is a businessman.\"", "This claim falls down without going beyond the five executive offices that his spokesman said Dewhurst was referring to. Past that, the claim is incorrect in a commonsensical way, if one accepts, as we do, that legislators are elected state officials as well. Dozens of legislators are in business.", "Dewhurst isn’t \"único\" in this regard. We rate his statement as False.", "------------------------------------------------------------------------------------------", "FALSE – The statement is not accurate.", "Click here for more on the six PolitiFact ratings and how we select facts to check.", "\"Conexión Texas\" interview with Lt. Gov. David Dewhurst, Univision Houston, Aug. 19, 2013", "D magazine blog post, \"Dewhurst at D Magazine: This is \"As Close as I’m Gonna Come to Making an Announcement,\" June 23, 2011", "Dallas Morning News news blog post, \"Texas Lt. Gov. David Dewhurst says he’s not worried about Houston Sen. Dan Patrick’s challenge to his re-election,\"  June 29, 2013", "Email interview, excerpted, with Dewhurst campaign spokesman Travis Considine, communications director for Dewhurst campaign, Sept 11-13, 2013", "Todd Staples campaign website, accessed Sept. 13, 2013", "Texas General Land Office, biographical entry for Jerry Patterson, accessed Sept. 13, 2013", "Telephone interview with Carl Grijalba, traffic manager assistant, KSEV-AM, Houston, Sept. 13, 2013", "Telephone interview with Cody McGregor, campaign manager for Staples, Sept. 13, 2013", "Austin American-Statesman news story, \"Down-ballot candidate knows value of face time,\" Sept. 5, 2005", "National Public Radio news story, \"For Rick Perry, A Restless Life on the Farm,\" Oct. 7, 2011", "Email interview with Chris Elam, campaign manager, Jerry Patterson for Lt. Governor '14, Sept. 13, 2013", "Email interview with Lauren Bean, deputy communications director, Texas Attorney General’s Office, Sept. 13, 2013", "Email interview with RJ DeSilva, spokesperson, Texas Comptroller of Public Accounts, Sept. 13, 2013", "Texas Tribune news story, \"Smitherman announces run for attorney general,\" June 26, 2013", "Texas Railroad Commission website, biographical entry for Christi Craddick, accessed Sept. 13, 2013", "Texas Railroad Commission website, biographical entry for David Porter, accessed Sept. 13, 2013", "Texas Senate, \"Texas Senators 83rd Legislature,\" received Sept. 12, 2013", "Texas House of Representatives, House Chief Clerk’s Office, list of biographical data, received Sept. 11, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]