["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "State Sen. Paul Bettencourt, R-Houston, made a True claim about his move in 2015 stopping a tax hike in 2016 (April 2015 photo, Rodolfo Gonzalez, Austin American-Statesman).", "For almost any elected official, a $100 million item funded by taxpayer money is a big deal.", "So we sat up when state Sen. Paul Bettencourt, R-Houston, took credit for stopping such a Dallas tax hike. Bettencourt said in an Aug. 24, 2016, press release: \"Stopping a $100 million... tax increase will be a record that will stand for some time.\"", "We wondered if indeed a Bettencourt-backed change in law stopped the described hike.", "Bettencourt, who chairs the Senate Select Committee on Property Tax Reform and Relief, said that during the 2015 legislative session, he offered a revision to a measure authored by state Sen. Brandon Creighton, R-Conroe. The adopted tweak, Bettencourt said, imposed a higher voting threshold for \"local taxing units to assess property tax increases in their jurisdictions.\" And, the release indicated, the Dallas school board recently failed to approve the described tax hike because advocates didn’t clear the higher threshold.", "We checked: In 2015, Creighton authored and Bettencourt amended Senate Bill 1760, which was signed into law by Gov. Greg Abbott on June 15, 2015, and became law on Jan. 1, 2016.", "The Texas Association of School Boards spells out how a tax ratification election, or TRE, works: \"Texas law requires school districts to calculate two taxes rates -- the effective tax rate and the rollback tax rate... Generally, if a school board adopts a tax rate above its rollback tax rate, it must hold an election to ratify that rate.\"", "The TASB guidance continues: \"If a majority of the votes cast in the election favor the proposition to approve the rate, then the tax rate for the current year is adopted by the board. If the proposition is not approved, the board may not adopt a rate higher than the rollback rate.\"", "But before the question can get to voters, thanks to the new state law, it takes a 60 percent vote from the school board to put it on a ballot. Voter may then approve the tax increase with a majority vote in an election. Through 2015, state law required a simple majority vote of the school board and voters alike.", "Upshot: Local taxing authorities must secure a supermajority vote, or 60 percent, whereas to adopt a new tax rate higher than its rollback tax rate. Through 2015, state law required only a majority vote of a local board.", "So, what exactly happened in Dallas?", "On Aug. 19, 2016, the nine-member Dallas Independent School Board voted on whether to ask Dallas County residents to consider a 13-cent property tax increase, which supporters said would raise about $104 million to fund early childhood education programs and other initiatives in the district.", "According to a briefing the trustees received that month, the estimated $104 million would have been spent three ways:", "-- $40 million for expanding access to early childhood education, including full-day pre-kindergarten", "-- $32 million for teacher compensation", "-- $32 million for expanding college preparation programs at district high schools", "After the vote, some board members said they remained committed to finding the money elsewhere in the district’s budget.", "\"Our hope is to do our best with the money that we have to expand all three of those programs, but that’s a challenge given that there was $105 million on the table with the TRE that we won’t have access to this year,\" board member Dustin Miller said after the vote. \"We’ll be looking for possible cuts in other areas in order to free up money to fund those programs.\"", "Five trustees voted to put the question on the November 2016 ballot, called a tax ratification election, and four trustees voted against it. The 5-4 vote did not meet the supermajority threshold, per the new law. Residents of Dallas ISD will not see the tax increase question on their ballots in November, and several trustees have said they will go back to the drawing board.", "Miguel Solis, a board member who voted to send the measure to voters, said the new threshold was single-handedly responsible for killing the TRE idea. Voters likely would have approved the tax increase, though it would have been a tight race, he said. \"We discussed (before the board’s vote) whether or not we would be able to pass this thing,\" Solis told us by phone.", "Todd Williams, executive director of Commit! Partnership, said the Dallas district is the only one in North Texas not to achieve the requisite supermajority vote needed under the revised law. He leads a consortium of area business, nonprofits, school districts and foundations who focus on local education issues and who supported the TRE.\n\n\"In the Dallas County area, we’ve seen several districts go for a TRE,\" he said. \"(Commit! Partnership) polled it and it looked like, after we informed voters of the structure and the outcomes, it was going to win about 58 or 59 percent.\"", "Also in August 2016, voters in Frisco rejected a similar 13-cent tax increase in a tax ratification election, but in that case, the school board had a super-majority to send the question to voters. According to a WFAA-TV news story, much of the new revenue would have covered an increase in teacher pay and helped address an estimated $30 million shortfall in the district’s 2017-18 budget.", "Since the law took effect, 33 of the state’s more than 1,000 school boards have cleared the higher hurdle set in place at Bettencourt’s urging and sent the question of a tax increase to voters, according to the education website TexasISD.com. In all but three of those instances -- in the Yantis, Marlin, and Frisco districts -- voters went on to approve the proposed hike, the website said.", "Our ruling", "Bettencourt said a change in law he carried stopped a $100 million tax increase in the Dallas school district.", "You bet your calculator it did though it’s also so that more than 30 other school boards cleared the higher threshold singled out by Bettencourt, each time sending a tax-hike proposal to voters.", "We rate the claim True.", "TRUE – The statement is accurate and there’s nothing significant missing. Click here for more on the six PolitiFact ratings and how we select facts to check.", "https://www.sharethefacts.co/share/22036e8b-2030-4525-a9b0-193d4c953718", "Press release, \"Senate Bill Shown to Save Local Taxpayers $100 Million,\" state Sen. Paul Bettencourt, Aug. 24, 2016", "News stories, The Dallas Morning News, \"With tax hike on shelf, what’s next for Dallas ISD’s efforts in early childhood, early college?\" and \"13-cent Tax Increase Proposal Rejected by Dallas ISD Trustees,\" Aug. 19, 2016", "Enrolled report for Senate Bill 1760, Relating to the transparent and equitable application of ad valorem tax procedures, Texas Legislature Online, July 27, 2015", "Phone interview with Bettencourt, Sept. 16, 2016", "Memo, 2016 Tax Ratification Election Information and Timelines, Texas Association of School Boards, March 2016", "News story, \"Frisco ISD explores cuts after voters reject tax hike,\" WFAA, Aug. 29, 2016", "Blog post, 2016 Texas Ratification Elections, TexasISD.org, Aug. 21, 2016", "Phone interview with Dallas ISD Trustee Miguel Solis, Sept. 21, 2016", "Phone interview with Todd Williams, executive director of Commit! Partnership, Sept. 22, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]