["The misleading Facebook post was published here on September 25, 2019.", "The caption states: “This is what 1 illegal refugee gets with the federal assistance program $3874 per month!!!”", "Below is a screenshot of the misleading post:", "The same image was published on Facebook here, here, here, here and here and on Reddit here with a similar claim.", "AFP analysed the document in the photo and found that although it appeared to be authentic, it does not detail payment to a single refugee. The center top box states, “Family size: 5.” The invoice also details a one-time “Start-up Allowance” which is not paid monthly.", "The first section of the invoice, titled “Start-Up Allowances,” shows assistance totalling Can$1,960. This number refers to a one-time amount that refugees receive upon arrival in Canada. It covers household items, furniture, linens, food staples, winter clothing, a deposit for utilities, phone installation and first month’s rent.", "Below is a chart showing current start-up assistance for all provinces, excluding Quebec, which offers refugees between Can$580 and Can$780, as used furniture and other household supplies are given directly to refugees from in-kind donations.", "This start-up allowance is a one-time payment and does not constitute a monthly source of financial support.", "The monthly benefit provided for one year to refugees includes a basic need allowance, a shelter allowance and a communication allowance.", "Below is a chart detailing the allowances for a single adult in all provinces, excluding Quebec which bases its assistance on its provincial social aid program:", "Each adult also receives a transportation allowance “per the rate of public transit in their community” or of $75 if there is no public transit.", "Other special allowances may apply to families with newborns, women who are pregnant, people with medically verified dietary needs or if funeral/burial costs are needed.", "“Income support for government-assisted refugees is generally provided for up to one year after arrival, or until the refugees become self-sufficient -- whichever comes first,” Nancy Caron, Media Relations Advisor for Immigration, Refugees and Citizenship Canada, the federal agency in charge of refugees, told AFP by email.", "Additionally, many refugees are sponsored privately by organizations or individuals. Sponsors are legally obligated to grant refugees the same amount of income support as the government.", "In 2017, “44,747 people were admitted to Canada as resettled refugees, as permanent residents in the Protected Persons in Canada category or as people admitted for humanitarian and compassionate considerations and under public policies,” according to the 2018 report to parliament on immigration.", "Of this number, the report said 62 percent were privately sponsored and five percent were admitted under the blended visa office-referred program, where financial assistance is shared between the government and private sponsors.", "The Refugee Resettlement Program is a regular source of misinformation, and AFP Fact Check has written about other misleading posts here and here. This invoice also led to misinformation shared by US President Donald Trump about US federal assistance which AFP Fact Check debunked here.", "No single immigrant receives Can$3,874 each month from a federal assistance program in Canada.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]