["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "On July 17, 2016, the day six officers were shot in Baton Rouge, La., Milwaukee County Sheriff David A. Clarke Jr. engaged in a testy interview about police shootings and race relations.", "About 2 minutes in, as the Fox News insider sat side-by-side with CNN anchor Don Lemon at the site of the Republican National Convention, Lemon abruptly went to a commercial as he and Clarke talked over each other.", "Clarke, a conservative who runs as a Democrat, was in Cleveland as a prime-time speaker at the GOP’s convention the following day.", "In the interview, Clarke made a claim about President Barack Obama and the police shooting of civilians during this exchange:", "Clarke: There is no data -- and you know this -- there is no data, there is no research that proves any of that nonsense. None. Even --", "Lemon: You’d have to be more specific about what data and what nonsense you’re talking about.", "Clarke: That law enforcement officers treat black males different than white males in policing in these urban areas.", "Lemon: There is data that supports that.", "Clarke: There is not data.", "Lemon: The president spoke about it. Cedric Alexander, who’s a law enforcement officer --", "Clarke: The president has been lying about it. He said it again the other day, when he said black males are two times more likely to be shot by a law enforcement officer than white males. Don, that is a lie.", "Lemon: That is not a lie.", "So, Clarke makes a two-part claim:", "1. That Obama said black males are two times more likely to be shot by a law enforcement officer than white males.", "Is that what Obama said?", "2. That the figure Obama cited is \"a lie\" because \"there is no data\" to back it up.", "In other words, are black males twice as likely as white males to be shot by police?", "In paraphrasing the president and calling a statistic a lie, even while saying there is no relevant data, Clarke makes a claim that’s on an important topic but in a somewhat muddled way.", "Let’s try to sort it out.", "What Obama said", "Clarke didn’t provide us any evidence that Obama said what he said he did.", "But the White House provided us, and PolitiFact National has annotated, what the president said July 7, 2016 in Warsaw, Poland. Obama spoke days after the fatal police shootings of two African-American men -- Alton Sterling in Baton Rouge and Philando Castile, in Falcon Heights, Minn.", "One statistic the president recited was: \"Last year, African-Americans were shot by police at more than twice the rate of whites.\"", "So, Clarke was slightly off in his paraphrasing. Obama’s reference was to all African-Americans, not just African-American males.", "The statistic", "Now to the second part of Clarke’s claim -- whether it’s \"a lie\" because \"there is no data\" that black males are two times more likely than white males to be shot by a law enforcement officer.", "This is where Clarke goes more astray.", "The sheriff told us through a spokeswoman to \"read Heather Mac Donald's book, War on Cops. It's chock full of data that supports my position.\"", "Mac Donald, a fellow at the conservative Manhattan Institute for Policy Research in New York, told us she didn’t have any statistics on whether black males are more likely to be shot by police.", "Mac Donald did emphasize that how often black males are shot by police should be considered not in terms of what percentage black males are of the total population, but their rates of violent crime, since being involved in violent crime increases the likelihood of being shot by police.", "That view has been advanced by some criminologists. And the Washington Post, in its reporting on fatal shootings by police, has noted that a disproportionate number of murders and other violent crimes are committed by black Americans.", "The Post, which won a 2016 Pulitzer Prize for its work on fatal shootings by police, reported in July 2016 that, taking into account population, black Americans are 2.5 times as likely as white Americans to be shot and killed by police officers.", "(And The Guardian, which tracks people killed by police by shootings or any means, reported that in 2015, black people were killed by police at twice the rate of white, Hispanic and native Americans. )", "But, again, those figures are for fatal police shootings.", "When it comes to the likelihood, by race and gender, of being shot by police, University Louisville criminology and criminal justice professor Justin Nix told us: \"We just don’t have the data to make a statement like that.\"", "Nix and four other criminology and criminal justice professors told us there simply are no national figures on all police shootings.", "Said Samuel Walker at the University of Nebraska at Omaha: \"I’m cautiously optimistic,\" given the attention being paid to police shootings, \"that the FBI will begin collecting the data.\"", "Our rating", "Clarke made essentially a two-part claim. He said that Obama \"said black males are two times more likely to be shot by a law enforcement officer than white males,\" but he was slightly off, in that the president spoke about all African-Americans and whites, not just males.", "Clarke also said the two times more likely statistic is \"a lie\" because \"there is no data.\" He is correct that there is no national data on all police shootings -- fatal and non-fatal -- to back that statistic. But he goes too far in saying it is a lie, given that we don’t know if the statistic is accurate.", "For a statement that contains some element of truth, our rating is Mostly False.", "CNN, Sheriff David Clarke interview (3:40) July 17, 2016", "Email, Sheriff David Clarke spokeswoman Fran McLaughlin,", "Interview, Manhattan Institute fellow Heather Mac Donald, July 21, 2016", "Email, University of South Carolina criminology and criminal justice professor Geoffrey Alpert, July 22, 2016", "Email, University of Missouri-St. Louis criminology and criminal justice professor David Klinger, July 22, 2016", "Interview, University of Louisville criminology and criminal justice professor Justin Nix, July 22, 2016", "Interview, University of Nebraska at Omaha emeritus criminology and criminal justice professor Samuel Walker, July 22, 2016", "Email, City University of New York criminal justice professor Candace McCoy, July 22, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]