["This 45-second footage, which shows Muslims praying in a street, was posted on Facebook on April 10, 2020. It has been viewed more than 7,900 times and shared 190 times.", "The Indonesian-language post translates to English as: “#America Maghrib Prayer", "“A country that is not Muslim majority, when Coronavirus hits… They flocked to Perform prayer in congregation on the street...”", "Below is a screenshot of the misleading post:", "Maghrib prayer is performed by Muslims soon after sunset.", "As of April 16, 2020, the novel coronavirus disease, or COVID-19, has killed at least 26,000 people in the US and infected more than 632,000 others, according to this data from US Centers for Disease Control and Prevention (CDC).", "The Indonesian government said on April 16, 2020, that its COVID-19 death toll has reached 496 and the number of confirmed cases has surpassed 5,500. As a response to the high surge of cases, authorities have moved to restrict public gatherings, including religious congregations like Friday prayers.", "The footage has been viewed nearly 3,000 times after it was shared in other Facebook posts here, here, here and here alongside a similar claim.", "The claim is false. The footage has circulated online since February 2017; it corresponds with other footage in reports about a February 2017 protest in New York City against President Donald Trump’s Muslim travel ban.", "A Google reverse image followed by subsequent keyword search found the same footage published here on YouTube on February 5, 2017, titled: “Muslim praying in New york streets”.", "Below is a screenshot comparison between footage in the misleading post (L) and the YouTube video (R):", "US-based news website HuffPost published a report about the protest here on February 2, 2020, headlined: “Yemeni Bodega Owners Strike, Pray And Protest Trump’s Muslim Ban in New York.”", "The first two paragraphs of the report read: “As the sun set Thursday evening, hundreds of Yemeni bodega owners lined up for prayers outside Brooklyn Borough Hall. An imam’s chants of ‘Allahu Akbar’ filled the air, and the storekeepers alternated between standing and kneeling onto the cold concrete. There was a lot to pray for.", "“President Donald Trump’s ban on immigrants from Yemen and six other Muslim-majority countries has affected some of these bodega owners personally. Some have family members stranded overseas, the U.S. visas they worked so hard to obtain rendered useless.”", "Brooklyn Borough Hall is a historic government building in New York City.", "The HuffPost journalist who reported the rally, Christopher Mathias, also tweeted a 16-second footage of the rally on February 2, 2017, which depicts similar scenes and same locations seen in the misleading clip.", "One of the most powerful demonstrations I've ever seen #bodegastrike pic.twitter.com/NM95aN3irG", "On January 27, 2017, Trump signed an executive order banning citizens of seven Muslim-majority countries from traveling to the US; the seven countries are: Yemen, Syria, Iran, Iraq, Sudan, Somalia and Libya.", "The rally was also reported on February 2, 2017, by Qatar-based media organisation Al Jazeera and British newspaper The Guardian.", "The location of the mass prayer in the YouTube video matches Google Street View images seen around the Brooklyn Borough Hall.", "Below are screenshot comparisons between the scenes in the YouTube video (L) and Google Street View (R), with corresponding features circled in red:", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]