["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Susan Krueger and her granddaughter Annicka Krueger join in prayer during a sendoff ceremony for Wisconsin Army National Guard members in Madison, Wis., on Jan. 4, 2016. The members are part of unit deploying members to Iraq and Kuwait. (Rick Wood photo)", "With the 2016 campaign getting more contentious, Democrat Russ Feingold responded to a question about President Barack Obama's performance on foreign policy by pivoting to his opponent, Republican U.S. Sen. Ron Johnson.", "The question was posed by host Mike Gousha at a Jan. 26, 2016 forum at Marquette University Law School in Milwaukee.", "Feingold, who lost the Senate seat to Johnson in 2010, commented on Obama’s record in the international arena. Then he turned to terrorism, saying \"no one in Washington has taken\" threats from foreign extremists \"as seriously as they should, and now we have to deal with it.", "\"But those who say the way to handle it is to go put 100,000 troops into the area where ISIS is -- which is what Senator Johnson wants to do -- how does this work?\"", "Gousha interjected, saying Johnson has talked about only 25,000 of the troops being American, with the rest coming from an international coalition.", "Feingold responded by asserting that Johnson said there should be 100,000 troops total, including 25,000 Americans.", "So let’s sort out what Johnson has called for.", "Johnson’s general position", "As the Milwaukee Journal Sentinel has reported, Johnson is among the most aggressive voices in his party in proposing a ground invasion to drive the Islamic State of Iraq and Syria out of those two countries.", "As early as October 2014, he called for \"boots on the ground,\" a position in line with that of most of the 2016 GOP candidates for president.", "But Johnson has not been so clear about the numbers of troops.", "Feingold’s evidence", "In backing Feingold’s claim, his campaign spokesman said the former senator was referring to comments Johnson made to Gousha during a television interview in November 2015. The campaign also cited a Huffington Post article about that interview that carried this headline: \"GOP senator wants a coalition of 100,000 troops in Iraq and Syria.\"", "But the headline goes further than what Johnson actually said.", "Here’s the exchange, with Gousha pressing Johnson for a number of American troops:", "Gousha: Senator, you've said on a number of occasions that you favor U.S. troops as part of this coalition going in to these countries to help move ISIS out of its safe areas. How many American     troops would you support sending overseas to accomplish this mission?", "Johnson: Well, I'm not a military expert. The model I use is what George H.W. Bush did when Saddam Hussein went into Kuwait ….", "Gousha: And I know you're not a military guy, but is it 10,000? Is it 20,000? Give us some idea of what you're talking about in terms of an American presence overseas.", "Johnson: I've been told by military experts that ISIS -- in terms, militarily -- is not particularly capable … militarily, it really would not be that difficult. Probably it wouldn't take anywhere near the effort that the first Gulf War did. I've been hearing 25,000 troops, a total coalition of maybe 100,000. I really don't know the exact numbers, but we have to be committed to the goal ….", "So, Johnson didn’t commit to a number.", "And he hasn’t in other interviews.", "The previous month, Johnson said he didn’t know how many U.S. troops would be needed in Syria, although that was in reference to responding to a refugee crisis.", "And the following month, Johnson indicated to the Milwaukee Journal Sentinel he was open to the numbers of American troops that were being discussed. Asked if it would take more than 20,000 to 25,000 U.S. troops to retake and hold the territory now held by ISIS, he responded: \"What’s the alternative? … This is a real and growing threat.\"", "But also in December 2015, Johnson said experts have talked about the need for 10,000 American troops, something he said he would support if Obama committed to an effective strategy.", "In contrast, Republican U.S. senators John McCain of Arizona and Lindsay Graham of South Carolina called specifically for 100,000 foreign troops to fight ISIS in Iraq and Syria. Graham also called for 10,000 American troops.", "Our rating", "Feingold said Johnson wants to put 100,000 troops, including 25,000 Americans, \"into the area where ISIS is.\"", "Johnson favors sending foreign and American troops to Iraq and Syria in an effort to defeat ISIS there. He’s said he has heard experts say the effort would require 100,000 troops, including 25,000 from the United States. He indicated he might support those levels, or perhaps 10,000 American troops, but didn’t go so far as to call for any particular numbers.", "For a statement that is partially accurate but leaves out important details, our rating is Half True.", "Marquette Law School, video (quote at 25:30) of Russ Feingold forum , Jan. 26, 2016", "Email exchange, Russ Feingold campaign spokesman Michael Tyler, Jan. 27, 2016", "Email exchange, U.S. Sen. Ron Johnson campaign spokesman Brian Reisinger, Jan. 29, 2016", "Huffington Post, \"GOP senator wants a coalition of 100,000 troops in Iraq and Syria,\" Dec. 3, 2015", "WISN-TV, U.S. Sen. Ron Johnson interview (quote 6:15), posted Nov. 22, 2015", "Milwaukee Journal Sentinel, \"Terrorism issue a political wild car in Johnson-Feingold race,\" Dec. 13, 2015", "Fox 11 News, \"Feingold, Johnson discuss national security concerns,\" Dec. 14, 2015", "Wisconsin State Journal, \"Ron Johnson: U.S. ground troops needed in Syria,\" Oct. 3, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]