["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Amid tensions between the United States and Iran, posts on social media have said that Iran has placed a large bounty on President Donald Trump.", "\"A bounty of $80 MILLION has been placed on President Donald Trump’s head by Iran as tensions between the country and the USA rise,\" said one representative Instagram post that received more than 380,000 likes as of Jan. 8, two days after it was posted.", "The image was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The post and others like it are based on actual events related to the death of high-ranking Iranian official Qassem Soleimani due to a U.S. drone strike on Jan. 2. However, many of the posts are misleading because they leave out important context.", "Reports of an $80 million bounty stem from remarks at Soleimani’s funeral procession in the northeastern city of Mashhad that were aired on Iranian state television. Footage from state TV, including the remarks in the original Farsi, were tweeted by NBC News Tehran correspondent Ali Arouzi.", "At the funeral procession, which was a highly choreographed, state-run event with a national audience, a speaker called on Iranians \"to donate $1 each in order to gather an $80 million bounty on President Trump’s head,\" Arouzi wrote.", "The population of Iran is a little bit over 80 million, so $1 each would be roughly $80 million.", "There’s a caveat, however. The $80 million bounty was a suggestion by a eulogist at the funeral — not official Iranian government policy.", "We asked Farhad Souzanchi — a Farsi speaker who founded the Rouhani Meter fact-checking website, which covers Iranian politics — to review the video clip from the funeral. Souzanchi said that Arouzi’s summary of the speaker’s words was accurate.", "Souzanchi said the eulogist prefaced his remarks by saying that \"this is a voluntary suggestion from the people of Mashhad on behalf of all Iranians.\"", "While the bounty has made a splash on U.S. social media, Souzanchi, who monitors Iranian media, told PolitiFact that the bounty proposal \"hasn't made much news\" in Iran. He said the speaker, whose identity PolitiFact has been unable to confirm, was not familiar to him either.", "Other Iran experts urged not taking the bounty threat too seriously.", "\"I would not touch it with a 10 foot pole,\" said Mark J. Gasiorowski, a specialist in Iran and the Middle East at Tulane University.", "Arang Keshavarzian, an associate professor of Middle East studies at New York University, said he agrees with Souzanchi that there’s no indication in the Iranian media that the bounty is becoming a serious policy proposal.", "Social media posts have said Iran has placed a bounty of $80 million on Trump’s head. A eulogist at Soleimani’s funeral made this proposal, but there is no evidence that it is something being seriously considered by the Iranian government", "We rate the statement Mostly False.", "Instagram post, Jan. 6, 2020", "Ali Arouzi, tweet, Jan. 5, 2020", "World Bank, world population, accessed Jan. 8, 2020", "Al Arabiya, \"Soleimani funeral procession eulogist puts prize on Trump’s head,\" Jan. 5, 2020", "Business Insider, \"A speaker taking part in Qassem Soleimani's funeral procession said anyone who assassinates Trump should get an $80 million bounty,\" Jan. 6, 2020", "Snopes.com, \"Did Iran Offer an $80 million bounty on Trump’s head?\" Jan. 6, 2020", "Email interview with Farhad Souzanchi, founder of the Rouhani Meter, Jan. 7, 2020", "Email interview with Mark J. Gasiorowski, political scientist at Tulane University, Jan. 8, 2020", "Email interview with Arang Keshavarzian, associate professor of Middle East studies at New York University, Jan. 8, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]