["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Brian Hagedorn (left) and Lisa Neubauer faced off April 2, 2019 for a seat on the Wisconsin Supreme Court. (Handout photo).", "The race between appeals court judges Brian Hagedorn and Lisa Neubauer for a Supreme Court seat started out rather low-key, as some conservative groups that usually spend in high court races did not do so for Hagedorn.", "But the race heated up in the week leading up to the April 2, 2019 election, with an arm of the Republican State Leadership Committee running ads to help Hagedorn.", "The result: One of the closest Supreme Court races in Wisconsin history.", "After the polls closed, Hagedorn held a narrow lead and declared victory. Based on unofficial results, Hagedorn led by about 6,000 votes, or half a percentage point. As of April 5, 2019, Neubauer had not conceded and had not said whether she will seek a recount.", "Meanwhile, the day after the election, the Republican Party of Wisconsin was tweeting congratulatory messages on Hagedorn and about the futility of a recount.", "\"FYI: the last statewide recount in WI was in 2016. After that recount, the vote margin changed by only 131 out of the 2.7 million votes cast.\"", "Counties have until April 12 to report certified totals to the Wisconsin Elections Commission.", "Is the GOP of Wisconsin right about what happened in 2016?", "Trump win prompted recount demand", "In 2016, Green Party presidential candidate Jill Stein sought a recount after Donald Trump became the first Republican presidential candidate to win Wisconsin since 1984.", "Stein received just over 31,000 votes, but was able to force a recount under state law by agreeing to pay the $3.5 million cost.", "The recount prompted Republicans to send to Gov. Scott Walker a bill to tighten Wisconsin recount rules. Under the measure, candidates could request recounts only if they lost by 1 percentage point or less in an election with at least 4,000 votes total. For elections that don't receive that many votes, such as local races, the candidate would need to lose by no more than 40 votes for a recall.", "To be sure, the 2016 recount didn't change the outcome in Wisconsin.", "The original margin between Trump and Clinton was 22,617 votes. After the recount, the margin is 22,748 -- an increase of 131 votes. That’s part of the claim made by the GOP.", "What about the other part -- how many votes were cast in 2016?", "According to BallotPedia, here are the 2016 presidential Wisconsin voting results:", "Donald Trump -- 1,405,284 (Republican", "Hillary Clinton -- 1,382,536  (Democrat)", "Gary Johnson -- 106,674 (Libertarian)", "Jill Stein -- 31,072 (Green)", "Darrell Lane Castle ---12,162 (Constitution)", "Monica Moorehead --- 1,770 (Workers Party)", "Rocky De La Fuente ---1,502 (American Delta)", "Write-in votes --- 35,150", "Total -- 2,976,150", "That’s more than the 2.7 million claimed in the GOP’s tweet.", "Presumably, the 2.7 million figure came from adding Trump’s 1,405,284 votes to Clinton’s 1,382,536, which totals 2,787,820 votes. However, that figure disregards the votes cast for the other presidential candidates, including Stein, the candidate who demanded the recount.", "Our rating", "The GOP of Wisconsin tweeted  \"the last statewide recount in WI was in 2016. After that recount, the vote margin changed by only 131 out of the 2.7 million votes cast.\"", "The vote margin did change by only 131 votes. However, the state GOP slightly undershot the mark with the 2.7 million figure. It was closer to 3 million.", "We rate the claim Mostly True.", "Milwaukee Journal Sentinel \"Brian Hagedorn declares victory in tight Wisconsin Supreme Court race that has both campaigns bracing for a recount, April 3, 2019.", "Associated Press \"Neubauer won’t concede or promise recount,\" April 3, 2019.", "Wisconsin GOP Twitter tweet April 3, 2019", "Milwaukee Journal Sentinel \"Gov. Scott Walker signs bill to tighten Wisconsin recount rules,\" Nov. 30, 2017.", "Milwaukee Journal Sentinel \"Recount confirms Trump’s victory in Wisconsin\" Dec.12, 2016.", "Wisconsin Elections Commission \"Wisconsin recount completed ahead of schedule with relatively small changes to final totals,\" Dec. 11, 2016.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]