["About this rating", "A man who asked for help on a server forum, claiming that he had deleted his entire company with just one line of code, now says the whole thing was a stunt.", "Marco Marsala had originally posted the following plea on a question and answer site for system and network administrators.", "I run a small hosting provider with more or less 1535 customers and I use Ansible to automate some operations to be run on all servers. Last night I accidentally ran, on all servers, a Bash script with a rm -rf {foo}/{bar} with those variables undefined due to a bug in the code above this line. All servers got deleted and the offsite backups too because the remote storage was mounted just before by the same script (that is a backup maintenance script).", "His situation (i.e., that he had deleted all of his serves and backups with an errant rm command) was so awful, and so believable, that his post received widespread attention, particularly from users who pointed out that he was at fault for not properly backing up his files.", "The sudo rm -rf / command is famously destructive, but — happily for Marsala's clients — this particular situation was a hoax.  Marsala admitted to making up the scenario in order to promote his small company, which (naturally) provides outsourced server management services.", "\"It was just a joke,\" Marsala told Italian news outlet La Repubblica (translated):", "The command that I mentioned in the article is harmless but it seems that almost no one has noticed ... With the inaccuracies that are in the online comments I could write a book.", "The Ansible tool prevents these errors. Almost every serious administrator uses it, but among those who answered, no one seemed to know that, otherwise they would know that what I have described could not happen.", "Marsala said he is also working on a \"Unix for Dummies\" book, and that the situation he described actually did happen, but to someone else \"before 2006.\"", "Brooke Binkowski is a former editor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]