["About this rating", "On 25 September 2018, the Babylon Bee website published an article on the notion that former president Bill Clinton had told MSNBC in a recent interview that \"allegations of sexual misconduct should disqualify a man from public office\":", "In the midst of Judge Kavanaugh's ongoing confirmation process, Bill Clinton offered a few words in order to discourage the Senate from confirming the man to the Supreme Court, claiming that \"allegations of sexual misconduct should disqualify a man from public office.\"", "Speaking to an interviewer on MSNBC, Clinton came out swinging, stating in no uncertain terms that \"any single allegation of sexual misconduct should immediately call into question a man's ability to help lead a nation.\"", "Although the disarray into which the Brett Kavanaugh confirmation hearings have been thrown makes it seem as if almost nothing related to those proceedings is too incredible to believe, the words reproduced above were not a statement actually made by Bill Clinton.", "The Babylon Bee is a satirical website that does not publish factual stories. A disclaimer on the bottom of the website reads: \"The Babylon Bee is Your Trusted Source for Christian News Satire.\"", "The Babylon Bee article was published amidst a growing controversy over Supreme Court nominee Brett Kavanaugh after several women stepped forward and accused him of sexual misconduct. The apparent \"joke\" in this piece is that Bill Clinton, who was himself dogged by sexual assault accusations during his presidency, would be hypocritical (or clueless) to make this argument against Kavanaugh.", "Relman, Eliza.   \"These Are the Sexual-Assault Allegations Against Bill Clinton.\"\r\n    The Business Insider.   4 June 2018.", "The Babylon Bee.   \"Bill Clinton: 'Allegations of Sexual Misconduct Should Disqualify a Man from Public Office.'\"\r\n    25 September 2018.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]