["Some Facebook users were recently celebrating an image of an \"official notice\" from Mississippi Gov. Tate Reeves officially ending the state’s face mask mandate — but it’s fake.", "\"This is a formal letter to all of the Residents and Businesses in Mississippi, the beginning of October 2020 the statewide mask requirements will be abolished,\" the letter says. \"Meaning that it will be no longer required to wear them in the state of Mississippi, NO BUSINESS can refuse your entry with out a mask on. All businesses are hereby ordered to take down all facemasks must be worn on or in they establishments. (Signs) This executive order has been Signed and Sealed this 17th Day of September in the Year of 2020.\"", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "That’s because, according to the Mississippi Emergency Management Agency, the notice from the governor is fake.", "\"A ‘letter’ claiming to be from the governor’s office is circulating on social media,\" the agency said in a tweet. \"The letter is FAKE. Find all executive orders posted on the Secretary of State’s website. And any major changes will be addressed in a press conference and an executive order.\"", "On Aug. 4, the governor signed an executive order effective Aug. 5 requiring all residents to wear face coverings in schools, businesses, indoor public spaces, and outdoor public spaces where physical distancing isn’t possible.", "The order was set to expire on Aug. 17, but the governor extended it until Sept. 30.", "Certainly, the state could decide not to extend the mask requirement and residents will be free to not wear masks on Oct. 1. But the governor has made no such announcement, and this letter, as the emergency management agency pointed out, is fake.", "We rate this post False.", "Facebook post, Sept. 26, 2020", "Mississippi Emergency Management Agency tweet, Sept. 27, 2020", "Tate Reeves executive order, signed Aug. 4, 2020", "Mississippi State Department of Health, COVID-19 guidance and prevention for individuals and the community, Sept. 14, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]