["About this rating", "Blowing into a breathalyzer with food on your breath can result in inaccurate readings.", "The ingestion of a hot cross bun would not trigger a false positive if the breathalyzer were used properly.", "On 5 January 2018, the Facebook Page of the Australian trucking company “Pilbara Heavy Haulage Girls Inc.” posted a video alerting viewers that eating a hot cross bun (i.e., a spiced sweet bun made with currants or raisins) could affect the reading of a device commonly used by police to estimate blood alcohol content (BAC) from a breath sample:", "To make this point, the trucker in the video blew into a breathalyzer to produce a 0.000 reading, demonstrating that she had not consumed any alcohol. Then, after taking a bite of the pastry, she blew into the machine again directly after swallowing the food, charting a 0.018 BAC reading.", "Without undertaking any investigative efforts of their own, the UK tabloid The Sun made the unsupported extrapolation that “just two buns would probably produce a result of more than the UK legal limit of 0.08.” Taking this idea one step further, the Daily Mail claimed that “eating just one hot cross bun could get you ARRESTED this Easter.”", "These claims were hogwash in the context of any properly performed breathalyzer test. Professional breathalyzer devices such as the one shown in the above video rely on the assumption that the material being blown through them is 100% alveolar air -- that is, respired air directly from the lungs. A well-established relationship exists between the amount of alcohol in one's blood and the amount of alcohol in respired air from the lungs. The relationship is simple, 1:2100 blood alcohol to breath alcohol content, but that ratio only holds up in the absence of any other source of alcohol that could be introduced into the air blown through the breathalyzer.  Even trace amounts of alcohol in a subject's mouth would adversely affect accurate breathalyzer readings, because the machine uses the 1:2100 conversion ratio for any alcohol it detects.", "“Mouth alcohol” is a well-known complication for breathalyzer tests and can be easily avoided by not eating, smoking, or chewing on anything for 15 to 20 minutes before blowing into the breathalyzer. This is why instruction manuals indicate that the tool should not be used on subjects for 15 to 20 minutes after they've eaten, and it is why law enforcement officers are required, in most jurisdiction, to repeat any tests yielding positive readings again after a 15- to 20-minute waiting period.", "The waiting period evident in this Pilbara Haulage video was roughly one second, meaning any alcohol existing in trace quantities in the food could have been caught up in the demonstrating woman’s breath. Pastries such as hot cross buns would likely have trace amounts of alcohol in them, as yeast converts sugar into carbon dioxide and ethanol, the latter of which would be detected by a breathalyzer.", "Because this alcohol was physically located in the woman’s mouth at the time of testing, however, it was not representative of her blood alcohol content, which would still accurately be described as zero. The addition of more hot cross buns, despite the claims from The Sun, would not increase her blood alcohol content in any way, and a properly administered test, following the appropriate waiting period, would demonstrate this reality.", "Birchall, Guy.   \"How Eating Just Two Hot Cross Buns Could See You Fail a Breathalyser Test.”\r\n    The Sun.   6 January 2019.", "White, Nic.   \"How Eating Just One Hot Cross Bun Could Get You Arrested This Easter.”\r\n    Daily Mail.   5 January 2019.", "Rahman, Mohammad, R. et al.   \"The Application of Power-Generating Fuel Cell Electrode Materials and Monitoring Methods to Breath Alcohol Sensors.”\r\n    Sensors and Actuators B: Chemical.   2 June 2016.", "Taylor, Lawrence, and Steven Oberman.   Drunk Driving Defense.\r\n     Aspen Publishers Online, 2006.   ISBN 0735554293.", "U.S. Federal Motor Carrier Safety Administration.   \"Implementation Guidelines for Alcohol and Drug Regulations - Chapter 7.”\r\n    Accessed 7 January 2018.", "Cauvain, Stanley P. and Linda S. Young.   Technology of Breadmaking.\r\n     Springer Science & Business Media, 2007.   ISBN 0387385657", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]