["Modi: Pehli baat toh main koi padha likha vyakti nahi hoon. Parmatma ki krupa hai aur isiliye mujhe nayi nayi cheezen jaan ne ka bada shauk raha hai. (I am not an educated person. It is due to God’s grace that I have always been curious about knowing and learning new things)", "Reporter: Kitna padhe hain aap? (How much have you studied?)", "Modi: Waise toh maine 17 saal ki ayu mein ghar chhod diya. School ki shiksha ke baad nikal gaya. Tab se lekar aaj tak bhatak raha hoon nayi cheezen pane ke liye. (I had left home at the age of 17. I left after schooling. Since then, I have been wandering in search of new things)", "Reporter: Sirf school tak padhe hain? Matlab primary school tak? (You have studied only till school? Till primary school?)", "Modi: High school tak (Till high school)", "This is the transcript of an interview of Prime Minister Narendra Modi dating back to the time when he was the General Secretary of the BJP in the 1990s. In this interview in the programme ‘Ru-ba-ru’, the reporter Rajeev Shukla asks PM Modi about his educational background, to which Modi gave his response.", "Twitter user @IndurChhugani reshared the video tweeted by @FnbJoe on September 26, 2020. He sarcastically wrote, “Stop saying he never speaks the truth. Retweet – let the world know.”", "Stop saying he never speaks the truth.", "Retweet – let the world know.pic.twitter.com/DI4exyuQhn", "— Indur Chhugani (@IndurChhugani) September 26, 2020", "The same clip has been viral since at least three years.", "The above screenshot of the post is from the public group ‘Bhrashtachar Ka Kaal- Kejriwal’ on Facebook and was shared a whopping 52,000 times. This 30-second clip has been circulating widely on social media across various platforms. We have posted one such clip below, which has been viewed more than 25,000 times on YouTube.", "So, is this video a vindication for those who claim that the Prime Minister has not studied beyond school as he himself claims? Not really, if you consider what PM Modi says next.", "“Baad mein hamare Sangh ke ek adhikari the unke agrah par main external exam dena shuru kiya. Toh Delhi University se maine BA kar liya external exam de kar ke. Phir bhi unka agrah raha toh maine MA kar liya external exam se. Maine kabhi college ka darwaza dekha nahi” (There was a Sangh worker on whose insistence I started giving external examinations. I did BA from Delhi University through external exam. He kept insisting, so I did MA through external exam. I had never seen a college gate.)", "This part begins right where the viral video clip ends. PM Modi goes on to say that he did his BA and MA through external examination. However, this part has been omitted from the said video clip.", "There has been much controversy over Prime Minister Narendra Modi’s educational qualification which remains mired in mystery owing to the difficulty of access with regard to official documents. PM Modi has been accused of fudging his educational qualifications. In 2018, Delhi HC issued notice to Delhi University on the intervention of RTI activists in the matter relating to information about students who passed out of the university in 1978, the year PM Modi claims to have graduated. Delhi University meanwhile had told the court it cannot disclose exam records of students who passed out of the BA course in 1978. Despite the lack of transparency surrounding the PM’s educational qualification, statements made in the video in question were placed out of context.", "Donate Now", "Arjun Sidharth is a writer with Alt News. He has previously worked in the television news industry, where he managed news bulletins and breaking news scenarios, apart from scripting numerous prime time television stories. He has also been actively involved with various freelance projects. Sidharth has studied economics, political science, international relations and journalism. He has a keen interest in books, movies, music, sports, politics, foreign policy, history and economics. His hobbies include reading, watching movies and indoor gaming.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]