["About this rating", "A widely circulated video shows two separate insect lines, one composed of ants and the other termites, in what is said to be a defensive “stand-off.” A caption accompanying the video claims that a \"trail of termites and a trail of ants\" are protected by a row of soldiers in a \"stand-off.\" At the time of publication, the video had been shared to Reddit and received more than 2,000 comments. A Twitter post had similarly garnered more than 40,000 views.", "Snopes spoke with Brian Fisher, an entomologist and ant expert with the California Academy of Sciences, who said that the footage appears to be real, adding that he has observed similar behavior. The video shows “main highways” or “trunk trails” -- the top is the termite highway and the bottom is the ant highway, the latter of which may last for days.", "“For the ants, the highway is used to transport food back to the nest and because these goods are valuable, the trails is protected. In particular, the ants are defending the trail from other predators that may eat the ants or steal the food but also from any disturbance that will disrupt the flow of ants,” explained Fisher.", "“A mess of termites walking through your highway will cause quite a traffic jam and create a costly slowdown.”", "Fisher believes that the ants are Asian marauder ants (Carebara diversa) and that the video was likely filmed in Southeast Asia. Colonies of C. diversa can be made up of 250,000 individuals and contain, among other roles, small workers and larger soldiers, the latter of which have been known to carry their smaller comrades. The termites in the video are thought to be Longipeditermes longipes, a species endemic to Southeast Asia and known for its unique defensive strategy. When a disturbance or threat is perceived, soldier termites will organize themselves into two flanking lanes in defense of an interior center lane, allowing worker termites to continue their tasks.", "“All ants and social insects communicate with chemical ‘words’ called pheromones -- think of it like perfume. For any social system to work, there must be a way to communicate,” said Fisher.", "Ants, termites, and other social insects communicate by way of chemical signals in order to gather food, build their nests, or defend against territorial disputes. Fisher referenced a 2009 report published in Encyclopedia of Insects that describes this behavior as “cooperative defense” to cope with threats. When a threat is recognized, individual ants or termites will discharge a pheromone trail from specialized glands (the exocrine gland in ants and the sternal gland in termites) as they travel from area to area. Not only do these trails allow individuals to communicate within their own species, but those left by other insects will also signal the different scents of competitors.", "Though ants “love” to eat termites, Fisher adds that L. longipes has a “nasty chemical defense,” so the ants keep their distance. Furthermore, the formation of a trunk trail means that the ants are “focused on the commute” and are going back to the nest with collected food.", "Many species of both termites and ants have evolved a suite of unique -- and equally bizarre -- defensive mechanisms to protect themselves. Soldier termites have been known to put their oldest individuals on the front lines when defending against carnivorous ants, found a study published in Biology Letters. As their name suggests, an ant species known as Colobopsis explodens were nicknamed “exploding ants” for their ability to sacrifice themselves during combat by “rupturing their gaster [an abdominal section] and releasing sticky and irritant contents…to kill or repel rivals.”", "Ants have also developed interesting hacks to make their lives easier. Some species have been recorded transporting large millipedes and earthworms by forming chains made of more than 50 individual worker ants. Named for their ability to build nests, African weaver ants bend leaves into place and then bind them together by holding and manipulating silk-producing larvae to “weave” together nests.", "Moffett, M.W.   \"Swarm Raiding in a Myrmicine Ant.\"\r\n    Naturwissenschaften.   1984.", "Moffett, M.W.   \"Foraging Dynamics in the Group-Hunting Myrmicine Ant, Phleidologeton diversus.\"\r\n    Journal of Insect Behavior.   1988.", "Traniello, James F.A.   \"Chapter 219 – Recruitment Communication.\"\r\n    Encylopedia of Insects (Second Edition).   2009.", "Yanagihara, Saki.   \"Age-Based Soldier Polyethism: Old Termite Soldiers Take More Risks Than Young Soldiers.\"\r\n    Biology Letters.   7 March 2018.", "Laciny, Alice.   \"Colobopsis Explodens sp., Model Species for Studies on ‘Exploding Ants’ (Hymenoptera, Formicidae), with Biological Notes and First Illustrations of Males of the Colobopsis cylindrica Group.\"\r\n    ZooKeys.   19 Apr 2018.", "Peeters, C..   \"Predation on Large Millipedes and Self-Assembling Chains in Leptogenys Ants from Cambodia.\"\r\n    Insectes Sociaux.   8 Aug 2015.", "Madison Dapcevich is a freelance contributor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]