["About this rating", "In June 2018, rumors swept social media that Ivanka Trump had adopted the alias \"Adrienne Vittadini\" for her fashion brand:", "Ivanka quietly changed her clothing line to Adrienne Vittadini because of the decline in her sales.", "Trump conveniently made Ivankas clothing line exempt from Tariffs.", "So let's conveniently spread the word so her line completely flops!#AdrienneVittadini #SundayFunday", "— Molly ?♀️ (@Molly3186) June 3, 2018", "The rumor was that Ivanka Trump had completely rebranded her line, often purportedly due to poor sales performance or disinclination on the part of consumers to purchase \"Trump\" branded clothing. Across Twitter, responses to Adrienne Vittadini's account (@AVittadini) suggested that many people believed that the line existed solely as a surreptitious outlet for Ivanka Trump's products:", "@AVittadini\nDon’t be fooled consumers this is @IvankaTrump clothing line! pic.twitter.com/rLfAspeM6x", "— Norma Knudsen (@norma_knudsen) June 3, 2018", "@AVittadini so, are you the new @IvankaTrump brand? Just want to make sure I don’t accidentally buy .", "— Gabby Revilla Lugo (@gabbyrevlugo) June 3, 2018", "However, Adrienne Vittadini was a distinct brand established in 1979 (two years before Ivanka Trump was born) and Vittadini is a real person, not an alias. The claim most often spread without links to any supporting news articles.", "BipartisanReport.com discussed the rumor on 3 June 2018:", "After Donald Trump took over the White House, America wasn’t the only thing he began to destroy… he also destroyed the Trump name quite a lot. For instance his daughter Ivanka had her clothing line pulled from a lot of upscale stores because they didn’t want to sell anything with the Trump name on it. So what was poor Ivanka to do with all those clothes she couldn’t sell? Well it appears that she took the name Trump off of them, and changed the designer name to Adrienne Vittadini and started selling them at discount stores. Further pulling the wool over the eyes of Americans who wanted nothing to do with anything branded with the Trump name.", "That outlet linked to an April 2017 tabloid piece, which in turn was a regurgitation of a 24 April 2017 Business of Fashion article. Originally, the site reported it had \"obtained photos of identical garments being sold at Stein Mart, with the only difference being ... [s]ome say 'Ivanka Trump' while others say 'Adrienne Vittadini.'\"", "But that initial report touched on precisely how Ivanka Trump's line came to be wearing the label of a different designer:", "G-III, the company that owns the right to manufacture and distribute Ivanka Trump apparel through a license agreement — and also owns brands including DKNY outright — acknowledges that it sold the relabelled merchandise to Stein Mart without the knowledge of the Ivanka Trump brand. It is not known whether this inventory was also sold to other retailers.", "“G-III accepts responsibility for resolving this issue, which occurred without the knowledge or consent of the Ivanka Trump organisation,” a representative for G-III said in a statement to BoF. “G-III has already begun to take corrective actions, including facilitating the immediate removal of any mistakenly labelled merchandise from its customer. The Ivanka Trump brand continues to grow and remains very strong.”", "Business of Fashion further explained that relabeling designer brands is a common practice used to insulate the original maker of the garments when those items appear in a market considered less-than-optimal for that label:", "Swiping labels — or simply ripping the label out completely — before a garment is sold to a discount retailer has long been commonplace. One reason is brand protection: if a brand is hot, it’s not desirable to be associated with a discounter. However, this practice occurs less often now that many major full-price retailers — such as Nordstrom, Neiman Marcus and Saks Fifth Avenue — operate their own off-price outlets, marketing the same brands they sell at full-line stores.", "... It could be argued that G-III was simply looking to protect the Ivanka Trump brand from being associated with a discount retailer. In its 2016 fiscal year — which ended at the end of January 2017 — G-III reported that net sales of Ivanka Trump merchandise increased by $17.9 million from 2015, although the company does not break out exactly how much revenue the merchandise generated altogether.", "At the time the story was originally reported, the Guardian briefly touched on the myriad retail-related issues surrounding brands and licensing involved in the story:", "Hmmm. For its part, G-III says Ivanka Trump and her company knew nothing about it. “G-III has already begun to take corrective actions,” it said in a statement, “including facilitating the immediate removal of any mistakenly labelled merchandise from its customer.”", "I see. What does Vittadini say about it? Nothing yet, but she doesn’t own the brand any more, so it probably has nothing to do with her. Authentic Brands, which manufactures under licence from Vittadini, aren’t talking either.", "To understand the relationship between discount stores and designer products and their primary markets (high-end places like Nordstrom, Neiman Marcus and Saks Fifth Avenue, for instance), it is necessary to examine at how those distribution channels acquire their merchandise and stock their shelves. Retailers in that sector operate primarily by absorbing stock that is past-season, excess, or otherwise not selling well in its intended market:", "T.J. Maxx and Marshalls ... buy surplus when a vendor has over-produced, or buy returns when a major department store has backed out of an order. And while department stores return merch to the vendors when they don't sell it, T.J. Maxx and Marshalls buy their merchandise for keeps so they can get goods at a much better price. They also have the power to buy in varying quantities since they can place goods in all stores, or just select stores. This explains why you might find an awesome YSL bag at one store (we saw one trust us) and not at another store.", "Part of the tradeoff for customers is that the \"buy whatever is available\" strategy means that off-price retailers do not try to offer every size and color in every outlet, which limits choice and product availability. But on occasion, designers do intentionally produce excess to supply the off-price market, a practice that is done surreptitiously. Retail blogs surmised that political tensions may have influenced the volume of merchandise landing in stores like Steinmart, but that speculation was formed without any information about whether there was any increase in unsold goods from Trump's line when the story emerged in early 2017. It was equally likely excess products from that line and many others wound up in the hands of bargain hunters in stores like Steinmart in seasons past.", "Vogue UK confirmed that some Ivanka Trump pieces were relabeled under the Adrienne Vittadini brand before they were distributed in Steinmart stores (those respective brands have different distributors). However, it is well established that excess designer inventory is regularly sold off to off-price retailers, and for a variety of reasons.", "Chernikoff, Leah.   \"Inside The World Of Off-Price Retail: We Go Behind The Scenes At Marshalls And T.J. Maxx HQ.\"\r\n    Fashionista.   13 August 2010.", "Conlon, Scarlett.   \"Ivanka Trump Re-Labelled As Different Brand.\"\r\n    Vogue UK.   24 April 2017.", "Howland, Daphne.   \"Report: Apparel Maker G-Iii Quietly Swaps Out Ivanka Trump Labels For Stein Mart.\"\r\n    Retail Dive.   24 April 2017.", "Ragusa, Gina.   \"How Do TJ Maxx And Marshalls Sell Designer Clothes So Cheap?\"\r\n    Mic.   13 November 2017.", "Sherman, Lauren.   \"Amidst Backlash, Ivanka Trump Clothing Is Secretly Relabelled as Adrienne Vittadini.\"\r\n    Business of Fashion.   24 April 2017.", "Steinhauer, Jennifer.   \"At Off-Price Stores, The Thrill Of The Hunt.\"\r\n    New York Times.   21 December 1996.", "Wells, David.   \"Ivanka Trump Caught Shamefully Selling Clothing Under ‘Alias’ Brand Due To Massive Failure.\"\r\n    Bipartisan Report.   3 June 2018.", "The Economist.   \"To The Maxx.\"\r\n    9 January 2016.", "The Guardian.   \"Who Is Adrienne Vittadini – And Why Is Her Name In Ivanka Trump’s Clothes.\"\r\n    25 April 2017.", "Wikipedia.   \"Adrienne Vittadini.\"\r\n    Accessed 4 June 2018.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]