["Pope Francis addressed a joint meeting of Congress on Sept. 24, 2015. (AP photo)", "U.S. Sen. Tammy Baldwin was interviewed on \"The Devil's Advocates\" radio program on Sept. 23, 2015, the day before Pope Francis made his historic appearance before a joint session of Congress.", "The hosts of the Madison-based talk show asked Baldwin, a Democrat, about her expectations for the address. Then they shifted to a bill introduced by Baldwin to get rid of \"carried interest,\" which she describes as a tax loophole that unfairly benefits Wall Street investment managers.", "Host Mike Crute said: \"Tammy, I never thought I would find the day where Donald Trump, the pope and you all agree that the carried interest loophole should be closed. This is contributing to the income inequality we have here in our nation.\"", "Baldwin replied by asking, with a chuckle: \"So which of those three people surprise you the most, in terms of supporting that?\" Crute said: \"I would say Donald Trump, quite frankly. I think he sort of let out the secret.\" Then Baldwin said: \"I’m teasing you, I’m teasing you,\" and Crute continued with serious questions about her proposal.", "A few minutes later, after Baldwin discussed carried interest in detail, host Dominic Salvia asked Baldwin if anyone opposes her proposal.", "Baldwin said: \"Yes, there are people who oppose this change, otherwise it would have probably been law by now. But I do have to just say that I agree with you that when the pope and Donald Trump and Tammy Baldwin all agree on an important tax change, maybe it should be getting swifter consideration than it has gotten to date.\"", "As one wag put it on Twitter: \"That’s one heck of a hot tub.\"", "A spokesman in Baldwin’s office told us the senator was not saying that the pope has endorsed the legislation, and that the conversation was about closing the carried interest loophole and the larger issue of income inequality.", "But she did state that both Trump and the pope agree with her proposal.", "Do they?", "\"Carried interest\"", "\"Carried interest,\" as described by The Wall Street Journal, is a \"much-criticized\" tax break that allows investment managers to treat much of their income as capital gains. That means the money typically is taxed at a lower rate than ordinary wage income. The current capital gains rate for high earners is 23.8 percent, while the top ordinary income tax rate is 39.6 percent.", "Some praise the tax break as a contributor to the growth of the investment management, private equity, real estate and energy industries, and as having had a positive effect on the overall economy and increasing tax revenues.", "Bills to end, or limit, carried interest have passed the House of Representatives four times, most recently in 2010, but died in the Senate, according to the publication Pensions & Investments.", "In June 2015, Baldwin and another Democrat, U.S. Rep. Sander Levin of Michigan, introduced a bill to end carried interest, with Levin saying it was unfair that such higher-income earners paid lower income tax rates than other Americans. The measure would increase tax collections by $15.6 billion over 10 years, according to Congress' Joint Committee on Taxation.", "The effort for repeal got a boost in September 2015, when Obama called for ending carried interest. But a spokesman for U.S. Rep. Paul Ryan, R-Wis., chairman of the House Ways and Means Committee -- where the bill has been referred -- has said the issue should be considered only in the context of comprehensive tax reform.", "So, Baldwin is among a number of Democrats seeking to repeal carried interest. But what about Trump – and the pope?", "The Donald and the pontiff", "It turns out that Trump -- as well as another leading GOP presidential contender, former Florida Gov. Jeb Bush – have called for ending carried interest. Indeed, Democrats have celebrated their remarks.", "In one interview, Trump said: \"I would take carried interest out, and I would let people that are making hundreds of millions of dollars a year pay some tax, because right now they’re paying very little tax, and I think it’s outrageous.\"", "OK. But has Pope Francis stated a position on a tax loophole that most Americans have never heard of? Indeed, it would be rare for the pope to comment on any piece of legislation, much less one dealing with an arcane tax provision.", "Perhaps Baldwin was assuming his support, based on statements that Francis -- who promotes a Catholic church that \"is poor and for the poor\" -- has made about economic inequality.", "For example, in 2013, in the first major work he authored as pope, Francis said:", "\"We can no longer trust in the unseen forces and the invisible hand of the market. Growth in justice requires more than economic growth, while presupposing such growth: it requires decisions, programs, mechanisms and processes specifically geared to a better distribution of income, the creation of sources of employment and an integral promotion of the poor which goes beyond a simple welfare mentality.\"", "But we could not find any instances of the pope speaking about carried interest, let alone Baldwin’s specific proposal. Moreover, his practice is to make broad statements, aimed at global audience, not to comment on one bill in one country. Simply put, there is no way to know based on his general statements whether the pontiff would support any particular legislation.", "Our rating", "Baldwin said: \"The pope and Donald Trump and Tammy Baldwin all agree\" on eliminating the \"carried-interest\" tax break.", "Trump has called for ending the tax break for investment managers that Baldwin is seeking to repeal with a bill she introduced.", "But while Pope Francis has called for helping the poor and addressing economic inequality, we could not find that has spoken out on this particular tax break. And his practice is to make broad policy statements, not to comment on an individual piece of legislation.", "If it turns out the pope has spoken about carried interest, we will review this item, but for now we rate Baldwin's statement Half True.", "Related items", "Matthew Dowd: Pope Francis \"took the name of a saint who basically reached out to Muslims\" (Mostly True)", "Hillary Clinton: Hedge fund managers \"pay less in taxes than nurses and truck drivers\" (False)", "Devil’s Advocates Radio, U.S. Sen. Tammy Baldwin interview (quote at 2:55), Sept. 23, 2015", "Pensions & Investments, \"Joint Committee on Taxation: Ending carried interest will raise $15.6 billion,\" Sept. 17, 2015", "Roll Call, \"Senate Democrats Cheer Donald Trump for Bashing Tax Loopholes,\" Sept. 17, 2015", "Breitbart, \"Trump: Tax carried interest at same rate as income, hedge fund, limited real estate people should pay more,\" Aug. 26, 2015", "Pensions & Investments, \"Lawmakers propose bill to end carried interest,\" June 25, 2015", "\"Carried-interest tax break divides again, after Trump revives the issue,\" New York Times, Sept. 18, 2015", "Forbes, \"What's so awful about the carried interest tax law?\" Sept. 22, 2015", "Wall Street Journal, \"Pope Francis Criticizes Economic Inequality in Mission Manifesto,\" Nov. 26, 2013", "Wall Street Journal, \"Liberal Senators Urge Treasury to Limit Carried Interest Tax Break,\" Sept. 22, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]