["A post by Hope for Nigeria, a Facebook page notorious for the spread of misinformation, claims that Buhari sacked Emefiele and had shortlisted two people from the president’s region as replacement. The post has been shared over 2,500 times.", "A tweet by Jackson Ude, former communications director to ex-president Goodluck Jonathan,  also claimed that Buhari had sacked the CBN governor. It was shared more than 500 times.", "CBN spokesman Isaac Okorafor told AFP late Tuesday that the rumour of the governor's sacking was \"false\". A CBN staff member told us the governor was at the office on Monday discharging his duties, and continued on Tuesday with “a meeting with cotton producers this morning\".", "Buhari’s spokesman Garba Shehu also told AFP \"there is nothing\" to the rumours that Emefiele had been sacked, adding that the posts on social media should be ignored as \"fake news\".", "According to the CBN Act of 2007, Nigeria’s president does not possess the powers to remove the governor of the central bank single-handedly. The president can only remove the CBN governor “provided that the removal of the Governor shall be supported by two-thirds majority of the Senate praying that he be so removed”.", "The Act further clarifies that CBN governor can only be removed if (s)he is running for political office; appointed as a director of any bank; earns or criminal conviction, or \"becomes of unsound mind or, owing to ill health, is incapable of carrying out his duties\".", "Emefiele's current five-year term as governor of the CBN is due to end on June 3, 2019.", "For a person to become the governor of the CBN, (s)he must have been nominated by the president, and approved by the Senate.", "The 2007 act also states that a CBN governor can be re-appointed for a second tenure, which would last another five years. No person can be governor of the CBN for more than two terms.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]