["About this rating", "On 24 July 2017, dubious web site FreedomDaily.com posted a story containing the claim that Rep. Debbie Wasserman-Schultz (D-Florida) had been the subject of a raid by federal officials because of an investigation into her former aide, 37-year-old Imran Awan.", "According to the story, FBI agents \"seized smashed computers and hard drives\" from the lawmaker's home. But the Daily Caller story cited by FreedomDaily.com contradicts that argument, saying that it was Awan — not her — who had lived on the premises:", "FBI agents seized smashed computer hard drives from the home of Florida Democratic Rep. Debbie Wasserman Schultz’s information technology (IT) administrator, according to two sources with knowledge of the investigation.", "The report also describes the site of the alleged raid as \"Wasserman-Shultz’s home that had previously belonged to the Muslim IT administrator,\" but that statement is also debunked by the Daily Caller story, which states that the equipment was reported by an unidentified couple who took over the Virginia home after Awan \"abruptly\" moved out in February 2017:", "One of the new tenants — a Marine Corps veteran married to a female Navy Officer — said he found “wireless routers, hard drives that look like they tried to destroy, laptops, [and] a lot of brand new expensive toner.”", "The tenants called the Naval Criminal Investigative Service and, not long after, FBI agents arrived together with the Capitol Police to interview them and confiscate the equipment. The Marine spoke on condition of anonymity because of concerns for his wife’s naval career, saying she doesn’t want to be associated with a national security incident.", "“It was in the garage. They recycled cabinets and lined them along the walls. They left in a huge hurry,” the Marine said. “It looks like government-issued equipment. We turned that stuff over.”", "We contacted not only the FBI, but Capitol Police and the U.S. Attorney's office for the District of Columbia, all of whom refused to comment on whether any hard drives had been taken from Awan's former home. Awan was arrested on 24 July 2017 at Dulles International Airport in Virginia while trying to leave the U.S. He was fired from Wasserman-Schultz's office the following day.", "Wasserman-Schultz terminated Awan's employment months after he and his wife, Hina Alvi, were fired by two of Wasserman-Schultz's colleagues, Rep. Marcia Fudge (D-Ohio) and Rep. Gregory Meeks (D-New York), respectively.", "Awan was accused of providing false information to the Congressional Federal Credit Union while seeking a loan. He pleaded not guilty to one count of bank fraud, and was released on the condition that he wear a GPS monitor, turn over all of his passports, remain within 50 miles of his current home, and abide by a curfew.", "A grand jury indicted Awan and Alvi on 17 August 2017 on charges of bank fraud, conspiracy to commit bank fraud, engaging in unlawful monetary transactions, and making false statements on a loan or credit application.", "Awan is due back in court on 21 August 2017 for a preliminary hearing. The couple and three other men — Awan's relatives Abid Awan and Jamal Awan and Rao Abbas — have been under investigation by Capitol Police since February 2017 for allegedly stealing equipment from various House Democrats and misuse of the House's internet technology system.", "Rosiak, Luke.    \"EXCLUSIVE: FBI Seized Smashed Hard Drives From Wasserman Schultz IT Aide’s Home.\"\r\n   Daily Caller.    23 July 2017.", "Bowden, John.   \"Wasserman Schultz Staffer Arrested Trying to Leave the Country.\"\r\n   The Hill.    25 July 2017.", "Caygle, Heather.    \"House Democrats Fire Two IT Staffers Amid Criminal Investigation.\"\r\n    Politico.    1 March 2017.", "Caygle, Heather.    \"House Staffers Under Criminal Investigation For Alleged Equipment Theft.\"\r\n   Politico.    2 February 2017.", "Noted indictment on 17 August 2017 of Imran Awan and Hina Alvi.", "Arturo Garcia is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]