["About this rating", "In mid-October 2018, Facebook users shared an inaccurate meme asking \"Were any of you aware that ALL the Democrats voted AGAINST the 2.8% Social Security cost of living increase?\":", "No Democrats, or any other legislators for that matter, voted for or against the 2.8 percent cost of living allowance (COLA) increase that Social Security recipients will see beginning in 2019. Since 1975, COLA increases have kicked in automatically and are based on changes in the consumer price index, a figure calculated by the U.S. Bureau of Labor Statistics.", "Here's how the Social Security Administration has summarized the history of COLA increases:", "Most people are aware that there are annual increases in Social Security benefits to offset the corrosive effects of inflation on fixed incomes. These increases, now known as Cost of Living Allowances (COLAs), are such an accepted feature of the program that it is difficult to imagine a time when there were no COLAs. But in fact, when Ida May Fuller received her first $22.54 benefit payment in January of 1940, this would be the same amount she would receive each month for the next 10 years. For Ida May Fuller, and the millions of other Social Security beneficiaries like her, the amount of that first benefit check was the amount they could expect to receive for life. It was not until the 1950 Amendments that Congress first legislated an increase in benefits. Current beneficiaries had their payments recomputed and Ida May Fuller, for example, saw her monthly check increase from $22.54 to $41.30.", "These recomputations were effective for September 1950 and appeared for the first time in the October 1950 checks. A second increase was legislated for September 1952. Together these two increases almost doubled the value of Social Security benefits for existing beneficiaries. From that point on, benefits were increased only when Congress enacted special legislation for that purpose.", "In 1972 legislation the law was changed to provide, beginning in 1975, for automatic annual cost-of-living allowances (i.e., COLAs) based on the annual increase in consumer prices. No longer do beneficiaries have to await a special act of Congress to receive a benefit increase and no longer does inflation drain value from Social Security benefits.", "The latest increase will affect 62 million Social Security and Supplemental Security Income (SSI) recipients starting in January 2019. It's the largest increase since 2012, when beneficiaries saw a 3.6 percent boost.", "Konish, Lorie.   \"Your Social Security Check Will Get a 2.8% Boost in 2019.\"\r\n    AL.com.   16 October 2018.", "Social Security Administration.   \"Historical Background and Development of Social Security.\"\r\n    Accessed 17 October 2018.", "Social Security Administration.   \"Social Security Benefits to Increase in 2019.\"\r\n    11 October 2018.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]