["“BREAKING: US Military at the White House Arresting Congress,” reads the headline of a January 28, 2021 article.", "“Special Operations (SOF) units including 4,000 deputized National Guard soldiers acting as US Marshals, have served indictments on, or were about to arrest 67% of Congress. Early Mon. morning 25 Jan,” the first paragraph reads.", "Later that same day, the US House of Representatives formally charged Donald Trump with inciting the storming of the Capitol, triggering the first-ever impeachment trial of a former president.", "The story with the arrest claims was published by “Newsview” from an apparently Greek domain. The “About” page for the site does not describe the organization, but is instead made up of filler content.", "Videos shared on Facebook here and here and on video hosting site BitChute here repeat and spread the claims made in the article.", "Contrary to the claims circulating online, Congress continues to function normally, and there have been no reputable reports of a mass arrest of legislators.", "All 100 members of the Senate voted on January 26, while 426 out of a possible 435 members of the House of Representatives took part in a vote on February 2.", "Hundreds of Trump supporters forced their way into the US Capitol building on January 6 in a riot sparked by false claims of election fraud, temporarily disrupting the certification by Congress of Joe Biden’s 2020 victory.", "The National Guard was called up during the unrest, and reinforcements later came in from across the United States, bringing their numbers to more than 25,000 before Biden’s inauguration on January 20. About 7,000 Guard troops will remain in Washington until roughly mid-March.", "Wayne Hall, a spokesman for the National Guard, told AFP over the phone, “The National Guard that are on the mission to support DC are doing so in support of local and federal law enforcement agencies. They’re not operating on their own... The Guard is not the lead in DC.”", "US Marshals Service spokesman Drew Wade said in an email: “No specially deputized National Guard members have executed any arrests in Washington, DC. Further, the arrest of a member of Congress would fall outside the scope of the authority granted by special deputation to a National Guard member.”", "Drew Hammill, deputy chief of staff for Speaker of the House Nancy Pelosi, who leads the House of Representatives, called the claim “false” in an email.", "Senate Majority Leader Chuck Schumer’s office also said by email that the claim is false.", "One line in the article appears to connect it to QAnon, a far-right movement claiming -- among other conspiracy theories -- that former president Donald Trump waged a secret war against a global liberal cult of Satan-worshipping pedophiles.", "“When it was over and seemingly on Q, fireworks lit up the sky,” the article reads.", "QAnon has spread from the fringes of social media to the mainstream, thanks to posts with global reach on platforms such as Facebook and Instagram. Followers of QAnon were among those who joined the deadly January 6 attack on the Capitol.", "The story also asserts that Trump invoked the “Insurgency Act,” an apparent reference to the Insurrection Act, and that the US has been operating under martial law since January 9, despite no such reports in “mass media.”", "AFP Fact Check has debunked the false Insurrection Act claim here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]