["About this rating", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "On Feb. 17, 2021, long-time radio personality Rush Limbaugh died at the age of 70 after battling lung cancer. In the wake of his death, various quotes from his life on the airwaves were shared on social media. One such claim was that Limbaugh said that the novel coronavirus was nothing more than \"the common cold.\"", "The claim was shared in multiple tweets on Twitter. It was also shared on Facebook.", "It's true that Limbaugh said: \"Yeah, I'm dead right on this. The coronavirus is the common cold, folks.\" The quote was from Feb. 24, 2020.", "A transcript from part of \"The Rush Limbaugh Show\" on Feb. 24 was headlined: \"Overhyped Coronavirus Weaponized Against Trump.\"", "RUSH: Folks, this coronavirus thing, I want to try to put this in perspective for you. It looks like the coronavirus is being weaponized as yet another element to bring down Donald Trump. Now, I want to tell you the truth about the coronavirus. (interruption) You think I’m wrong about this? You think I’m missing it by saying that’s… (interruption) Yeah, I’m dead right on this. The coronavirus is the common cold, folks.", "The Drive-By Media hype of this thing as a pandemic, as the Andromeda strain, as, “Oh, my God, if you get it, you’re dead.”", "He also added: \"Be very leery of this, folks. It probably is not what the media's leading you to believe it is.\"", "On March 9, U.S. President Donald Trump compared influenza to coronavirus. The tweet read:", "So last year 37,000 Americans died from the common Flu. It averages between 27,000 and 70,000 per year. Nothing is shut down, life & the economy go on. At this moment there are 546 confirmed cases of CoronaVirus, with 22 deaths. Think about that!", "He compared the COVID-19 pandemic to the flu once again months later. These two tweets were somewhat similar to Limbaugh's claim about the common cold.", "On March 12, Limbaugh said that \"the one thing missing in all of this panic-driven coronavirus news\" was \"the number of deaths in the United States!\" At the time, around 39 people were reported to have died of COVID-19 in the U.S. The headline of the transcript was: \"Why Isn’t the Coronavirus Death Toll the Big Story?\"", "However, this was misleading. News organizations were indeed reporting death numbers.", "On March 7, an NBC News story said that 19 people had died in the U.S. A CBS News article that was originally published on March 9 cited 26 deaths. CNN reported 38 deaths on March 11. On March 12, ABC News published a story that mentioned 40 deaths.", "From the first U.S. death on Feb. 6, 2020, and moving more than 12 months later, the COVID-19 pandemic has shown that the virus was far more deadly than the common cold or influenza.", "On Feb. 17, 2021, Johns Hopkins University of Medicine reported that the U.S. was preparing to surpass 500,000 deaths from the COVID-19 pandemic.", "Jordan Liles is a Senior Reporter who has been with Snopes since 2016.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]