["An example of the misleading claim about Bayles’ age, alongside a video of him holding Australian dollars, was published on Twitter here on February 22, 2020.", "The tweet reads: “Quaden Bayles aka the ‘9 year old’ who was supposedly a bully victim is a FAKE. He’s really an 18 year old rich influencer.”", "Below is a screenshot of the misleading post:", "Bayles, an indigenous boy from Brisbane, Australia, made global headlines after his mother, Yarraka Bayles, published footage of him crying and expressing suicidal thoughts after being bullied, AFP reported on February 21. A copy of the now-deleted video is viewable here on YouTube.", "The video caught the attention of celebrities and athletes, resulting in US comedian Brad Williams to start a GoFundMe campaign that raised more than $470,000 to fund a trip to Disneyland in California, USA, as reported here by AFP on February 27. Bayles was also invited to lead the National Rugby League’s (NRL) Indigenous All Stars team onto the field before a match in Queensland on February 22.", "A photo of Bayles and others encased in an “18th birthday” frame appeared to add fuel to a conspiracy that he was in fact 18-years-old. The claim was made on Twitter here, here, here and here.", "Multiple imposter Twitter accounts under Bayles’ name have also been created. One account claimed he was 27-years-old, while others described him as a “true finesser” and an “actor”.", "Other claims accusing Bayles of being a con artist have been viewed hundreds of thousands of times on YouTube here, here, here and here. Similar claims have also circulated in Spanish, for example here and here.", "The claims are misleading.", "On February 22, 2020, Bayles’ aunt, Mundanara Bayles, clarified on Facebook that the photo of Bayles’ in an “18th birthday” frame was taken at the birthday party of her son, Garlen. An archived version of the photo shows that the frame reads “Garlen’s 18th Birthday”.", "Mundanara and Bayles are also seen in this YouTube video, which Mundanara says was filmed before the NRL match on February 22. At the 33-second mark, Mundanara asks: “Are you 18?” Quaden replies: “No, I’m nine.”", "In 2015, Australian broadcaster Network 10 described Quaden as a four-year-old boy from Brisbane who had helped raise awareness about dwarfism.", "In this programme by Australian broadcaster SBS first shown in 2015, Quaden's date of birth was broadcast on a hospital screen after a scan.", "\"Quaden Bayles, four, is only 65 centimeters, the size of a six-month-old baby, \" the report entitled 'Living Black' begins.", "At the minute 20-minute 53-second mark in the video, a doctor shows a scan of Quaden's head to his mother. In the top left-hand corner of the hospital screen, his full name (Quaden David Bayles) and his date of birth, December 13, 2010, are visible.", "Below is a screenshot of the hospital screen at this point:", "Digital footprints for Bayles' family are consistent with him being nine years old.", "In May 2014, Yarraka posted this photo of Bayles on Facebook alongside the caption: “Quaden Jnr 3 y.o with achondroplasia”.", "Achondroplasia is the most common form of dwarfism, according to Mayo Clinic.", "Mundanara posted another screenshot of a 2014 photo of Bayles from Yarraka’s now-deactivated Instagram account that is captioned: “Quaden Junior 3 y.o”.", "Photos of Bayles posted to Facebook and Instagram in 2012, 2013, 2015 and 2016 by one of his sisters, Guyala, also show the boy’s growth from a baby to a toddler.", "Other screenshots of photos from Yarraka’s Facebook, which is now mostly private, that show Bayles as a baby in 2011 can be seen here and here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]