["The photo was shared on Twitter here on January 13, 2020, one day after the Taal volcano began emitting billowing clouds of ash.", "Below is a screenshot of the misleading post:", "The post’s caption reads: “I live near Tagaytay area & friend of mine from Manila keep asking me last night to evacuate and go their place. My reaction was “I can’t leave my 4 dogs” PLEASE PEOPLE IF YOU ARE GOING TO EVECUATE BRING YOUR PETS WITH YOU!!!", "#TaalVolcano #PrayForPhilippines #Taal”.", "Tagaytay is a city that sits on a ridge overlooking Taal.", "Tens of thousands of people living in areas near the volcano have been forced to flee since Taal began spewing ash and lava on January 12, 2020, with many abandoning their livestock and pets, AFP reported here.", "Reactions to the tweet suggest many thought the photo of the dog was taken in the aftermath of Taal’s eruption.", "One angry comment states in a mix of Tagalog and English: “This is heartbreaking!!! There really are people who would put themselves first & have the audacity to leave pets/animals behind. Those people are infuriating!!!”", "Another comment states: “OK, now I won’t sleep worrying about this dog. What is wrong with people? Dogs wouldn’t leave us behind.”", "A third reaction reads: “DID SOMEONE SAVE THIS DOG? PLEASE. ANYONE?”", "Below are screenshots of the comments:", "The same photo of the ash-covered dog was also shared in several other Twitter posts about Taal, for example here and here.", "But the photo is being shared in a misleading context; reverse image searches on Yandex found that the photo was taken in May 2016 in Indonesia and was originally published here by Anadolu Agency (AA), a Turkish news agency.", "Below is a screenshot of the AA photo:", "The photo’s caption reads: “KARO, INDONESIA - MAY 22 : An injured dog covered in volcanic ash crouches down in an empty village after it was abandoned following the eruption of Mount Sinabung at the Gamber Villages, in Karo, North Sumatra, Indonesia on May, 22. 2016. At least seven people were killed and two other were seriously wounded after Mount Sinabung volcano in North Sumatra province of western Indonesia erupted on Saturday, disaster agency official said here. ( YT Haryono - Anadolu Agency )”.", "Below is a screenshot comparison of the photo in the misleading post (L) and the AA photo (R):", "The photo is accurately captioned in this report by the Daily Mail, a UK-based publication.", "On Facebook, the photo was also shared alongside images of an ash-covered cat and fowl in this misleading post, which does not explicitly mention Taal but was published on January 13, 2020.", "Reverse image and keyword searches found that the photo of the cat was in fact taken by Reuters in 2008 following a volcano eruption in Chile.", "The photo of the ash-covered fowl appears to have been taken in the Philippines after the Taal eruption and was shared on Twitter here by MovePH, the civic engagement arm of Philippine news organization Rappler, on January 13, 2020.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]