["About this rating", "On 25 June 2018, the entertainment Facebook page \"The Last Line of Defense\" posted a meme with the claim that a little boy named \"Basil Karlo\" was expelled from his elementary school after he dressed up as United States President Donald Trump for his school's \"Superhero Day\":", "This is a real photograph of a young child dressed up as Donald Trump, but the accompanying backstory about the expulsion of the student was completely made up. The Last Line of Defense is an \"entertainment\" page that frequently posts memes in an attempt to troll its viewers:", "Nothing on this page is real. It is a collection of the satirical whimsies of liberal trolls masquerading as conservatives. You have been warned.", "[...]", "Good Old Fashioned Liberal Troll Provided Fantasy presented as comedy to the left and a social experiment to the right. Please don't hurt the Trumpanzees. they'll be gone in a few years back to the shadows from whence they came and we'll be back to trolling Tea Turds.", "Another clue that this meme is relaying a fictitious incident is also an Easter egg for graphic novel fans. The child's alleged name — Basil Karlo — is the alter ego of DC Comics villain Clayface.", "The real story behind the photograph is still a bit unclear, but the image has been around since at least October 2015, when Donald Trump was still a reality television show host who had just announced he was a presidential candidate. It was likely taken for Halloween of that year (not a school's superhero-themed day), as it was included in an article from Huffington Post about mini-Trumps who would \"make Halloween great again.\"", "Samakow, Jessica.   \"10 Mini Donald Trumps Who Make Halloween Great Again.\"\r\n    Huffington Post.   26 October 2015.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]