["About this rating", "In November 2019, some social media users reported their cameras were being opened in the background while they scrolled on the mobile Facebook application. One Twitter user, for instance, posted a video that supposedly showed the security/privacy issue:", "Found a @facebook #security & #privacy issue. When the app is open it actively uses the camera. I found a bug in the app that lets you see the camera open behind your feed. Note that I had the camera pointed at the carpet. pic.twitter.com/B8b9oE1nbl", "— Joshua Maddux (@JoshuaMaddux) November 10, 2019", "Another person on Twitter also found that his phone's rear camera (the selfie lens) was opened when he browsed on the mobile app:", "Facebook app on iOS 13.2.2 opens my phone’s rear camera when I open a profile photo swipe down to return (look at the little slit on the left of the video). Is this an app bug or an iOS bug?? @facebook @AppleSupport pic.twitter.com/WlhSXZulqx", "— Daryl Lasafin (@dzlasafin) November 10, 2019", "Several tech websites have since picked up on these tweets and have published reports on these privacy concerns.", "Here's a run-down of the issue from CNET:", "When you're scrolling through Facebook's app, the social network could be using your camera, concerned users have found. Multiple people have found and reported that their iPhone cameras were turned on in the background while they were looking at their feed.", "The issue came to light through several posts on Twitter. Users noted that their cameras were activated behind Facebook's app as they were watching videos or looking at photos on the social network.", "After people clicked on the video to full screen, returning it back to normal would create a bug in which Facebook's mobile layout was slightly shifted to the right. With the open space on the left, you could now see the phone's camera activated in the background.", "Guy Rosen, the vice president of integrity at Facebook, confirmed on Nov. 12, 2019, that there was indeed a bug on some versions of the Facebook iOS app that was causing the camera to inadvertently open. Rosen said Facebook found no evidence that any videos or photographs were uploaded due to this bug and said the company had submitted a fix to the app store:", "We recently discovered our iOS app incorrectly launched in landscape. In fixing that last week in v246 we inadvertently introduced a bug where the app partially navigates to the camera screen when a photo is tapped. We have no evidence of photos/videos uploaded due to this.", "We’re submitting a fix for this to the App Store today.", "Ng, Alfred.   \"Facebook Bug Shows Camera Activated in Background During App Use.\"     CNET.   12 November 2019.", "The Next Web.   \"Facebook is Secretly Using Your iPhone’s Camera as You Scroll Your Feed.\"\r\n    12 November 2019.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]