["The photos appear in multiple posts including this one published on Facebook on February 29, 2020. It has been shared more than 600 times.", "The post’s caption partly reads: “Kudos to our Gallants at Maimalari Barrack Checking Point for napping Boko Haram members who confidently disguised as UN officials trying to sneak into Maiduguri (sic)”.", "Boko Haram, which loosely translates as “Western education is banned”, has attacked communities in Nigeria’s volatile northeast region including Maiduguri, in a bid to create a hardline Islamic state, as reported by AFP.", "The post claims that the purported Boko Haram terrorists, who were allegedly apprehended by Nigerian troops, had attempted to move into Maiduguri using UN-branded vehicles.", "One of the images shows a man in a jacket with an inscription of the UN World Food Programme, on his knees while a uniformed individual holding a firearm points directly at his face. Another photo shows at least eight people wearing similar UN jackets and lying prone on the ground.", "The photos were also shared with a similar claim in other social media posts, including here, here and here on Facebook, and here and here on Twitter.", "‘Real-life’ training scenarios", "The claim is false; the pictures show a training session on counterterrorism between Nigerian troops and a team from the United Nations Department of Safety and Security at Maimalari military base in Maiduguri.", "Unlike reports published here and here on the insurgency, there were no news stories by March 12, 2020, in the mainstream media recording the claimed apprehension of Boko Haram fighters.", "“It is not true,” confirmed the UNFPA spokeswoman in Nigeria, Kori Habib. She told AFP that 29 UN staff working in Nigeria’s northeast region participated in the \"SSAFE training\" on February 27, 2020.", "“The security training is done within the real-life scenarios; we are trained to get familiar with the surroundings, things that are happening, and how to take care of ourselves,” she explained.", "Multiple reverse image searches on Google found this Facebook post of a press release by the Nigerian army denying the claim. The post included other images that appear to have been taken before the simulation exercise started.", "The army statement allayed fears of a Boko Haram takeover and said the training session was a joint exercise between the UN's security experts and selected members of Nigeria’s Theatre Command Operation Lafiya Doyle, the name of the mission dedicated to eradicating the terrorist group.", "We have highlighted similarities between the drill photos and the army’s publicity shots to show it was indeed a training session.", "Contacted by AFP, army spokesman Colonel Sagir Musa confirmed he issued the press statement to refute the social media claims. “This is not true, it was just a training exercise,” Musa said in a phone call.", "Unidentified video", "A Twitter search conducted for the other images of white vehicles that feature in the post led to this tweet shared alongside a video. The 27-second footage shows the feet of a uniformed person walking towards the vans.", "He says: \"This is the cars Boko Haram disguised themselves as UN operation officers and entered into the Maimalari Barracks, as you can see, they are all painted UN clearly but they are all fakes (sic).\"", "Keyframes of the clip show the video was indeed shot at the same spot with viral images.", "However, AFP has so far been unable to verify the source of the video. The army has not issued an official statement regarding the clip.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]