["The photo, which was posted in this Facebook group on July 29, 2020, shows a woman in an office with the Ethiopian flag in the background. “Sudanese people will now pour all the water they have in their fridges into the dam for the new Ethiopian ambassador to Sudan,” reads the English translation of the Arabic caption.", "The claim appears to make a tongue-in-cheek reference to the controversial Grand Ethiopian Renaissance Dam.", "The dam on the Blue Nile has been a source of tension between Ethiopia, Egypt and Sudan, as AFP has extensively reported including here.", "Ethiopia's downstream neighbours worry the dam will restrict vital water supplies. They are especially concerned about what might happen should there be a drought while Ethiopia is still filling the reservoir, a process that will take several years.", "The false Facebook claim was also shared here, here, here and here, referencing the woman's looks and the Nile.", "“Feel free to take the whole Nile,” read one comment. “Take our water, we don’t want to drink,” said another. Others said that it was a “great thing to have young officials, better than the older ones in our government”.", "Not the ambassador", "But the claim is false. In reality, the photo shows Ethiopian actress and former beauty queen Hanan Tarik.", "A reverse image search led to an Instagram post on Hanan’s official account explaining that she had signed a deal to promote a cosmetics brand.", "“Today I'm honored to announce that I have signed with NHY to be the brand ambassador for one of the leading import and export companies in Ethiopia to represent internationally recognized brands like M.A.C. Cosmetics and DIAGEO” wrote Tarik.", "The current Ethiopian ambassador to Sudan is Yibeltal Aemero who assumed diplomatic duties in Khartoum on July 23, 2020.", "The embassy shared a post about his appointment on its official Facebook page.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]