["By Lori Robertson and Robert Farley", "Posted on May 12, 2016", "Donald Trump said “there’s nothing to learn” from his tax returns, but experts say there’s plenty to learn from presidential candidates’ tax returns, including sources of income, effective tax rates, charitable giving habits and more.", "Unlike many other 2016 presidential candidates, Trump hasn’t released his tax returns and says he won’t until a government audit is finished. Republican 2012 nominee Mitt Romney has called for Trump to release them, saying that it’s “disqualifying for a modern-day presidential nominee to refuse” to do so.", "Every major party nominee since the late 1970s has released tax returns before Election Day.", "When Trump was asked about releasing the returns at a February presidential debate, he said, “You don’t learn anything from a tax return,” a claim he repeated this week in an interview with the Associated Press.", "Associated Press, May 11: “There’s nothing to learn from them,” Trump said. He also said he doesn’t believe voters are interested.", "“Now, I hope [the audit] gets finished soon. And if it gets finished soon, I put it out immediately because there’s nothing there. But until you get finished, you won’t,” he said.", "He similarly said on NBC’s “Meet the Press” on May 8 that “you don’t learn much from tax returns.”", "But voters learn several pieces of information from candidates’ tax returns.", "Roberton Williams, the Sol Price fellow at the nonpartisan Urban-Brookings Tax Policy Center, told us that there are three things we could learn from Trump’s tax returns: details about where he gets his income and how much it is; “how he’s structuring his income for tax purposes”; and what kind of deductions he takes, including charitable giving. If Trump had overseas income or foreign bank accounts, for instance, that information would be on his tax return.", "Jeremy Scott, editor in chief of the commentary and analysis products for the nonprofit Tax Analysts, told us in a phone interview that it was “strange for Trump to say you don’t learn anything,” when just four years ago, Romney’s effective tax rate, revealed through his tax returns, was a significant issue. (In fact, Romney’s 14 percent effective tax rate in 2010, due to most of his income coming from dividends and capital gains, became fodder for Obama campaign attack ads.)", "Scott told us that ever since President Richard Nixon released his returns in 1973, the candidate’s returns have been “a form of checking on how a candidate conducts his financial affairs.” Conflicts of interest can be exposed, as well as how a candidates’ individual tax policy squares with his proposals.", "President Franklin D. Roosevelt, said Scott, pushed the idea of paying your fair share, but his returns — released by his presidential library after he was in office — show he was “actually very aggressive at trying to minimize his own taxes.”", "The Tax Analysts’ Tax History Project is compiling an online archive of candidates’ returns. Project Director Joseph J. Thorndike wrote in a May 12 blog post on taxnotes.com that beyond an effective tax rate, “[r]eturns can shed light on the way a candidate lives his life. It can tell us about charitable giving as well as personal borrowing and investment activity. Returns can also illuminate the complicated business arrangements that often provide the bulk of a candidate’s income, especially for a real estate mogul like Trump.”", "And the returns also “tell us a lot about how candidates conduct themselves in the gray areas of the tax law,” Thorndike wrote. “Some items on a tax return are black and white, like the income reported on a W-2. But other items, especially for someone with lots of non-salary business income, are open to debate and interpretation.”", "Trump’s comments also prompted Time magazine to outline “5 Interesting Things We Learned From Presidential Tax Returns,” including: Obama gave sizable charitable contributions to his controversial pastor; Romney had an unusually high IRA balance; and President George H.W. Bush gave nearly 62 percent of his 1991 income to charity.", "Justin Wolfers, an economics and public policy professor at the University of Michigan, wrote in a May 11 piece in the New York Times that without the returns, voters are left to make their own inferences as to why Trump won’t release them. By releasing them, voters may learn that Trump isn’t hiding something that’s worse than what’s actually there.", "In other words, if “there’s nothing to learn,” voters would, in fact, learn that.", "“This explains why candidates like Mitt Romney and Hillary Clinton were willing to release their returns, despite revealing useful ammunition for their opponents,” Wolfers wrote. “In each case, it was a savvy choice, because not revealing would have led voters to infer they were hiding something worse.”", "If Trump does not release his tax returns prior to the November election, he would be the first major party nominee not to do so in decades.", "In 1976, Gerald Ford released a summary of his tax returns, rather than the complete tax returns.", "“Every other major party nominee since then has released complete tax returns: not just summaries, not just a Form 1040, but the whole thing,” Thorndike, director of the Tax History Project, told us in an email. “That’s been standard practice and that’s what voters have come to expect.”", "Of the remaining Democratic presidential candidates, Hillary Clinton has released the last eight years of full returns, posted on her website, and Bernie Sanders has released one year.", "On May 11, Romney posted a message to Facebook calling Trump’s refusal to release tax returns “disqualifying.”", "Romney on Facebook, May 11: It is disqualifying for a modern-day presidential nominee to refuse to release tax returns to the voters, especially one who has not been subject to public scrutiny in either military or public service. Tax returns provide the public with its sole confirmation of the veracity of a candidate’s representations regarding charities, priorities, wealth, tax conformance, and conflicts of interest. Further, while not a likely circumstance, the potential for hidden inappropriate associations with foreign entities, criminal organizations, or other unsavory groups is simply too great a risk to ignore for someone who is seeking to become commander-in-chief.", "Romney then went on to suggest that the only “logical explanation” for Trump’s refusal is that his returns contain “a bombshell of unusual size.”", "Romney, May 11: There is only one logical explanation for Mr. Trump’s refusal to release his returns: there is a bombshell in them. Given Mr. Trump’s equanimity with other flaws in his history, we can only assume it’s a bombshell of unusual size.", "It is perhaps ironic that Romney is suggesting — without any evidence — there may be a “bombshell” in Trump’s tax returns. In 2012, then Senate Majority Leader Harry Reid made the unfounded claim that an anonymous source told him Romney hadn’t paid any taxes for 10 years. He called on Romney to release tax returns prior to 2010 to prove him wrong.", "Romney released his 2010 tax returns in January 2012, and he released his 2011 tax returns in September 2012 (when he said they were finally completed). Romney said he would not release any more than those two years, arguing that he was only following the “precedent” set by Sen. John McCain in releasing just two years of tax returns. As we wrote in July 2012, Romney was correct about the number of returns released by McCain, but we noted that McCain, the 2008 GOP nominee, bucked the trend of other recent presidential candidates.", "As we noted then, in more than three decades, no other nominees for either party have released fewer than five years’ worth of returns.", "https://www.sharethefacts.co/share/da45f26b-4cea-4353-9e55-6d5e0e03d359", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]