["Two photographs are viral on social media with the claim that Assam Congress leader ‘Amjad Ali’ was arrested with arms and bullets in his possession. The first image is of a man handcuffed and standing next to police officials, the second image shows hand grenades and bullets in a bag. The pictures were shared by one Sanjeev Saraswat on Facebook, drawing over 3,500 shares.", "#कोंग्रेस_का_आतंकियों_के_साथ☹️ असम का कोंग्रेसी नेता #अमजत_अली सेब की पेटी में हथियार और गोलियों के साथ हिरासत में लिया…", "Posted by Sanjeev Saraswat on Sunday, 5 September 2021", "The same images were shared earlier in June.", "कांग्रेस का पंजा…आतंकियों के साथ! pic.twitter.com/5iWu6aESY8", "— सी बी पंजाबी (@cbpunjabi) June 15, 2021", "They were widespread on Facebook.", "In fact, the pictures were also being shared last year.", "#असम के #कांग्रेस नेता अमजात अली 🐷सेब 🍎की पेटी में #हथियार और #गोलियां के साथ हिरासत में। काफिरो को मारने का कर रहा था प्लान। पुलिस ने दबोचा। इनकी पूरी तैयारी है जागो हिंदुओ जागो… :@TEJSHAH9 #जागो_हिन्दू_जागो#Powerfull_Twitter_Army pic.twitter.com/dD2IG7JGd3", "— 🇮🇳TEJ SHAH(હિંદુ)🇮🇳 (@TEJSHAH9) November 3, 2020", "Alt News found that the images have been circulating online at least since 2018 with the identical claim. But both images are from unrelated incidents from two years ago. It is noteworthy that we were unable to find any references to an Assam Congress leader named ‘Amjad Ali’. There is a TMC leader from West Bengal with a similar name but he is not the man in the viral picture.", "Image 1", "Alt news performed a reverse search on Google and found a 2018 news blog that carries the image of the man in handcuffs. According to the blog, the person was arrested in Mymensingh district, Bangladesh on charges of sexually harassing a minor girl who later died by suicide. On further searching with Bangla keywords ‘ময়মনসিংহের মেয়ে আত্মহত্যা, যৌন হয়রানির মামলা’, we were led to a report by Bangladesh-based Somoy News, which said that the incident took place in Mymensingh’s Trishal Upazila. The name of the accused was Mubarak Hussain. He was arrested by police on charges of sexual assault. The girl later hanged herself to death.", "A comparison of the uniforms worn by the policemen in the picture and photos of Mymensingh police confirms that the incident is from Bangladesh.", "Image 2", "A reverse image search of the second picture took us to an October 29, 2018 tweet by Jammu and Kashmir police. It said that three suspected militants were arrested on the outskirts of Srinagar. The police recovered arms and ammunition in their possession.", "A brief exchange of fire on the outskirts of Srinagar city. Three suspected militants arrested among them one is injured.Arms and ammunition recovered. Investigations started. pic.twitter.com/lT9AoRnu5H", "— J&K Police (@JmuKmrPolice) October 29, 2018", "According to a Greater Kashmir report published on October 30, 2018, “Jammu and Kashmir Police on Monday claimed to have arrested three suspected militants after a brief shootout near Noora Hospital on the outskirts of Srinagar city.”", "Therefore, images from two different incidents, one from Bangladesh, were shared with the false claim that a Muslim leader from Assam Congress was caught with arms and ammunition.", "Donate Now", "Aqib is monitoring and researching mis/disinformation at Alt News", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]