["Multiple Facebook posts, like this one shared more than 1,300 times since August 1, 2020, make various claims about Microsoft founder Bill Gates, who is a regular target of conspiracy theorists because of his hefty donations to global healthcare projects over the years.", "The posts claim that Gates “added a sterilization formula to every single vaccine for the last 10 years”, an allegation that the World Health Organization purportedly admitted in court.", "The posts also claim that in 2017, the WHO purportedly blamed Gates for an “explosion” in the number of polio cases around the world.", "Contacted by AFP Fact Check, the WHO rejected both claims.", "WHO spokesman AbdelHalim AbdAllah said the organisation “was not involved in any past nor ongoing cases of that sort”.", "Africa was declared free of wild poliovirus in August 2020, a landmark in a decades-long campaign to eradicate the disease.", "“This historic public health achievement would have never been possible without maintaining vigilant polio disease surveillance and maintaining good vaccination coverage using the oral polio vaccine,” AbdAllah said.", "AFP Fact Check found various other claims about Gates in an Instagram post by prominent anti-vaccine campaigner Robert Kennedy Jr. -- who is also the nephew of former US president John F. Kennedy.", "According to Kennedy's multi-slide post, Indian doctors blame Gates -- whose eponymous foundation has pledged $100 million to buy eventual Covid-19 vaccines for low-income countries -- for a polio epidemic that “paralyzed 496,000 children between 2000 and 2017.”", "However, as we explain in a previous debunk, official statistics show only a tiny number of cases in which the oral polio vaccine directly resulted in Indian children contracting the disease.", "India was declared polio-free in 2014, three years after its last case of wild polio.", "There still exists a version of the illness known as vaccine-derived polio, which occurs in rare cases when the weakened virus in the vaccine mutates in areas with low vaccination coverage.", "According to the WHO, there were 17 cases of vaccine-derived polio in India between 2000 and 2017, with 15 in 2009 and two in 2010.", "It's not the first time Bill Gates has been targeted by misinformation around polio. AFP Fact Check has previously reported on social media posts accusing him of forcefully vaccinating Africans against the disease or even plotting to kill them.", "India kicked out Gates Foundation?", "Another claim made by Kennedy -- picked up by Facebook posts here and here -- is that the Indian government “dialed back Gates’ vaccine regimen and evicted Gates” from the country’s National Advisory Board, which advises the prime minister on policy, in 2017.", "As previously verified by AFP Fact Check, the Indian government rejected media reports in 2017 suggesting that health-related collaboration with the Bill & Melinda Gates Foundation had been stopped.", "The Gates Foundation “continues to collaborate and support the Ministry of Health and Family Welfare”, the Indian government said at the time.", "And in September 2019, Indian Prime Minister Narenda Modi said the Gates Foundation was doing “important work” in India.", "Gates Foundation forcibly vaccinated African children?", "Kennedy's post also claims that the Gates Foundation forcibly vaccinated “thousands of African children against meningitis” and that “between 50 and 500 children developed paralysis” from the MenAfriVac vaccine.", "Launched in 2010, the meningitis vaccine -- the first made specifically for use in Africa -- has been administered to more than 300 million people across the continent.", "The Gates Foundation has rejected these claims. Contacted by AFP Fact Check, a spokesperson said that the foundation “does not itself deliver vaccines”. They said organisations such as the WHO, UNICEF and local aid groups deliver vaccines.", "According to the US National Institute of Health's Fogarty International Centre, the MenAfriVac programme cut cases of meningitis A from over 250,000 during an outbreak in 1996 to just 80 confirmed cases in 2015.", "AFP Fact Check ran a Google search for the keywords “children paralysed MenAfriVac” and found a report, ‘Communication Challenges During the Development and Introduction of a New Meningococcal Vaccine in Africa’, published in 2015 on the website of the US government’s National Center for Biotechnology Information (NCBI).", "According to the report, a vaccination campaign in Gouro, Chad was abruptly stopped in 2015 when vaccinated children reportedly fell ill.", "A local journalist reported that 40 children had become “severely ill” -- some with paralysis -- in a news story that was promptly picked up by international media and anti-vaccine activists.", "“Chadian authorities invited an international team of clinicians and epidemiologists to investigate the problem. An investigation proceeded; all cases were examined by physicians, who did not find cases of paralysis, and all of the affected individuals recovered without incident,” the report says.", "“The episode was determined to be 'mass psychogenic illness' — an unusual phenomenon that has been well described, the affected tending to be clusters of young girls with unusual clinical findings that gradually improve.”", "Medical journal The Lancet reviewed the vaccine administration in Chad and concluded it was “highly effective”.", "Kennedy also claims that the Gates Foundation-funded tests of experimental HPV vaccines on 23,000 girls in India committed ethical violations, and has a case before the Indian Supreme Court.", "AFP Fact Check found that the Gates Foundation indeed funded HPV vaccine projects for developing countries, including India. In India, seven girls died during vaccine trials, as reported in the local media and by the academic journal Science Magazine. However, further study revealed that the girls’ deaths were not vaccine-related.", "“Five were evidently unrelated to the vaccine: One girl drowned in a quarry; another died from a snake bite; two committed suicide by ingesting pesticides; and one died from complications of malaria,” Science Magazine reported.", "The cause of deaths for the two other girls was less certain, according to government investigators who traced all seven deaths. This was also reported by The Lancet medical journal.", "The trials were halted, and the Indian government set up a committee to investigate. It concluded that there were some irregularities in the administration of the vaccines. It claimed that the Gates-funded Programme for Appropriate Technology in Health (PATH) opened an office in India “without getting the required mandatory approvals/permissions” and “exploited with impunity the loopholes” in the Indian system.", "PATH, the global health nonprofit in charge of the vaccination process, did not agree with the conclusions of the committee. “PATH is committed to meeting the highest scientific, ethical, and legal standards,” the nonprofit said.", "Kennedy also claimed “Indian government found Gates-funded researchers committed ethical violations, pressuring vulnerable village girls into the trial, bullying parents, forging consent forms, and refusing medical care to the injured girls”.", "The claims are exaggerated; the Indian government reviewed the process and published its conclusions here. There are no records of bullying, pressuring village girls, or refusing medical care. The government, however, said the organisations in charge of the vaccinations violated some ethical standards.", "Kennedy also claims that South African newspapers said “we are guinea pigs for drugmakers” and that South African geopolitics professor Patrick Bond called Gates “ruthless” and “immoral”. Bond indeed criticised Gates' methods in global philanthropy in a 2016 article, but AFP Fact Check found no public record of him describing Gates as ruthless or immoral.", "The Times Live in South Africa did write an article to say South Africans were used as guinea pigs by drugmakers. The newspaper was reporting an allegation by Dutch NGO Wemos. There was no mention of the Gates Foundation.", "Gates raised polio vaccine doses to 50 per child?", "The Instagram post further claims that Gates took control of India's National Advisory Board (NAB) and mandated “50 polio vaccines (up from 5) to every child before age five”. This is misleading.", "The Gates Foundation did not mandate the use of 50 polio vaccine doses for children in India. According to the WHO, the use of fractional doses, which was introduced in India in 2016, could raise the number of fractional doses in a vial to 50 -- not the number of doses to be taken by a child.", "“When a vial intended for full-dose vaccination is used to deliver fractional doses, the number of doses it contains increases by a factor of five: a vial containing 5 or 10 full doses becomes a 25- or 50-fractional-dose vial, respectively,” WHO said in one of its bulletins published in February 2019.", "Due to a global shortage of inactivated poliovirus vaccine, WHO’s Strategic Advisory Group of Experts on Immunization -- not the Gates Foundation -- recommended that countries with good immunisation coverage consider administering fractional doses, as they have the resources to ensure the close monitoring of patients that this method requires. According to the WHO, India was the first country in the world to introduce fractional-dose inactivated poliovirus vaccine into its immunisation programme in 2016.", "The post alleged that “in 2010, Gates committed $10 billion to the WHO promising to reduce population, in part, through new vaccines”. It added that “a month later Gates told a Ted Talk that new vaccines ‘could reduce population’”.", "It also claimed that Kenya's Catholic Doctors Association accused the WHO in 2014 of chemically sterilising “millions of unwilling Kenyan women with a phony ‘tetanus’ vaccine campaign”.", "These allegations are either false or taken out of context.", "In 2010, the Gates Foundation indeed pledged $10 billion to increase vaccination rates among children.", "During a TED Talk in February that year, Gates spoke about reducing global population growth by 10 or 15 percent thanks to new vaccines, improved healthcare and comprehensive reproductive health services.", "In 2009, he recommended developing vaccines to reduce child mortality rates. He argued that increasing the chance of a child surviving to adulthood and encouraging parents to have smaller families that would benefit from government resources would create “a virtuous cycle” to take “a country out of poverty.”", "Gates has said that having many children can be seen by parents as a way to offset high child mortality, and that if they were sure their children would survive, they would have fewer children.", "The claim about sterilising Kenyan women using a tetanus vaccine has been dismissed by Kenyan authorities and the WHO. The UN health agency says the vaccine is safe.", "This claim has been extensively debunked by AFP Fact Check here.", "Kennedy also claimed that the Gates Foundation funded a trial in 2010 of an experimental malaria vaccine by British pharmaceutical giant GlaxoSmithKline. The post says the drug killed 151 African infants and caused “serious adverse effects including paralysis, seizure, and febrile convulsions to 1,048 of the 5,049 children”.", "While the malaria vaccine was being trialled between 2009 and 2014, the WHO said the known side effects “include pain and swelling at the injection site, and fever”.", "It acknowledged that “the vaccine is associated with an increased risk of febrile seizures within seven days of the administration”.", "But in the final trial phase, known as phase three, “children who had febrile seizures after vaccination recovered completely and there were no long-lasting consequences”, the WHO said.", "There is no evidence to support Kennedy’s claims about the malaria vaccine. More about the vaccine trials can be found here and here.", "In Africa, misinformation portraying vaccines as harmful or even part of a plot to kill black people have fuelled a mistrust of western medical research, as AFP Fact Check investigated here.", "Citing a study by Morgensen et.al., 2017, Kennedy claims that the WHO’s Diphtheria, Tetanus and Pertussis (DTP) vaccine is killing more people than the diseases it is meant to prevent. He also says that the Gates Foundation and WHO refused to recall the vaccine.", "AFP Fact Check found that this claim has been around for about 20 years. Multiple studies funded and co-funded by the UN health agency in four countries do not back up the claim.", "“All the studies show reduced mortality rates in the children vaccinated with all of the vaccines. In particular, the studies showed no negative effect of DTP vaccination,” WHO said in a statement released in 2002 after the claims began making the rounds.", "The Gates Foundation has rejected all the above claims, stating that “the foundation does not develop or manufacture vaccines”.", "“We are concerned about the conspiracy theories being spread online and the damage they could cause to public health,” its spokesperson told AFP Fact Check.", "“At a time like this, when the world is facing an unprecedented health and economic crisis, it’s distressing that there are people creating and sharing misinformation when we should all be looking for ways to collaborate and save lives.”", "The foundation said it has never had to answer to a court case involving the WHO.", "While the foundation funds WHO, the spokesperson said it only funds initiatives “authorised by the [194] member states” that the global health body answers to.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]