["Matt Flynn, a Democratic candidate for governor, was a longtime top attorney for the Archdiocese of Milwaukee. (Milwaukee Journal Sentinel)", "At a debate for the Democratic candidates for governor, the first question posed to attorney Matt Flynn was about his work defending the Archdiocese of Milwaukee in pedophile priest cases.", "\"I was not part of transferring anybody,\" Flynn told the audience in Madison on Aug. 8, 2018, six days before the primary election.", "Eight Democrats are competing for the right to take on GOP Gov. Scott Walker in the fall. Citing the priest cases, Walker has called on Flynn to drop out of the race.", "For years, accused Catholic priests were routinely transferred from one parish or school to another, and many of them continued molesting children. Certainly, transfers were actually ordered by the archdiocese, not by lawyers such as Flynn who were retained by the archdiocese.", "But was Flynn, whose campaign has been dogged by questions about the priest scandal, involved in those transfers?", "Flynn represented the archdiocese from 1989 to 2004 and was heavily involved in priest abuse cases.", "Like us on Facebook. Follow us on Twitter: @PolitiFactWisc.", "The history", "Earlier on the day of the debate, Milwaukee Journal Sentinel investigative columnist Daniel Bice posted a column about Flynn’s work. The article detailed cases indicating Flynn, to some extent, was part of the transfers:", "Informed of Adamsky transfer: In an August 1992 letter, the vicar for clergy in the archdiocese contacted Flynn about the transfer of Father Raymond Adamsky in response to allegations of abuse. A bishop \"suggested that I send a copy of the new assignment for Fr. Ray Adamsky for your records,\" the letter said. \"We hope this will be satisfactory to all involved. Thanks for meeting with us. It was good to have an update on everyone.\" Adamsky was transferred 11 times during his work for the church.", "Flynn’s campaign told Bice the meeting was not about Adamsky's transfer, but about legal claims regarding Adamsky and others.", "In any case, Flynn was at least aware of the transfer.", "All our fact checks in the governor’s race.", "Lawyers involved: Adamsky had his ministry restricted by a bishop in 1991, but was allowed to continue to serve as priest at the church and have access to its school. Church officials removed Adamsky from the parish in 1992 after two more children complained to their principal about the priest's \"rough physical contact\" with the pair.\n\nThe archdiocese's website says: \"Negotiations between lawyers took place about what kind of assignment would be agreeable, and it was determined that chaplain work at a retirement home would be possible.\"", "So, Flynn was not named, but he was a key attorney for the archdiocese at the time.", "Another meeting: In a case involving a different priest, Father Mike Krejci, Flynn is listed in court records as being in a November 1994 meeting with Krejci, the archbishop and other archdiocese officials. Krejci had just been accused in a letter from another priest of sexually abusing a child.", "Flynn’s campaign told Bice the records do not indicate that the meeting involving Flynn had to do with a reassignment of Krejci. The decision regarding the priest's future was made at a meeting the next day, without Flynn in attendance, the campaign contended.", "So, here, too, Flynn is centrally involved in a priest case and attended a meeting about one of the accused priests the day before the priest’s transfer.", "Response from Flynn", "For this fact check, Flynn campaign manager Bryan Kennedy told us that despite the documents cited in Bice’s column, there are no letters from Flynn \"directing the archbishop to transfer priests nor are there directives or memos that Matt signed off on that would show his approval or collaboration in making decisions about transfers.\"", "Fair enough. But it’s also clear Flynn was heavily involved in cases where accused priests were transferred.", "Our rating", "Flynn says he was \"not part of transferring\" any priests accused of sexual abuse.", "There is no evidence to show that Flynn advised the archdiocese to transfer priests accused of molesting children to different parishes.", "But Flynn was a top attorney for the archdiocese during a period of years when a number of such transfers were done, and he had at least some involvement with cases in which accused priests were transferred.", "We rate Flynn’s statement Half True.", "JSOnline, video of Democratic gubernatorial candidates debate (21:45), Aug. 8, 2018", "Milwaukee Journal Sentinel, \"Bice: Democratic candidate Matt Flynn's statements on pedophile priests undermined by 1992 case,\" Aug. 8, 2018", "Email, Matt Flynn campaign manager Bryan Kennedy, Aug. 8, 2018", "Email, Wisconsin Republican Party spokesman Alec Zimmerman, Aug. 9, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]