["About this rating", "On 6 October 2018, a Twitter user with the handle \"@lookitsSammm\" posted the following message to her 297 followers:", "The tweet was posted the same day Judge Brett Kavanaugh's nomination to the Supreme Court was confirmed by the U.S. Senate. Kavanaugh's contentious nomination was thrown into partisan chaos when three women publicly accused him of sexual misconduct during his high school and college years. Kavanaugh denied all allegations in Senate Judiciary Committee hearings that were punctuated by protests and sharply-divided public opinion.", "Although the tweet and the account to which it was posted have both been deleted, cached versions were still viewable as of 9 October 2018, as were numerous angry responses in what became an Internet firestorm. Social media users posted screen captures of the message and also an image of a woman and name they claimed to be the one responsible for authoring the tweet:", "No arrests have been made and no person has been officially identified by authorities in connection with the tweet, but the person who posted it was employed by Intermediate School District 917 in Rosemount, Minnesota, as a paraprofessional. That person voluntarily resigned after being placed on administrative leave as a result of the post, according to Superintendent Mark Zuzek:", "On Sunday, October 7, 2018, the district began receiving complaints regarding an employee. The actions of the employee did not occur at school, and there were no school devices, equipment, or other school staff involved in the actions. At no time were students or staff in danger. The employee was placed on paid administrative leave and an investigation conducted.", "The Dakota County Sheriff's Office posted a statement declaring that the Federal Bureau of Investigation (FBI) was aware of the post and would follow up as necessary, while local television station WCCO reported the FBI was investigating the matter:", "The Federal Bureau of Investigation (FBI) is also aware of the incident and will follow up as appropriate.Please contact District Superintendent Mark Zuzek at 651-423-8229 for further questions relating to the school district’s involvement in the matter. (2/2)", "— Dakota County SO (@DakotaMNSheriff) October 8, 2018", "Rosenberg, Eli.   \"A Teacher’s ‘Kill Kavanaugh’ Tweet Gets Her Placed on Leave.\"\r\n   The Washington Post.   8 October 2018.", "Chapman, Reg.   \"Rosemount Paraprofessional Placed on Leave Following ‘Kill Kavanaugh’ Tweet.\"\r\n    WCCO.   8 October 2018.", "Golden, Erin.   \"Rosemount Educator Resigns After 'Kill Kavanaugh' Tweet.\"\r\n    Minneapolis Star Tribune.   9 October 2018.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]