["Actor Rupa Dutta wrote a Facebook post accusing filmmaker Anurag Kashyap of sleazy behaviour in 2014. She shared screenshots of a purported chat where a man named ‘Anurag Safar’ is expressing how he is attracted to married women. Ghosh claimed that Kashyap used to run a Facebook ID by that name. The allegation comes in the wake of actor Payal Ghosh accusing the director of sexual assault which were denied by him.", "नमस्कार दोस्तो 🙏🙏", "यह वो समय है 2014 में जब मैं अनुराग कश्यप से बाते करती थी। फेसबुक में अनुराग सफ़र से इसका आईडी है।…", "Posted by Actor Rupaa Dutta on Saturday, 19 September 2020", "Dutta has made a similar post on Twitter where she identifies as the state president of Karni Sena, West Bengal.", "अनुराग कश्यप के नज़रों में किसी भी औरत का कोई इज्ज़त नहीं है।जो मुझे उसे जानने के बाद पता चला।इसीलिए पायेल घोष का इल्ज़ाम बिलकुल सही है।अनुराग कश्यप को कठोर से कठोर सज़ा मिलनी चाहिए।और यह ड्रग भी लेता है।अपने आर्टिस्ट को भी सप्लाई करता है NCB जांच करे कृपा।#arrestanuragkashyab pic.twitter.com/ckK5ZfUDOW", "— Rupa Dutta (@iamrupadutta) September 19, 2020", "Soon after, she was invited for an interview on News Nation where the actor claimed that Kashyap consumes drugs and supplies them to his artists. Dutta demanded that the Narcotics Control Bureau (NCB) takes cognisance of the same. The drug allegations were levelled as the Indian film industry undergoes a drug probe sparked by Sushant Singh Rajput’s suicide.", "News Nation invited Dutta on another show anchored by Deepak Chaurasia where the actor said she has never met Kashyap in person and the Facebook chat is the basis for her accusations.", "Dutta’s conversation with a man named Anurag ‘Safar’ raised doubts about her allegations.", "A Facebook search of ‘Anurag Safar’ led us to the man’s profile where the same display picture has been used. A rummage through his profile revealed that he lives in Ireland.", "We also found Anurag Safar’s Twitter handle where several posts from his Facebook account have been cross-posted. In 2010, he tweeted that he isn’t filmmaker Anurag Kashyap. “I am another Anurag. Please do not bug me considering him.”", "Pl Excuse me friends!!! I am not film director or producer Anurag Kashyap. I am another Anurag. Please do not bug me considering him.", "— Anurag Safar (@anurag_safar07) September 15, 2010", "He had also denied the same on Facebook in 2016.", "Over the years, several people have confused Safar with Kashyap. In February 2010, a Facebook page tagged Safar instead of the director. Another user, while praising a movie, tagged Safar. Readers should note that hovering the cursor over the tag ‘Anurag Kashyap’ throws up Safar’s profile. This is because Safar used to run his account with the last name ‘Kashyap’.", "This slideshow requires JavaScript.", "In 2011, a Twitter handle had tagged Safar in a post about Kashyap’s movie ‘Chittagong’.", "We found that on Twitter as well, Safar used to operate with the surname ‘Kashyap’. His username was @anuragkashyap07 at least till October 2009. He later changed it and clarified in a tweet that he isn’t the director.", "Alt News contacted Anurag Kashyap who denied the accusation and said that his verified personal Facebook account has the username ‘anuragkashyap1972’.", "Rupa Dutta, therefore, shared screenshots of her 2014 conversation with a man named Anurag Safar. While she claimed that director Anurag Kashyap used to run his account by that surname, the fact of the matter remains that Safar was the one operating both his Facebook and Twitter accounts with the surname ‘Kashyap’, and he had clarified back in 2010 that he’s not director Anurag Kashyap.", "Donate Now", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "Amid the ongoing Israel-Palestine conflict, media outlet Times Now put out a report claiming that…", "A 45-second video clip is being shared widely on social media where a group of…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…"]