["About this rating", "On March 6, 2020, U.S. President Donald Trump traveled to Tennessee to meet with local officials, residents, and first-responders as he surveyed the damage from a deadly tornado that killed at least 25 people statewide. The following day, a rumor holding that Trump had pulled out his personal checkbook during this visit to give money to tornado victims started to go viral on Facebook:", "This Facebook post was shared close to 20,000 times within a few days of its initial posting. The text of the message was also copied and pasted by several additional social media accounts. The copypasta text reads:", "So Trump comes to Nashville to oversee damage from the tornado. He flies into the area in a helicopter to get there without further traffic problems in the city. He writes PERSONAL checks to those in need, with his personal accountant in tow. No other President in history has done this. Then, he poses beside a Jeep. Now let’s hear all those Cherokee owners gawk!!!", "There is no evidence to support these claims. We have not encountered any news articles about Trump writing personal checks to tornado victims, nor any videos or photographs capturing such a moment.", "Furthermore, this post claims that Trump had his \"personal accountant in tow\" during the visit. But that doesn't appear to be the case. Trump was accompanied on his trip to Nashville with members of the state's delegation, including Republican Senators Marsha Blackburn and Lamar Alexander, but we found no mentions of an \"accountant\" tagging along on this trip. Trump's \"personal accountant\" likely refers to Allen Weisselberg, the Trump family's longtime accountant and the current chief financial officer of The Trump Organization, but Weisselberg did not accompany Trump on this trip to Tennessee.", "The Facebook post also gets details about Trump's method of travel wrong. While Trump did take Marine One, the presidential helicopter, to get an aerial view of the damage and to travel to Cookeville, Tennessee, he actually traveled to Nashville via Air Force One.", "A photograph supposedly showing Trump in Nashville after he \"got his check book out and just started writing\" was also spread on social media:", "This photograph, however, does not show Trump during his visit to Nashville in March 2020. This image actually comes from Trump's trip to Alabama in March 2019 after a tornado left 23 people dead. Contemporary news reports made no mention of Trump writing personal checks to to tornado victims during this trip, either.", "It should be noted that Trump has donated his presidential salary to various causes since he took office. While the Trump administration has made public announcements concerning these donations, no such statement has been released about Trump allegedly writing personal checks to tornado victims in Nashville. In March 2020, it was announced that Trump would be donating to the Department of Health and Human Services To help \"confront, contain, and combat coronavirus.\"", "We reached out to the White House and Kirby Pearce, the apparent author of the viral Facebook post, for comment. We will update this article if more information becomes available.", "This rumor did not originate with a credible source, nor was it accompanied by any supporting evidence. Furthermore, this rumor appears to have a single source. While this text has been copied and pasted by several different accounts, nobody has provided any additional information. It appears that this rumor was simply made up out of whole cloth.", "Associated Press.   \"Trump Pays His Respects to 23 Killed by Alabama Tornado.\"     8 March 2019.", "The Associated Press.   \"President Trump to Visit Tornado-Ravaged Tennessee.\"\r\n    5 March 2020.", "Ebert, Joel; Gonzales, Jason; Tamburin, Adam.   \"President Pledges Support, Aid During Visit.\"\r\n    Columbia Herald.   7 March 2020.", "Dwyer, Colin.   \"'We Love Them': Trump Tours And Consoles Tornado-Ravaged Tennessee.\"\r\n    NPR.   6 March 2020.", "Maslin Nir, Sarah.   \"Why Allen Weisselberg, Trump’s Money Man, Could Face Scrutiny Next.\"\r\n    The New York Times.   28 February 2019.", "Superville, Darlene.   \"Trump Surveys Tornado Damage, Marvels at 'Tremendous Heart.'\"\r\n    The Associated Press.   6 March 2020.", "Luther, Chris.   \"President Trump Meets With Benton Co. Mayor.\"\r\n    WMC 5.   6 March 2020.", "Garcia, Jon.   \"Watch live: Air Force One Lands in Nashville as Donald Trump Visits Tennessee After Tornado.\"\r\n    The Tennessean.   6 March 2020.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]