["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "In the second debate between U.S. Senate candidates Tammy Baldwin and Tommy Thompson, the Democratic congresswoman lit into the Republican former governor on Medicare.", "Baldwin rebuked Thompson on his performance as secretary of the U.S. Department of Health and Human Services, a post he took after leaving the governor’s office.", "\"When Tommy Thompson left Wisconsin in 2001 to join the Bush administration, he ran Medicare. You could say he ran it into the ground,\" Baldwin charged in the Oct. 18, 2012, debate.", "\"When he came to the administration, Medicare was approaching bankruptcy in the year 2029; when he left, it was 2020 -- nine years closer to bankruptcy. That's the Tommy Thompson record as secretary under George W. Bush.\"", "That’s pretty tough stuff, especially the thrust of Baldwin’s accusation, that Thompson was personally responsible for pushing Medicare closer to bankruptcy.", "Medicare and its solvency", "Medicare, the government health insurance program that serves some 49 million senior citizens and people under 65 with certain disabilities, cost $549 billion in 2011. It is funded by two separate trust funds.", "The trust fund for Medicare Part A -- which covers inpatient hospital care, home health care, and services at skilled nursing facilities and hospices -- is funded mostly from federal payroll taxes. This is the trust fund typically cited when politicians from both parties warn of Medicare’s demise.", "Each year, the Medicare Board of Trustees projects the number of years before the Part A trust fund will be exhausted.\nSince 1999, when Baldwin first entered Congress, the annual reports have put the life of the trust fund at between eight and 28 years. The most recent projection, in March 2012, said the fund would be exhausted in 12 years, in 2024.", "Baldwin’s evidence", "Asked for evidence to back the claim, Baldwin campaign spokesman John Kraus cited the Medicare board’s annual reports for 2001 and 2005 -- the years that correspond with Thompson’s tenure as Health and Human Services secretary.", "In 2001, the trust fund for Part A was projected to be solvent through 2029; but by 2005, it was projected to be exhausted in 2020, nine years sooner. Kraus argued that Thompson did nothing to prevent the nine-year slide.", "So, Baldwin was right on the numbers.", "But her claim put the blame squarely at Thompson’s feet, suggesting he could have prevented the slide himself.", "Thompson campaign spokeswoman Lisa Boothe noted it is Congress’ job to properly fund Medicare, saying Thompson only administered the program \"as directed by law.\"", "Just what was his role?", "Other evidence", "PolitiFact National’s examination of a March 2012 claim by Mitt Romney, the GOP presidential nominee, is helpful in evaluating Baldwin’s claim against Thompson.", "Romney’s statement was different -- he claimed President Barack Obama was \"ending Medicare as we know it,\" partly by \"allowing it to go bankrupt in less than 15 years.\"", "On the bankruptcy point, PolitiFact National pointed out that decisions made over nearly 50 years by many presidents and members of Congress put the program on an unsustainable path.", "Our colleagues also said \"it’s not clear that Medicare’s situation fits the two definitions of ‘bankrupt’ we’ve used in the past -- to be ‘declared in law unable to pay outstanding debts’ or ‘reduced to a state of financial ruin: impoverished.’ Medicare is a government program; the government will have the ability to pay its bills, however financially painful that may become.\"", "On that point, PolitiFact National concluded: \"We find it a ridiculous exaggeration to say Obama is personally responsible for Medicare’s woes.\"", "It would be even more ridiculous to lay full blame for Medicare’s move toward \"bankruptcy\" on a cabinet secretary.", "Expert views", "Two Medicare experts we interviewed agreed that the performance of the HHS secretary is a factor in the solvency of Medicare’s key trust fund, but far from the determining one.", "\"It certainly is reasonable to say the secretary is the ultimate point person for Medicare in the administration,\" said Jack Hoadley, health policy analyst and research professor at Georgetown University. But he also said many factors, such as congressional actions and longstanding trends in demographics and health care spending, \"matter in determining the life\" of the fund.", "Joseph Antos, health care and retirement policy scholar at the conservative American Enterprise Institute, said an HHS secretary only implements Medicare law handed down by Congress. He said it’s \"more correct to say Congress and the fee-for-service payment mechanism ran Medicare into the ground. The big spending is on payments for health services, and Congress sets payment rates through legislation. Fee-for-service gives a strong incentive for the use of more services, and more complex services, which increases total program spending.\"", "Our rating", "Baldwin said Thompson ran Medicare \"into the ground\" during his four years as health and human services secretary, citing the fact that its key trust fund moved nine years closer to insolvency.", "But Medicare’s financial health is determined more by presidents, members of Congress, health care costs and other factors -- over a period of decades -- than by the limited role of the HHS secretary.", "We rate Baldwin’s statement False.", "WTMJ-TV, Tammy Baldwin-Tommy Thompson debate video (at 19:00), Oct. 18, 2012", "PolitiFact Georgia, \"Cain says Medicare, Social Security in financial trouble,\" Oct. 14, 2011", "PolitiFact National, \"Mitt Romney says Barack Obama is 'ending Medicare as we know it,'\" March 22, 2012", "PolitiFact National, \"Mitt Romney says Barack Obama robs Medicare of more than $700 billion to pay for Obamacare,\" Aug. 15, 2012", "Medicare Board of Trustees, 2005 annual report, March 23, 2005", "Joint congressional hearing, Medicare Board of Trustees’ 2001 annual report, March 20, 2001", "Tommy Thompson campaign, \"Architect\" TV ad, Oct. 18, 2012", "Chicago Tribune, \"Medicare insolvent in 15 years,\" March 24, 2004", "Interview and email interview, American Enterprise Institute health care and retirement policy scholar Joseph Antos, Oct. 22 and 23, 2012", "Email interview, Georgetown University health policy analyst and research and research professor Jack Hoadley, Oct. 23, 2012", "Email interview, Tammy Baldwin campaign spokesman John Kraus, Oct. 19, 22 and 24, 2012", "Email interview, Tommy Thompson campaign spokeswoman Lisa Boothe, Oct. 21, 2012", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]