["In one of the most heated and personal back-and-forths from a debate this cycle, Donald Trump eviscerated former Florida Gov. Jeb Bush for supporting his brother’s decision to invade Iraq in 2003.", "Trump stood by his comment in 2008 that Democrats should have impeached President George W. Bush over the invasion when asked about it in the Feb. 13 CBS debate in South Carolina. Trump vigorously refuted Jeb Bush and Marco Rubio’s statements hailing the former president’s leadership, saying, \"The World Trade Center came down during the reign of George Bush. He kept us safe? That is not safe.\"", "Again, Trump said he was against the war from the very beginning.", "\"I'm the only one on this stage that said, ‘Do not go into Iraq. Do not attack Iraq,’ \" Trump said. \"Nobody else on this stage said that. And I said it loud and strong. And I was in the private sector. I wasn't a politician, fortunately. But I said it, and I said it loud and clear, ‘You'll destabilize the Middle East.’ \"", "Trump often repeats this line, and we’ve rated a similar Trump claim Mostly False, because he didn’t appear to take any public position on the war until after the March 2003 invasion. In this more recent version of the statement, he also said he stated his opposition to the war \"loud and clear.\" But the public record of his positions is thin.", "Let’s revisit the facts.", "We searched newspaper articles and television transcripts from 2002 and 2003, during the debate leading up to the Iraq War. We didn’t find any examples of Trump unequivocally denouncing the war until a year after the war began.", "Trump’s comments", "We only found one instance where Trump discussed the war before it started. On Jan. 28, 2003, just under three months before the invasion, Fox News’ Neil Cavuto asked Trump whether President Bush should be more focused on Iraq or the economy.", "Speaking of Iraq, Trump said, \"Well, he has either got to do something or not do something, perhaps, because perhaps shouldn't be doing it yet and perhaps we should be waiting for the United Nations, you know. He's under a lot of pressure. I think he's doing a very good job. But, of course, if you look at the polls, a lot of people are getting a little tired. I think the Iraqi situation is a problem. And I think the economy is a much bigger problem as far as the president is concerned.\"", "Trump seems to be skeptical of the mission in Iraq here, and he said the economy should be a higher priority. But he did not say anything that resembles his claim that Bush should not proceed because a war would  \"destabilize the Middle East.\"", "A single, squishy comment about the looming war does not qualify as \"loud and clear\" opposition.", "The United States invaded Iraq on March 19, 2003.", "A week later Trump gave differing takes. At an Academy Awards after-party, Trump said that \"the war’s a mess,\" according to the Washington Post. He told Fox News that because of the war, \"The market’s going to go up like a rocket.\"", "Trump’s harshest criticism came more than a year into the war, in an August 2004 article in Esquire:", "\"Look at the war in Iraq and the mess that we're in. I would never have handled it that way. Does anybody really believe that Iraq is going to be a wonderful democracy where people are going to run down to the voting box and gently put in their ballot and the winner is happily going to step up to lead the country? C'mon. Two minutes after we leave, there's going to be a revolution, and the meanest, toughest, smartest, most vicious guy will take over. And he'll have weapons of mass destruction, which Saddam didn't have.", "\"What was the purpose of this whole thing? Hundreds and hundreds of young people killed. And what about the people coming back with no arms and legs? Not to mention the other side. All those Iraqi kids who've been blown to pieces. And it turns out that all of the reasons for the war were blatantly wrong. All this for nothing!\"", "He told CNN’s Larry King in November 2004, \"I do not believe that we made the right decision going into Iraq, but, you know, hopefully, we'll be getting out.\"", "Clearly Trump opposed the Iraq War in its early years. There’s no evidence, though, that he advocated against the war in the first place, or that he was especially vocal about it destabilizing the Middle East.", "Our ruling", "On the Iraq war, Trump said, \"I said it loud and clear, 'You'll destabilize the Middle East.' \"", "Maybe Trump felt this way privately, but he made no publicly reported comments in the lead-up to the Iraq War that reflect this sentiment. He certainly did not say it \"loud and clear.\"", "We could only find one example of Trump commenting on the Iraq War before the invasion, and he seemed apprehensive but not vehemently opposed to the operation. He only started publicly denouncing the war after it started.", "Because he far overstated how loudly he declared his position on the Iraq War, we’re cranking the rating on this statement up to False.", "https://www.sharethefacts.co/share/32ee4b83-02ae-4423-b6dd-27703fb47c6c", "Nexis archive search of transcripts and newspaper articles January 2002 through March 2003, conducted Feb. 6, 2016", "Washington Post, \"Donald Trump’s baseless claim that the Bush White House tried to ‘silence’ his Iraq War opposition in 2003,\" Oct. 21, 2015", "Huffington Post, \"Donald Trump's Anti-Iraq War Position Wasn't As Prophetic As He Thinks,\" Sept. 14, 2015", "Buzzfeed, \"Despite Claims, There’s No Record Of Donald Trump Being Against The Iraq War Before It Started,\" Sept. 16, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]