["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "U.S. Rep. Randy Forbes, R-4th, has never been shy about seeking money for the Navy. He represents a district that’s anchored in Hampton Roads, home to the world’s largest naval base and two of the nation’s busiest shipyards.", "In an April 9 op-ed, Forbes and Rep. Joe Courtney, D-Conn., called for more funding to replace the nation’s aging fleet of attack submarines, or SSNs. The column appeared on AOL Defense, a website that describes itself as \"the idea hub of the U.S. defense world.\"", "Forbes and Courtney wrote, \"The Navy has stated it requires 48 SSNs to execute current missions, but given the current rates of replacement, the SSN force is scheduled to drop below the stated minimum in less than a decade.\"", "They wrote, \"All Americans should be gravely concerned\" by the loss of national security that will be caused by the diminution of the fleet. The attack subs, which cost about $2.6 billion apiece, are sent on a variety of missions, including intelligence, mine warfare, anti-submarine, anti-ship, small-scale special forces insertion and land target strikes.", "We decided to check their claim that the number of attack submarines is scheduled to fall below the Navy’s required level in less than a deacde. Forbes’ office referred us to two studies published in March by the Congressional Research Service and documents from the Department of Defense in 2010 and 2012.", "The Navy, since 2006, has said it needs 48 attack submarines to carry out its missions, according to a CRS report released March 27. So Forbes is right on that part of his claim.", "The Navy now has 55 attack subs, but these nuclear-powered vessels have about a 30-year lifespan. In a nutshell, the SSNs are scheduled to be retired during the next 22 years at a faster pace than the nation will replace them. The Navy’s long-range plan calls for scrapping about three submarines annually for a number of years and replacing them with one or two new subs.", "Forbes based his column on Navy projections released last year. They showed that the number of attack subs would sink below the 48-ship standard in 2022 and not resurface to that level until 2035. Forbes’ claim that the fleet would fall below the Navy’s stated need \"in less than a decade\" was based on the best information available at the time his op-ed was published.", "The Navy has since updated its 30-year projections to fit into the federal budget proposed by President Barack Obama on April 10. The Navy said its attack sub force wouldn’t fall under the 48-ship threshold until 2025 and would stay below that level for 10 years. The Navy would hit bottom in 2029, with 42 SSNs.", "Forbes, who is chairman of the House Seapower and Projection Forces Subcommittee, has scheduled hearings on the Navy’s shipbuilding plan. He has urged Congress to ensure that at least two new attack subs are produced every year.", "The decline in the SSN fleet, Forbes says, particularly threatens U.S. intelligence and security operations in East Asia and the Western Pacific, where China is becoming increasingly dominant.", "Eric Wertheim, author of \"Combat Fleets of the World\" and an expert on global sea power, told us it’s hard assess the degree of threat the reduction of the SSN fleet poses to U.S. security.", "\"What the Navy and military are trying to do is have a balanced force,\" he said. \"They plan to respond and be ready for any kind of operation, whether it’s low-intensity, such as Libya, peacetime activities, like intelligence or a high-intensity operation, such as is possible with places like China.\"", "Wertheim said it doesn’t necessarily mean that the U.S. won’t be able to carry out missions with a reduced attack sub fleet but, in military planners’ minds, there are increased risks that it won’t be able to respond to all threats.", "\"The question for them is what amount of risk are we willing to take,\" he said. \"We don’t know what we’ll need until the future comes.\"", "Our ruling", "Forbes wrote that the nation’s fleet of attack submarines is scheduled, in less than a decade, to fall below the 48 boats the Navy says it needs to carry out current missions.", "The congressman accurately cited the best information that was available when his column was published on April 9. Since then, the Navy has issued new projections that say the fleet won’t fall below 48 SSNs until 2025.", "We don’t fault Forbes for not knowing information that wasn’t available at the time. We rate his statement True.", "AOL Defense, \"Save Our Subs: Prioritizing The Attack Submarine,\" April 9, 2013.", "AOL Defense, \"Run Silent, Go Deep: Drone-Launching Subs To Be Navy’s ‘Wide Receivers,’\" Oct. 26, 2012.", "Email from Sergio Gor, Forbes’ communications director, April 9, 2013.", "Deputy Secretary of Defense, Letter  to Rep. Howard P. \"Buck\" McKeon, chairman of the Armed Services Committee, March 28, 2012.", "Congressional Research Service, \"Navy Force Structure and Shipbuilding Plans: Background and Issues for Congress,\" March 1, 2013.", "Congressional Research Service, \"Navy Virginia (SSN-774) Class Attack Submarine Procurement: Background and Issues for Congress,\" March 13, 2013.", "Department of Defense, \"Quadrennial Defense Review,\" February 2010.", "Phone interview with Eric Wertheim, author of \"Combat Fleets of the World,\" April 16, 2013.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]