["The video was published here on Facebook on January 6, 2021, where it has been viewed more than 2,100 times.", "The two-minute, one-second clip shows muddy floodwaters rushing towards where the video’s filmer is standing. The video’s Malay-language title translates to English as: “Flood Cameron highland”.", "The video has been viewed more than 2,500 times after it was also shared here and here on Facebook, as well as here and here on YouTube, with a similar claim.", "In early January 2021, tens of thousands of people were evacuated in Malaysia after monsoon rains pounded the country's east coast, as reported by AFP here on January 8, 2021.", "The claim is false.", "A reverse image search on Google of the keyframes from the video, using digital verification tool InVID-WeVerify, found this tweet from the official account of Indonesia’s National Disaster Management Agency (BNPB) on December 31, 2020. It shows recognisable scenes featuring the blue tarpaulin from the misleading video.", "Banjir lahar hujan terjadi pada alur daerah aliran sungai (DAS) yang berhulu dari puncak Gunung Semeru di Kabupaten Lumajang, Provinsi Jawa Timur, pada Rabu (30/12). Selengkapnya : https://t.co/suv4lajeiJ#InfoBencanaBNPB pic.twitter.com/omBPaAlImo", "The Indonesian-language tweet translates to English as: “Rain lava floods occurred in the groove of the river watershed that originated from the peak of Mount Semeru in Lumajang Regency, East Java Province, on Wednesday (30/12).”", "This Facebook post on December 31, 2020, uploads the same video with the genuine context of the incident in its caption. It translates to English as: “Cold lava flood mount Semeru”.", "Ash spewed from Mount Semeru, in Indonesia’s East Java province, on December 1, 2020, as reported by AFP here. It erupted again on January 16, 2021, as reported by the BBC here.", "Below is a screenshot comparison of the video in the misleading Facebook post (L) and the photos in the BNPB tweet (R):", "In response to the misleading posts, Cameron Highlands police chief DSP Ashari Abu Samah said the video was not filmed in Malaysia, as quoted by Malaysian state-run news agency Bernama on January 8, 2021, here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]