["Children housed at a migrant facility in Homestead, Fla., are crammed in with harsh conditions and rules, and in some respects, are treated worse than prisoners, says a South Florida congresswoman.", "U.S. Rep. Donna Shalala, D-Fla., criticized conditions at the Homestead facility in a July 21 interview with CBS Miami’s Jim DeFede.", "\"They get 30 minutes over a month to talk to family members,\" said Shalala, who represents a Miami district near Homestead. \"If they were in a prison — a federal prison — they would get 300 minutes.\"", "Shalala is among South Florida congressional Democrats calling to close the Homestead facility and send the children elsewhere.", "In reporting our fact-check, we learned that Shalala understated how often children can talk to their families, though she had a point that it is far less than the phone time for federal inmates.", "The Homestead temporary shelter for unaccompanied children opened in June 2016, during a migrant surge at the southern U.S. border. It was used through April 2017. Then, it reopened in 2018, and the first new wave of unaccompanied children arrived that March.", "It is operated by Caliburn International, a private, for-profit company and a contractor of the government.", "As of July 22, there were approximately 990 children at the shelter. As of mid July, the average length of stay was 36 days.", "The U.S. Department of Health and Human Services sent us the written policy related to telephone time, which was written during the Obama administration in January 2015.", "The policy states that children must be provided the opportunity to make a minimum of two telephone calls per week — at 10 minutes each — to family members and/or sponsors living in the United States and abroad. The children call for free.", "That adds up to 80 minutes of phone time per month, and not 30 as Shalala said.", "A spokesman for Shalala said while she misspoke on CBS, Shalala has correctly cited the call limits on the House floor in June and in a press release.", "Children have told immigration advocates, however, that they don’t get that much time in practice. Some said the calls are limited to between five and seven minutes. Advocates have filed a federal lawsuit against the federal government regarding conditions at Homestead.", "Federal prisoners, who spend years behind bars, get far more telephone time with relatives.", "A federal Bureau of Prisons policy states that inmates get 300 minutes per month for telephone calls, with an extra 100 minutes per month in November and December. The maximum amount of time for each phone call is 15 minutes. (The 300 minutes does not include calls to lawyers.)", "Unlike the calls made by children, prisoners either pay for their phone calls or make collect calls.", "Christopher Zoukis, a former prison inmate who is now a consultant to attorneys and prisoners, told us for long-distance calls in the United States, that would add up to about $63 each month for prisoners.", "Shalala said children at the Homestead migrant facility \"get 30 minutes over a month to talk to family members. If they were in a prison — a federal prison — they would get 300 minutes.\"", "Shalala misspoke about the number of minutes the children get to speak. It is 10 minutes twice a week, which adds up to 80 minutes a month. The number of minutes stems from a policy written in 2015 during the Obama administration.", "The other part of her claim is on point: The children receive less telephone time than federal prisoners, who get 300 minutes a month. Unlike the children, federal prisoners either pay for their calls or call collect.", "We rate this statement Half True.", "CBSMiami, Facing South Florida: One-On-One With Rep. Donna Shalala, July 21, 2019", "U.S. Rep. Donna Shalala press release, Reps. Shalala, Wasserman Schultz, Mucarsel-Powell Call for Closure of Homestead Temporary Migrant Shelter, June 4, 2019", "C-SPAN, U.S. Rep. Donna Shalala testimony, June 12, 2019", "Office of Refugee Resettlement, Children Entering the United States Unaccompanied: Section 3, 2015", "Federal Bureau of Prisons, Program statement Inmate Telephone Regulations, Jan. 24, 2008", "Federal Correctional Institution Federal Prison Camp Miami, Florida, Admission and orientation handbook, December 2013", "LexisNexis, Flores Motion Challenges 'Prison-Like' Detention Camp for Unaccompanied Minors in Florida, May 31, 2019", "Amnesty USA report, No home for children, July 2019", "Disability Rights Florida, Monitoring report, April 2019", "U.S. Administration for Children and Families , Fact sheet, July 2019", "Miami Herald, They pushed Trump to close Texas shelter for migrant kids. Their next target -- Homestead, Feb. 8, 2019", "Miami Herald, No hugs, kids cutting themselves: Court gets unprecedented peek inside Homestead shelter, June 2, 2019", "Miami Herald, 'Children should not be detained': Homestead center violating rights, Amnesty says, July 19, 2019", "News-Press, Relief, anger follow Sen. Nelson's visit to Homestead migrant children’s shelter, June 23, 2018", "Sun Sentinel, 'They don't belong here' June 26, 2019", "Federal Bureau of Prisons, Phone calls, Accessed July 22, 2019", "Cumberland Times-News (Maryland), Cumberland might be Manafort's new home, March 26, 2019", "Chicago Tribune, Ex-Speaker Hastert reports to prison; Hush-money cover-up ultimately landed him a 15-month sentence, June 23, 2016", "PolitiFact, The facts behind the detention of immigrants, July 8, 2019", "PolitiFact, Warren correct: Inmate phone calls can cost $25 for 15 minutes, July 1, 2019", "PolitiFact, Bill Nelson claims detained immigrant parents charged $8/minute to call their children. Is it true? July 26, 2018", "U.S. Bureau of Prisons, Statement to PolitiFact, July 22, 2019", "U.S. Department of Health and Human Services’ Administration for Children and Families, Statement to PolitiFact, July 22, 2019", "Email interview, Carlos Condarco, U.S. Rep. Donna Shalala, D-Fla., spokesman, July 22, 2019", "Email interview, Christopher Zoukis, Managing Director of the Zoukis Consulting Group, July 22, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]