["A pair of Republicans in the state Assembly recently introduced a bill that would make New Jersey the 23rd state where workers can opt against joining a union, setting off a debate over the economic impact of so-called \"right-to-work\" laws.\n\nAssemblywoman Amy Handlin (R-Monmouth/Middlesex), one of the bill’s sponsors, had claimed the move \"would quicken New Jersey’s economic revival.\" But Assembly Speaker Sheila Oliver (D-Essex/Passaic) said the legislation was \"dead on arrival.\"\n\nIn a July 8 press release, Oliver explained how right-to-work laws represent bad economic policy.\n\n\"Numerous studies have shown that these so-called right-to-work laws do not generate jobs and economic growth,\" Oliver said in the press release. \"In fact, these laws have been found to suppress wages and have had no impact on employment and business growth.\"\n\nAfter looking at the research and talking to economic experts, PolitiFact New Jersey ended up with a mixed picture of the impact of right-to-work laws. Some experts argue that the influence of that single policy is difficult to pin down, but others said there is a connection between job creation and right-to-work laws.\n\nFirst, let’s talk about job growth in those right-to-work states.\n\nPatrick Semmens, a spokesman for the National Institute for Labor Relations Research, pointed out that right-to-work states are producing jobs at a faster rate than other states. A recent ruling from PolitiFact Georgia confirmed that trend.\n\nHandlin argued that higher personal income and lower unemployment rates are examples of right-to-work leading to job growth. Semmens and Handlin both referred to the research done by Ohio University economics professor Richard Vedder.\n\nVedder told us right-to-work laws were associated with job creation. Even accounting for other factors, right-to-work laws produce positive economic outcomes, he wrote in an email.\n\nYet some right-to-work states have no state income tax, which could make the relationship between right-to-work laws and income growth seem like a \"mirage,\" Vedder wrote.\n\nVedder acknowledged how job growth is greater in right-to-work states, but added \"that showing a statistical relationship does not necessarily imply causation.\"\n\nSo, are right-to-work laws the reason for the job growth in those states?\n\nOliver’s spokesman, Tom Hester Jr., sent us an April study from the Washington, DC-based Economic Policy Institute, a liberal think tank, that supports the assemblywoman’s argument. That study claims that since both sets of states \"can foster booming job markets, then something in these states’ economies, demographics, or policies other than RTW must be driving their growth.\"\n\nRoland Zullo, a research scientist in labor and economic studies at the University of Michigan, said there’s no convincing research proving a link between right-to-work laws and job growth or decline. Other factors, such as tax packages, could explain what’s driving companies to right-to-work states, Zullo said.", "Another recent study by two economics professors reached a mixed conclusion on the subject. In terms of manufacturing employment, a right-to-work law had no significant impact in Oklahoma, but another right-to-work law increased the number of jobs in Idaho, according to an email from those professors, Serkan Ozbeklik and Ozkan Eren.\n\nRight-to-work laws likely create jobs, but part of the job growth is probably the result of other business-friendly policies in right-to-work states, according to Ozbeklik and Eren.\n\nW. Robert Reed, an economics professor in New Zealand, who had researched right-to-work laws while working in Oklahoma, wrote in a series of emails that right-to-work laws create jobs and increase wages. Right-to-work limits the ability of unions to negotiate benefits to the point of discouraging companies from hiring new employees, Reed wrote.\n\nBut Reed noted, as Vedder did earlier, that \"correlation does not prove causation.\"\n\n\"Did wages grow faster in RTW states because of RTW legislation? Or because of other factors? That's virtually impossible to determine,\" Reed wrote. \"So many other factors could also have been responsible for job and wage growth in those states.\"\n\nIt’s worth noting that the research is also divided on whether right-to-work laws reduce workers’ wages, as Oliver suggested.\n\nTwo studies from the Economic Policy Institute suggest workers in right-to-work states earn less than their counterparts in other states. Ozbeklik and Eren found that right-to-work led to reduced non-union wages in the private sector in Oklahoma.", "But Reed argued in a 2003 study that average wages are higher in right-to-work states, when factoring in state economic conditions at the time the right-to-work laws were adopted.\n\nLet’s review:\n\nOliver claimed that studies show \"right-to-work laws do not generate jobs and economic growth.\" According to different studies and economic experts, the evidence is mixed that right-to-work laws spur job growth.\n\nRight-to-work states have seen greater job increases, but one economist pointed out that such a dynamic doesn’t prove right-to-work laws were the cause. Another professor who believes job growth results from right-to-work laws acknowledged that many other factors also could be responsible.\n\nWe rate Oliver’s statement Half True.", "To comment on this ruling, go to NJ.com.", "New Jersey Assembly Democrats, Speaker Oliver: Republican Anti-Worker Bill ‘Dead On Arrival,’July 8, 2011", "Email interviews with Tom Hester Jr., spokesman for Assembly Democrats, July 11-12, 2011", "Interview with Patrick Semmens, National Institute for Labor Relations Research, July 11, 2011", "Interview with Assemblywoman Amy Handlin, July 11, 2011", "Don’t Force Union Membership, press release from Amy Handlin, June 3, 2011", "PolitiFact Georgia, Numbers back up Gingrich job growth claim, June 21, 2011", "Cato Journal, Right-To-Work Laws: Liberty, Prosperity, And Quality Of Life, winter 2010", "Email interviews with Richard Vedder, Ohio University Department of Economics, July 11, 2011", "Economic Policy Institute, Does ‘Right-To-Work’ Create Jobs? Answers from Oklahoma, March 16, 2011", "Economic Policy Institute, The Compensation Penalty Of ‘Right-To-Work\" Laws, February 17, 2011", "Economic Policy Institute, ’Right-to-Work’ Wrong for New Hampshire, April 5, 2011", "Economic Policy Institute, The Wage Penalty of Right-to-Work Laws, August 21, 2001", "Interview with Roland Zullo, Institute for Research on Labor, Employment, and the Economy at the University of Michigan, July 11, 2011\n\nRight-to-Work Laws and State-Level Economic Outcomes: Evidence from the Case Studies of Idaho and Oklahoma Using Synthetic Control Method, February 2011", "Email interview with W. Robert Reed, University of Canterbury Department of Economics, July 12, 2011\n\nHow Right-to-Work Laws Affect Wages, article written by W. Robert Reed, 2003", "Email interview with Serkan Ozbeklik, Claremont McKenna College, and Ozkan Eren, University of Nevada, Las Vegas, July 13, 2011", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]