["The video was published here on Facebook on November 28, 2020. It has been viewed more than 10,000 times.", "The post’s Thai-language caption translates to English as: “When Joe Biden’s daughter co-performed with Xi jinping, this phenomenon happens…”", "The footage shows a Chinese woman playing an erhu, a traditional Chinese instrument, while a blonde-haired woman sings. They perform a cover of “Sha-La-La-La-La”, a song by Danish band The Walkers.", "The misleading post circulated online shortly after Joe Biden was declared winner of the 2020 US President Election, as AFP reported here.", "The video was published alongside a similar claim on Facebook here, here, here and here.", "The claim, however, is false.", "A keyword search found the video actually shows a performance on China’s “Universal Show”, which is broadcast live by China’s national broadcaster, CCTV 4.", "The footage was also published on YouTube here on October 14, 2020.", "The video’s Chinese-language caption translates to English as: “Chen Yimiao and Anna collaborate to perform the classic song 'SHA LA LA' [Variety Show] | China Music TV”.", "Below is a screenshot of the performance with the performers’ names highlighted in red by AFP:", "The details in Chinese translates to English as: “Singing: ANNA (Ukraine).", "“Erhu: Chen Yimiao”.", "Below is a screenshot comparison of the video in the misleading posts (L) and the YouTube video (R):", "The footage was also broadcast live here on CCTV-4 Chinese International Channel on October 4, 2020.", "Neither of the women are related to Joe Biden or Xi Jinping.", "Xi Mingze is the only daughter of President Xi and Peng Liyuan, a popular Chinese folk singer. She was born in 1992, as reported here by Chinese state radio station China National Radio.", "Joe Biden has one daughter, Ashley Biden. His first daughter Naomi Christina Biden died in a car accident in 1972 with her mother Neilia Biden, the NY Post reported here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]