["The misleading claim has been shared more than 550 times since it was posted on Facebook here on May 5, 2020.", "The post’s Indonesian-language caption reads in part: \n\t“VACCINE\n\tVaccine was first made under the Ottoman caliphate. In 1717, Lady Mary Montagu, the wife of the British ambassador in Istanbul, wrote a letter to some of her friends telling them that in Istanbul there was something ‘called vaccination’ to treat people with smallpox in Istanbul.", "“Lady Mary explained that women and children were gathered and then there was an incision on their arms. After that they were given something and they would experience a mild fever, and they became immune. This letter was the oldest document related to the production and use of vaccines. The letter was dated April 1, 1717.”", "Lady Mary Wortley Montagu was an essayist and feminist, as well as the wife of Edward Wortley Montagu, who in 1716 was appointed as the British ambassador to the Ottoman Empire, according to Encyclopaedia Britannica.", "The same claim has been shared more than 180 times after it was posted on Facebook here, here, here and here.", "The claim is misleading; the first vaccine was introduced in 1796 by British physician Edward Jenner, according to multiple historical accounts; the medical procedure prior to that was known as “variolation” or “inoculation”.", "The first smallpox vaccine, created by Jenner in 1796 as an alternative to variolation, was the first successful vaccine to be developed, according to the World Health Organization here and the US National Library of Medicines here.", "“The first vaccine was introduced by British physician Edward Jenner, who in 1796 used the cowpox virus (vaccinia) to confer protection against smallpox, a related virus, in humans,” says Encyclopaedia Britannica here.", "Lady Mary Wortley Montagu", "Lady Montagu’s letter that mentioned immunization in Constantinople dated April 1, 1717, can be read here.", "She sent the letter to her friend Sarah Chiswell in London, explaining a medical procedure in the Ottoman Empire to treat smallpox.", "AFP has highlighted part of the letter that mentions the procedure:", "It says: “She immediately rips open that you offer to her with a large needle (which gives you no more pain than a common scratch) and puts into the vein as much venom as can lie upon the head of her needle, and after binds up the little wound with a hollow bit of shell, and in this manner opens four or five veins.”", "The procedure described by Lady Montagu in her letter was known as “variolation”, according to this timeline on historyofvaccines.org, a website by the College of Physicians of Philadelphia.", "According to the timeline, variolation, also known as “inoculation”, was practiced in China, Africa and the Ottoman Empire before spreading to Europe. Lady Montagu was credited to bringing the practice to England, where she had a physician variolate her daughter in 1721.", "Variolation uses a mild form of smallpox taken from patients’ pustules to create immunity against smallpox, according to Encyclopaedia Britannica here.", "“Variolation was never risk-free. Not only could the patient die from the procedure but the mild form of the disease which the patient contracted could spread, causing an epidemic. Victims of variolation could be found at all levels of society; King George III lost a son to the procedure as did many others,” the US National Library of Medicines explains here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]