["About this rating", "Francis did hold hands with the girl, and invited her to sit next to him.", "There was no intervention by security guards, and Francis was not delivering a homily at a \"regular papal service,\" he was delivering an address during a special audience.", "In February 2018, hundreds of thousands of social media users shared a heartwarming photograph of Pope Francis delivering a speech while holding hands with a young girl with Down syndrome.", "In some instances, though, the story accompanying the image was not quite accurate. For example, on 11 February, the TradCatFem (\"Traditional Catholic Femininity\") Twitter account posted the photograph along with this description:", "A girl with Down syndrome, got up during a regular papal service & went toward [Pope Francis.] Security men quickly moved in [to] take her back to her mom. The Pope stopped them & said to her \"come sit next to me.” She then sat down near him and he continued his homily, holding her hands.", "A girl with Down syndrome, got up during a regular papal service & went toward @Pontifex\nSecurity men quickly moved in 2 take her back to her mom. The Pope stopped them & said to her \"come sit next to me.” She then sat down near him and he continued his homily, holding her hands pic.twitter.com/2QziweDRPX", "— TradCatFem??? (@TradCatFem) February 11, 2018", "The truth is still charming but contains a little less drama. In reality, this was not a \"regular papal service\" but an event at Clementine Hall in the Vatican's Apostolic Palace, held in October 2017 for Italian Special Olympics athletes ahead of their participation in the Unified Football tournament, which included players with and without disabilities.", "A spokesperson for the Special Olympics told us by email that the girl in the photograph is Gemma Pompili, herself a Special Olympics athlete:", "Gemma was part of an invited delegation from Special Olympics and her role included presenting a pair of red Play Unified sneakers to Pope Francis. Gemma made a wonderful impression on the Pope and he invited her to sit beside him for the duration of the official audience event.", "The spokesperson, who was present at the event, confirmed to us that there was no intervention from security guards at any time.", "In a press release, Italy's Special Olympics committee said Gemma had \"spontaneously climbed on the bishop's chair, just to the right of Pope Francis, and remained there for the duration of the audience,\" despite her parents trying to call her back:", "She shook her head and exclaimed \"Papa,\" every time attracting the attention of the Holy Father, who was charmed by so much tenderness.", "Courtesy of the Special Olympics", "Pope Francis used the occasion of the audience to deliver an address on the theme of inclusion, telling the athletes:", "You are a symbol of a sport that opens the eyes and heart to the value and dignity of individuals and people who otherwise would be the object of prejudice and exclusion.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]