["With protests taking place in different parts of the country against the controversial Citizenship Amendment Act, a photograph showing a massive gathering of people beneath a flyover has been posted on social media with the claim that it depicts a protest against the Act. “भारत में तमाम बड़े शहरों में सिटीजनशिप एक्ट और एनआरसी के खिलाफ आवाज़, लोग सड़कों पर, अब पूरे देश में प्रोटेस्ट्स की लहर” (Protests in several cities in India over the Citizenship act and NRC, people out on the streets, wave of protests throughout the nation- translation). This is the message with which the photograph has been posted.", "The above post is on a Facebook page Voice of Muslims. It has been shared over 11,000 times so far. The image has also been shared with the claim that this gathering was at Mohammed Ali road in Mumbai. “Protest Against CAB at Mohammed Ali road Mumbai”, reads the message.", "Protest Against #CAB at Mohammed Ali Road, #Mumbai pic.twitter.com/5irPIbuucp", "— Chimmani Manohar (@MChimmani) December 14, 2019", "Users of the official Alt News app have requested verification of this image and the accompanying claim.", "Alt News found that the photograph is being shared with a false narrative. It is not from India and is not related to the Citizenship Amendment Act.", "Upon reverse-searching the photograph on Yandex, we found several results, according to which the image is from Chittagong, Bangladesh.", "Alt News found a video uploaded on YouTube on November 10, 2019, titled, ‘আলহামদুলিল্লাহ লাখো আশেকে রাসুলগনের ঢল,jasne julus..chittagong’. The place seen in the video is the same as that shown in the image shared on social media. We also found several videos of the event, posted on YouTube.", "Jashn-e-Julus refers to a festive gathering of Muslim devotees. According to the description, this video of November 10 is from the city of Chittagong in Bangladesh. It may be noted that November 10, 2019 was celebrated as Eid Milad Un Nabi. We found visual clues from the above video which correspond with the image. These visual clues have been compared in the below-juxtaposed images.", "Thus, the image shared widely as a massive gathering in protest against the Citizenship Amendment Act, is actually from Chittagong, Bangladesh and pertains to a religious gathering in November 2019. The story was earlier fact-checked by Boom.", "Donate Now", "Arjun Sidharth is a writer with Alt News. He has previously worked in the television news industry, where he managed news bulletins and breaking news scenarios, apart from scripting numerous prime time television stories. He has also been actively involved with various freelance projects. Sidharth has studied economics, political science, international relations and journalism. He has a keen interest in books, movies, music, sports, politics, foreign policy, history and economics. His hobbies include reading, watching movies and indoor gaming.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]