["Malia Obama talks with people in the audience during an Independence Day celebration in the East Room of the White House, in Washington, Monday, July 4, 2016, for members of the military and their families. (AP Photo/Carolyn Kaster)", "Scrutiny hasn’t ceased for Malia Obama since her family left the White House. Now, a recycled lie that she’s on a warpath against white people is again making the rounds.", "\"White people are so 1960’s,\" starts a quote attributed to Obama’s midterm speech exam. \"Sometimes the only thing that keeps me going is the fact that they will be blended out by the time I am 30. Imagine a world without white people.\"", "The statement appears over a picture of the eldest daughter of former President Barack Obama along with a question. \"What do you think of Malia Obama’s belief that white people should not exist? 1 like = 1 arrest\"", "One such post shared on Facebook this week has already garnered more than 100 likes, and it’s been shared more than 1,000 times on the social media platform. We found an identical Facebook post from April 6 that was shared more than 36,000 times.", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "We found no news reports that Obama made such a statement. And Harvard media relations did not respond to an email seeking comment about the claim. But back in April, PolitiFact checked a similar claim that Obama had been suspended after writing a paper imagining a \"world without white people.\" Then, the claim merited a rating of Pants on Fire.", "Six months later, with the quote recirculating, the only place where we find any trace of this statement attributed to Obama continues to be on a website run by a noted purveyor of fabricated news stories: a website formerly known as AmericasLastLineofDefense.org that now appears to be housed at dailyworldupdate.us. The website states on its \"About\" page that, \"Everything on this website is fiction.\"", "Also embedded in the original April story is the same picture and false quote that is being circulated again on Facebook and fact-checked here.", "We rate this post Pants on Fire!", "Facebook post, Oct. 14, 2018", "Facebook post, April 6, 2018", "News blog post, \"Fake story says Malia Obama suspended from Harvard,\" PolitiFact.com, April 10, 2018", "About page on dailyworldupdate.us, Oct. 18, 2018", "News blog post, \"If you're fooled by fake news, this man probably wrote it,\" PunditFact, May 31, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]