["About this rating", "The Prince of Darkness garnered a wicked share of social media buzz in early 2018, with mentions  ranging from reports that Chelsea Clinton tweeted a friendly New Year's shout-out to Satan worshipers to the revelation that a \"Luciferian\" house of worship had opened its doors in Colombia.", "Examples of the latter were typically couched in apocalyptic tones and illustrated with lurid images and videos purportedly documenting the church's existence and popularity:", "Church Of Lucifer Opened In Colombia. The Apocalypse Is Near. https://t.co/duxiUjKRe4 pic.twitter.com/1JvdhY4YpZ", "— infidel??????♥️ (@whitesepulchre) March 11, 2018", "But although the Church of Lucifer depicted in the images does exist, the posts convey an inaccurate impression of what it is and who is involved.", "For starters, the video, which was shot in January 2017, is entirely unrelated to the images and has nothing to do with a Luciferian church, or devil worship in general. On the contrary, it shows hundreds of revelers in Riosucio, Caldas, a small town in northwestern Colombia, participating in the biennial celebration of Carnaval del Diablo (Carnival of the Devil), described by the web site Devils of the Americas as a Catholic festival:", "Every two years, the town of Riosucio, in the mountainous and coffee-producing region of Colombia, prepares to receive His Majesty, the Devil. Starting the Thursday before the Feast of the Kings, January 6th, and during six days, people from Riosucio join this traditionally Catholic religious fiesta in practice for over two hundred years to celebrate the arrival of the playful, \"talkative\" and mocking character of the Devil.", "By contrast, the images, which date from 2016 and were shot in a different part of the country, depict a \"church\" utterly devoid of parishioners. It was built by a self-styled Luciferian high priest and brujo (sorcerer) who does business under the assumed name Víctor Damián Rozo (his real name, according to a profile in the Colombian news magazine Semana, is Héctor Londoño Villegas). Rozo claims to have followers all over the world.", "He also claims to have built the church (officially dubbed the Luciferian Temple, Seeds of Light), so worshipers of Lucifer would have a place to congregate. In reality, there's little evidence that the building, erected on Rozo's own property, serves any other purpose than providing a backdrop for his self-promotional videos. Judging from his Twitter activity (under the handle @damianrozo666), Rozo's primary enterprise is selling so-called \"pacts with the devil,\" the benefits of which include financial enrichment:", "Como vender el alma al diablo¡ COMO HAGO UN PACTO CON EL DIABLO Y SATANAS: https://t.co/8ADZzkUShd vía @YouTube", "— VICTOR DAMIAN ROZO (@damianrozo666) March 12, 2018", "There's a catch, of course. In exchange for his services as a Luciferian deal-maker Rozo demands a percentage of his clients' future incomes. It's hard to determine how successful he has been at this scheme. Though he portrays himself as a globetrotting millionaire, the regional newspaper Crónica del Quindío points out that promotional photos of Rozo visiting exotic locales were created by digitally inserting his likeness into existing images.", "In short, although it does exist, Colombia's controversial Church of Lucifer appears to be less a religious (or anti-religious) institution than the home base for a bizarre confidence scheme run by its owner, Víctor Damián Rozo. A reporter for Vice Colombia came to a similar conclusion after peeking behind the curtains of Rozo's operation in 2017. Among the deceptions he was caught engaging in was paying local residents a few pesos each to pose as devotees of Lucifer:", "Rozo says his mission as a high priest of Lucifer is to rescue humanity from what he calls the \"huge scam\" of Christianity — the irony of which, as far as we can tell, is lost on no one but him.", "Izquierdo, Andrés Páramo.  \"When I Went to Quindío to Sell my Soul to the Devil.\"\r\n  Vice.  24 October 2016.", "Marino, K.J.  \"Satanic Temple Rattles Colombia; Leader Promising Wealth, Sex to Devotees?\"\r\n  Latin Post.  29 January 2016.", "La Crónica del Quindío.  \"The 5 'Mischiefs' of the Quindian Luciferian Víctor Damián Rozo.\"\r\n  19 January 2016.", "El Diario.  \"El Diablo Se Fue de Carnaval a Riosucio.\"\r\n  9 January 2017.", "Semana.  \"We Are Not Satanists, We Worship Lucifer.\"\r\n  22 January 2016.", "Vice International.  \"Inside Colombia's Temple of Lucifer.\"\r\n  9 March 2017.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]