["About this rating", "The six listed senators are Republican members of the Senate Judiciary Committee, and they all voted against the Violence Against Women Reauthorization Act of 2013.", "The only \"ranking member\" of the Senate Judiciary Committee is Democratic Sen. Dianne Feinstein, who did not vote against the act.", "As debate surrounded the prospective Senate testimony of Christine Blasey Ford, who accused Supreme Court nominee Brett Kavanaugh of having sexually assaulted her more than 30 years earlier, an image was circulated online accusing Republican members of the Senate Judiciary Committee of being unable to hear her allegations impartially, given their prior vote on a related issue.", "The graphic focused on six GOP senators: John Cornyn and Ted Cruz of Texas, South Carolina Sen. Lindsey Graham, Sen. Chuck Grassley of Iowa, and Orrin Hatch and Mike Lee of Utah:", "The image stated correctly, that the six named lawmakers had voted against the Violence Against Women Reauthorization Act of 2013. That measure ultimately passed the Senate by a 78-22 vote on 12 February 2013, was approved by the House six days later, and was signed into law by President Barack Obama on 7 March 2013.", "The original Violence Against Women Act, enacted in 1994, provided $1.6 billion for the investigation and prosecution of violent crimes against women, imposed automatic and mandatory restitution on persons convicted of violent crimes against women, and allowed women to pursue civil cases against attackers in cases that were not criminally prosecuted. The Act was reauthorized in 2000, 2005, and again in 2013, in the latter case after a long legislative battle with Republicans who took exception to some of its provisions:", "The legislation would continue existing grant programs to local law enforcement and battered women shelters, but would expand efforts to reach Indian tribes and rural areas. It would increase the availability of free legal assistance to victims of domestic violence, extend the definition of violence against women to include stalking, and provide training for civil and criminal court personnel to deal with families with a history of violence. It would also allow more battered illegal immigrants to claim temporary visas, and would include same-sex couples in programs for domestic violence.", "Republicans say the measure, under the cloak of battered women, unnecessarily expands immigration avenues by creating new definitions for immigrant victims to claim battery. More important, they say, it fails to put in safeguards to ensure that domestic violence grants are being well spent. It also dilutes the focus on domestic violence by expanding protections to new groups, like same-sex couples, they say.", "The graphic termed the group of six Republican senators who voted against the act \"the six ranking members of the Senate Judiciary Committee, who would be questioning Christine Blasey Ford,\" then questioned, \"Is it any wonder why she, as well as anyone seeking the truth, prefers to have the FBI investigate her claims against Judge Kavanaugh, rather than facing this group of misogynists?\"", "Technically, this characterization is not accurate, as a \"ranking member\" is the most senior member of a legislative committee who belongs to the minority party. A committee can have only one ranking member, and in this case that member is necessarily a Democrat (since Republicans currently hold the majority in the Senate), Sen. Dianne Feinstein of California.", "Senator Chuck Grassley is the committee chair, and the other Republicans named in the meme are part of the committee's majority group. The opportunity for senators to question witnesses appearing before a Senate committee is not limited to members of the majority party:", "Each committee determines the order in which Senators question witnesses. A common practice is to alternate between Senators from the respective parties in order of seniority. Some committees operate under a so-called early bird rule or practice, which instead permits Senators to question witnesses based on the Senators’ order of arrival at the hearing. Some committees use a combination of these two methods, and committee chairs often allow Senators to proceed out of order. Also, Senators often submit written questions to which witnesses can respond in writing following the hearing.", "Although Senate rules do not restrict the length of time each Senator may question a witness, several committees have adopted such rules. Some committees limit each Senator to five minutes per witness until all members present have had a chance to ask questions. Some committees also authorize committee staff to question witnesses", "The Daily Beast.   \"Lindsey Graham: Christine Blasey Ford's Testimony Won't Change My Support for Brett Kavanaugh.\"\r\n    23 September 2018.", "Snell, Kelsey.   \"Kavanaugh Accuser Christine Blasey Ford to Testify Thursday.\"\r\n    NPR.   23 September 2018.", "Weisman, Jonathan.   \"Women Figure Anew in Senate's Latest Battle.\"\r\n    The New York Times.   14 March 2012.", "Heitshusen, Valerie.   \"Senate Committee Hearings: Witness Testimony.\"\r\nCongressional Research Service.   6 December 2017.", "Arturo Garcia is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]