["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Ron Johnson", "Five people died Jan. 6, 2021, including a U.S. Capitol Police officer, when a mob violently invaded the U.S. Capitol in protest of the November 2020 election results.", "Few arrests were made that day, but our understanding of the day’s events and the rioters’ motivations has grown over time, as more than 230 people have now been identified and charged, according to a database maintained by National Public Radio.", "But U.S. Sen. Ron Johnson, R-Wisconsin, still claims accounts of the day’s events are being exaggerated. He made his case Feb. 15, 2021, in an appearance on \"The Jay Weber Show\" on WISN radio.", "\"The fact of the matter is this didn’t seem like an armed insurrection to me. I mean armed, when you hear armed, don’t you think of firearms?\" Johnson said. \"Here’s the questions I would have liked to ask. How many firearms were confiscated? How many shots were fired? I’m only aware of one, and I’ll defend that law enforcement officer for taking that shot.\"", "Johnson made a nearly identical claim later that morning on another Wisconsin radio show.", "Johnson is couching this as an opinion, but he’s attempting to make a factual case that Jan. 6 wasn’t an \"armed insurrection.\"", "So let’s review the evidence on that point.", "Johnson prefaced this comment by claiming that Democrats are painting a picture of every Trump voter being a violent rioter. Certainly not everyone in the crowd was armed. And many clearly came intending only to peacefully protest.", "But claiming this was not an armed insurrection goes well behind this line of thinking.", "Many in the crowd attacking the Capitol have said their intent was to stop the vote confirmation and keep Trump in office despite the election results. That’s an insurrection.", "That leaves us with his objection to the word \"armed.\"", "Yes, carrying a gun would constitute being armed. But the definition of the word is much more broad, referring simply to carrying a weapon. So the question is whether this insurrection involved people carrying weapons.", "And it certainly did.", "First off we’ll note that any reports of weapons at the Capitol will greatly understate the quantity that was likely there. Only 75 people were arrested that day, and police weren’t doing any widespread searches that would have identified weapons on others present, NBC News notes.", "\"The cops weren't searching people,\" Mark Jones, a former agent of the Bureau of Alcohol, Tobacco, Firearms and Explosives with 20 years of counterterrorism experience told NBC News in a Jan. 13, 2021, story. \"I'd speculate that there were many, many more firearms that were there that were not uncovered.\"", "But news and official reports are filled with accounts of armed people at the Capitol.", "Fourteen people tied to the Jan. 6 attack are facing federal charges related to bringing or using dangerous weapons inside the building and two are facing firearms-related charges, according to the U.S. Attorney’s Office for the District of Columbia.", "NBC News reported that within a week after the attack a dozen guns and thousands of rounds of ammunition had been found on seven people arrested before and after the Capitol riot.", "Cleveland Grover Meredith, drove to Washington from Colorado with an assault-style Tavor X95 rifle with a telescopic sight, a Glock 9 mm with high-capacity magazines and more than 2,500 rounds of ammunition, including at least 320 rounds of armor-piercing bullets, NBC reported. Reuters said Meredith texted \"War time\" after hearing Vice President Mike Pence would count electoral votes from states Trump lost.", "In the trunk of Lonnie Coffman’s vehicle, police found an AR-15-style rifle, a shotgun, a crossbow, several machetes, smoke grenades and 11 Molotov cocktails, Reuters reported. Another man, Christopher Alberts of Maryland, was stopped as he left the Capitol grounds after a police officer spotted a loaded handgun on his hip.", "Many more people armed themselves by more unorthodox means, causing damage and injury.", "Robert Sanford, 55, of Pennsylvania, was allegedly caught on video throwing a fire extinguisher at a group of police officers. David Blair, 26, was seen hitting officers with a lacrosse stick, NBC said. Others had pepper spray, brass knuckles, a pipe and pocket knives, and one man was carrying a \"stinger whip,\" a tool with blunt and whip-like edges marketed for self-defense and escaping a locked vehicle.", "One rioter was caught on video beating a police officer with a flagpole bearing an American flag, NBC Washington reported. The New York Times reviewed video that showed people using stolen police shields, sticks and crutches as weapons.", "And the man photographed with his feet on the desk of U.S. House Speaker Nancy Pelosi was carrying a 950,000-volt stun gun walking stick, House impeachment manager Stacey Plaskett revealed Feb. 10.", "Not to mention pipe bombs were found near the Capitol at Republican and Democratic party headquarters.", "Johnson’s staff did not immediately return an email seeking evidence or explanation of his claim.", "Johnson said the Jan. 6 Capitol riot \"didn’t seem like an armed insurrection.\"", "That’s ridiculous revisionist history.", "Overwhelmed police arrested and had direct contact with only a fraction of the mob that day, but we still can identify accounts of numerous weapons found in and around the Capitol, brought there in some cases by people who saw themselves as soldiers in a war. And many other rioters used whatever hard objects they could find to attack police and force their way into the Capitol.", "A majority of senators, through the impeachment vote, put the blame on Trump for stirring up the riot, though others debate the \"why\" question for the events of Jan. 6. But the \"what\" question shouldn't be debated. It was an armed insurrection.", "We rate this claim Pants on Fire.", "WISN radio, \"The Jay Weber Show,\" Feb. 15, 2021", "NPR, The Capitol Siege: The Arrested And Their Stories, Feb. 12, 2021", "OMNY.fm, The Regular Joe Show, RJS-02/15/21-Segment 4, Feb. 15, 2021", "NBC News, Stun guns, 'stinger whips' and a crossbow: What police found on the Capitol protesters, Jan. 13, 2021", "Reuters, Arrested Capitol rioters had guns and bombs, everyday careers and Olympic medals, Jan. 14, 2021", "The Hill, Police seized alarming number of weapons on Capitol rioters, court documents show, Jan. 16, 2021", "WHYY, Retired Delco firefighter charged with assault for hurling fire extinguisher at Capitol Police, Jan. 14, 2021", "NBC Washington, Capitol Rioter Beat DC Officer With Pole Flying American Flag, Jan. 12, 2021", "New York Times, ‘They Got a Officer!’: How a Mob Dragged and Beat Police at the Capitol, Jan. 11, 2021", "CNN, Trump’s second impeachment trial: Day 2, Feb. 10, 2021", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]