["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Fifty years ago, President Lyndon Johnson declared war on poverty. Since then, says Sen. Marco Rubio, R-Fla., taxpayers have spent $20 trillion on welfare and other government programs intended to lift them out of poverty -- yet tens of millions of Americans are still impoverished.", "\"In my home state, nearly one in five Floridians live in poverty,\" Rubio said in a Jan. 5 video message. \"After 50 years, isn’t it time to declare big government’s war on poverty a failure?\"", "Rubio called for a new agenda to help people lift themselves out of poverty and create a new \"opportunity society\" to enable people to live the American dream. Rubio is expected to release additional details Wednesday during a speech at the U.S. Capitol hosted by the American Enterprise Institute, a conservative think tank.", "Rubio released his video as the Senate returns to take up the issue of renewing emergency unemployment benefits that lapsed in December. Also, Democrats have announced that they will target income equality as a top issue this election year, including a push to raise the federal minimum wage.", "Here we will fact-check Rubio’s claim that nearly one in five Floridians live in poverty.", "Census data on poverty and Florida", "First, some background. The Census Bureau, the official federal record-keeper for poverty rates, determines poverty status by comparing annual income to a set of dollar values called poverty thresholds that vary by family size, the number of related children and the age of the householder. For example in 2012, that would mean a single person earning $11,720 or a family of four earning $23,492 would be considered poor.", "A Rubio spokesman told PolitiFact Florida that he arrived at his figure of nearly one in five Floridians based on a story in the Sarasota Herald-Tribune that said Florida’s poverty rate was 17.1 percent in 2012, according to the census. In 2012, Florida had a higher percentage living in poverty than the national average of 15.9 percent.", "Using the 2012 figure of 17.1 percent would place the number of Floridians in poverty closer to one in six than one in five.", "\"You’re correct that 17.1 is between one-in-six and one-in-five,\" Rubio spokesman Alex Conant told PolitiFact in an email. \"He said 'nearly' 1 in 5, but he could have said \"more than\" 1 in 6. Either way, I think we can all agree that 17.1 percent is too high a number.\"", "(The numbers are even worse if we zero in on Rubio’s home county of Miami-Dade where about one in four residents lived in poverty in 2012.)", "Another way to look at the percentage of Floridians in poverty is by using the census’ three year average between 2010-12. That average showed that 15.4 percent of Floridians lived in poverty -- or about one in six Floridians.", "One footnote: While we’re not rating Rubio’s claim that the war on poverty is a failure, we will note that in 1964 the official poverty rate was even higher nationally than it is now -- 19 percent.", "Our ruling", "Rubio said that \"nearly one in five Floridians live in poverty.\" He points to 2012 census data which showed that 17.1 percent of Floridians lived in poverty,  which would mean about one in six Floridians live in poverty. The percentage is slightly lower if we look at the three year average which showed 15.4 percent living in poverty -- still about one in six.", "Rubio’s numbers are close. We rate his claim Mostly True.", "Sen. Marco Rubio, \"War on poverty\" video, Jan. 5, 2012", "U.S. Census Bureau American Community Survey, Poverty 2000-2012, September 2013", "U.S. Census Bureau, Percentage of people in poverty by state using two- and three-year averages, 2010-2012", "U.S. Census Bureau, \"How the census bureau measures poverty,\" Accessed Jan. 6, 2014", "PolitiFact, \"Barbara Buono says nation’s poverty rate is at its highest level since 1964,\" Dec. 3, 2012", "Miami Herald, \"The recession is long gone, but poverty hasn’t budged in South Florida,\" Sept. 19, 2013", "Tampa Bay Times Buzz blog, \"Nelson, Rubio divided on unemployment benefit expansion,\" Jan. 6, 2014", "Politico, \"Dems seize on income inequality for 2014,\" Jan. 5, 2014", "Sarasota Herald-Tribune, \"Recovery no help to Florida poverty rate, Census finds,\" Sept. 19, 2013", "Interview, Alex Conant, spokesman for Sen. Marco Rubio,  Jan. 6, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]