["An image of a purported page from a newspaper has two headlines that read, “Ram Temple will never be built: Amit Shah” and “To win the trust of Hindus, it was necessary to kill Muslim farmers: Narendra Modi”. The rest of the stories on the page have been blurred. A Facebook page ‘Mulayam Putra Akhilesh’ shared the post writing, “If this is true, it is a grave sin.” (Archive link)", "अगर ये सच है, तो घोर पाप है।", "Posted by मुलायम पुत्र अखिलेश on Thursday, December 24, 2020", "A Facebook user named Syed Yusuf Iqbal also shared the picture asking whether it was real or fake.", "Several others have shared this clipping on Twitter and Facebook. Alt News also received a few requests to verify the image on our official WhatsApp number (+917600011160).", "This slideshow requires JavaScript.", "We performed a reverse image search and came across a BBC Hindi fact-check report dated November 28, 2018. The report carries the image of the viral newspaper clipping which has been termed fake, along with an image of another newspaper.", "Both resemble each other, except for a slight change in the headlines. There are spelling mistakes in the headlines of both pages. Amit Shah and Prime Minister Modi have been quoted in the viral newspaper. However, in the second newspaper, the statements have been attributed to SP leaders Mulayam Singh Yadav and Akhilesh Yadav. ‘Amar Ujala Bureau’ also appears in both images. Apart from this, the viral image is the bigger of the two. In the side-by-side comparison below, their similarities and differences have been marked in blue and red respectively.", "We found a few news articles after doing a keyword search of the statements attributed to Akhilesh Yadav and Mulayam Singh Yadav.", "1. “Mulayam: To win the trust of Muslims, it was necessary to fire at Hindus”", "Our keyword search first led us to an Amar Ujala report dated February 7, 2014. The headline reads, “If bullets weren’t fired, Muslims would have lost their trust”. There is a lot of similarity between the headline in the viral image and this one. According to the report, “He said that in 1990, he opened fire in Ayodhya and 16 people were killed. If he had not done so, the Muslims of the country would have lost faith in the SP. Mulayam Singh Yadav said that the BJP would always remember him because several BJP workers were beaten up amid the commotion during the Ram Janmabhoomi Movement.”", "2. “Ram Temple will never be built: Akhilesh Yadav”", "Alt News did not find any news reports stating that Akhilesh Yadav ever issued such a statement.", "A sub-heading printed below the above headline reads, “Administration on alert for the Ayodhya Yatra”", "We did find a few reports related to this claim. According to an Amar Ujala story dated August 26, 2013, “The district administration remained on high alert throughout the day on the Chaurasi Kos Yatra in Ayodhya. Police conducted searches throughout the night on Saturday at railway and bus stations. Police personnel also entered buses to conduct searches. If found suspicious, passengers were also questioned. The station officers were alerted.” This line also appears in a Jagran report dated August 23, 2013. According to this report, Mulayam Singh Yadav had banned Chaurasi Kosi Parikrama at the time. Opposing to this, the Vishwa Hindu Parishad said that if the government tried to stop the yatra, it would have to face a 1992-like situation.”", "Apart from this, another headline, “BJP making pawns out of holy men: SP”, is also visible in Jagran’s aforementioned story. It states, “The SP said that on the one hand, BJP is making pawns out of saints, and on the other, Congress is supporting the ban.”", "Therefore, an old clipping of a newspaper was edited, attributing false statements to Narendra Modi and Amit Shah.", "Donate Now", "Kinjal Parmar holds a Bachelor of Science in Microbiology. However, her keen interest in journalism, drove her to pursue journalism from the Indian Institute of Mass Communication. At Alt News since 2019, she focuses on authentication of information which includes visual verification, media misreports, examining mis/disinformation across social media. She is the lead video producer at Alt News and manages social media accounts for the organization.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]