["“Wal-Mart just told me they are not excepting cash,” claims a misspelled post shared more than 100,000 times in Canada the United States. It continues: “I showed them all a letter from a lawyer which says - if you’re not accepting ‘legal tender’ in Canada or the United States, the debt is considered paid with no legal recourse.”", "The post does not specify which Walmart store it is referring to or where the store was located.", "During the novel coronavirus pandemic, a shift toward cashless payments has increased, including Walmart encouraging customers to use the Walmart app for payments.", "However, a spokeswoman for the retail giant told AFP by email, “Walmart Canada continues to accept cash.”", "“We offer customers many choices to pay for in-store purchases, including cash, debit, credit, gift cards, prepaid debit and prepaid credit,” she added.", "It is also false to claim that in either Canada or the United States a debt will be “considered paid” if an establishment refuses cash payment.", "“It is up to the seller to determine the method of payment accepted for transactions. No law requires anyone to accept bank notes or any other form of payment to settle a commercial transaction,” a spokeswoman for the Bank of Canada told AFP via email.", "“While the term ‘legal tender’ describes the money approved in a country for paying debts or settling commercial transactions, it does not force anyone to accept that form of payment,” she added.", "The Bank of Canada has encouraged businesses to continue accepting cash payments despite the pandemic.", "“The risks posed from handling cash are no greater than those posed by touching other common surfaces like doorknobs, kitchen counters and handrails” the spokeswoman added.", "As long as the merchant notifies the consumer that he refuses cash, “he can legally do so in Canada,” said Alexandre Plourde, a lawyer and analyst at Option Consommateur, a Montreal-based consumer rights non-profit.", "“The ‘letter from a lawyer’ means nothing. It’s just an opinion on a paper and you can’t enforce anything with that.” he added.", "The US Federal Reserve says on its website that “There is no federal statute mandating that a private business, a person, or an organization must accept currency or coins as payment for goods or services.”", "Jay Stanley, a senior policy analyst from the American Civil Liberties Union, argued even before the pandemic that cashless stores were hard on low-income communities. “Participation in a cashless society presumes a level of financial stability and enmeshment in bureaucratic financial systems that many people simply do not possess,” he said.", "AFP Fact Check debunked similar claims that Whole Foods Market would no longer accept cash.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]