["The post has been shared more than 200,000 times since it was published in March 2016. The claims it made were not far off -- laboratory testing on the idea was, indeed, well underway by the time the post went up on Facebook, as this story from 2014 explains.", "Private investor funding, the story continues, began rolling in. The four engineering students set up a company to develop the test, Undercover Colors, and had walked away with a $13,000 cash prize after winning a state entrepreneurship competition.", "Soon Ankesh Madan, Stephen Gray, Tasso Von Windheim and Tyler Confrey-Maloney -- the students correctly pictured in the post -- were generating more hype, as this 2015 article (see screengrab below) on the university’s website describes.", "A year later, the Facebook post went up. Today, it gives the impression that the nail polish is readily available.", "However, as described by this Business Insider piece, the start-up company burned through $8.2 million in investor funding before finally ditching the nail polish idea for the SipChip, a small, coin-sized disk that works in a similar way to a pregnancy test.", "The user places a few drops of their drink onto the surface pad and depending on whether the beverage has been spiked, one or two lines will appear, indicating if it is safe to drink.", "The test kit was finally released for sale in September 2018 -- you can find some of the news coverage of the launch here and here. You can see a YouTube demonstration video of the product, released in January 2019, below.", "Barbara Cook, the CEO of Undercover Colors, explained to AFP in an email how SipChip works.", "“Our test works very similar to a lateral-flow pregnancy test. SipChip and the test strip at its core, were specifically engineered to work in nearly all beverages, and at the moment it detects several types of Benzodiazepines including Rohypnol (also known as \"Roofies\"), Xanax, Valium, Serax, Versed, and Restoril. It only requires a drop of beverage and within 30 seconds the results begin to develop,” Cook told us.", "Like a pregnancy test, the results are interpreted by the presence of either two lines -- meaning the beverage is safe -- or one line, which means drugs have been detected.", "Cook continued, “The SipChip will detect drugs at levels at, or below, the dose a person would feel any physiological effects. SipChip has achieved over 99% in the more than 12,000 devices tested. In the future, we fully intend on incorporating other classes of drugs into the SipChip.”", "In an earlier email, the company’s sales and marketing representative Suzie Bury told AFP the founding foursome were still involved in the business and confirmed the nail polish concept was abandoned “because it failed consumer testing and it had too many limitations for us to be comfortable launching it”.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]