["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "The chairman of the Texas Democratic Party predicted delegates to its state convention in Dallas would endorse a platform favoring paths to citizenship for hard-working, tax-paying illegal immigrants in the country and legal residency for children of illegal immigrants who came here through no choices of their own.", "In advance of his party’s gathering, where he won a fresh two-year term, Gilberto Hinojosa went on to suggest the Republican Party of Texas recently settled on an approach to immigration with a decidedly negative vibe. Hinojosa told KERA, the Dallas public radio station: \"The party platform of the Republican Party says deport everybody and to hell with it. And that’s just not what America’s all about. So that’s going to be a big contrast, and I think it’s going to affect substantially the attitude a lot of Hispanics have toward Republicans.\"", "It’s been widely reported that Texas Republicans, who met in Fort Worth in early June 2014, removed platform language from 2012 endorsing a federal guest-worker program. Also, as the Austin American-Statesman noted in a June 7, 2014, news story, the platform was stripped of \"any provision that would create an opportunity for immigrants living and working in the United States without legal sanction to receive provisional visas.\"", "Did the party also say \"deport everybody,\" as Hinojosa said?", "The word \"deport\" isn’t in the 2014 Republican platform, which has a two-page section on immigration that opens by saluting the importance of immigrants in the nation’s history.", "It goes on to say: \"It remains imperative to create fair and consistent procedures that will enable freedom-loving, hard-working and law-abiding immigrants to join us, by providing them an efficient, practical method of legal entry, so they can lawfully take positions where their labor is needed, without exploitation or harassment.", "\"Our national interests are poorly served by our broken, embattled, and outdated immigration system, and patchwork attempts to mend its deficiencies will not prepare us to continue to meet the challenges of an increasingly complex global economy that demands the legal movement of people to fill jobs at all skill levels.\"", "Among other elements, the immigration plank calls for more officers on the border, an end to the possibility of in-state college tuition for certain illegal residents and protection of the ability of law officers to ask into the immigration status of someone in custody.", "The closest the plank comes to deportation is a line stating no form of amnesty should be granted, \"including the granting of legal status to persons in the country illegally.\" Such individuals, we suppose, would remain subject to deportation at any time.", "For a slightly longer perspective, we looked next at the state Republican Party platform adopted by delegates to its June 2012 convention. The 2012 immigration plank opens: \"Because of decades-long failure of the federal government to secure our borders and address the immigration issue, there are now upwards of 11 million undocumented individuals in the United States today, each of whom entered and remain here under different circumstances.", "\"Mass deportation of these individuals would neither be equitable nor practical,\" the 2012 platform says, going on to oppose \"blanket amnesty\" while endorsing a temporary guest-worker program \"to bring skilled and unskilled workers into the United States for temporary periods of time when no U.S. workers are currently available.\"", "To our email request for the basis of Hinojosa’s claim, Emmanuel Garcia, spokesman for the state Democratic Party, said Hinojosa was \"referring to the emotions that many Latinos and immigrants feel with the rhetoric at the\" 2014 \"GOP convention and the changes in the GOP platform. You are correct those exact words are not there.\"", "Our ruling", "Hinojosa said the Republican Party platform \"says deport everybody and to hell with it.\"", "The heck you say. The Texas GOP platform opposes illegal immigration and any legal status for unauthorized U.S. residents, which leaves deportations a possibility. But the platform doesn’t venture as far as the chairman said. It doesn't call for deporting everybody living here illegally.", "We rate this claim as False.", "News story, \"Cruz wins presidential straw poll; GOP immigration stance upended,\" Austin American-Statesman, June 7, 2014 (accessed June 27, 2014)", "Documents, \"Report of Permanent Committee on Platform and Resolutions As Amended and Adopted by the 2014 State Convention of the Republican Party of Texas,\" June 2014; \"2012 REPUBLICAN PARTY OF TEXAS  Report of Platform Committee,\" June 2012 (accessed June 27, 2014)", "Email, Emmanuel Garcia, communications director, Texas Democratic Party, June 27, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]