["About this rating", "On 28 February 2018, the Associated Press published photographs showing people wearing brightly colored robes and crowns (some of which appeared to have been crafted from bullets) carrying AR-15 firearms in what was termed a \"commitment ceremony.\" The surreal scene showcased in the photographs prompted readers to inquire whether it was actually real:", "Worshippers clutching AR-15 rifles and some wearing bullet crowns, participated in a commitment ceremony today at World Peace and Unification Sanctuary, in Newfoundland, Pa. The event led a nearby school to cancel classes for the day. Photos @jacquelinelarma pic.twitter.com/GXzrZeK41z", "— AP Images (@AP_Images) February 28, 2018", "The AP is a legitimate news agency, and — as reality is sometimes much stranger than fiction — this story and these photographs are authentic. They show roughly 600 members of the World Peace and Unification Sanctuary church in Newfoundland, Pennsylvania, considered by some to be a cult.", "The sect has undergone some rebranding since its heyday, but it is not new. It is an offshoot of the notorious Unification Church, perhaps best known for its adherents — who are sometimes colloquially called \"Moonies,\" after its late founder, Rev. Sun Myung Moon, described by RationalWiki as \"a nutjob from South Korea who claimed he was the Second Coming of Jesus.\"", "His son, Rev. Sean Moon, oversees the Newfoundland congregation; his other son, Justin Moon, owns a gun manufacturing business — which sponsored the event, as reported by the Standard-Speaker:", "Moon, who refers to himself as the “Second King” and anointed heir to the “True Father,” urges followers to arm themselves to defend their families, their communities and “the nation of Cheon Il Guk,” the kingdom of God the church believes is prophesied in biblical Scripture.", "Through its Rod of Iron Ministries affiliate, the church also was among the sponsors for a pro-gun-rights “President Trump Thank You Dinner” this past Saturday in Matamoras, Pike County. Kahr Arms, a gun manufacturing company based in Greeley, Pike County, and owned by Moon’s brother, also was a sponsor of that event.", "The photographs were taken at a ceremony in which couples were asked to bring their \"rods of iron,” a phrase from the apocalyptic Book of Revelation in the New Testament that Moon has interpreted rather specifically to mean AR-15s. The Philadelphia Inquirer had still more about the event:", "The ceremony’s official name was the Cosmic True Parents of Heaven, Earth and Humanity Cheon Il Guk Book of Life Registration Blessing. It was part of the church’s weeklong “Festival of Grace,” which included a “President Trump Thank You Dinner” on Saturday. Wednesday’s church ceremony garnered international attention because of the call for couples to bring AR-15s, a popular semi-automatic rifle that has been used in many of the nation’s worst mass shootings, including the Valentine’s Day massacre at Marjory Stoneman Douglas High School in Florida.", "“The country is nervous,” said church follower Carolyn Burkholder, 70.", "Burkholder was adjusting a trigger lock on her AR-15 in the trunk of her car, near a child’s car seat. She wore a crown.", "“Some people see this gun, and they get scared,” she said. “I used to be scared a little.”", "The ceremony so spooked the community that the local school district closed a nearby elementary school and moved children to other locations that day.", "Nark, Jason. \"Guns and Religion Mix as Pa. Church Blesses Couples Toting AR-15s.\"\r\n  The Philadelphia Inquirer. 1 March 2018.", "Rubinkam, Michael. \"Worshippers Clutching AR-15 Rifles Hold Commitment Ceremony.\"\r\n  Associated Press. 28 February 2018.", "Wright, Emma. \"Church Ceremony Involving AR-15 Rifles Causes Controversy.\"\r\n  WFMZ. 28 February 2018.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]