["By Jessica McDonald", "Posted on June 25, 2020", "With some states posting record numbers of new COVID-19 cases, President Donald Trump continues to downplay the concern, falsely asserting that cases are up “only because of our big number testing,” and pointing to the falling number of daily COVID-19 deaths.", "Data shows that in many places, the uptick in cases outstrips the increase in testing — and experts say it’s too soon to know whether a surge in deaths will follow.", "In recent weeks, the number of new coronavirus cases in the U.S. has spiked, particularly in places such as Texas, Arizona and Florida, each of which has broken records for the highest number of newly reported infections.", "Trump, however, has repeatedly denied that the rise in cases reflects increased transmission of the virus, and has instead insisted that increased testing is the cause.", "The president began pinning the blame on testing as early as June 15, when in a tweet he said that because U.S. testing “is so much bigger and more advanced than any other country … it shows more cases.” He called testing a “double edged sword” because it is “good to” have, but “[m]akes us look bad.”", "As we have explained before, the United States’ testing program has not performed as many tests as other countries given the size of the nation’s outbreak. And while testing can explain some of the additional cases, it fails to account for all of them, as the proportion of positive tests is increasing in many states.", "At a June 20 campaign rally in Tulsa, Oklahoma, Trump once again called testing a “double-edged sword” and even claimed that he had asked his “people” to “slow the testing down, please.” The White House said the comment was a joke, only to have Trump tell a reporter two days later, “I don’t kid.”", "There is no evidence that Trump ever asked any official to impede testing, and in a congressional hearing multiple members of the coronavirus task force said they had not been asked to put the brakes on testing.", "“[T]o my knowledge, none of us have ever been told to slow down on testing. That just is a fact. In fact, we will be doing more testing,” said National Institute of Allergy and Infectious Diseases Director Dr. Anthony Fauci, emphasizing that testing was important for both contact tracing and for surveillance.", "Nevertheless, Trump continues to perpetuate the false idea that testing — and testing alone —  is why the U.S. is seeing a surge in cases, despite mounting hospitalizations and a rise in the percentage of tests coming back positive in certain parts of the country.", "“Cases are going up in the U.S. because we are testing far more than any other country, and ever expanding,” Trump declared in an early morning June 23 tweet. “With smaller testing we would show fewer cases!”", "Later in the day, the president doubled down in another tweet, this time also pointing to the disconnect between the rising case counts and the falling number of COVID-19 deaths.", "“Cases up only because of our big number testing,” he wrote, retweeting another person’s graph plotting daily COVID-19 deaths in the U.S. “Mortality rate way down!!!”", "The same day, Trump also said that with more tests, more mild cases were being detected.", "“By having more cases, it sounds bad, but actually what it is, is we’re finding people. Many of those people aren’t sick or very little. You know, they may be young people,” he told reporters on the South Lawn before departing for Arizona. “But what’s happened is, because of all of the cases that we find, we have a very low mortality rate, just about the best in the world.”", "The United States’ mortality rate is not “just about the best in the world.” According to statistics compiled by Johns Hopkins University, out of the 20 countries most affected by COVID-19, the U.S. has the seventh highest observed case-fatality ratio for COVID-19 and third highest per-capita death rate.", "In another tweet on June 25, Trump once again returned to the same argument. “The number of ChinaVirus cases goes up, because of GREAT TESTING, while the number of deaths (mortality rate), goes way down,” he said. “The Fake News doesn’t like telling you that!”", "It’s true that daily COVID-19 deaths continue to decline, and it’s possible that with increased testing more mild cases are being caught relative to earlier in the pandemic. But scientists say it’s premature to conclude that the current upticks won’t lead to increases in mortality later.", "As we have noted before, Trump is wrong to say that testing is the only reason why cases are increasing in the U.S. On the contrary, data from some of the places being hardest hit shows that the case numbers are outpacing any increases in testing, since the percentage of positive tests is climbing — sometimes dramatically so.", "In Arizona, for example, the seven-day average for the test positivity rate, as analyzed by Johns Hopkins University, is now 23%, up from around 7% in mid-May. Texas is also seeing an increase, from a rolling average of around 5% at the end of May to more than 11% on June 24.", "And in Florida, where the number of tests performed daily has of late been flat or falling, 14% of tests are coming back positive — well above the recommended target of 5%, which the state had been hitting for nearly all of May.", "Even the national daily test positivity rate, which was below 5% in early June, has started to tick up, reaching 7.5% on June 24, according to the COVID Tracking Project.", "Katherine Ellingson, an epidemiologist at the University of Arizona, told us that the differential between case counts and tests “suggests that community transmission is increasing, and that increasing case counts are not simply an artifact of testing.”", "“Further, the suggestion that we are over-testing as a nation is misleading. Certainly in Arizona, our current testing capacity is woefully inadequate,” she said, noting the state’s high test positivity rate. “This suggests that testing capacity is lagging behind levels of transmission. Indeed testing is not available for all who seek it in our state, and delays in test acquisition and receipt of results weaken the utility of those tests in preventing spread.”", "Some areas are also seeing increases in COVID-19 hospitalizations, which should not occur if additional testing is the only driver of more coronavirus cases.", "In Texas, COVID-19 hospitalizations have nearly tripled since Memorial Day. And in Arizona, the number of positive or suspected patients in hospitals across the state hit a record high of 2,453 on June 24, according to the state’s COVID-19 dashboard (see “Hospital COVID-19 Specific Metrics”).", "“This is highly concerning because it reflects increasing absolute levels of severe COVID-19 illness among Arizonans,” said Ellingson, “as well as a narrowing safety margin for anyone needing hospital care for any reason.”", "As Caitlin Rivers, an assistant professor at Johns Hopkins Bloomberg School of Public Health, explained on Twitter on June 24, testing does turn up more cases.", "“That is indeed the point. But in many of the states experiencing a resurgence, hospitalizations are up and the percent of tests that are positive is rising. Those are signs of trouble,” she said, adding, “It’s not just testing.”", "Notably, some politicians have now acknowledged that there are concerning outbreaks in these areas.", "“Even with the testing increasing or being flat, the number of people testing positive is accelerating faster than that,” said Florida Gov. Ron DeSantis on June 20. “You know that’s evidence that there’s transmission within those communities.”", "DeSantis, who is a Republican, initially denied his state was experiencing an uptick in community spread of the virus.", "Texas Gov. Greg Abbott, also a Republican, said on June 22, “To state the obvious, COVID-19 is now spreading at an unacceptable rate in Texas, and it must be corralled.”", "On June 25, Abbott announced a pause on reopening the state — and in an effort to avoid overtaxing hospitals, prohibited elective procedures in four counties most affected by the coronavirus.", "In his tweets, Trump also touted the United States’ mortality figures, emphasizing that COVID-19 deaths are in decline.", "That’s true — according to the COVID Tracking Project, national COVID-19 fatalities are down to fewer than 600 a day, using a seven-day rolling average, from a peak of more than 2,000 in mid-April.", "But focusing on the death figures when thinking about the current uptick in COVID-19 cases is potentially misleading, experts said, because it could be that the deaths will simply come later.", "“Deaths always lag considerably behind cases,” Fauci said in his June 23 testimony, in response to a question about the disconnect between the rising case counts and declining deaths. “You might remember that at the time that New York was in their worst situation where the deaths were going up and yet the cases were starting to go down, the deaths only came down multiple weeks later.”", "“So you’re seeing more cases now while the deaths are going down,” Fauci continued. “The concern is if those cases then infect people who wind up getting sick and go to the hospital, it is conceivable you may see the deaths going up. So I think it’s too early to say because the deaths are going down.”", "In a June 16 press call, Harvard epidemiologist Caroline Buckee also expressed this concern.", "“I suspect in many cases, it’s just the time lag,” she said when asked why Florida hadn’t seen an increase in deaths, despite the increased COVID-19 caseload. “The cases that happen now will result in deaths in about three weeks. So we think that the time lag between cases and hospitalization is about two weeks, and then another week for people to start dying.”", "Other scientists have noted that the lag can be even longer, and that death data may still be trickling in as fatalities get reported.", "“That can lag by a month or even more, depending on how long the person was ill,” said Cindy Prins, an associate professor of epidemiology at the University of Florida, in a phone interview. She added that in her state, there hasn’t been a big decrease in mortality since the end of May.", "“It’s looking kind of flat right now,” she said. “But we haven’t really necessarily caught up with those numbers yet to know that they’re the final numbers.”", "There are hints that the current surge in cases might lead to fewer deaths than before. In Florida, for example, Prins said there had been a shift toward people ages 15 to 34 testing positive, and Ellingson said in Arizona, the average age for diagnostic testing “has dropped slightly.”", "The decline in age could reflect the fact that younger and working-age people are heading back to work or are socializing more without doing physical distancing, Ellingson said, or that older folks are being especially cautious, or both.", "Given that younger people generally are at lower risk for hospitalization and death, Prins said, the downward trend in age could be a positive sign, at least for now.", "“But the worry is that people within those groups still can get very sick and die,” she said. “They’re not invincible.”", "And young people can still spread the virus. “I can’t predict what’s going to happen, but the concern would be as you get more circulation, even if it is among younger people,” Prins said, “that that’s going to skew towards our older people again as they get exposed.”", "Johns Hopkins’ Rivers said in a tweet that the fact that deaths are down nationally “could mean more mild infections are being caught, or that the average age of new cases is drifting down or that treatments are improving.”", "But, she added, “Most states don’t report case severity or time-varying age breakdowns, so it’s tough to say,” and “deaths are also a delayed indicator, so I hope this holds.”", "Buckee, too, said that more infections in younger people could be due to older people avoiding interactions with others, or young people not practicing physical distancing — and noted that it’s also possible that hospitals have learned how to better manage COVID-19 patients.", "“[W]e don’t know yet which is most likely, and I would say it’s too early to rule out an uptick in deaths from the recent increase in cases,” she told FactCheck.org in an email.", "William Hanage, an associate professor of epidemiology at Harvard T.H. Chan School of Public Health, told us in a June 25 press call that he thought the finding of more infections in younger people across the Sun Belt offered a “crumb of comfort.”", "“What this likely means is that the outbreak across the South is being recognized at a somewhat earlier stage than the outbreak in the Northeast was,” he said. “And that’s a good thing, because it means that if there’s any window of opportunity for action, it’s like right now — and [the] things you do now will have great consequences. However, if you do not take action now, then the community transmission is going to continue to build. And then, sooner or later, it is going to get into those at risk.”", "“In time, those people will start to go to the hospital and they will start to die,” Hanage said. “It may not be immediate. It may be a couple of weeks, it may be a little bit longer. But it will happen — and remember it’s happening in a far larger total population than the outbreaks in the spring were.”", "In other words, even though it’s good news that deaths are down now, it’s not yet clear if that trend will continue — and that will depend in part on how communities respond.", "Hanage said if officials are looking at death counts today, they should be prepared to look again in a month or so. “Hold on to that statistic if you’re going to follow it, because you might not find it so attractive in a couple weeks,” he said.", "Editor’s note: FactCheck.org does not accept advertising. We rely on grants and individual donations from people like you. Please consider a donation. Credit card donations may be made through our “Donate” page. If you prefer to give by check, send to: FactCheck.org, Annenberg Public Policy Center, 202 S. 36th St., Philadelphia, PA 19104.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]