["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Rochester Mayor Lovely Warren holds a press conference about the coronavirus on April 8, 2020.", "• At the time of her comment, the share of African American deaths from the coronavirus in Monroe County, N.Y., was only slightly higher than the African American share of the county’s population.", "• However, African Americans accounted for a significantly higher share of intensive care unit hospitalizations and non-ICU hospitalizations in the county. The same was the case for Hispanics and non-ICU hospitalizations.", "As the coronavirus spreads across the country, officials are taking increasing notice of patterns of infections and deaths among people of different races.", "In some states, provisional data through April 21 collected by the Centers for Disease Control and Prevention showed disproportionately high rates of death from coronavirus among African Americans in Georgia, Louisiana, Maryland, Michigan, Mississippi, New York, and Wisconsin. Experts have suggested that a variety of factors may be responsible, including disparities in income and health insurance and a higher rate of pre-existing conditions.", "The question of racial disparities in coronavirus impact came up during an April 8 news conference with Lovely Warren, the mayor of Rochester, N.Y.", "Warren opened the press conference by saying, \"I'm going to answer some questions you have regarding disparities across the country happening in the African American community as it pertains to the coronavirus and the number of deaths and the number of people being diagnosed with it.\"", "A reporter asked, \"What are we seeing locally here in Rochester? How badly is Rochester being impacted, especially the minority population?\"", "Warren responded, \"We are not seeing, at a high rate, that level of disparity right now,\" Warren said. \"We do believe if we do not change the social distancing, if we do not stay at home, we will see the level of disparity that we see across the country. … Today we are basically on par, a little bit up, from the population numbers, but we don’t see that disparity as much here in Monroe County as we’re seeing across the country.\"", "However, the disparities were already evident on the day Warren held the press conference.", "On the same day as the press conference, the Monroe County Department of Health released the racial and ethnic breakdown of coronavirus hospitalizations in the county, both in non-intensive care units and ICUs, as well as deaths from the virus.", "Here’s a summary of that data:", "The health department data shows that for African Americans, the percentage of deaths from coronavirus was slightly higher than their share of the population -- African American residents accounted for 18.2% of deaths, compared to 16.2% of the county’s overall population. That was in line with Warren’s comment.", "However, the hospitalization rates for African Americans in the county were significantly higher. African Americans accounted for 27.9% of the non-ICU hospitalizations in the county and 53.8% of ICU hospitalizations.", "Meanwhile, non-ICU hospitalizations were disproportionately high for Hispanics -- 18.6% of such hospitalizations, compared to an overall 9% share of the population.", "Warren did acknowledge this fact in passing later in her press conference, saying, \"What we do know is that people in the ICU, people of color, are in the ICU at a higher rate than other folks.\" However, on multiple occasions during the press conference she referred to the disparities as minor.", "Justin Roj, the mayor’s director of communications and special events, said Warren stands by her statement.", "A footnote: Subsequent data has shown that the racial disparity has grown. Here’s a look at the data through April 17:", "The data shows that through April 17, African American hospitalization rates had grown to 67% of ICU hospitalizations and 39% of non-ICU hospitalization rates. And the share of deaths represented by African Americans rose to 24%, which exceeds African Americans’ 16% share of the county’s population.", "Meanwhile, Hispanics have accounted for 22% of ICU hospitalizations, which is more than double their 9% of the population.", "Referring to racial comparisons on coronavirus statistics in Monroe County, N.Y., Warren said the impact on minorities is \"basically on par, a little bit up, from the population numbers,\" meaning that \"we don’t see that disparity as much here.\"", "That was essentially accurate when looking at the share of deaths from the coronavirus. But at the time of her comment, African Americans accounted for a significantly higher share of ICU and non-ICU hospitalizations in the county, and the same was the case for Hispanics and non-ICU hospitalizations.", "The statement is partially accurate but needs additional information, so we rate it Half True.", "Centers for Disease Control and Prevention, Provisional Death Counts for Coronavirus Disease (COVID-19): Data Updates by Select Demographic and Geographic Characteristics, accessed April 21, 2020", "BBC, \"Coronavirus: Why some racial groups are more vulnerable,\" April 20, 2020", "Channel 13 WHAM-TV, Lovely Warren News Conference, April 8, 2020", "U.S. Census Bureau, data for Monroe County, New York, accessed April 21, 2020", "White House, \"Remarks by President Trump, Vice President Pence, and Members of the Coronavirus Task Force in Press Briefing,\" April 7, 2020", "Centers for Disease Control and Prevention, Hospitalization Rates and Characteristics of Patients Hospitalized with Laboratory-Confirmed Coronavirus Disease 2019 — COVID-NET, 14 States, March 1–30, 2020, April 8, 2020", "Interview with Justin Roj, Lovely Warren’s director of communications and special events, April 20, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]