["About this rating", "In June 2019, a short video supposedly showing a lobster scrawling a series of numbers went viral on social media. One iteration posted to Twitter garnered more than 3.5 million views, while another posting on Facebook racked up an additional 4.5 million views.", "The video was originally posted on the Chinese short-video app Douyin, a sister application to the internationally popular TikTok. While we have been unable to locate the original video on Douyin, what appears to be a copy of it was posted to Facebook by You Shan:", "!function(r,u,m,b,l,e){r._Rumble=b,r[b]||(r[b]=function(){(r[b]._=r[b]._||[]).push(arguments);if(r[b]._.length==1){l=u.createElement(m),e=u.getElementsByTagName(m)[0],l.async=1,l.src=\"https://rumble.com/embedJS/ucxbq\"+(arguments[1].video?'.'+arguments[1].video:'')+\"/?url=\"+encodeURIComponent(location.href)+\"&args=\"+encodeURIComponent(JSON.stringify([].slice.apply(arguments))),e.parentNode.insertBefore(l,e)}})}(window, document, \"script\", \"Rumble\");", "Rumble(\"play\", {\"video\": \"v58oop\",\"div\": \"rumble_v58oop\",\"autoplay\":2});", "The majority of this video's millions of viewers seemed to realize this fishy footage didn't actually show a literate lobster, but others were puzzled.", "Have lobsters really learned to write numbers? In short, no.", "As many netizens have already pointed out, the top half of the pen cannot be seen in this video. It's likely that whoever created this video was controlling the pen from outside the camera frame.", "While a second sketcher may certainly explain how the above-displayed video was created, another video supposedly showing a lobster writing (this time with the full pen in frame) was also going around on social media:", "Again, can lobsters write numbers? In short, still no.", "American audiences are likely familiar with the ability to use filters, templates, and other editing gimmicks on apps such as Snapchat and Instagram. For instance, a \"baby filter\" on Instagram allows users to make themselves (or President Trump) appear much, much younger. The above-displayed video was created with the 龙虾写字 (lobster writing) template on the Chinese app 趣推 (Fun Push).", "The website Baidu provides a tutorial on how to use this template. The website also includes a few screenshots showing this same lobster writing a variety of words, numbers and phrases (translated and edited for clarity):", "The crayfish writing video seen on the app does not exist in real life. If you want to make this video, you need to use the fun app. Let's take a look at the production process ...", "1. Open the Fun Push homepage and click on \"View All\" to the right of \"Daily Update.\"\n2. Open the \"Daily Update\" interface and find the \"Lobster Writing\" template and click on it.\n3. Open the \"Lobster Writing\" interface and click \"make.\"\n4. Open the production interface, click on the text in the screen, then edit the new text, then click \"Finish.\"", "These viral videos don't actually show lobsters (or crayfish) using a writing tool to scrawl words and numbers on a sheet of paper. These videos either feature a simple video trick (doing something off-screen to make something appear to happen on-screen) or a pre-made, digital editing template.", "Verberg, Gabi.   \"Are Douyin and TikTok the Same?\"\r\n    What's on Weibo.   \"9 January 2019.\"", "Baidu.   \"抖音小龙虾写字是怎么拍的\"\r\n    14 June 2019.", "Pets.Ettoday.Net.   \"小龍蝦右螯夾0.38！認真在紙上「寫6數字」　網笑：報明牌嗎？\"\r\n    8 June 2019.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]