["A news clip of a Times Now broadcast is widely circulating on social media where anchor Rahul Shivshankar says that young Hindus are being radicalised in coaching and tuition centres in Kerala. A ‘rate card’ which puts a price tag on non-Muslim women was flashed during the broadcast to support the claim. The price range on the alleged card puts a Hindu Brahmin girl at Rs. 6 lakh, Rs. 3 lakh for a Jain girl and Rs. 7 lakh for a Sikh girl.", "The caption shared with the broadcast claims that ISIS is selling Hindu girls in Kerala. The rate of the girls is based on their caste. It further suggests that Muslim boys marry these girls who study in tuition centres and sell them abroad as prostitutes. From the Facebook profile of one Ganapathi Rao, the clip has attracted 80,000 views and nearly 3,000 shares so far.", "కేరళలో ISIS హిందూ అమ్మాయిలను అమ్మకంకి పెట్టింది. అమ్మాయి యొక్క కులం బట్టి రేటు ఫిక్స్ చేసారు. ముందుగా ముస్లిం అబ్బాయిలు Tution centres, విద్యా సంస్థలలో చదువుతున్న అమ్మాయిలను ప్రేమ పేరు చెప్పి పెళ్లి చేసుకుని తరువాత ఈ విధంగా విదేశాల్లో వారిని వ్యభిచార ముఠాలకు అమ్ముతారు. మేము మతోన్మాదులు కాబట్టి ఆ నరకంలో పడవద్దు అని చెబుతున్నాము అబ్బీ అలా కాదు మీరు వారి మీద నిందలు వేస్తున్నారు అంటే చేసేది ఏమీ లేదు.", "Posted by Ganapathi Rao on Wednesday, 30 October 2019", "“కేరళలో ISIS హిందూ అమ్మాయిలను అమ్మకంకి పెట్టింది. అమ్మాయి యొక్క కులం బట్టి రేటు ఫిక్స్ చేసారు. ముందుగా ముస్లిం అబ్బాయిలు Tution centres, విద్యా సంస్థలలో చదువుతున్న అమ్మాయిలను ప్రేమ పేరు చెప్పి పెళ్లి చేసుకుని తరువాత ఈ విధంగా విదేశాల్లో వారిని వ్యభిచార ముఠాలకు అమ్ముతారు. మేము మతోన్మాదులు కాబట్టి ఆ నరకంలో పడవద్దు అని చెబుతున్నాము అబ్బీ అలా కాదు మీరు వారి మీద నిందలు వేస్తున్నారు అంటే చేసేది ఏమీ లేదు,” reads the complete message in Telugu.", "The video is viral on Facebook. It has also been circulated using an English caption, “Cochin based ISIS Converts Hindu girls sells them online. See its rate cards,” especially on Twitter.", "Is this true that Cochin based ISIS Caliphate organization is Converting Hindu girls and selling online.", "See the rate cards. pic.twitter.com/AaqQnr6Wpk", "— Amit Agarwal (@AmitAgarwal9) October 29, 2019", "Shivshankar can be heard saying during the show, “In this hub of ISIS activity, young Hindus are being radicalized, they might be saying that there is nothing untoward happening there but we can confirm that young Hindus are being radicalized in coaching centres and tuition classes by committed agents of the caliphate. Mysterious rate cards like the one on your screen are being distributed. It is these rate cards, ladies and gentlemen, are being held up as incentives. Look at what this rate card says, it puts up a price on religion, on your faith, if you look closely at the rate card, you’ll see ladies and gentlemen, you’ll see interesting details. I can’t even begin to tell you ladies and gentlemen the kind of insidious fine print that is on this rate card, to convert Hindus, caste Brahmins, you have to pay five lakhs, you get paid five lakhs, ladies and gentlemen. A Hindu Brahmin girl – five lakhs, seven lakh rupees for a Sikh Punjabi gal, for a Gujarati Brahmin and so on and so forth, Hindu Khastriya gal – four and a half lakhs, Hindu OBC/SC/ST – two lakhs, Buddhist girl – one and a half lakh, a Jain girl 3 lakh rupees, the caliphate has put a price on your faith.”", "The ‘rate card’ flashed by Times Now was debunked by Alt News when it was broadcast in June 2017.", "#WATCH | Caliphate puts a price on your faith | Conversion rate card accessed #CaliphateConvertsHindus pic.twitter.com/CYjzuSkyST", "— TIMES NOW (@TimesNow) June 23, 2017", "But the pamphlet has been circulating online for several years and Alt News was able to trace the earliest version to February 5, 2010, in a blog titled ‘Sikh and Islam’.", "Several clues in the ‘rate card’ hint at its falseness – it has the phrase “in the name of allah……most merciful, most benificiary“, while the usual phrase used is “In the Name of Allah, the Most Beneficent, the Most Merciful“. Times Now and viral social media messages claim that the ‘card’ was issued by the Caliphate. Such a mistake would be unusual of an Islamic organisation.", "However, it is the heart-shaped image at the top of the pamphlet that gives the most concrete evidence of this poster being photoshopped. The gun-shaped image within the heart is actually the flag of Hezbollah, the Lebanese Shi’a Islamist militant group. The heart-shaped image has been independently in circulation since 2006.", "This false claim has also been published by various fake news sites like Hindutva.Info, Jagruk Bharat and Hindu Existence in February 2016. It was also featured in Saamana, the mouthpiece of the Shiv Sena in 2010.", "Despite debunking the fake rate card in 2017 and again in 2018, Times Now is yet to take down the disinformation.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]