["The photo of a multi-storeyed building is viral on Twitter with the claim that it is a 400-bed hotel at Jamia Milia Islamia, where only Muslim students aspiring to be IAS officers can live. Several users shared the same photo with the same caption.", "Among them is a user named Vivek Mishra (@PrayagrajWale). His tweet was retweeted over 4,200 times and views close to 4.5 lakh times.", "ये जामिया मिल्लिया का होस्टल है जहां 400 बिस्तर की सुविधा है ,आपको जानकर आश्चर्य होगा कि यहां पर सिर्फ अल्पसंख्यक ही आईएएस बनने के लिए मुफ्त पढाई कर सकते हैं ,वो भी हमारे टैक्स के पैसों पर , खैर हमें क्या सबका साथ सबका विकास का उदाहरण कल हम कर्नाटक और मणिपुर में देख ही चुके हैं। pic.twitter.com/PE0RKvkTwS", "— Vivek Mishra (@PrayagrajWale) May 16, 2023", "Other instances of the same post can be seen here. The photo and the claim are viral on Twitter.", "In 2021 the picture went viral on Facebook with the claim that it was a hostel made by the Congress government in 2012 and in this hostel, people belonging to Hinduism and other religions could not stay. The message also claimed that Muslim students from J&K were accommodated in the college hostel for free.", "A Facebook user named Meena Agarwal shared the photo with the above claim. The post is still available on the platform.", "Posted by Meena Agarwal on Monday, 23 August 2021", "Alt News has also received fact-check requests for the claim on the official mobile application.", "The same image was earlier widespread in the name of Jawaharlal Nehru University (JNU).", "The message was viral on Facebook.", "First of all, the picture does not show ‘J&K hostel’ at JNU. The board in front, which is faintly visible in the picture, reads ‘Jamia Millia Islamia.’", "A keyword search revealed Union minister Rajnath Singh and then Jammu and Kashmir chief minister Mehbooba Mufti were invited to inaugurate a girls’ hostel at Jamia Millia Islamia (JMI) in 2017. “The hostel will cater to female students from J&K pursuing any course at the Central University. The hostel has 135 rooms,” reported The Hindu on November 17, 2017.", "The inauguration was postponed amid protests, however, the 400-bed facility was made accessible to students in the following months.", "“The plan for the hostel was first conceived in 2012 when a Memorandum of Understanding (MoU) was signed between Jamia and the Ministry of Home Affairs. A senior Ministry official said the project was expedited after Mr. Singh’s visits to the State over the past two years,” The Hindu’s report further said.", "The claim that Congress constructed the hostel in 2012 is false. Even though an MoU between JMI and then Congress government was signed in 2012, the hostel was constructed under BJP’s rule.", "Former provost of Jamia’s J&K hostel Sabiha Zaidi confirmed to Alt News that the facility did not accommodate students on the basis of state or religion. “It is open to female, full-time students, same as the other girls’ hostels in the campus. The college does offer some edge to students from the northeast and Jammu and Kashmir who might find it difficult to look for alternate accommodation but the claim that students from other states cannot apply for admission is false. The J&K Hostel has been expanded since its inception to accommodate more candidates,” she said, adding that students also had pay hostel fees.", "According to the JMI hostel manual 2019-2020, J&K Girls’ Hostel has 700 beds and students whose parents/spouse reside and work in Delhi/NCR are “not necessarily eligible for the hostel accommodation”. Hostel admission to the rest of the students is based on merit and other factors including the distance of origin and economic status.", "The list of provincially selected candidates for J&K Hostel, academic session 2018-2019, includes several Hindu names. The number of Muslim candidates is significantly higher because JMI is a minority institution.", "Hostel students are required to pay fees in two instalments. The accommodation, unlike claimed in the viral message, is not free. Physically-challenged students whose parents’ annual income does not exceed Rs 1.5 lakh are exempt from paying the room rent.", "No.", "A picture of J&K Hostel at JMI has been shared with the claim that JNU accommodates Muslim students from J&K ‘free of cost’. However, the independent statement is also untrue.", "According to the reservation policy for JNU hostel admission, 22.5% seats are reserved for SC/ ST candidates and 3% for physically handicapped (PH) students. Admission to hostels is based on several factors, including priority to outstation students. J&K has not been singled out. Furthermore, SC/ ST/ PH students whose parents’ annual income is less than Rs 75,000 are exempt from the payment of room rent.", "The viral message is therefore false on all accounts.", "1. The picture shared is the J&K Hostel in Jamia Millia Islamia, not JNU.", "2. Neither of the institutions provides free hostel accommodation to Muslim students from J&K. Admission is granted irrespective of state or religion.", "3. The hostel is for students irrespective for their faith.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]