["The video was published on Facebook here on October 7, 2019. It has been viewed more than 2,000 times.", "The 47-second video shows a woman standing on a street corner, holding a long silver object in her right hand. A police officer discharges a taser at her at the 15-second mark, prompting her to fall backwards. Another two police officers then come into the camera shot.", "Below is a screenshot of the misleading Facebook post:", "The post's traditional Chinese language caption translates to English as: “A young Chinese woman in Australia crossed the red light and was subsequently stopped by police, who were to hand out punishments.", "“The woman refused to admit her mistakes and started to cause a scene by pulling out a fruit knife from her purse. She thought she could behave like when she was in China, where police wouldn’t do anything.", "“She then stupidly tried to make phone calls in an attempt to seek help and wouldn’t stop even after multiple warnings from police.", "“In the end, she was shot dead on the scene. Foreign police are the laws.”", "The same video has been viewed thousands of times here, here, here and here on Facebook alongside an identical claim.", "The video has also been linked to the ongoing demonstrations in Hong Kong, where AFP reported police had been accused of using excessive and unnecessary force to detain protesters.", "This Weibo post carries a similar caption with an additional paragraph that translates to English as: “Yellow ribbons should move promptly to free countries with democracy and civil rights and without totalitarian rule. Go, go, go! This place is very suitable for you!”", "\"Yellow ribbons\" is a reference to pro-democracy supporters in Hong Kong.", "This Facebook post describes the shooting without mentioning Australia. An additional part in the caption translates to English as: “To Carrie Lam: [Hong Kong Police have really crossed the line]”.", "The claim is false; New South Wales Police told AFP the woman, who they said posed a threat to the public, was tasered during an incident in the Sydney suburb of Burwood on March 5, 2017. She was not fatally shot, and was sent to hospital for treatment.", "NSW Police Force Senior Media Officer Sonia Roberts described the incident in an email to AFP on October 9, 2019, which in part states:", "“About 1:20pm today (Sunday 5 March 2017), police attended Victoria Street, Burwood, in relation to a woman on a roadway. Officers from Burwood Local Area Command attended and found a woman with a knife.  She was tasered as it was deemed she posed a significant threat to the public.", "“The 42-year-old woman was taken to Concord Hospital for treatment and mental health assessment.”", "The incident happened between Victoria Street and Burwood Road in Burwood, as seen here on Google Street View.", "A keyword search on Google found this news segment published by 7NEWS Sydney, the TV news service of Australia’s Seven Network, on March 5, 2017. The video is embedded below.", "The moment the woman fell backwards can be seen between the 18 and 20 second mark of the 7NEWS video, which is titled “Woman carrying a knife tasered by police”.", "Below is a screenshot comparison of the video in the misleading posts (L) and the corresponding scene in the 7NEWS segment (R):", "7NEWS also obtained videos from the scene that show the woman, restrained and flanked by police, sitting on the sidewalk after she was tasered.", "Below is a screenshot of the scene:", "Australia's Daily Telegraph newspaper also reported on the incident in this report published on March 6, 2017.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]