["About this rating", "A video showing the testimony of a survivor of physical and sexual abuse was widely circulated on social media in December 2016, alongside claims that she was a survivor of \"Pizzagate\":", "One of the most popular versions of this mistitled video was posted on YouTube in late November 2016. That version of the video featured a disclaimer stating that the inclusion of the word \"Pizzagate\" was simply meant to help raise awareness about alleged Satanic abuse rituals:", "But, even from a \"bigger picture\" standpoint, this video is misleading, and does not show that children all over the world are being subjected to Satanic ritual abuse, in or out of a pizza parlor. This video was originally published in 1989, during an era where talk shows, the media, and the justice system were preoccupied — if not obsessed — with accusations of Satanic abuse.", "While the \"Satanic panic\" of the 1980s resulted in numerous accusations and criminal trials, no evidence was ever uncovered connecting child abuse to Satanic rituals:", "It was first pointed out in the United States that no material evidence of ritual or satanic practices had been forthcoming in any of the cases in which they had been alleged. In Britain the position has been substantially the same as far as allegations of satan-worshiping rituals are concerned. As one journalist put it, in a phrase that has become well-known: Investigations have produced no bodies, no bones, no bloodstains, nothing. In the United States, the only adult witness to corroborate the testimony of children in a case has continued to claim that her evidence was given 'to get it all over with' and was the result of plea-bargaining. An FBI agent, Kenneth Lanning, has reported that he has been unable to document any satanic murders in the United States. While this book was being written, a report of a very large study carried out be Gail Goodman and associates in the United States claimed that none of the cases reported to them produced any evidence of the existence of organized satanic worship that included sexually abusing children.", "Conflating Pizzagate with the \"Satanic panic\" craze, however, does show one thing very clearly: it indicates that the two moral panics (despite being separated by three decades) are eerily similar — almost as if they were one and the same.", "La Fontain, Jean.   \"Speak of the devil: tales of satanic abuse in contemporary England.\"\r\n    Cambridge University Press.   1998.", "Eddy, Cheryl.   \"A Brief History Of \"Satanic Panic\" In The 1980s.\"\r\n    i09.   20 January 2015.", "Smith, Blake.   \"Satanic Ritual Abuse.\"\r\n    Skeptoid.   14 April 2015.", "Oppenheimer, Mark.   \"Review: ‘We Believe the Children,’ on Child Abuse Hysteria in the 1980s.\"\r\n    New York Times.   6 August 2015.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]