["About this rating", "After a 3 June 2017 attack in London, rumors began circulating almost immediately on social media attempting to smear London mayor Sadiq Khan (a Muslim man) for purportedly \"defending\" September 11th terrorists.", "The claim often appears by itself, providing little to no context to describe how Khan might have \"defended\" them:", "Labour Mayor of London Sadiq Khan was the lawyer for a 9/11 terrorist and has family links to extremist organisation Al-Muhajiroun. This guy is now in charge of keeping London safe from those extremist organisations?!?", "Khan Has Been Affiliated With Organizations Tied To Hamas, Al-Qaeda, Al Nusra, ISIS And The Muslim Brotherhood. In 2004 he appeared on a platform with five Islamic extremists at a conference in London organised by Al-Aqsa, a group that has published works by the notorious Holocaust denier Paul Eisen.", "Some versions of the claim held, in part, that Khan represented terrorists as a lawyer — specifically individuals involved in the planning and execution of the attacks on the World Trade Center and the Pentagon.", "Footage of Sadiq Khan in 2001 as the lawyer and what he said on the 9/11/2001 terrorist attack.", "In the circulating clip Khan referenced \"three British men\", which should have been a primary clue that it did not have anything to do with the 2001 hijackers. Some versions of this rumor claimed he defended Zacarias Moussaoui, a French citizen (about whom Khan was clearly not speaking in the video). Moussaoui was one of several people sometimes described as the \"20th hijacker,\" charged and convicted as a conspirator in the attacks in the United States. That claim appeared first in 2016, at which time the Guardian reported Khan's firm did not represent Moussaoui but consulted on his defense.", "However, that particular video has nothing to do with Khan's purported defense of Moussaoui, or anyone else linked to the 11 September 2001 hijackers or co-conspirators. Khan did not \"defend\" Moussaoui (either verbally or in any legal capacity), and the circulating clip was unrelated to claims linking London's mayor to the tragedy.", "Instead, it dates back to the April 2002 arrests of three British men in Cairo:", "The Foreign Office minister Lady Symons has told three Britons jailed in Egypt for more than a year - allegedly for Islamist views and trying to overthrow the state - that she believes their confessions were extracted \"under duress\".", "In an unusually strongly worded statement, the minister responsible for the Middle East expressed frustration at trial delays and raised serious doubts about the integrity of the Egyptian legal process.", "Ian Nisbet, Reza Pankhurst and Maajid Nawaz, all from London, have been held in custody since April 2002. They maintain they were tortured by police into signing fictitious confessions. Their trial is to resume in Cairo today.", "Another statement, released by their families in London yesterday, from Britain's consul in Cairo, Gordon Brown, says he had \"noted slight bruising on the nose and eyes of Reza Pankhurst\" when he visited the men 10 days after their arrest.", "The erroneous constellation of rumors were not the first attempt to link Mayor Sadiq Khan to the 9/11 attacks. In May 2016, British tabloid the Mirror reported that the far-right nationalist group Britain First attempted to spread similar claims on social media.", "Booth, Robert.   \"Tories Step Up Attempts To Link Sadiq Khan To Extremists.\"\r\n    The Guardian.   20 April 2016.", "Bowcott, Owen.   \"Minister Backs Jailed Trio In Egypt.\"\r\n    The Guardian.   20 June 2003.", "Shammas, John.   \"Desperate Britain First Sink To New Low By Linking London Mayor Sadiq Khan To 9/11 In Bizarre Video.\"\r\n    Mirror.   7 May 2016.", "BBC.   \"Three Britons Are Jailed In Egypt.\"\r\n    25 March 2004.", "Wikipedia.   \"Zacarias Moussaoui.\"\r\n    Accessed 6 June 2017.", "Wikipedia.   \"20th Hijacker.\"\r\n    Accessed 6 June 2017.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]