["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Trying to highlight an area where she is to the left of her opponent, Hillary Clinton attacked Bernie Sanders for his position on guns during the NBC-YouTube Democratic debate in Charleston, S.C.", "Guns are a particularly emotional topic in South Carolina after Dylann Roof was accused of killing nine African-Americans in a Charleston church in June.", "Sanders, a senator from Vermont, defended his record on guns saying that he \"supported from day one an instant background check to make certain that people who should not have guns do not have guns.\"", "Clinton fired back at Sanders with a list of his votes on gun bills, including this one:", "\"He voted for what we call the ‘Charleston loophole.’ \"", "We wanted to know what Clinton meant by the \"Charleston loophole\" and if Sanders voted for it.", "Brady bill", "Clinton and some advocates for tighter gun laws argued Roof was abetted by the three-day time limit for background checks for gun purchases, dubbing it the \"Charleston loophole.\" Supporters of gun rights say blame actually goes to the FBI and its botched paperwork.", "Under current federal law, the FBI performs background checks on would-be gun buyers in South Carolina and 29 other states through its National Instant Criminal Background Check System. (The rest of the states do their own background checks.) If the check isn’t denied or completed in three days, the gun seller can proceed with the sale.", "Roof was able to get a gun as a result of clerical errors.", "Roof tried to buy a handgun in West Columbia, S.C., on April 11. An FBI examiner found that Roof had been arrested for a drug charge March 1. Because the records didn’t show a conviction, the examiner couldn’t deny the purchase but continued to look into Roof’s criminal history.", "Roof’s rap sheet mistakenly listed the neighboring county’s sheriff office as the agency that arrested him, leading the FBI examiner to request more information from the wrong offices.", "When the three days were up, the case was still listed as \"pending\" and Roof was able to purchase the gun. Two months later, Roof allegedly shot and killed nine worshippers and injured one in a historically black church in Charleston. He faces trial on murder charges later this year.", "Those three days were at the heart of the the Brady Handgun Violence Prevention Act, which passed in 1993. A word about waiting periods: The Brady Bill didn’t contain a waiting period that required purchasers to wait to receive their firearm. (Some advocates like this idea, because they believe it might prevent impulsive acts of gun violence.) Rather, the bill set a time limit -- sometimes called a default to proceed -- for the government to conduct its background checks.", "Sanders, then in the U.S. House of Representatives, voted against the Brady Bill five times -- including a version that reinstated a five-day time limit for background checks. In November 1993, Sanders voted for an amendment imposing an instant background check instead. The problem was technology for instant checks didn’t exist at the time.", "As a result, according to the Washington Post Fact-Checker, supporters of the Brady bill were forced to negotiate a compromise. What first was proposed as 10 days for the government to conduct the check ultimately was whittled to three days.", "The final compromise version of the Brady bill was passed and signed into law on Nov. 30, 1993. It prohibited the transfer of a gun to an unlicensed individual, unless three business days have lapsed and the system has not notified the transferor that it would violate the law.", "Sanders voted against the final bill.", "Sanders’ campaign manager Jeff Weaver told us in July that Sanders voted against the bill because he believed a national waiting period was a federal overreach and because he was answering to his constituents. (We did not get a response from the Sanders’ campaign on debate night about Clinton’s attack.)", "So to recap: Sanders supported shortening the time the government had to conduct background checks. Whether extra time would have kept Roof from purchasing a gun is unclear.", "Clinton said that Sanders \"voted for what we call the Charleston loophole.\"", "In 2015, Roof was able to buy a gun after time ran out for the government to perform a background check  -- the result of a clerical error when the FBI sought records from the wrong local law enforcement agency about Roof. Whether more time would have made a difference remains unknown. But Roof was able to purchase the gun after a three-day waiting period expired.", "Sanders voted in 1993 to shorten the time window for the government to conduct its check. Roof was able to purchase a gun after waiting out a three-day time limit on background checks. We rate this claim Mostly True.", "Clarification: This fact-check was edited on Jan. 19 to clarify waiting periods and and time limits on background checks.", "Congress.gov, \"H.R. 1025,\" 1993-1994", "The Guardian, \"Sanders gets defensive on gun control as Clinton tightens hold ahead of debate,\" Dec. 19, 2015", "New York Times, \"Background Check Flaw Let Dylann Roof Buy Gun, F.B.I. Says,\" July 10, 2015", "PolitiFact, \"Hillary Clinton says background check of Charleston church shooter wasn't 'fast enough,’\" Dec. 6, 2015'", "PolitiFact, \"Hillary Clinton: Bernie Sanders voted against Brady bill five times,\" Oct. 13, 2015", "PolitiFact, \"Did Bernie Sanders vote against background checks and waiting periods for gun purchases?\" July 10, 2015", "Washington Post The Fact checker, \"Hillary Clinton’s claim that Bernie Sanders voted for the ‘Charleston loophole,’\" Jan. 12, 2016", "Washington Post, \"The 4th Democratic debate transcript, annotated: Who said what and what it meant,\" Jan. 17, 2016", "Washington Post, \"Dylann Roof trial date set for Charleston church shooting,\" July 11, 2015", "Interview, Nick Merrill, Hillary Clinton spokesman, Jan. 17, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]