["The video was published in this Facebook post on May 28, 2019.", "It has been viewed more than 43,000 times and shared more than 1,100 times after being posted by a page with more than 54,000 followers.", "Below is a screenshot of the misleading post:", "The Hindi-language caption translates to English as: “When Rahul Gandhi met the people from Amethi who came to Delhi, then people after seeing him got emotional and started crying. He lost Amethi to the ideology of lies & deceit not love love & affinity of the people.”", "Rahul Gandhi is the leader of India’s main opposition party, the Indian National Congress (INC).", "Amethi is a town in North India. Gandhi lost the seat for Amethi in the Indian elections. The official results were announced on May 23, 2019 by the Election Commission of India here.", "Below is a screenshot of the results:", "Gandhi’s defeat to the ruling Bharatiya Janata Party’s Smriti Irani on May 23, 2019 was reported by The Hindustan Times here on May 24, 2019.", "The video was also shared in Facebook posts here, here and here, with a similar claim.", "The claim is false; the video has circulated online since November 2017 in reports about Gandhi meeting the families of victims of a power plant explosion.", "A reverse image search on Google found this identical clip posted on the official Congress Twitter account on November 2, 2017.", "The same video was shared here on November 2, 2017 on Rahul Gandhi’s official YouTube channel.", "The caption states: “Congress VP Rahul Gandhi at the NTPC headquarters, meeting with the affected and their families.”", "Below is a screenshot comparison of the video in the misleading posts (L) and the YouTube video (R):", "This article published by Indian news site NDTV on November 2, 2017, states Gandhi met the families of the victims of an explosion at the Unchahar NTPC plant in the city of Raebareli in Uttar Pradesh state.", "This report published by Reuters on July 23, 2018, states that an internal review found 45 workers died as a result of the disaster.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]