["About this rating", "Walter Reed National Military Medical Center issued a stop work order to the Warrior Canine Connection on 27 October 2017, citing patient safety concerns.", "The stop work order was issued by Walter Reed officials, not President Trump, and concerns about the Warrior Canine Connection had been raised several months earlier.", "On 11 November 2017, multiple web sites published identical articles claiming that President Trump had \"abruptly\" and personally halted a program involving therapy dogs and wounded veterans, leaving the latter \"high and dry\" on Veterans Day:", "Trump Abruptly Shuts Down Dogs for Wounded Warriors Program, Leaving Vets High and Dry on Veteran’s Day!", "This week, the useful Warrior Canine Connection program received a shocking letter at the program’s office in the Washington D.C. area. The letter instructed personnel to leave their posts immediately and shut down the program for vets.", "They have since closed their offices at Fort Belvoir in Northern Virginia and on the campus of Walter Reed National Military Medical Center in Washington.", "Warrior Canine Connection Executive Director Rick Yount stated:", "“At two o’clock in the afternoon, I received a phone call saying there was a stop work order. There was no explanation whatsoever as to why that was the decision.”", "He asked, “Why would — all of the sudden — a program be halted that was serving patients?”", "These articles did not link to (or cite) any credible news report or other information corroborating their claims that President Trump had ordered a program involving service dogs and veterans closed as of Veterans Day 2017.", "Many readers inferred that the shutdown of a canine program for veterans had actually occurred on Veterans Day itself. But while Washington, D.C., radio station WTOP reported that operations of the Warrior Canine Connection at Walter Reed National Military Medical Center had indeed been abruptly terminated, they noted that the stoppage had been ordered and implemented a couple of weeks prior to Veterans Day:", "The Warrior Canine Connection, a program that uses an army of volunteer puppy raisers, dog trainers and veterans to prepare service dogs for wounded veterans and their families, has been partnering with military facilities in the D.C. region since 2009.", "But suddenly — and without explanation — that came to a stop, says Warrior Canine Connection Executive Director Rick Yount.", "He said his trainers and puppy raisers at Fort Belvoir and at two locations on the campus of the Walter Reed National Military Medical Center, were told on Oct. 27 to vacate their offices that afternoon.", "“At 2 o’clock in the afternoon, I received a phone call saying there was a stop work order. There was no explanation whatsoever as to why that was the decision,” Yount said.", "Washington, D.C., television station WTTG-TV also covered the story, reporting that \"a popular service dog program at Walter Reed and Fort Belvoir was told to close up shop immediately, leaving many frustrated with a lack of answers for the shutdown.\" But neither WTOP nor WTTG reported that the closure had been ordered by President Trump himself.", "Moreover, another article on the subject from WTOP reported that concerns about risks to both disabled vets and animals within the program had been reported in a letter from a military contract officer to the National Intrepid Center of Excellence several months earlier:", "An April [2017] letter from a military contract officer laid out several complaints about the performance of Warrior Canine Connection, the group that trains veterans to train service dogs for their fellow disabled vets.", "A letter sent to the firm managing the contract for Warrior Canine Connection complained about the “health and well-being of animals, specifically as it pertains to standard precautions in a health care setting”.", "According to the letter, there had been several instances when dogs who appeared to be sick, described as unable to control their bowels, were brought to the National Intrepid Center of Excellence. The contract states that animals with any sign of illness — from runny noses to diarrhea — could not be brought to the facility.", "The complaints also included concerns that the dogs suffering those signs of illness went untreated and that one dog had issues that “were allowed to persist for months.” Rick Yount, Executive Director of Warrior Canine Connection told WTOP that there had been some concern about health issues among some dogs, but that a veterinarian was brought in and those issues were resolved.", "Marvin Davis, of MD Consulting in Waldorf, Maryland, was the prime contractor for Warrior Canine Connection. He told WTOP that the issues in the April letter “had been resolved” and that they were not the cause of the stop-work order that Warrior Canine Connection got on [27 October 2017].", "Instead, Davis said, “Based on my communications with the government, the letter of concern was not the basis of the stop-work order.”", "Davis said he was told “The Walter Reed National Military Medical Center medical director wanted to go in a different direction as it related to the canine program at Walter Reed.”", "In an email statement, Communications Director for Walter Reed Sandy Dean wrote to WTOP to say that the stop-work order was issued “so that we could restructure the contract to enhance oversight of patient care.” She added that canine-assisted therapy programming would continue at Walter Reed, but didn’t say whether that would include dogs from Warrior Canine Connection.", "On both Facebook and Twitter, the Warrior Canine Connection opted to respond privately to an avalanche of inquiries prompted by the articles:", "For more information, please DM us. Thanks for your support!", "— WarriorCanineConnect (@WarriorCanineCn) November 13, 2017", "Washington, D.C., television station WRC provided details missing from many of the other news reports, primarily that Walter Reed (and not President Trump) had issued the stop work order, and that the reason given for the order was patient safety:", "Walter Reed spokesperson Sandy Dean [said] the military hospital effectively canceled its contract with Warrior Canine Connection.", "\"We issued a stop work order to the prime contractor so that we could restructure the contract to enhance oversight of patient care,\" Dean said ... Dean said the contract did not provide Walter Reed enough oversight over the program. As a result, Walter Reed will restructure its Canine Assisted Therapy program, according to Dean. The government contract will then go out to bid.", "\"We are expeditiously updating our Canine Assisted Therapy program to bring an enhanced version back on-line and apologize for any inconvenience or disturbance this temporary pause may bring to our patents and staff's normal routine,\" Dean said.", "In the meantime, Dean said patients who worked with Warrior Canine Connection's service dogs at their facility will still receive services through the hospital's other therapy programs.", "Warrior Canine Connection Executive Director Rick Yount told WTOP no one had given him any information about why the program was halted at the military sites.", "“At two o’clock in the afternoon, I received a phone call saying there was a stop work order. There was no explanation whatsoever as to why that was the decision,” Yount told WTOP.", "\"Legally we are not permitted to discuss contract matters with subcontractors. That responsibility rests with the prime contractor,\" Dean said. Dean said the prime contractor is MD Consulting.", "Although the Warrior Canine Connection's stop work order was reported as having been \"abrupt\" or \"without warning,\" local news stations repeatedly referenced a letter of concern sent to an oversight agency in April 2017. The order was handed down not by President Trump, but by officials at the Walter Reed medical facility due to patient safety issues.", "We contacted the Warrior Canine Connection for further information, and they provided us with the following statement:", "This week several news outlets published stories about the interruption of our service dog contract at Department of Defense sites in the national capital region. While WCC has not received any information or guidance from Walter Reed, these stories included a statement from Walter Reed indicating that the “Canine Assisted Therapy program is popular with both our patients and staff at Walter Reed Bethesda. We issued a Stop Work Order to the prime contractor so that we could restructure the contact to enhance oversight of patient care.”", "The statement stressed their intention to update the canine assisted therapy program to bring an enhanced version back on-line soon. WCC has always been transparent with our work and we would welcome any additional involvement or oversight by the hospital leadership that would make the program better or more effective for our wounded Warriors. We would also welcome the opportunity to work with the leadership at Walter Reed and others to restructure the contract or make other adjustments that would allow the program to be restored, and allow WCC to again provide our assistance to the 105 wounded soldiers who were participating in our programs prior to the stop work order.", "WCC will continue to provide its unique form of animal assisted therapy and dog placement services to Service Members and Veterans who need our help. Our commitment to this critical mission is unwavering, and our programs at locations not impacted by the stop work order continue to operate as usual. We have received countless inquiries from hundreds of concerned friends, patients, members of the medical community, and lawmakers offering their support and assistance.", "DeMarco, Lauren.   \"Warrior Canine Connection Abruptly Told to Stop Operation.\"\r\n    WTTG-TV.   9 November 2017.", "Ryan, Kate.   \"Popular Therapy Dog Program at Walter Reed Contract Halted Over ‘Patient Care.'\"\r\n    WTOP-TV.   9 November 2017.", "Ryan, Kate.   \"Letter Details Complaints with Program That Pairs Service Dogs with Vets.\"\r\n    WTOP.   11 November 2017.", "Ryan, Kate.   \"Veterinarian Gave Therapy Dog Group Booted from Walter Reed Clean Bill of Health After ‘Letter of Concern’.\"\r\n    WTOP.   11 November 2017.", "Ryan, Kate.   \"Program That Pairs Service Dogs with Veterans Booted from Fort Belvoir and Walter Reed.\"\r\n    WTOP.   8 November 2017.", "Rozsa, Matthew.   \"Service Dog Program for Veterans Mysteriously Evicted from Military Bases.\"\r\n    Salon.   11 November 2017.", "Wright, Kristin and Gina Cook.   \"Walter Reed Stops Contract with Service Dog Program Because of 'Oversight' Issues.\"\r\n    WRC-TV.   9 November 2017.", "The Political Voice.   \"Trump Abruptly Shuts Down Dogs for Wounded Warriors Program, Leaving Vets High and Dry on Veteran’s Day!\"\r\n    11 November 2017.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]