["About this rating", "An animal shelter in Lexington, Kentucky, pulled out all the stops for Valentine’s Day 2021, offering spurned lovers a chance at stinky retripootion.", "On Feb. 3, Lexington Humane Society announced a “smear campaign” in the name of funding the shelter’s furry friends. For a $10 donation, anyone can have their ex’s name written on a litter box only to have one of the shelter cats “dump all over” an ex-flame.", "“Cats can be spiteful creatures, and trust us, they are more than happy to take a #2 on your former #1,” wrote the shelter.", "Those who are interested in contributing to the fundraiser can do so through the shelter’s webpage or directly through its Facebook fundraising campaign. To send the team your name of choice, simply comment directly on this post or send the humane society a direct message via Facebook.", "Donors have the option to designate their funds to a spay and neutering program, a medical fund, or to Project Purrfect, a program dedicated to feline education and rehoming efforts. But time is limited! The fundraiser will end on Feb. 12 at 1 p.m. EST — but that doesn’t mean the poop show is over just yet.", "“Not to worry, our kitties will continue to fart for your broken heart through Valentine’s Day. Litter boxes won’t be removed until February 15th!” the shelter said in its Facebook post.", "As of this writing, the Facebook fundraiser had raised more than $1,600.", "It’s not the only vengeful option to get back at an ex in 2021. Hotels.com is offering patrons the opportunity to figuratively “reserve” dumpsters for exes, while the San Antonio Zoo is offering scorned lovers the chance to name a cockroach or rodent after an ex before it is fed to a larger animal.", "Madison Dapcevich is a freelance contributor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]