["The one minute and one-second clip was published here in a Facebook post on October 29, 2019. It has been viewed more than 16,000 times.", "The post's caption, written in Hindi and English, says: “This video is taken from Sarvodaya temple, Ghatkopar, Mumbai. If you still think children can't be made radical, watch this full video! This can be the fate of our country if their demographic change reaches above 30 per cent.”", "Below is a screenshot of the misleading Facebook post:", "Sarvodaya Temple is in Mumbai city.", "The ‘their’ reference in the caption is a reference to Indian Muslims -- one of the children in the video is wearing a skull cap, which is traditionally worn by Muslims.", "According to official Indian census statistics published here, Muslims make up around 14 per cent of India’s population.", "The video was also published here, here, here and here on Facebook; here and here on Twitter with a similar claim.", "The claim is false; the footage actually shows an incident in Pakistan’s Karachi city.", "A reverse image search on Google using keyframes obtained using video verification tool InVID found the same footage published here by Pakistani television channel Geo News on its YouTube channel on September 1, 2019.", "The video’s title, written in Urdu using Roman script, translates to English as: “Two children involved in the robbery in Karachi’s Gulbarg society have been arrested.”", "Gulberg town is a locality in Pakistan’s Karachi city.", "In the video, the reporter's comments in Urdu translate to English as: “These were teenagers who robbed a family on August 25, 2019. Geo News reported the incident and today teenagers, one aged 15 and other aged 17 have been arrested. They have been involved in many robberies and thefts in different parts of Karachi and have been arrested previously as well. Two guns, two mobile phones and three wallets has been recovered. Their other two accomplices are still on the run and police are on a lookout for them.”", "Karachi-based television channel Dawn News also published this 49-second clip showing the same incident on its YouTube channel on August 26, 2019.", "An Urdu caption in Roman script translates to English as: “Four teenagers commit robbery in Karachi.”", "Below are three screenshots comparing the misleading Facebook video (L) and Dawn News report video (R)", "A spokesperson for Karachi police told AFP by phone on November 3 the incident happened in their jurisdiction.", "\"This footage is from Karachi,\" the spokesperson said. \"We have arrested two suspects in this regard and are investigating the crime.\"", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]