["About this rating", "A January 2016 video clip of billionaire Democratic Party donor George Soros predicting that Hillary Clinton will win the popular vote by a landslide in the general election was altered to make it appear he had said the opposite and reposted on conservative news web sites and blogs eight months after the fact. Despite a clumsy and easily detected editing job, it quickly went viral.", "This is the manipulated version, as launched on YouTube on 9 August 2016. Taken at face value, it appears to be an admission by Soros of collusion and conspiracy to fix the election:", "ALTERED VIDEO –TRANSCRIPT", "Lacqua: But what does the fact that Donald Trump is not fading, right, that he – he is still very popular – tell us about the angst or fears about voters and – and what are the polities – policies that the voters in the U.S. should be focusing on?", "Soros: Well, here, I have to confess to a little bit of bias, so take that into account. I think it all – it’s going to lead to a landslide for Donald Trump in the popular vote, not in the electoral vote, because there, paid political announcements will have a big role. And so the electoral thing will be closer. But the popular vote will be a landslide because we are a small minority of extremists. And so we are all moved – moving in that direction. And while I don’t think that Donald Trump has any chance of being elected ...", "Lacqua: But you think Hillary Clinton is a done deal?", "Soros: Yeah. And I do think, actually, she’s the one who’s most qualified.", "However, in this clip from the real Bloomberg Television interview with Francine Lacqua filmed in January 2016, Soros answered the same question in a completely non-conspiratorial fashion:", "ORIGINAL VIDEO – TRANSCRIPT", "Lacqua: But what does the fact that Donald Trump is not fading, right, that he – he is still very popular – tell us about the angst or fears about voters and – and what are the polities – policies that the voters in the U.S. should be focusing on?", "Soros: Well, here, I have to confess to a little bit of bias, so take that into account. I think it all – it’s going to lead to a landslide for Hillary Clinton in the popular vote, not in the electoral vote, because there, paid political announcements will have a big role. And so the electoral thing will be closer. But the popular vote will be a landslide because she is campaigning for the general elections, whereas the Republicans are fighting for the primary. And the primary is a small minority of extremists. And so they are all moved – moving in that direction. And while I don’t think that Donald Trump has any chance of being elected, he will – may have the role of kingmaker, because he will have – he’s lasted long enough, he will get quite a bit of – quite a few votes.", "Lacqua: But you think Hillary Clinton is a done deal for – for the Democrats?", "Soros: Yes. And I do think, actually, she’s the one who’s most qualified.", "For reference and verification purposes, here is the entire Bloomberg TV interview, as aired on 21 January 2016:", "Bloomberg Television.  \"Soros Talks EU, China, Fed and Donald Trump.\"\r\n   21 January 2016.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]