["About this rating", "Voting in the 2020 U.S. Election may be over, but the misinformation keeps on ticking. Never stop fact-checking. Follow our post-election coverage here.", "On Oct. 8, 2020, shortly after U.S. President Donald Trump and more than two dozen White House officials and staff members tested positive for COVID-19, the Commission on Presidential Debates (CPD) announced that the second presidential debate between Trump and Democratic candidate Joe Biden would be moved to a virtual forum. The decision, the CPD said, was made \"in order to protect the health and safety of all involved.\"", "Trump called into Fox Business after the CPD's announcement and told host Maria Bartiromo, \"I'm not going to waste my time doing a virtual debate.\" The Trump campaign's refusal to participate in a virtual debate prompted some social media users to post messages about the validity of remote debates. Turning Point USA's Benny Johnson, for instance, claimed, \"There has NEVER been a VIRTUAL presidential Debate in American history.\" Others posted messages claiming that presidential candidates John F. Kennedy and Richard Nixon participated in a virtual debate in 1960.", "So, did Nixon and Kennedy participate in a remote debate? Yes, on Oct. 13, 1960, Kennedy, speaking from an ABC studio in New York, and Nixon, speaking from an ABC studio in California, answered questions from a panel of journalists stationed in a separate studio in California. Here's a contemporary newspaper clipping from New Jersey's The Record describing the setup of the debate:", "Thu, Oct 13, 1960 – 41 · The Record (Hackensack, New Jersey) · Newspapers.com", "When ABC News anchor Bill Shadel introduced the two candidates at the start of this debate, he said:", "Good evening. I’m Bill Shadel of ABC News. It’s my privilege this evening to preside at this the third in the series of meetings on radio and television of the two major presidential candidates. Now like the last meeting the subjects to be discussed will be suggested by questions from a panel of correspondents. Unlike the first two programs, however, the two candidates will not be sharing the same platform. In New York the Democratic presidential nominee, Senator John F. Kennedy; separated by three thousand miles in a Los Angeles studio, the Republican presidential nominee, Vice President Richard M. Nixon; now joined for tonight’s discussion by a network of electronic facilities which permits each candidate to see and hear the other. Good evening, Senator Kennedy.", "C-SPAN posted a short clip of Shadel's opening remarks on Twitter:", "Commission on Presidential Debates.   \"CPD Announces Second Presidential Debate Will be Virtual.\"\r\n    8 October 2020.", "Wu, Nicholas and Joey Garrison.   \"Trump Says He Won't Do Next Presidential Debate After it Goes Virtual, Biden Still Wants Town Hall.\"\r\n    USA Today.   8 October 2020.", "The Record.   \"TV Key Previews.\"\r\n    13 October 1960.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]