["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Donald Trump campaigned in Norwalk, Iowa on Jan. 20, 2016. (Associated Press)", "Donald Trump’s critics say Mexico can’t or won’t pay for a wall at the border, which he says is hogwash.", "\"When they say ‘but Mexico can't pay for the wall,’ I say of course they can,\" said the Republican frontrunner at a town hall in Norwalk, Iowa, on Jan. 20. \"We have a trade deficit with Mexico that's unbelievably big. Humongous. It's a humongous number. It's billions and billions of dollars -- far more than what we're talking about for the wall. The wall's peanuts compared to that.\"", "Trump’s statement prompted these questions: What is the amount of the trade deficit and the cost to build the wall? Mostly importantly, does a big trade deficit mean the Mexican government has money to pay for a wall?", "The Trump campaign did not respond for this fact-check.", "The size of the trade deficit", "The U.S.-Mexico trade deficit was $50 billion for 2014. It was about $54 billion for the first 11 months of 2015. That means Mexico sold the United States $54 billion more in goods and services than the United States sold to Mexico.", "Balanced trade -- in which exports and imports are equal -- is rare. The U.S. economy has run overall trade deficits in every year since 1976.", "Sorting out the costs to build a wall is messier.", "Cost of a border wall", "The border with Mexico is about 1,900 miles. Federal law in 2006 required the construction of an approximately 700-mile fence.", "Border fencing and associated costs added up to about $6 billion as of 2012.", "\"It’s a lot more expensive than we expected when we started, and it was much more difficult,\" said Ronald Vitiello, deputy chief of the U.S. Border Patrol for U.S. Customs and Border Protection, before a Senate committee in May.", "But the costs have left Trump, who promised to \"build a great wall,\" undeterred. His immigration plan includes no price tag, although he wants to force Mexico to pay for it by taking money from remittances and jacking up fees on visas.", "News reports estimating the price of a wall have varied widely. For the fence already built, the costs fluctuated depending upon the terrain. A Congressional Research Service report noted in 2009 that the challenges include \"costs versus benefits, location, design, environmental impact, potential diplomatic ramifications, and the costs of acquiring the land needed for construction.\"", "Media reports we saw to complete such a wall ranged from $5.1 billion to $25 billion — plus additional costs to maintain it.", "\"The only way to come up with any type of real cost estimate, you would have to do what we did: Get the Army Corps of Engineers or somebody else to survey and plan and come up with a fence type, and environmental impacts,\" said Thad Bingel, a senior official at Customs and Border Patrol during the George W. Bush administration.", "From an engineering standpoint, it’s possible to do it. But the cost would be enormous, and it would be more efficient to invest in equipment or staff, he said.", "\"Largely the reason we didn’t fence those portions was Border Patrol didn’t think we needed fencing there,\" because those portions had a river, mountains or a lot of desert, Bingel said.", "Trade deficit has nothing to do with cost of the wall", "So let’s review what we know so far: The trade deficit is about $50 billion. It’s difficult to pinpoint a price to build the wall, although the estimates we saw were smaller than the deficit.", "However, the bigger problem with Trump’s statement is he suggested Mexico can afford to pay for the wall because of the amount of the trade deficit. There is no proof of that.", "Several experts told PolitiFact that there is no connection between the size of the trade deficit and finding money to build the wall.", "\"Trump’s connection of the trade deficit with a Mexican border fence is just nonsense,\" said Alex Nowrasteh, an immigration expert at the libertarian Cato Institute. \"Just because the Mexican economy has a trade surplus relative to the United States doesn’t mean the Mexican government has the resources to build a border wall. It would be like me threatening my neighbor to build a new fence or else I’ll stop shopping at Walmart.\"", "Mark Perry, a University of Michigan professor and scholar at the conservative American Enterprise Institute, said the trade deficit is based mostly on trading and investment by private individuals and companies -- not the government itself.", "\"It’s not like there is $54 billion sitting around somewhere in Mexico, like a magic pile of dollars, that could be used to build a wall,\" he said.", "The Mexican government does not have adequate funds to pay for health, education or roads -- much less build a wall, said Gary Hufbauer of the Peterson Institute for International Economics, a think tank that analyzes globalization.", "\"The trade surplus does not represent money in some idle bank account controlled by the Mexican government,\" he said.", "Our ruling", "Trump said, \"When they say Mexico can't pay for the wall, I say of course they can. We have a trade deficit with Mexico that's unbelievably big. ... It's billions and billions of dollars -- far more than what we're talking about for the wall.\"", "The trade deficit is about $50 billion. Estimates to build a wall vary widely, though the ones we saw were smaller than the trade deficit. It’s impossible to know a precise figure because Trump hasn’t offered a detailed plan.", "However, Trump’s overall message here is misleading because he suggests that the size of the trade deficit is proof that Mexico could pay for the wall. In reality, the trade deficit has nothing to do with whether the Mexican government could afford to write the United States a check to build the wall.", "We rate this statement False.", "YouTube, Donald Trump rally in Norwalk, Iowa, Jan. 20, 2016", "Donald Trump campaign, \"Immigration reform that will make America great again,\" 2015", "Congressional Research Service, \"Border security: Barriers along the U.S.-international border,\" March 16, 2009", "White House, \"The United States in a Global Economy,\" 2015", "U.S. Department of Trade, Total goods and services, 2015", "Peterson Institute for International Economics, \"Trump’s recipe for a trade war,\" Jan. 20, 2016", "CNBC, \"This is what Trump’s border wall would cost US,\" Oct. 9, 2015", "Politico, \"Trump's immigration tab: $166 billion,\" Aug. 19, 2015", "National Journal, \"This is how much DOnald Trump’s plan would cost America if Mexico doesn’t pay to pick up the tab,\" July 2015", "Washington Post, \"Trump says building a U.S.-Mexico wall is easy. But is it really?\" July 18, 2015", "PolitiFact Virginia, \"Cruz falsely claims U.S. law requires double fencing on border,\" Dec. 29, 2015", "PolitiFact, \"Fact-checking Donald Trump,\" June 17, 2015", "Interview, Thad Bingel, Principal at Command Consulting Group and former Assistant Commissioner for the Office of Congressional Affairs at Customs and Border Patrol and as Majority Counsel with the U.S. House Judiciary Committee in Congress, Jan. 21, 2016", "Interview, Alex Nowrasteh, Cato Institute  immigration policy analyst, Jan. 21, 2016", "Interview, Frank Sharry, executive director America’s Voice, Jan. 21, 2016", "Interview, Joshua P. Meltzer, Brooking senior fellow Global Economy and Development, Jan. 21, 2016", "Interview, Mark Perry, scholar at the American Enterprise Institute and University of Michigan professor of finance and business economics, Jan. 21, 2016", "Interview, Gary Hufbauer, Peterson Institute for International Economics senior fellow, Jan. 21, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]