["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Michelle Obama signed an autograph after giving a campaign speech for Barack Obama in Milwaukee on Feb. 18, 2008, before her husband was elected president. (Milwaukee Journal Sentinel)", "Milwaukee County Sheriff David A. Clarke Jr., a big enough supporter of President Donald Trump that he has been mentioned for a role in the administration, has been a frequent basher of former President Barack Obama.", "On Feb. 17, 2017, he turned to attacking the former first lady.", "\"Michelle Obama said she was never proud of her country til they elected her husband POTUS,\" Clarke charged on Twitter: \"I've never been prouder since we got rid of him.\"", "With the tweet was a photo of Clarke, who is being encouraged by some to run against U.S. Sen. Tammy Baldwin, D-Wis., in 2018. Flexing his biceps, Clarke is shown wearing a T-shirt with an image of Trump standing on a tank and holding a rifle.", "During Obama’s first presidential campaign, Obama did take some flack for remarks she made in Wisconsin about being proud of her country.", "Let’s see whether Clarke is accurately describing what she said.", "Two Wisconsin speeches", "Obama campaigned for her husband in Milwaukee and Madison on Feb. 18, 2008, the day before Wisconsin’s primary. He had won eight consecutive Democratic primaries and caucuses over Hillary Clinton.", "In Milwaukee, Michelle Obama said:", "People in this country are ready for change and hungry for a different kind of politics and … for the first time in my adult life I am proud of my country because it feels like hope is finally making a comeback.", "But remarks she made later in Madison were the ones that gained widespread media attention. Several minutes into her speech, Obama noted her husband’s primary victory in South Carolina and continued by saying:", "And then he went on to win throughout the country. And when’s the last time we’ve seen a candidate -- male, female, whatever party -- who has been able to pull together victories that included Utah and Idaho and Louisiana and Maine and Washington and Illinois. I don’t think we’ve seen that. But what we’ve learned over this year is that hope is making a comeback. It is making a comeback and let me tell you something: For the first time in my adult lifetime, I’m really proud of my country and not just because Barack has done well, but because I think people are hungry for change. And I have been desperate to see our country moving in that direction and just not feeling so alone in my frustration and disappointment. I’ve seen people who are hungry to be unified around some basic common issues and it’s made me proud.", "So, Obama’s remark was made before her husband had won the Democratic nomination and nine months before was elected president.", "And Obama said she was proud because Americans were hungry for change, not just because her husband was winning.", "But her statement was controversial.", "Asked the day after the Wisconsin primary, which her husband won, if she wanted to clarify her remarks, Obama said:", "What I was clearly talking about was that I'm proud in how Americans are engaging in the political process. For the first time in my lifetime, I'm seeing people rolling up their sleeves in a way that I haven't seen and really trying to figure this out -- and that's the source of pride that I was talking about.", "Bill Kristol, editor-at-large of the conservative Weekly Standard magazine, said at the time that Obama’s original comment \"was sort of revealing,\" adding:\n\nShe was an adult when we won the Cold War without firing a shot. She was an adult for the last 25 years of economic progress, social progress ….I don’t think the American people think on the whole that the last 25 years of American history is a narrative of despair and nothing to be proud of.", "CNN included the key part of Obama’s remark -- \"For the first time in my adult lifetime, I'm really proud of my country, and not just because Barack has done well, but because I think people are hungry for change\" -- in a documentary on her that aired in January 2017. That clip was followed by David Axelrod, a former senior adviser to President Obama, saying:", "Those kinds of moments gave you a heartburn. By the same token, it became clear to me very quickly that we had failed her, because we threw her out there without adequate staffing, without adequate preparation.", "For his part, Clarke didn’t provide us any information to back his claim. The sheriff’s office spokeswoman told us the sheriff said: \"Go suck an egg\" and that when he does provide us evidence of his claims, PolitiFact Wisconsin \"still finds a way to contort a way to say false.\"", "Our rating", "Clarke says Obama \"said she was never proud of her country til they elected her husband POTUS.\"", "He provided us and we could find no evidence of such a statement.", "What Obama said -- nine months before her husband was elected president -- was that for the first time in her adult life, she was proud of her country not just because Barack Obama had done well in pursuing the presidential nomination, but also \"because I think people are hungry for change.\"", "We rate Clarke’s statement False.", "Twitter, David Clarke tweet, Feb. 17, 2017", "Email, David Clarke spokeswoman Fran McLaughlin, Feb. 20, 2017", "C-SPAN, video of Michelle Obama speech, Feb. 18, 2008", "Fox News, \"Michelle Obama Takes Heat for Saying She’s Proud of My Country for the First Time,\" Feb. 19, 2008", "CNN, Michelle Obama documentary transcript, Jan. 13, 2017", "CBS News, \"Michelle Obama Retools \"I'm Proud\" Remark,\" Feb. 20, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]