["About this rating", "An image supposedly showing a gorilla knitting itself a scarf was recirculated on social media around April Fools' Day in 2019:", "This image had already been online for several years by then. In April 2016, for example, it was posted on the website \"Top Crochet Patterns\" along with a fictional \"Breaking News\" story about a knitting gorilla named Penny who was resident at a national zoo:", "BREAKING NEWS! A gorilla has been discovered knitting at a national zoo, leading to new questions regarding ape intellects and their capability to grasp math.", "After a crafty staff member accidentally left balls of yarn, needles, and the latest copy of LGC (Let's Get Crafting Magazine) in the gorilla enclosure, zookeepers were stunned to find that resident gorilla Penny had successfully managed to cast on and knit half a scarf.", "Even managing to swap between colours, these incredible abilities have suddenly attracted the attentions of scientists across the globe. The discovery will no doubt be apeeling to the debate of how intelligent gorillas are.", "This is not a genuine photograph of a knitting gorilla, nor is this a genuine news story. And, to top it off, this gorilla's name is not Penny.", "The image of a gorilla knitting is a manipulated version of a photograph taken at the London Zoo in 2009. At the time, zookeepers were awaiting the arrival of a new gorilla, Yeboah, a 12-year-old male who was being transferred from a zoo in France. In order to prepare the three female inhabitants for the change, the zookeepers handed out photographic posters of their potential new mate.", "The original undoctored photograph showed a gorilla named Mjukuu, or \"Jookie,\" examining one of the posters. The image appeared in a 2009 article published by CNN entitled \"Girl gorillas go ape for French pinup hunk\":", "You don't want to monkey around on a blind date, especially if your friends are also taking an interest in the same dark, handsome stranger.", "So when three female gorillas at London Zoo heard that they would soon be visited by a brooding French hunk -- well, they went a bit bananas.", "The latest development in Anglo-French relations sees Yeboah, a 20-stone 12-year-old, leave his current home at La Boissiere Du Dore Zoo, Pays de la Loire, northwest France and head for the British capital by the end of the year.", "There he will be greeted by gorilla trio Zaire, Effie and Mjukuu, who were given posters of their prospective boyfriend for the first time Thursday.", "One female gorilla shrieked in delight, while another wedged the poster in a tree to stare at it.", "A third, clearly overcome by emotion, held the photo close to her chest -- then ate it.", "Their reception was somewhat unsurprising. The zoo has been without a male gorilla since the demise of Bobby, a silverback, in December.", "Here's a comparison of the original photograph (left) and the doctored \"Knitting Gorilla\" image (right):", "Top Crochet Patterns.   \"Gorilla Discovered Knitting at National Zoo.\"\r\n    1 April 2016.", "Hunt, Nick.   \"Girl Gorillas Go Ape for French Pinup Hunk.\"\r\n    CNN.   28 August 2009.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]