["About this rating", "The factoid that intelligence is passed down only through your mother has been carelessly meandering across social media users' trending bars after a September 14th, 2016 article published on a site called “Second Nexus” was reposted bynotable accounts, including George Takei's Facebook page:", "As savagely reported by Forbes’ Emily Willingham, the Second Nexus article’s main source of information for this “new research” was a woefully unintelligible March 2016 post from “Psychology Spot,” which cited a collection of studies that are decades old:", "The post itself took its trash can spark from two places, the first a blog at a site called Psychology Spot. The Psychology Spot post is in turn a dumpster fire of poor information about genetics and embryonic development, citing 14 references to support its hodgepodge of claims. Of these citations, only one was published this decade (in 2012) and relates to maternal support in the first years of life, not brain genetics. There is no “new research” at all here.", "The other source alluded to was a Cosmopolitan/Good Housekeeping article (the same article with the same byline appeared on both web sites) that circularly led with the same misleading suggestion that new research had been performed, citing that same problematic post as their source:", "When it comes to your IQ, \"I got it from my mama\" couldn't be more accurate. New research featured in Psychology Spot says people are born with conditioned genes that work differently depending on if they're from your mother or father — and when it comes to your intelligence, those genes are from mother dearest.", "These articles threw around a variety of impressive-sounding terms such as \"conditional\" genes but failed to make a coherent case from the outdated studies they cited. To reach their conclusions, they made the following assumptions:", "The first notion to untangle is the existence of discrete \"intelligence genes\" in the first place. Researchers can point to decades of work showing that a large part of what they refer to as general intelligence (a psychometric they call g) variability can be explained by genetic variability. In a 2010 Molecular Psychiatry paper covering this topic, scientists stated:", "[M]eta-analysis of [studies comparing identical and fraternal twins] yield heritability estimates of about 50%, indicating that about half of the total variance in g can be accounted for by genetic differences between individuals.", "However, this does not mean we have a detailed understanding of which specific genes reliably relate to intelligence, nor do we have a great idea of how a variety of different genes would work in concert to build what we conceive of as intelligence. A 2012 article published in Psychological Science attempted to replicate the results of studies citing specific genes as predictors of intelligence. Failing to do so in almost every case, they concluded:", "Associations of candidate genes with psychological traits and other traits studied in the social sciences should be viewed as tentative until they have been replicated in multiple large samples. Failing to exercise such caution may hamper scientific progress by allowing for the proliferation of potentially false results [... which may lead to] incorrect perceptions about the state of knowledge in the field, especially knowledge concerning genetic variants that have been described as “genes for” traits on the basis of unintentionally inflated estimates of effect size and statistical significance.", "The second notion to dispel (already compromised by the fact that we don’t have a good handle on which genes work together to drive intelligence) is that these “intelligence genes” are all located on the X chromosome. This view comes primarily from the observations that:", "Psychologist Wendy Johnson and her colleagues make a summary of the latter argument in a 2009 paper published in Perspectives in Psychological Science:", "In heterozygous females, the effects of any activated deleterious allele from one X chromosome in some cells of the body are likely to be offset toward the population mean by the effects of the corresponding allele on the other X in other cells of the body. Males experience no such buffering effects: any deleterious alleles on their single X chromosome are expressed in all cells throughout the body.", "While an interesting explanation for this potential variability in intelligence, the authors of this same study (and subsequent others) do not conclude that all genes for intelligence lie on the X chromosome:", "To date, conventional genetic linkage and association (including genome-wide association) studies have been singularly unsuccessful in identifying the genes associated with general intelligence (e.g., Butcher et al., 2008). Many candidate genes have been identified, but replication across samples has been poor. None of the candidates proposed to date is on the X chromosome. We suggest that the X chromosome be targeted for chromosome-wide (as opposed to genome-wide) association studies.", "The last bit that needs clarification is the idea that any gene on the X chromosome, de facto, would come from the mother. Sex is determined by which set of sex chromosomes you are given by your parents, as the genetic testing company 23andMe explains:", "One chromosome pair — the sex chromosomes — is unique. You don't necessarily end up with a matching pair. Typically females have two X chromosomes and males have an X and a Y. Mothers always pass an X chromosome on to their children. Whether your father passes on his X chromosome (leading to a pair of X chromosomes) or his Y chromosome (making a mixed set) determines your sex.", "So for biologically female individuals, one of your X chromosomes is coming from your dad, and in that case it is just as likely (going along with the unproven assertion that \"intelligence genes\" lie solely on the X chromosome) that any genetic coding for smarts comes from either parent’s X chromosome.", "The three arguments used to make the claim about intelligence coming solely from your mother each fail as all-encompassing statements and rely on a flawed understanding of science, a misrepresentation of scientific consensus, or both. It is misleading, at best, to say that we know anything about which parent is (more) responsible for an offspring’s intelligence, let alone which genes.", "Looking at the even bigger picture, we find that none of the assertions provided in any of the viral news stories took into account the interplay between genetics and environment, which scientists  view as intrinsically important.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]