["This Facebook video from PNP News has been viewed more than 200,000 times since it was posted on February 20, 2019 -- six days after a suicide attack in Kashmir that killed 41 Indian soldiers.", "Here is an AFP story about the February 14, 2019 suicide attack in Indian-administered Kashmir.", "The footage in the PNP post shows a train carrying tanks and other military vehicles while a patriotic song plays in the background.", "The Urdu-language caption on the post says: “Pakistan Army has sent its tanks to border. Indians are you ready then?”", "A caption in English running across the top of the footage says: “Breaking Headlines”.", "The Urdu-language banner across the top of the video says: “Pakistan Army is busy preparing for war. Tanks leaving for the border.”", "A second caption in Urdu across the bottom of the screen reads: “Share this video, India will be scared just by watching it.”", "PNP news has more than 1.6 million followers on Facebook. They do not have a terrestrial or satellite television channel in Pakistan. Here is an official list of licensed television channels in Pakistan.", "The PNP news video has been shared repeatedly on Facebook, for example here where it has been viewed more than 120,000 times.", "A reverse image search on Yandex using key frames obtained through verification tool InVID found the footage had been posted online in 2017.", "The exact same footage as is used in the misleading Facebook posts was uploaded to YouTube here on March 7, 2017 with the caption: “Pakistan Deployed 500+ Battle Tanks Along Indian Border.”", "Below is that YouTube video:", "Below are screenshots comparing the 2017 footage (left) with the 2019 misleading footage (right):", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]