["By Saranac Hale Spencer", "Posted on December 2, 2020", "Conspiracy theorists falsely claimed that a video of an election worker during the Georgia machine recount revealed fraud in the 2020 election. All it showed was an election worker performing a routine part of the process, according to election officials.", "A two-and-a-half-minute video showing an election worker conducting an ordinary part of the recount process in Gwinnett County, Georgia, has been spun into false claims of fraud.", "This is just the most recent example in a surge of falsehoods aimed at undermining the results of the 2020 election.", "“It has all gone too far. All of it,” Gabriel Sterling, who oversees Georgia’s voting system, said at a press conference on Dec. 1 in which he called on President Donald Trump and other elected officials to condemn violent rhetoric aimed at election workers. “A 20-something tech in Gwinnett County today has death threats and a noose put out today saying he should be hung for treason. … It has to stop,” Sterling said.", "Sterling was referring to an employee of Dominion Voting Systems who is seen in the viral video.", "The video appears to have been recorded by a recount observer, and it has been circulated by conspiracy theorists, who falsely claim it shows fraud.", "It was shared on Nov. 30 by Ron Watkins, who has been peddling election fraud claims related to Dominion to his 328,000 Twitter followers. Watkins is the son of Jim Watkins, owner of 8kun, the website that spawned the QAnon conspiracy theory, which regards Trump as a crusader against an elitist group of pedophiles. Some of Watkins’ election-fraud claims were included in a recent affidavit for a lawsuit brought by Lin Wood, an Atlanta-area lawyer who has also promoted QAnon rhetoric.", "When Watkins shared the video, he included this text: “Watch a Dominion Representative at Gwinnett County Election Central, responsible for tabulating ballots and certifying results, download data to a USB from the Election Management Server, plug it into a laptop, manipulate the data, then palm the USB.”", "The right-wing website Gateway Pundit published Watkins’ thread on the topic as though it were a news story.", "But the video shows no such thing.", "First of all, the person in the video wasn’t responsible for certifying election results. “Certification can only be done by the election board,” Joe Sorenson, spokesman for Gwinnett County, told us in a phone interview. The Dominion contractor was there to help with the tabulating process.", "As for what the video shows him doing, the worker was conducting a routine check of the number of ballots that had been recounted, Sterling, the voting system implementation manager in Georgia, explained in a phone interview with FactCheck.org. He was using a USB drive to transfer a report about a recently counted batch of ballots to a computer equipped with a program to read it.", "“This is just part of the recount process,” Sterling said, estimating that the procedure shown in the video might be done every hour or two.", "We don’t know exactly when the video was recorded or by whom, but it appears to have been during the state’s recent recount. The cordoned-off section of the room where the recording was made was open to the public, Sorenson said.", "The earliest version of the video we could find was on the QAnon-themed YouTube channel that Watkins cited on Nov. 30. A recount requested by the Trump campaign had started about a week before, on Nov. 24. It was scheduled to end Dec. 2.", "That recount was the second review of Georgia’s election outcome. The first review was a full hand-count audit of paper ballots that was conducted under a new state law and was completed on Nov. 19. The audit confirmed President-elect Joe Biden’s win, and Georgia Secretary of State Brad Raffensperger, a Republican, certified the results of the state’s election.", "After the results were certified, the Trump campaign was able to request the machine recount.", "Raffensperger said at a press conference Dec. 2 that he expected no substantial changes to the final tally following the recount.", "There were no substantial changes following the audit, either.", "In Gwinnett County, where the video was recorded, Biden won 58% of the vote. That percentage didn’t change after the audit, although Trump did pick up an additional 285 votes out of a total of 415,507 ballots cast.", "Also, Sterling noted that the video appears to have been taken during the recount of the votes, not the original tabulation. So, if a worker manipulated the vote count at that point, there would have been a discrepancy in the numbers.", "The suggestion that the video shows fraud that would favor Biden is false.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here for more.", "“Viral Voting Misinformation.” FactCheck.org. Updated 25 Nov 2020.", "Georgia Public Broadcasting (@gpbnews). “‘It has all gone too far,’ Georgia election official @GabrielSterling said while addressing threats against election workers.” Twitter. 1 Dec 2020.", "Sterling, Gabriel. Voting System Implementation Manager for Georgia. Telephone interview with FactCheck.org. 1 Dec 2020.", "Georgia Secretary of State. Recount results by county. Accessed 1 Dec 2020.", "Sorenson, Joe. Spokesman, Gwinnett County, Georgia. Telephone interview with FactCheck.org. 2 Dec 2020.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]