["The 30-second video was published on Facebook here on March 10, 2021.", "The footage shows dozens of women chanting during a women’s day march in the Pakistani city of Karachi. The clip includes superimposed Urdu subtitles that translate as:", "“Even your father will give freedom.”\n\t“Even your father will give freedom.”\n\t“Imran should also listen, freedom.”\n\t“Imran should also listen, freedom.”\n\t“Imran should also listen, freedom.”\n\t“Iqbal should also listen, freedom.”\n\t“Imran should also listen, freedom.”\n\t“Allah should also listen, freedom.”\n\t“These all should listen too, freedom.”\n\t“The Prophet should also listen, freedom.”\n\t“Saints should also listen, freedom.”\n\t“Saints should also listen, freedom.”", "The Facebook post’s Urdu-language caption translates as: “Insult of Allah and Prophet (Mohammad) in the name of women's march. Just check the slogans. Where is the state and law? Is this allowed openly on roads? Non-Muslims do not insult so much.”", "The post circulated just days after women rallied across Pakistan to mark International Women’s Day on March 8, 2021. The women’s march, officially known as Aurat March in Urdu, was reported on by Dawn newspaper here and The News International here.", "The same video with identical subtitles was also published on Facebook here, here and here and on Twitter here, here and here.", "However, the claim is false.", "The original footage was published by Aurat March organisers on Twitter here on March 11, 2021.", "A review of the footage shows that the subtitles added to the misleading version of the video are not an accurate translation of the chants.", "One of the alleged chants — “Iqbal should also listen, freedom” — is a reference to Muhamad Iqbal, a poet, philosopher and major Pakistani independence figure.", "In reality, the women were chanting “Ismail should also listen, freedom” — a reference to Imran Ismail, the leader of the ruling Tehreek-e-Insaf party and the governor of Pakistani province of Sindh.", "The alleged chants “Allah should also listen, freedom” and  “Auliya’s (saints) should also listen, freedom” are also inaccurate.", "The women were in fact chanting “Mullah should also listen, freedom” and “Orya should also listen, freedom”. Orya Maqbool Jan is a Pakistani columnist and a former civil servant who is known for his opposition to the women's march.", "Finally, the chant “Rasool (Prophet) should also listen, freedom” is incorrect. The women were actually chanting “Ansar should also listen, freedom” — a reference to Ansar Abbasi, a journalist and vocal critic of the women's march.", "At no point are any chants invoking Allah or the Prophet Mohammad heard during the original footage.", "Below is a  screenshots comparison of the original video with accurate subtitles (L) and the misleading video with inaccurate subtitles (R):", "The Aurat March tweet that featured the original footage also condemned the spread of the false claims about the women’s chants.", "“The Aurat March faces severe backlash every year. Our videos & posters are targeted & manipulated, spreading misinformation to malign the March,” the tweet reads, adding “#StopSpreadingFakeNews”.", "Organisers of Pakistan's International Women's Day rallies have received death threats after what they called a \"vicious smear campaign\" saw doctored images of the event circulate online, AFP reported here.", "AFP has fact checked several other false claims about the women’s march in Pakistan; for instance here and here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]