["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Rep. Gus Bilirakis, R-Fla., in a Veterans Affairs meeting in Tampa. (Tampa Bay Times)", "U.S. Rep. Gus Bilirakis, R-Palm Harbor, defended the president’s decision to withdraw the United States from the Paris climate agreement, claiming it would save millions of jobs in a letter to constituents.", "\"A study by the National Economics Research Association showed that the deal could cost 2.7 million lost jobs in the U.S. by 2025 should our country adhere to the commitments made by the Obama Administration,\" Bilirakis said.", "A reader who received the letter asked us to look into it.", "Would the United States have lost 2.7 million jobs had it remained in the agreement? This is a statistic President Donald Trump also cited in his speech declaring the withdrawal, but we found that the study is based on an extreme model, and its results were presented in a misleading way.", "Bilirakis’ office directed us to Trump’s announcement to withdraw from the Paris accord, citing the same study.", "But when we asked NERA about it, the organization forwarded the same statement they put out following Trump’s speech.", "\"Use of results from this analysis as estimates of the impact of the Paris Agreement alone mischaracterizes the purpose of NERA’s analysis, which was to explore the challenges of achieving reductions from U.S. industrial sectors over a longer term,\" it states. \"Selective use of results from a single implementation scenario and a single year compounds the mischaracterization.\"", "Here’s why plucking the 2.7 million-lost jobs talking point is a bad idea.", "The study predicts the potential impact of hypothetical U.S. regulatory action to meet the carbon emission goals pledged in Paris. It was produced in March 2017 and funded by the American Council for Capital Formation and the U.S. Chamber of Commerce, both vocal opponents of the agreement.", "The loss of 2.7 million jobs economy-wide by 2025 reported in the study is contingent on \"additional regulatory actions necessary to meet the Paris target.\" But the Paris agreement does not require actions, as it was not binding, and the regulatory action mentioned has not been proposed.", "The study begins, then, with the assumption that regulation would expand beyond the electricity sector, which is where the Obama administration directed it.", "According to law professor Cary Coglianese, the director of the University of Pennsylvania Program on Regulation and author of Does Regulation Kill Jobs?, the study is a forecast based on an erroneous model.", "\"How accurate that forecast or any forecast will be depends upon how well the model matches reality and the world. The particular model used in that NERA analysis doesn’t match up with what I think most people would recognize as the reality of the economy,\" Coglianese said.", "According to Gary Yohe, a professor of economics and environmental studies at Wesleyan University who worked on the Intergovernmental Panel on Climate Change that received a share of the 2007 Nobel Peace Prize, the model does not accurately reflect government regulation or the energy industry’s reaction to market trends.", "\"They impose what they interpret as the effect of what the Unites States agreed to under the Paris accord,\" Yohe said, but \"they pick the least efficient way of doing it.\" The hypothetical regulations they impose are inflexible, ruling out cap-and-trade or taxes and instead set strict regulations on specific sectors.", "The NERA researchers acknowledged the risk of their predictions.", "\"The findings contained in this report may contain projections based on current data and historical trends,\" the report states. \"Actual results could be impacted by future events that cannot be predicted or controlled, including, without limitation, changes in business strategies, the development of future products and services, changes in market and industry conditions, the outcome of contingencies, changes in management, and changes in law or regulations.\"", "The development of future products and services, though, is precisely what the renewable energy industry is all about.", "But the study assumes the economy and technology will remain unchanged.", "\"There’s no inclusion in the analysis of the growth or development of renewable energy sources, for example,\" Coglianese said. \"And one thing we know about jobs, renewable energy sources tend to result in hiring of more people and more jobs than in other parts of the energy sector.\"", "\"According to the U.S. Energy and Employment Report designed by the Energy Information Administration, over 373,000 Americans were employed in solar energy, while the coal industry employed about 160,000 and continued to shrink since 2012 due, in part, to competition by natural gas.", "So while the quote in the NERA study seems to conflate job loss with unemployment, it ignores the possibility of a changing job market in which jobs in the renewable energy industry replace jobs in the traditional fossil fuel industry that would face heavier regulation to comply with the agreement.", "Our ruling", "Bilirakis said that the Paris accord could cost the United States 2.7 million jobs by 2025, citing a NERA study that presented this projection. But the study is unreliable, using an extreme model that does not consider the possible benefits of carbon regulation and rules out investment, flexibility or technology that would lead to more jobs.", "And as NERA itself stated, the study was not designed as a cost-benefit analysis of the Paris accord.", "We rate this statement False.", "Email from Rep. Gus Bilirakis to constituent, June 13, 2017.", "Email interview Elena Hernandez, press secretary for Gus Bilirakis, June 20, 2017.", "WhiteHouse.gov, \"Statement by President Trump on Paris Climate Accord,\" June 1, 2017.", "Phone interview Cary Coglianese, the director of the University of Pennsylvania Program on Regulation and author of Does Regulation Kill Jobs, June 20, 2017.", "Phone interview Gary Yohe, a professor of economics and environmental studies at Wesleyan University, June 20, 2017.", "NERA, \"Impacts of Greenhouse Gas Regulations on the Industrial Sector,\" March 22, 2017.", "NERA, \"NERA Economic Consulting’s Study of U.S. Emissions Reductions Policies: Statement of Facts,\" June 4, 2017.", "Email interview with Benjamin Seggerson, senior manager in media and communications at NERA, June 20, 2017.", "Nature International Weekly Journal of Science, \"Global non-linear effect of temperature on economic production,\" Nov. 12, 2015.", "Department of Energy, \"2017 U.S. Energy and Employment Report,\" January, 2017.", "The New York Times, \"Today’s Energy Jobs are in Solar, not Coal,\" April 25, 2017.", "Email interview with Philip Newell, senior creative media manager at Climate Nexus, June 20, 2017.", "Climate Feedback, \"In Paris Agreement op-ed, US Senator Ted Cruz misrepresents the costs and benefits of reducing greenhouse gas emissions,\" May 29, 2017.", "MIT News Office, \"MIT issues statement regarding research on Paris Agreement,\" June 2, 2017.", "U.S. Chamber of Commerce, \"U.S. Chamber Statement in Reaction to COP21 Climate Change Agreement,\" Dec. 12, 2015.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]