["\"Boy in the pub was telling me his job is a penguin erector so every time a plane flys over Edinburgh zoo the penguins can’t take their eyes off it and end up falling over n he just goes round picking them back up, 38 penguins 2000 flights a day,\" said Twitter user @shalylaa in August 2018.", "Boy in the pub was telling me his job is a penguin erector so every time a plane flys over Edinburgh zoo the penguins can’t take their eyes off it and end up falling over n he just goes round picking them back up, 38 penguins 2000 flights a day", "The tweet was shared 170,000 times at the time, and is now resurfacing as a Facebook post.", "However, the boy in the pub was wrong. Within a day of the initial message, the Edinburgh zoo commented directly on the tweet, confirming certain users’ doubts that the information was in fact false.", "We're sure this will come as a disappointment to many but there is no such position here at Edinburgh Zoo ?", "The Edinburgh zoo is also home to more than 130 penguins, not 38, as the tweet suggest. They can be seen at all times via the Edinburgh zoo’s live penguin cam, available here.", "The Edinburgh zoo also addressed the more general myth that penguins in Antarctica topple upon watching airplanes, sometimes causing their death.", "It's a very popular rumour, but penguins do not track planes as they fly overhead. Any clumsy penguin behaviour tends to be unrelated to aircraft ?", "The myth is almost as old as the internet, and according to fact-checking website Snopes it may have originated in a 1985 article of the Audubon Society magazine. AFP Fact Check found that the article was picked up and shared online as a joke in 1993.", "Over time, the story became credible enough that a British Royal Navy mission was sent to the Falkland Islands to investigate the matter in 2000, The Guardian reported at the time. Two Lynx helicopters flew over King penguins to observe the birds’ reaction and found that “Not a single bird fell over after 17 flights,” Dr Richard Stone of the British Antarctic Survey said.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]