["On December 28, BJP social media head Amit Malviya tweeted a video and claimed that it shows anti-CAA protesters in Lucknow raising ‘Pakistan zindabad’ slogans. Malviya wrote, “Since this is a season of pulling out old videos, here is one from Lucknow where anti-CAA protestors can be seen raising ‘Pakistan Zindabad’ slogans… Damn! Someone needs to have a samvaad with them and ask them to carry tricolour and Bapu’s picture for the cameras next time.”", "Since this is a season of pulling out old videos, here is one from Lucknow where anti-CAA protestors can be seen raising ‘Pakistan Zindabad’ slogans… Damn! Someone needs to have a samvaad with them and ask them to carry tricolour and Bapu’s picture for the cameras next time… pic.twitter.com/Lvg7sj2G9Z", "— Amit Malviya (@amitmalviya) December 28, 2019", "It is noteworthy that the video has surfaced on social media after a clip of Meerut SP Akhilesh Narayan Singh asking anti-CAA protesters to “go to Pakistan” went viral. SP Singh defended his position with the claim, “Some boys raised Pakistan zindabad slogans after seeing us.” The senior police officer alleged that his “go to Pakistan” statement was in response to the boys’ anti-India sloganeering.", "The same video was tweeted with the identical claim by Haryana BJP IT cell head Arun Yadav.", "Media outlet Zee News ran a broadcast based on the video and declared that ‘Pakistan zindabad’ slogans were indeed raised at an anti-CAA rally in Lucknow on December 13. Zee News also stated that flags of Asaduddin Owaisi’s party AIMIM can be spotted in the clip.", "Republic broadcast a show on the video titled, “Unverified Video Surfaces From UP: ‘Pakistan Zindabad’ Slogans Raised At AIMIM Rally In Lucknow.” The channel spoke to a correspondent Vasudev who claimed that an FIR was lodged after the December 13 rally which states that ‘Pakistan zindabad’ slogans were raised during the protest. However, Vasudev added that no arrests have been made yet and the police are investigating who raised the chants.", "The video is also massively viral on social media – Facebook and Twitter. One Neetu Garg, who is followed by PM Modi and Amit Shah, quote-tweeted Meerut SP Akhilesh Narayan Singh’s statement and shared the same video. Several other users – Vinita Hindustani and Pooja Singh – tweeted the clip as well.", "It has also been shared on YouTube by multiple channels including Breaking Tube. This channel has been found circulating misinformation in the past.", "If one carefully listens to the audio, the protesters are not chanting ‘Pakistan zindabad’ but ‘Kashif saab zindabad’. Alt News has clipped the relevant parts and slowed down the video 2x times below. It is recommended that readers use earphones for clarity. This is how the complete slogan goes (those who wish to listen to the same portion at normal speed click here):", "Sloganeer: Akbar Owaisi zindabad.", "Crowd: Zindabad, zindabad", "[Pause]", "Sloganeer: Kashif saab zindabad", "Crowd: Zindabad, zindabad", "Sloganeer: Kashif saab zindabad", "Crowd: Zindabad, zindabad", "Sloganeer: Hindustan zindabad", "Crowd: Zindabad, zindabad", "Below is ‘Hindustan zindabad’ played on a loop at its normal speed.", "Kashif saab aka Kashif Ahmad is the Lucknow AIMIM chief. In a conversation with Alt News, AIMIM UP president Haji Shaukat Ali informed that Kashif Ahmad was leading the December 13 protest. Alt News confirmed that Ahmad was present at the rally. He is the man in white in the photograph below.", "The video below shows Kashif Ahmad (the man in white in the middle of the crowd) raising ‘Hindustan zindabad’ slogans at the same rally.", "All India Majlis-e-Ittehadul Muslimeen (AIMIM) held a protest rally against the Citizenship Amendment Act (CAA) and the National Register of Citizens (NRC) on December 13. Protesters marched from Clock Tower to Teele Wali Masjid in Lucknow. According to a December 15 Hindustan Times report, two FIRs were filed against the protestors. “The first FIR was lodged on the complaint of Satkhanda police outpost in-charge sub-inspector Rajiv Dwivedi. In his complaint, Dwivedi mentioned that a group of people gathered near Clock Tower without permission and raised anti-India slogans…Another FIR for violation of prohibitory orders was lodged at Chowk police station against the protestors, who staged a demonstration when they reached Teele Wali Masjid.” However, CAA protesters and AIMIM representatives claimed that they had held a peaceful protest and did not raise any slogan against the country.", "Alt News was able to access a copy of both the FIRs. Media outlet Republic’s claim that the FIR mentions ‘Pakistan zindabad’ slogans were raised is false. As per the complaint, protesters at AIMIM rally raised slogans against the Indian government, NRC and CAA. It also mentions that they chanted provocative slogans. The FIRs were lodged under various sections of the IPC, including sedition.", "According to a December 18 report by The Indian Express, the police dropped sedition charges saying they “could not be substantiated.”", "Multiple social media users, media outlets Republic and Zee News, and BJP IT cell head Amit Malviya shared the video in question with a false claim. The protesters did not chant ‘Pakistan zindabad’ but ‘Kashif saab zindabad’.", "Donate Now", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]