["By Angelo Fichera", "Posted on May 9, 2018", "Q: Did Michelle Obama call women who voted for President Donald Trump “stupid”?", "A: No. But the former first lady did say she was concerned about the role women played in electing Trump.", "Former first lady Michelle Obama made headlines in recent days for a public appearance in which she expressed concern about how women view themselves, given their hand in the outcome of the 2016 presidential election.", "Exit polling on Election Day showed that 41 percent of women voted for Republican Donald Trump and 54 percent voted for Democrat Hillary Clinton.", "But a headline that quotes Obama as saying, “Stupid Women Elected Trump,” isn’t true. That story, posted May 6 by the website Mad World News, has been repackaged and shared across social media channels. On Facebook, users rightly flagged such a post — published on quickdailyupdates.com — as potentially false.", "The fictitious headline followed Obama’s interview with the actress Tracee Ellis Ross at the United State of Women Summit in Los Angeles on May 5.", "About halfway into their on-stage conversation, Ross asked Obama about young girls’ dreams and whether they’ve evolved over time.", "“We’re still at that stage where we’re trying to figure out what it means to be women and what we think of ourselves, what we think of each other,” Obama responded, as a video of the 40-minute talk shows. “Sorry, in light of this last election, I’m concerned about us as women and how we think about ourselves and about each other and what’s really going on.”", "She continued: “I think more about, what is going on in our heads where we let that happen, you know? So I do wonder what are young girls dreaming about if we’re still there — when the most qualified person running was a woman, and look what we did instead. I mean that says something about where we are.”", "“If we as women are still suspicious of one another … if we still have this crazy, crazy bar for each other that we don’t have for men,” Obama added. “If we’re still doing that today … if we’re not comfortable with the notion that a woman could be our president, compared to what?  … We have to have that conversation with ourselves as women.”", "Though some of what Obama actually said appears in the Mad World News story, the piece is mostly the author’s opinion and interpretation of what the former first lady said.", "For example, the article says: “According to Michelle, ‘how did we [women] let that happen’ translates into any women who voted for Trump was stupid.”", "That’s not what Obama said, but the headline – “After Michelle Says ‘Stupid Women Elected Trump,’ Melania Gives Her Nasty Surprise” — falsely claims that she did.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk false stories flagged by readers on the social media network.", "“After Michelle Says ‘Stupid Women Elected Trump,’ Melania Gives Her Nasty Surprise.” Quickdailyupdates.com. 7 May 2018.", "Diserio, Rebecca. “After Michelle Says ‘Stupid Women Elected Trump,’ Melania Gives Her Nasty Surprise.” Mad World News. 6 May 2018.", "“How Groups Voted 2016.” Roper Center for Public Opinion Research at Cornell University. Accessed 8 May 2018.", "The United State of Women. “Michelle Obama & Tracee Ellis Ross in Conversation at The 2018 United State of Women Summit.” YouTube. 6 May 2018.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]