["The photo was published on Facebook here on August 5, 2020. It has been shared more than 2,300 times.", "The post caption reads: “Beirut, Lebanon”.", "The post was published one day after a massive chemical explosion at the port of Beirut on August 4. The blast killed at least 171 people and injured 6,500 others, AFP reported here on August 13.", "The same photo was also shared on Facebook here, here and here alongside a similar claim.", "The claim, however, is false.", "Keyword and reverse image searches on Google found the photo was in fact taken by a European Pressphoto Agency (EPA) photographer in the aftermath of an explosion in the Chinese city of Tianjin in August 2015.", "The EPA photo, which can be found on the news agency’s website here, is captioned in part: “An aerial view of a large hole in the ground in the aftermath of a huge explosion that rocked the port city of Tianjin, China, 15 August 2015. Explosions and a fireball at a chemical warehouse killed at least 85 people in the north-eastern Chinese port city of Tianjin late on 12 August.”", "The same photo also appeared in several August 2015 reports about the Tianjin explosion, for example on the website for UK-based weekly magazine The Economist here and on the BBC News website here.", "Below is a screenshot comparison of the photo in the misleading posts (L) and the EPA photo (R):", "AFP Fact Check debunked a similar false claim about the photo here after it was shared in Arabic social media posts.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]