["Was P V Narasimha Rao the first Prime Minister from the Congress party who did not belong to the Gandhi family? Apparently so, according to Navika Kumar, managing editor with Times Now and anchor of the prime time show The Newshour. Kumar was speaking live on November 16, 2018 ahead of her prime time show.", "Navika Kumar on #ModiChaiwalaDare", "Posted by TIMES NOW on Friday, November 16, 2018", "As can be seen in the above video from around 1:20 to 2:13, Kumar can be heard saying, “The Prime Minister has said once again that they just cant get over the fact that a chaiwala has become a Prime Minister.” She continues, “If Nehru had made such democratic attempts at creating infrastructures in this country, then why have there been hardly any non-Gandhi prime ministers in this country? why has Nehru only nominated his own daughter Indira Gandhi to be his successor? Why was there nobody else who could have stepped into Nehru’s shoes? Why was P V Narasimha Rao who became the first non-Gandhi Congress PM of this country treated the way he was; when he died, his dead body was not even brought inside the Congress office?", "It must be noted here that while Kumar has ostensibly quoted the Prime Minister, PM Modi in his speech had referred to his humble origins and the chagrin of the Congress party over his election as Prime Minister. He did not make any reference to P V Narasimha Rao or non-Gandhi prime ministers from the Congress party. These are the words of Navika Kumar herself. She begins by quoting PM Modi and then goes on to convey what is presumably her opinion.", "The context of this monologue by Kumar was the recent statement made by Congress leader Shashi Tharoor, who had said that it was the establishment of institutional structures by the Congress party led by Nehru that made it possible for a ‘chaiwala’ to become the Prime Minister of the country.", "Navika Kumar’s statement that P V Narasimha Rao, who became the Prime Minister in 1991, was the first PM of the Congress party who did not belong to the Gandhi family, is false. The list of politicians who have served as Prime Minister of India is available on the website of the Prime Minister’s Office (PMO). Posted below is a screenshot of the same.", "Chronologically, Jawaharlal Nehru was the Prime Minister from August 15, 1947 to May 27, 1964, the day he died. Nehru was followed by Gulzari Lal Nanda who served as the acting Prime Minister for 13 days, from May 27, 1964 to June 9, 1964. On June 9, 1964, Nanda was replaced by Lal Bahadur Shastri who served as the Prime Minister of India from June 9, 1964 to January 11, 1966.", "Both Gulzari Lal Nanda and Lal Bahadur Shastri belonged to the Indian National Congress, and neither belonged to the Nehru-Gandhi family. While Nanda served as the acting PM twice (he was sworn in again for 13 days following Shastri’s death in 1966), Shastri was a full-time Prime Minister who served from June 1964 to January 1966.", "Information about Prime Ministers who have served India is freely and readily available online and only requires the most basic research, if one is unaware of the political history of post-independent India. In its eagerness to project the Prime Minister as a target of the Congress party’s ‘elitism’, Times Now misled viewers with inaccurate and biased information.", "Donate Now", "Arjun Sidharth is a writer with Alt News. He has previously worked in the television news industry, where he managed news bulletins and breaking news scenarios, apart from scripting numerous prime time television stories. He has also been actively involved with various freelance projects. Sidharth has studied economics, political science, international relations and journalism. He has a keen interest in books, movies, music, sports, politics, foreign policy, history and economics. His hobbies include reading, watching movies and indoor gaming.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]