["The post, which was first published May 22, 2016 and has been shared more than 123,000 times since, show a photo of a very bendy road which it claims is in the Philippines.", "The caption, when translated to English, says: “Hey, people from Bicol! Doesn’t it cause dizziness to pass through here. One needs Bonamin always. Hahahaha. CHICKEN ENTRAILS at Atimonan Quezon.”", "Bonamin is a reference to an over the counter medicine used to treat motion sickness and vertigo.", "BITUKANG MANOK or “chicken entrails” is a reference to a stretch of the national highway known for hairpin bends that runs through the mountainous Quezon National Park on the Bicol peninsula.", "The photo has also been posted with the same caption here and here.", "A reverse image search using Baidu found that the exact same photo as is used in the misleading image appears in this 2016 report credited to the Guizhou Daily newspaper, a Mandarin-language publication for southeast China’s Guizhou province.", "The article is headlined: “Guizhou: making the province a destination for both sport and ethnic tourism”.", "The caption of the photograph says when translated to English: \"Stilwell Road’s 24-Zig in Qinglong county, staging a car climbing race.\"", "More images of the 24-Zig road can be seen here on this official Qinglong county government website, with the headline “The bend of history: Qinglong’s 24-Zig road.”", "According to this announcement also posted on the Qinglong county’s government website, the road is closed to vehicle traffic for protection, as it is a historic site used during World War II.", "The location of the 24-Zig road in Qinglong can be seen on Baidu maps here and on a Google map satellite image here. The contours of the 24-Zig road seen on both mapping services match the contours of the road in the misleading Facebook post's photo.", "Another image of the 24-Zig road can also be seen here on the dangerousroads.org website.", "Below is a screenshot of the dangerousroads.org photo:", "Dangerousroads.org also identifies the road as the 24-Zig Road, which it says is near Qinglong town in Guizhou Province, in southwest China.", "“It was built during WW-II, and played an important role in the supply of China during the war to help resist the Japanese invasion. At present the road is no longer in active use but is still used as a shortcut by motorbikes and three-wheelers,” the website says.", "Below is the dangerousroads.org photo -- which AFP has cropped to make comparison easier -- next to the the image used in the misleading Facebook post:", "Keyword searches using the term “24-Zig” led to a photograph of the road published in the Indian Quarterly with the caption: “the ‘24-Zig’ road in Qinglong, December 9, 2011.”", "The image was taken by AFP photo editor Findlay Kember who wrote an account of travelling the length of the Ledo-Burma Road, also known as the Stilwell Road, which runs from Ledo in India's north-eastern state of Assam, through Myanmar and ends in Kunming in the south-western Chinese province of Yunnan.", "Here is a BBC story about Kember’s trip, which also features a photograph of the “24-Zig” road.", "The misleading Facebook posts claim the road in the image is a stretch of the national highway that runs through the mountainous Quezon National Park on the Bicol peninsula in the Philippines.", "A Google satellite image of Quezon National Park found the contours of the road in that area bear no resemblance to the road seen in the misleading image.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]