["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Rep. Ron Paul, R-Texas, was one of eight presidential candidates to take part in the Aug. 11, 2011, debate in Ames, Iowa.", "Republican presidential candidate Rep. Ron Paul of Texas, who has raised warning flags about U.S. debt for decades, declared in an Iowa debate Aug. 11, 2011, that \"the country's bankrupt.\"", "Okay, we'll bite: Is it?", "PolitiFact Wisconsin tested a similar claim in February from Gov. Scott Walker (\"We’re broke. We don't have any more money.\") and found it False. But Paul's talking about the whole country.", "Fox News, Republican candidates debate, Aug. 11, 2011, accessed via CQ Transcriptswire (subscribers only)\n\nSt. Petersburg Times, \"Ron Paul spreading same message as always, resonating finally,\" Aug. 11, 2011\n\nPolitiFact Wisconsin, \"Wisconsin Gov. Scott Walker says Wisconsin is broke,\" March 3, 2011\n\nGoogle Dictionary, \"bankrupt,\" accessed Aug. 12, 2011\n\nMerriam-Webster, \"bankrupt,\" accessed Aug. 12, 2011\n\nStandard & Poor's, \"United States of America Long-Term Rating Lowered To 'AA+' On Political Risks And Rising Debt Burden; Outlook Negative,\" Aug. 5, 2011\n\nInterview with John Piecuch, spokesman for Standard & Poors, Aug. 12, 2011\n\nE-mail interview with Peter Fitzpatrick, spokesman for Fitch Ratings, Aug. 12, 2011\n\nInterview with Matt Anderson, spokesman for U.S. Treasury Department, Aug. 12, 2011\n\nTreasury Department, Bureau of Public Debt, \"How Treasury Auctions Work,\" accessed Aug. 12, 2011\n\nTreasury Department, Bureau of Public Debt, \"Today's Auction Results,\" accessed Aug. 12, 2011\n\nU.S. Treasury Department, \"Debt Limit,\" accessed Aug. 12, 2011\n\nBarron's, \"Fresh from Downgrade, Treasuries Rally,\" Aug. 8, 2011", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]