["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Republicans have made jobs the central theme of the campaign, and \"400,000\" -- an aptly titled TV ad from GOP gubernatorial candidate John Kasich -- dutifully delivers its refrain: \"Under Ted Strickland as governor, Ohio has lost nearly 400,000 jobs.\"\n\nPolitiFact Ohio earlier rated that claim as Half True. We found it did not reflect the larger economic backdrop of a national recession and a steady loss of Ohio jobs since January 2000. We found the claim broke down at the suggestion that the governor, or any one official, is responsible for the job losses.\n\nBut the pitchman in \"400,000,\" a burly fellow with a white hardhat tucked under his arm, goes a step further. He says: \"Ted Strickland destroyed Ohio jobs when he busted the budget and raised our taxes to help pay for his mistakes.\"\n\nThat's a mouthful. PolitiFact Ohio bit off a piece of it earlier, when we examined Kasich's charge that Strickland raised taxes on Ohioans, a charge the Democratic governor has vehemently denied.\n\nStrickland says he didn’t raise taxes -- he only froze the final year of a five-year, 21-percent income tax cut that started in 2005. That move, narrowly approved by the Republican-controlled Ohio Senate, saved the state approximately $840 million. Strickland insists the only alternative was to cut the money from primary and secondary education.\n\nBut there are no guarantees that the tax cut will be unfrozen next year. Taxpayers, who had to pay more in income taxes for 2009 than they had expected, may continue to pay at the higher rate. That’s why PolitiFact Ohio rated Kasich’s statement as Mostly True.\n\nBut what about the first part of the statement, which we take up now. How did the governor destroy Ohio jobs? What does \"busted the budget\" mean? And what were Strickland's \"mistakes\"?\n\nWe asked the Kasich campaign. This was the answer from press secretary Rob Nichols:\n\n\"He tried to fill the $850 million hole with slot machines and racetracks. And that didn't work. So he reneged on his pledge not to raise taxes, to the tune of $840 million, in a recession, in the worst economy since the Depression.\"\n\nThat still didn’t tell us what \"busted the budget\" means, or how Strickland busted it. Ohio law requires the state budget be balanced, and the governor shares authority and responsibility for it with the General Assembly.\n\nA share of the blame for the $850 million shortfall, or hole, can be pinned on Republicans, who were in power in the General Assembly while spending increased seven consecutive budgets while taxes were cut.\n\nHouse Speaker Armond Buddish, a Democrat, recently chided Republicans for not paying for their tax cuts, a claim PolitiFact Ohio found Mostly True. Democrats, he said, \"made the cuts that Republicans wouldn’t\" slicing almost $2 billion from the current $50.5 billion general revenue fund budget.\n\nStrickland did propose installing slot machines at horse racing tracks, a plan he said would have brought the state almost $1 billion. That plan -- which the legislature agreed to put in the budget bill -- was killed by a lawsuit from a group of conservative activists called LetOhioVote.\n\nThat doesn't make the plan a mistake. It still could be adopted.\n\nWhen lawmakers draft a new two-year budget next year will have to find some source of revenue, or chop programs. They won’t have nearly $5 billion in one-time money that helped balance the current budget.\n\nFinally, the claim that Strickland destroyed Ohio jobs amounts to political hyperbole. Ohio and other industrial states all hemorrhaged jobs when the economy hit the skids, and the causes of the recession are much broader than just the state’s budget woes.\n\nSo where does that leave us?", "We rate Kasich’s claim that  \"Ted Strickland destroyed Ohio jobs when he busted the budget\" as False.", "Comment on this item.", "John Kasich 2010, \"400,000\" campaign ad, posted to YouTube Oct. 3, 2010\n\nPolitiFact Ohio, \"Republican Governors Association says Ohio lost 400,000 jobs on Gov. Ted Strickland's watch,\" Aug. 3, 2010\n\nPolitiFact Ohio, \"GOP challenger John Kasich says Ohio Gov. Ted Strickland’s tax freeze amounted to a tax hike,\" Oct. 13, 2010\n\nPolitiFact Ohio, \"Ohio House Speaker Armond Budish raps Republicans for their big-spending ways,\" Oct. 12, 2010\n\nInterview, Kasich campaign press secretary Rob Nichols, Oct. 5 , 2010\n\nOhio Legislative Service Commission, \"The Ohio Budget Process\"\n\nThe Plain Dealer, \"Can Ohio fix its $8 billion budget hole?,\" March 14, 2010\n\nThe Plain Dealer, \"Lottery panel to create new rules for video slots,\" July 20, 2010", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]