["On August 6, media outlets published a syndicated news report by Press Trust of India (PTI). The report stated that the Indo-Islamic Cultural Foundation (IICF), a trust constituted by the Uttar Pradesh State Sunni Central Waqf Board to construct a mosque on five acres of land in Ayodhya, is in the process of setting up an office in the state capital. The report also added that IICF will oversee the construction of a mosque, Indo-Islamic research centre, library, and hospital in the allotted land.", "In the backdrop of this, several Facebook and Twitter users have posted an image of a building with a board on the top floor that reads ‘Babri Hospital’.", "#मास्टरस्ट्रोक", "सुप्रीम कोर्ट ने जो पांच एकड़ जमीन दी थी, सुन्नी वक्फ़ बोर्ड ने लिया फैसला उस पर बनेगा बाबरी हास्पिटल जो AIIMS के बराबर मुफ्त सुविधा देगा", "इस अस्पताल में एक पूरा फ्लोर बच्चों के लिए आरक्षित होगा, जिसमें चमकी बुखार(Viral Megningits) सहित कई बिमारियों का ईलाज होगा। pic.twitter.com/sTx0Eygjds", "— ADEEL KHAN (@ADEEL_KHAN_AZMI) August 7, 2020", "Facebook page ‘We Support Ravish Kumar’ promoted the same claim with the text, “#Masterstroke Sunni Waqf Board has decided to build Babri Hospital on the five acres of land which was allocated by the Supreme Court. It will offer free treatment comparable to AIIMS. The are chances that well-known doctor #KafilKhan might be made administrator of this hospital. An entire floor will be reserved for children where they will be offered treatment for elephantiasis (viral meningitis) and other diseases.”", "(Translated from #मास्टरस्ट्रोक सुप्रीम कोर्ट ने जो पांच एकड़ जमीन दी थी, सुन्नी वक्फ़ बोर्ड ने लिया फैसला उस पर बनेगा बाबरी हास्पिटल जो AIIMS के बराबर मुफ्त सुविधा देगा.. जाने माने डाक्टर #KafilKhan को इस अस्पताल का प्रशासक बनाया जा सकता है, इस अस्पताल में एक पूरा फ्लोर बच्चों के लिए आरक्षित होगा, जिसमें चमकी बुखार(Viral Megningits) सहित कई बिमारियों का ईलाज होगा)", "#मास्टरस्ट्रोक सुप्रीम कोर्ट ने जो पांच एकड़ जमीन दी थी, सुन्नी वक्फ़ बोर्ड ने लिया फैसला उस पर बनेगा बाबरी हास्पिटल जो…", "Posted by We Support Ravish Kumar on Friday, 7 August 2020", "Other Facebook users (1, 2) also shared the claim.", "This slideshow requires JavaScript.", "Alt News spoke with Athar Hussain, an IICF spokesperson. He clarified, “The plan to build community infrastructure like the community dining hall, a museum, and library along with the mosque on the five-acre land granted by the Honorable Supreme Court was shared long back. The IICF is working towards it. However, no details have been made public because it’s a work in progress. Recently, a misleading Facebook post had gone viral that claimed Babri Hospital will be established just likes AIIMS. It also mentioned that Dr Kafeel Khan is expected to be appointed at Babri Hospital. I categorically refute both claims. I have informed Lucknow commissioner of police as well.”", "Journalist Mahtab Alam posted the press release by Uttar Pradesh Sunni Wakf Board that also refutes the viral message.", "#FakeNews about #babrihospital : Uttar Pradesh Sunni Central Waqf Board's Press Release dated August 7, 2020. #Ayodhya pic.twitter.com/NdBHHWvF5g", "— Mahtab महताब مہتاب (@MahtabNama) August 7, 2020", "On August 8, The Times of India (TOI) reported that Lucknow police commissioner Sujeet Pandey confirmed to the media outlet that he had received a complaint from Hussain. Pandey told TOI, “We are looking into the issue.”", "Next, Alt News performed a reverse image search of the viral image and found it on the official website of the University of Virginia (UVA). As per the website, its the UVA Medical Center.", "Additionally, readers should note that the viral text misspells Khan’s first name as “Kafil”. Dr Khan was the former head of the encephalitis ward at Gorakhpur-based Baba Raghav Das (BRD) Medical College in Uttar Pradesh. He was arrested in connection with the death of over 60 children in BRD Medical College in 2017 due to lack of oxygen cylinders. In 2019, TOI reported that the medical college department report stated, “The allegations against the accused are insufficient… Therefore it is submitted that the accused officer is not guilty.”", "Earlier this year on February 13, Dr Khan was arrested under the National Security Act (NSA) on charges of making inflammatory speeches at the Aligarh Muslim University during protests against the Citizenship Law, reported National Herald. Khan is still incarcerated. On August 7, TOI reported, “The Allahabad high court has directed the Central as well as the Uttar Pradesh government to file their respective replies (counter-affidavits) in response to a petition challenging the detention of Dr Kafeel Khan under the National Security Act (NSA).”", "Thus, social media claims that the Sunni Waqf Board has decided to build “Babri Hospital” and appoint Dr Kafeel Khan at the children’s ward is false. Indo-Islamic Cultural Foundation (IICF) is responsible for building the mosque. Alt News spoke with IICF spokesperson Athar Hussain who categorically refuted both claims. Lucknow police commissioner Sujeet Pandey informed The Times of India that they trying to trace the source of misinformation.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]