["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Visitors enter the Alamo on Monday, Oct. 2, 2017, in San Antonio. Portions of the building were blocked off from the public so Alamo staff members could monitor the decay of the building (ANA RAMIREZ, Austin American-Statesman).", "In a lengthy Facebook post, a group called Save the Alamo warned that Texas Land Commissioner George P. Bush wants to erect a statue of the Mexican general who led his nation’s forces during the Battle of the Alamo in 1836 on the grounds of the historic mission in San Antonio.", "Save the Alamo was created by Rick Range, a former candidate for land commissioner who challenged Bush during the 2018 Republican primary.", "In the post, Range described a Dec. 4 meeting of the San Antonio Historic Design and Review Commission, at which he said new information about Bush’s plans for the site came to light.", "\"However, during that hearing, it was revealed that not only do George P. Bush and the GLO intend on moving the Cenotaph outside the boundaries of the Alamo; they also intend to erect a statue of the dictator Santa Anna and a memorial honoring the Mexican Army!\" Range wrote. \"I am not making this up. We know that parts of the Bush plan were going to be horrendous, but it now looks like it will be worse than we ever dreamed.\"", "It’s true that the General Land Office, which Bush heads, has proposed moving the cenotaph monument, which honors those Texans who died at the Alamo, to a different location as part of the agency’s planned $450 million project to restore the Alamo.", "But there are no plans to build a monument to Santa Anna and the Mexican Army at the Alamo.", "Bush shared a series of tweets on Thursday rebutting the allegations in the post and suggesting that the claim has racist roots.", "Here are his tweets, presented together:", "\"One must ask themselves, why am I being accused of honoring the murderous dictator Santa Anna?\" Bush wrote. \" Is it because my mother (now a naturalized citizen) is from Mexico? I was born in Houston, my wife is from San Angelo, and my boys were born-you guessed it- here in Texas.", "\"As a United States Navy Veteran, who deployed to Afghanistan, I know exactly what it means to be loyal to the American flag, this country and this great state. The idea that I would EVER place a statue of Santa Anna at the Alamo is patently false. Enough is enough. This is an outright lie, and is quite frankly, flat out racist.\"", "There is no mention of constructing a statue or monument of Santa Anna in the official synopsis of the Alamo Master Plan, the restoration project.", "The only time Santa Anna is mentioned in the synopsis is during an overview of the different political factions present during the Battle of the Alamo.", "San Antonio Council Member Roberto Treviño, who serves on the Alamo Master Plan Management Committee, told the Rivard Report that the statement is \"baseless, and downright ridiculous.\"", "\"Among the information and rumors being spread about the plan for the Alamo, this might be one of the most obscene,\" he said. \"We are honoring our history; we are honoring the truth; we are honoring freedom. Erecting a statue of Santa Anna does none of these things.\"", "Molly Quick, director of government relations for the General Land Office, gave state lawmakers a progress report on implementation of the restoration project in a Dec. 17 email. There is no mention of Santa Anna or the Mexican Army in her materials.", "Commission meeting video not altered", "During the public meeting of the San Antonio Historic Design and Review Commission on Dec. 4, designers behind the restoration project sought the commission’s approval to start implementing the first phase of the plan, which includes landscaping and street improvements — as well as the repair and relocation of the cenotaph to its new location.", "Range, who was not present at the meeting, said he was told by others in attendance that one of the speakers presenting the project said there were plans to \"honor Santa Anna\" at the redesigned site.", "\"One of the consultants on the design teams made the statement that they were going to honor both sides, including Santa Anna and the Mexican army,\" Range told PolitiFact Texas. \"If you’re going to honor somebody, that is a statue or a memorial or a monument. I don’t know how else you would honor somebody.\"", "But multiple viewings of the archived video of the hearing reveal that none of the people presenting the project said anything about honoring Santa Anna or constructing a sculpture for him or the Mexican army.", "The only mention of Santa Anna came at the end of the presentation, when John Kasman, vice president of PGAV Destinations, spoke about future phases of the project and some details still under consideration.", "\"There are multiple stories that occurred upon that south edge that deserve to be told,\" he said, briefly mentioning the position of Santa Anna’s troops as one of those stories.", "Range said this was not the remark from the meeting that concerned him — in fact, he said he thought a plaque showcasing the movement of the Mexican troops during the 1836 battle would be a \"good idea\" for the site.", "Even though the video does not show any individual discussing a plan to \"honor\" Santa Anna, Range said he was certain the remark was made at the hearing.", "\"What they did was one of their typical ploys — they went through that video and redacted out that segment that caused the hubbub,\" Range said. \"They didn’t want people seeing it.\"", "David McElroy, the studio manager of TVSA, the public access channel that airs government meetings in San Antonio, said that footage of the Dec. 4 meeting was not edited.", "The city uses a vendor that indexes and uploads footage from public meetings to the city’s website. If technical difficulties arise, the city may need to step in and upload its own version of the footage.", "Either way, McElroy said the city \"won’t ever edit a meeting for content,\" including during the Dec. 4 commission meeting.", "\"Is this the full record of this meeting? Absolutely,\" McElroy said.", "Our ruling", "In a Facebook post, Range said \"George P. Bush to place statue of Santa Anna at the Alamo.\"", "This claim is inaccurate. There are no current plans to include a statue of Santa Anna at the Alamo.", "We rate this claim Pants on Fire.", "Facebook, Save the Alamo, Dec. 10, 2019", "Twitter, George P. Bush, Dec. 11, 2019", "Rivard Report, Bush Calls Alamo Santa Anna Statue Rumor ‘Flat-Out Racist’, Dec. 11, 2019", "San Antonio Express-News, San Antonio historical review panel delays action on Alamo project, Dec. 4, 2019", "Texas State Historical Association, SANTA ANNA, ANTONIO LOPEZ DE, accessed Dec. 12, 2019", "The Alamo, The Alamo Master Plan, accessed Dec. 12, 2019", "City of San Antonio, Video archive: Historic Design and Review Commission Meeting, Dec. 4, 2019", "Phone interview with Rick Range, Dec. 16, 2019", "San Antonio Express-News, Alamo statues part of new sculpture trail in downtown San Antonio, May 1, 2019", "Phone interview with David McElroy, TVSA manager, Dec. 16, 2019", "Email provided by Karina Erickson, spokeswoman for the General Land Office, Dec. 17, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]