["About this rating", "In mid-May 2019, viral claims began to emerge on Facebook warning about XDR-TB, or “extensively drug-resistant tuberculosis,” wreaking havoc at the Southern border. For example, a representative Facebook post asserted:", "As it turns out, these rumors are not driven by reality but by a company with a history of politically charged health misinformation selling a bogus “natural health” supplement. The claims made on Facebook mirror the claims made by an entity that calls itself the “Institute for Natural Healing” in a thinly sourced advertisement:", "Let me describe how dire the current situation is—because the Government is staying tight-lipped. It’s known as the “Mexican Blood Flu” or its scientific name… XDR-T. And you wouldn’t wish the symptoms (internal bleeding, coughing up blood, seizures and even suffocation) on your worst enemy.", "For years it was seen as a “third world problem,” killing scores of people in the world’s poorest countries… And a major outbreak within the U.S. was considered unthinkable. But here’s the horrifying truth they don’t want you to know… a U.S. outbreak has already begun. And officials have no idea how to contain it.", "The first case was discovered in McAllen, Texas near the Mexican border. An illegal alien was detained by the U.S. Border Patrol suffering from a scorching fever and coughing up blood.", "The Institute for Natural Healing is a subsidiary of a publishing company known as Agora, Inc., which has a lengthy history of using misleading tactics and politically charged language to get people to purchase supplements, ebooks, or stock tips. Snopes has previously debunked Agora content that suggested Hillary Clinton was hiding a cure for cancer, and an Agora advertisement for a 74-dollar eBook explaining how to protect yourself from an alleged “Klebsi plague” set to ravage America. The founder of Agora once declared that “our customers don’t pay us to be right.”", "In point of fact, the scientific name of the disease in question is not “XDR-T,” but “XDR-TB,” a disease categorization that is a step more serious than multidrug-resistant TB (MDR-TB). According to the Centers for Disease Control and Prevention (CDC), MDR-TB “is resistant to at least isoniazid (INH) and rifampin (RIF), while XDR-TB is “resistant to INH and RIF, any fluoroquinolone, and at least three of the injectable second-line anti-TB drugs.” Agora often uses made-up names for commonly known conditions or “cures” to make it harder for potential buyers of supplements or ebooks to research them on their own.", "“Mexican blood flu” is another made-up name, and it’s also a poorly chosen one from a truth standpoint. The McAllen, Texas, incident referenced in the Institute for Natural Healing's advertisement took place in 2013 and concerned a Nepalese man who had traveled through South Asia, Brazil, and Mexico before crossing illegally into Texas, as reported by the Wall Street Journal:", "In medical isolation in South Texas, 100 miles or so from Mexico's border, is a man who embodies one of U.S. health officials' greatest worries: He is the first person to cross and be held in detention while infected with one of the most severe types of drug-resistant tuberculosis known today ...", "The Nepalese man detained at the U.S. border carries a particularly deadly strain—XDR, \"extensively drug-resistant\" TB. His TB is resistant to at least eight of the 15 or so standard drugs, according to a U.S. government description of the case reviewed by the Journal. His XDR strain has been seen only once before in the U.S., in another patient of Nepalese origin, according to the government description.", "The assertion that “a U.S. outbreak has already begun” is similarly incorrect: following the McCarren incident, the United States reported zero XDR-TB cases in 2014 and 2015. In 2016, one case was reported in the entire United States. In 2017, the most recent year for which CDC data is available, two cases were reported. According to CDC data, “the percentage of TB cases that are drug resistant has remained stable for the last 20 years.”", "The topic of multiple drug-resistant TB (not XDR-TB) at the Southern border was briefly revived in statements made by U.S. Rep. John Joyce, who in April 2019 participated in a “fact-finding” mission to the U.S.-Mexico border in Yuma, Arizona. During that trip, according to reporting by the Associated Press, Joyce said “that there are 12 cases of multiple-drug-resistant strains of tuberculosis” that had been identified in immigrants held in detention in Yuma, Arizona.", "Yuma, Arizona officials later stated that this information was incorrect, although the person who made the claim to the politician stood by it, according to the Arizona Republic:", "After a question from The Arizona Republic about a tuberculosis outbreak, Yuma County officials sought to set the record straight.", "\"I can say, after confirming with the Yuma County Health District, there is no drug-resistant tuberculosis in Yuma County,\" said Kevin Tunell, a spokesman for the county. \"Further, there are no cases of tuberculosis involving migrants in Yuma County at this time.", "All told, there is no basis for the claim that an XDR-TB outbreak is present at the Southern border. Belief in such a claim would require taking the word of a company that once sold a $74 eBook created to teach readers how to find an “incredible cure for cancer hidden in the Book of Matthew,” over the reports of health officials on the ground and health monitoring agencies such as the Centers for Disease Control and Prevention. As such, we rank the claim false.", "inhresearch.com.   “Mexican ‘Doomsday’ Virus Crosses U.S. Border.\"\r\n    Archived on 16 May 2019.", "Sourcewatch.   “Institute for Natural Healing.\"\r\n    Accessed 17 May 2019.", "Murphy, Tim.   “How This Company -- And Mike Huckabee -- Cashed in by Scaring Conservatives.”\r\n    Mother Jones.   November 2015.", "Centers for Disease Control and Prevention.   “Trends in Tuberculosis, 2017.\"\r\n    Archived on 16 May 2019.", "McKay, Betsy.   “Dangerous TB Patient Detained on U.S. Border.”\r\n    The Wall Street Journal.   1 March 2013.", "Centers for Disease Control and Prevention.   “Trends in Tuberculosis, 2016.\"\r\n    Archived on 14 October 2018.", "Hansen, Ronald J.   “While Republicans Visited Yuma, A Bogus Tuberculosis Scare on the Border.”\r\n    The Arizona Republic.   23 April 2019.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]