["By Robert Farley", "Posted on April 22, 2020", "We could find no evidence to support President Donald Trump’s claim that Italy was “hit hard” by the coronavirus pandemic because “a lot of the people that didn’t come in here went to Italy” when the U.S. imposed travel restrictions on China.", "In fact, Italy cut off air travel to and from China two days before the U.S. enacted its travel restrictions.", "Trump’s claim came at the end of his daily coronavirus press conference on April 19, when he was asked about countries that did not respond appropriately and were subsequently hit hard by the coronavirus pandemic.", "Trump, April 19: When I closed up our border, when I did the ban on China, they say a lot of the people that didn’t come in here went to Italy. You’ve heard that. That’s why Italy was hit so hard.", "I don’t think it was because of government. I will say Italy is locked down probably more than any other country right now. It’s just absolutely locked solid down. But they got hit very hard because people that were coming to the United States couldn’t come, because I closed the country in January, and they went to Italy. They say it had to do with trade. It had to do with the purchase of certain materials, and Italy was another alternative. And so many, many people went to Italy instead of coming here. And Italy has suffered greatly.", "It is a perplexing claim because, as we have reported before, Italy stopped all flights to and from China on Jan. 31. Although the White House announced its travel restrictions on China the same day, they did not go into effect until Feb. 2.", "Trump was wrong to say he “closed the country in January.” As we have written, the policy prohibits non-U.S. citizens who have traveled to China within the previous two weeks from entering the U.S. There were exceptions to that halt on travel, including for Americans and their family members.", "According to a New York Times report on April 4, nearly 40,000 people had arrived in the U.S. on direct flights from China since Trump imposed his travel restrictions. Moreover, the Times found, “screening procedures have been uneven” for those arriving on flights from China.", "By contrast, Italy’s policy banned all flights between the countries, and unlike the U.S. policy, it did not carve out exceptions for Hong Kong, Macau and Taiwan.", "We reached out to the White House for clarification or evidence to back up the president’s claim, but we got no response.", "“I honestly cannot make heads or tails of what the President is claiming here,” Ron Klain, who served as the Obama administration’s Ebola response coordinator, told us via email. Klain once served as former Vice President Joe Biden’s chief of staff and is now an adviser to the Biden campaign. “It really makes no sense at all. The facts are, as you know, that Italy did restrict travel from China before the U.S. did, so his first assertion is based on a lie. And the second thing is, if people really were going to Italy in late Jan/Feb, why did the President wait until March … to impose a limit on travel from Italy to the U.S.?”", "Italy was hit early and particularly hard by the coronavirus pandemic. In mid-March, Italy had the highest number of confirmed cases and deaths outside China, and far more than any other country in Europe (and vastly higher than the number of cases and deaths in the U.S. at that time). Since then, the U.S. has far surpassed the number of confirmed cases and deaths in Italy, though the number of per capita deaths in Italy remains among the highest in the world — and higher than in the U.S.", "But the timeline of reported cases and responses by Italy and the U.S. does not support Trump’s claim that Italy “got hit very hard because people that were coming to the United States couldn’t come, because I closed the country in January, and they went to Italy.”", "The first two cases of COVID-19, the disease caused by the coronavirus, were disclosed on Jan. 30, when the government reported that two Chinese tourists who had arrived in Milan on Jan. 23 had been hospitalized. A day later, Italy immediately banned all air travel between Italy and China, without exceptions. (By contrast, Trump announced his travel restrictions on China 10 days after the Centers for Disease Control and Prevention announced the first travel-related case of COVID-19 in the U.S.) A cluster of cases emerged in early March in northern Italy, triggering tight quarantine restrictions in 15 northern and central provinces. The restrictions were quickly expanded nationwide.", "It is possible that people came into Italy from China via indirect routes, but it seems unlikely that would have included Chinese tourists barred from entering the U.S. As the Washington Post noted, China canceled all domestic and international tour groups on Jan. 26, although those already underway were permitted to continue to their completion. That predates the U.S. travel restrictions.", "Trump said, “They say it had to do with trade. It had to do with the purchase of certain materials, and Italy was another alternative.” But the U.S. travel restrictions did not impact cargo shipments between the countries (either by air or sea), according to a Department of Homeland Security fact sheet on the travel restrictions.", "We couldn’t find any news reports about U.S. travel restrictions on China contributing to an influx of people to Italy, and worsening its coronavirus situation. Rather, experts have cited a number of reasons why the coronavirus resulted in an explosion of deaths in Italy, including the country’s relatively aged population, the density of the population, ineffective public health intervention in some areas of the country, and a shortage of intensive care hospital beds.", "In an article published in the Journal of Global Health, Igor Rudan, a researcher at the University of Edinburgh, wrote that “it is possible that Chinese tourists from Wuhan were visiting Northern Italy in January and February 2020” and that infected tourists who were asymptomatic were allowed to enter the country even with proper checks.", "Rudan also noted that “[s]ome investigative journalists hypothesized, although this has not been confirmed, that it may be possible that the phenomenon of the mass immigration of Chinese workers to northern Italy [mainly for work in the textile and fashion industries] may have contributed to the early introduction and spread of the virus. … Whether through Chinese tourists, textile workers, or through some other route, the novel coronavirus has triggered an epidemic behind the back of the Italian ‘first line of defence’ which remained unrecognized in the first few weeks.”", "Former House Speaker Newt Gingrich, who is currently in Italy with his wife, backed that theory, telling Fox News that the direct flights between Wuhan and Milan may have triggered the coronavirus outbreak in Italy.", "“None of us, at least I didn’t know that there were 100,000 Chinese [people] living in northern Italy and that many of them come from Wuhan and that there was a flight between Milan and Wuhan,” Gingrich said. “We think that’s how the virus got Italy early. Initially, the government didn’t realize how dangerous it was going to be. It dealt with it initially as sort of a small town, local regional problem, and then boom, it exploded.”", "Even if that were the case, that mass migration from China to Italy predated the U.S. travel restrictions. And it is unclear why or how, as Trump alleged, “many, many people went to Italy instead of coming here” after the U.S. imposed travel restrictions on China. As we explained, Italy had already banned all flights from China before the U.S. implemented restrictions. We will update this story if further information emerges.", "Editor’s Note: FactCheck.org does not accept advertising. We rely on grants and individual donations from people like you. Please consider a donation. Credit card donations may be made through our “Donate” page. If you prefer to give by check, send to: FactCheck.org, Annenberg Public Policy Center, 202 S. 36th St., Philadelphia, PA 19104.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]