["About this rating", "Bill O'Reilly held an oline survey for his television viewers on 11 October 2016, asking them to predict the outcome of the presidential election", "The survey was open to anyone, held online, and was not a telephone poll of 25,000 voters conducted by college students.", "On 11 October 2016, Fox News host Bill O'Reilly announced on his show that his website had posted a survey asking his viewers, \"If the presidential election were held this week, who would win?\"", "The poll question (which didn't ask respondents to indicate whom they were voting for, but merely who they thought would win) was also displayed on-screen:", "Three days later, the survey — not surprisingly, given the nature of O'Reilly's audience and the laxity of online surveys — ended with 84% of their 29,799 respondents predicting that Republican nominee Donald Trump would win the election:", "The tweet reproduced above misrepresented the nature of that survey, however, claiming that O'Reilly employed college graduate students to \"call 250 people from each party's voting rolls in all 50 states.\" The image has since been cited  by conservative websites as proof that Trump is \"far ahead\" of Clinton in the president race.", "Another similar version of a fake poll from a clickbait web site put the number of people surveyed at 700,000 and attributed it to different conservative source, One America News Network:", "However, this version was based on no actual survey at all; it was simply a digitally altered version of a graphic used during a 11 May 2016 report about \"a nearly neck-and-neck race brewing\" between the two candidates\":", "The claim regarding the O'Reilly \"poll\" was also similar to another post allegedly conducted by \"graduate students\" calling 1,000 homes in each state:", "Economy was the number one factor that Americans are concerned about and terrorism was number two.", "Presidential pick was Trump by a large percentage.", "Trump 33478 votes 67%", "Clinton 9788 Votes 19%", "Undecided or other 6739 votes 13%", "My friends and I are all Graduate students from all walks of life we meet to discuss stuff. 13 people who like and have served in the Military. It took us most of two weeks to be sure our calls were to all people and not just one party or an other we called Americans.. our poll is by taking registered voter lists and we accumulated 33% repub, 33% dems and 34% ind.. our poll consisted of 1000 calls per state. all 50 states. 50,000 people are in this poll not the 100 like other polls.", "Several sites referencing the post attributed it to PG Farnsworth, a Georgia-based minister who posted  it on his Facebook page on 6 August 2016.", "We reached out to Farnsworth for comment, and also to Fox News regarding the image touting the \"grad student\" survey attributed to O'Reilly.", "Arturo Garcia is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]