["By Angelo Fichera", "Posted on September 26, 2018", "Q: Did Alexandria Ocasio-Cortez say “we’ll never have to worry about China attacking us” because of the country’s time difference?", "A: No. There is no evidence she made the statement used in a viral meme.", "A meme that has gained momentum through thousands of shares on Facebook uses a false quote to take aim at Alexandria Ocasio-Cortez.", "“We’ll never have to worry about China attacking us!” the meme reads. “They are 12 hours ahead, so we’ll have plenty of time to shoot down their missiles!”", "The Democratic nominee for New York’s 14th Congressional District seat, who gained prominence after her primary victory over a 10-term incumbent, never made that illogical comment.", "Corbin Trent, a spokesman for her campaign, told us “the entire quote was fabricated.”", "“She’s never even discussed Chinese missiles. Period,” Trent said. “Her foreign policy topics have been about peace not war.”", "While Ocasio-Cortez has been criticized for some remarks relating to foreign policy, we could find no evidence of her making any comments similar to the alleged quote. Instead, we found that the meme in question gained popularity when it was posted Sept. 4 on the Facebook page of America’s Last Line of Defense. That online publication uses numerous websites and its Facebook page to publish content that it deems satire, but that is routinely mistaken for valid news.", "Its Facebook post did not explicitly identify the meme as satire, though its page’s “About” section has a disclaimer that notes: “Nothing on this page is real. It is a collection of the satirical whimsies of liberal trolls masquerading as conservatives. You have been warned.”", "The meme was also published by others across social media in recent weeks, including on the Facebook page of James Harris, a conservative radio host with hundreds of thousands of followers on the platform.", "Harris posted a version of the meme Sept. 21 with additional text that doubles down on the deception, which was also popular on other conservative pages. The add-on reads: “Did she REALLY say that? Yep, you’re looking at the future of the Democrat party…”", "Some users interacted with the post as if the quote was real, leaving comments questioning her intelligence. “How did she get out of the 6th grade?” one person asked.", "Others suspected it couldn’t be real and asked for proof of its veracity. “I love ya–but can you please give a source? I can’t find one, & I won’t share until I verify it,” another user wrote.", "Many others did not wait for verification. Almost 30,000 Facebook users shared the meme.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on the social media network.", "“About.” Trumpbetrayed.us. Accessed 24 Sep 2018.", "Trent, Corbin, spokesman for Alexandria Ocasio-Cortez 2018 campaign. Phone interview with FactCheck.org. 24 Sep 2018.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]