["“53 Johannes Ramokhoase street Pretoria & i Growth wealth investments podium @menlyn, 43 ingersol road, ground floor lynwood glen , Pretoria 0081. Those areas are Human trafficking hotspot. Make everyone else aware (sic),” reads a Facebook post shared more than 6,000 times since it was published on September 6, 2020.", "Similar posts include an elaborate story about an individual who goes to one of the locations for a purported job interview but ends up escaping an attempted kidnapping, as seen here and here on Facebook.", "Other posts feature images of this building from Google Street View.", "However, the South African Police Services (SAPS) rejected claims that it is a site for human trafficking.", "“A series of social media posts depicting a building in Pretoria being used as a centre for human trafficking is fake news,” the police said in a statement.", "“The building, which is on Johannes Ramokhoase Street, Pretoria CBD is in fact a residential building accommodating policemen and women. Therefore, the posts suggesting that this building is being used for criminal activities is misleading and untrue.”", "The second address -- 43 Ingersol Road -- cited in some of the claims is in fact a property investment firm called iGrow Wealth Investments.", "Contacted by AFP Fact Check, police spokesman Brigadier Vish Naidoo said there have been no reports of human trafficking or abductions in the vicinity of the two buildings.", "“There have been no such reports at both those buildings. Both are legitimate places,” he said.", "Lezelle Kirsten, a spokeswoman for iGrow, said the company has no affiliation with the police residence at 53 Johannes Ramokhoase Street, nor had they invited people there for job interviews.", "“We were made aware that our company name (name only) has been used to invite people for interviews,” said Kirsten, who is iGrow’s project coordinator for new developments.", "“About a week ago someone sent us an inbox message on Facebook asking us about it, but that is the extent of our information.”", "Kirsten added the company was also aware that its offices had been linked to false claims of human trafficking.", "“However, we are unfortunately also a victim in this matter as it puts our company in a very bad light. It has been reported to the local authorities. It is unfortunate, but beyond our control that victims do not do their due diligence on the companies where they apply for positions.”", "The attempted kidnapping of a child from a restaurant in South Africa on September 10, 2020, has amplified multiple social media posts about child sex trafficking.", "This prompted a statement from police on September 15, 2020, wherein they reiterated their commitment to ensuring that such cases are investigated.", "#sapsHQ #SAPS views all allegations of #HumanTrafficking very seriously. The seriousness at which these crimes are being attended to is also highlighted by the fact that they are either investigated by specialsed units like the #Hawks or #sapsFCS Units MEhttps://t.co/m9BKmbH09w pic.twitter.com/ECcaLmSDLV", "Police Minister Bheki Cele followed up with an appeal to the public to desist from spreading false claims about kidnapping and human trafficking in a press briefing on September 22, 2020.", "“Many people came and gave the addresses of the places where they say this is happening. Those have been checked, one place that was checked, having [been described as] a centre for human trafficking, was found to be the police barracks, police live there. The other one was found to be a financial institution,” Cele said.", "“It tells you that there are opportunists that will always be there to make sure that they exploit the genuine fears of the public that is there. There is a genuine problem, genuine fear but there are further opportunists that exploit that matter.”", "According to the US 2020 Trafficking in Persons Report, South Africa’s government “does not fully meet the minimum standards for the elimination of trafficking but is making significant efforts to do so”.", "“The government demonstrated overall increasing efforts compared to the previous reporting period.”", "The report says these efforts included increased investigations, prosecutions and convictions of traffickers, as well as within organised criminal syndicates that facilitated the crimes.", "However, a 2018 article by the Institute for Security Studies had described people trafficking in South Africa as “an ‘elusive statistical nightmare’”.", "This sentiment is echoed in a 2020 report, Child Trafficking in South Africa: Exploring the Myths and Realities, which warns that “in South Africa, child trafficking has become a central concern for both the state and non-state agencies”.", "“Although it is claimed that child trafficking is widespread, currently very little reliable data exists to determine the nature and scope of the problem in the country.”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]