["By Lori Robertson", "Posted on May 24, 2018", "President Donald Trump’s use of the word “animals” in what he says was a reference to MS-13 gang members has resulted in a spat between the president and House Minority Leader Nancy Pelosi:", "Trump made his original “animals” comment during a May 16 roundtable discussion at the White House with California political and law enforcement leaders. The discussion began shortly after 3 p.m., according to the White House transcript. Trump started off the event by claiming the state’s so-called “sanctuary” policy, limiting state and local law enforcement’s communications with federal immigration authorities, “provides safe harbor to some of the most vicious and violent offenders on Earth, like MS-13 gang members putting innocent men, women, and children at the mercy of these sadistic criminals.”", "Much later on during the event, Fresno County Sheriff Margaret Mims talked about issues involving the communication between those working in local jails and Immigration and Customs Enforcement officers. Mims mentioned MS-13, and Trump responded with comments on “people coming into the country,” without mentioning the gang:", "Sheriff Mims, May 16: Thank you. There could be an MS-13 gang member I know about — if they don’t reach a certain threshold, I cannot tell ICE about them.", "Trump: We have people coming into the country, or trying to come in — and we’re stopping a lot of them — but we’re taking people out of the country. You wouldn’t believe how bad these people are. These aren’t people. These are animals. And we’re taking them out of the country at a level and at a rate that’s never happened before. And because of the weak laws, they come in fast, we get them, we release them, we get them again, we bring them out. It’s crazy.", "Some news coverage of the event said Trump referred to some immigrants as “animals.” Other reports said his remarks were about immigrant gang members.", "The following morning, on May 17, Pelosi commented on the president’s remarks during her weekly press conference. She criticized Trump for saying “undocumented immigrants” were “animals.”", "Pelosi, May 17: We believe some of us who are attracted to the political arena and to government and public service that we’re all God’s children. There’s a spark of divinity in every person on Earth and that we all have to recognize that as we respect the dignity and worth of every person. … And so when the president of the United States says about undocumented immigrants, ‘these aren’t people, these are animals,’ you have to wonder, does he not believe in the spark of divinity? The dignity and worth of every person? ‘These are not people, these are animals,’ the president of the United States. … Calling people ‘animals’ is not a good thing.", "Later that day, White House Press Secretary Sarah Sanders was asked what the president meant by the remark, and she said he “was very clearly referring to MS-13 gang members.” Later that same day, Trump, too, was asked to clarify his remarks, and he said: “But I’m referring, and you know I’m referring, to the MS-13 gangs that are coming in.”", "We can’t say what Trump meant when he made his remarks, but there is a history of Trump referring to MS-13 gang members as “animals.” Given that, and the larger context of the conversation about people who are in jails and in the country illegally, it’s certainly plausible that he was referring to the gang members.", "At a July 25, 2017, rally in Ohio, Trump called MS-13 gang members “animals” who “slice and dice” young girls because they want their victims “to go through excruciating pain.” Three days later in New York, Trump retold the story of gang members using knives instead of guns because “it’s more painful, and they enjoy watching that much more. These are animals.”", "Trump now has been putting his spin on Pelosi’s remarks.", "At a May 22 gala event for the Susan B. Anthony List, an anti-abortion rights group, Trump claimed: “And the other day — just the other day — Nancy Pelosi came out in favor of MS-13. That’s the first time I’ve heard that. She wants them to be treated with respect, as do other Democrats. That’s not going to be happening. We’re not going to release violent criminals into our country.”", "But Pelosi did not come “out in favor of MS-13.” She didn’t mention the gang or gang members at all.", "He also falsely implies that Democrats — by treating criminals with respect — would “release violent criminals into our country.” He went even further on May 23, when he said in an interview on Fox News: “You heard Nancy Pelosi the other day, like, trying to find all sorts of reasons why they should be able to stay.” Pelosi did not say violent gang members in the U.S. illegally “should be able to stay.”", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]