["By Angelo Fichera", "Posted on December 4, 2020 | Updated on August 1, 2023", "The Trump campaign is falsely claiming that surveillance camera footage captured election workers in Georgia adding thousands of illegal ballots that were brought into an Atlanta facility in suspicious “suitcases” on election night.", "The campaign presented the video to Georgia state lawmakers on Dec. 3. President Donald Trump’s lawyer, Rudy Giuliani, wrote on Twitter the same day: “The video tape doesn’t lie. Fulton County Democrats stole the election. It’s now beyond doubt.” Trump himself later amplified the claim at a rally in Georgia on Dec. 5.", "But state officials told us that the full video shows the supposed “suitcases” were actually standard containers used to secure ballots, and that the ballots in question were opened and prepared for counting earlier in the night in full view of observers. They said the campaign presented limited, selective parts of the footage.", "That’s based on their review of the day’s video footage in full. Also, even though observers from the parties and press left the room before vote counting resumed, officials said, a state election board monitor and investigator from the secretary of state’s office both returned to watch the counting until its completion.", "Left unclear, though, are the exact facts surrounding a purported “announcement” to workers in the room that Republican observers claim prompted them to leave, as we’ll explain.", "The video in question — which has been widely shared across social media — was presented to Georgia state legislators during the Dec. 3 hearing by a lawyer named Jacki Pick, who said she was volunteering for Trump’s legal team. Pick is listed as a lawyer by the State Bar of Texas, but she appears to work primarily as a conservative podcast host. She and her husband, Doug Deason, are major Republican donors.", "Pick said Trump’s legal team received the video the night before and that it shows observers and the press leaving a room at Atlanta’s State Farm Arena, which was used to count absentee and military ballots, shortly before 11 p.m. She claimed that, according to witnesses, a woman had told the observers and press that “we’re going to stop counting, everyone go home.”", "She pointed out that many of the elections workers had left for the night in the video, but four workers are seen in the video staying behind to continue counting.", "“Once everyone is gone, coast is clear, they are going to pull ballots out from underneath a table – watch this table,” she said at the hearing. “I saw four suitcases come out from underneath the table.” The video shows the counting continued until nearly 1 a.m., she said.", "But the supposed “suitcases” were typical ballot containers used to secure ballots, Georgia’s Deputy Secretary of State Jordan Fuchs told us in a phone interview. Likewise, Matthew Mashburn, the state Senate’s appointee to the state election board, told us the video showed “standard secure containers that are ubiquitous in tabulation in Georgia.”", "And Gabriel Sterling, the state’s voting system implementation manager, said that the full video showed that the containers were carrying ballots that were opened and processed earlier in the night. They weren’t suspicious ballots brought surreptitiously into the building, or ballots that were opened in secret.", "“They were put in there about an hour earlier,” Sterling, a Republican, said by phone. He said of the Trump campaign: “They watched the same video tape.”", "Sterling also said he saw no anomalies in the vote data that suggested any kind of mass voter fraud, as has been alleged. “These are just regular elections workers” doing their job, he said.", "While state law allows for observers to watch the vote counting, Sterling said, it was not illegal for the vote counting to resume when the observers left. He said his office was working on making the video footage from the arena public so that voters could see the footage with more context.", "What is clear from our interviews with state officials is that, at some point, the elections workers did evidently plan to stop counting votes.", "Fulton County Elections Director Rick Barron also made that clear during a special, virtual public meeting on Dec. 4. He said that “certain staff that were on the cutting stations, that were on the flattening stations, that were extracting from the inner envelopes, those staff left as work completed.”", "“I found out sometime, I think a little after 10:30 [p.m.], that they were gonna cease operations and I told them not to do that,” he said. He added that at “about 11:15 [p.m.], they were fully scanning again.”", "Pick claimed that witnesses said that a woman came “out to announce, ‘we’re going to stop counting, everyone go home,'” saying the Republican observers were “forced to leave.” But Barron said that “no announcement was ever made to leave, for anyone to leave.”", "Affidavits from two Republican field organizers referenced by Pick do not claim that they or the media were ever directly told or forced to leave. Instead, the observers say that they left after a woman — who they believed was a supervisor — “yelled” to workers in the room to cease operations and return the next day. The affidavits say that much of the room, except for a few employees, had cleared out.", "“We have launched an investigation into why the monitors from the political parties left before scanning ended,” the secretary of state’s office said in a statement. “While it was their right to leave early, we want to make certain they were not misled into thinking scanning had stopped for the night when it had not. Nothing we have learned from the independent monitor or our investigation have suggested any improper ballots were scanned.”", "Sterling said in our Dec. 4 interview with him that it did not appear there was any official announcement made to the observers or press, but there’s no audio to prove that one way or another.", "On Dec. 5, Frances Watson, the chief investigator for the secretary of state’s office, said in an affidavit that after reviewing the video and conducting interviews, her investigators found “that observers and media were not asked to leave” but “simply left” after they saw workers, whose job was to open the ballots, leave. She said the investigation remains open.", "Also, there’s no evidence that a “water main break” inside the arena earlier that day had anything to do with the observers and press leaving, as some have claimed.", "One of Trump’s sons, Eric Trump, wrote  on Facebook that “Republican observers were cleared out of State Farm Arena due to a ‘water main break’, but 4 people stayed behind, rolled out suitcases of ballots, & continue to count ballots in private from around 1030PM until 1AM.”", "But the water leak occurred at 6:07 a.m. on Election Day, according to the arena, and it was fixed within two hours — meaning it occurred long before the episode in question.", "During the legislative hearing, Pick maintained that the votes counted in the room after observers left could have been enough to change the presidential election results in Georgia.", "Pick theorized that the machines in the room could have totaled “18,000 ballots.” (Biden won the state by less than 12,000 votes.)", "But that’s wrong, according to the state election board monitor who was in the room as they counted.", "The monitor — who agreed to be interviewed on the condition of not being named due to death threats faced by election workers — told us he was in the room until about 8:15 p.m., when he left, and returned at 11:52 p.m.", "Fuchs, the deputy secretary of state, told us the monitor was not required to be there at all times, but she instructed him to return after hearing from news outlets that the county was going to cease counting for the night.", "The monitor arrived at 11:52 p.m. — after the observers left shortly before 11 p.m. — and stayed until the counting ceased at 12:43 a.m.", "Between 8:15 p.m. and 12:43 a.m., the change in total ballots went from 89,381 ballots to 99,133 ballots — so a difference of 9,752 votes — he said. And, again, that’s over the course of more than four hours, not just the time after observers and media left.", "The footage is not the first to spark claims of fraud in Georgia. We also wrote about a video showing an election worker conducting an ordinary part of the recount process in Gwinnett County that prompted false claims. The videos have been part of a surge of falsehoods aimed at undermining the results of the 2020 election, as we’ve reported.", "Saranac Hale Spencer contributed to this report.", "Update, Dec. 7: We made updates to this story to reflect new information — including the affidavits from the Republican field organizers and statements from the chief investigator for the secretary of state’s office — pertaining to why the observers and media left the room in State Farm Arena.", "Update, Aug. 1, 2023: On June 20, the Georgia secretary of state’s office released an investigative report concluding that there was “no evidence” of any fraud regarding the claim that “suitcases” of illegal ballots were counted on election night. Investigators from the FBI, Georgia Bureau of Investigation and the secretary of state’s office interviewed Fulton County election workers and reviewed “the entire unedited security video footage of the events in question” in response to a complaint referred by a state senator and specifically naming two election night workers in the video, Ruby Freeman and her daughter, Wandrea “Shaye” Moss.", "“There was no evidence of any type of fraud as alleged. … All allegations made against Freeman and Moss were unsubstantiated and found to have no merit,” the report, dated March 7, concluded.", "In congressional testimony, the two women described how they had been harassed and received death threats after members of the Trump campaign and others pushed false claims that they had engaged in voter fraud. Freeman and Moss filed a defamation suit against One America News Network and Trump lawyer Rudy Giuliani.", "OANN settled the suit in May. A July 25 court filing by Giuliani said he “does not contest” that statements he made about the women were false, but he argues the statements were “constitutionally protected” speech. A political adviser to Giuliani told news organizations that Giuliani “did not acknowledge that the statements were false but did not contest it in order to move on to the portion of the case that will permit a motion to dismiss.”", "Editor’s note: FactCheck.org does not accept advertising. We rely on grants and individual donations from people like you. Please consider a donation. Credit card donations may be made through our “Donate” page. If you prefer to give by check, send to: FactCheck.org, Annenberg Public Policy Center, 202 S. 36th St., Philadelphia, PA 19104.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here for more.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]