["California Gov. Gavin Newsom discusses his revised 2020-2021 state budget during a news conference in Sacramento, Calif., Thursday, May 14, 2020. (AP)", "States commonly take on debt to pay for construction and environmental projects.", "Debt is not the same as a budget shortfall. All four states have debt.", "The amount of state budget shortfalls due to the pandemic is a moving target.", "States can have debt and a balanced budget.", "The COVID-19 pandemic has put a massive strain on state budgets but some social media users have pointed the finger at Democrat-led states.", "A Facebook post lists metrics for the four most populous states including their budgets. It states that Texas and Florida have \"balanced\" budgets while California is \"in debt $54 billion and New York is \"in debt $6.1 billion.\" While this post didn’t comment on the party affiliations of the governors, similar posts point out that the governors of Florida and Texas are Republicans while the governors of New York and California are Democrats.", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The post is misleading in multiple ways. It fails to explain some basics about state budgets.", "First, it’s common for states to borrow money to construct state buildings, roads or environmental restoration. You can have debt and a balanced budget. And all of these states must pass a balanced budget.", "Second, the post describes certain dollar amounts as \"debt\" when they were actually shortfalls. All four states, in fact, carry billions of dollars in debt.", "Shortfalls occur when revenue collections come in lower than expected and/or expenditures can come in higher than forecasted, said Brian Sigritz, the Director of State Fiscal Studies at the National Association of State Budget Officers. Comparing different states’ budget gaps is difficult, because they tend to change month-to-month and states release revenue forecasts at different times.", "Amid COVID-19, Sigritz warned that \"some states may not have announced a budget gap figure yet, but will likely face a shortfall.\"", "\"Debt\" in the context of a state budget refers to the cumulative total of all past deficits, less surpluses. A projected shortfall or budget gap is the amount that state officials have to address in order to balance a state budget.", "RELATED: New York pension fund does not need a federal bailout", "Florida’s total state direct debt outstanding as of June 30, 2019, was $20.6 billion.", "\"As for the impact of COVID-19, there is little official revenue data or estimates yet, although we know it will be big,\" said Kurt Wenner, vice president of research at Florida TaxWatch, a key budget watchdog organization.", "April experienced an overall combined revenue loss of $878.1 million, the state estimated.", "Wenner said that most officials believe there is enough in reserves and federal aid to avoid a deficit in this budget year.", "\"After the governor signs the new budget (and presumably vetoes a lot) and more revenue data comes in, we'll have a better idea of what the next fiscal year looks like,\" Wenner said.", "Texas passes a budget every two years and the current budget year ends on Aug. 31, 2021.", "The state hasn’t revised the budget but Comptroller Glenn Hegar has said the economy is in a recession and announced that state sales tax revenues from April 2019 compared to April 2020 saw the steepest decline since January 2010.", "Texas Gov. Greg Abbott requested state agencies and universities submit a plan by June 15 that uses savings to reduce their use of revenue by 5%.", "The Texas Tribune reported that the budget will be \"billions of dollars out of balance.\"", "The most recent calculations show Texas had a total of $59.9 billion in state debt by August 31, 2019.", "News articles at the end of 2019 stated that New York faced a $6.1 billion budget gap —-- before the pandemic hit. (The Citizens Budget Commission said the amount was $7 billion.)", "In April, the state Assembly passed a $177 billion budget by borrowing, relying on federal aid and deferring some decisions. The budget for the 2020-2021 year started in April.", "The economic downturn has worsened the state’s finances. Before the pandemic, the state was expecting a 7% increase in revenue, but now it is expecting a 14% decline in revenue. A state estimate on April 25 puts revenue losses at $13.3 billion this year and $61 billion over the next four years.", "Outstanding debt at the end of fiscal year 2020, which closed on March 31, was $54.4 billion. The state issues debt for capital purposes such as road and bridge construction, environmental conservation, and facility construction.", "California’s debt was reported to be $129 billion as of May 1, 2020. In the 2020-21 budget Newsom proposed in January, the state of California planned to pay part of this debt and had a projected $5.6 billion budget surplus for the 2020-21 fiscal year.", "This was before COVID-19 shut down businesses and led to high unemployment in California. In May, Politico reported new forecasts of a 25% plunge in \"the state's big three tax sources — personal income, sales and corporations\" would lead to a $54.3 billion deficit.", "Newsom released revisions to the budget on May 14 which are supposed to balance the budget for the next year. But there is a projected deficit in future years, culminating in $16 billion dollars by 2023-24.", "A Facebook post said Texas and Florida have a \"balanced budget\" while California is \"in debt $54 billion\" and New York is \"in debt $6.1 billion.\"", "This post misleads readers in multiple ways. First, it is possible to have debt and a balanced budget. Second, the post mixes up debt with budget shortfalls. All four states carry billions in debt. Third, it’s difficult to compare the current financial status of four different states because they have different budget cycles and the impact of the pandemic remains a moving economic target.", "While Florida and Texas have passed balance budgets, they too are certain to face economic woes related to the pandemic.", "In early May, California officials projected a $54 billion shortfall, but a new budget proposal lays out a plan to balance the budget, although it still leaves a projected future deficit.", "The $6.1 billion figure for New York stems from projections late last year about a shortfall, and ignores that the state has since passed a balanced budget.", "This statement rates False.", "Facebook post, May 18, 2020", "Center for Public Policy Priorities, Texas Biennial Budget Cycle, accessed on May 21, 2020", "The Texas Tribune, Texas sales tax revenues fall by 9.3% in April, May 1, 2020", "Texas Comptroller of Public Accounts, State Sales Tax Revenue Totaled $2.6 Billion in April, May 1, 2020", "The State of Texas, Agency Heads Letter, May 20, 2020", "The Dallas Morning News, Brace for the next coronavirus impact: destruction of state, city budgets, April 27, 2020", "The Texas Tribune, Texas Gov. Greg Abbott instructs state agencies to trim budgets by 5% to prepare for \"economic shock\", May 20, 2020", "Texas Bond Review Board, State of Texas Debt, accessed on May 26, 2020", "State of California, 2020-21 Governor's Budget, Jan. 10, 2020", "Next 10, Budget Basics, accessed on May 21, 2020", "State of California, Governor’s Budget Summary 2020-21, May 14, 2020", "Politico, California faces $54B budget deficit, May 7, 2020", "National Conference of State Legislatures, State Constitutional And Statutory Requirements For Balanced Budgets, March 2004", "Florida Office of Economic and Demographic Research, Monthly revenue report for April 2020", "Email interview, Kurt Wenner, Florida TaxWatch vice president of research, May 21, 2020", "Email interview, Freeman Klopott, press officer for the state Division of the Budget, May 21, 2020", "Email interview, Brian Sigritz, Director of State Fiscal Studies at the National Association of State Budget Officers, May 21, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]