["Former Prime Minister Manmohan Singh has been bestowed with an award for being the strongest Prime Minister in the world, if social media is to be believed. The website Viral in India had published an article on June 16, 2018 which was titled “मोदी नहीं, मनमोहन सिंह को मिला सबसे शक्तिशाली पीएम का अवार्ड, पढ़िए खबर” (Not Modi, Manmohan Singh receives award for strongest PM in the world, read the report- translated). Viral in India is owned and managed by Abhishek Mishra, who claims to be a ‘News/Media personality’ and an ‘RTI activist’.", "The article says, “जापान जैसे समृद्ध देश ने उनके योगदान को देखते हुए अपने देश के सबसे बड़े पुरस्कार द ग्रैंड कॉर्डन ऑफ द ऑर्डर ऑफ पॉआलोनिया फ्लाअर्स से सम्मानित करने का फैसला किया.” (A prosperous country like Japan has acknowledged his contribution and honoured him with the biggest award, ‘The Grand Cordon of the Order of the Paulownia Flowers’- translated). Subsequently, a website called Desh Yug published the same report on July 4, 2018 and recently on July 29, 2018, a website Headline24 also published an article with a slightly different take, claiming Dr. Singh has been declared the most capable PM.", "Expectedly, this claim quickly found its way to Facebook where many individual users posted it on their timelines. Twitter wasn’t immune either- a Twitter handle @roflravish which claims to be a ‘parody fan’s club’ and has a massive following of over 172,000 posted a tweet with a link to the Headline24 article. It was also tweeted by Chandigarh Congress on July 29.", "मेरे बाद जमाना मुझे याद करेगा…https://t.co/LO95CrgwT8", "— Chandigarh Congress (@INCChandigarh) July 29, 2018", "The article by Viral in India mentions that Dr. Singh has been honoured with ‘The Grand Cordon of the Ordor of the Paulownia Flowers’, a rare civilian honour. This is among the highest awards conferred by the Government of Japan. It is indeed true that Japan has honoured Dr. Singh with this award. However, it must be noted that he had been awarded in 2014 and not at present, as claimed by these articles. This had been reported by the Indian media in 2014. According to an article by The Hindu, “A statement by the Japanese Embassy said Dr. Singh “will be bestowed [the honour] in recognition of his significant contributions to the enhancement of relations and the promotion of friendship between Japan and Indiafor about 35 years.” It had also been reported by TV news channels. It may be noted that there is no reference to ‘strongest’ or ‘most capable’ PM with respect to this order.", "In May 2018, Alt News had busted a claim floating on social media that Dr. Manmohan Singh has been declared the most honest political leader by the White House. In this instance, while the claim that Dr Singh has been bestowed with Japan’s civilian honour is not incorrect, it is an old event which is now being circulated as a recent development. The fact that this claim refers to how PM Modi has failed to make the cut suggests an organised political objective and campaign on the part of those who have circulated it.", "Donate Now", "Arjun Sidharth is a writer with Alt News. He has previously worked in the television news industry, where he managed news bulletins and breaking news scenarios, apart from scripting numerous prime time television stories. He has also been actively involved with various freelance projects. Sidharth has studied economics, political science, international relations and journalism. He has a keen interest in books, movies, music, sports, politics, foreign policy, history and economics. His hobbies include reading, watching movies and indoor gaming.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]