["A video of a man spitting in a jar with the label ‘Sweet Tea’ and placing it back on a supermarket rack is making the rounds across social media platforms.", "Sagar Kumar (@KumaarSaagar), who is associated with the propaganda outlet Sudarshan News, shared the video with a one-line caption. What he wrote in Hindi can be translated as, “The practice of ‘spitting’ has reached foreign lands.” (archive link)", "“थूकने” का सिलसिला विदेशी धरती तक पहुँच गया है। pic.twitter.com/NdaXw0olRy", "— Sagar Kumar “Sudarshan News” (@KumaarSaagar) June 14, 2023", "Another Handle, with the user name पुष्पेन्द्र कुलश्रेष्ठ (@shripushpendra1) shared the same video with the same caption. He also added, “Do join Hinduwadi YouTube channel and subscribe by clicking on the link from Bhagwa Kranti http://youtube.com/@BhagwaKranti.” (archive link)", "थूकने” का सिलसिला विदेशी धरती तक पहुँच गया है।", "हिन्दुवादी यूट्यूब चैनल से ज़रूर जुड़िये भगवा क्रांति से लिंक पर क्लिक करके subscribe ज़रूर करे https://t.co/aj4VUimBA7 pic.twitter.com/mmy8RR7Mwr", "— पुष्पेन्द्र कुलश्रेष्ठ (@shripushpendra1) June 14, 2023", "The readers must note that the line “थूकने” का सिलसिला विदेशी धरती तक पहुँच गया है” has a subtext. It alludes to the ‘thook jihad’ conspiracy theory propagated by a section of the Right Wing ecosystem. On several occasions in the past, false social media claims that some Muslim person/s has/have spat in some food or drink to contaminate it have gone viral. The related fact checks by Alt News can be read here. The narrative possibly reached its peak (or nadir) when it was claimed by some BJP leaders in February 2022 that actor Shah Rukh Khan had spat on Lata Mangeshkar’s mortal remains at the latter’s last rites. Khan was actually offering dua (prayer) by blowing into the air, which is a common practice among Muslims in the Indian subcontinent. This particular Alt News fact check can be read here.", "In November 2021, News18 senior editor Aman Chopra hosted a segment on his prime-time show ‘Desh Nahin Jhukne Denge’ titled ‘Khane mein thookna, jihad ya jahalat? (Spitting in food, jihad or barbarism?)’. Stringing together a number of videos and amplifying disinformation around them, he put forward the ‘thook jihad’ conspiracy theory. In January 2022, the News Broadcasting and Digital Standards Authority came down heavily on the channel and the anchor for ‘targeting of a particular community’ in a ‘completely unacceptable’ manner. It also asked the channel to take down the show within seven days.", "The same video was widely shared in 2020 with the claim that this was an attempt to spread the coronavirus. Below is a screenshot of a fact-check request on the official Alt News mobile application.", "The video was not limited to the Indian social media ecosystem but was circulating in other parts of the world as well.", "This is not normally what I’ll share on my page.😥but I am lost for words. I cried all night thinking of who will pick up that bottle. It baffled me to see that some people still don’t realise what the world is going through right now‼️.Please share‼️ this guy must be arrested 😥 pic.twitter.com/JyuUUtGJSL", "— nadia (@nadiaforjesus) March 30, 2020", "A keyword search – ‘man spits tea bottle’ – led to several reports from July 2019. According to ABC News, “A 15-year-old boy in Odessa, Texas, was arrested and charged after he was caught on supermarket surveillance footage spitting into an Arizona tea bottle then putting it back on the shelf.” The report added that the incident took place in the Albertsons supermarket.", "Indian media had also reported on the incident last year.", "As per international reports, this unhygienic phenomenon started with a minor girl in Texas who licked a tub of ice-cream in a supermarket and put it back in the store freezer. Several copycats followed, as per metro.co.uk.", "To sum up, a video of a teenager in Texas spitting in a jar and putting it back on the supermarket shelf has been was picked up by several users at the time of the coronavirus outbreak. The incident, unarguably unhygienic, was not related to the pandemic. The video is again viral now in June 2023 with a communal subtext.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A purported video of a Muslim man beating a temple priest with a bat is…", "A picture depicting the Pakistani flag apparently bigger in size and apparently placed higher than…", "Amid the ongoing war between Israel and Hamas, a video of a fleet of cars…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "A clip featuring Pakistan men’s Cricket team captain Babar Azam is viral on social media…"]