["The video was published here on Facebook on August 6, 2020. It has been viewed more than 6,000 times.", "The post's Hindi-language caption translates to English as: “Look at this incredible example of humanity. This video is from Pipleshwar Mahadev Temple of Mochhal (Sirohi), where these cheetahs sleep with the caretaker of the temple everyday, assuming him as one of their own. Courtesy: Facebook page, Voice of Rajasthan Police.”", "Pipleshwar Mahadev is a Hindu temple dedicated to Lord Shiva, the third god in the Hindu triumvirate. The temple is located in Mochhal, a village in the northern Indian state of Rajasthan.", "The video was also shared here, here, here and here on Facebook; and here, here, here and here on Twitter alongside a similar claim.", "The claim, however, is false.", "A keyword search on Google found a longer version of the video posted by Dolph C. Volker, an American animal rights activist, on his YouTube channel here on January 21, 2019.", "The footage in the misleading post corresponds with the YouTube video from the one-minute five-second mark.", "The lengthy caption of the YouTube video states in part: “These captive cheetahs were bred and born at cheetah breeding centers in South Africa; one at Cheetah Experience.  All are quite tame as they are groomed for the breeding program so when they have cubs, they can be monitored closely... I was granted special permission to spend my nights with the three because I had watched them grow up and built up a relationship with them during past volunteering.”", "Cheetah Experience is a “registered non-profit endangered species breeding centre in Bloemfontein, South Africa”, according to information on its website.", "Below are two sets of screenshot comparison of the video in the misleading Facebook post (L) and the YouTube video (R):", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]