["Indonesian elections are due to be held on April 17, 2019. Here is a recent AFP story about the polls.", "The posts, including this one published on March 7, 2019, and shared more than 300 times since, have a caption which translates as:", "\"Let's know him better. He's been showing his brilliance since he was a child. He finished his elementary education in just four years, graduated from junior high school in only one year and senior high school also in just one year.", "“He also studied at a university overseas, specifically in the United States, with a scholarship when he was 12 years old. Do you know who he is? Of course, he is PRABOWO.", "“The time has come for us to have a president as brilliant as HABIBIE is. We are approaching a NEW INDONESIA. So, on April 17, 2019, do not forget to vote for PRABOWO-SANDI to bring this country to VICTORIOUS INDONESIA.\"", "The posts – which appear elsewhere on Facebook for example here, here, and in this archived post, which was shared more than 500 times before being removed from the site – also feature an image of Subianto as a child with a shortened version of the caption.", "Below is a screenshot of one of the posts:", "Habibie refers to Bacharuddin Jusuf Habibie, an aerospace scientist who briefly served as Indonesia’s president in 1998-1999, while Sandi references Sandiaga Uno, Subianto’s vice-presidential running mate.", "The claims of academic accomplishments in the Facebook posts are false, according to Subianto’s own CV.", "A copy of his resume, signed by Subianto and dated August 8, 2018, appears here on the official website of Indonesia’s general election commission (KPU).", "The KPU site also carries the resumes of all the other presidential candidates, as can be seen here.", "The document shows that Subianto completed his elementary education in five years, attending two different schools – one in Singapore and another in Hong Kong.", "He finished junior high school in four years at two different schools, one in Malaysia and another in Switzerland. He completed senior high school in two years at the American School in London, according to the resume.", "Born in 1951, Subianto had not graduated from junior high when he was 12 years old, the official resume shows.", "According to the resume, at 12 years old he attended the Victoria Institute in Kuala Lumpur. His full name is included on a list of former students on the school's website here.", "Below is a screenshot of his photo on the school's alumni list:", "Subianto was also listed as attending Victoria Institute after his early education in Singapore in this report published by Singapore-based news website Asia One on April 4, 2014.", "On his official Instagram page, Subianto shared this photo of himself at the American International School of Zurich from his yearbook in 1965. It shows him at school aged either 13 or 14, depending on which month in the year the photo was taken.", "Here is a screenshot of the photo:", "There is no evidence on his resume to suggest he ever attended a university in the United States. The final academic achievement listed on his resume is graduating from Indonesia’s military academy in 1974.", "This is a photo he shared of himself on Instagram at the military academy as a young man. The same photo was used in this report published by Indonesian news site Tribun Jabar on February 19, 2019, about his decision to join the military academy in 1970. The year of his acceptance at the military academy tallies with his resume.", "Below is a screenshot of the resume as it appears on the government site:", "According to general election commission regulation no. 22/2018 on Presidential and Vice Presidential Candidacy, Indonesia’s general election commission must take steps to verify the authenticity of all documents – including the CV – of candidates before approving them to run.", "This clip below is a news programme from BeritaSatu showing commission chairman Arief Budiman officially announcing the names of candidates who had met the candidacy requirements and therefore could compete in the election.", "The announcement starts at 2:39 and shows Budiman saying: \"The Republic of Indonesia's General Election Commission on September 20, 2019, held a plenary meeting to finalise the assessment before announcing the lists of participants of the legislative and presidential elections in 2019.", "\"The meeting concluded that the two candidate pairs who previously registered their presidential candidacy to the commission – the Joko Widodo-Ma'ruf Amin pair and the Prabowo Subianto-Sandiaga Uno pair – have met the requirements to compete in the 2019 presidential election.\"", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]