["“One Pediarix vaccine contains 850 mcg of aluminum. ‘Safe’ limit to inject into a 2-month-old baby according to the FDA is 25 mcg,” claims a November 4, 2020 Instagram post with more than 1,000 likes.", "The same claim can also be found on Instagram here.", "A search made with the social media monitoring tool CrowdTangle shows that the claim has circulated on Instagram and Facebook since at least 2016, with new Facebook posts in 2020 on public pages here and here.", "Likes on Instagram surged in November 2020 as companies began announcing encouraging results from the clinical trials for Covid-19 vaccines.", "However, the posts do not correctly reflect FDA recommendations about aluminum.", "According to the US Code of Federal Regulations for biological products, Title 21, Subpart 610.15: “The amount of aluminum in the recommended individual dose of a biological product shall not exceed 0.85 milligrams.”", "And the package insert for Pediarix is clear that each dose does not include more than 0.85 milligrams (or 850 mcg) of aluminum.", "The Pediarix vaccine, manufactured by GlaxoSmithKline (GSK), does not contain an unsafe amount of aluminum, according to Ashlesha Kaushik, Medical Director of the UnityPoint Clinic Pediatric Infectious Diseases in Sioux City, Iowa.", "“It’s a clear case of misinformation,” she told AFP by phone. “Vaccines are very much in the safe limit.”", "Aluminum is naturally found in the environment and humans ingest it through drinking water and some foods, including breast milk and infant formula.", "Christopher Gill, Associate Professor of Global Health at the Boston University School of Public Health, said by email: “Cumulatively, you get more (aluminum) from breastfeeding than from vaccines.”", "This was confirmed by the Children’s Hospital of Philadelphia which found that while vaccines introduce about 4.4 milligrams of aluminum in the first six months of life, “breastfed infants ingest about seven milligrams, formula-fed infants ingest about 38 milligrams, and infants who are fed soy formula ingest almost 117 milligrams of aluminum during the first six months of life.”", "The purpose of including aluminum as an adjuvant ingredient in a vaccine is to increase immune response, according to Kaushik, who is also a Clinical Assistant Professor in the Department of Pediatrics at the University of Iowa Carver College of Medicine.", "“Adjuvants make vaccines more effective,” she said by phone. “Several generations have taken these and they have been extensively tested.”", "The FDA website also says that “aluminum adjuvant containing vaccines have a demonstrated safety profile of over six decades of use and have only uncommonly been associated with severe local reactions.”", "GSK did not respond to AFP’s questions about Pediarix, but its website says that the vaccine was tested in 14 safety trials worldwide. The vaccine, which was licensed in the United States in December 2002, can be given from six weeks of age through six years.", "The shot is a combination vaccine, protecting against Diphtheria, Tetanus, Pertussis, Hepatitis B and polio, reducing the number of injections needed to provide the same immune response for a child.", "A 2017 study funded by GSK found that combination vaccines improved the completion rate for the schedule of vaccines recommended by the US government. However, Pediarix was associated with higher rates of fever relative to separately administered vaccines.", "Kaushik said she is aware that people have started to question the necessity of vaccines because they have worked so well to eliminate disease in countries including the United States where vaccination rates remain high. But she cautioned: “Vaccine preventable diseases are indeed dangerous.”", "Vaccines are a regular source of misinformation. AFP Fact Check has previously investigated misleading claims about the ingredients thimerosal and potassium chloride.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]