["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Wisconsin Gov. Scott Walker visited the White House on July 26, 2017 to take part in an announcement that Foxconn plans to build a $10 billion manufacturing facility in his state. (Associated Press)", "Wisconsin Gov. Scott Walker could perhaps be excused for over-exuberance when it comes to Foxconn Technology Group, the Taiwan-based company that describes itself as the world's largest electronics manufacturing services provider.", "Indeed, the typically composed Republican governor seemed almost giddy when he joined President Donald Trump, Foxconn founder Terry Gou and other officials at the White House on July 26, 2017.", "The occasion: Foxconn was announcing that, after considering a number of states, it had decided to build a liquid crystal display (LCD) panel manufacturing plant in southeast Wisconsin. Not just any plant, but a $10 billion facility that is envisioned as becoming part of a high-tech \"ecosystem.\"", "So, in all the excitement, did Walker go too far in stating how many jobs are coming?", "In a tweet the same day, he declared:", "Foxconn is bringing 13,000 high-tech jobs to Wisconsin -- the biggest jobs announcement in our state’s history!", "Leaving aside the term high-tech, we wondered about the figure.", "We found that the 13,000 is something more than a goal, though -- at this stage -- considerably less than actual jobs.", "What Foxconn says", "At the White House, Gou made no reference to the number of jobs the facility would create.", "And in a news release, Foxconn was notably more measured than Walker was, using the word \"potential\" in saying the plant would \"create 3,000 jobs with the potential to grow to 13,000 new jobs.\"", "Trump used the same word, saying 3,000 jobs would be created \"at a minimum, with the potential for up to 13,000 jobs in the very near future.\"", "Indeed, in an interview on the day of the announcement, Walker himself qualified the 13,000 figure as less than certain in discussing $3 billion in incentives Wisconsin is offering Foxconn. \"If there’s something less than the 13,000 jobs, they don’t get as much of an incentive,\" he told WTMJ-TV in Milwaukee.", "(Walker repeated that point in three broadcast interviews the next day, making it clear the company would not get the full $1.5 billion jobs portion of the incentives unless 13,000 jobs are created.)", "It’s fair to say that the 13,000 is something more than a goal, given that Foxconn is entering into a written agreement with the state.", "\"Is there an absolute guarantee that there will be 13,000 jobs? I don’t know how Foxconn could guarantee that,\" said Tom Still, president of the Wisconsin Technology Council, a nonprofit that advises the governor and the Legislature. \"But is there a strategic plan to grow to that level? Absolutely.\"", "At the same time, much must occur before any help wanted postings are made.", "It’s worth noting that in 2013, Pennsylvania Gov. Tom Corbett announced that Foxconn planned to invest $30 million in a \"high-end technology manufacturing facility\" with 500 jobs. The company has a small research operation in Harrisburg, Pa., but the factory was never built.", "And by way of comparison, on the same day of Foxconn’s Wisconsin announcement, Amazon made a more firm jobs announcement. It said it would hold a job fair on Aug. 2, 2017, at 10 of its shipping sites around the country as part of an effort to fill more than 50,000 U.S. jobs.", "Our rating", "Walker said: \"Foxconn is bringing 13,000 high-tech jobs to Wisconsin.\"", "Leaving aside the term high-tech, the Taiwan-based electronics manufacturer is a long way from even breaking ground on a plant that was only announced the same day Walker made his statement. And the company itself has been more measured, saying the planned plant initially will create 3,000 jobs, \"with the potential to grow to 13,000 new jobs.\"", "But the 13,000 is more than talk. Foxconn is pledging a $10 billion investment and the state is offering $3 billion in incentives, with $1.5 billion aimed at the creation of 13,000 jobs.", "Walker’s statement is partially accurate, but needs clarification -- our definition of Half True.", "Twitter, Scott Walker tweet, July 26, 2017", "Email, Scott Walker spokesman Tom Evenson, July 26, 2017", "PR Newswire, Foxconn news release, July 26, 2017", "C-SPAN, video of White House announcement, July 26, 2017", "WTAQ, Jerry Bader Scott Walker interview, July 27, 2017", "CNBC, \"Squawk Box\" Scott Walker interview, July 27, 2017", "YouTube, WTMJ-TV Scott Walker interview, July 26, 2017", "White House, Donald Trump remarks, July 26, 2017", "iHeart Radio, Jay Weber Scott Walker interview, July 27, 2017", "Milwaukee Journal Sentinel, \"Foxconn announces $10 billion investment in Wisconsin and up to 13,000 jobs,\" July 26, 2017", "Interview, Wisconsin Technology Council president Tom Still, July 27, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]