["Recently, new regulations regarding the fee structure of JNU have been announced. Fees have been hiked, following which JNU students have held protests. On social media, several images and videos claimed to be related to the protests have been shared. One such photograph is viral with the below message, which claims that the person in the photo is 47-year old Moinuddin who is a student at JNU since 1989.", "“That baldy looks like he’s been there for a while.. ₹10 room, free food, generous stipend, condom vending machine.. What else a ‘revolutionary’ want?”", "The above claim has been tweeted along with a photograph by a user @chathootti. The message says, “He is 47 year old Moinuddin from Kerala JNU student since 1989.”", "He is 47 year old Moinuddin from Kerala JNU student since 1989. https://t.co/XerRV7YOGs", "— Great Sardar (@hindumax) November 19, 2019", "The above tweet has been retweeted over 5300 times and ‘liked’ over 8500 times. Among those who retweeted it includes RSS thinker and TV panelist Ratan Sharda.", "Several Twitter handles which have tweeted this narrative along with the photo, are followed on the platform by Piyush Goyal and Nirmala Sitharaman.", "Several users on Facebook have shared the image with a lengthy post which begins with the words,“ये हैं केरल के मोइनुद्दीन … इन्होंने JNU में 1989 में प्रवेश पाया।” (This is Moinuddin from Kerala…He entered JNU in 1989- translation).", "Alt News contacted JNU students and found that the narrative shared along with the photograph is false. The person in the image is indeed a student of JNU, but his name is not Moinuddin but Pankaj Mishra.", "Alt News contacted Pankaj Mishra who confirmed that the person in the photograph is him. He said, “My name is Pankaj Mishra and I am from Allahabad. I did my masters from Tata Institute of Social Sciences in 2016. After that I worked on public health in Bihar and Uttar Pradesh. I am currently researching on public health in JNU. I enrolled in 2019. This is a recent photograph.” Mishra told us his age is 30 years and not 47 years, and that the photograph was taken when Zee News reporters had visited JNU, and that Zee News had broadcast reports targeting JNU students, following which the students had then protested.", "We found the Twitter account of Pankaj Mishra, wherein his picture matches with the viral photograph.", "Ever since the protest by JNU students, several instances of misinformation targeting the university have been shared on social media. In another instance, random images of young women picked up from the internt have been shared with the false claim that they are students of JNU. Here, a 30-year old student’s photo has been passed off as a 47-year old student named Moinuddin.", "Donate Now", "Priyanka Jha specialises in monitoring and researching mis/disinformation at Alt News. She also manages the Alt News Hindi portal.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]