["By Brooks Jackson", "Posted on August 31, 2016", "Donald Trump’s new TV ad promises a bright future if he’s elected, and a gloomy one if Hillary Clinton wins. But that’s based on murky evidence and misrepresentations.", "The Trump campaign released the ad, called “Two Americas: Economy,” Aug. 29, and said it would run in nine battleground states: Ohio, Pennsylvania, North Carolina, Florida, New Hampshire, Iowa, Nevada, Virginia and Colorado.", "One big misrepresentation is a claim that “hundreds of thousands of jobs [would] disappear” as a result of Clinton’s proposal to raise taxes. The campaign cites a study by the Tax Foundation, which predicted no such thing.", "The study actually found that Clinton’s plan would result in slightly less job growth than would be the case under current law. No jobs would “disappear.”", "The Tax Foundation study said Clinton’s plan would result in “311,000 fewer full-time equivalent jobs” over the next 10 years, but that doesn’t mean fewer than now — it means fewer than currently projected.", "Alan Cole, an economist with the Tax Foundation, told us the Congressional Budget Office was projecting a gain of about 7 million new jobs under current law. “We see Hillary Clinton’s tax proposals as maybe dialing that back to 6.7 million.”", "And that’s just one study, by a pro-business group that looked at only the impact of Clinton’s tax plan. Another study, by Clinton supporter Mark Zandi and his colleagues at Moody’s Analytics, considered the impact of all of Clinton’s policy proposals, projecting a gain of 19 million jobs over 10 years, or 6 million more than under current law. Take your pick.", "The ad also claims that “the middle class gets crushed” under Clinton, based on the same Tax Foundation study, which found that her tax policies would reduce wages by 0.8 percent. Again, however, that’s a reduction in future growth, not a reduction in current wages.", "The Tax Foundation’s Cole told us, “CBO expects wages to rise about 36 percent over the next 10 years, or 12 percent after adjusting for inflation. The tax increases dial that back to about 11 percent.”", "So under this pro-business group’s projection, real wages would increase under Clinton by 11 percent instead of 12 percent. Whether that’s being “crushed” or not is a matter of opinion.", "After painting its bleak picture of life under Clinton using pictures of gloomy people in tones of gray, the ad shifts to full-color pictures of smiling people enjoying life under Trump.", "But the ad’s colors are brighter than the murky evidence cited by the campaign.", "To support a claim that “wages go up” and “millions of new jobs” would appear under Trump, the ad cites a Tax Foundation study of Trump’s original proposal for a huge, nearly $12 trillion tax cut over 10 years. Not mentioned is that Trump has since abandoned that plan and proposed a different tax plan with higher tax rates than he proposed at first. The Tax Foundation has not analyzed his latest plan, as it lacks sufficient detail, Cole told us.", "The Trump plan is similar in some respects to a more detailed tax plan put forth by House Republicans. That plan calls for a cut less than one-fourth as large as Trump’s original proposal; the Tax Foundation estimated it would reduce government revenues by $2.4 trillion over 10 years, compared with Trump’s abandoned $12 trillion cut.", "The Tax Foundation said the House GOP’s plan would result in an “additional 1.7 million full-time equivalent jobs” over 10 years. If one rounds that up to 2 million, it would be correct grammar to use the plural “millions” as the Trump ad does — but just barely. And in any case, Trump has yet to endorse that plan.", "The ad claims “working families” would get tax relief under Trump. But that’s not entirely clear from what he has said most recently.", "In his original plan, married couples filing jointly would have paid zero tax on taxable income up to $50,000. But as mentioned, Trump has set that plan aside, and it’s unclear how his latest plan would affect middle-income workers. The Tax Foundation notes that Trump’s most recent tax speech “did not address whether the revised tax plan would retain this large tax cut for middle-income taxpayers.”", "Trump has specified that he would create three federal income tax rates for individuals of 12 percent, 25 percent and 33 percent. But he hasn’t said which earners would fall into those brackets.", "In that respect, Trump is a little like Clinton, who also has been promising tax cuts for the “middle class,” but without as yet providing any details.", "What we know is that what Clinton has proposed so far is a $1.1 trillion, 10-year tax increase that would fall mostly on the very highest incomes. The nonpartisan Tax Policy Center estimates that nearly 78 percent of the increase would be paid by the top 1 percent of earners, who are making more than about $732,000.", "That top 1 percent, on the other hand, would have received 35 percent of the tax cuts Trump originally proposed, according to TPC’s analysis. They would have seen an average tax cut of over $275,000, and a 17 percent increase in after-tax income in 2017.", "https://www.sharethefacts.co/share/cab483d1-0b71-44d7-aca5-5b6f112e80da", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]