["A video showing mutilated bodies laid out in a room is floating on WhatsApp with the claim that 500-2000 Rohingya Muslims divided into small groups are on a prowl in Madhya Pradesh to kidnap children aged between 17 and 18 years. The message suggests that these gangs are armed and they lift kids from outside schools. The video is gory in nature hence, Alt News has decided to not embed it in this article. It can, however, be viewed here.", "The complete message alleges – “सावधान मध्यप्रदेश में 500से 2000 लोगों की अलग अलग रोहिग्या मुस्लिमो की टोली आई है उनके साथ महिलाएं और उनके पास हथियार भी है और वो 17 या 18 साल तक के लड़कों को पकड़ के ले जाते है स्कूल के आस पास से .. इसको आप सारे ग्रुप में शेयर करें।भोपाल पुलिस C.S.P. Send to all group plz. (Beware! 500-2000 Rohingya Muslims are prowling in gangs which include women and children. They have weapons and they lift children aged between 17 and 18 from outside schools. Share this on every group. Bhopal Police City Superintendent.)”", "Alt News has received multiple requests, including on its mobile app, to check the veracity of the video.", "Alt News had debunked this video in June when it was viral with the false claim that organ smugglers travelling from Bihar to Jharkhand are killing innocents to sell their body parts.", "The video had first appeared on Portuguese website gorebrasil.com published on January 18, 2017. According to the article translated by AFP, a riot had broken out in Alcaçuz prison in Brazil on January 14, 2017.", "At the 20-second mark in the video, a man can be spotted wearing a t-shirt that says, “Polícia Civil”, which is Portuguese for ‘civil police’ in Brazil.", "On January 14, a riot between rival gangs had broken out in Alcaçuz prison which led to the death of at least 30 inmates. Gory images of decapitated bodies were seen in the aftermath of the violence. The incident was widely covered by international media, including The Guardian, AFP, Al Jazeera and BBC, among others.", "“Members of a drug gang started the clash by invading a pavilion in the Alcaçuz prison where rivals rested, Rio Grande do Norte state’s security secretariat said on Sunday,” reported The Guardian. In January 2018, at least 140 inmates had died in gang warfare in the prison.", "“The gangs were believed to be fighting for control of lucrative drug smuggling routes,” reported The New York Times. “Decapitations and mutilations are common in Brazil’s violent, overcrowded prisons, in which 40 per cent of inmates have yet to be sentenced, but the latest wave of brutality has appalled many here,” it furthered.", "While Alcaçuz prison authorities were unresponsive to AFP’s queries about the origin of the video, similar imagery of mutilated bodies were reported in mainstream media.", "Child-kidnapping rumours, which had killed at least 30 people in mob lynchings last year, are yet again viral on social media. Alt News has debunked four such false messages in the past 24 hours (1, 2, 3, 4). Most of these rumours are targetting Madhya Pradesh, a state where child-kidnapping rumours have sparked at least 15 mob attacks in the last 10 days.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]