["About this rating", "On 30 June 2017, a shocking story raced around social media: the twisted, tortured bodies of dozens of black men had been found on what had once been the estate of a prominent Ku Klux Klan leader in Jackson, Mississippi:", "A Mass grave of torture victims has been uncovered in Jackson, Mississippi, FBI spokesman Adrian Cartwright said Thursday.", "A Mass burial site of many dozens of black men, who had been subjected to brutal torture and [then] murdered, has been found,” Cartwright said. “In many cases, body parts are missing; most victims had been shot in the head.", "Authorities state it's still very early in the recovery and identification process, but they estimate the grave to be at least 50 years old and contain upwards of 10 bodies.", "The FBI did not comment on who they believe is responsible or how the bodies got there due to the ongoing investigation. However, Mississippi records list Eldon Lee Edwards a U.S. Ku Klux Klan leader as owning the property from 1945-1953.", "Right off the bat, those who read the story might notice several discrepancies. For example, the purported homeowner discovered \"some leg bones,\" which begs the question of how investigators could know, especially very early into what would clearly be a long and involved identification process, the ethnicity or the ancestry of the victims by their bones alone.", "(It is possible to for forensic anthropologists to gather clues about the ancestry of long-dead people and build \"biological profiles\" (a summary of a dead individual's sex, age at time of death, stature, and health) from bones alone, but teasing out information from human remains takes time and care, and investigators are highly unlikely be so definitive so early in a recovery process.)", "The article's text also does not match the headline. Were \"dozens\" of bodies discovered, or \"upwards of 10\"?  We could call Adrian Cartwright, the Federal Bureau of Investigation spokesman named in this piece, to confirm the numbers, but alas, no Adrian Cartwright exists at the Jackson, Mississippi, FBI office. Nor does anyone by that name work as a national spokesman for the agency.", "Further, the image used in the head of the article has nothing to do with Jackson, Mississippi.  It was stolen from a May 2016 VICE News piece (by Nathanial Janowitz, who also took the photograph) about the efforts to exhume and identify victims of narcoterrorism in Morelos, Mexico, who had been dumped into a mass grave by the government years before:", "Moreover, the image of skeletons embedded in the body of the article was taken from a 6 August 2012 feature in Current Archaeology and shows a partially unearthed medieval-era mass grave from a dig site in Spitalfields, London, England — a long way from Jackson, Mississippi:", "Eldon Lee Edwards was a real person, an automobile paint sprayer who helped rebuild the U.S. Ku Klux Klan in the 1950s and was known as its Imperial Wizard until his death of a heart attack in 1960. But Edwards was from Atlanta, Georgia, not Jackson, Mississippi, and we were unable to find any evidence that he owned an estate in either state.", "The Jackson Telegraph is not the online arm of a real newspaper, but merely a fake news site. One of the telltale signs of a fake news site is that the Jackson Telegraph's \"contact\" page provides no physical address, no telephone numbers, no listing of editorial or business staff (or other personnel) — it consists only of a generic e-mail form.", "While this story is false, racially-based serial murders are not unbelievable and not without precedent, which makes it all the more inflammatory. For example, white serial killer Jeffrey Dahmer (on whom this particular story may have been based) was known to search out black men in particular, which is thought to be one of the reasons that the murders he committed were not initially taken seriously, as the Christian Science Monitor reported in 1991:", "But many residents, particularly in the gay and minority communities, say the Dahmer case is focusing attention on long-standing local problems that demand attention. Most of Dahmer's victims were black, and he often picked up victims in gay bars.", "The biweekly gay newspaper, Wisconsin Light, printed a special edition to address the anger and fear among local gays. The case is exposing issues such as minority distrust of the police department and general dissatisfaction within the black community.", "\"The Dahmer case has put all this on the front page,\" says Donald Leake, president of the Ozaukee County National Association for the Advancement of Colored People.", "2 July 2017, 10:53 P.M.: Added details about Jeffrey Dahmer.", "Brooke Binkowski is a former editor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]