["Texas Gov. Greg Abbott gives his state of the state address on Feb. 1, 2021 in Lockhart, Texas. (AP)", "Texas has strict abortion regulations, and Gov. Greg Abbott indicated this month that he intends to make them stricter.", "In his state of the state speech Feb. 1, Abbott said that in the upcoming legislative session he will encourage laws ensuring \"that the life of every child will be spared from the ravages of abortion.\"", "A bevy of bills have been filed to further restrict abortion in Texas, including one that would ban the practice all together. But Abbott and fellow Republican state leaders have long targeted one of the state’s largest abortion and family planning providers: Planned Parenthood.", "Last month, after years of litigation, Texas health officials gave Planned Parenthood a 30-day notice before kicking the organization off the state’s Medicaid program. Just before the Feb. 3 deadline, Planned Parenthood sued and a judge blocked state officials from removing Planned Parenthood as a Medicaid health care provider.", "Abbott posted a tweet Jan. 24 anticipating that Feb. 3 deadline, saying that \"innocent lives will be saved\" thanks to the state’s actions.", "Planned Parenthood and state leaders are longtime mutual adversaries, squaring off in court multiple times over the years over abortion restrictions. The battle over Medicaid funding began in 2015 when state officials complained that an undercover video shot by abortion opponents showed Planned Parenthood officials in a Houston clinic agreeing to illegal activity, such as changing abortion procedures to better acquire fetal tissue for researchers. Planned Parenthood officials argued that the video was heavily edited and an Austin federal judge ruled that it did not prove any illegal activity occurred. An appeals court disagreed.", "But will the state’s latest move to cut Planned Parenthood from Medicaid funding result in curbing the state’s abortion numbers, as the governor claims?", "Since 1976, Medicaid has been prohibited from funding abortion services under the Hyde Amendment, passed three years after the landmark Roe vs. Wade Supreme Court decision.", "The law, which bars the use of federal dollars to pay for abortion, was introduced by U.S. Rep. Henry J. Hyde, R-Ill., who famously said, \"I certainly would like to prevent, if I could legally, anybody having an abortion, a rich woman, a middle-class woman, or a poor woman. Unfortunately, the only vehicle available is the … Medicaid bill.\"", "Federal Medicaid dollars that flow through the Texas Medicaid program to Planned Parenthood are, thanks to the Hyde Amendment, not allowed to be used for abortion services. Instead, Planned Parenthood uses those funds for non-abortion services for Texas’ poorest women — services such as mammograms, cervical cancer screenings, contraception and STI tests.", "Last year, Medicaid dollars paid for the health care and family planning services of 8,800 Medicaid patients at Planned Parenthood clinics across Texas, according to Planned Parenthood of Greater Texas. This money is paid to the organization through reimbursements. For instance, Planned Parenthood receives $71.50 for every Depo-Provera birth control shot administered to a Medicaid patient, or $8.30 in reimbursement for every HIV rapid test.", "Of Planned Parenthood’s 40 clinics around the state, nine are licensed to perform abortion procedures. Last year, those nine centers performed 14,220 surgical or medication-induced abortions. Virtually all of these procedures were paid for by patients out-of-pocket or by third-party grants.", "According to experts, Abbott’s tweet connecting Medicaid funding to abortions is a misrepresentation.", "\"That statement indicates that somehow this funding is being used to provide abortions, (but) the funding is not allowed to do that,\" said Kari White, a University of Texas associate professor of social work and a faculty researcher at the Population Research Center. \"That’s a misrepresentation of the way this funding is used and what care can be provided with it.\"", "Instead, the effect of removing Planned Parenthood from the Medicaid program will cut access to specialized health care for 8,800 women, experts say. If Texas’ bid to cut Planned Parenthood from Medicaid is ultimately successful, that means women who qualify for Medicaid — such as a single mother of two who makes less than $230 a month — would lose access to Medicaid-funded cancer screenings, contraception, and other preventative healthcare services.", "\"It’s problematic to say that innocent lives will be saved. Given that if people can’t get access to mammograms and cervical cancer screenings, perhaps lives will be lost,\" said associate professor Abigail Aiken of the LBJ School of Public Affairs at the University of Texas.", "It’s unclear how Abbott connects Medicaid dollars to abortion — his office did not respond to several requests for comment regarding his tweet. But it’s not the first time rhetoric around the abortion issue in Texas has connected the two.", "Joe Pojman, executive director of Texas Alliance for life — which is backing a proposal to ban abortion beginning at fertilization (Texas law bans abortions after 20 weeks) — argues that Planned Parenthood places women on a pathway that, for many, ultimately leads to abortion.", "Although \"it’s difficult to make a causal relationship,\" Pojman argues that many women seeking pregnancy-related services at Planned Parenthood are ultimately getting referred to Planned Parenthood abortion facilities.", "\"There’s definitely referrals going on,\" he said. \"That’s certainly part of Planned Parenthood’s practices — is to refer women for abortions.\"", "And women who are seeking non-pregnancy related health services build a \"client relationship\" with Planned Parenthood. Then, if those women later become pregnant, Pojman said, \"they know who to call.\"", "\"A woman searching for breast or cervical cancer screening or high blood pressure screening, if they do a pregnancy test on her and she's positive, then they'd do a referral to their abortion facility,\" he said.", "However, because medical referral information is protected under the Health Insurance Portability and Accountability Act, Pojman said he hasn’t seen any records showing this connection.", "\"It’s reasonable to believe that fewer women going to Planned Parenthood facilities for any reason will likely result in fewer abortions,\" he said.", "Planned Parenthood spokesperson Sarah Wheat says that none of these claims have factual basis. A standard component of family planning services is providing nondirective pregnancy counseling, Wheat said. All patients are informed of all of their legal and medical options.", "\"Providing patients with referrals for all of their medical options is not unique to Planned Parenthood,\" Wheat said.", "Furthermore, Pojman’s argument ignores the fact that many women rely on Planned Parenthood to obtain contraception and avoid unwanted pregnancies, said Aiken. According to Planned Parenthood’s own data, 82,400 Texas women received birth control through Planned Parenthood last year.", "Abortion referrals \"seems to be exactly what would be precipitated by kicking Planned Parenthood out of Medicaid,\" Aiken said. \"If there are no Medicaid funds to help low-income patients get contraception, I would imagine that more abortion referrals would be necessary precisely because of the lack of funding.\"", "Pojman said Texas’ own family planning services program could easily absorb the 8,800 Planned Parenthood Medicaid patients.", "Created by the Legislature, Healthy Texas Women launched in 2016 to provide family planning and health care services to low-income women. It served 173,000 women in 2018, the most recent year for which data is available.", "While the program offers services including pregnancy testing, STD testing, breast and cervical cancer screenings and others, it follows Texas’ ethos of excluding abortions within its continuum of care.", "But the program is not without drawbacks and shortcomings, said White, who conducted a survey of the program’s provider network in 2019.", "\"What we have found in our research is that it is not so easy for patients to just transfer their care someplace else. In some communities, there aren't very many providers for patients to go to,\" she said.", "White’s research, done with the Texas Policy Evaluation Project, found that many Healthy Texas Women providers don’t offer a full range of contraceptive options or lack clinicians trained to place or remove birth control implants or intrauterine devices.", "\"There's a lot of variability in the network. Where you go for services is going to determine the kind of services that you get,\" White said.", "Abbott’s tweet tied Medicaid funding of Planned Parenthood to abortions, and said that the state’s efforts to exclude Planned Parenthood from Medicaid would save \"innocent lives.\"", "Since 1976, Medicaid dollars have never been used to fund abortion or abortion-related services thanks to the Hyde Amendment. Instead, the federal funding the state is attempting to block from Planned Parenthood provides family planning services and healthcare for 8,800 Medicaid patients.", "Because Abbott’s office did not respond to requests for comment, it’s unclear how he connects Medicaid funding to abortions. Other anti-abortion advocates like Pojman of the Texas Alliance for Life argue that Planned Parenthood’s referral practices lead women to abortion facilities, although he couldn’t provide proof of that claim.", "Due to the lack of evidence establishing this connection, and because the burden of proof is on the speaker, we rate this claim False.", "Tweet, Gov. Greg Abbott, Jan. 24, 2021", "Office of the Texas Governor, Governor Abbott Delivers 2021 State Of The State Address, Feb. 1, 2021", "Austin American-Statesman, Texas abortion opponents vow a major push in 2021. It's our No. 4 issue of the legislative session, Jan. 9, 2021", "Austin American-Statesman, Judge blocks Texas plan to remove Planned Parenthood from Medicaid, Feb. 3, 2021", "Meera Shah, You're the Only One I've Told: The Stories Behind Abortion, Sept. 2020", "Texas Tribune, Texas gives Medicaid recipients using Planned Parenthood until Feb. 3 to find new health care provider, Jan. 5, 2021", "Texas Policy Evaluation Project, Timeline: Family Planning and Abortion Legislation in Texas, 2011-2020", "Interview with Abigail R.A. Aiken, University of Texas Associate Professor of Public Affairs; Fellow of the Richter Chair in Global Health Policy, Feb. 5, 2021", "Interview, emails with Sarah Wheat, Planned Parenthood of Greater Texas Chief External Affairs Officer, Feb. 8-11, 2021", "Interview with Joe Pojman, executive director of Texas Alliance for Life, Feb. 10, 2021", "Interview with Kari White, University of Texas associate professor and faculty research associate, Feb. 11, 2021", "Texas Health and Human Services Commission, Texas Secures Approximately $350 Million in Federal Funding for Women’s Health Services, Jan. 24, 2020", "Texas Tribune, Report: Thousands more Texas women being served in health programs, April 26, 2018", "Texas Policy Evaluation Project, Providers’ Barriers to Offering Contraception in the Healthy Texas Women (HTW) Program, March 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]