["About this rating", "In April 2020, a coupon purporting to offer $250 in merchandise from the Kohl's department store circulated in Facebook posts directing viewers to click on a survey question:", "This was a scam. Such efforts that trick viewers by offering free goods or money are long-standing. Kohl's is also a frequent target of such scams, but this fraud can target any business, from airlines to beer makers. A good rule of thumb to follow: If an offer seems too good to be true, it probably is.", "These types of viral \"coupon\" scams often involve websites and social media pages set up to mimic those of legitimate companies. Users who respond to those fake offers are required to share a website link or social media post in order to spread the scam more widely and lure in additional victims. Then those users are presented with a “survey” that extracts personal information such as email addresses, telephone numbers, dates of birth, and even sometimes credit card numbers. Finally, those who want to claim their \"free\" gift cards or coupons eventually learn they must first sign up to purchase a number of costly goods, services, or subscriptions.", "Despite the latest coupon scam above, Kohl's was indeed celebrating its 57th year as a department store, as of September 2019. It opened its first store in Brookfield, Wisconsin, according to company literature. In 2016, a variation of the same type of scam circulated, offering viewers $75 off purchases.", "The Better Business Bureau offers consumers several general tips to avoid getting scammed:", "WHP.   \"Scam Alert: Kohl's $75 Off Coupon Is Too Good to Be True.\"\r\n    24 May 2016.", "Better Business Bureau.   \"Scam Alert: Giveaway Scam Poses as Facebook.\"\r\n    14 April 2017.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]