["पुलवामा में 40 जवानों की शहादत की खबर के तीन घंटे बाद भी ‘प्राइम टाइम मिनिस्टर’ फिल्म शूटिंग करते रहे। देश के दिल व शहीदों के घरों में दर्द का दरिया उमड़ा था और वे हँसते हुए दरिया में फोटोशूट पर थे। #PhotoShootSarkar (Three hours after news of martyrdom of 40 jawans in Pulwama, ‘Prime Time Minister’ was shooting for a film. Amid a sea of sorrow in the country and in the homes of the martyrs, he was engaged in a photoshoot- translated).", "The above message was tweeted by Congress president Rahul Gandhi in the morning of February 22, along with a set of photographs featuring Prime Minister Narendra Modi.", "पुलवामा में 40 जवानों की शहादत की खबर के तीन घंटे बाद भी ‘प्राइम टाइम मिनिस्टर’ फिल्म शूटिंग करते रहे।", "देश के दिल व शहीदों के घरों में दर्द का दरिया उमड़ा था और वे हँसते हुए दरिया में फोटोशूट पर थे।#PhotoShootSarkar pic.twitter.com/OMY7GezsZN", "— Rahul Gandhi (@RahulGandhi) February 22, 2019", "On the basis of these photos, Gandhi lashed out at PM Modi, saying the latter was shooting for a film three hours after news of the terror attack broke out. According to reports, the Pulwama terror attack occurred at around 3:10-3:15 pm on February 14 when a car laden with explosives rammed into a bus ferrying CRPF personnel.", "BJP accused Congress of fudging facts and asserted that the video shoot referred to by Congress had concluded well before the attack on the CRPF convoy. In a statement by a senior government functionary to TOI, it was claimed, “On the afternoon of 14th February, PM announced the launch of three projects at Jim Corbett National Park. These projects relate to rescue centre, safari facilities and surveillance systems. He then did a short shoot for tourism promotion and climate change awareness with Discovery and was heading to Rudrapur for a public meeting. It is on the way from Corbett to Rudrapur around after 3.30 that news of the attack trickled in. From 4pm to 4.45pm he held constant review calls and meetings on the situation.”", "The official further added, “The PM eventually decided to address the gathering over phone around 5.15pm and wound it up in 5-7 minutes. After this, he immediately left for Bareilly via road to take a flight back to Delhi from there.” The official also told TOI that the PM halted at a rest house in Ramnagar and again reviewed the situation and gave the necessary orders.", "The itinerary specified in the TOI article has no details as to when the Discovery shoot started or ended, the issue which is of primary contention. Rather, the government functionary chose to use the indeterminate phrase “short shoot” which doesn’t give any sense of the length of the shoot. The itinerary also doesn’t have any timestamps of PM’s activities till 4 pm.", "Further, according to the statement by the government functionary to TOI, the PM left for Bareilly right after addressing a political rally in Rudrapur for 5-7 minutes at 5:15pm over a phone call. Alt News found live Facebook videos shot by people in the areas through which the PM’s cavalcade passed, and backtracked it to ascertain the veracity of this claim.", "The PM according to multiple media reports was at Khinnanauli guest house where he did his shoot with Discovery. After leaving from the guest house, he exited the forest reserve through the Dhangari gate, and proceeded to the PWD rest house, before making his way to Bareilly. These places are mapped in the following image with a scale of 5kms.", "Alt News found multiple live Facebook videos at 7:29 pm at Lakhanpur Chungi in Ramnagar, where PM was making his way from PWD Rest House towards Bareilly. We established the location of the video as Lakhanpur Chungi by speaking to a Twitter user who had posted a video from the same location.", "प्रधानमंत्री नरेंद्र मोदी का काफिला रामनगर", "Posted by Ankit Dangwal on Thursday, 14 February 2019", "The total distance between Khinnanauli rest house and the PWD Guest house is upwards of 37kms.", "According to a report by Amarujala, the PM spent about 19 minutes at PWD Rest House in Ramnagar before proceeding towards Bareilly. Considering that PM crossed Lakhimpura Chungi at 7:30 pm, he probably arrived at PWD Guest house in the 7:00-7:10pm range.", "We also found a live YouTube Video at 6:19 pm which claimed that PM is in Ramnagar, which would suggest that PM has already exited the forest reserve at this point in time.", "With a distance of close to 20kms from Khannauli Guest House to the Dhangari gate and windy roads inside the reserve, it can be assumed that PM started from the Guest House sometime around 5:30pm which is consistent with BJP’s claims that the PM left for Bareilly soon after addressing the Rudrapur meeting at 5:15 pm.", "However, regarding BJP’s claim that PM left for Rudrapur at 3:30 pm, there is no evidence of PM exiting the forest reserve in that time range. BJP’s timeline is mute about PM’s location when he was conducting the calls to discuss the situation.", "Based on various media reports and live videos, Alt News pieced out the possible timeline of PM’s visit.", "12:10 pm: Arrival at Saint Mary’s Inter College in Afzalgarh via helicopter 12:30 pm: PM leaves for Kalagarh Dam 12:45-1:15pm: Boat ride on Ramganga reservoir towards Dhikala. 30-40 minute boat ride. 1:25-1:55pm: PM reaches Jim Corbett park (Dhikala zone) 3:10 pm: Pulwama terror attack 5:15 pm: Addresses the rally at Rudrapur over a phone call 5:30 pm: PM leaves for Bareilly via PWD Guest House in Ramnagar 6:00-6:15 pm: Exits the Corbett Reserve via Dhangari gate 7:00 pm: Reaches PWD rest house 7:29 pm: Passes by Lakhanpur Chungi in Ramnagar, while traveling towards Bareilly.", "The attack occurred around 3:10-3:15 pm. Rahul Gandhi has posted four photographs, out of which three photos show PM Modi taking a boat ride.", "This boat ride was from the Ramganga sarovar to Dhikala, and was undertaken BEFORE the terror attack at Pulwama. This is corroborated not only by news reports but also by a tweet by a BJP worker from Uttarakhand, who had posted one of the photos of PM Modi that Rahul Gandhi had used in his tweet.", "मा० प्रधानमंत्री नरेंद्र मोदी जी मोटर बोट में सवार होकर कॉर्बेट नेशनल पार्क के ढिकाला जोन को रवाना हो गए है।#NamoInDevBhumi pic.twitter.com/x8jTAZqLnf", "— Vishwaketu Vaidya (@VishwaketuVaid5) February 14, 2019", "Notice the time of the above tweet. It was tweeted at 1:52 pm, more than a hour before the Pulwama attack. Moreover, ETV Uttarakhand had reported on February 14 that Prime Minister Narendra Modi “reached Kalagadh at around 12. Here he enjoyed the beauty of the Ramganga dam. After a tour of the dam, the Prime Minister reached Corbett park via a boat. CM Trivendra Singh Rawat was also present with him. At 2 in the afternoon, PM reached Corbett park. From here, he left for Dhikala” (translated from Hindi).", "This conclusively establishes that the three photos of PM Modi taking a boat ride, posted by Rahul Gandhi, were clicked before the terror attack.", "The fourth photo posted by Rahul Gandhi shows Prime Minister Modi’s posterior, and is distinct from the other photos. PM Modi is seemingly posing for the camera, as a cameraperson can be seen clicking his picture.", "The above photograph is distinct from the other three images posted by Rahul Gandhi, as PM Narendra Modi is wearing a different set of clothes. This suggests that it was taken at another time. We zoomed into the images for a proper comparison.", "It may be noted that PM Modi arrived at the Jolly Grant airport in Dehradun in the morning of February 14. Here again, he is wearing clothes which are different from what he wore during his chopper ride later in the day to Kalagadh.", "Alt News looked at the footage of PM Modi’s arrival by chopper at St Mary College, from where he took a convoy to Kalagadh dam.", "If you notice PM Modi’s attire in the above video, the attire he wore for the fourth photo doesn’t match his attire in the video. This suggests that the fourth photograph which is unrelated to the other three, was clicked later i.e. after the boat ride.", "In an attempt to trace the sequence of events on February 14, Alt News accessed an article by the leading Hindi daily Amarujala, which had reported that a crew of Discovery Channel was onboard the boat which ferried PM Modi from Kalagadh dam to Dhikala. Amar Ujala also reported that the Discovery Channel crew videographed PM Modi on the boat. Later, PM Modi went to Khinanauli. Interestingly, the article now stands deleted, but its archived version can be accessed here.", "Alt News found one more article by Amar Ujala, in which the same is mentioned- PM Modi took a boat ride from Kalagadh dam to Dhikala. Later, PM Modi went to Khinanauli where the shooting continued according to the Amar Ujala report.", "Insofar as the fourth photo posted by Rahul Gandhi is concerned, it was most likely taken AFTER the boat ride, in Dhikala zone of Corbett Park, assuming he would not have got a chance to change his clothes before his arrival there.", "In conclusion, while three of the four photographs used by Rahul Gandhi to take potshots at PM Modi were clicked before the Pulwama attack, the time when the fourth picture was snapped cannot be determined without the exact itinerary of the Prime Minister. Congress’s claim that the PM was shooting with Discovery till 6:30 pm doesn’t bear out, but there is no conclusive evidence presented by BJP that the shoot was over before the news of Pulwama attack reached the PM.", "At the same time, BJP’s response leaves many unanswered questions. What was the PM doing at the time Pulwama attack happened and right after? If he received the news of the terror attack on his way to Rudrapur, why is there no evidence of him exiting the reserve? If he had already left the guest house and was on his way to Rudrapur, where did he do his meetings and calls? Why has the BJP response avoided giving the exact itinerary of the PM leading to the Pulwama attack and right after? Last but not the least, what was the exact time between which the Discovery shoot happened?", "Donate Now", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]