["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Presumptive Republican presidential nominee Donald Trump enters the stage to introduce his wife Melania on the first day of the Republican National Convention on July 18, 2016 at the Quicken Loans Arena in Cleveland, Ohio. (Getty)", "On the opening night of the Republican convention, Donald Trump told Fox News host Bill O’Reilly he was grateful it was held in Cleveland.", "\"I wanted it to be here, and we had lots of choices,\" Trump said. \"I wanted it to be in Ohio. I recommended Ohio. And people fought very hard that it be in Ohio. It's a tremendous economic development event, and you look at the way it's going so far, it's very impressive. I wanted it be here, the Republicans wanted it to be here.\"", "We wondered, did Trump get involved in picking Cleveland?", "If he did, we couldn’t find a trace of it.", "We asked the Trump campaign for details, and we’re still waiting to hear back.", "Trump’s statement seems odd because of the timing.", "The Republican National Committee named a site selection committee in January 2014. Cities submitted proposals to show that they had a big enough venue, enough hotel rooms, the organizational heft to pull all the pieces together, and activities for the delegates.", "By April, the committee had winnowed its choices down to Cincinnati, Cleveland, Dallas, Denver, Kansas City, and Las Vegas.", "On July 8, 2014, the Republican National Committee announced it had picked Cleveland.", "At the time, Trump not only wasn’t a candidate, he didn’t seem to be a likely candidate. An Associated Press rundown of the potential contenders didn’t include Trump, but it did have Jeb Bush, Chris Christie, Ted Cruz, Bobby Jindal, Rand Paul, Rick Perry, Marco Rubio, Paul Ryan, Rick Santorum and Scott Walker.", "With the exception of Paul Ryan, everyone on the list ultimately threw his hat into the ring.", "We looked to see if Trump had any reaction after Cleveland was picked, but there was no sign of him in the convention coverage. Instead, all we found were articles about the closure of Trump Plaza Hotel and Casino in Atlantic City. Trump said more closures might be on the way.", "We spoke to Steve Duprey, a member of the site selection committee, and he told us he doesn’t recall Trump’s name coming up in any meeting.", "\"It’s possible he said something to somebody, but I never heard of it,\" Duprey said.", "We did not hear back from the committee chair.", "A search of the Nexis database of newspapers, transcripts and wire reports going back long before Cleveland was announced produced no statement from Trump. His name and the Republican convention didn’t appear together in the first half of 2014.", "Our ruling", "Trump said he liked having the convention in Cleveland and that he had recommended Ohio. It’s possible that he put in a good word for either Cleveland or Cincinnati (both are in Ohio), but there’s no record of him saying anything about either one. He was not a candidate when Cleveland was picked in 2014, and he made no public statement at the time.", "The Trump campaign hasn’t published any evidence of an early recommendation, nor could we find any in a Nexis search. Plus, a member of the site selection committee has no recollection of Trump having voiced a preference.", "The selection of Cleveland was conducted by the party in 2014, when it wasn’t known who would ultimately win the nomination. We rate Trump’s statement False.", "https://www.sharethefacts.co/share/44939ce5-14be-4a28-8aa9-24b69bd5f3e9", "Washington Post, Republicans choose Cleveland for 2016 convention, July 8, 2014", "Associated Press, See how they run: The 2016 presidential checklist, Aug. 9, 2014", "Republican National Committee, RNC Elects 2016 Convention Site Selection Committee, Jan. 24, 2014", "Republican National Committee, RNC's Announces Next Phase of the 2016 Republican National Convention Site Selection Process, April 2, 2014", "Republican National Committee, RNC Selects Cities for 2016 Official Site Visits, May 22, 2016", "Dallas Morning News, GOP site selection team gets elephant’s-eye view of Dallas, June 13, 2014", "Interview, Steve Duprey, member, Republican convention site selection committee, July 18, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]