["In 2015, a Facebook account twice shared a video of a young girl singing the late American singer Dinah Washington's \"What a Difference a Day Made\" in a live television performance.", "This post from August 11, 2015, was shared more than 81,000 times and viewed nearly four million times. Its caption states: “Amy Wine house, age 10. Sad she is gone.”", "A nearly identically-captioned post from August 12, 2015, was shared more than 510,000 times and received 27 million views.", "British singer-songwriter Amy Winehouse died at age 27 in 2011. An inquest released in 2013 found she died after drinking too much alcohol.", "AFP released this video report on July 23, 2011, the day Winehouse was found dead, featuring archival footage of the singer.", "Below is a screenshot of the August 12 Facebook post:", "Initial comments on the post indicated that people believed the caption:", "The claim is false; the video shows a performance from Norwegian singer Angelina Jordan in 2014, three years after Winehouse's death.", "The original video was posted to YouTube by TV 2, a government-owned television station in Denmark, on July 3, 2014.", "The caption for the video says: “Amazing! 8 year old Angelina Jordan, winner of Norway’s Got Talent 2014, performs Dinah Washington’s 'What a Difference a Day Made' on the opening show of TV 2 singalong summer hit ‘Allsang på grensen’ on Thursday June 3rd 2014.”", "Here is the same video on the official website of Jordan, who won the 2014 edition of Norway's Got Talent.", "This clip from the documentary “Amy”, which is about Winehouse’s life, shows an early example of her singing in at age 14 in 1998.", "The Facebook user who uploaded the video along with a wrong caption also realised her mistake and posted an apology on August 20, 2015, stating the video does not show Winehouse.", "Despite this effort, fact-checking site Snopes said the video was still circulating online along with the false claim in 2016.", "The misleading Facebook posts now include comments pointing to the fact that the video in fact shows Jordan, not Winehouse, but people continue to share the video with the incorrect caption in 2019.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]