["By Lori Robertson", "Posted on March 27, 2019", "In an interview about the special counsel’s report, Rep. John Ratcliffe said that what “started all of this” was “a fake, phony dossier.” But a House Republican intelligence committee memo said it was information about a Trump campaign foreign policy adviser that sparked the FBI’s counterintelligence investigation into Russian interference in the election.", "Ratcliffe, a Texas Republican who is a member of the House intelligence committee, said in the interview on Fox Business Network that “I had seen every classified document that any member of Congress was allowed to see. So I wasn’t surprised at all at the findings” of the special counsel investigation, as revealed in a four-page memo on March 24 by Attorney General William P. Barr. He then turned to the dossier.", "Ratcliffe, March 25: That this was a fake, phony dossier that started all of this, funded by the Democrats. … It wasn’t real and now Bob Mueller says it wasn’t real.", "The “dossier” is a series of memos compiled by former British intelligence officer Christopher Steele on supposed contacts between Russian officials and members of the Trump campaign. It alleged the Russian government had compromising information on then-Republican presidential candidate Donald Trump. Steele was hired by the research firm Fusion GPS, which had been hired by a law firm representing Hillary Clinton’s presidential campaign and the Democratic National Committee. (See “Q&A on the Nunes Memo” for more information.)", "We don’t know what special counsel Robert S. Mueller III said, or didn’t say, about the dossier in his report to Barr. For now, Mueller’s report remains confidential. But we do know, according to Barr’s summary of it, that Mueller’s report said: “[T]he investigation did not establish that members of the Trump Campaign conspired or coordinated with the Russian government in its election interference activities.”", "Barr wrote in his memo that “the Special Counsel did not find that the Trump campaign, or anyone associated with it, conspired or coordinated with the Russian government in these efforts, despite multiple offers from Russian-affiliated individuals to assist the Trump campaign.”", "But Ratcliffe is wrong to say the dossier “started all of this.” Competing memos from the Republicans and the Democrats on the House intelligence committee both say that information about George Papadopoulos, a Trump campaign foreign policy adviser, had prompted the FBI investigation in July 2016.", "Papadopoulos had contacts with Russian intermediaries during the campaign, according to the Justice Department, and later pleaded guilty to lying to the FBI about those contacts. While he was a Trump campaign adviser, Papadopoulos met with a professor with connections to Russian government officials who told him “about the Russians possessing ‘dirt’ on then-candidate Hillary Clinton in the form of ‘thousands of emails,'” and he tried to arrange a meeting between the Russian government and the campaign, the DOJ’s statement of the offense said.", "A memo released Feb. 2, 2018, by the Republicans on the House intelligence committee raised concerns about the use of the dossier in an application from the DOJ and FBI under the Foreign Intelligence Surveillance Act to conduct electronic surveillance on Carter Page, another Trump campaign foreign policy adviser. But it said the “Papadopoulos information triggered the opening of an FBI counterintelligence investigation in late July 2016.”", "The Democrats on the House intelligence committee agreed with that, saying in a memo released Feb. 24, 2018, that the FBI investigation started “more than seven weeks” before the FBI received Steele’s intelligence reporting in mid-September of that year.", "The two sides disagree about how essential the dossier was to the FISA court application to monitor Page. But one of the few points of agreement is that the FBI investigation began with information on Papadopoulos.", "After the GOP memo was released, Republican Rep. Trey Gowdy, also a member of the intelligence committee, said the dossier didn’t have any effect on the Russia investigation. “I actually don’t think it has any impact on the Russia probe,” Gowdy said on Feb. 4, 2018, on CBS’ “Face the Nation.”", "Gowdy mentioned other incidents that had nothing to do with the dossier, including Papadopoulos’ contacts with the professor and the June 9, 2016, Trump Tower meeting Donald Trump Jr. arranged with what he was told was a “Russian government attorney” offering incriminating information on Hillary Clinton. “So there’s going to be a Russia probe, even without a dossier.”", "We asked Ratcliffe’s office how he could claim that “a fake, phony dossier … started all of this.” His office responded: “Very easily. Both statements are true. The Papadopoulos information is the stated basis for FBI Agent Peter Strzok’s opening of the FBI’s Crossfire Hurricane counterintelligence investigation on Sunday July 31, 2016. The Steele dossier, funded by the Democrats, started many months before that date. Further to that point, the sworn testimony of then DOJ ADAG Bruce Ohr is that he met directly with and was personally briefed on the dossier by Christopher Steele at the Mayflower Hotel on Saturday July 30, 2016, the day before the FBI officially opened its investigation.”", "Ratcliffe’s office added: “The ‘Trump-Russia collusion’ narrative (which Mueller’s findings conclude is false) was started by and through the Steele dossier months and months before the FBI investigation was opened.” But that’s not correct.", "The Steele dossier didn’t start “many months” before the FBI launched its counterintelligence investigation. Glenn R. Simpson of Fusion GPS testified to Congress that he hired Steele in May or June 2016, asking Steele to “find out about Donald Trump’s business activities in Russia.” The first of a series of memos from Steele was dated June 20, 2016, and Simpson said he would have received it “within a couple days” of that date. That’s one month before the FBI counterintelligence investigation began.", "There’s also no evidence that Ohr’s late July 2016 meeting with Steele precipitated the FBI investigation. Ohr, a former associate deputy attorney general with the Department of Justice, testified to Congress that he didn’t know about the FBI investigation at the time. Ohr said he reached out to then-FBI Deputy Director Andrew McCabe and met with McCabe in August 2016 to provide the information Steele had given him. “I don’t recall the exact date. I’m guessing it would have been in August since I met with Chris Steele at the end of July, and I’m pretty sure I would have reached out to Andrew McCabe soon afterwards,” Ohr said in his August 2018 testimony.", "Ratcliffe wasn’t the only Republican to bring up the dossier after Barr released his memo summarizing the special counsel’s report.", "Jay Sekulow, an attorney for the president, said in a March 25 interview on Fox News: “The whole impetus upon which this inquiry engaged, where it came out of, was this dossier, this counterintelligence investigation regarding collusion.” And Ronna McDaniel, chair of the Republican National Committee, said the same day on the cable network: “And it’s really shameful that for two years this cloud has been upon his presidency and it was precipitated by this fake dossier paid for by the Hillary Clinton and the DNC that the Justice Department ran with, that Democrats for two years have accused our president of being an agent for a foreign country.”", "As we explained, dueling House intelligence committee memos agree it was the Papadopoulos information that triggered the FBI investigation.", "Also on Fox News, Rep. Matt Gaetz claimed that “even [former FBI Deputy Director] Andrew McCabe indicated that in the absence of the dossier, the Papadopoulos meeting would not have been enough to continue the investigation.”", "Gaetz is referring to the February 2018 Republican memo, which claimed that McCabe had testified in December “that no surveillance warrant would have been sought from the FISC without the Steele dossier information.” But that has been disputed, including by McCabe.", "Democrats said at the time that the memo’s description of McCabe’s closed-door testimony was incorrect. In an interview with CNN, McCabe said his testimony had been “selectively quoted” and “mischaracterized” in the GOP memo.", "“We started the investigations without the dossier. We were proceeding with the investigations before we ever received that information,” McCabe told CNN. “Was the dossier material important to the [FISA] package? Of course, it was. As was every fact included in that package. Was it the majority of what was in the package? Absolutely not.”", "As for the special counsel’s investigation, Mueller was appointed by Rod Rosenstein, in his capacity as acting attorney general, on May 17, 2017, eight days after President Donald Trump had fired then-FBI Director James Comey. Rosenstein said in a statement that “the public interest requires me to place this investigation under the authority of a person who exercises a degree of independence from the normal chain of command.”", "“I determined that a Special Counsel is necessary in order for the American people to have full confidence in the outcome” of the Russia investigation, he said. “Our nation is grounded on the rule of law, and the public must be assured that government officials administer the law fairly.”", "For more on key moments in the Russia probe, see our story “Timeline of Russia Investigation.”", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]