["About this rating", "A standard U.S. flag is approximately 3 feet tall by 5 feet in dimensions, but the world's largest U.S. flag is approximately 100 times that size. In order to get a better sense of the sheer size of that gigantic national display, here's an image supposedly showing the \"largest United States flag\" unfurled in front of Hoover Dam:", "This is a genuine photograph of a giant flag hanging front of Hoover Dam, taken on 1 May 1996. This flag, which measures 505 by 255 feet and weighs approximately 3,000 pounds, was unfurled before the Olympic Torch was carried across Hoover Dam in conjunction the 1996 Summer Olympic Games:", "May 1, 1996, a 505 by 255 foot American Flag was flown from the downstream face of Hoover Dam. The flag itself weighed 3,000 pounds and was hoisted by 3 separate cables located at the top of the Dam. The flying of the flag was part of a ceremony in which the 1996 Summer Olympic torch was carrried across Hoover Dam. The photograph is a vertical view taken downstream from the dam.", "At the time, this flag -- dubbed Superflag by its owner Tom \"Ski\" Demski -- was the largest flag in the world. Here's an excerpt from a report about it published by the Times Leader of Wilkes-Barre, Pennsylvania, on 28 August 1996:", "Demski's 505-foot-by-255-foot American flag, which was featured in the Guinness book in 1994 and 1995 as the world's largest flag, climbed to new heights. Until this year, the Long Beach, Calif. resident's flag had never \"flown.\" It was just the world's largest flag. But a brief flight at the Hoover Dam this spring put the flag in a different category: The largest flag flown.", "On May 1, Demski's 1.36-ton flag, with stripes nearly 20 feet wide and stars measuring 16 feet point-to-point, was raised up the side of the dam on the Nevada-Arizona border. The Olympic torch relay was passing through and Demski wanted to pay tribute to the flame bound for Atlanta.", "The 128,775-square foot banner was pulled up with three air tuggers (winches) with three half-inch steel cables. Seven other cables were used to guide the flag up. Slowly and methodically the stars and stripes rose from atop a six-story building beneath the dam and unfurled in patriot splendor.", "Then the winds took their best shot.", "Snap.", "\"It was just like a rifle shot,\" Demski said.", "One cable snapped and the flag had to be lowered.", "\"It was awful. As we were bringing it down three more cables snapped,\" said Demski, who operates a mail oder bumper sticker business.", "The powerful gusts tore the double double-stitched nylon flag in three places, including a gash nearly 100 feet long. Demski's flag was down before the relay team ever saw it. But the hour \"flight\" was long enough.", "Demski's feat was approved by The Guinness Book of World Records and will be listed in the 1997 United States edition to be released in October, according to John Hansen, research manager of Guinness Media.", "The previous record was 229-foot-8-inch by 328-foot-1-inch Brazilian national flag unfurled form a flagpole in Brasilia.", "Superflag was the world's largest flag (and in turn the largest U.S. flag) when it was unfurled at  Hoover Dam in 1996. Since then, however, larger flags have been created in other countries. As of this writing, the Guinness Book of World Records lists the largest flag at 101,978 m² (a record set in Qatar in 2013).", "However, Superflag likely still holds the record for largest U.S. flag. The Guinness Book of World Records doesn't take country into account for its various \"largest flag\" records, so it currently includes no listed record for \"largest U.S. flag.\" However, we have not been able to find any reports of a U.S. flag superseding the Superflag in size.", "The Superflag website states that while this flag is no longer the biggest in the world, it \"still remains the largest American flag in the world.\"", "Butera, Cal.   \"Nanticoke Native's Giant Flag One for the Books.\"\r\n    Times Leader. &nbspl 28 August 1996.", "Guinness World Records.   \"Largest Draped Flag.\"\r\n    Retrieved 11 February 2019.", "BBC News.   \"Qatar Breaks Record for World's Largest Flag.\"\r\n    17 December 2013.", "Superflag.com.   \"The Guinness Book of Records.\"\r\n    Retrieved 11 February 2019.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]