["About this rating", "On July 3, 2020, as Melania Trump arrived at Mount Rushmore for an event celebrating Independence Day, social media lit up with comments about the first lady's wardrobe. Some social media users criticized her dress -- a garment created by the late fashion designer Alexander McQueen -- saying it looked like it was covered in scribble.", "Others, however, claimed that Trump's dress actually featured drawings by children who had been victims of sexual abuse:", "While the dress pictured was designed by Alexander McQueen, it does not feature drawings created by children who had been victims of sexual abuse. This dress actually features sketches done by students during a life drawing class.", "Express reported:", "The design on the dress actually came from a collaboration between Alexander McQueen and art students. The designs on the dress were inspired by life drawings. The design is hand stitched onto the linen dress. The dress was designed for the brand's Spring 2020 collection.", "An article published in Glass magazine in May 2020 provided additional details about how this dress was made. According to Glass, the designs on this dress were created during a life drawing class as students from the London arts and design college, Central Saint Martins, made \"continuous, spontaneous sketches\" of dancing girls:", "Continuous, spontaneous sketches of dancing girls were created in a life-drawing class held at the educational space at the Alexander McQueen London flagship store last year.", "Said sketches were then developed into prints and embroideries that went on to feature within the collection. The hand embroidery adorned on the ivory linen dress was worn by British supermodel Stella Tennant during their show – the one-of-a-kind design was received with such success that it inspired another dress in moonshine blue linen.", "This dress has a greater meaning. Every single member of the team contributed to the embroidery by hand on this dress becoming a true symbol of what the brand stands for. Alexander McQueen aims to nurture and contribute to the success of young designers and creatives, and this sense of community that went towards one single dress proves this.", "Sarah Burton, the director of the Alexader McQueen fashion brand, also noted how this dress was special as the entire team contributed to hand stitch the design:", "Backstage Burton pinpointed an embroidered dress, modelled by Stella Tennant, as the embodiment and inspiration for this idea. Explaining that it had been the result of a mass crafting experiment, she said the dress should be credited to staff from right across the company since everyone from the press team to the interns had been involved in its creation. “We set up looms and everybody from the whole McQueen offices had a go at embroidering” she said, “everybody came together to do it.", "“There’s so much noise in the world this was about having a moment to think and be as a studio and all work together on something. It was a calm time to work together and be with our own thoughts” she said.", "It should also be noted that while some criticized Melania Trump for wearing an expensive dress (the dress is available on Alexander McQueen's website for $3,840), the first lady's wardrobe isn't paid for with taxpayer dollars. As we noted while addressing similar accusations toward first lady Michelle Obama, the first lady's sartorial choices are typically paid for out-of-pocket, although designers may donate items or offer them for a discounted price.", "Carlson, Jane.   \"Melania Trump Buys Clothes, Doesn't Get Designer Freebies.\"\r\n    The Hollywood Reporter.   17 March 2017.", "Hodgkin, Emily.   \"Melania Trump Cruelly Mocked Over £1900 Alexander McQueen Dress.\"\r\n    Express.   5 July 2020.", "Hammond, Augustine.   \"A Story of Community: Glass looks back at Alexander McQueen’s SS20 Dancing Girls Print and Mini Bags.\"\r\n    Glass Magazine.   11 May 2020.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]