["About this rating", "On Jan. 21, 2020, Bustatroll.org published an article positing that in 2007, former U.S. President Barack Obama had awarded the Medal of Freedom to convicted sex offender and sex trafficker Jeffrey Epstein, a financier who authorities say took his life while awaiting trial in 2019:", "On This Day In 2007, Obama Awarded Jeff Epstein The Medal of Freedom", "What the Democrats and the mainstream media no longer want you to know is that, back in 2007, immediately after his inauguration, Obama held a Medal of Satiiri Freedom Awards Ceremony. Nothing fantastic about that overall – the distinctive award is given to many people frequently and fictively – but there is one award recipient that stands out from the rest – the now deceased, prolific abuser, Jeffrey Epstein.", "But this item was not a factual recounting of real-life events. The article originated with a website that describes its output as being humorous or satirical in nature, as follows:", "Everything on this website is fiction. It is not a lie and it is not fake news because it is not real. If you believe that it is real, you should have your head examined. Any similarities between this site’s pure fantasy and actual people, places, and events are purely coincidental and all images should be considered altered and satirical. See above if you’re still having an issue with that satire thing.", "In addition to the disclaimer, the text of the Bustatroll article contains several clues about its fictitious nature. For instance, the award is referred to as the \"Medal of Satiiri Freedom\" which is \"frequently and fictively\" handed out.", "While Bustatroll.org carries a disclaimer labeling its content as fiction, the article's included image (shown at the top of this page) was circulated on social media removed from its fictional context. This is not a genuine photograph of Obama (who didn't take office until January 2009) awarding the Medal of Freedom to Jeffrey Epstein. This is a doctored image that was created from a photograph of Obama awarding the Medal of Freedom to President Bill Clinton in 2013:", "The genuine image of Obama and Clinton is available via Getty Images with the following caption:", "WASHINGTON, DC - NOVEMBER 20: U.S. President Barack Obama awards the Presidential Medal of Freedom to former U.S. President Bill Clinton in the East Room at the White House on November 20, 2013 in Washington, DC. The Presidential Medal of Freedom is the nation's highest civilian honor, presented to individuals who have made meritorious contributions to the security or national interests of the United States, to world peace, or to cultural or other significant public or private endeavors. (Photo by Win McNamee/Getty Images)", "This is not the first time that a false rumor has circulated about a persona non grata receiving the medal of freedom from Obama. In 2017, a false rumor circulated that Obama had given the prestigious award to movie mogul and convicted rapist Harvey Weinstein, former politician and convicted sex offender Anthony Weiner, and Bill Cosby, a comedian who was convicted of sexual assault.", "You can see a list of all of the people who were actually awarded the Medal of Freedom by Obama here.", "For background, here is why we sometimes write about satire/humor.", "Bustatroll.org.   \"On This Day In 2007, Obama Awarded Jeff Epstein The Medal of Freedom.\"\r\n    21 January 2020.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]