["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "On a number of occasions, President Donald Trump has touted the degree of confidence Americans have in the economy on his watch.", "He did so in his State of the Union address, when he said, \"Small business confidence is at an all-time high.\" We rated that True.", "But during a speech to the World Economic Forum in Davos, Switzerland, he offered a broader sweep.", "\"After years of stagnation, the United States is once again experiencing strong economic growth,\" Trump said on Jan. 26. \"The stock market is smashing one record after another, and has added more than $7 trillion in new wealth since my election. Consumer confidence, business confidence, and manufacturing confidence are the highest they have been in many decades.\"", "We looked at confidence measurements for each of those three areas to see if Trump has a point. Some of the measurements were suggested to us by the White House; others we found ourselves. Overall, we found that confidence is high, but there are times in recent history when it’s been higher.", "Consumer confidence", "There are two major, monthly surveys that measure consumer confidence — one by the Conference Board and one by the University of Michigan.", "Both show levels of consumer confidence that are high by historical standards, but they are not \"the highest they have been in many decades.\"", "Currently, the Conference Board’s Consumer Confidence Index is at 122.1. That’s higher than it ever was under President Barack Obama or President George W. Bush. However, it was higher between May 1997 and December 2000, the final three and a half years of President Bill Clinton’s presidency. Calling 17 years ago \"many decades\" ago is an exaggeration.", "The University of Michigan data shows a similar pattern. In the most recent month for which there is data, November 2017, the rating was 98.5. The last time the rating exceeded that level was a one-time blip in January 2004. Prior to that, the index exceeded today’s level for almost four years under Clinton, from February 1997 to November 2000. (It fell below today’s level for one month during that period, October 1998.)", "Business confidence", "The survey data of business confidence generally provides weaker evidence for Trump’s assertion.", "There are several major surveys of CEO confidence. One by the Conference Board was at 63 in the fourth quarter of 2017. The index under Obama equaled or exceeded that on five occasions.", "A different survey, by the Business Roundtable, had the CEO economic outlook index at 96.8 in the fourth quarter of 2017. But the index was higher in the fourth quarter of 2010 and the first two quarters of 2011.", "Another group, the Institute for Supply Management, surveys purchasing executives at some 300 companies on a monthly basis. The number for December was 59.7. The most recent time the index was that high was (briefly) in 2011, under Obama.", "Finally, YPO is an organization of 24,000 CEOs that publishes studies of business confidence around the world. The index exceeded the most recent rate under Trump nine times during Obama’s presidency. Here is the data for its survey of the United States since 2009:", "Manufacturing confidence", "This is the topic where Trump has the strongest argument. The current National Association of Manufacturers’ Outlook Survey is currently at its highest level since it was created in 1997.", "Our ruling", "Trump said, \"Consumer confidence, business confidence, and manufacturing confidence are the highest they have been in many decades.\"", "In general, all three types of economic confidence are at relatively high levels today. However, it’s a stretch to say that they are \"the highest they have been in many decades.\" Consumer confidence exceeded today’s level less than 20 years ago, and in several surveys, business confidence exceeded today’s level as recently as the Obama years.", "We rate the statement Half True.", "Donald Trump, remarks in Davos, Switzerland, Jan. 26, 2018", "Conference Board data courtesy of the Conference Board", "Federal Reserve Bank of St. Louis, \"University of Michigan: Consumer Sentiment,\" accessed July 31, 2017", "Business Roundtable, \"CEO Economic Outlook Survey,\" accessed Jan. 30, 2017", "National Federation of Independent Business, Small Business Optimism Index main page, accessed Jan. 30, 2018", "Institute for Supply Management, \"December 2017 Manufacturing ISM Report On Business,\" accessed Jan. 30, 2018", "YPO Global Pulse, survey results, accessed Jan. 30, 2018", "National Association of Manufacturers, outlook survey data, accessed Jan. 30, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]