["A photograph of a man desecrating an idol inside a temple has been shared with the claim that his name is Mohammad Ansari. One Avni Padeny’s June 24 post drew 25,000 shares as of this writing.", "A parody account of Republic TV anchor Arnab Goswami (@GoswamiArnabRpt) also tweeted the picture and later took it down.", "Alt News has received several fact-checks requests for the photograph on its official mobile application.", "The incident dates back to April 2020. A Twitter user has shared the same image on May 11 while writing, “Lodhi Gautam, son of Azad Gautam from Kardhna village of Mirzamurad police station area of ​​Varanasi has taken a photo of himself placing his feet on the temple of Dih Baba in Adampur village. Take appropriate action, Azad Gautam is also claiming that he is a member of Bhim army.”", "The Twitter handle of ADG Zone Varanasi replied to the tweet stating that the accused has been imprisoned by Varanasi police.", "उक्त प्रकरण में आरोपी के विरुद्ध @varanasipolice द्वारा आवश्यक विधिक कार्यवाही करते हुए आरोपी को जेल भेजा जा चुका है। @IgRangeVaranasi @Uppolice", "— ADG ZONE VARANASI (@adgzonevaranasi) May 11, 2020", "Varanasi police also replied to the user and wrote that a case was registered against the accused on April 24 and he has been arrested.", "उक्त प्रकरण के सन्दर्भ में दिनांक 24.04.2020 को ही थाना मिर्जामुराद पर अभियोग पंजीकृत कर गिरफ्तारी सुनिश्चित करते हुए आवश्यक विधिक कार्यवाही की जा चुकी है।", "— Varanasi Police (@varanasipolice) May 13, 2020", "According to a report published in Amar Ujala on April 24, Azad Kumar Gautam, a resident of Kardhana village in Varanasi, was arrested and sent to jail by Mirzamurad police for hurting religious sentiments. Gautam had also posted objectionable posts on Hindu gods on his Facebook profile.", "The report further said that inspector Sunil Dutt Dubey of Mirzamurad police station told Amar Ujala that Daroga Brijesh Singh arrested Gautam from his house on the basis of a complaint. A mobile phone was also recovered from him.", "Therefore, social media claim that ‘Mohammad Ansari’ was arrested for desecrating a Hindu idol is false. The man arrested was Azad Kumar Gautam.", "Donate Now", "Priyanka Jha specialises in monitoring and researching mis/disinformation at Alt News. She also manages the Alt News Hindi portal.", "A purported video of a Muslim man beating a temple priest with a bat is…", "A picture depicting the Pakistani flag apparently bigger in size and apparently placed higher than…", "Amid the ongoing war between Israel and Hamas, a video of a fleet of cars…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "A clip featuring Pakistan men’s Cricket team captain Babar Azam is viral on social media…"]