["About this rating", "In May and June 2019, a misleading but widely seen meme about immigrants and Medicare benefits continued to circulate on Facebook:", "Although the trope that undocumented immigrants are cashing in on U.S. government-funded public benefits for free is a common one, it's generally misleading.", "Contrary to what the meme asserts, undocumented persons do not qualify to receive Medicare. Additionally, because many undocumented persons acquire fake Social Security numbers so that they can work, they pay billions of dollars into the system but never reap those benefits, said Steven Wallace, professor of public health at the University of California, Los Angeles, and associate director of UCLA's Center for Health Policy Research.\n\"In reality, undocumented immigrants paying into these programs actually are helping to subsidize them,\" Wallace told us by phone. \"So it’s the other way around -- it’s not that they're draining the system. They're actually subsidizing it.\"\nThe impacts of immigration on the economy and public benefits are political flashpoints in a larger national debate. For example, in September 2017 the Trump administration was criticized for rejecting a study by the U.S. Department of Health and Human Services that concluded refugees have an overall positive effect on government revenue.\nA 2017 study conducted by the National Academies of Sciences, Engineering, and Medicine reported that immigration \"has an overall positive impact on the long-run economic growth in the U.S.” In the short term and on the local and state government levels, new immigrants do have a negative revenue impact largely due to costs associated with educating children, health care and law enforcement. But in the long term, they are a net positive on revenue due to higher incomes of their descendants who are “among the strongest fiscal and economic contributors in the U.S.”\nPBS News Hour reported that \"In general, more people working means more taxes — and that’s true overall with undocumented immigrants as well. Undocumented immigrants pay an estimated $11.6 billion a year in taxes, according to the Institute on Taxation & Economic Policy. Immigrants are also less likely to take public benefits than the native-born population for two reasons.\"\nThose two reasons, according to PBS, are that undocumented persons aren't eligible to receive federal public benefits, and many of the ones who are authorized to be here aren't eligible because they earn too much money.", "Contrary to what the meme asserts, undocumented persons do not qualify to receive Medicare. Additionally, because many undocumented persons acquire fake Social Security numbers so that they can work, they pay billions of dollars into the system but never reap those benefits, said Steven Wallace, professor of public health at the University of California, Los Angeles, and associate director of UCLA's Center for Health Policy Research.", "\"In reality, undocumented immigrants paying into these programs actually are helping to subsidize them,\" Wallace told us by phone. \"So it’s the other way around -- it’s not that they're draining the system. They're actually subsidizing it.\"", "The impacts of immigration on the economy and public benefits are political flashpoints in a larger national debate. For example, in September 2017 the Trump administration was criticized for rejecting a study by the U.S. Department of Health and Human Services that concluded refugees have an overall positive effect on government revenue.", "A 2017 study conducted by the National Academies of Sciences, Engineering, and Medicine reported that immigration \"has an overall positive impact on the long-run economic growth in the U.S.” In the short term and on the local and state government levels, new immigrants do have a negative revenue impact largely due to costs associated with educating children, health care and law enforcement. But in the long term, they are a net positive on revenue due to higher incomes of their descendants who are “among the strongest fiscal and economic contributors in the U.S.”", "PBS News Hour reported that \"In general, more people working means more taxes — and that’s true overall with undocumented immigrants as well. Undocumented immigrants pay an estimated $11.6 billion a year in taxes, according to the Institute on Taxation & Economic Policy. Immigrants are also less likely to take public benefits than the native-born population for two reasons.\"", "Those two reasons, according to PBS, are that undocumented persons aren't eligible to receive federal public benefits, and many of the ones who are authorized to be here aren't eligible because they earn too much money.", "Frazee, Gretchen.   \"4 Myths About How Immigrants Affect the U.S. Economy.\"\r\n    PBS News Hour.   2 November 2018.", "Hirschfeld Davis, Julie, and Somini Sengupta.  \"Trump Administration Rejects Study Showing Positive Impact of Refugees.\"\r\n    The New York Times.   18 September 2017.", "Congressional Budget Office.   \"The Impact of Unauthorized Immigrants on the Budgets of State and Local Governments.\"\r\n    December 2007.", "The National Academies of Sciences, Engineering, Medicine.   \"The Economic and Fiscal Consequences of Immigration.\"\r\n    2017.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]