["By Robert Farley", "Posted on June 27, 2017", "Sen. Rand Paul, who opposes the Republican Senate health care bill, says subsidies “are actually greater under the Republican bill than they are under the current Obamacare law.” But the nonpartisan Congressional Budget Office says the average subsidy under the bill would be “significantly lower than the average subsidy under current law.”", "In all, CBO estimates the government will save $424 billion over 10 years (compared with current law) due mainly to reductions in government subsidies.", "Paul’s comment came on ABC’s “This Week” on June 25, as he argued that the current version of the Senate health care bill, the Better Care Reconciliation Act, “looks just like Obamacare and still doesn’t fix the fundamental flaw of Obamacare.”", "Paul, June 25: But realize that this — just one second — realize that the Obamacare subsidies in this bill are actually greater under the Republican bill than they are under the current Obamacare law. That is not anywhere close to repeal.", "The Affordable Care Act, or Obamacare, subsidizes health insurance in two main ways: tax credits to cover a portion of the premiums for individuals who buy their own insurance, and cost-sharing subsidies paid to insurance companies to reduce out-of-pocket payments required under insurance policies.", "Tax credits to help people buy insurance would remain at the same levels as under the ACA until 2020. But over the long-term, the Senate plan would be less generous with tax credits than the ACA.", "Under the Senate bill, “the premium tax credits would be smaller in most cases than under current law,” the CBO says.", "The ACA provides tax credits to those earning between 100 percent and 400 percent of the federal poverty level. Under the Senate plan, tax credits would go to those earning from 0 percent to 350 percent of the poverty level.", "Also, the tax credit under the ACA is designed to cap what an individual would have to pay toward premiums, based on the cost of a benchmark plan. The Senate GOP bill would use a less expensive plan as the benchmark and adjust what individuals would pay out-of-pocket for premiums based on age for those earning above 150 percent of the federal poverty level.", "Someone earning between 300 percent and 350 percent of the federal poverty level, for example, would pay 6.4 percent of income for an insurance policy if he or she is 29 years old or younger. The required contributions then go up with age: 8.9 percent for 30- to 39-year-olds; 12.5 percent for 40- to 49-year-olds; 15.8 percent for 50- to 59-year-olds; and 16.2 percent for those over age 59. (Under the ACA, those at the poverty level contribute 2.4 percent of income in 2020, and those earning 400 percent of the poverty level would contribute 10.2 percent, according to projections from the Kaiser Family Foundation.)", "As for the cost-sharing subsidies available now under the ACA — which can lower out-of-pocket costs for copays and other expenses for those earning between 100 percent and 250 percent of the federal poverty level — those would be eliminated under the Senate bill in 2020.", "According to CBO, while individual cases would vary, “the average subsidy per subsidized enrollee under this legislation would be significantly lower than the average subsidy under current law.”", "CBO, June 26: According to CBO and [the Joint Committee on Taxation’s] estimates, the average subsidy per subsidized enrollee under this legislation would be significantly lower than the average subsidy under current law, starting in calendar year 2020. Nevertheless, some people would be eligible for larger subsidies than those under current law, whereas others would be eligible for smaller ones.", "In all, CBO estimates the government will save $424 billion over 10 years (compared with current law) due mainly to reductions in tax credits for premium assistance starting in 2020 and from eliminating cost-sharing subsidies. Those savings would be partially offset, CBO says, by “an increase in spending of $107 billion for short-term assistance to insurers to address disrupted coverage and access and to provide support for states through the Long-Term State Stability and Innovation Program.”", "Indeed, the amount of subsidies provided in the Senate bill is less than what was proposed in the Republican health care bill that passed in the House.", "CBO, June 26: The structure of subsidies for coverage in the nongroup market differs in the two versions of the legislation and would have substantially different effects by income and by age. The overall spending on such subsidies under this legislation would be $134 billion lower than under the House-passed legislation.", "So why does Paul say that subsidies “are actually greater under the Republican bill than they are under the current Obamacare law”?", "Paul’s reasoning hinges on a legal debate over the cost-sharing payments currently being paid to insurers to offset the costs for millions of low-income Americans. The subsidies are critical to the success of the Affordable Care Act, as insurers have threatened to pull out of the ACA marketplaces or dramatically increase rates if the subsidies are cut off.", "A lawsuit filed by the Republican-controlled House of Representatives in November 2014 contended that funding for cost-sharing subsidies was never appropriated by Congress, and that government payment of those subsidies violated the Constitution and amounted to “unlawful transfer of funds,” as the New York Times put it.", "A federal district court judge last year sided with the House. But the judge stayed her decision to allow the government to appeal. In May, the Trump administration asked for a three-month delay in the appeal case, leaving the issue in limbo.", "In theory, President Trump could drop the appeal and stop making the subsidy payments. In fact, he has said he could end them “anytime I want.” But so far, he hasn’t. The payments have continued as the case is under appeal.", "So are those subsidy payments part of the Affordable Care Act? Paul argues they are not. And since the Republican bill would specifically sunset those payments at the end of 2019, Paul’s argument is that the Republican plan amounts to additional funding beyond what is contained in the Affordable Care Act.", "“The proposed new bill funds a piece of Obamacare that is currently not funded, the cost sharing subsidies which got blocked by a court,” Sergio Gor, a spokesman for Paul told us via email.", "Gor further points out that “according to CBO, the ACA tax credits will cost $156 billion in 2017, 2018, 2019. We do not make any changes to these credits in the first 3 years.”", "On this point, Paul is taking a short-term (three-year) view and ignoring the long-term implications of the Senate bill, which would cut tax credits after three years.", "Paul’s comment suggests subsidies would be more generous under the Senate health care plan than those currently offered by the Affordable Care Act. That assumes that the cost-sharing subsidies, which have been regularly paid, are not a part of the ACA. On the tax credit side, it is a short-term comment that ignores that tax credits will be reduced significantly after the first three years.", "FactCheck.org Rating:", "Read More", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]