["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Senate Finance Committee member Sen. Pat Toomey (R-PA) questions Federal Internal Revenue Service Commissioner Charles Rettig during a hearing in the Dirksen Senate Office Building on Capitol Hill April 10, 2019 in Washington, DC. (Chip Somodevilla/Getty", "Last weekend, U.S. Sen. Pat Toomey recorded a message about how to stop the spread of the coronavirus and posted it on Twitter. His message was simple and direct – start wearing a homemade mask when you leave the house.", "\"My mask will keep someone else safe and their mask will keep me safe,\" said Toomey, a Republican from the Lehigh Valley. \"I’m not suggesting this is any kind of guarantee. It probably doesn’t have tremendous value for the person wearing the mask but it probably does significantly reduce the risk that people could inadvertently transmit it.\"", "Since masks for health care workers are in such short supply, we wondered whether Toomey’s claim is true.", "For weeks, public health officials advised healthy Americans not to wear masks. But on Friday, President Donald Trump announced that the guidance had changed. The Centers for Disease Control and Prevention is now urging everyone to wear homemade cloth masks when they leave the house, just as Toomey called for a week ago. He was the first member of Congress to advocate for the shift.", "But even as Trump announced the new rules, he said he didn’t plan to follow them himself.", "\"It’s voluntary so you don’t have to do it,\" Trump said at Friday’s daily coronavirus briefing. \"They suggest it for a period of time. I don’t think I’m going to be doing it.\"", "Trump said the guidance shifted because research indicates that people who are infected with the coronavirus but aren’t showing any symptoms can still transmit the disease. He also reiterated that wearing homemade masks is not a replacement for other strategies such as social distancing and hand-washing.", "\"We want to make sure everybody understands it’s not a substitute for the presidential guidelines that have already gone out,\" Deborah Birx, coordinator of the White House coronavirus task force, said Thursday.", "Toomey got another thing right. Homemade masks are significantly more effective at preventing asymptomatic carriers of the virus from accidentally spreading it than they are at shielding a healthy person from contracting it. And the efficacy of any homemade mask depends on how it’s made.", "The most effective homemade masks are made of thick cloth and make a tight seal around the wearer’s face.", "\"Given the current crisis, and lacking an alternative, many layers of densely woven fabric would be the most effective, because it allows for lots of voids in the layers where particles can be trapped,\" Richard Peltier, an assistant professor of environmental health sciences at the University of Massachusetts-Amherst, told us by email. \"The mask needs to seal as tightly as possible to the face to avoid leaks, though this may not be possible with different designs, fabrics, or face shapes. Thin or porous fabrics are the least likely to be effective.\"", "A study published in October 2010 tested how cloth masks and common fabrics fared when sprayed with aerosols at different speeds. All of the materials performed worse than hospital-grade N95 respirators. But some, such as cotton towels and scarves, were in the range of some surgical masks. The authors cautioned that fabric materials \"show only marginal filtration performance against virus-size particles when sealed around the edges.\"", "Another study from 2013 found that cotton masks only perform about half as well as surgical masks and \"should only be considered as a last resort to prevent droplet transmission from infected individuals.\" More recent research had similar results.", "So at best, using thick or layered fabric to make a homemade mask could be as effective as using some surgical masks. At worst, it prevents at least some of your respiratory droplets from spreading to others while in public.", "Under ideal circumstances, no face masks are intended to be worn for more than one encounter. That guidance also extends to homemade masks.", "\"At the end of the day, these cloth masks should be treated as contaminated materials that you bring in to your home — they need to be laundered in hot soapy water, and you’d need to consider sanitizing in bleach or hydrogen peroxide regularly,\" Peltier said.", "Toomey’s claim that his homemade mask would keep someone else safe and that someone else’s homemade mask would keep him safe matches the latest guidance from the CDC. We rate this statement True.", "The Annals of Occupational Hygiene, \"Simple Respiratory Protection—Evaluation of the Filtration Performance of Cloth Masks and Common Fabric Materials Against 20–1000 nm Size Particles,\" October 2010", "Centers for Disease Control and Prevention, Coronavirus Disease 2019 (COVID-19): Frequently Asked Questions about Personal Protective Equipment, accessed March 31, 2020", "Centers for Disease Control and Prevention, Coronavirus Disease 2019 (COVID-19): How Coronavirus Spreads, accessed April 1, 2020", "Centers for Disease Control and Prevention, Coronavirus Disease 2019 (COVID-19): How to Protect Yourself, accessed March 31, 2020", "Centers for Disease Control and Prevention, Coronavirus Disease 2019 (COVID-19): Strategies for Optimizing the Supply of Facemasks, accessed March 31, 2020", "Centers for Disease Control and Prevention, Coronavirus Disease 2019 (COVID-19): Symptoms of Coronavirus, accessed March 31, 2020", "Centers for Disease Control and Prevention, Infographic - Understanding the Difference, Surgical Mask, N95 Respirator, accessed March 31, 2020", "Centers for Disease Control and Prevention, NIOSH-Approved N95 Particulate Filtering Facepiece Respirators, accessed March 31, 2020", "Centers for Disease Control and Prevention, Surgical N95 Respirators, accessed March 31, 2020", "Consumer Reports, \"Do You Need a Mask to Prevent Coronavirus?\" March 25, 2020", "Disaster Medicine and Public Health Preparedness, \"Testing the Efficacy of Homemade Masks: Would They Protect in an Influenza Pandemic?\" August 2013", "Email interview with Richard Peltier, assistant professor of environmental health sciences at the University of Massachusetts-Amherst, March 31, 2020", "Journal of Exposure Science & Environmental Epidemiology, \"Evaluating the efficacy of cloth facemasks in reducing particulate matter exposure,\" Aug. 17, 2016", "Los Angeles Times, \"CDC recommends wearing face masks during the coronavirus pandemic,\" April 3, 2020", "NPR, \"COVID-19 Has Caused A Shortage Of Face Masks. But They're Surprisingly Hard To Make,\" March 16, 2020", "The Philadelphia Inquirer, \"People should wear a cloth mask or facial covering when in public, new CDC guidance to say,\" April 2, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]