["“An Australian woman gave birth to twins and there father is a south Sudanese (sic),” reads one Facebook post from December 15, 2020.", "Included in the post is an image of a white woman nursing two black babies.", "The same image appears in another post with a similar claim that reads: “White/ Australian woman married to South Sudanese man, gave birth to darkest twin ever”.", "The claims, however, are false.", "The woman in the picture is not Australian, nor is there any evidence that she is married to a South Sudanese man. The babies are not hers either.", "A reverse image search on Google reveals that the woman is Vanessa Beecroft, an Italian performance artist. According to reports (here and here), Beecroft posed for the picture during a film she was shooting titled: “The Art Star and the Sudanese Twins”.", "The film follows the artist’s attempt to adopt orphaned Sudanese twins who she met and breastfed during her 2006 trip to Sudan, five years before the country split and the south gained independence. However, the adoption did not go through.", "Beecroft's work with the twins attracted controversy, and in 2009 she said she received death threats after being accused of exploiting the children. The photograph was exhibited again in 2015 at a German museum exhibition about representations of the concept of charity.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]