["Democratic presidential candidate Marianne Williamson. (2017 AP file photo)", "Self-help author and Oprah Winfrey confidante Marianne Williamson is one of the many Democrats running for president in 2020. She was asked recently on MSNBC’s \"Morning Joe\" about defense issues. Co-host Willie Geist wanted to know about Williamson’s ability to be commander-in-chief and how she would change the direction of the two-decade U.S. war in Afghanistan.", "In responding, the 66-year-old Californian made a claim we want to fact-check.", "\"For every dollar we spend on actual peace creation,\" she said, \"we spend over $1,000 on ways to prepare for war.\"", "Williamson has also made the claim on the campaign trail in New Hampshire and on Twitter.", "U.S. military spending, of course, is quantifiable  — although people can argue over how much of that is preparing for war, as Williamson put it.", "Maybe even more difficult: How do you count what the nation spends on \"peace creation\"?", "\"My sense is that it is an absolutely true AND absolutely indefensible statement,\" said David Hooker, a professor at the Kroc Institute for International Peace Studies at the University of Notre Dame.", "\"The facts will be easy to assemble depending on what are the types of expenses we identify as specifically preparing for peace or preparing for war ... . Facts and truth, in this instance, are not the same category of material.\"", "Other experts agree that the spending ratio can vary wildly, depending on what you consider to be part of peace or part of war. At the same time, it’s clear the nation spends much less on peace-building.", "What the Williamson campaign sent us to back up the candidate’s statement is essentially just another claim  — and it applies to world spending, not U.S. spending. That claim, made in 2011 by the Friends Committee on National Legislation, an anti-war lobby in Washington, D.C., is that the world spends $1 on conflict prevention for every $1,885 spent on military budgets.", "Theo Sitther, a staff member at the committee, told us he doesn’t know how the two figures were calculated. But he said Williamson’s overall point is \"sound,\" given studies that he said indicate that every $1 spent on conflict resolution saves the world $16 on the costs of conflict.", "We found several other different ways to look at the numbers. All have limitations.", "We'll start by acknowledging that U.S. spending on its military is, indeed, huge.", "In its latest annual report on global military spending, the Stockholm International Peace Research Institute said U.S. military spending was $610 billion in 2017. That was the same amount as in 2016  — but more than the next seven highest-spending countries combined. The institute does not track peace spending, however.", "Charles Kenny, a senior fellow at the Center for Global Development in Washington, pointed out to us that the $610 billion is more than 2,000 times larger than the $299 million the United States spent in 2016 on \"civilian peacebuilding, conflict prevention and resolution,\" according to a 2018 report. That report was done by the European Centre for Development Policy Management, which describes itself as a \"think tank that wants to make policies in Europe and Africa work for inclusive and sustainable development.\"", "But Kenny agreed the devil is in the details.", "\"Given the link between poverty and civil conflict, one might argue that any spending that encourages development is helping to build peace. Similarly, U.S. Defense Department expenditures on logistics capacity, in particular, is really important to supporting a bunch of peacekeeping operations,\" he said.", "\"On the other hand, effective subsidy of munitions going to help Saudi Arabia bomb Yemen, and U.S. Air Force assistance in refueling Saudi bombers, are not so good for peace, and I wouldn’t call that spending ‘preparing for war’ as much as fueling war.\"", "Caroline Hughes, chair of peace studies at Notre Dame, said another comparison is starting with U.S. military spending, which is pegged at $989 billion for the 2019-’20 fiscal year -- if you count the base budget of the Defense Department, contingency operations overseas to fight the Islamic State and other funding, including certain funds for the departments of State, Veterans Affairs and Homeland Security. That amount is nearly 1,000 times more than the $1.8 billion in contributions the United States made to United Nations peacekeeping operations in 2017-’18. But Hughes  — who said \"you could debate endlessly the precise list of activities that you wanted to include on either list\"  — acknowledged: \"You could, of course, challenge this as a fairly crude metric.\"", "When Todd Harrison, director of defense budget analysis at the Center for Strategic and International Studies in Washington, responded to our inquiry about Williamson’s claim, he found a much smaller ratio.", "Citing figures from the White House’s Office of Management and Budget, Harrison said that in fsical 2019, the United States is spending $726 billion on national defense (including discretionary and mandatory spending) -- a little less than 10 times the $75 billion being spent on diplomacy and international relations. But he acknowledged that \"peace creation\" could be defined more narrowly, which would make for a larger ratio.", "Meanwhile, Taxpayers for Common Sense vice president Steve Ellis, a federal budget expert in Washington, told us there is simply too much vagueness in Williamson’s statement.", "\"What is ‘peace creation’ in the budget? Is it diplomacy? Foreign aid?\" he asked. \"Some would argue nuclear deterrence is ‘peace creation’ – and what is ‘prepare for war’ in the budget? Is that the entire Department of Defense budget?\"", "Ellis added: \"Much more is spent on the military than on diplomacy and aid,\" but \"I don’t see how you get to the $1,000.\"", "Williamson said: \"For every dollar we spend on actual peace creation, we spend over $1,000 on ways to prepare for war.\"", "Experts told us that  — depending on how you define the vague terms of peace creation and preparing for war  — it’s possible to show a ratio that large in federal spending. But other calculations put the ratio well below 1,000 to 1. Williamson’s comment suggests a precision that doesn’t exist.", "We rate the statement Half True.", "MSNBC, Marianne Williamson interview (2:30), April 4, 2019", "Email, Marianne Williamson campaign spokeswoman Patricia Ewing, April 10, 2019", "Email, Todd Harrison, director of defense budget analysis at the Center for Strategic and International Studies, April 10, 2019", "Interview, American Action Forum director of fiscal policy Gordon Gray, April 11, 2019", "Email, Taxpayers for Common Sense vice president Steve Ellis, April 10, 2019", "Email, Charles Kenny, senior fellow and director of technology and development at the Center for Global Development in Washington, D.C., April 10, 2019", "Email, Theo Sitther, legislative secretary for peacebuilding policy at the Friends Committee on National Legislation, April 11, 2019", "The Hill, \"Prevention is cheaper than cure,\" Nov. 4, 2011", "United Nations Peacekeeping, \"How we are funded,\" accessed April 11, 2019", "Friends Committee on National Legislation, \"60:1  — Preventing war is 60 times cheaper than fighting it\"", "Inter Press Service, \"$1.7 Trillion Global Spending on Military in 2017: Highest since End of Cold War,\" May 22, 2018", "Stockholm International Peace Research Institute, \"Global military spending remains high at $1.7 trillion,\" May 2, 2018", "The Balance, \"US Military Budget, Its Components, Challenges, and Growth,\" April 3, 2019", "PolitiFact North Carolina, \"Bernie Sanders says US military spending is bigger than the next 12 nations combined,\" April 19, 2018", "European Centre for Development Policy Management, \"Supporting peacebuilding in times of change,\" September 2018", "Email, Stockholm International Peace Research Institute spokeswoman Stephanie Blenckner, April 10, 2019", "Email, Kevin Avruch, professor of anthropology and conflict resolution and dean of the George Mason University School for Conflict Analysis and Resolution, April 10, 2019", "Email, David Hooker, associate professor of the practice of conflict transformation and peacebuilding and faculty member of the Kroc Institute for International Peace Studies at the University of Notre Dame, April 10, 2019", "Email, Rachel Stohl, managing director of the Stimson Center, a military and defense think tank in Washington, D.C., April 11, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]