["About this rating", "At least 45 COVID-19 testing laboratories in Florida failed to report negative test results between March and July 2020, thus inaccurate positive testing rates were recorded for those facilities. However, more than 300 Florida labs did report negative results in that time frame.", "Although health officials said that all laboratories are required to report both positive and negative test results, testing facilities that Snopes spoke with said that among other discrepancies in reporting requirements, the Florida Department of Health did not previously require negative test results to be reported. Snopes did not find evidence that the omission of negative results data in a minority of Florida labs' reporting was intentional or nefarious.", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "In July 2020, social media posts and news reports claimed that Florida labs were intentionally tampering with data by failing to report negative COVID-19 test results, making the coronavirus pandemic appear much worse in the southern state.", "The claims followed an investigation conducted by Orlando affiliate station Fox 35, which analyzed COVID-19 testing and case data collected between March 16, 2020, when testing began, and July 13, 2020, by the Florida Department of Health (DOH). Of the hundreds of labs analyzed, many were shown to have reported very high positivity rates for COVID-19. The accusations of tampering came as many health officials and local leaders came under criticism for their handling of the coronavirus pandemic and testing responses.", "Snopes dug through the 49-page report line-by-line and found that at least 45 laboratories that tested for COVID-19 did not report negative test results between March and July 2020 and instead showed 100% positivity, while dozens of others reported 90% positivity and higher. More than 300 labs did report negative test results, clocking percentage rates much lower than 100%. The table below shows labs that tested 40 or more people and reported 100% positivity, and failed to report negative test results:", "Source: Florida Department of Health", "Public and private testing facilities are required to report their results to the DOH, which then releases a daily report covering surveillance data for every county in the state. DOH confirmed to Snopes that a number of testing labs did not report negative test results and issued the following statement in an email sent July 15, 2020:", "All COVID-19 cases are confirmed through diagnostic and antigen testing and then reported to the state by the labs performing the testing. Private and public laboratories are required to report positive and negative test results to the state immediately.", "In recent days, the Florida Department of Health noticed that some smaller, private labs weren’t reporting negative test result data to the state. The Department immediately began working with those labs to ensure that all results were being reported in order to provide comprehensive and transparent data.", "As the state continues to receive results from various labs, the Department will continue educating these labs on proper protocol for reporting COVID-19 test results.", "The department did not respond to follow-up questions about whether this lack of reporting could have skewed data on total case counts. It is not yet determined why these smaller labs did not report negative cases, and the department did not answer approximately how many negative test results were unreported. We will provide an update once these questions are answered.", "Labs Snopes spoke to claimed there were discrepancies and changes in DOH's data reporting requirements. In an email sent to Snopes, Pancare of Florida President R. Michael Hill said that the DOH “misdirected their data collection process as an inaccuracy on PanCare’s part.” The testing lab said that it uses three methods for testing including one that detects viral antigens, which the DOH reportedly said it would not include “into the county or state numbers.”", "On July 1, DOH implemented an update to its electronic reporting process to “report all patient-specific results” daily and began integrating previously reported data from PanCare as of July 16. Lab24 in Miami confirmed this statement when it told the Orlando Sun-Sentinel that it had tested around 10,000 people in Florida but that the state required that private labs only notify health officials of positive results. Snopes contacted Lab24 but did not receive a response at the time of publication.", "“In short, yes the COVID-19 data for the State of Florida is skewed, PanCare has conducted over 6,900 antibody tests, and over 16,000 antigen tests that have not been accurately reported by the Florida Department of Health because they refused to accept the results of both of these FDA-EUA approved tests at the time they were administered,” wrote Hill.", "Lee Memorial Hospital Lab told Snopes that it had accurately reported both negative and positive test results but that a hospital can have more than one entry in the DOH database. For example, results from Lee Memorial Hospital and Lee Memorial Hospital Lab come from the same testing facility yet each reported different rates. Lee Memorial Hospital reported an 18% positivity rate of 2,925 tests conducted while Lee Memorial Hospital Lab reported 100% positivity of 405 COVID-19 tests conducted. When combined, the overall positive results from the two hospitals were between 15 and 25%.", "“All positive results are immediately faxed to the department. This allows the Department of Health to start their contact trace investigation as quickly as possible,\" wrote Lee Health Communications Supervisor Jonathon Little in an email. \"All results, both positive and negative, are sent electronically each day. The department removes duplicate tests to ensure no results are counted twice.\"", "Florida Gov. Ron DeSantis did not respond to our requests for comment and a staffer instead deferred to the DOH via email.", "Accurate reporting of both negative and positive rates informs local outbreak guidance and can be used to indicate community spread, according to the Centers for Disease Control and Prevention (CDC). The Johns Hopkins University of Medicine notes that the rate of positivity provides insight into whether a community is doing enough testing; higher rates indicate only the sickest are being tested while lower positivity suggests that a community may be including asymptomatic patients or those with milder symptoms in its testing. Testing is limited and, in many places, only provided to patients who are symptomatic. Researchers with the Oregon State University attempted to combat this form of selection bias -- whereby only the sickest patients are tested for the SARS-CoV-2 infection – through its TRACE-COVID-19 project testing all members of a given community. Preliminary results suggest that about 1-in-1,000 people test positive for the virus, or about .1 percent of the population.", "The DOH COVID-19 Data and Surveillance Dashboard reported that as of July 20, more than 3 million people in Florida have been tested with about 11.7% overall positive across the state. The target range is below 10%.", "Misreporting negative tests does not change the number of total cases diagnosed, those that are currently active, or the number of deaths related to COVID-19. As of July 20, nearly 356,000 Florida residents had tested positive for the virus. At least 5,072 people in Florida have died in relation to COVID-19.", "Swan, Kristin.   \"Several Florida Labs Wrongly Report 100% of COVID-19 Tests Positive.\"\r\n    The Kingdom Insider.   15 July 2020.", "\"COVID-19: Summary of Persons Being Monitored, Persons Tested, and Cases.\"\r\n    Florida Department of Health.   14 July 2020.", "Guaderrama, Robert.   \"FOX 35 Investigates: Florida Department of Health Says Some Labs Have Not Reported Negative COVID-19 Results.\"\r\n    FOX 35 Orlando.   14 July 2020.", "Goodman, Cindy Krischer.   \"Florida Changes COVID Reporting Requirements, Saying Labs Did Not Share Negative Results.\"\r\n    Sun-Sentinel.   15 July 2020.", "Centers for Disease Control and Prevention.   \"Coronavirus Disease 2019 Frequently Asked Questions.\"\r\n    15 July 2020.", "Johns Hopkins University of Medicine, Coronavirus Resource Center .   \"Daily State-by-State Testing Trends.\"\r\n    20 July 2020.", "Madison Dapcevich is a freelance contributor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]