["By Angelo Fichera", "Posted on October 29, 2019", "There’s no evidence for social media claims that the children of Nancy Pelosi, Mitt Romney and John Kerry are working for “Ukrainian gas companies” or sitting “on the board of directors for energy companies doing business in Ukraine.”", "It’s correct that former Vice President Joe Biden’s son, Hunter, once had a lucrative job sitting on the board for the Ukrainian gas company Burisma. That fact — which has fueled false claims by President Donald Trump — was alluded to in a phone call between Trump and Ukrainian President Volodymyr Zelensky that has helped spur a House impeachment inquiry into Trump.", "But social media posts have applied what we know about Hunter Biden’s position and claimed, without evidence, that the children of other high-profile political figures hold similar roles.", "Some viral posts claim that “Biden’s son, Romney’s son, Pelosi’s son, Kerry’s son are all on the board of directors for energy companies doing business in Ukraine.” Other posts declare that “Biden, Pelosi, Kerry, & Romney all have children working for Ukrainian gas companies.” (The same posts also repeat the false claim that “from 1999-2014, Ukraine donated more money to the Clinton Foundation than any other foreign country.”)", "We could find no evidence to support the assertion that children of House Speaker Nancy Pelosi, former Secretary of State John Kerry or Sen. Mitt Romney work for any energy companies based in, or doing business in, Ukraine.", "Paul Pelosi Jr.", "Claims about Pelosi’s son, Paul Pelosi Jr., allegedly doing business in Ukraine gained steam earlier this month because of a video from a 2010 XPRIZE Foundation event in Washington, D.C., in which he discusses sitting on the board of a company called Viscoil — which billed itself as developing energy technologies. (The video also includes footage of Nancy Pelosi speaking at the event.) But Viscoil was based in California — not in Ukraine — state records dating back to 2009 show.", "A reporter who writes for websites including the conservative-leaning Epoch Times shared the 2010 video of Paul Pelosi on Twitter, which established Pelosi’s connection to Viscoil; the video was uploaded in 2013 by a Singapore-based company called NRGLab.", "The reporter, Patrick Howley, then pointed to another video also posted on the same day in 2013 by NRGLab — another promotional video about Viscoil — whose caption claimed that Ukrainian-born singer “Mika Newton helped to secure the rights to build a plant for the production of SH-boxes in Ukraine.”", "“Paul Pelosi Jr. briefly worked for a company named Viscoil Group. The company was based in Southern California and focused solely on U.S. business. The company dissolved in 2010 and was an LLC registered in California,” Drew Hammill, a spokesman for Nancy Pelosi, said in an email statement to FactCheck.org. “The company later reorganized under a different name, but Paul Pelosi Jr. played no role in the new entity.”", "Hammill confirmed the new entity was NRGLab. Inquiries to the company were not answered; it appears the company is now focused on manufacturing supplements.", "So, in short, we know Pelosi worked for a company whose successor posted a video to YouTube in 2013 — after Hammill says Pelosi left — claiming that it was going to produce a product in Ukraine. But it does not appear that “SH-boxes,” which were described by NRGLab as efficient generators, are even in production. And a woman who promoted the SH-Boxes told the fact-checking website Snopes that: “Project SH-Boxed were sold a long time ago to a private company in SEAsia. There was no involvement of Paul Pelosi in that project.”", "Pelosi did visit Ukraine in 2017 — as another video shows — in which he said in an interview he was visiting on behalf of an organization he was running called the Corporate Governance Initiative (he served as executive director). Hammill told us the visit was “a vacation at personal expense.” It’s unclear if the Corporate Governance Initiative — a company registered in Arizona with a stated purpose of helping organizations develop structures and policies — is still active. Attempts to contact it were unsuccessful.", "We searched for any news reports or online stories in the decade predating October 2019 — when conservative websites began publishing stories citing Howley’s aforementioned tweets — that linked Pelosi to any energy-related business dealings in Ukraine; we instead only found some references to his 2017 visit.", "By contrast, the Associated Press reported on Hunter Biden’s job with Burisma when he was hired in 2014.", "Kerry Family", "Kerry has two grown daughters, Vanessa (a doctor and CEO of a global health nonprofit company) and Alexandra (a film director). He also has three stepsons: Henry John Heinz IV (who reportedly studied to become a blacksmith and founded a school in Pennsylvania), André Heinz (who co-founded a private equity management firm focused on “cleantech”) and Christopher Heinz (a former senior vice president at PNC Bank).", "We found no evidence that any of them sat on a board for any “energy companies doing business in Ukraine.”", "This claim may be a distortion of Christopher Heinz’s connection to Hunter Biden (who, as we said, did sit on the board of Burisma).", "Heinz reportedly had started an investment firm with Hunter Biden and a fellow Yale graduate, Devon Archer. But Heinz “ended his business relationship” with the two because he believed “joining the board of Burisma Holdings was a bad idea,” according to the Washington Post, which cited a spokesman for Heinz.", "That spokesman confirmed the same to FactCheck.org and called the viral social posts “totally inaccurate.”", "“Mr. Heinz has never been on the board of any energy company; nor has he ever traveled to or worked in Ukraine,” Chris Bastardi said in an email. “Chris was never involved with Burisma in any way.”", "Romney Sons", "Romney, meanwhile, has five sons. Tagg Romney is co-founder of the investment firm Solamere Capital. Matt Romney is a partner and managing director for capital markets at a firm called Sundance Bay — which also lists Craig Romney, the youngest son, as director of asset management. Josh Romney is chairman and owner of mortgage lender Intercap Lending. Ben Romney is a radiologist in Utah, according to his LinkedIn profile.", "We could find no evidence to support the idea that any of the Romney sons sit on the board of energy companies doing business in Ukraine. A spokeswoman for the senator declined to comment on what she deemed “fake news from random online trolls.”", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "Bastardi, Chris. Spokesman, Christopher Heinz. Email to FactCheck.org. 24 Oct 2019.", "Corporate Governance Initiative. Corpgovinit.com. Archived 8 Feb 2018.", "Grimaldi, James and Rebecca Ballhaus. “Clinton Charity Tapped Foreign Friends.” Wall Street Journal. 19 Mar 2015.", "Hammill, Drew. Spokesman, House Speaker Nancy Pelosi. Email to FactCheck.org. 23 Oct 2019.", "Johnson, Liz. Spokeswoman, Sen. Mitt Romney. Email to FactCheck.org. 25 Oct 2019.", "Kiely, Eugene. “Trump Twists Facts on Biden and Ukraine.” FactCheck.org. 24 Sep 2019.", "Sonne, Paul, et. al. “The gas tycoon and the vice president’s son: The story of Hunter Biden’s foray into Ukraine.” Washington Post. 28 Sep 2019.", "Viscoil Holdings LLC. Viscoil.com. Archived 18 Sep 2010.", "Viscoil Holdings LLC – Limited Liability Company Articles of Organization. California Secretary of State. 4 Nov 2009.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]