["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Philadelphia election workers scan in ballots for the general election, at the Pennsylvania Convention Center, Tuesday, Nov. 3, 2020, in Philadelphia. (AP)", "The person in the image is an election worker transporting the ballots in Philadelphia as part of their official duties.", "Social media posts falsely suggest that there was something improper about a ballot box being emptied in Philadelphia on Election Day.", "\"A new photo image shows what appears to be an official ballot box being taken away from a polling location by an unidentified civilian,\" a story by the website 100percentfedup.com said.", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The article highlights a tweet by the Philadelphia Republican Party shortly after 5 p.m. Election Day Nov. 3:", "\"New picture from the field: an official ballot box being taken away by an unidentified civilian. What’s going on here?\" Twitter attached a warning to the tweet that: \"some or all of the content shared in this Tweet is disputed and might be misleading about an election or other civic process.\"", "There is no evidence that the person was wrongly handling the ballots. The person in the photo is an election worker transporting the ballots as part of their official duties, Jane Roh, a spokesperson for Philadelphia District Attorney Larry Krasner, told PolitiFact in a text. Election workers don’t wear uniforms.", "We heard the same explanation from Kevin Feeley, a spokesperson for Philadelphia City Commissioners, the board in charge of the city’s elections. The election worker was transporting the ballots to the Convention Center where they are being processed.", "\"It was full, and he brought it into (the) convention center where it was secured,\" Feeley said. \"Despite the allegation that he was some civilian walking off with the box, he is a city employee.\"", "Pennsylvania continued to count ballots the morning after Election Day. The battleground state has been a target of misinformation about the integrity of the election.", "The Facebook post stated that an image shows \"what appears to be an official ballot box being taken away from a polling location by an unidentified civilian.\"", "The post raises suspicion about the person handling the ballots. In reality, the person in the image was an authorized election official transporting the ballots to the Convention Center for processing.", "We rate this statement False.", "100percentfedup.com, BREAKING: Philly GOP Releases Photo Of An Official Ballot Box Allegedly Being Taken Away By An Unidentified Civilian, Nov. 3, 2020", "Text messages exchanged with Jane Roh, spokesperson for Office of District Attorney Larry Krasner, Nov. 4, 2020", "Telephone interview, Kevin Feeley, spokesperson for Philadelphia City Commissioners, Nov. 4, 2020", "AP, Photo shows Philadelphia election official with box of ballots, Nov. 4, 2020", "LeadStories, Fact Check: Photograph IS Of An Official Ballot Box In Philadelphia And A City Employee Is Taking The Mail-In Ballots To Be Processed And Counted, Nov. 3, 2020", "Philadelphia Mayor Jim Kenney, An open letter to Philadelphians about our city’s election, Nov. 2, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]