["About this rating", "Poll results shared on the condition of anonymity with the political news site Axios showed a total of \"1,003 likely general-election voters who are white and have two years or less of college education\" had unfavorable views of Reps. Omar and Ocasio-Cortez. The results indicated Omar polled at 9 percent (not 8 percent) and AOC at 21 percent.", "We know of no credible polls that show Ocasio-Cortez or Omar have such low approval ratings now in their respective districts or in their overall popularity in the country.", "We don't know who conducted the survey, who sponsored it, how the questions were worded, or the survey's methodology.", "On July 16, 2019, U.S. President Donald Trump took to Twitter to defend himself against widespread criticism that a previous Twitter tirade, in which he called on four non-white freshman congresswomen to \"go back\" to their respective countries, was racist. In so doing, he leveled further criticism against the four progressive Democrats, who have been dubbed \"the Squad.\"", "In the tweet, Trump reiterated his opinion that U.S. Reps. Alexandria Ocasio-Cortez, D-N.Y., Ilhan Omar, D-Minn., Ayanna Pressley, D-Mass., and Rashida Tlaib, D-Mich., \"hate our country.\" He also cited some poll numbers to make the case that his sentiments were in line with popular opinion. \"Omar is polling at 8%, Cortez at 21%\" he wrote.", ".... Congresswomen, who I truly believe, based on their actions, hate our Country. Get a list of the HORRIBLE things they have said. Omar is polling at 8%, Cortez at 21%. Nancy Pelosi tried to push them away, but now they are forever wedded to the Democrat Party. See you in 2020!", "— Donald J. Trump (@realDonaldTrump) July 16, 2019", "The poll numbers Trump quoted were initially made public by the Beltway news site Axios. And Trump was wrong on Omar's polling result, which was 9 percent, not 8 percent according to Axios. But even then, to claim that the figures are representative of either Omar's or Ocasio-Cortez's approval in the districts they represent, or of their popularity among the nation's general population, would be misleading.", "For starters, little publicly available information about the poll exists to assess its reliability. According to Axios, the group that conducted it shared the results with the publication on the condition of anonymity because it \"has to work with all parts of the [Democratic] party.\" Aside from lacking such basic information as who conducted the survey and who sponsored it, also absent are key details, like the wording of the questions and the methodology.\nFurthermore, as Axios reported, the survey only tapped a narrow slice of the public: \"1,003 likely general-election voters who are white and have two years or less of college education.\" It was being shared by \"influential Democrats\" who are concerned that \"the Squad,\" with their high media profiles and progressive views, could hamper the party's prospects in 2020, according to Axios.\nWe don't know of any polls that tally Omar's approval rating in Minnesota's 5th congressional district, which she represents, but it would be a precipitous slide if she were indeed polling at either 8 or 9 percent. Omar won her 2018 race overwhelmingly, taking 78 percent of the votes after beating a crowded primary field.\nA Siena College poll conducted between March 31 and April 4, 2019, meantime, showed voters in Ocasio-Cortez's district have a generally favorable view of her, with a 47 percent job approval rating. The poll also found 48 percent of all voters and 61 percent of Democratic voters are prepared to reelect her.\nIn sum, we don't have enough information about the poll described by Axios to assess whether its results are reliable, and even if we did, it seems it was intended to give Democratic party insiders information about potential swing voters, and not meant as a bellwether for any of the congresswomen's reelection prospects, or overall popularity. As such, to claim without qualification that Omar and Ocasio-Cortez are polling 8 or 9 percent and 21 percent, respectively, is misleading.", "For starters, little publicly available information about the poll exists to assess its reliability. According to Axios, the group that conducted it shared the results with the publication on the condition of anonymity because it \"has to work with all parts of the [Democratic] party.\" Aside from lacking such basic information as who conducted the survey and who sponsored it, also absent are key details, like the wording of the questions and the methodology.", "Furthermore, as Axios reported, the survey only tapped a narrow slice of the public: \"1,003 likely general-election voters who are white and have two years or less of college education.\" It was being shared by \"influential Democrats\" who are concerned that \"the Squad,\" with their high media profiles and progressive views, could hamper the party's prospects in 2020, according to Axios.", "We don't know of any polls that tally Omar's approval rating in Minnesota's 5th congressional district, which she represents, but it would be a precipitous slide if she were indeed polling at either 8 or 9 percent. Omar won her 2018 race overwhelmingly, taking 78 percent of the votes after beating a crowded primary field.", "A Siena College poll conducted between March 31 and April 4, 2019, meantime, showed voters in Ocasio-Cortez's district have a generally favorable view of her, with a 47 percent job approval rating. The poll also found 48 percent of all voters and 61 percent of Democratic voters are prepared to reelect her.", "In sum, we don't have enough information about the poll described by Axios to assess whether its results are reliable, and even if we did, it seems it was intended to give Democratic party insiders information about potential swing voters, and not meant as a bellwether for any of the congresswomen's reelection prospects, or overall popularity. As such, to claim without qualification that Omar and Ocasio-Cortez are polling 8 or 9 percent and 21 percent, respectively, is misleading.", "Allen, Mike. \"Exclusive Poll: AOC Defining Dems in Swing States.\"\r\n  Axios. 14 July 2019.", "Wemple, Erik. \"Axios Declines to Comment on Anonymous Poll Cited by President Trump.\"\r\n  The Washington Post. 16 July 2019.", "Siena College Research Institute. \"Ocasio-Cortez Viewed Favorably by Majority of Voters in Her District.\"\r\n  10 April 2019.", "Murphy, Esme. \"Rep. Ilhan Omar Continues to Rally Support Amid Controversy.\"\r\n  WCCO. 12 June 2019.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]