["About this rating", "In March 2017, a distasteful image showing President Donald Trump with a brown stain down the back of his golf pants appeared on social media, along with the claim that he was incontinent:", "The image reached a far wider audience when it was featured in a fake news article published by the web site Viral Chords a few days after it first appeared on social media, appearing alongside a claim that the President had experienced diarrhea during a recent golf outing:", "President Trump had a little accident on the golf course today, and no, and wasn’t politically. After a large brunch of eggs, bacon, ham, pheasant, roast beef, elk, and a variety of sausage, Trump had a case of diarrhea while playing the 5th hole of his back nine.\nA golden color cart drove up and escorted Trump back to the side entrance of Mar-a-lago.\n“It wasn’t pretty,” said one golfer.\n“It was pretty funny,” said another.\nThe same photograph was used to illustrate a 30 December 2017 article published by the Empire News junk news site, headlined \"A Crying Donald Trump Was Escorted Off Mar-A-Lago Golf Course After Accidentally Pooping His Pants\":\n\nPresident Trump has spent most of his winter vacation golfing with friends and family at Mar-A-Lago in Palm Beach, but on his latest outing, the President was caught with his pants up…when perhaps they should have been down.\nAccording to photographers at the golf game, President Trump was on the 13th hole and right after teeing off, he let out “a massive, wet, drippy fart sound.”\n“It was simultaneously hilarious and disgusting,” said Chris Robbins, the photographer who captured the immediate aftermath. “I wasn’t getting any really good shots throughout the day, but then I heard Trump rip one, really hard and really wet. I look over, and he has literally shit himself. It was made even more hilarious because, like most dipshit golfers, he was wearing stupid clothes – white pants!”\n\nBoth this story and the image are fake. The original photograph was taken by Reuters photographer David Moir on 10 July 2012, during the opening of the Trump International Golf Links golf course. Here's a look at the original image, as well as a cropped closeup showing Trump's stain-free backside:\n\nA similar image purportedly showing an incontinent Hillary Clinton was circulated during the 2016 presidential campaign. That photograph was also a hoax.", "President Trump had a little accident on the golf course today, and no, and wasn’t politically. After a large brunch of eggs, bacon, ham, pheasant, roast beef, elk, and a variety of sausage, Trump had a case of diarrhea while playing the 5th hole of his back nine.", "A golden color cart drove up and escorted Trump back to the side entrance of Mar-a-lago.", "“It wasn’t pretty,” said one golfer.", "“It was pretty funny,” said another.", "The same photograph was used to illustrate a 30 December 2017 article published by the Empire News junk news site, headlined \"A Crying Donald Trump Was Escorted Off Mar-A-Lago Golf Course After Accidentally Pooping His Pants\":", "President Trump has spent most of his winter vacation golfing with friends and family at Mar-A-Lago in Palm Beach, but on his latest outing, the President was caught with his pants up…when perhaps they should have been down.", "According to photographers at the golf game, President Trump was on the 13th hole and right after teeing off, he let out “a massive, wet, drippy fart sound.”", "“It was simultaneously hilarious and disgusting,” said Chris Robbins, the photographer who captured the immediate aftermath. “I wasn’t getting any really good shots throughout the day, but then I heard Trump rip one, really hard and really wet. I look over, and he has literally shit himself. It was made even more hilarious because, like most dipshit golfers, he was wearing stupid clothes – white pants!”", "Both this story and the image are fake. The original photograph was taken by Reuters photographer David Moir on 10 July 2012, during the opening of the Trump International Golf Links golf course. Here's a look at the original image, as well as a cropped closeup showing Trump's stain-free backside:", "A similar image purportedly showing an incontinent Hillary Clinton was circulated during the 2016 presidential campaign. That photograph was also a hoax.", "Haney, Paul   \"How Donald Trump Made Golf Great Again — But Some of the Bigwigs Wish He Hadn't.\"\r\n    Business Insider.   6 March 2016.", "Viral Chords.   \"Trump Has Diarrhea During Golf Game.\"\r\n    10 April 2017.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]