["The video, which shows a woman wearing a hijab collapsing inside a store, was published here on Facebook on January 27, 2020.", "It had been viewed more than 12,000 times before it was removed. The post had been shared more than 200 times.", "Below is a screenshot of the misleading post:", "The post’s Malaysian-language caption translates to English as: “God has willed it it has come to this.. Even with a touch of stuff it can be contagious”.", "The video was published alongside a media report about the contagiousness of the novel coronavirus.", "A new strain of the novel coronavirus, believed to have emerged from a wildlife market in the Chinese city of Wuhan in December 2019, has spread to more than 24 countries, killing at least 630 in mainland China and two others in the Philippines and Hong Kong, according to this AFP report published on February 7, 2020.", "The video was also published here on Facebook on January 27, 2020, garnering more than 1,300 views.", "The video has been shared in a misleading context; the family of the woman seen in the video refuted claims that she died after contracting the novel coronavirus.", "This report, headlined “video of girl fainting is not because of coronavirus”, by Malaysian-language newspaper Sinar Harian identified the woman as Nur Izzah Izzati Norazlan, who died after fainting in a store in Shah Alam, capital of Selangor state, on January 26, 2020.", "The report reads, in part: “The family of the girl who fainted and died in a shop in Shah Alam last Sunday, came out to deny that her death was because of the coronavirus as had been viralled on the social networks.", "“The deceased Nur Izzah Izzati Norazlan, 20, died as she was shopping for phone accessories at her workplace in Section 13, Shah Alam, Selangor.”", "The woman's father Norazlan Mokhri told AFP by Facebook Messenger that she did not die due to the novel coronavirus and that the cause of her death remained “unknown”.", "He said the hospital advised it would be two months until a cause of death was determined.", "As of February 7, Malaysia had confirmed 14 cases of the novel coronavirus and no fatalities, as reported here by AFP.", "The video in the misleading post was published alongside three other images.", "– Profile picture of victim –", "The first image is a profile picture of the woman in the video, as seen in the Sinar Harian report. Below is a screenshot comparison of the photo in the misleading post (L) and the photo in the Sinar Harian report (R), circled in green by AFP:", "– Novel coronavirus in Pahang? –", "The second image shared alongside the video in the misleading Facebook post claims a new strain of coronavirus has been detected in Kuantan, capital of the Malaysian state of Pahang.", "The post’s Malaysian-language caption translates to English as: “Coronovirus is already in KUANTAN… lessen outdoor activities guys…”", "The text in the image reads: “Be careful all. There is already one positive coronovirus case.. came to the emergency at uia just now.. TNB staff.. so don’t bring your child anywhere now… especially in a place with a lot of people..”", "Below is a screenshot of the image:", "The Public Health Department of Pahang state in this Facebook post refuted claims of novel coronavirus being detected in Pahang.", "Below is a screenshot of the government statement:", "The Malaysian-language statement partially translates to English as: “Up until January 27, 2020, there has not been a suspected case of infection from Novel Coronavirus at any hospital in the state of Pahang.”", "“With that, we ask that all layers of the society to be ever vigilant and NOT viral any news which is not true that can cause confusion and panic amongst the society.”", "– Novel coronavirus transmitted through parcels? –", "The third image is a purported screenshot of a report by Singapore-based news outlet The MiceTimes of Asia, headlined: “Coronavirus can be transmitted via parcel AliExpress”.", "The article published on January 23, 2020 here - and has since been taken down - claims the novel coronavirus can be transmitted through objects, and “transmission of the deadly coronavirus nCoV via parcels ordered on a popular trading platform AliExpress” is “not ruled out”.", "Below is a screenshot of the report:", "According to the US Centers for Disease Control and Prevention (CDC), “there is likely very low risk of spread from products or packaging that are shipped over a period of days or weeks at ambient temperatures”.", "Below is a screenshot of the relevant section of the CDC’s frequently asked questions page:", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]