["About this rating", "Microsoft published a patent for a \"cryptocurrency system using body activity data.\" This patent is filed under the number WO2020060606A1.", "The number WO2020060606A1 contains three \"6's\" but is obviously not the same as \"666.\" This patent focuses on tracking body activity via wearable technology, such as a smart watch, and makes no mention of implanted microchips.", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "The spread of the COVID-19 coronavirus disease in 2020 sparked a flurry of conspiracy theories concerning where it originated, how it spread, and who was responsible for it. One such theory blamed the disease on Bill Gates and claimed that the former Microsoft CEO had started a pandemic so that he could insert microchips into people around the globe under the guise of providing vaccinations or for other purposes.", "This conspiracy theory is propped up by little more than coincidences and misinterpretations. For instance, in April 2020 social media users started to share a link to a patent supposedly owned by Microsoft that pertained to the micro-chipping of individuals for financial gain.", "This patent was especially insidious, users claimed, because it carried the numbers \"666,\" the biblical \"mark of the beast,\" and the letters WO, which they claimed stood for the \"World Order.\"", "The above-displayed screenshots pertain to a genuine patent filed by Microsoft. However, this patent does not involve a plan to microchip individuals, \"WO\" does not stand for World Order, and one has to ignore the existence of 11 other characters in order to arrive at the conclusion that this patent carries the devil's number.", "This patent is for a \"cryptocurrency system\" that \"uses body activity data.\" Microsoft Technology Licensing applied for this patent in June 2019, and the patent was published a few months later in March 2020 under the number \"WO2020060606A1.\"", "The patent, which has not been granted as of this writing, makes no mention of microchips.", "The diagrams included in this patent (and shown in the screenshots above) show how the \"person,\" \"user device,\" and \"sensor\" are all distinct items. The text of the patent further explains that the \"user device\" in the diagram may include wearables, such as a smart watch, or cell phones, laptops, or tablets:", "User device 130 may include any device capable of processing and storing data/information and communicating over communication network 120. For example, user device 130 may include personal computers, servers, cell phones, tablets, laptops, smart devices (e.g. smart watches or smart televisions). An exemplary embodiment of user device 130 is illustrated in FIG. 6.", "The patent provides two options for the sensor. First, the sensor could be incorporated into one of the aforementioned devices, such as a smartphone. The \"sensor\" may also be its own standalone component:", "Sensor 140 may be configured to sense the body activity of user 145. As illustrated in FIG. 1, sensor 140 may be a separate component from user device 130 and be operably and/or communicatively connected to user device 130. Alternatively, sensor 140 may be included and integrated in user device 130. For example, user device 130 may be a wearable device having sensor 140 therein. The sensor 140 may transmit information/data to user device 130.", "At no point in this patent does Microsoft suggest that the sensor would be a microchip implanted into a person's skin.", "So what about the claim that this is World Order patent 666? As we noted above, this patent was truly published under the number \"WO2020060606A1.\" It truly contains the number 666 (or, more accurately, 060606). However \"patent WO2020060606A1\" is not the same as \"patent 666.\"", "Furthermore, the \"WO\" at the start of this patent does not stand for \"World Order.\" It is shorthand for WIPO, the World Intellectual Property Organization, which issued this patent. The \"A1\" at the end of this patent number signifies that this is only a published patent. The \"kind code\" B1 is applied to granted patents.", "We reached out to Microsoft for more information about this patent and will update this article if we hear back.", "To sum up: Microsoft has applied for a patent that deals with the development of a cryptocurrency system based on tracking body-activity data. However, this patent focuses on wearable technology, such as a smart watch, not implanted microchips, and while patent number \"WO2020060606A1\" contains three \"6's,\" this appears to be little more than a coincidence.", "Breslin, Conor.   \"What Is a WO Patent?\"  \r\n  Houston Chronicle.\r\n    Retrieved 20 April 2020.", "Hasselton, Todd and Jordan Novet.   \"Bill Gates Leaves Microsoft Board.\"\r\n    CNBC.   13 March 2020.", "21 April 2020 [Correction]: Article updated to clarify that Microsoft does not own this patent. As of this writing, the company has applied for the patent but it has yet to be granted.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]