["Some Las Vegas hotels have given free hotel rooms to emergency responders working through the coronavirus outbreak.", "Trump’s Las Vegas hotel has not. But it is not the only exception.", "Amid the pain of the coronavirus pandemic, one of the luxury hotels that bears President Donald Trump’s name was attacked as lacking compassion.", "\"All Las Vegas hotels have donated food and rooms for emergency personnel except for one: Trump International Hotel Las Vegas,\" a Facebook post claimed.", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Unlike some other hotel groups operating in Las Vegas, Trump’s hotel did not donate rooms, food or supplies, according to reporting by us and other media.", "But there’s no reason to believe Trump’s hotel was the only exception.", "Las Vegas is the nation’s largest hotel market, with roughly 150,000 rooms and thousands more under construction, according to the Las Vegas Review-Journal. The Las Vegas Convention and Visitors Authority lists 277 lodging establishments in the city as of December 2019, not including time-shares.", "The American Hotel & Lodging Association says more than 16,000 U.S. hotels have signed up to participate in its initiative to link hotels offering rooms with first responders and health care workers seeking lodging. As of April 6, three days before the Facebook post, 36 Las Vegas hotels were participating, the association told the Review-Journal.", "The association didn’t respond to our requests for details. Neither did the Las Vegas Hospitality Association, which counts 260 companies among its members.", "The 64-story, 1,282-room Trump International Hotel Las Vegas opened just off on The Strip in 2008. It’s one of eight hotels and resorts that the Trump Organization owns in North America.", "Trump still owns the company. But after becoming president, he gave up his position as an officer and day-to-day control, and the company’s assets were put into a trust that is managed by his sons, Donald Jr. and Eric.", "Nevada Gov. Steve Sisolak ordered a statewide shutdown of hotels, casinos and other non-essential businesses on March 17.", "Since then, several hotel groups operating in Las Vegas have announced donations of hotel rooms, food and supplies for workers dealing with the health crisis.", "Polo Towers, Cancun Resort and Desert Paradise Resort are among Diamond Resorts properties offering complimentary accommodations to medical personnel and first responders, the Las Vegas Review-Journal reported. Wynn Resorts told the newspaper it is offering financial aid, food and personal protective equipment to local medical facilities and nonprofits in Las Vegas.", "Nationally, Marriott announced it has committed to provide $10 million worth of free hotel stays for health care professionals in cities hard hit by COVID-19, including Las Vegas.", "The Trump Organization did not reply to our requests for information for this fact check.", "Trump has saluted hotels and other businesses for their role in helping Americans cope with the coronavirus crisis. But media reports say that his own company hasn’t played much of a role.", "ProPublica reported April 2 that in its review of Trump Organization properties, it \"couldn’t find any sign they were joining the effort to fight the coronavirus, even as the president urges other companies to do so.\" The article said many Las Vegas hotels and casinos that closed because of the governor’s order — including MGM, Wynn, Boyd Gaming, Station Casinos and Caesars — \"provided huge quantities of unused food\" and cash to a local food bank. The food bank director said nothing had been donated by the Trump hotel.", "Politico reported April 9 that local and state officials around the country were asking hotels to volunteer to house patients or first responders. In the seven U.S. cities with Trump luxury hotels, including Las Vegas, no local officials said the Trump properties were in discussions to house overflow patients or medical personnel.", "In response to the pandemic, the Trump Organization laid off or furloughed about 1,500 employees at Trump hotels in the United States and Canada, including in Las Vegas, the Washington Post reported on April 3. The company employs about 4,000 people.", "Las Vegas-based Caesars Entertainment Corp. said April 2 it expects to furlough about 90% of its employees. The Wall Street Journal previously reported that Marriott, Hilton and Hyatt are among hotel owners furloughing tens of thousands of workers or slashing staff.", "A Facebook post attacks Trump’s Las Vegas hotel as being the only one in the city that didn’t offer food or rooms for emergency personnel.", "The Trump Organization hasn’t provided any information, and searches by PolitiFact and other news organizations didn’t turn up any evidence that Trump’s properties have made such donations.", "Several other hotels in Las Vegas have made donations, but the Trump hotel does not appear to be the only exception. The city has hundreds of hotels, motels and inns, and a hotel industry trade group says 36 Las Vegas hotels were participating in its national initiative to offer rooms to first responders and health care workers.", "For a statement that contains an element of truth, but leaves a misleading impression, our rating is Mostly False.", "Facebook, post, April 9, 2020", "Politico, \"A slew of hotels are heeding cities' pleas for help. Trump's aren't,\" April 9, 2020", "ProPublica, \"Trump Congratulates Businesses for Helping Fight Coronavirus. But His Own Company Has Been Absent,\" April 2, 2020", "Las Vegas Review-Journal, \"Las Vegas hotels offer rooms to health care workers, first responders,\" April 8, 2020", "Washington Post, \"Trump outlines plan to shift assets, give up management of his company,\" Jan. 11, 2017", "Marriott International, news release, April 8, 2020", "Washington Post, \"Nine questions about President Trump’s businesses and possible conflicts of interest,\" March 28, 2018", "Las Vegas Convention and Visitors Authority, \"Clark County Inventory,\" Dec. 31, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]