["“This is what the capital looked like shortly before this radio silence,” said one tweet shared 11,800 times since June 1, 2020. A screenshot of it was later shared on Instagram.", "A second tweet used the same image to claim: “#DCBlackout This picture is the last we saw before all media was cut at 1am. An entire city was on fire and suddenly went silent.” It was also shared on Facebook.", "“The US government cut all communications in D.C. from 1AM to 6AM,” a similar Instagram post claimed.", "However, there is no evidence that communications were cut in Washington.", "“This appears to be misinformation. We have no confirmation of a cell phone blackout,” Alaina Gertz, spokeswoman for the Metropolitan Police Department, said by email.", "AFP video journalist Agnes Bun said she was “near the White House until roughly 1:30 am, and I had no issue at all with my phone connection.”", "Netblocks, a civil society group that monitors internet shutdowns, tweeted similarly to say they found “no indication of a mass-scale internet disruption from Washington, DC.”", "ℹ️ Real-time network data from Washington, DC show no indication of a mass-scale internet disruption overnight or through the last 48 hours.\n\n\t\tObservable fixed-line and cellular connectivity remain stable at the present time. We continue monitoring#DCBlackout pic.twitter.com/8PWR9oRRO5", "Twitter said it is “actively investigating the hashtag” and has “suspended hundreds of spammy accounts” under its platform manipulation policy, which guards against actions intended to artificially amplify information.", "A spokesman for the company said by email: \"We're taking action proactively on any coordinated attempts to disrupt the public conversation around this issue.\"", "Alex Engler, a fellow at the Brookings Institution who specializes in artificial intelligence and policy, said by phone that he calculated upwards of 30,000 retweets of false or misleading content shared under the hashtag.", "He pointed to one tweet from @sarahxo85267698, an account that was subsequently suspended, which claimed phones in DC were “jammed.”", "“Someone clearly wrote that and then you saw that account screenshotted and then that account was deleted. That’s a fairly classic way to disseminate this.”", "Amid nationwide protests over Floyd's death in Minneapolis, Minnesota, Engler said people wanting to spread misinformation know how to make emotionally charged content that aligns well with pre-existing outrage so it is ripe for sharing.", "He said he observed inauthentic accounts retweeting content with the hashtag #DCBlackout, but they had low follower counts.", "“The bots are not actually there to spread the disinformation,” he explained. “They're used to make the material seem true and seem trustworthy. Then you have actual people with actual networks disseminating this.”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]