["Social media reactions to the news that President Donald Trump tested positive for the coronavirus ranged from well-wishes to skepticism.", "PSA: Get these in your inbox:We're fact checking the news and sending it to your inbox. Sign up to get that here.", "On Oct. 2, author and former attorney Richard Greene posted his speculations on Facebook, suggesting Trump's positive test result could be a \"con.\" Greene also wrote a 2016 Huffington Post story: \"Is Donald Trump Mentally Ill? 3 Professors Of Psychiatry Ask President Obama To Conduct ‘A Full Medical And Neuropsychiatric Evaluation.’\" His post soon went viral.", "There are three reasons, according to Greene, not to trust the White House's announcement that Trump tested positive:", "Greene did not mention first lady Melania Trump's positive test result in his post.", "\"My FB post on it was instantaneous and has received more, and quicker, response ... and more positive response ... than anything I believe I have ever posted,\" Greene told USA TODAY in an email.", "Greene attributed his skepticism to \"severe cynicism\" after untruths told by Trump during his presidency, as well as a \"Coronavirus October Surprise.\"", "Trump has made more than 20,000 false or misleading claims during his term, according to a July report by The Washington Post's Fact Checker.", "\"The term 'October Surprise' was coined by a 1980s political operative but has ever since been appropriated by the media to describe unexpected political disasters in the twilight hours of the campaign,\" the Smithsonian Magazine explained, adding \"they’ve become a staple of modern politics.\"", "In Greene's view, an \"October surprise\" is one of \"12 Ways Donald Trump Can Win,\" a list compiled by Greene in an Aug. 23 Medium blog post. Greene theorized Trump would persuade the Food and Drug Administration to approve a vaccine that \"cures\" COVID-19 this month, effectively ending \"The Coronavirus Crisis.\"", "\"This could be another version of that 'October Surprise' strategy,\" Greene said.", "USA TODAY reached out to the Trump campaign for comment.", "More:Trump's COVID diagnosis followed waning precautions at the White House", "Despite skepticism by some on social media, the president could have been exposed to the coronavirus during any number of events over the past few weeks.", "News of the president and first lady's positive test results came after reports that White House adviser Hope Hicks tested positive, according to USA TODAY.", "Trump told Fox News' Sean Hannity on Thursday that he and the first lady \"spend a lot of time with Hope.\"", "Hicks traveled extensively with Trump over the last week, including to the first 2020 presidential debate in Cleveland on Sept. 29. USA TODAY reported in-person attendees on Trump's side of the auditorium refused to wear masks.", "Debate moderator said a safety personnel member from the Cleveland Clinic offered masks to Trump's family, but he was \"waved away,\" according to USA TODAY.", "Hicks was one of 180 attendees to watch Trump announce the nomination of Judge Amy Coney Barrett to the Supreme Court in the White House Rose Garden last week. USA TODAY reported that fewer than a third of those at the announcement wore masks.", "During an interview on ABC's \"Good Morning America\" on Friday, former New Jersey Gov. Chris Christie, who helped Trump prepare for the debate, said the president and others in the room were not wearing masks during preparations.", "\"No one was wearing masks in the room when we were prepping the president during that period of time. And the group was about five or six people, in total,\" Christie said, according to USA TODAY.", "Wearing a mask as well as social distancing from others by at least 6 feet are recommended steps for preventing the spread of COVID-19, according to the Centers for Disease Control and Prevention.", "In addition to Hicks, a number of other people around the president or who were at the White House recently have also tested positive for COVID-19.", "More:Obama wishes 'speedy recovery' to President Trump, Melania 'no matter our party'", "During Tuesday's debate, moderator Chris Wallace asked Trump about the dangers of holding campaign rallies with thousands of people in attendance during a pandemic.", "\"We had no negative, no negative effect.\" Trump said, according to a transcript of the debate. \"And we've had, 35 (to) 40,000, people at some of these rallies.\"", "Trump also said holding the rallies outside makes \"a big difference according to the experts.\"", "Supporters crowded into a partially outdoor airport hangar for a Sept. 3 rally in Latrobe, Pennsylvania, according to USA TODAY, during which Trump criticized political opponent Biden for wearing a mask in public and dismissed questions about his own health.", "Trump held another rally in an airport hangar in Freeland, Michigan, a week later, according to USA TODAY. Many of the 5,000 attendees were not wearing masks. A Sept. 14 rally in Henderson, Nevada, was held indoors, in defiance of state coronavirus restrictions.", "More than 1,000 attendees witnessed Trump's Aug. 28 acceptance speech for the Republican presidential nomination on the South Lawn of the White House, but audience seating did not comply with CDC-recommended social distancing guidelines. And most didn't wear masks, USA TODAY reported.", "More:Trump given remdesivir to fight his COVID-19 infection", "Hicks is not the only high-profile member of Trump's inner circle to test positive for the coronavirus. The Republican National Committee confirmed its chair Ronna McDaniel tested positive on Wednesday, according to the Detroit Free Press. McDaniel spent time with the president a week ago.", "National Security Adviser Robert O'Brien and senior campaign official Kimberly Guilfoyle both tested positive over the summer, USA TODAY reported in July.", "Former acting chairman of the White House Council of Economic Advisers Tomas Philipson had a mild case of COVID-19 in June but has since left his position at the White House. Top spokesperson for Vice President Mike Pence, Katie Miller, tested positive in early May. Miller returned to work. Pence confirmed he and wife Karen tested negative for the virus Friday morning, according to USA TODAY.", "Other members of the White House staff who work close to the president and family also tested positive in recent months. The list includes cafeteria workers, a White House valet, a Marine One helicopter pilot and a staffer for Pence, USA TODAY reported.", "More:Trump and others positive for COVID: A running list of everyone being tested and their results", "On Friday, Greene retweeted a Financial Times video about how President Bolsonaro benefitted from his COVID-19 diagnosis. USA TODAY reported the Brazilian leader tested positive in July.", "\"The former army captain has repeatedly downplayed the severity of the COVID-19 pandemic, often joined in rallies without wearing a mask\" the video says. \"Following in the footsteps of his political soulmate U.S. President Donald Trump, Bolsonaro also said he was taking the anti-Malaria drug hydroxychloroquine.\"", "More:Social media teems with conspiracy theories from QAnon and Trump critics after president's positive COVID-19 test", "Trump once touted hydroxychloroquine as a preventative drug for COVID-19, despite evidence showing it does not prevent the development of the disease, USA TODAY reported.", "Critics said Bolsonaro denied science by pitching the controversial drug as a possible solution. But returning to work after his quick recovery from COVID-19 made him seem like a \"messiah,\" according to the video.", "\"Assuming he truly recovered from the virus, he may emerge politically stronger from the pandemic,\" said Financial Times Brazil correspondent Andres Schipani. \"His approval ratings remain at roughly 30%, and they're already showing signs of improvement. With these numbers, history suggests he would be able to fend off efforts to eject him from office by impeachment procedures.\"", "Trump infamously said testing for the coronavirus is a double-edged sword and blamed a high number of U.S. cases on increased testing, according to USA TODAY.", "There are obvious similarities between Trump's and Bolsonaro's responses to the COVID-19 epidemic. But there is no proof that Trump planned to contract the disease or is lying about testing positive.", "Greene told USA TODAY the president's test result could be accurate, considering the number of people he is exposed to, but added \"It is doubtful we will EVER know.\"", "\"How can we trust ANYONE in Trump's loyal orbit(?) Remember when The Official White House Physician (Ronny) Jackson lied about Mr. Trump's height to ensure that he was not dubbed 'morbidly obese(?)'\"", "The Post reported on the internet-generated conspiracy theory, called \"girther,\" that Jackson had lied about Trump's height and weight measurements from a 2018 physical. Jackson is no longer White House doctor and won a runoff for Texas' 13th Congressional District.", "More:Rose Garden announcement of Supreme Court nominee potential 'super spreader' event, with Trump plus others getting COVID", "We rate this claim FALSE, based on our research. Greene asserts President Trump will try to win the 2020 presidential election by using a positive COVID-19 test result as political capital. But the claim includes speculations without factual basis.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact-check work is supported in part by a grant from Facebook.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more."]