["About this rating", "On Dec. 13, 2019, the website Gish Gallop published an article saying that a skydiver survived a \"freak accident\" after his parachute became entangled on the nose of a passing 737 airplane:", "Area Skydiver Caught by 737 Dragged For 200 Miles", "A Manteca man is lucky to be alive after surviving what aviation experts are calling both a miracle and a freak accident. An expert skydiver, Kent Clostomy, has made over 3000 jumps from his home base of Lodi, CA. Mr. Clostomy is the co-owner of the mal-named skydiving company Deep Impact and decided to make a high jump from close to 20,000 feet over the California Central Valley.", "[...]", "Recalling his ordeal, Mr. Clostomy seemed unaffected by his unexpected hitchhike on a 737.", "“It took me a few minutes to figure out what was going on,” continued Mr. Clostomy. “I’m not too sure, but it was a minute or so. I was caught up underneath the fuselage, you know? I mean, going that fast meant I was pinned up under the plane. I tried banging on the plane. Nothing worked. Finally, I cut myself free and started falling.”", "This item was not a factual recounting of real-life events. The article originated with a website that describes its output as being humorous or satirical in nature, offering the following disclaimer:", "This website is for entertainment purposes only. Please do not let your children use this site. If something in one of the stories you see here is not true, that would mean it’s fiction. You can still do that without censorship – create fiction. Any persons mentioned in our copy bearing resemblance to persons living or dead is a mere coincidence and probably a creation in your overactive imagination.", "For background, here is why we sometimes write about satire/humor.", "Gish Gallop.   \"Area Skydiver Caught by 737 Dragged For 200 Miles.\"\r\n    13 December 2019.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]