["Several Twitter users have shared a 15-second clip of a giant fish leaping out of the water and attacking a helicopter. As per social media claims, National Geographic paid a million dollars for this “rare video”.", "Former Puducherry LG Kiran Bedi shared the video on her Twitter account on May 11, 2022.", "Watch this 🥹🥺🙄😳😲 pic.twitter.com/Io0PQb567U", "— Kiran Bedi (@thekiranbedi) May 11, 2022", "The video was also circulating in 2020. A Twitter user shared the viral video along with the text, “National geographic channel has paid 1 Million Dollar for this rare video..What a video”", "नेशनल ज्योग्राफिक चैनल ने इस दुर्लभ वीडियो के लिए 1 मिलियन डॉलर का भुगतान किया है।", "National geographic channel has paid 1 Million Dollar for this rare video..What a video pic.twitter.com/rTIA4v5CkI", "— रतन कुमार अग्रवाल (@RatanKAgrawal) July 11, 2020", "Alt News received several requests in 2020 to fact-check this on WhatsApp (+917600011160) and on our official Android application.", "We performed a reverse image search on Yandex using InVid, a video verification tool, and found that the clip is from the 2017 movie ‘5 Headed Shark Attack’.", "This slideshow requires JavaScript.", "Using this as a clue, we performed a keyword search on YouTube and found that the official trailer of the film was posted by YouTube Movies on September 2017. At the 1:05 mark in the trailer, we can see the shark bringing down the helicopter.", "Social media claims associated with the viral video are false. “National Geographic paid one million dollars” is a popular internet hoax. In 2017, it was shared with a clip from the movie ‘Into the Storm’ which was debunked by Snopes, a US-based fact-checking website.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "Trigger Warning: Sexual Violence A distressing video of a girl forced to take her clothes…", "A clip featuring Pakistan men’s Cricket team captain Babar Azam is viral on social media…", "A 13-second clip featuring Bollywood actor Shah Rukh Khan is being shared on social media…", "Union minister of information and broadcasting Anurag Thakur on September 26 announced Waheeda Rehman as…"]