["About this rating", "In June 2018, multiple disreputable web sites pushed false reports about the alleged discovery of a \"child trafficking bunker\" near Tucson, Arizona.  Many of those same sites also attempted to assert some putative connection between Hillary Clinton and the debunked bunker site, as well as with child sex trafficking in general.", "This onslaught of misinformation prompted Clinton's daughter, Chelsea, to issue a tweet likening the phenomenon to the absurd and thoroughly debunked \"Pizzagate conspiracy theory of November 2016 (which held that Hillary Clinton and others were running a child trafficking ring out of a Washington, D.C., pizzeria) and pointing followers to the National Human Trafficking Hotline as a responsible source for dealing with child trafficking reports:", "Of course there’s a #Pizzagate 2.0. Of course there is. If you have been a victim of trafficking or have suspicions of actual trafficking, please reach out to the National Human Trafficking Hotline: 1-888-373-7888. https://t.co/6IpshzA8Vv", "— Chelsea Clinton (@ChelseaClinton) June 6, 2018", "The disreputable Neon Nettle web site then published an article bizarrely claiming that Chelsea Clinton's tweet constituted an \"admission\" that Pizzagate was \"real\" and that the National Human Trafficking Hotline was actually \"run\" by her mother:", "Daughter of the former secretary of state Hillary Clinton has seemingly admitted that ‘Pizzagate‘ — the conspiracy theory born out of the Wikileaks emails allegedly exposing politicians running pedophile rings - is real on her Twitter.", "In a strange rant, Chelsea Clinton Tweeted “of course there’s a #Pizzagate 2.0. Of course, there is,” in a sarcastic reference to the recent child trafficking bust in Arizona.", "Not long after the Tweet was sent out, Twitter users discovered that National Human Trafficking Hotline that Chelsea mentioned in her Tweet is actually the organization run by her mother Hillary, one of the many high profile people accused of being involved in the child sex ring in Washington D.C.", "All of this was false: Chelsea Clinton's tweet was neither \"strange\" nor a \"rant,\" nor did she literally tweet that 'Pizzagate is real' (or anything else that could rationally be construed as an admission of such) -- Ms. Clinton was clearly referencing and expressing dismay at her mother's name being dragged into yet another preposterous child trafficking rumor.  Moreover, Hillary Clinton does not \"run\" the human trafficking hotline her daughter tweeted about, as its parent organization's chief communications officer, Caren Benjamin, told us:", "The National Human Trafficking Hotline is operated by Polaris, a nonpartisan, non-profit, non-governmental organization that is a leader in the global fight to eradicate modern slavery and restore freedom to survivors of human trafficking. We are not a government, law enforcement, or immigration [entity].  Funding is provided by the Department of Health and Human Services (HHS) and other private donors and supporters.", "[W]e have no relationships with, or to, any of the Clintons.", "Newton, Daniel.   \"Chelsea Clinton Tweets 'Pizzagate Is Real.'\"\r\n    Neon Nettle.   8 June 2018.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]