["About this rating", "Susan Rosenberg has served as vice chair of the board of directors for Thousand Currents, an organization that provides fundraising and fiscal sponsorship for the Black Lives Matter Global Movement. She was an active member of revolutionary left-wing movements whose illegal activities included bombing U.S. government buildings and committing armed robberies.", "In the absence of a single, universally-agreed definition of \"terrorism,\" it is a matter of subjective determination as to whether the actions for which Rosenberg was convicted and imprisoned — possession of weapons and hundreds of pounds of explosives — should be described as acts of \"domestic terrorism.\"", "In the summer of 2020, amid a new wave of nationwide protests over racial injustice and police brutality, readers inquired about the accuracy of online articles and social media posts that claimed a convicted terrorist sat on the board of directors of a left-leaning organization that provides fundraising and administration services for the Black Lives Matter movement.", "On July 8, 2020, Twitter user @asdomke posted a widely-shared tweet that read:", "\"This is convicted terrorist Susan Rosenberg, she sits on the Board of Directors for the fundraising arm of Black Lives Matter. She was convicted for the 1983 bombing of the United States Capitol Building, the U.S. Naval War College and the New York Patrolmen's Benevolent Assoc.\"", "In June, the website of right-leaning talk radio host Wayne Dupree posted an article with the headline \"Report: Leader of Group Handling 'BLM Fundraising' is a Convicted Terrorist Who Carried Out Bombings in NYC and DC.\" Similar articles were published by the Daily Caller (an article that was republished by the Western Journal) and on the website of former Fox News pundit Bill O'Reilly.", "On July 9, 2020, Tucker Carlson ran a segment about Rosenberg's past and her connection to Thousand Currents and the Black Lives Matter movement on his Fox News show.", "Those posts and articles were largely based on a June 24, 2020, report published by the right-leaning Capital Research Center, which carried the headline \"A Terrorist's Ties to a Leading Black Lives Matter Group.\" The report went on to state that:", "Some conservatives have begun speculating the unrest in American cities -- even as late as Monday night in Washington, DC as “protestors” unsuccessfully worked to tear down a statue of Andrew Jackson and set up an autonomous zone across the street from the White House -- may in part be an attempt to affect the upcoming presidential election, with the chaos and violence intended to make it as difficult as possible for Donald Trump to win a second term.", "Lending credence to this idea is the fact that at least one board member of the group fiscally sponsoring the most organized part of the Black Lives Matter movement, who have been involved in most of the activity surrounding the current unrest -- tried the same thing almost 40 years ago during Ronald Reagan’s reelection campaign. And it landed her in federal prison for 16 years. If there were any question whether Black Lives Matter has ideological ties to the Communist terrorists of the 1960s, the story of Susan Rosenberg should put that issue to bed...", "Rosenberg, who started out as a member of the 1960s revolutionary group Weather Underground, graduated into even more violent, and arguably successful, forms of terrorism in the 1970s and 1980s -- including bombings at an FBI field office in Staten Island, the Navy Yard Officers’ Club in Washington, DC, and even the U.S. Capitol building, where she damaged a representation of the greatest of the Democrat defenders of slavery, John C. Calhoun. She currently serves as human and prisoner rights advocate and a vice chair of the board of directors of Thousand Currents.", "Thousand Currents is undoubtedly very closely linked to the Black Lives Matter Global Network Foundation, a Delaware-registered entity that is one of the leading formal embodiments of the broader Black Lives Matter movement. The Thousand Currents website outlines the relationship between the two entities:", "\"In 2016, BLM Global Network approached Thousand Currents to create a fiscal sponsorship agreement. Thousand Currents, a 501(c)(3) tax-exempt nonprofit organization, provides the legal and administrative framework to enable BLM to fulfill its mission. Fiscal sponsorship is a common structure utilized by nonprofit organizations. Oftentimes, nonprofit initiatives seek fiscal sponsorship to be able to have the fiscal sponsor handle administrative operations while the organization focuses on its programs and builds up its own organizational infrastructure. In this capacity, we provide administrative and back office support, including finance, accounting, grants management, insurance, human resources, legal and compliance.\"", "Descriptions of Thousand Currents as an organization which \"handles fundraising\" for Black Lives Matter were therefore accurate.", "As recently as June 24, the date on which the Capital Research Center published their report, the Thousand Currents website listed Susan Rosenberg as vice chair of the organization's board of directors, describing her as a \"human and prison rights advocate and writer.\" The entire \"board of directors\" page has since been removed from the site.", "According to tax documents obtained by Snopes, Rosenberg sat on the board of directors during the 2015 and 2016 financial years, and was elevated to the position of vice chair in 2017. We asked Thousand Currents for the dates of Rosenberg's tenure on the board, and as its vice chair, and invited the organization to comment on the ongoing controversy, and will update this story if we receive a response.", "Rosenberg's prominent position within Thousand Currents is clear, as are that organization's close links to the Black Lives Matter Global Network (and thereby the broader Black Lives Matter movement). However, the question of whether she should be described as a \"terrorist\" or \"convicted terrorist\" is much more complicated.", "Originally from New York City, Rosenberg was an active member of several revolutionary left-wing groups and movements during the 1960s, 1970s and 1980s. In November 1984, she was arrested in Cherry Hill, New Jersey after police said she and an associate, Timothy Blunk, were found transferring 740 pounds of explosives, an Uzi submachine gun, an M-14 rifle, a rifle with a telescopic sight, a sawed-off shotgun, three 9-millimeter handguns and boxes of ammunition from a car into a storage locker.", "Rosenberg was tried and convicted on the following charges: \"Conspiracy to possess unregistered firearms, receive firearms and explosives shipped in interstate commerce while a fugitive, and unlawfully use false identification documents ...; possession of unregistered destructive devices, possession of unregistered firearm (two counts) ...; carrying explosives during commission of a felony ... ; possession with intent to unlawfully use false identification documents...; false representation of Social Security number, possession of counterfeit Social Security cards.\"", "In May 1985, New Jersey U.S. District Court Judge Frederick Bernard Lacey gave Rosenberg and Blunk the maximum available sentence of 58 years each in prison. On Jan. 20, 2001, his last day in office, President Bill Clinton commuted Rosenberg's sentence, and she was released from prison.", "According to several contemporaneous news reports, Rosenberg had previously been charged with multiple offenses as part of a major 1982 conspiracy case against several prominent left-wing revolutionaries. Along with the others, Rosenberg was charged with conspiracy and racketeering offenses in connection with the following incidents:", "The most high-profile incident was the October 1981 Brink's robbery in Nyack, New York. Several members of the Weather Underground and Black Liberation Army groups were accused of having orchestrated and carried out the violent robbery of a Brink's armored vehicle at the Nanuet Mall, stealing total of $1.6 million. In the course of a police chase and shootout, two police officers and a Brink's guard were killed. The money was recovered. Specifically, Rosenberg was accused of having driven one of the getaway cars.", "After Rosenberg's arrest in New Jersey in 1984, and her subsequent conviction and imprisonment on the weapons and explosives possession charges, prosecutors dropped the conspiracy and racketeering charges against her, and she was never tried or convicted in relation to the 1981 Brink's robbery, the 1979 Shakur prison escape, or other armed robberies.", "The prosecutor who oversaw the decision not to proceed with that case, in the 1980s, was Rudolph Giuliani, then U.S. Attorney for the Southern District of New York. After Rosenberg's release in 2001, Giuliani, by then Mayor of New York City, told the New York Times the charges were dropped because her existing 58-year prison sentence made a further prosecution unnecessary.", "In 1988, Rosenberg was charged with aiding and abetting a series of bombings which took place between 1983 and 1985, at the Capitol building, Fort McNair, the Washington Navy Yard Computer Center and the Washington Navy Yard Officers' Club, all in Washington, D.C. Bombs were also planted, but did not detonate, at several sites in New York: the FBI's office in Staten Island, the Israeli Aircraft Industries building, the South African consulate and the New York Patrolmen's Benevolent Association.", "However, prosecutors dropped those charges in 1990 as part of a plea deal involving other suspects in the bombings. As a result, Rosenberg was never tried or convicted on any charges relating to the 1983-1985 bombing campaign. The claim, made in @asdomke's tweet, that Rosenberg was \"convicted of\" several 1983 bombings, was therefore false. The claim in the headline of an article on Wayne Dupree's website that Rosenberg \"carried out\" the bombings stands in contrast to the fact that she was never tried or convicted in relation to those incidents.", "During her 16-year incarceration, Rosenberg renounced the use of political violence, though her political beliefs appear not to have changed significantly. In a radio interview shortly after her release in January 2001, she said she \"rejects\" the \"potential for violence in my past actions,\" saying her view of violence as a strategic tool had undergone an \"enormous change,\" but that she retained \"a political view that is certainly progressive and radical in a certain sense.\"", "In her 2011 memoir, she recounted what she said during an unsuccessful 1997 parole application:", "\"I outlined my criminal acts and what I felt about them then and now. I talked about the political ethos of the 1960s and how it had led me and my associates into thinking our activities were acceptable. I detailed how sorry I felt now, how I accepted responsibility for my past actions, and how I would never commit any crimes again. I tried to put my life within the context of the historical period when many Americans thought they could change the world and end war and racism and poverty. I tried to distinguish between my core values and my embrace of the use of political violence. I stated that I now rejected the use of violence. I meant all that I said.\"", "There is no single, universally-accepted definition of terrorism, so any use of that label requires a degree of explanation or justification. One basis upon which one might reasonably describe a person as a terrorist is if they have been convicted of terrorist offenses. That is not true of Rosenberg, who was convicted only of weapons and explosives possession and fraudulent document possession, after her arrest in New Jersey 1984. She pleaded not guilty to charges relating to the 1980s bombing campaign, and those charges against her were dropped, and she has denied any involvement in the 1979 Shakur prison break and 1981 Brink's robbery, with those charges also having been dropped.", "The United States Code defines \"domestic terrorism\" (as distinct from \"international terrorism\") as follows:", "\"... Activities that— (A) involve acts dangerous to human life that are a violation of the criminal laws of the United States or of any State; (B) appear to be intended— (i) to intimidate or coerce a civilian population; (ii) to influence the policy of a government by intimidation or coercion; or (iii) to affect the conduct of a government by mass destruction, assassination, or kidnapping; and (C) occur primarily within the territorial jurisdiction of the United States ...\"", "However, that definition was only added in 1992, years after Rosenberg was convicted of weapons and explosives possession and charged for her alleged role in the 1983-1985 bombing campaign, and her alleged role in a series of armed robberies by left-wing revolutionaries.", "In any event, despite the existence of a definition of domestic terrorism in federal law, a discrete criminal offense of domestic terrorism does not exist, and did not exist in the 1980s. As a result, even if Rosenberg's activities perfectly met the definition of domestic terrorism currently set out in federal law, and even if that definition existed in the 1980s, she could not have been charged with, tried for and convicted of domestic terrorism as such", "In the 1988 indictment relating to the 1983-1985 bombing campaign, prosecutors accused Rosenberg and others of trying \"to influence, change and protest policies and practices of the United States Government concerning various international and domestic matters through the use of violent and illegal means.\" That language is remarkably similar to that found in the present U.S. Code definition of domestic terrorism as seeking to \"influence the policy of a government by intimidation or coercion; or (iii) to affect the conduct of a government by mass destruction, assassination, or kidnapping ...\"", "Examining the 1980s bombings retrospectively, one might very well be justified as describing them as a campaign of domestic terrorism, even if prosecutors were not in a position to hang that label on them at the time. However, the charges against Rosenberg were dropped anyway, and she was never convicted in relation to the bombing campaign.", "In her memoir, Rosenberg wrote of her 1984 arrest in New Jersey that \"there was no immediate, specific plan to use the explosives\" with which she and Blunk were caught. However, it's clear they were transporting and transferring them for a purpose that was at the very least broadly associated with the group's wider mission of opposing various U.S. government policies and carrying out a socialist uprising. \"We were stockpiling arms for the distant revolution that we all had convinced ourselves would come soon,\" she added.", "Earlier in her book, Rosenberg indicated that she was comfortable, at least at one point in time, with bombing government buildings: \"We thought that by taking armed actions against government property (including bombing unoccupied government buildings), we would show that despite the power of the state, it was possible to oppose it.\"", "One could reasonably argue that Rosenberg's actions in the explosives possession case served her and her comrades' overarching mission of militant opposition to U.S. government policy and broader power structures and were in keeping with the group's (if not Rosenberg's) proven record of using bomb attacks to influence the wider American public and advance their cause. As such, a supportable (though not definitive) case exists for claiming that the crimes of which Rosenberg was convicted in 1985 were indeed acts of domestic terrorism.", "Crane, Missy.  \"Report: Leader of Group Handling 'BLM Fundraising' is a Convicted Terrorist Who Carried Out Bombings in NYC and DC.\"\r\n  WayneDupree.com.  28 June 2020.", "Kerr, Andrew.  \"A Convicted Terrorist Sits on Board of Charity Handling Black Lives Matter Fundraising.\"\r\n  The Daily Caller.  27 June 2020.", "O'Reilly, Bill.  \"Does Karl Marx Matter?\"\r\n  BillOReilly.com.  5 July 2020.", "Walter, Scott.  \"A Terrorist's Ties to a Leading Black Lives Matter Group.\"\r\n  Capital Research Center.  24 June 2020.", "Raab, Selwyn.  \"Radical Fugitive in Brink's Robbery Arrested.\"\r\n  The New York Times.  1 December 1984.", "The Associated Press/The Philadelphia Daily News.  \"2 Revolutionaries Get 58 Years Each in N.J.\"\r\n  20 May 1985.", "Barbanel, Josh.  \"4 Indicted by U.S. in Escape of Joanne Chesimard in '79.\"\r\n  The New York Times.  19 November 1982.", "Barbanel, Josh.  \"3 Killed in Armored Car Holdup.\"\r\n  The New York Times.  21 October 1981.", "Gross, Jane.  \"Brink's Suspect Held Without Bail After She Refuses to Enter a Plea.\"\r\n  The New York Times.  14 May 1985.", "Lipton, Eric.  \"Officials Criticize Clinton's Pardon of an Ex-Terrorist.\"\r\n  The New York Times.  22 January 2001.", "The Associated Press/The New York Times.  \"3 Radicals Agree to Please Guilty in Bombing Case.\"\r\n  6 September 1990.", "Rosenberg, Susan.  \"An American Radical...\"\r\n  Citadel Press.  2011.", "Legal Information Institute, Cornell Law School.  \"United States Code, Title 18, Part I, Chapter 113B, Section 2331 -- Definitions.\"\r\n  Accessed 14 July 2020.", "McCord, Mary B.  \"It's Time for Congress to Make Domestic Terrorism a Federal Crime.\"\r\n  Lawfare.  5 December 2018.", "Shenon, Philip.  \"U.S. Charges 7 in the Bombing at U.S. Capitol.\"\r\n  The New York Times.  12 May 1988.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]