["By Eugene Kiely and Lori Robertson", "Posted on April 24, 2018", "House Majority Leader Kevin McCarthy got some of his facts wrong during a recent appearance on Fox Business:", "McCarthy, a California congressman since 2007, has served as the House majority leader for nearly four years, assuming office on July 31, 2014, when Rep. Eric Cantor announced he would resign from Congress after losing his primary election. He may be the next House speaker. Retiring House Speaker Paul Ryan earlier this month endorsed McCarthy as his successor.", "In an April 23 interview on the Fox Business show “Mornings with Maria,” McCarthy talked about Ryan’s endorsement, the Republican agenda and the need to cut federal spending.", "The GOP leader talked about the federal debt and the need to overhaul mandatory spending programs — which would include Social Security, Medicare and Medicaid.", "He suggested creating a commission — similar to the Base Realignment and Closure Commission, or BRAC Commission — to force Congress to vote up or down on recommendations to curb mandatory spending.", "McCarthy, April 23: You almost need — remember when we had a deal with the military, have like a BRAC, a base realignment and closure, where you brought everybody together that have one bill that would come down to the floor? We need that dealing with our debt, because when Ronald Reagan was president, the discretionary spending, all those appropriations, was 75 percent of the budget, the mandatory was 25. Well, now that’s 66 percent. It’s flipped on its head.", "There is no question that mandatory spending consumes an ever-increasing share of the federal budget. But McCarthy lowballed the share of mandatory spending under Reagan.", "In a report called “Mandatory Spending Since 1962,” the nonpartisan Congressional Research Service said mandatory spending as a share of federal outlays was about 25 percent in fiscal year 1962 — about two decades before Reagan became president and three years before the creation of Medicare and Medicaid, two of the biggest mandatory spending programs. Soon after enactment of the health care programs in 1965, mandatory spending as a share of total federal spending started to rise — reaching 45 percent by fiscal year 1975, six years before Reagan became president.", "CRS, “Mandatory Spending Since 1962,” March 18, 2015: Mandatory spending was about a quarter of total federal spending in FY1962 (nearly a third if offsetting receipts are excluded). In FY1968, mandatory spending began growing relative to total federal spending and by FY1975 accounted for about 45% of total spending (about half before offsetting receipts). From the mid-1980s through 1990, mandatory spending’s share in total spending remained relatively steady, before starting to grow again after FY1990.", "CRS did not provide percentages for each fiscal year, but we created a spreadsheet using data from the Office of Management and Budget’s historical tables — specifically Table 1.1 for total outlays and Table 8.5 for total mandatory programs.", "Reagan left office on Jan. 20, 1989, nearly four months into fiscal year 1989. Over the eight fiscal budgets that Reagan signed, from fiscal 1982 to fiscal 1989, mandatory spending averaged about 43 percent. That includes offsetting receipts, such as Social Security and Medicare taxes.", "In fiscal year 2017, the $2.52 trillion in mandatory spending accounted for about 63 percent of the $3.98 trillion federal budget, according to both OMB and the Congressional Budget Office (Table 2-1).", "So, since Reagan, mandatory spending has increased from about 43 percent to 63 percent of federal spending — not from 25 percent to 66 percent.", "Also, it’s worth noting that annual deficits result from the gap between revenues and expenses. McCarthy ignored the revenue side of the equation, so let’s take a look at what has happened since Reagan left office.", "Tax revenues as a percentage of the gross domestic product were 17.8 percent in fiscal year 1989, according to OMB’s historical data (Table 1.2) and grew to as much as 20 percent in fiscal year 2000, when the government registered its third consecutive year of balanced budgets. The last balanced budget was the following year, and over that four-year period of balanced budgets, tax revenues averaged 19.3 percent of GDP.", "The CBO earlier this month issued a report that said the Tax Cuts and Jobs Act — the Republican tax cut bill championed by McCarthy — will reduce revenues as a percentage of GDP “from 17.3 percent in 2017 to 16.6 percent in 2018 — below the average of 17.4 percent of GDP recorded over the past 50 years.”", "McCarthy also touted the “positive things” that are happening now that the Republican-controlled Congress has a Republican president in the Oval Office.", "“Under Obama, our [labor] participation rate actually dropped from 65 to 62,” he said. “It’s going back up to more people in the workforce here.”", "McCarthy is wrong about the rate “going back up.” The rate has fluctuated slightly, but as of March – the most recent month on record – it was 62.9 percent, just as it was when Obama left office.", "The labor force participation rate is the percentage of the entire civilian population age 16 and older that is either employed or currently looking for work in the last four weeks. The rate has been declining for more than a decade, due mostly to demographic causes, economists say, including the retirement of baby boomers.", "The labor force participation rate was 65.7 percent in January 2009, when Obama took office. That was 1.6 percentage points below the peak rate of 67.3 percent in the first fourth months of 2000.", "When Obama left office after eight years, the labor force participation rate was 62.9 percent, a drop of 2.8 percentage points over his presidency.", "That rate has not gone “back up” under President Donald Trump. Instead, it has fluctuated a bit between 63 percent and 62.7 percent. As of March, the most recent figures available from the Bureau of Labor Statistics, it was 62.9 percent — the same rate as January 2017, the month Obama left office and Trump was sworn in.", "As we’ve explained before, economists have been expecting a continued drop in the participation rate over the next several decades. In 2006, the Bureau of Labor Statistics projected that the decline, which began in 2000, would continue through 2050. BLS cited the aging of baby boomers, a slow decline in women’s participation rates and more young people going to college as reasons for that projection.", "In a 2014 report, the Congressional Budget Office looked at the factors behind the decline in the participation rate from the end of 2007 (the start of the Great Recession) to the end of 2013. It pegged about half of the decline over that period to long-term demographic trends, about a third to “temporary weakness in employment prospects and wages,” and about a sixth to “unusual aspects of the slow recovery.”", "We contacted McCarthy’s office about the lawmaker’s claims but did not receive a response.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]