["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "As of March 15, 33 states had decided to close public schools in hopes of curbing the spread of COVID-19. Millions of students could stay out of school for the rest of the academic year, the Washington Post reports. And so amid the fearmongering and misinformation on Facebook, we found a bright spot: posts, such as this one, claiming that Spectrum would provide free internet to students without it.", "\"If students don’t have access to internet they can call 1.844.488.8398 during the school shutdown for free internet from Spectrum,\" the March 13 post says.", "It was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "But this post happens to be true.", "Charter Communications, a company that provides internet service under the brand Spectrum, on March 13 announced it would offer free internet for 60 days for households with students who don’t already have a Spectrum subscription. The number listed is one digit different than the number in the Facebook post — 1-844-488-8395 — but both connected to Spectrum when we tried calling on March 16.", "\"In the coming weeks, many Americans will be affected either directly or indirectly by COVID-19 and Charter is focused on serving and supporting our 29 million customers,\" the company said in a press release.", "Starting March 16, Charter also started waiving installation fees for new student households and opening its wifi hotspots for public use to, it said, \"ease the strain during this challenging time.\"", "Comcast has announced similar measures, pledging free wifi hotspots around the country \"available to anyone who needs them\" and providing free internet for new customers for 60 days. If existing customers contact the company and let it know that they can’t pay their bills right now, the company won’t disconnect their internet service or charge late fees, the company said.", "Both Comcast and Charter Communications seem to be heeding the call of Federal Communications Commission Chairman Aji Pai, who asked broadband and telephone service providers on March 12 to help keep Americans connected during the coronavirus outbreak, according to the FCC.", "We rate this Facebook post True.", "Facebook post, March 13, 2020", "Charter Communications, Charter to offer free access to Spectrum broadband and wifi for 60 days for new K-12 and college student households and more, March 13, 2020", "Comcast, Comcast announces comprehensive COVID-19 reponse to help keep Americans connected to the internet, March 13, 2020", "Federal Communications Commission, Chairman Pai launches the Keep Americans Connected pledge, March 13, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]