["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Lori Lightfoot, a former federal prosecutor vying to become Chicago’s next mayor, has repeatedly argued that high taxes are driving lower income families out of the city.", "In May, she made a claim that we rated Mostly False about population loss in the Chicago metro area, which she dubiously attributed to the tax burden those residents face.", "Recently, Lightfoot expanded on her crushing tax burden message with a national comparison.", "\"We live in one of the most taxed cities and the most taxed county, unfortunately, in the country,\" she said at a debate in November. \"And low-income families and individuals and working families have shouldered far too great a burden because our tax system, our levies and fees, have been completely regressive.\"", "It’s common practice for office seekers to complain with a broad brush about tax burdens. But such sweeping statements often oversimplify the issue.", "Lightfoot’s claim, it turns out, is no exception.", "Lightfoot said Chicagoans live in one of the most taxed cities and the most taxed county, but what she appears to have meant was that Chicago residents are the most taxed because they have to pay high Cook County taxes on top of high city levies.", "\"Taxes and fees in Chicago and Cook County are forcing low-income families like the one I grew up in out of this city,\" Lightfoot said in a statement emailed to us by her campaign. \"It’s clear we can’t keep treating low-income and middle-class families like an ATM machine with no limit.\"", "To back that up, Lightfoot pointed to more than 300 different fees the city can impose on residents, hefty property taxes and a combined sales tax rate of 10.25 percent on most retail purchases in the city.", "But ranking tax burdens is a far more complex exercise than Lightfoot seems to suggest. Take that Chicago sales tax rate, which indeed is one of the highest in the nation. What the number doesn’t take into account, however, is that Illinois, and by extension Chicago, applies the sales tax more narrowly than do many other places in the nation with lower rates.", "Here, few services are taxed. What’s more, purchases of groceries and drugs are taxed at a steep discount, meaning the high general rate alone doesn’t guarantee Chicagoans pay more in sales taxes.", "Ron Alt, a research economist with the Federation of Tax Administrators, said it’s important to account for both state and local taxes to accurately determine where people pay the most overall. Evaluating local taxes in a vacuum can be misleading, he said, because some states take on more of the cost of local functions than others, allowing municipalities to lower their taxes.", "Illinois is among the states that pick up less, leaving local property taxpayers to shoulder the lion’s share of public education costs, which contributes to higher local taxes here.", "Richard Auxier, a research associate with the Urban-Brookings Tax Policy Center, added that Chicago should be judged against other large cities given the scope of its economy and the scale of public services it provides. He also stressed the need to evaluate which residents bear the heaviest burden in any given municipality.", "With those factors in mind, we turned to a report produced annually by the government of Washington, D.C. that analyzes the combined state and local tax burdens residents at five different income levels face in each state’s largest city as well as the nation’s capital.", "That analysis shows Lightfoot has a point — but only when it comes to low-income Chicagoans.", "A hypothetical Chicago family consisting of two working parents and one school-aged child earning $25,000 faces the fifth-highest tax burden among those 51 jurisdictions. A similar family earning $50,000, meanwhile, pays the 10th-most in major taxes.", "But as the income of Chicago taxpayers increases, their burden declines relative to that of similar earners in other large cities. Chicago families making $75,000 and $100,000 both pay the 16th-highest taxes, while families earning $150,000 rank 22nd among their counterparts.", "Compare that to New York, where lower income earners pay taxes that put them in the middle of the pack nationally, while families that earn more occupy the fifth-highest spot compared to their peers. But that may say more about state than city tax policy because tax deductions offered to New York state residents are far more generous than similar benefits for Illinois taxpayers.", "State constraints on the kind of taxes local governments can levy also play a role. Counties in Indiana, for instance, tack on local income taxes to the state rate, but the Illinois Constitution bars local income taxes.", "In Marion County, home to Indianapolis, the combined rate for individuals is 5.25 percent, higher than Illinois’ 4.95 percent income tax. That helps explain why the D.C tax study shows the burden on low-income families in Indianapolis is nearly as steep as in Chicago even though nominal tax rates in Indiana are considerably lower.", "\"It’s difficult because we want to assess the (local) policy makers on their policy choices, but all of these things work together,\" Auxier said.", "The D.C. analysis requires a few other disclaimers, but they don’t do much to advance Lightfoot’s case.", "The study uses tax rates in effect in 2016, before Illinois raised its flat income tax from 3.75 percent to 4.95 percent. Auxier, however, said that increase wouldn’t be likely to have a major effect on Chicago's rank. And while the report accounts for state and local income taxes, property taxes, sales taxes and auto taxes, it doesn’t cover the myriad fees Lightfoot referenced.", "The Urban Institute has found such charges account for a greater share of local government revenue on average than local sales and local income taxes combined, though the analysis doesn’t break costs down by particular cities. And it’s important to note that Lightfoot contended Chicagoans were among the most taxed, not that they paid the most in fees.", "Lightfoot said, \"we live in one of the most taxed cities and the most taxed county, unfortunately, in the country.\"", "By that, she meant Chicagoans are among the most taxed because they pay high county and city taxes.", "It’s clear the tax burden in Chicago is punishingly regressive, taking a bigger bite out of the overall incomes of poorer residents than the wealthy. That’s a byproduct of not only local but state tax policy.", "So Lightfoot would have been correct had she claimed that low-income Chicagoans are some of the nation’s most taxed. And her broader comments do suggest those residents were the focus of her concern.", "Instead, she made a blanket statement that plays straight into a common but misleading narrative that all in Chicago pay punishingly high taxes.", "We rate her claim Mostly False.", "MOSTLY FALSE – The statement contains an element of truth but ignores critical facts that would give a different impression.", "Click here for more on the six PolitiFact ratings and how we select facts to check.", "Event coverage, mayoral forum hosted by the Chicago Teachers Union, Nov. 19, 2018", "\"No, Chicagoland isn’t the only metro area losing residents,\" PolitiFact Illinois, June 1, 2018", "Email interview: Nadia Perl, Lightfoot spokeswoman, Nov. 23, 2018", "\"City of Chicago doesn’t know how many fees it has on the books, Inspector General says,\" WGN TV, June 21, 2018", "\"Higher fees, taxes in 2016 in Chicago, Cook County,\" ABC 7, Jan. 1, 2016", "\"This city now has America’s highest sales tax,\" Fortune, July 16, 2015", "Report: Sales tax rates in major cities, Tax Foundation, Oct. 23, 2017", "\"Illinois considers applying sales taxes to more services,\" The Associated Press, Mar. 12, 2017", "Email interview: Ron Alt, research economist with the Federation of Tax Administrators, Nov. 27, 2018", "Phone interview: Richard Auxier, research associate with the Urban-Brookings Tax Policy Center, Nov. 28, 2018", "Report: National tax burden comparisons, Government of the District of Columbia, Dec. 2017", "Report: State individual income tax rates, Tax Foundation, March 5, 2018", "Report: Tax credits for working families, National Conference of State Legislatures, April 17, 2018", "Report: State and local tax revenues, The Urban Institute, 2015", "Email interview: Benjamin Harris, professor at Northwestern University and former White House economic advisor, Nov. 26, 2018", "Email interview: Amanda Kass, associate director of the Government Finance Research Center at the University of Illinois Chicago, Nov. 28, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]