["About this rating", "Arabic numerals are practically ubiquitous in the United States. You can see them in the title of this article, in the publishing date, or on any digital clock. In short, and according to Merriam-Webster, an Arabic numeral is \"any of the number symbols 0, 1, 2, 3, 4, 5, 6, 7, 8, 9.\"", "So people were a bit shocked when a screenshot showing the results of a survey question in which 56% of respondents said that schools in America shouldn't teach Arabic numerals circulated on social media in May 2019:", "Those were the results of a real survey question posed by the polling company Civic Science. John Dick, the Twitter user who originally posted a screenshot of the survey question, is the CEO of Civic Science.", "The full survey doesn't appear to be available at this time (we reached out to Civic Science for more information), but Dick has posted a few other questions from the poll, as well as some information regarding the purpose of the survey.", "Dick, who said that the \"goal in this experiment was to tease out prejudice among those who didn't understand the question,\" shared another survey question about what should or shouldn't be taught in American schools. This time, the survey found that 53% of respondents (and 73% of Democrats) thought that schools in America shouldn't teach the \"creation theory of Catholic priest Georges Lemaitre\" as part of their science curriculum:", "Just as respondents to the Arabic numerals question were likely unsure of what \"Arabic numerals\" referred to, the respondents to this question likely thought that Catholic priest Georges Lemaitre's \"creation theory\" referred to creationism. In truth, however, Lemaitre's \"theory of creation\" was an explanation for the expansion of the universe, now better known as the \"big bang theory.\"", "Dick's tweet about the Arabic numerals question was retweeted more than 20,000 times. As of this writing, his tweet about Georges Lemaitre has been shared less than 10 times.", "While some commenters argued that these questions were not comparable, Dick maintained that they both illustrated how tribalism influenced answers when people misunderstood questions:", "The \"Arabic numeral\" survey question is reminiscent of another viral questionnaire put forth by Public Policy Polling (PPP) in December 2015. That survey found that 41% of Donald Trump supporters (and 19% of Democrats) favored bombing the city of \"Agrabah,\" which, is a fictional locale from the Disney animated film Aladdin.", "Khan, Shebab.   \"Georges Lemaître: Who Was the Belgian Priest Who Discovered the Universe Is Expanding?\"\r\n    Independent.   17 July 2018.", "Merriam-Webster.   \"Arabic Numeral.\"\r\n    Retrieved 15 May 2019.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]