["Restauranteur and Top Chef host Tom Colicchio signs autographs at the Taste of the NFL at Tropicana Field in St. Petersburg in 2009. We checked a recent tweet he sent about debt under the past five presidents.", "Tom Colicchio is a celebrated chef, restauranteur and reality TV personality. But how is he as a political tweeter?", "We recently noticed a tweet Colicchio sent to his 420,000-plus followers on Oct. 20, 2013, that offered the percentage increase in the federal debt under the past five presidents. Here’s the text of the tweet:", "\"Debt increase by POTUS:", "\"Reagan 186%", "\"Bush 54%", "\"Clinton 41%", "\"Bush II 72%", "\"Obama 23% ...", "\"Interesting.\"", "This sounded familiar -- in 2011, we fact-checked a claim by House Minority Leader Nancy Pelosi, D-Calif., that President Barack Obama \"increased the debt\" by 16 percent, compared to George W. Bush, who increased it by 115 percent. We gave that claim a Pants on Fire.", "Colicchio’s claim is slightly different, and it comes almost two and a half years after Pelosi’s, so we decided to take a new look. Did the debt increase by 23 percent under Obama, a lower rate than under any president going back to Ronald Reagan?", "Because the most easily accessible Web data covers different time periods, we turned to two sources. The Treasury Department’s \"Debt to the Penny\" feature, which tracks the debt on a day-to-day basis, goes back to 1993, so we used that source for Clinton, George W. Bush and Obama. For Reagan and George H.W. Bush, we used Office of Management and Budget historical data, which shows the debt level at the end of the fiscal year. That’s not a perfect fit with presidential terms -- the fiscal year ends on Sept. 30 while the president is sworn in on the following Jan. 20 -- but we determined it was close enough for a rough estimate.", "So how do the presidents stack up when you measure the raw increase in debt during their tenure -- the specific statistic the tweet appears to cite? Here’s the list:", "Reagan: Up 188 percent", "George H.W. Bush: Up 52 percent", "Clinton: Up 37 percent", "George W. Bush: Up 86 percent", "Obama: Up 61 percent", "So the tweet is wrong both on Obama’s percentage (the actual percentage increase in the debt was more than double what the tweet said it was) and on his relative position compared to the other presidents (Obama was in the middle of the pack rather than presiding over the smallest debt increase).", "However, another method of measuring presidential debt increases is superior to these raw numbers. This method adjusts the numbers to neutralize the impact of time, inflation and population growth -- issues that can skew debt comparison. We do this by tracking debt as a percentage of gross domestic product. Here’s how the numbers shake out:", "Reagan: Up 20.6 percentage points, or 2.6 points per year in office", "George H.W. Bush: Up 13.0 percentage points, or 3.3 points per year in office", "Clinton: Down 9.7 percentage points, or down 1.2 points per year in office", "George W. Bush: Up 28.7 percentage points, or 3.6 points per year in office", "Obama: Up 21.4 percentage points, or 5.4 points per year in office", "So by this measurement, Obama’s debt accumulation per year actually ranks as the most profligate record of any of the past five presidents -- quite the opposite conclusion of the tweet.", "We should note that presidents have some impact on the debt accrued during their tenure, but that impact is not all-encompassing. While presidents propose budgets and sign off, along with Congress, on final spending and revenue numbers, debt tends to go up during recessions, and Obama came into office with a doozy of a recession under way. That’s surely affected his numbers.", "We’ll also note that Obama has made progress on a related, but distinct, issue -- shrinking the annual federal deficit. People sometimes confuse deficits and debt. There’s a deficit if more money was spent in a given year than came in. But if you add up all the past deficits (and subtract all the past surpluses), the resulting figure, if it’s negative, is the \"debt.\" And in this case, the tweet discussed the total debt, not annual deficits.", "When we contacted Colicchio, he quickly emailed us to walk back his tweet: \"This info was tweeted to me. I simply tweeted it and said it was interesting. Thanks for the info.\" Shortly after that, he took it down.", "Our ruling", "Colicchio tweeted that under President Barack Obama, the debt has increased by 23 percent, a smaller rise than under any president going back to Ronald Reagan. Using the same method as the tweet, the actual increase under Obama was much higher -- 61 percent -- leaving Obama in the middle of the pack of the five presidents. Adjusting for each president’s time in office and the size of the economy actually puts Obama atop list of debt-creating presidents. We rate Colicchio’s claim False.", "Tom Colicchio, tweet, Oct. 20, 2013 (subsequently deleted)", "Office of Management and Budget, \"Table 7.1—Federal Debt at the End of Year: 1940–2018,\" accessed Oct. 22, 2013", "Treasury Department, \"Debt to the Penny,\" accessed Oct. 22, 2013", "PolitiFact, \"Nancy Pelosi posts questionable chart on debt accumulation by Barack Obama, predecessors,\" May 19, 2011", "PolitiFact, \"Obama says deficit is falling at the fastest rate in 60 years,\" July 25, 2013", "Email interview with Tara Sinclair, George Washington University economist, Oct. 22, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]