["By Saranac Hale Spencer", "Posted on June 17, 2020", "A meme misrepresents a 2007 criminal case in Houston involving George Floyd. The meme distorts the details of Floyd’s case and includes a photo of a woman who was badly injured in an unrelated attack in Spain in 2018.", "A popular meme has misrepresented a criminal case involving George Floyd more than a decade ago.", "Floyd’s death in police custody on May 25 sparked nationwide protests against racism and police violence, which has made the incident a target for misinformation since then.", "Now a meme with a photo of a woman’s bruised and bloody face is circulating on social media with this claim: “Aracely Henriquez was the woman kidnapped and brutally beaten by George #Floyd and his five accomplices, as they searched her home for drugs and money. She was pregnant at the time, and he asked her if she wanted him to kill her baby.”", "But the woman pictured is not Aracely Henriquez. The photo actually shows Andrea Sicignano, an American student who was raped and beaten in Madrid, Spain, in 2018.", "In a June 12 post on Facebook, Sicignano wrote, “Today my photo is being used as political propaganda/click bait to make people believe that George Floyd deserved to die.” She asked that those who see her photo being used that way report it to Facebook and correct the person who shared it.", "The photo, Sicignano explained in her recent post, was taken at the hospital after she was attacked. She posted it on Facebook shortly after the attack, and the picture was later published in a Spanish newspaper, which is likely where it was taken from for the meme.", "Beyond the use of the picture, the meme gets other parts of the claim wrong, too.", "Here’s what’s true about the case:", "Floyd pleaded guilty in 2009 to aggravated robbery with a deadly weapon. He was not charged with kidnapping or assault.", "According to the complaint in the case, filed in 2007, Floyd was one of six men who forced his way into the Houston home that Aracely Henriquez shared with Angel Negrete and a 1-year-old child.", "One of the men claimed to be from the water department in order to get Henriquez to open the door. Then Floyd, who was described as the biggest of the men who pulled up in a black Ford Explorer, forced his way in and “placed a pistol against the complainant’s abdomen, and forced her into the living room,” the complaint says. It doesn’t say whether or not Henriquez was pregnant.", "Floyd then searched the house while another man guarded Henriquez. That man hit her in the “head and side areas” with his pistol after she “screamed for help,” the complaint says.", "So, while Floyd did plead guilty to a charge stemming from the invasion of Henriquez’s home, the picture circulating with the claim doesn’t show Henriquez and the claim distorts the details of the case.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "FactCheck.org. “Falsehoods Follow George Floyd’s Death.” 29 May 2020.", "Galloway, Heather. “American student attacked and raped in Madrid neighborhood of Aluche.” ElPais.com. 26 Dec 2018.", "Sicignano, Andrea. Facebook post. 12 Jun 2020.", "State of Texas v. Floyd, George. Judgment. 3 Apr 2009.", "State of Texas v. Floyd, George. Indictment. 13 Mar 2008.", "State of Texas v. Floyd, George. Complaint. 27 Nov 2007.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]