["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "House Speaker Will Weatherford said students are paying more for cell phones than they are for tuition. Photo courtesy WTSP.", "Let’s talk tuition.", "College tuition increases are a no-go with Gov. Rick Scott, who wants to keep the cost of living low for families. House Speaker Will Weatherford, on the other hand, thinks Florida students are getting a great deal and can afford to pay a little more.", "Weatherford explained his views at a meeting of the Florida Board of Governors, which oversees state universities, on March 28, 2013.", "The board’s student member, Cortez Whatley, asked Weatherford why the House recommended a 6 percent tuition increase for state universities.", "Florida’s tuition is \"48th\" lowest in the country, Weatherford said. (Quick fact-check: It ranks 41st in 2013. Weatherford has since corrected himself.)", "\"Let me put in perspective something for you that no one’s talking about that should be talked about in this debate,\" he said. \"The average student in Florida, what they actually pay out of pocket at our major universities, I believe all universities, is about the same amount of money as they spend on this.\"", "He held up his iPhone.", "\"We’re more than willing to negotiate with our friends in the Senate and the governor, but we think to just take tuition off the table and ignore the fact that we’re ranked so low, and ignore the fact that our students are spending more on cellphones to some extent than they are on tuition, is not right,\" he said.", "Students spend as much on tuition as their cellphone? We thought it didn’t sound right.", "We admit to being a little surprised by what we found.", "Tuition in Florida", "Florida’s average price for undergraduate tuition and fees at a public university is $6,069 in 2012-13, according to the Board of Governors. That’s up from an average of $5,531 in 2011-12.", "Tuition used to be even lower but public universities have been bumping up tuition to offset steep budget cuts. As a result, the price tag for tuition at a four-year public university in Florida jumped 67 percent over the past five years. Florida’s five-year percentage leap for tuition was one of the highest in the country, according to the College Board’s 2012 Trends in College Pricing report.", "Still, most in-state students don’t pay full price. Many receive scholarships, grants and other financial aid. Once you factor in \"gift aid\" such as Bright Futures and Pell grants, a student’s out-of-pocket expenses for tuition and fees comes down.", "Weatherford’s spokesman and the Board of Governors sent us system-wide averages for gift aid versus what students actually paid in tuition and fees for 2011-12. This is for an in-state undergraduate student taking 15 credit hours of courses each fall and spring semester.", "So the average financial gift amount per full-time, in-state undergraduate student for the school year is $4,646. The average amount of what a student actually paid out-of-pocket for tuition and fees is about $400.", "The out-of-pocket expense varies widely by family income. Students whose families earn below $60,000 -- and comprise about 44 percent of the university system -- don’t pay out-of-pocket for tuition on average because they receive more gift aid based on need. Many of the students in this income bracket are paying for college independently of their parents, said College Board policy analyst Kathleen Payea.", "Students whose families earn more receive fewer dollars in gift assistance and pay between $1,500 and $2,000.", "The amount a student shells out for tuition and fees also varies at each state university. The average student at Florida A&M and Florida Atlantic University, for example, does not pay out-of-pocket for tuition and fees, according to data from the Board of Governors. On the other end of the spectrum, a student at the University of Central Florida pays an average of $1,600. At the University of Florida, the average is $248.", "You might be wondering, that’s it? Keep in mind this analysis excludes other types of financial aid, such as loans, that students must pay back, as well as money their parents paid in through the Florida Prepaid college savings program.", "It’s worth noting the average student faces thousands more in expenses that go to the total cost of attending a university -- books, transportation, room and board. At the University of South Florida in Tampa, for example, the average 2012-13 cost of attendance for a full-time, in-state student not living with his or her parents was $20,390. For in-state commuter students, it’s about $16,000.", "Still, Weatherford was careful to specify tuition.", "Payea said Weatherford’s comparison about cellphone bills and tuition is awkward, as paying for higher education is a long-term investment unlike a monthly discretionary item like a phone. Still, his example may help defray fears about college costs.", "\"Sticker prices appear to be high, but there are so many subsidies,\" she said.", "We’ll note that the state changed Bright Futures eligibility requirements, primarily higher test scores, to make the scholarships harder to get. A University of South Florida analysis determined the changes will most likely reduce the number of black and Hispanic freshmen getting the scholarship, according to the Tampa Bay Times.", "The price of cellphones", "Now we turn to the second part of our analysis: the cost of cellphones. About 86 percent of U.S. residents said they have one, according to the Pew Research Center.", "Weatherford spokesman Ryan Duffy directed us to a September 2012 Wall Street Journal story in support of his claim. If Weatherford’s point is cellphones are affordable (like two semesters of in-state tuition), the story’s headline does not reinforce it: \"Cellphones are eating the family budget.\"", "The story describes how the increasing costs of cellphones force families to scrimp elsewhere. Costs are going up even more in the next few years as wireless providers figure out how to make data even faster and more accessible on new networks.", "The story cites Labor Department data showing annual household spending on phone services (not isolated to just cellphones) was $1,226 in 2011, up from $1,110 in 2007.", "An estimate from J.D. Power and Associates puts it even higher for this year, showing the average wireless bill reported by consumers to be $111 as of March 2013 (or $1,332 for the year).", "Those annual bill totals are more than the system-wide average for out-of-pocket costs for  tuition and fees (again, about $400). If you isolate cash-paying students, the total tuition bill actually exceeds a year’s worth of cellphone bills, but not dramatically so.", "Our ruling", "Weatherford defended his call for a tuition hike before the leaders of the state university system by saying students spend more on cellphones than \"what they actually pay out of pocket at our major universities\" for tuition.", "We found his point is accurate if you compare the average out-of-pocket cost for all schools against the average cellphone bill, but there are caveats.", "Remember, he’s just talking about tuition, not the many other costs involved with a student’s degree.", "For the cash-paying families that comprise a majority of the system, the comparison is a little off, with students paying more for tuition than the average cellphone. Others spend a lot less on tuition, or a lot more, depending on their university. More than one-third of Florida’s public university students receive enough merit- and need-based financial aid that they do not pay anything for tuition and fees.", "Weatherford’s claim is accurate but needs clarification. We rate it Mostly True.", "Audio of Will Weatherford at Florida Board of Governors meeting, March 28, 2013", "Interview with Ryan Duffy, Weatherford spokesman, March 28, 2013", "Interview with Kim Wilmath, Board of Governors spokeswoman, March 28, 2013", "Support for Weatherford’s statement from Duffy, March 28, 2013", "Wall Street Journal, \"Cellphones are eating the family budget,\" Sept. 28, 2012", "College Board, Trends in College Pricing 2012, accessed March 28, 2013", "Florida Board of Governors, Budget and Finance Committee meeting materials, July 2012", "Florida Board of Governors, 2012-13 College Board Tuition and Fees by State, accessed March 28, 2013", "University of South Florida 2012-13 cost of attendance", "University of Florida 2012-13 workplan", "University of South Florida 2012-13 workplan", "NBC News’ The Red Tape Chronicles, \"Industry group says cellphone bills are shrinking; is yours?\" March 21, 2013", "Interview with Kathleen Payea, College Board policy analyst, March 29, 2013", "Bureau of Labor Statistics, consumer expenditure survey midyear tables, released March 27, 2013", "Interview with John Tews, J.D. Power and Associates spokesman, March 29, 2013", "Interview with Gary Steinberg, Bureau of Labor Statistics spokesman, March 29, 2013", "Pew Research Center, \"Cellphones nearly universal in much of the world,\" Feb. 4, 2013", "Tampa Bay Times, \"Bright Futures changes could impact thousands of Hispanic and black students,\" April 3, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]