["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Gov. Greg Abbott said he met a teacher in Dallas “who was only in his third year of teaching and already making more than $90,000 a year in salary.” (Rodolfo Gonzalez/American-Statesman)", "Texas lawmakers are looking at different ways to boost teacher pay during this year’s legislative session, debating proposals that include across-the-board raises and merit-based increases for top educators.", "Raising teacher pay is a priority for Gov. Greg Abbott, who discussed the initiative during his February state of the state address.", "He said an incentive pay program in one Texas school district created a path to six-figure salaries for effective teachers.", "\"When I visited Blanton Elementary School in Dallas, I met an outstanding teacher who was only in his third year of teaching and already making more than $90,000 a year in salary,\" he said.", "We were curious about Abbott’s salary statement, can a third-year teacher be making close to six-figures?", "It’s true that experienced teachers in the Dallas school district can pull in a $90,000 base salary, but it typically takes years to get there. Those with less experience have also reported high earnings in the district — usually through a combination of salary, stipends and bonuses tied to performance and other factors, such as being bilingual or teaching in schools with low student academic performance.", "Teacher from Abbott’s claim earned bonuses", "Abbott’s office did not return requests for more information about the teacher he cited in his speech. Dallas school officials wouldn’t name the educator, but we found he had spoken to another media outlet and called him.", "Josue Tamarez Torres, who teaches fourth grade science and math in the Dallas school district, said he believes he was the teacher cited in Abbott’s speech.", "Last school year it was Tamarez Torres’ third year at Blanton Elementary School, he said, but his eighth year teaching in the Dallas school district.", "While he did earn more than $90,000 in the last school year, Tamarez Torres’ base salary was $82,000. On top of that, he earned a $12,000 stipend for teaching at a low-performing school through the district’s Accelerating Campus Excellence initiative.", "He remembers meeting with Abbott last summer to talk about the district’s pay structure, but only learned their conversation would be part of Abbott’s speech after it was delivered in February from the governor’s office, he said.", "Pay plan relies on performance, school quality", "The Dallas school district, the second largest district in Texas, adopted a salary model about five years ago that pays teachers based on their effectiveness in the classroom. Educators are judged on several measures, including teaching performance and student growth and feedback, said Suzy Smith, director of performance management for the Dallas school district.", "Teachers ranked in the top tier — known as masters — can earn a base salary of $90,000 under the district’s Teacher Excellence Initiative.", "But it takes years to get there.", "A teacher who has spent three years in the classroom can earn base pay of up to $74,000, according to the district's salary schedule. A novice teacher makes a starting salary of $50,000 a year.", "Still, teachers can further boost their compensation through bonuses and incentives.", "The district’s Accelerating Campus Excellence initiative offers one of the largest salary boosts. Educators can earn annual stipends of up to $12,000 to teach in the lowest-performing schools, said the program's director Shatara Stokes. The exact stipend amount depends on the teacher’s effectiveness.", "It means teachers with three years experience in the classroom who earn the highest base pay and the top Accelerating Campus Excellence stipend can earn $86,000 in annual compensation.", "There was another teacher with three years experience who worked at Blanton Elementary last school year and pulled in more than $90,000 between her $74,000 base salary, a $12,000 Accelerating Campus Excellence stipend and a $3,000 stipend given to bilingual teachers.", "She also receives $3,692 in supplemental pay for tutoring and for covering the cost of classroom supplies, according to Dallas school district spokeswoman Robyn Harris.", "Harris said the district doesn’t believe the governor was referring to this teacher in his speech.", "This school year, there are two teachers who had three years of experience when they made the jump to the $74,000 base salary. But neither teaches at a campus where teachers are eligible for the Accelerating Campus Excellence stipend, making it unlikely their total compensation exceeds $90,000, Harris said.", "Our ruling", "Abbott said he met a teacher \"who was only in his third year of teaching and already making more than $90,000 a year in salary.\"", "While Abbott met a teacher who was earning over $90,000 last year, the educator had more than three years of experience in the classroom. It’s possible for newer teachers at Dallas ISD to earn that much in one year, but only through bonuses and stipends paid on top of their base salaries.", "We rate this claim Mostly False.", "MOSTLY FALSE – The statement contains an element of truth but ignores critical facts that would give a different impression.", "Email interview with Robyn Harris, Director of News and Information for Dallas ISD, April 23, 2019.", "Dallas ISD, Teacher Excellence Initiative Salary Calculator, accessed April 23, 2019.", "Phone interview with Shatara Stokes, director of the ACE schools program, and Suzy Smith, Director of Performance Management for Dallas ISD, April 3, 2019.", "San Antonio Express-News, State leaders point to Dallas ISD as model for struggling schools, accessed April 23, 2019.", "Transcript of Gov. Greg Abbott’s 2019 State of the State Address, accessed April 23, 2019.", "Video of Gov. Greg Abbott's 2019 State of the State Address, accessed April 23, 2019.", "Phone interview with Josue Tamarez Torres, Dallas ISD teacher, April 30, 2019.", "Dallas ISD, Compensation Resource Book 2018-2019, accessed May 6, 2019.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]