["By Eugene Kiely", "Posted on January 17, 2017", "On NBC’s “Meet the Press,” Rep. John Lewis said he will boycott President-elect Donald Trump’s inauguration, claiming it will be the first time he has missed a presidential inauguration since joining Congress 30 years ago. In fact, Lewis also skipped George W. Bush’s 2001 inauguration in protest.", "In an interview taped Jan. 14, Lewis told Chuck Todd, the host of “Meet the Press,” that he did not consider Trump to be “a legitimate president.” Lewis cited a U.S. intelligence report that said Russia had waged a broad “influence campaign” in the U.S. to help elect Trump.", "Lewis, Jan. 14: I think the Russians participated in helping this man get elected. And they helped destroy the candidacy of Hillary Clinton. I don’t plan to attend the inauguration. It will be the first one that I miss since I’ve been in the Congress. You cannot be at home with something that you feel that is wrong, is not right.", "It turns out that Lewis forgot where he was on Jan. 20, 2001.", "As pointed out by a few news organizations, including the Blaze, Lewis boycotted Bush’s 2001 inauguration. The Blaze quoted from a Jan. 21, 2001, story in the Washington Post’s Style section that said: “Some members of the Black Caucus decided to boycott Inauguration Day; John Lewis, for instance, spent the day in his Atlanta district. He thought it would be hypocritical to attend Bush’s swearing-in because he doesn’t believe Bush is the true elected president.”", "We contacted Brenda Jones, the congressman’s spokeswoman, who confirmed in a statement that Lewis boycotted the 2001 inauguration. In that case, Bush was not declared the winner until mid-December of 2000, when the U.S. Supreme Court ordered an end to the Florida recount and Democratic nominee Al Gore gave his concession speech.", "“Rep. Lewis also missed one other inauguration, the first inauguration of President George W. Bush,” Jones said in a statement emailed to us. “His absence at that time was also a form of dissent. He did not believe the outcome of that election, including the controversies around the results in Florida and the unprecedented intervention of the US Supreme Court, reflected a free, fair and open democratic process.”", "Lewis represents Georgia’s 5th Congressional District, and has been a member of Congress since 1987. He is also a civil rights icon. Lewis suffered a skull fracture when state and local police attacked civil rights marchers who tried to cross the Edmund Pettus Bridge in Selma, Alabama, on March 7, 1965.", "Trump responded to the congressman’s snub by accusing Lewis of neglecting his district. In a couple of tweets posted Jan. 14, Trump said Lewis is “all talk, talk, talk – no action or results.”", "The president-elect’s criticism of Lewis triggered a backlash on Martin Luther King Day weekend, as other Democrats announced that they, too, would boycott the inauguration.", "But Trump got the last word in this dispute with Lewis.", "John Lewis said about my inauguration, \"It will be the first one that I've missed.\" WRONG (or lie)! He boycotted Bush 43 also because he…", "— Donald J. Trump (@realDonaldTrump) January 17, 2017", "\"thought it would be hypocritical to attend Bush's swearing-in….he doesn't believe Bush is the true elected president.\" Sound familiar! WP", "— Donald J. Trump (@realDonaldTrump) January 17, 2017", "Politifact Rating:", "Read More", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]