["About this rating", "In December 2020, an online advertisement displayed a picture of an Olive Garden Italian Restaurant sign along with text that read: \"Closing Time: Here's All The Restaurant Chains Closing in 2020.\"", "This advertisement was misleading. Olive Garden is not closing all of its restaurants. Readers who clicked the advertisement were led to a 50-page story on the website Money Pop.", "While the advertisement promised a list of restaurant chains that would be closing in 2020, the headline on the actual story was different: \"These Popular Restaurant Chains Are Losing Money Fast.\"", "The story mentioned Olive Garden, but it only mentioned that two locations had closed in Springfield, Massachusetts, and Birmingham, Alabama, in March and April, respectively.", "Olive Garden did not go out of business in 2020, but that's not to say it hadn't faced financial hardship during the COVID-19 pandemic. The coronavirus had led to the closure of dine-in services at thousands of different restaurants across the United States. This meant less revenue, which resulted in lost jobs. In many cases, restaurants closed.", "On June 22, 2020, Nation's Restaurant News reported that National Restaurant Association President and CEO Tom Bené said the restaurant industry had faced \"catastrophic losses.\"", "Darden Restaurants owns the Olive Garden brand, as well as LongHorn Steakhouse, Cheddar's Scratch Kitchen, Yard House, The Capital Grille, Seasons 52, Bahama Breeze, and Eddie V's.", "On Dec. 9, 2020, InvestorPlace.com reported that Darden had managed to survive the pandemic thus far, but it also asked: \"What's next for Darden Restaurants?\"", "The bull case is built on a bear case regarding other restaurants. Without government help, small operators are closing by the score. This means chains like Darden may be all that’s left when people again feel safe to eat out.", "Darden has managed to make money at Olive Garden while closing half its tables. It reinstated the dividend and paid back its $270 million emergency loan. Once the pandemic is over, Cramer predicts, fast-casual chains like Olive Garden will be “the height of fine dining.”", "Darden is expected to report earnings Dec. 18, for the quarter ending in November. The estimate is for 72 cents per share of net income on $1.7 billion of sales. That would beat last year’s profit on 17% less revenue.", "The Money Pop story also mentioned The Cheesecake Factory on its list. We previously covered that rumor as well.", "Snopes debunks a wide range of content, and online advertisements are no exception. Misleading ads often lead to obscure websites that host lengthy slideshow articles with lots of pages. It's called advertising \"arbitrage.\" The advertiser's goal is to make more money on ads displayed on the slideshow's pages than it cost to show the initial ad that lured them to it. Feel free to submit ads to us, and be sure to include a screenshot of the ad and the link to where the ad leads.", "Jordan Liles is a Senior Reporter who has been with Snopes since 2016.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]