["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "In his final push before the midterms, President Donald Trump promoted a political video that says Democrats are responsible for letting a murderer stay in the country illegally to kill people.", "Trump tweeted a campaign-style video Oct. 31 about two California sheriff officers who were shot to death by an immigrant in the country illegally.", "The video opens with courtroom footage of a smiling Luis Bracamontes. Superimposed are the words, \"Illegal immigrant, Luis Bracamontes, killed our people!\"", "As Bracamontes boasts about killing the two officers and saying he would kill more if he could, new text says, \"Democrats let him into our country.\"", "That’s quickly followed with, \"Democrats let him stay.\"", "The video continues with footage from the caravan of Central Americans moving north in Mexico. At the end, it returns to Bracamontes’ smirking face and asks, \"Who else would Democrats let in?\"", "The final text says, \"President Donald Trump and Republicans are making America safe again.\"", "Was Bracamontes in America because Democrats let him in? Not for his most recent entry. And did lax policies under Democrats let him stay? He evaded discovery, despite increasing efforts to track down criminal and immigration law offenders.", "Bracamontes in April was sentenced to death for the killings in California of Detective Michael Davis, Jr., and Deputy Sheriff Danny Oliver.", "Davis, of the Placer County Sheriff’s Office, responded in October 2014 to a call of a suspicious vehicle occupied by a man and a woman. Davis was shot as he got out of his car and later died in the hospital.", "Authorities said that before shooting Davis, Bracamontes also shot and killed Oliver, of the Sacramento County Sheriff's Department, when he was investigating a suspicious vehicle in a motel parking lot that same day. Authorities said Bracamontes shot Oliver in the forehead and then fled.", "Bracamontes was convicted of the killings in February 2018; he is currently in California's San Quentis State Prison. His wife, Janelle Monroy, was convicted of assisting Bracamontes and sentenced to nearly 25 years in prison, the Sacramento Bee reported.", "Bracamontes comes from Mexico, and his adult life followed a pattern of sneaking across the border, being deported, and sneaking back in.", "He was arrested for drug possession in Arizona in 1996. That was in Maricopa County, the home of then-Sheriff Joe Arpaio. Federal authorities deported him in 1997.", "He was arrested in Arizona again in 1998, turned over to immigration authorities, but apparently not deported. Another arrest on drug and weapons charges followed in 2001, and he was deported again. (There’s one report of another arrest in Maricopa County later in 2001.)", "Sometime after 2001, Bracamontes moved to Utah and began using an alias.", "Utah court records show that between 2003 and 2009, he had 10 driving violations. But none were serious enough to require fingerprints, according to the New York Times. In 2010, Utah entered into an agreement with Immigration and Customs Enforcement, or ICE, to assist the agency in immigration enforcement.", "Bracamontes’ time in America up to the killings spanned three administrations.", "He was arrested and deported once under Democratic President Bill Clinton, but there was a failure to deport him in 1998.", "He was arrested and deported again in 2001, this time under Republican President George W. Bush. He came back that same year, and was arrested again in 2001.", "After that, Bracamontes apparently evaded deportation through the time of his 2014 killing spree during the administration of Democratic President Barack Obama.", "So for eight years, from 2001 through 2008, you could argue a Republican administration failed to identify and definitively deport him. For five years, from 2009 to 2014, a Democratic administration similarly failed. (And if you want to give blame to Congress for not passing stricter laws or dedicating more resources, the two different parties shared control of Congress during the timeframe in question.)", "Immigration enforcement tools strengthened after 9/11 with the subsequent creation of the Department of Homeland Security, said Randy Capps, director of research for U.S. programs at the nonpartisan Migration Policy Institute.", "The Obama administration ramped up efforts to track down felons who were in the country illegally. It expanded the Secure Communities program launched under Bush. The program fostered information sharing among federal agencies and local jails.", "Immigration enforcement priorities during Obama’s first term were just as broad as they are now, with people being deported for things such as traffic violations, Capps said. Immigrant advocates in 2014 famously dubbed Obama the \"deporter-in-chief.\"", "Overall, research shows that the crime rate among immigrants, including those here illegally, is lower than in the general population, Capps said.", "\"The implication of this video is that there’s a large number of criminals in the unauthorized population, which isn’t true,\" Capps said. \"That’s the fundamental point of this commercial, and it’s wrong.\"", "It’s not the first time that Trump has brought up Bracamontes in his narrative about illegal immigration. Trump invited the officers’ family members to his first address to a joint session of Congress in 2017, where he highlighted crimes by immigrants in the country illegally.", "Trump’s tweet included footage of migrants walking north to the United States, of some attempting to push through a fence at the Guatemala-Mexico border, and of a Fox News interview of a man in the caravan saying he wanted to ask for pardon. A woman translating in the video says the pardon he’s seeking is for attempted murder.", "Trump’s tweet suggests Democrats would let in murderers into the United States. Democrats are not telling caravans to come in, as Trump has falsely claimed. They’ve said people who seek asylum should be allowed to go through that legal process. But asylum applicants would need to be screened by Trump’s administration before being granted the immigration protection.", "Trump tweeted a video that said \"Democrats let him (cop killer Luis Bracamontes) into our country,\" and \"Democrats let him stay.\"", "The reality is that Bracamontes’ last illegal entry was under Bush, a Republican president. The majority of his time going undetected was also on the Republican watch, though some of it was on the Democrats’ watch, too.", "Democratic and Republican administrations deported Bracamontes, but also failed to keep Bracamontes out of the United States. We found no evidence that he was proactively allowed to stay. We rate this claim Pants on Fire.", "Clarification: Federal immigration enforcement was reorganized after 9/11, and subsequently, Immigration and Customs Enforcement, or ICE, received its current name. This report has been updated to remove references to the name ICE prior to 2003.", "Twitter, @realdonaldtrump tweet, Oct. 31, 2018", "CBS Sacramento, How Did Luis Enrique Monroy-Bracamonte Hide In United States Illegally Until Deputy Killings?, Oct. 26, 2014", "Sacbee.com, Cop killer Bracamontes gets tossed from court, then gets death penalty, April 25, 2018; ‘I think the drugs were causing his hallucinations.’ New details from alleged cop killer’s wife., Sept. 12, 2017, updated Sept. 13, 2017", "Ice.gov, MOA with Utah for Secure Communities", "Fox40.com, Timeline Emerges of Marquez, aka Bracamonte, Arrest Record, Oct. 28, 2018", "Phone interview, Randy Capps, director of research for U.S. programs at the nonpartisan Migration Policy Institute, Nov. 1, 2018", "New York Times, U.S. Immigration Laws Face New Scrutiny After Killings, Oct. 28, 2014", "PolitiFact, Trump says Secure Communities, 287(g) immigration programs worked, Sept. 6, 2016", "Migration Policy Institute, The Obama Record on Deportations: Deporter in Chief or Not?, Jan. 26, 2017", "PolitiFact, Guests at President Donald Trump’s first speech to Congress, Feb. 28, 2017", "PolitiFact, Donald Trump falsely says Democrats invite migrant caravans, Nov. 1, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]