["About this rating", "In March 2017, a strange piece of footage started circulating on conspiracy theory web sites along with a variety of titles and claims, such as \"Human or not? Bikers in Indonesia film a mysterious humanoid creature,\" and \"Real Hobbit is Accidentally Caught On Camera in Aceh Forest.\"", "The video, which reportedly shows a naked man spooking a group of dirt bikers before disappearing into a field of tall grass, was originally uploaded to the YouTube page \"Fredography\" on 22 March 2017:", "Although the video's description provided a general location for the footage — the Aceh region of Indonesia — the uploader was not willing to provide further information:", "Do not ask where, will remain confidential! Watch alone ... \"could be a primitive population, could be the claimant black magic.\"", "So what exactly does this video show? Let's examine some of the most prominent theories behind this footage.", "It's fake", "While conspiracy theorists may claim that the figure spotted in this video is some sort of hobbit or humanoid, other commentators had a simpler explanation: It's fake. This theory holds that the \"creature\" was digitally inserted into the footage, similar to this video of a bear chasing a biker through the woods, or this video of a snowboarder being chased by another bear.", "The most convincing piece of evidence for this theory is a still frame from the video:", "Other commenters claim that the real evidence that the video was faked comes toward the end of the footage, when the figure disappears into the tall grass:", "Look carefully when the man enters the tall grass. The grass didn't even move one bit and the man just disappears.", "We slowed down the video to take a closer look at this moment, and did not find that argument convincing. Once the figure \"disappears,\" the stick it is carrying can still be seen as it enters the grass:", "It's a hobbit/Manti tribe member", "One of the reasons that this video has become so popular is its connection to a piece of Indonesian folklore. Many believe that the figure seen in the video matched the description (tan, with a short stature) of the mythical Mante Tribe. However, experts say that there is little evidence this tribe exists:", "Anthropologist Fikarwin Zuska of the University of North Sumatra in Medan said no scientific research had proven the existence of the Mante tribe.", "“The tribe has only been found in Aceh or Gayo folklore,” Fikarwin said on Friday, adding that books based on folklore made some people consider the story part of history.", "Aceh historian Rusdi Sufi is also doubtful that the figure seen in the video was a Mante tribe member:", "No, the video is circulating in Aceh, a bit strange indeed, but something that seemed odd was too exaggerated.", "It's a person", "It is entirely possible, given how the Internet is, that the figure seen in this video was digitally created as some sort of prank. It is also possible (although highly unlikely) that this footage shows a member of a previously undiscovered \"pygmy tribe\".  However, the most plausible explanation is also the simplest: The video shows a nearly naked human, possibly a child, spooking a group of dirt bike riders before disappearing into a field of tall grass. An unusual scene, and possibly a prankster, but nothing more than that.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]