["About this rating", "Jefferson County, Georgia, administrator Adam Brett ordered staff at the senior center to call a group of seniors back to the center after they had boarded a bus hired by Black Voters Matter, a voter registration group, with the intention of travelling to polling stations for early voting.", "Brett asserted his decision was not racially-motivated or an attempt to prevent seniors from voting, but rather an enforcement of county policy on political activities taking place on county property and the avoidance of potential liability for allowing an unfamiliar external group to escort seniors away from the center.", "Officials in Jefferson County, Georgia, faced allegations of racially-motivated voter suppression in October 2018 in response to an incident in which a voter registration group was ordered to return a group of African-American seniors to a county-run senior center, after those seniors boarded a bus to cast ballots during early voting for the November elections.", "The liberal web site ThinkProgress reported of the incident that:", "Seniors in rural Georgia were dancing in the street, preparing to board Black Voters Matters bus to cast their ballots Monday, the first day of the state’s early voting period. But the county administrator ordered the senior center to take the 40 or so elderly African Americans off the bus — an act organizers described as “live voter suppression.”", "In a Facebook video about the incident, which took place on 15 October, the group's co-founders LaTosha Brown and Cliff Albright characterized the county's decision as racially-motivated voter suppression, with Albright saying:", "Somebody called the County Commission to complain because they saw all these black folks get on this big black bus -- it's the blackest bus in America -- somebody drove past, saw that, got nervous, got mad, called the County Commission's office, which then called the center. And the bottom line was, all the folks who had just got on the bus -- and the bus was full, this is a 50-passenger bus full of folks -- had to come off the bus.", "There's not a candidate on this bus, there's not a party symbol on this bus, but I'm going to tell you what is on this bus -- a whole bunch of black fists in the air with the word \"power\" underneath it. That's what scared them and made them say \"Those folks have to come off that bus.\"", "However, Jefferson County administrator Adam Brett insisted that the event constituted \"political activity,\" something that the county purportedly does not allow on county property or at county-sponsored events.", "Jefferson County Democrats Chair Diane Evans was on the bus in question and helped organize the visit to the senior center in the first place, as revealed in email correspondence published by Augusta television station WJBF.", "Furthermore, Brett said he had not \"vetted\" Black Voters Matter, and that allowing the senior citizens to leave with an unfamiliar outside group could have been a \"liability\" for the county, which operates the senior center in Louisville and also organizes its own chartered buses for seniors to get to polling stations.", "In a statement sent to us, Brett wrote:", "The Jefferson County Board of Commissioners has a practice of not allowing political activities during normal business hours on County property or at County sponsored activities. On October 15th, the Senior Center staff declined to allow a third party and unknown bus operator to pick County residents on County property for political purposes. The Senior Center staff routinely arrange Jefferson County Public Transit to transport senior citizens to vote.", "In an email, Albright rejected Brett's \"liability\" argument, calling it \"paternalistic\" and pointing out that the Louisville senior center is an activities center, not a residential center:", "Seniors can come [and] go when they please and with whomever they choose to leave with. If they want to leave with a family member, an Uber driver, or an organization they trust, that is their own choice. These are grown adults who decided who they wanted to leave with, and despite Mr. Brett’s paternalistic need to feel comfortable with that decision, he has no control over those choices, nor liability [for them].", "We asked Brett what the legal basis was for his order (carried out by staff at the senior center) not to \"allow\" the seniors to travel to the polling station with Black Voters Matter and requested that he clarify Jefferson County's legal authority and liabilities relating to people who use the senior center. We did not receive a response to those questions.", "Albright told us that staff at the senior center had given advance permission for Black Voters Matter to visit the center and hold an event there, but not for them to escort seniors to polling stations. However, he maintained this was because the group had not initially planned to take the bus trip, which he said the seniors themselves had asked for, spontaneously:", "The seniors requested to ride the bus to go vote after they saw it and were excited. The center director approved/supported the request, which is why the seniors even got on the bus. It was not until the county administrator called the center director that it became a problem.", "Albright also questioned the sincerity of Brett's invocation of county policy on \"political activities,\" pointing out that Jody Hice, a Republican member of the U.S. House of Representatives, is scheduled to host an event at the senior center on 27 October. (Albright emphasized that he thought the event in question was very worthy and should be allowed to take place at the center, but he saw it as an example of a double standard.)", "In fact, on the same day that the seniors were prevented from travelling with Black Voters Matter to a polling station, the Jefferson County Board of Commissioners actually promoted Congressman Hice's event at the senior center on their Facebook page, in a post that was taken word-for-word from Hice's earlier press release:", "We asked Brett to explain why the county had forbidden an event in which a bus carrying a local Democratic party official -- but no elected politician or candidate -- was to escort seniors to a polling station away from the center itself, but allowed a sitting Republican Congressman, who is actively campaigning for re-election, to host an event in the center itself. We also asked why the Board of Commissioners had promoted that event. We did not receive a response to those questions.", "In a separate Facebook post, the Board of Commissioners explained that the bus trip had been forbidden because it \"was led by the President of the Jefferson County Democratic Party [Diane Evans] and as such was considered a political event.\" However, the Black Voters Matter's visit had been organized with the assistance of Evans, and yet it was still allowed to take place.", "We asked Brett why the Black Voters Matter visit was allowed to go ahead despite the involvement of Evans, but the bus trip was not, and asked whether he had considered requesting that Evans disembark the bus (given that her involvement was purportedly the source of the county's objections) rather than ordering the seniors to return to the center. Again, we did not receive a response to these questions.", "Conclusion", "It is true that on 15 October 2018, staff at the Jefferson County senior center in Louisville enacted the instructions of County Administrator Adam Brett by insisting that a group of seniors return to the center after they voluntarily boarded a bus operated on behalf of Black Voters Matter, a voter registration group.", "The leaders of that group characterized the incident as racially-motivated voter suppression, but Brett insisted otherwise, stating that the reasons for his order were twofold: the involvement of Jefferson County Democrats Chair Diane Evans meant that the bus trip constituted \"political activity,\" something the county could not allow, and county officials had not vetted Black Voters Matter or the bus operator, creating a potential liability for the county which Brett was unwilling to assume.", "However, it must be acknowledged that significant problems exist with the coherence of the twofold rationale outlined by Brett. First, it is not clear that Jefferson County actually has any legal liability for anything that happens to those who use the center once they have left the center. Likewise, it's not clear that Brett had any legal authority to \"not allow\" seniors to travel to the polling station or Black Voters Matter to escort them there.", "Second, the consistency with which Jefferson County enforces their prohibition on \"political activities\" at the senior center is questionable. On the one hand, Brett forbade the bus trip to the polling station on this basis due to the involvement of a local Democratic official, even though the bus trip would have taken the seniors away from the senior center, and even though the county allowed a visit to the senior center which had been organized with the help of that same Democratic official.", "But Jefferson County's Board of Commissioners also sanctioned a forthcoming event to be hosted by Jody Hice, a sitting Republican Congressman and active election candidate, which is scheduled to take place in the center itself, and the Board of Commissioners has promoted that event on Facebook in a post taken word-for-word from Hice's earlier press release.", "Lerner, Kira.& nbsp; \"'This Is Live Voter Suppression': Black Voters Matter Blocked grom Taking Seniors to Vote.\"\r\n    ThinkProgress.   15 October 2018.", "DuBose, Renetta.   \"Jefferson County: 'It Was Miscommunication, Not Voter Suppression.'\"\r\n    WJBF-TV.   17 October 2018.", "Hice, Jody.   \"Press Release -- Hice to Host Helping Our Heroes Veterans' Event.\"\r\n    U.S. Representative Jody Hice.   10 October 2018.", "The New York Times.   \"Georgia Primary Election Results: 10th House District.\"\r\n    29 May 2018.", "Correction [22 October 2018]: In some instances, this article previously referred to the Chairperson of the Jefferson County Democrats as Diane Davis. She is Diane Evans.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]