["This Facebook post has the ingredients of a hoax. We could not find the original photo through reverse image searching, and we found no news reports about it.", "Hand sanitizer is flammable because of its alcohol content. But the fire risks are low when the product is applied properly and given time to dry.", "Public health officials say one of the best ways to avoid catching the coronavirus is to wash your hands with soap and water or, when that’s not an option, rub them with hand sanitizer.", "But some Facebook users are sharing posts saying hand sanitizer can be dangerous.", "\"This lady here applied sanitizer to her hands/forearms & went to the kitchen to cook,\" said a March 23 Facebook post showing the arms of a burn victim. \"The moment she turned on the gas stove, her hands caught fire due to the alcohol contained in the sanitizer.\"", "\"Y'all please be careful!\" the post warned.", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "RELATED: Hand sanitizer can be used to prevent coronavirus infection", "We found no credible news reports detailing the incident in question, which fact-checkers in India said was a hoax. Medical experts told us that while hand sanitizer is flammable, the fire risks largely disappear when the sanitizer is applied properly and given time to dry.", "We can’t say for sure that the Facebook post doesn’t show a woman whose arms were burned from a hand sanitizer-induced flame. The post has the ingredients of a hoax, however.", "For starters, we were unable to identify the original source of the photo through reverse image searches on Google, TinEye and Yandex. Our searches on Google and Nexis for related news reports also turned up no results, whereas other sanitizer mishaps have been widely covered.", "Fact-checkers in India and online bloggers suggested the wounds in the photo were the result of skin grafting, a surgical procedure in which healthy skin is transplanted onto a new part of the body.", "But Andrew Vardanian, assistant clinical professor of plastic and reconstructive surgery at UCLA and a plastic surgeon at UCLA Health, told us the image looked to him like a second-degree burn — and likely not one that came from hand sanitizer.", "\"The straight line on the left arm is too straight for this to have happened from hand sanitizer, he said. \"It is more consistent with a submersion type burn into something that caused a scald.\"", "Alcohol-based hand sanitizers are flammable, which is why the Centers for Disease Prevention and Control, the World Health Organization and major manufacturers like Purell all offer fire safety warnings for use. Travelers typically can’t carry large amounts on planes.", "But while bottles and dispensers of hand sanitizer are recommended to be stored away from flames, the CDC and the WHO both say the incidence of fire from use is \"very low.\" A WHO webpage says that the benefits \"in terms of infection prevention far outweigh the fire risks.\"", "Proper application and use mitigates the fire risks, experts told us.", "\"The directions for alcohol based sanitizers often state to rub it into your hands until they are dry, which would reduce the fire risk because the flammable liquid and vapors would evaporate,\" said Jeffrey Gardner, associate professor of biological sciences at the University of Maryland, Baltimore County. \"Once a person’s hands are dry, the fire risk would dramatically decrease.\"", "\"If properly applied with hands rubbed together until the liquid evaporates, it shouldn't burst into flame,\" added Michael Gochfeld, professor emeritus of clinical research and occupational medicine at Rutgers University.", "It takes about 20 seconds of rubbing for hand sanitizer to fully dry on your hands, according to the CDC and the WHO.", "Vardanian said surgeons often use flammable products to sterilize the skin before surgery, but he said \"we wait for a few minutes until we start draping to prevent these types of injuries.\"", "\"If someone used massive amounts of hand sanitizer and then contacted a flame, there may be a fire and a burn can result from this,\" he said of the Facebook post. \"This would, however, be very rare as most of the sanitizer would evaporate before flame contact.\"", "A Facebook post said: \"This lady here applied sanitizer to her hands/forearms & went to the kitchen to cook. The moment she turned on the gas stove, her hands caught fire due to the alcohol contained in the sanitizer.\"", "We ran reverse image searches and checked news databases, and we found no credible evidence that the incident in question actually took place.", "Hand sanitizer is flammable, but medical experts told us that the fire risks are low because the alcohol in hand sanitizer evaporates quickly when the product is given enough time to dry.", "We rate this statement False.", "Facebook post, March 23, 2020", "Various reverse image searches on Google, TinEye and Yandex, April 1, 2020", "Various searches on Google and Nexis, April 1, 2020", "U.S. Food and Drug Administration, \"Safely Using Hand Sanitizer,\" accessed April 1, 2020", "U.S. Food and Drug Administration, \"Q&A for Consumers: Hand Sanitizers and COVID-19,\" accessed April 1, 2020", "Centers for Disease Control and Prevention, \"Fire Safety and Alcohol-Based Hand Sanitizer (ABHS),\" accessed April 1, 2020", "Centers for Disease Control and Prevention, \"Handwashing and Hand Sanitizer Use at Home, at Play, and Out and About,\" accessed April 1, 2020", "The World Health Organization, \"Alcohol-Based Handrub Risks/Hazards,\" accessed April 1, 2020", "Safety Data Sheet, \"PURELL® Advanced Hand Sanitizer Refreshing Gel,\" Feb. 10, 2015", "Safety Data Sheet, \"PURELL® Advanced Hand Sanitizer Gel,\" Feb. 10, 2015", "Federal Aviation Administration, \"Flammability Test of Alcohol-Based Hand Sanitizer,\" August 2010", "The World Health Organization, \"WHO Guidelines on Hand Hygiene in Health Care,\" 2009", "ANI on Twitter, March 30, 2020", "Yahoo News, \"Hand Sanitizers Highly Inflammable, Don't Use Near Fire, Advises Doctor as Man Admitted With Burn Injuries After Using Alcohol-Based Liquid Near Cooking Gas,\" March 30, 2020", "The Statesman, \"Man suffers burns in Haryana; doctors say use alcohol-based sanitizer wisely,\" March 30, 2020", "India Today, \"Fact Check: Do you risk burning your hands after applying sanitisers?\" March 24, 2020", "The New York Post, \"Woman allegedly turns bottle of hand sanitizer into Molotov cocktail, sparks fatal blaze,\" March 11, 2020", "CNN, \"Police seize likely homemade sanitizer from a 7-Eleven after a young boy was allegedly burned by it,\" March 11, 2020", "Snopes, \"Purell Hand Sanitizer Warning,\" Jan. 25, 2007", "PolitiFact, \"Hand sanitizer can be used to prevent coronavirus infection,\" March 3, 2020", "Email interview with Jeffrey Gardner, associate professor of biological sciences at the University of Maryland, Baltimore County, April 1, 2020", "Email interview with Andrew Vardanian, assistant clinical professor of plastic and reconstructive surgery at UCLA and a plastic surgeon at UCLA Health, April 1, 2020", "Email interview with Michael Gochfeld, professor emeritus of clinical research and occupational medicine at Rutgers University, April 2, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]