["About this rating", "Major will be the first dog in residence at the White House to be adopted from a shelter, the Delaware Humane Association.", "However, Major will not be the first rescue dog in the White House. U.S. President Lyndon B. Johnson’s dog Yuki beat Major to the punch. He was found by Johnson’s daughter at a Texas gas station before being gifted to the president.", "Voting in the 2020 U.S. Election may be over, but the misinformation keeps on ticking. Never stop fact-checking. Follow our post-election coverage here.", "U.S. President-elect Joe Biden will be joined by more than just his staff when he begins his tenure in the White House in January 2021. Also accompanying him will be his two German shepherds, Major and Champ — the first dogs to live in the White House after four years of no pets during the Donald Trump administration.", "Major, Biden’s younger German shepherd, will supposedly bring another historic first to the White House. Many headlines and readers assumed that Major would be the first rescue dog to live in the White House, but we found this wasn’t entirely true.", "We learned that while Major is indeed the first dog in the White House to be adopted from an animal shelter, he is not the first rescued one. He was beaten to the punch by Lyndon B. Johnson’s dog Yuki. According to the LBJ Presidential Library:", "Yuki was a mixed breed dog found by President Johnson's daughter, Luci Nugent, at a gas station in Texas on Thanksgiving Day in 1966, while on her way to the LBJ Ranch. Luci named the dog \"Yuki\", which means \"snow\" in Japanese. At first, Yuki lived with Luci, but while visiting the White House, Yuki won the President's heart and became his faithful companion.", "While previous presidents like Barack Obama opted to purchase their dogs from breeders — individuals or groups that breed their own litters of puppies, often for sale — the Bidens chose to adopt their second dog from a shelter. Champ, the older Biden dog, was bought from a breeder. Major was brought to the Delaware Humane Association, an animal care and adoption center, when he was just a puppy, after being exposed to something “toxic” in his previous home, putting his health in danger. After being fostered by the Bidens, Major was officially adopted in 2018.", "Dogs adopted from shelters sometimes have already lived in other homes, or have been taken from unsafe situations — hence being referred to as “rescue” animals — while dogs bought directly from a breeder are born and raised to be sold directly to homes. In Yuki’s case, she was simply found at a gas station, and not taken from a shelter. Yuki and Major were both technically “rescued,” but only Major came to the Bidens from a shelter.", "The Delaware Humane Association posted about Major's adoption two years ago:", "Given that Major is not the first rescued dog to live in the White House, but is the first presidential canine to be adopted from a shelter, we rate this claim as “Mixture.”", "Nur Nasreen Ibrahim is a reporter with experience working in television, international news coverage, fact checking, and creative writing.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]