["About this rating", "On Oct. 4, 2019, the World News Daily Report website published an article positing that two people in Colorado had been arrested based on an 1868 law that prohibited little people from having sex:", "Colorado Couple Arrested Based on 1868 Law Making it Illegal For Midgets to Have Sex", "A Colorado dwarf couple has been arrested and charged with public indecency based on an 1868 law making it illegal for ‘midgets to have sex and or reproduce with each other or any other animal.’", "This item was not a factual recounting of real-life events. The article originated with a website that describes its output as being humorous or satirical in nature, as follows:", "World News Daily Report assumes all responsibility for the satirical nature of its articles and for the fictional nature of their content. All characters appearing in the articles in this website – even those based on real people – are entirely fictional and any resemblance between them and any person, living, dead or undead, is purely a miracle.", "World News Daily Report frequently uses unrelated mugshots in order to illustrate their articles. In this case, they used the mugshots of Henry Chavez, who was sentenced to 30-years in prison in 2011 for first-degree murder, and Melissa Hancock, a former reality TV star who was sentenced to 16 years in prison for her role in a drunk driving accident that left one person dead.", "Aradillas, Elaine.   \"Little Women Cast Member Sentenced in DUI Crash That Killed Coast Guard Member Picking Up Wife for Her Birthday.\"\r\n    People.   11 October 2018.", "Morse, Dan.   \"Man is Sentenced to 30 Years in Montgomery Slaying Under Plea Deal.\"     Washington Post.   18 July 2011.", "World News Daily Report.   \"Colorado Couple Arrested Based on 1868 Law Making it Illegal For Midgets to Have Sex.\"\r\n    4 October 2019.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]