["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Coal miner Scott Tiller eats a sandwich during his lunch break in a mine less than 40-inches high in Welch, W.Va. (AP/David Goldman)", "Are cases of black lung disease, a scourge of the coal-mining industry, more numerous today than in recent memory? That’s the message of a joint press release by U.S. Sens. Joe Manchin, D-W.Va., and Shelley Moore Capito, R-W.Va.", "Black lung disease, also called coal workers' pneumoconiosis, is caused by dusts that are inhaled and deposited in the lungs, which can create scar tissue that makes it more difficult to breathe. The condition can be prevented with appropriate respiratory protection, but once it develops, there is no cure, according to the American Lung Association.", "The senators’ statement touted legislation to help with the early detection of black lung disease. The legislation requires the National Institute for Occupational Safety and Health to submit a report to Congress on ways to boost outreach efforts to increase participation in the Coal Workers’ Health Surveillance Program. (We’re checking Manchin rather than Capito because he was the one quoted citing this particular statistic in the news release.)", "The press release, posted on Manchin’s website on Aug. 23, 2018, said, \"Black lung cases are at a 25-year high, and with today’s technology and our knowledge of this disease, that is simply unacceptable.\"", "Is this correct? We took a closer look.", "The news release from Manchin and Capito cites a study published by the American Journal of Public Health. The study was produced by the National Institute for Occupational Safety and Health at the Centers for Disease Control and Prevention office in Morgantown, W.Va. Researchers used radiographs collected from 1970 to 2017 to determine the ebb and flow of the disease.", "The study found that not only have black lung cases increased but also that their prevalence will likely be reflected in future trends of such conditions as progressive massive fibrosis, which refers to masses in the upper pulmonary lobes of the lungs.", "Here are three charts from the study showing, from left to right, the prevalence of black lung in the United States as a whole; the prevalence in central Appalachia, defined as Kentucky, Virginia and West Virginia; and the prevalence in the United States outside of central Appalachia.", "These charts show that around 1970, the prevalence of black lung was far higher than it is today — about 30 percent of miners with the longest tenures. That rate fell steadily, and by the late 1990s it had declined to the single digits.", "But that decline has since reversed. Now, the national prevalence in miners with 25 years or more of tenure exceeds 10 percent, and in central Appalachia, 20.6 percent of long-tenured miners have the disease.", "Manchin’s office did not respond to an inquiry for this article.", "Manchin said that \"black lung cases are at a 25-year high.\"", "A scientific study found that the prevalence of black lung disease plummeted between 1970 and the late 1990s, but that the rate has risen since then, although nowhere near its all-time high. That’s consistent with Manchin’s description. We rate the statement True.", "Joe Manchin, \"Manchin and Capito Introduce Legislation to Introduce Legislation to Improve Early Detection of Black Lung,\" Aug. 23, 2018", "American Journal of Public Health, \"Continued Increase in Prevalence of Coal Workers’ Pneumoconiosis in the United States,1970–2017,\" Sept. 2018", "Radiopaedia, \"Progressive massive fibrosis,\" accessed Oct. 23, 2018", "American Lung Association, \"Pneumoconiosis,\" accessed Oct. 23, 2018", "NPR, \"Black Lung Rate Hits 25-Year High In Appalachian Coal Mining States,\" July 19, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]