["A meme uses two images of then-President Donald Trump speaking at a military event and President Joe Biden’s Inauguration Day motorcade to draw a false comparison between Trump and Biden’s relationship with troops.", "“Look at the stark difference! Now, we have yet to confirm if the backs towards Biden were intentionally done or it was a security thing but the optics are damaging to him,” the Hip Hop Patriot captioned the meme in a Jan. 21 Facebook post.", "USA TODAY has previously fact checked posts by the Hip Hop Patriot, whose real name is Jeremy Herrell.", "\"We all know, including you that our military supports President Trump over Biden,\" he wrote USA TODAY in an email. \"You won't find pictures of troops with their backs to President Trump. He honors them and they love him for it! Meanwhile, Biden has to search their social media to see if they are loyal to him like a dictator.\"", "Fact check:What's true about the Capitol riot, from antifa to BLM to Chuck Norris", "The top image of the meme, taken by photographer Jim Watson, shows the back of Trump's head as he shook service members hands in 2017.", "“US President Donald Trump (bottom L-back to camera) greets US troops after speaking during an event with US military personnel at Yokota Air Base at Fussa in Tokyo on November 5, 2017,” reads the caption on Getty Images. “Trump touched down in Japan on November 5, kicking off the first leg of a high-stakes Asia tour set to be dominated by soaring tensions with nuclear-armed North Korea.”", "The bottom image comes from a viral video of National Guard members defending Biden’s Inauguration Day motorcade. It shows Guard members facing away from the presidential motorcade on Jan. 20. After pro-Trump rioters attacked the Capitol in a deadly Jan. 6 insurrection, nearly 26,000 troops were called to D.C. to provide additional security during the inauguration.", "The video was widely shared and misrepresented by some online as evidence that Guard members disapproved of Biden’s presidency and expressed that view by turning their backs. A USA TODAY fact check found the Guard members stood facing varied directions to protect the motorcade from potential threats, consistent with previous security protocols. USA TODAY rated the video clip as missing context because it was potentially misleading.", "Neither the photo nor the video served as evidence that Biden is unpopular among service members.", "Fact check:Meme with images of Biden, Trump inaugurations draws false comparison", "We rate a meme that compares then-President Donald Trump and President Joe Biden's relationship with the military MISSING CONTEXT because without additional information the meme could be misleading. The image of National Guard members with their backs turned to Biden's Inauguration Day motorcade shows them carrying out a security protocol.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook."]