["About this rating", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "In March 2020, amid the COVID-19 coronavirus disease pandemic, social media users shared a letter believed to have been written by F. Scott Fitzgerald while he was quarantining in the south of France as a result of the 1918 influenza pandemic. The letter began as follows:", "This Side of Paradise: A Letter from F. Scott Fitzgerald, Quarantined in the South of France", "Dearest Rosemary,\nIt was a limpid dreary day, hung as in a basket from a single dull star. I thank you for your letter. Outside, I perceive what may be a collection of fallen leaves tussling against a trash can.", "One post about the letter, apparently assuming it was real, said:", "F. Scott Fitzgerald was quarantined during last pandemic.\nHe griped to a friend that Ernest Hemingway wasn’t a hand washer.", "Image via Twitter.", "But the letter in question was not written by Fitzgerald. It was published on the humor website McSweeney’s on March 13, 2020, and written as a parody by Nick Farriella, who tweeted about how his post had been \"turned into fake news.\" The text didn't even mention the year it was written, nor the nature of the \"virus.\" But the letter does bring up other notable figures like Zelda Fitzgerald and Ernest Hemingway:", "At this time, it seems very poignant to avoid all public spaces. Even the bars, as I told Hemingway, but to that he punched me in the stomach, to which I asked if he had washed his hands. He hadn’t. He is much the denier, that one. Why, he considers the virus to be just influenza. I’m curious of his sources.", "... Zelda and I have stocked up on red wine, whiskey, rum, vermouth, absinthe, white wine, sherry, gin, and lord, if we need it, brandy. Please pray for us.", "The McSweeney's post now clearly states the following at the top of the piece:", "NOTE: This is a work of parody and is not an actual letter written by Fitzgerald.", "The 1918 influenza, also known as the \"Spanish flu,\" spread worldwide from 1918 to 1919 and is considered the most severe pandemic in recent history.  According to a previous Snopes fact check, many cities in the U.S. closed schools, businesses, and other public spaces, and old newspaper clippings urged social distancing. These actions were largely successful in slowing the spread of the disease.", "Centers for Disease Control and Prevention.   \"History of 1918 Flu Pandemic.\"\r\n    Accessed 01 May 2020.", "Evon, Dan.   \"Did Lack of Social Distancing in 1918 Pandemic Cause More Deaths Than WWI?\"\r\n   Snopes. 17 April 2020.", "Farriella, Nick.   \"This Side of Paradise: A Letter From F. Scott Fitzgerald, Quarantined in the South of France.\"\r\n   McSweeney's. 13 March 2020.", "Lee, Jessica.   \"How Did 'Spanish Flu' Get Its Name?\"\r\n   Snopes. 9 April 2020.", "Nur Nasreen Ibrahim is a reporter with experience working in television, international news coverage, fact checking, and creative writing.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]