["About this rating", "A video supposedly showing a tiger emerging from the woods to briefly chase a motorcycle went viral online near the end of June 2019:", "This footage was met with some skepticism as it circulated on social media. After all, this wouldn't be the first time a piece of doctored media purportedly showing a close encounter with a wild animal has gone viral. But unlike some of the fake videos and photographs we've debunked in the past, the above-displayed video showed no obvious red flags that it was fake.", "For instance, instead of originating with an anonymous user on social media, this video comes from a seemingly authoritative source: the Facebook page for the \"Forests and Wildlife Protection Society (FAWPS),\" a nongovernmental organization from the Telangana State in India.", "FAWPS posted this video on 28 June 2019 along with the caption: \"A Tiger is seen chasing a bike in Muthanga Wildlife Safari in Wayanad in Kerala. Is this how the Tiger Parks are managed in India?\"", "Furthermore, this source provided additional details about the video when news reporters asked about it. While we were unable to connect with FAWPS by publication time, a spokesperson for the Facebook group talked to the Hindustan Times and explained that the footage was taken by two forest-department officials who were patrolling the area after receiving a tip about a tiger sighting.", "The footage itself also avoids some of the common editing tricks used to create fake footage. For instance, once the tiger comes into frame, the camera person does a good job of keeping the camera focused on the animal. An amateur filmmaker attempting to fake similar footage may employ a shakier camera that only shows the tiger a few frames at a time. This can help cover up any editing mistakes on a digitally created animal.", "Take the following video for example. In December 2014, a video supposedly showing a bear chasing a bike through the woods went viral. That video, which was a digitally edited hoax, only gives a few brief glances at the bear:", "We don't see any reason to doubt the footage of a tiger briefly chasing after a motorcycle. This video was filmed by two forest officials as they rode through a wildlife sanctuary in India. While this footage may seem quite scary, conservationist Prerna Singh Bindra faulted the officers for not being cautious enough while driving through an area with tigers and claimed that the animal was \"mock charging,\" not attacking, the motorcycle as it rode through the animal's territory:", "This. An hour before I passed on this road, the #tiger did. It's not an attack. It's a mock charge on a #highway that cuts through a #wildlife #sanctuary. B aware of #wildlife ,follow rules when passing through #wild habitats. dont panic, give the animal space to avoid conflict", "Sengupta, Trisha.   \"Tiger Chases Bike Rider in Kerala. Watch Hair-Raising Video.\"\r\n    Hindustan Times.   1 July 2019.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]