["About this rating", "On 19 September 2016, National Report published a hoax news story that reported that President Barack Obama kneeled while the National Anthem played before the Congressional Black Caucus event in Washington, D.C. in order to express support for San Francisco 49ers quarterback Colin Kaepernick:", "Obama, who previously expressed his support for Kaepernick’s protest, lowered himself to one knee and crossed his arms Sunday morning, as pop singer Beyoncé sang the National Anthem dressed in a “Black Panther” outfit almost identical to the one she wore controversially at the Super Bowl earlier this year. When the Star Spangled Banner was finished, Obama threw his right fist into the air and lowered his head for approximately twenty seconds, before standing and delivering his keynote speech.", "National Report is an entertainment web site that does not publish factual stories; there is no truth to the article above.", "A disclaimer on the web site states that all of its material is purely fictional:", "National Report is a news and political satire web publication, which may or may not use real names, often in semi-real or mostly fictitious ways. All news articles contained within National Report are fiction, and presumably fake news. Any resemblance to the truth is purely coincidental.", "While President Obama did not kneel as \"The Star-Spangled Banner\" played, either to show solidarity with Kaepernick or for any other reason, he did defend the quarterback's right to peacefully protest:", "In terms of Mr. Kaepernick, you know, I gotta confess that I haven't been thinking about football while I've been over here, and I haven't been following this closely, but my understanding, at least, is that he's exercising his constitutional right to make a statement. I think there's a long history of sports figures doing so.", "I think there are a lot of ways you can do it. As a general matter, when it comes to the flag and the national anthem, and the meaning that that holds for our men and women in uniform and those who fought for us, that is a tough thing for them to get past to then hear what his deeper concerns are.", "But I don't doubt his sincerity, based on what I've heard. I think he cares about some real, legitimate issues that have to be talked about. And, if nothing else, what he's done is he's generated more conversation around some topics that need to be talked about.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]