["In October, the New York Post published copies of \"smoking gun\" emails it claimed were recovered from a laptop that belonged to Hunter Biden.", "It alleged that the emails revealed Joe Biden — the vice president at the time of the emails, a candidate at the time they were published, and now the president-elect — had been compromised by his son's business ties in Ukraine.", "The source of the laptop that purportedly contained the emails was a computer repairman from Wilmington, Delaware.", "John Paul Mac Isaac — owner of The Mac Shop — told reporters that a man who identified himself as Hunter Biden brought three liquid-damaged laptops to his repair shop in April 2019, per the Delaware News Journal.", "The man left one laptop for repair and never returned to retrieve it.", "Eventually, Mac Isaac gave a copy of the laptop's hard drive to Brian Costello, an attorney for Rudy Giuliani, who is the personal lawyer for President Donald Trump. Mac Isaac said he turned the hard drive over to Costello because of fears for his safety.", "More:A tabloid got a trove of data on Hunter Biden from Rudy Giuliani. Now, the FBI is probing a possible disinformation campaign.", "Now, some users on Facebook have claimed that Mac Isaac was found dead, posting screenshots of a headline that reads, \"Computer Shop Owner Who Raised Alarm About Hunter Biden Laptop Found Dead.\"", "Alongside the headline, they shared captions like \"Democrats hit man strikes again\"  and \"NOT A COINCIDENCE.\"", "The claim first appeared on the website America's Last Line of Defense, which claimed on Nov. 28 that Mac Isaac \"has been found dead, also under highly mysterious circumstances.\"", "A description of the circumstances included a \"loud explosion\" in South Park, Colorado, where it claims Mac Isaac had moved after he closed up shop in Wilmington.", "\"When police and fire arrived at the scene, they were confronted by a blazing inferno that had entirely engulfed Mr. Isaac’s new computer repair shop,\" it read.", "The users who posted the claim to Facebook have not responded to requests from USA TODAY for comment.", "The claims that Mac Isaac had been found dead originated on America's Last Line of Defense — which is a satirical publication, per its website.", "\"Everything on this website is fiction,\" the website reads. \"It is not a lie and it is not fake news because it is not real. If you believe that it is real, you should have your head examined.\"", "America's Last Line of Defense also disclaims that \"any similarities between this site’s pure fantasy and actual people, places, and events are purely coincidental.\"", "The specific story about Mac Isaac was labeled as satire.", "Christopher Blair, the creator of America's Last Line of Defense, told USA TODAY that its articles are distinguished by the fact that they have \"zero in common with reality.\"", "\"We follow one specific rule, and that is that the piece has to be ridiculous,\" he wrote in an email.", "Fact check:Fake anti-Christmas quote attributed to Kamala Harris began as satire", "In reality, Mac Isaac is alive — evidenced by a video he posted to YouTube on Dec. 5. In the video, \"The Truth,\" he gives a brief family history and denies having any ties to Russia or acting as a \"hacker.\"", "One tidbit from the story on America's Last Line of Defense that also happens to be true is that Mac Isaac closed up his computer shop in Wilmington.", "More:Computer repairman who claimed he gave Hunter Biden data to Giuliani closes shop as laptop saga gets stranger", "On Nov. 24, the Delaware News Journal reported that \"ten days after the election, a sign on the repair shop’s door said it had closed. A neighbor said the owner had left town.\"", "Brian Della Rocca — an attorney who is representing Mac Isaac — confirmed that Mac Isaac shuttered the shop after receiving death threats. Della Rocca declined to disclose whether Mac Isaac had left town or where he might have gone.", "Fact check:False claim that Malia Obama was arrested originated on satire site", "Based on our research, the claim that the computer repairman at the center of the Hunter Biden laptop saga was found dead is FALSE. The claim first appeared on a satirical website. The repairman — John Paul Mac Isaac — posted a video on YouTube on Dec. 5, proof that he is alive.", "Thank you for supporting our journalism.You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more."]