["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "State Rep. John Bucy III, D-Austin, speaks at an Austin rally to expand Medicaid in March [Stephen Spillman/Austin American-Statesman]", "Texas lawmakers debated the finer points of their biennial budget proposal well into the night on Wednesday, proposing amendments, amendments to those amendments and ultimately passing the massive $251 billion bill.", "One amendment (which was shot down in a party-line vote, with Republicans in opposition) would have required the state to accept federal Medicaid expansion dollars to cover low-income Texans. Texas is one of 14 states that has not opted to expand Medicaid.", "State Rep. John Bucy III introduced the amendment and said Texans are losing out on quality health care by not expanding the insurance program.", "\"Right now, 1 in 4 Texas women of reproductive age are uninsured, totaling 1.5 million Texas women,\" said Bucy, a Democrat who represents a portion of Williamson County. \"While many of these women qualify for health care coverage during pregnancy, they lose that care shortly thereafter. It is critical that we increase access to health care for women before, after and between pregnancies by expanding Medicaid.\"", "Bucy shared the same claim about uninsured women in a post on Twitter during the debate. So we had to ask, are there really that many Texas women without health insurance?", "State agencies don’t track this number", "Allison Heinrich, Bucy’s legislative director, said the statistic came from a letter an advocacy group sent to the Texas Senate’s Health and Human Services Committee in September.", "The letter states that 1 in 4 Texas women between the ages of 15 and 44 are uninsured.", "The letter — sent by a coalition of organizations advocating for better health care called Cover Texas Now — attributed the statistic to a series of reports from the Texas Department of State Health Services.", "Laura Guerra-Cardus of the Cover Texas Now coalition and the Children’s Defense Fund said the citation in the letter was incorrect and that the group actually got this information from a 2016 report published by the left-leaning Center for Public Policy Priorities.", "The report states that about 27 percent of women of childbearing age in Texas are uninsured.", "Officials with the Texas Department of State Health Services, the Texas Health and Human Services Commission and the Texas Department of Insurance said their respective agencies do not track the uninsured population in Texas.", "Census data backs up the claim", "The report cited the U.S. Census Bureau’s American Community Survey and person-level data sets used by researchers. This information lets users examine a sample of individual responses to the survey and extrapolate about things like the number of uninsured women in a particular age bracket.", "Oliver Bernstein, spokesman for the Center for Public Policy Priorities, said researchers at the center plugged the data into statistical software to come to the conclusion that 1 in 4 women between the ages of 15 and 44 are uninsured in Texas, as of their 2016 report.", "The 2018 edition of the report came to the same conclusion.", "This type of data analysis is common. The Urban Institute conducted a similar study of the uninsured population in Texas in December and they used this person-level data to identify the percentage of different population groups in Texas that are uninsured.", "They didn’t look specifically at uninsured women of reproductive age, but found that about 18 percent of all women in Texas are uninsured.", "The Guttmacher Institute, a research organization that is pro-abortion rights, published a study in December that looked at the uninsured rate of women of reproducitve age using the same data.", "The group's analysis found that, of the 5.9 million Texas women between 15 and 44, about 1.4 million (or 24 percent) are uninsured. This means about 1 in 4 women in this age bracket are without health insurance.", "Published data from the Census Bureau (which has already been crunched) also supports Bucy’s claim, although it doesn't consider the entire age bracket in question .", "Age groupings for total population count and for uninsured women don’t line up, so the most accurate group to analyze here would be women between 19 and 44, which doesn’t include all women of reproductive age.", "There are about 5.2 million Texas women between the ages of 19 and 44, the data shows. Of those women, more than 1.2 million do not have health insurance.", "This means that about 1 in 4 Texas women between the ages of 19 and 44 do not have health insurance.", "Our ruling", "Bucy said, \"one in four Texas women of reproductive age are uninsured, totaling 1.5 million Texas women.\"", "His source was a report from an Austin-based group that conducted an analysis of Census numbers. The research method is one that has been used by other organizations and a study from the Guttmacher Institute had similar findings.", "An analysis of publicly available Census numbers offers an estimate that also supports Bucy’s claim.", "We rate this claim True.", "TRUE – The statement is accurate and there’s nothing significant missing.", "Correction:  This fact-check has been updated to address a mischaracterization​ of the number of women who are uninsured. About 1 in 4 women between 15 and 44 do not have health insurance. The rating is unchanged.", "Kaiser Family Foundation, Status of State Action on the Medicaid Expansion Decision, accessed March 28, 2019", "U.S. Census Bureau, American FactFinder Table for Health Insurance Coverage Status by Sex by Age, accessed March 28, 2019", "U.S. Census Bureau, Americna FactFinder Table for Sex by Age, accessed March 28, 2019", "U.S. Census Bureau, Institutionalized population, accessed March 28, 2019", "Phone interview, Ben Gonzalez, spokesman for the Texas Department of Insurance, March 28, 2019", "Email interview with Lara Anton, spokeswoman for the Texas Department of State Health Services, March 28, 2019", "Email interview with Carrie Williams, spokeswoman for the Texas Health and Human Services Commission, March 28, 2019", "Email interview with Elizabeth Nash, Senior State Issues Manager at the Guttmacher Institute, March 28, 2019", "Guttmacher Institute, Gains in Insurance Coverage for Reproductive-Age Women at a Crossroads, Dec. 4, 2018", "Phone interview with Laura Guerra-Cardus of Cover Texas Now and the Children’s Defense Fund, March 28, 2019", "Center for Public Policy Priorities, State of Texas Children 2016, accessed March 28, 2019", "Center for Public Policy Priorities, State of Texas Children 2018, accessed March 28, 2019", "Email interview with Oliver Bernstein, spokesman for the Center for Public Policy Priorities, March 29, 2019", "Urban Institute, The Uninsured in Texas, Statewide and Local area Views, Dec. 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]