["An image of House Speaker Nancy Pelosi that’s spreading on social media includes what’s described as her address. But the California Democrat doesn’t own or live at that property.", "\"Nancy Pelosi has invited all illegals to her mansion at 2724 Pacific Ave San Francisco CA,\" reads a Feb. 21 Facebook post. \"Free food and plenty of room.\"", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Claims connecting Pelosi to this house aren’t new. In 2018, FactCheck.org debunked a post that called it \"mega millionaire Nancy Pelosi’s mansion on San Francisco bay.\"", "Pelosi’s most recent  financial disclosure report, filed in August 2020, lists several properties, including her homes in San Francisco and Washington, D.C., a vineyard in Napa, Calif., and commercial properties. Members of Congress must list their assets and liabilities — like mortgages — on these reports. The property on Pacific Avenue does not appear in Pelosi’s report.", "But it made headlines in 2015 when it was sold to a company named 2728. The identity of the new owner or owners is unknown, but a legal representative told Reuters that the property does not belong wholly or partially to Pelosi or her family.", "Pelosi’s San Francisco residence is in the same neighborhood as this mansion — Pacific Heights. And over the years it has been pictured in news reports covering protests outside her home. That house does not resemble images of 2724 Pacific Ave.", "We rate this post False.", "Facebook post, Feb. 21, 2021", "FactCheck.org, The house that isn’t Nancy Pelosi’s, Dec. 14, 2018", "Nancy Pelosi’s 2019 financial disclosure report, filed Aug. 13, 2020", "Curbed San Francisco, 2724 Pacific in Pacific Heights sells for $23.889M, is biggest sale of the year, March 25, 2015", "Reuters, Fact check: Nancy Pelosi does not reside at this San Francisco mansion, Feb. 23, 2021", "The New York Times, Home in San Francisco, Pelosi gets the Crawford treatment, March 13, 2007", "KTVU Fox 2, Speaker Nancy Pelosi’s Pacific Heights house vandalized, Jan. 1, 2021", "ABC 7, Nancy Pelosi’s San Francisco home vandalized overnight on New  Year’s Day, Jan. 2, 2021", "The Mercury News, Nancy Pelosi’s house in San Francisco spray-painted, pig’s head left on the sidewalk, Jan. 1, 2021", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]