["About this rating", "An individual named Joseph Pryor was discharged from the USMC's Delayed Entry Program after images and video of his involvement in a racially charged incident at a Donald Trump rally circulated on Facebook.", "Pryor was a Marine.", "Whether Pryor's individual social media activity contributed to the sanction; the content of Pryor's purported \"bragging\" posts on social media.", "On 2 March 2016, Black Lives Matter activist Shaun King tweeted footage of University of Louisville student Shiya Nwanguma being roughly handled by multiple people at a Donald Trump rally in Louisville, Kentucky:", "The full story of the white supremacists who assaulted this Black student at a Trump rally.https://t.co/WPywX72tVOhttps://t.co/vpJrCxH1bP", "— Shaun King (@ShaunKing) March 2, 2016", "The article linked to an editorial written by King for the New York Daily News. He described the footage, voicing his distaste for the many participants who either shoved Nwanguma or failed to intervene:", "When I first saw the short 37-second news clip of this young girl being forcefully pushed and shoved by large grown men, my blood began to boil. In my lifetime, I have never seen grown men, many who at first appeared to be complete strangers, violently shove a young girl around like that. Some seem to just be pushing her for fun to the left and to the right, just because it's what other people were doing. While it all goes down, the hate for her is visible in the eyes not just of the adult men who repeatedly shove her, but in the surrounding women who look on. Nobody, not a single soul, offers to help protect her or escort her out in a way that is remotely safe.", "On 3 March 2016, King tweeted a follow-up editorial (also published by New York Daily News). In that piece,, King linked to additional footage of the incident (during which Trump can be heard in the background speaking about \"when we were less politically correct\"):", "Things getting a little heated at the Trump rally pic.twitter.com/X974Ih3tZI — Carly Price (@CarlyPrice18) March 1, 2016", "King maintained that Pryor \"bragged\" about his role in the incident on Facebook (we were unable to find those particular postings) and wrote:", "On Wednesday afternoon, the United States Marine Corps quietly decided to discharge a young man named Joseph Pryor. Listed as a \"future Marine\" on his Facebook page, he had enlisted in 2015, but was currently in their delayed entry program. After publicly bragging on Facebook about his role in the harassment and assault of a young black woman, Shiya Nwanguma, at a Donald Trump rally ... Captain Kevin Hoffman, deputy judge advocate of the United States Marine Corps, informed the Daily News that \"Mr. Pryor was discharged from the delayed entry program.\"", "King's update was corroborated by Louisville-area station WDRB. In that report, an anchor stated Pryor \"flaunted\" his involvement by sharing the now-viral image reproduced above. WDRB included a longer statement issued by the United States Marine Corps about the controversy:", "A U.S. Marine Corps spokesperson sent WDRB a statement this morning saying, \"Joseph Pryor has demonstrated poor judgment in his use of social media that associates him with a racially charged altercation at a political rally. Hatred toward any group of individuals is not tolerated in the Marine Corps, and he is being discharged from our Delayed Entry Program.\"", "So while it was true the individual depicted was Joseph Pryor, Pryor was not yet a Marine. According to the United States Marine Corps' statement, Pryor was discharged from the Marines' Delayed Entry Program, and at that time had not yet enlisted.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]