["Glenn Beck, the conservative former Fox News host who now has a radio show and online live-video program, declared at an Iowa rally for Texan Ted Cruz that he was breaking with his own long history simply by endorsing someone for office.", "\"The press today has been reporting that I’m here to endorse Ted Cruz,\" Beck said at an appearance with Cruz in Ankeny, Iowa the same week Sarah Palin endorsed Donald Trump. \"But let me tell you, in 40 years of broadcast, I have never endorsed any candidate. And I haven’t endorsed any candidate mainly because for a lot of those years, nobody really wanted my endorsement,\" Beck said with a laugh. \"And quite honestly, I have never endorsed anybody because I haven’t trusted any of the weasels, no matter how good they are.\"", "Beck made that comment a little over seven minutes into his half-hour presentation, which concluded with Beck saying the press was right: \"I am here to announce that I am officially endorsing Ted Cruz.\"", "We were curious about Beck’s declaration that he hadn't previously endorsed a candidate.", "We failed to reach Beck for elaboration. Meantime, our search of the Nexis news database indicated no previous Beck endorsement of a presidential aspirant. And while we found we found two reports of Beck endorsing a candidate, further review showed one reported endorsement didn’t happen and the other was a Beck joke.", "Illinois ‘endorsement’", "A Feb. 2, 2010, item, in the Inside the Beltway column in The Washington Times, said Illinois businessman Adam Andrzejewski, among Republicans running for governor, had been drawing fresh \"tea-party\" support. The item continued: \"Fox News host Glenn Beck has also endorsed Mr. Andrzejewski,\" as had commentator Rush Limbaugh.", "We reached Andrzejewski, who replied by email: \"In real-time, many people in Glenn Beck’s radio listening audience took his broadcast as an endorsement of my 2010 campaign for governor of Illinois. However, Beck clarified the following day that he did not endorse, but instead had just replayed the endorsement of my candidacy by Polish President and Nobel Laureate Lech Walesa.\"", "Andrzejewski pointed us to a Feb. 2, 2010, post by the American Spectator stating Beck had said on the air that day that he was \"getting a lot of mail that I endorsed\" Andrzejewski when, Beck said, he’d only intended to share audio of Walesa speaking in favor of the candidate. \"I don’t endorse candidates and I don’t know this guy, but I wish him all the best,\" Beck said.", "California ‘endorsement’", "On May 16, 2011, Californian Dan Adler’s House campaign issued a press release headlined, \"Glenn Beck`s Surprising First Ever Endorsement Goes to Democrat Dan Adler in California`s Special Congressional Election.\"", "The release opened: \"For the first time in his life, conservative TV and radio personality Glenn Beck has given an endorsement to a candidate running for Congress in a special election tomorrow. In contrast to conventional wisdom, the endorsement did not go to someone of Beck's political extreme but to Dan Adler, a lifelong Democrat who is socially progressive. Adler, who has been urging voters of the South Bay community area to elect a citizen legislator instead of a career politician, recently caught Beck's eye for populist-themed Send a Mensch to Congress TV spots.\"", "The release continued: \"In a posting on Beck’s website today, the conservative talk show host said, ‘people should vote based on principles and values and not race or creed,’ he then moved to ‘heartily endorse’ Adler.\" The release said that on Beck’s May 13, 2011, radio show, \"Beck and his cohorts ridiculed the Asian American and other minority voters who make up nearly 50% of California’s 36th District. Then a confused Beck endorsed Adler’s candidacy, stating that Californians deserve to see Adler in Congress and that ‘you’re going to love him.’\"", "We clicked next to a May 16, 2011, post on Beck’s website suggesting Beck made his endorsement tongue-in-cheek (and there’s a full Beck-sponsored summary of the not-for-real endorsement here).", "According to the post, Beck had included an Adler ad on his program the week before as the worst political ad ever. The post on Beck’s site continued:", "\"The ads, promoting Californian Dan Adler, featured a Korean woman who said that she should vote for Adler simply because she’s Korean and he’s Jewish and that minorities should ‘stick together.’ The ad also featured several offensive stereotypes of Koreans and Asians. Glenn took issue with the ad, saying that people should vote based on principles and values, not race or creed.\"", "That doesn’t read like Beck was poised to endorse. The post on Beck’s site went on:", "\"Somehow, Adler took Glenn’s criticism as an endorsement and released a statement declaring himself the candidate endorsed by Glenn Beck. This morning, Dan may regret his statement. ‘It doesn’t make any sense for a progressive to want my endorsement. So, today I heartily endorse — what’s his name? — Dan Adler. I want the voters in California to know that we are practically brothers of the brain,’ Glenn said. ‘We are so like minded, he has the same positions on almost everything, although he’s not coming out and saying those things.’ ‘We both believe that the rich are paying far too much. Pay their fair share? They pay more than their fair share. They deserve a tax break,’ Glenn declared in his support for he and Adler’s shared stance. Let’s see if the progressive Adler decides to run with Glenn’s support.\"", "Next, we reached  Adler, whose current biographical entry on a business website says Adler’s candidacy drew \"Beck's first-ever political endorsement.\"", "Adler, describing himself as a liberal Democrat, told us that after Beck criticized his ad, his campaign issued the 2011 release saying Beck had endorsed him toward building a pre-election buzz. \"I never saw it as a real official endorsement,\" Adler said though he called back to stress Beck’s statement at the time that California deserved Adler. \"Tongue in cheek or not, one would certainly count it as an endorsement,\" Adler said.", "Media Matters for America", "To our inquiry, Laura Keiter of the liberal Media Matters for America, whose declared mission is to monitor and correct conservative misinformation \"in the U.S. media,\" said by email that while Beck previously made no presidential endorsement, he had made clear who he supported or opposed, \"walking a thin line,\" Keiter said.", "Keitor offered instances of Beck seemingly taking a side such as Beck in January 2008 telling Republican hopeful Rudy Giuliani, the former New York mayor, on the air that he would vote for him or Massachusetts Gov. Mitt Romney for president. Beck went on to say that if the nominee proved to be former Arkansas Gov. Mike Huckabee or Sen. John McCain (who later proved the nominee), \"I would look at those two guys and go, I can’t do that.\"", "In an October 2010 web post, Media Matters said Beck had repeatedly said he doesn’t endorse candidates yet also had indicated support or opposition to specific hopefuls; that year, Beck urged listeners to oppose Democrat Richard Blumenthal in a Connecticut U.S. Senate race; called Democrat Chris Coons of Nevada a bad Senate candidate; and said he was about to break his no-endorsement policy by endorsing Marco Rubio and another hopeful for the Florida U.S. Senate seat ultimately won by Rubio.", "Our ruling", "Beck declared in Iowa he hadn’t previously endorsed a candidate.", "Beck made a kidding endorsement of a Democrat a few years ago and previously urged support for, or votes against, individuals. But we spotted no evidence of Beck lock-down endorsing a candidate before he stood with Cruz.", "We rate Beck's statement True.", "TRUE – The statement is accurate and there’s nothing significant missing.", "Click here for more on the six PolitiFact ratings and how we select facts to check.", "News column, \"Inside the Beltway,\" The Washington Times, Feb. 2, 2010", "Web post, \"ANDRZEJEWSKI: MANCOW SAYS 'YES', BECK SAYS 'NO,'\" the Illinois Review, 12:04 p.m. Feb. 2, 2010 (accessed Jan. 25, 2016)", "Email, Adam Andrzejewski, former Illinois gubernatorial candidate, Jan. 25, 2016", "News blog post, \"BECK DENIES ENDORSING ‘ADAM WHAT’S-HIS FACE,’ BUT ANDRZEJEWSKI GOT MANCOW’S VOTE,\" the American Spectator, Feb. 2, 2010", "Web post, \"The only candidate Glenn has ever endorsed: Dan Adler,\" GlennBeck.com, May 16, 2011, 12:28 p.m. EST (accessed Jan. 25, 2016)", "Web post, \"Why Did Glenn ‘Endorse’ a Calif. Democrat for Congress on Radio?,\" theBlaze.com, 4:38 p.m. May 16, 2011", "Telephone interviews, Dan Adler, Jan. 25, 2016", "Email, Laura Keiter, national press secretary, Media Matters for America, Jan. 25, 2016", "Web post, \"Beck: 'I'm not telling you who to vote for' (wink, wink, nudge, nudge),\" Media Matters for America, Oct. 25, 2010", "News story, \"Glenn Beck Endorses Bachmann, Says Obama Will 'Take This Country Down' If He Loses,\" the Huffington Post, Oct. 11, 2011", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]