["About this rating", "Kevin Sorbo appeared in at least one strange online advertisement in early 2021 that read: \"Celebrities Who Passed Away in 2020.\" The actor is perhaps best known for his work on \"Hercules.\"", "However, Sorbo was not dead. As of Jan. 29, 2021, the actor was alive and tweeting.", "The ad led to a lengthy slideshow story on the website Definition.org with the headline: \"All the Celebrities We've Lost in the Past Year.\"", "Like it or not, death comes for us all. Many of us never know when our time will come, and rightfully so, but some of our friends and family have gone too soon. While they may not be our friends from down the street but we still a connection to the lost celebrities that have entertained us… for years or decades.", "Whether they be from the world of sports, red carpets of Hollywood, behind the glass in the recording studio, or simply on the television and movie screens, these lost celebrities are sorely missed. Some of these celebrities have been around since our parents were children, others have sprung up in the last few years but all have made notable contributions to our entertainment and influences. Let us remember each and every one of these lost celebrities for their selfless contributions to their respective fields. Their work still continues to inspire us each and every day.", "The person or people who managed the page recently updated the end of the article to include pages for late sports icon Hank Aaron and actress Cloris Leachman. Both had died recently before this fact check was published.", "Sorbo was perhaps best known for his work as Hercules in \"Hercules: The Legendary Journeys.\" He also starred in the \"Andromeda\" television series as well as \"Let There Be Light\" and \"God's Not Dead.\"", "This was not the first time a living actor was featured to trick readers into clicking an ad about dead celebrities. A picture of Nick Stahl, who also was not dead, had also been used in advertisements for Definition.org. Stahl was perhaps best known for starring in the 2003 film \"Terminator 3: Rise of the Machines\" and the HBO series \"Carnivàle.\"", "In sum, an online advertiser used a picture of \"Hercules\" actor Sorbo to draw clicks and profits in a lengthy article about recently deceased celebrities.", "Snopes debunks a wide range of content, and online advertisements are no exception. Misleading ads often lead to obscure websites that host lengthy slideshow articles with lots of pages. It's called advertising \"arbitrage.\" The advertiser's goal is to make more money on ads displayed on the slideshow's pages than it cost to show the initial ad that lured them to it. Feel free to submit ads to us, and be sure to include a screenshot of the ad and the link to where the ad leads.", "Jordan Liles is a Senior Reporter who has been with Snopes since 2016.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]