["By Rem Rieder, Eugene Kiely, Lori Robertson and D'Angelo Gore", "Posted on March 6, 2020", "At a town hall event in the swing state of Pennsylvania, President Donald Trump made several false and misleading claims, some of which we have repeatedly debunked before.", "He further embellished his talking points on trade with China, claiming China “didn’t do anything with us” before his recent trade agreement. The country has been a top trading partner with the U.S. for years. He repeated his false boast that the economy “never had growth like we’re experiencing” — the nation’s real annual economic growth has been higher 19 times in the last 39 years. And he wrongly told the crowd in Scranton that the area and the state had “the best unemployment numbers it’s ever had.” That’s not currently true.", "The vast majority of U.S. exports to Canada were tariff-free under the North American Free Trade Agreement, despite Trump’s claim that Canada was “taking advantage of us” by “charging us 300% tariffs.” Such high rates applied to some items above certain quotas, and there are still quotas in the new United States-Mexico-Canada Agreement.", "Among the many repeated claims: Trump took credit for a Louisiana liquefied natural gas exporting facility that was approved under then-President Barack Obama. He said preexisting conditions were “100%” taken care of and then cited cheaper health insurance options that can vary premiums based on medical conditions. Trump complained of “a phony whistleblower rendition” of his July 2019 phone call with Ukraine’s president, even though his acting director of national intelligence had said the whistleblower complaint was “in alignment with” the White House’s own memo on the call. And there’s more: on the new coronavirus, polling and the Islamic State caliphate.", "Trump appeared at the town hall meeting, hosted by Fox News, on March 5. Pennsylvania played a vital role in putting Trump in the White House, giving him 20 electoral votes, and it is again a crucial swing state in 2020.", "A big reason for Trump’s 44,000-vote victory in the state was his strong showing in Northeastern Pennsylvania, a largely blue-collar area long dominated by Democrats. It’s likely he’ll need a similarly successful run if he is to carry the state again.", "So it was hardly a surprise when the president chose Scranton as the venue for his first visit to the state this year. Scranton also happens to be the hometown of Joe Biden, who has reemerged as a front-runner for the Democratic presidential nomination. Biden moved to Delaware when he was 10, but his Scranton heritage is a key component of his political persona.", "Trump said: The U.S. economy is “nothing compared to what it’s going to be when the trade deals kick in. … China, as an example, they didn’t do anything with us. They’re now spending $250 billion a year, and that’s only for phase one. Phase two is going to be even more so.”", "The facts: The president has long twisted the facts on trade, but claiming that China “didn’t do anything with us” before his recent trade agreement is simply bogus.", "China has been a top trading partner with the U.S. for years. In 2016, before Trump took office, China was the third largest market for U.S. goods and services, behind Canada and Mexico, according to Bureau of Economic Analysis trade data. U.S. exports to China for goods and services totaled $170.4 billion in 2016, but declined to $163.8 billion in 2019 as a result of Trump’s trade war with China, BEA data show.", "Under the new agreement, China has committed to purchasing an additional $100 billion in U.S. goods and services each year for two years over and above the pre-trade war 2017 level of $186 billion. That could push the U.S. exports to China above Trump’s $250 billion figure, but exports didn’t go from $0 to $250 billion, as Trump claimed.", "Trump said: “Well, Martha, this area of Pennsylvania and Pennsylvania itself has the best numbers it’s ever had. It’s got the best economy it’s ever had. It has the best unemployment numbers it’s ever had. And Scranton has the lowest and best unemployment numbers they’ve — and employment numbers too — that they’ve ever had, by far.”", "The facts: U.S. Bureau of Labor Statistics data show that Pennsylvania and the Scranton–Wilkes-Barre–Hazleton metro area have had better unemployment numbers before.", "As of December, Pennsylvania’s unemployment rate was 4.6%, according to seasonally adjusted BLS figures. But the state’s unemployment rate was as low as 4.0% in four of the first five months of 2000.", "As for the Scranton–Wilkes-Barre–Hazleton metro area, its unemployment rate did hit a low of 4.6% in June 2019, but it was at 5.5% as of December. The region’s rate also was previously lower — between 4.7% and 5.0% — several times during the 2000s.", "Trump said: “Joe Biden made a deal, NAFTA. He approved it. He was pushing it. It’s the worst trade deal ever made. We’re terminating NAFTA. We have the USMCA. China — if we look at what happened, between China and Mexico and Canada, what they were doing to this country, how they were taking advantage of us, they were — Canada was charging us 300% tariffs.”", "The facts: The vast majority of U.S. exports to Canada were tariff-free under the North American Free Trade Agreement, as we’ve written before.", "“Canada eliminated tariffs on all industrial and most agricultural products imported from the United States under the terms of NAFTA,” with dairy and poultry being the exceptions, according to Trade.gov, the website of the International Trade Commission.", "Trump may be referring to high tariffs that Canada placed on U.S. dairy imports above certain amounts under NAFTA. Canada limits U.S. dairy products that can be imported without tariffs and imposes stiff tariffs above those quotas.", "Under that system, “U.S. imports above quota levels are subject to high tariffs (e.g., 245 percent for cheese, 298 percent for butter),” Trade.gov explains.", "Under the new United States-Mexico-Canada Agreement, which Trump signed into law in January, Canada will still impose high tariffs on some U.S. dairy imports above certain limits. But, as a condition for the deal, Canada agreed to open its markets to American farmers by raising the quotas on a number of dairy products that can be exported to Canada, such as cheese, butter and various kinds of milk.", "As the nonpartisan Congressional Research Service wrote in January, “USMCA increases U.S. dairy access up to 3.59% of Canada’s dairy market, but it would not dismantle Canada’s supply-management system,” which restricts imports of dairy products and imposes high over-quota tariffs of up to 315.5%.", "Trump said: “Well, actually, we were … I think really given tremendous marks — [if] you look at Gallup poll, you look at other polls — for the way we’ve handled [the new coronavirus].”", "The facts: This is very misleading. The president did get high marks in a Gallup Poll early in the outbreak, but as the disease has spread and the number of deaths has mounted, polls show rising dissatisfaction with the administration’s performance.", "The Gallup Poll, taken Feb. 3-16 and released Feb. 20, found that 77% of Americans were very or somewhat confident that the government would be able to handle an outbreak of new coronavirus. The poll found Americans more confident than they were in previous administrations’ ability to deal with Zika, Ebola, swine flu and bird flu, according to an average of polls. But this was early in the outbreak, before anyone had died from the new disease, known as COVID-19, in the U.S.", "As the number of cases and deaths grew and the administration’s response came under fire, confidence waned. A Morning Consult survey, taken Feb. 28-March 1 and released March 2, found that 49% of voters approved of the White House’s handling of the situation, down from 56% Feb. 24-26 and 61% Feb. 7-9.", "A Public Policy Polling survey, taken March 2-3 and released March 3, had more bad news for Trump. It found that, by a margin of 51-42%, voters disapproved of the president’s handling of the outbreak. It also found that they rejected, by a margin of 53% to 37%, Trump’s contention that he had done a “great job” handling the crisis. And it found that the president’s performance made 39% more likely to vote against his reelection, while 19% said they were more likely to vote for Trump.", "According to a Johns Hopkins University case tracker and a New York Times database, as of March 6, more than 250 people in the U.S. have been infected with COVID-19 and at least 14 have died.", "Trump said: “I was able to get the country going because so many jobs were stopped by not only EPA, so many other agencies where you’d have to go get 11 different permits for essentially the same thing. I opened up LNG plants in Louisiana where they were for years, for 10, 12, 14 years and longer trying to get permits. They couldn’t get permits. I got them built. A $10 billion plant in Louisiana.”", "The facts: Trump isn’t telling the truth about the LNG plant in Louisiana, which was approved by the Obama administration in 2014. He has repeatedly made this false claim, first saying at the May 2019 opening of the plant in question — Sempra Energy’s Cameron LNG project, a liquefied natural gas exporting facility — that a change in federal policy was responsible for its launch and claiming a few days later that “we got approvals very quickly for the big LNG.” We confirmed with Sempra Energy that it received the final approval well before Trump took office. Kelli Mleczko, corporate communications advisor for the company, told us: “You are correct, Cameron LNG was approved in 2014.”", "Such facilities take anywhere from four to six years to build, experts told us. Sempra’s Cameron LNG was the fourth LNG project in the Lower 48 states to begin operating since 2016, and all were approved under Obama.", "Sempra received the three approvals it needed in under three years: two approvals from the Department of Energy for exporting to certain nations in January 2012 and September 2014, and a Federal Energy Regulatory Commission approval on environmental and construction factors in June 2014.", "Trump said: “Preexisting conditions: 100%, we take care of. But we have many health care plans now where it’s 60%, even 65% less expensive than Obamacare. It’s better than Obamacare.”", "The facts: This is misleading. The Trump administration has issued rules to expand cheaper, but less comprehensive, insurance plans, such as association health plans or short-term insurance. It’s a matter of opinion whether those plans are “better than Obamacare,” but, as we’ve explained before, they would be cheaper because they wouldn’t be required to cover certain benefits and because insurers could vary premium pricing more widely than the Affordable Care Act, or Obamacare, allows.", "In fact, despite the president’s comment, some of these options do not “100% … take care of” preexisting conditions. Short-term plans, which under the administration’s rule can provide coverage for up to 12 months or up to 36 months with renewals, aren’t subject to the ACA’s prohibitions against denying or pricing coverage based on health status. So those with preexisting medical conditions could be denied a policy, charged higher prices than other policyholders or have certain benefits excluded. (Several states have their own regulations and limits on short-term plans.)", "How much cheaper these plans could be than ACA marketplace plans depends on the person buying them. A January 2019 Congressional Budget Office report said premiums would vary based on a person’s health status. The CBO and the Joint Committee on Taxation estimated that for one type of short-term plan, premiums could be “as much as 60 percent lower” than the cheapest bronze plan on the ACA marketplaces “for people with low expected health care costs who are ineligible for premium tax credits.” A lesser type of short-term plan — one with limited benefits and fixed coverage amounts for hospital care — could have “premiums that are as much as 90 percent below” the cheapest bronze plans for healthy people ineligible for tax credits. But others, including older people, would probably pay more. “Estimating the actuarial value of such products is challenging because the scope of coverage is so varied and because coverage generally completely excludes services for any preexisting condition,” the report said of such plans.", "In the town hall, Trump said he’d like to “totally kill” the ACA and “come up — before we do that — with something that’s great.” We don’t know what the administration or Republicans may propose in the future, but in 2017, Trump backed Republican health plans that would lessen the current protections for those with preexisting conditions.", "Trump, referring to the novel coronavirus, said: Obama administration officials “made some decisions which were not good decisions. We inherited decisions that they made, and that’s fine. … We undid some of the regulations that were made that made it very difficult.”", "The facts: Trump was blaming an Obama-era “regulation” for the delayed availability of testing for the novel coronavirus. We don’t know what regulation Trump is talking about, and we got no response when we asked the White House, CDC and Food and Drug Administration for more information. But, as we have written, experts say Trump is wrong.", "“It’s not true,” Rachel Sachs, a Washington University in St. Louis law professor, told us.", "The Obama administration did attempt to impose a risk-based system of regulation on laboratory developed tests, or LDTs, and introduced draft guidance in 2014. But that guidance was never finalized, and was withdrawn after Trump won the election in 2016. “It never went into effect,” she said, “so it’s not an issue to walk back.”", "Erika Lietzan of the University of Missouri School of Law told us it was possible Trump was thinking of a de facto FDA policy that applies to LDTs in emergency situations, such as an outbreak. But it’s not clear if that policy stems from the Obama administration, and in any case, the agency was not prevented from allowing labs to create their own coronavirus tests. (For more on this see “Trump’s Misplaced Blame on Obama for Coronavirus Tests.”)", "Trump said: “Now the real back story is when the phony whistleblower – who’s a total phony — he heard the call supposedly, you know, through somebody — through the informant. You notice the way everybody disappeared once — thank goodness I had a transcriber — we had more than one. Thank goodness we had that call transcribed, because the transcripts of the call reveal that it was a perfect call. By that time they were already talking about impeachment, and they were going by a phony whistleblower rendition of a call that didn’t exist.”", "The facts: The whistleblower complaint about Trump’s July 25, 2019, call with Ukraine President Volodymyr Zelensky included three main points that were indeed in the White House’s own memo of the call: that Trump asked Zelensky to “initiate or continue an investigation” into Biden and his son, Hunter Biden; assist the U.S. in investigating allegations that “Russian interference in the 2016 U.S. presidential election originated in Ukraine”; and “meet or speak” about these matters with Trump’s personal attorney, Rudy Giuliani, and Attorney General William Barr.", "On Sept. 26, the day after the White House memo was released, then-Acting Director of National Intelligence Joseph Maguire testified that the whistleblower’s complaint “is in alignment with what was released yesterday by the president.”", "Trump: “You know, the economy is the best economy we’ve ever had. ... We’ve never had growth like we’re experiencing.”", "The facts: It’s not true that the U.S. is experiencing economic growth like never before. Trump made a similar claim in his State of the Union address, and we called it false. It still is.", "Trump had promised annual growth rates of 4% to 6% repeatedly, both as a candidate and as president. But the nation’s real (inflation-adjusted) gross domestic product has yet to reach even 3% a year under Trump.", "The real GDP grew 2.3% last year — down from 2.9% in 2018, according to the most recent data released on Feb. 27. The “deceleration in real GDP in 2019” was due primarily to declines in personal consumption expenditures and nonresidential fixed investment, according to the Bureau of Economic Analysis.", "Over the last 39 years — dating to Ronald Reagan’s presidency — the nation’s real economic growth has reached or exceeded Trump’s peak year of 2.9% a total of 19 times. Under Reagan, real GDP grew by more than 3% in six of his eight years, including a whopping 7.2% in 1984. Under President George W. Bush, real GDP grew 3.8% in 2004 and 3.5% in 2005. The best year under Obama was in 2015, when it reached 2.9%, equaling the best year under Trump in 2018.", "Trump: “[W]hen I came in, ISIS was all over Syria, all over Iraq, and we don’t want them coming to us. And it was a mess. … And I knocked out 100% of the — of the territorial caliphate. 100%. We knocked the whole thing out. … When I came — again, President Obama — it was all over the place.”", "The facts: It is true that coalition forces have retaken all of the territory once held by the Islamic State in Iraq and Syria, and much of that land has been reclaimed on Trump’s watch. But, as we have reported, Trump has repeatedly gone too far by claiming that 100%  of the caliphate has been recaptured during his administration.", "In fact, the overarching campaign against ISIS was launched by Obama in 2014. A Trump administration official has made clear that not all of the land was retaken under Trump.", "In a briefing on Dec. 21, 2017, Brett McGurk, then-special presidential envoy for the global coalition to counter ISIS, said that about 98% of the land comprising the ISIS caliphate had been recovered by coalition forces.", "“And significantly, 50% of all the territory that ISIS has lost, they have lost in the last 11 months, since January,” Trump’s first year in office, McGurk said. “So 50% of all the territorial losses against ISIS have come in the last 11 months over the course of 2017.”", "ISIS lost its last foothold in Syria in March 2019.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]