["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "The phrase “under God” was included when the Pledge of Allegiance was recited in all of the Democratic National Convention’s primetime televised spots.", "There were 30 caucus and council meetings during the DNC.", "During at least two of those meetings, the phrase “under God” was omitted from the pledge.", "A month after the back-to-back national political conventions, the state Republican Party of Wisconsin still has a two-word bone to pick with Democrats.", "\"At the Democratic convention, the Pledge of Allegiance was read with the words 'under God' removed,\" the Republican Party of Wisconsin claimed in a campaign mailer that landed, at least for some voters, in mailboxes on Sept. 17, 2020.", "Milwaukee, of course, was selected for the 2020 Democratic National Convention, but the event was transformed into an almost entirely virtual affair due to the coronavirus pandemic. So, most convention speeches were made from a variety of remote locations across the United States.", "We watched the DNC each night (the RNC, too), and each night this is what we heard: \"I pledge allegiance to the flag of the United States of America, and to the Republic for which it stands, one Nation under God, indivisible, with liberty and justice for all.\"", "So, what gives?", "Is the state GOP right about Democrats omitting \"under God\" at its event?", "When asked to back up the claim, state GOP spokesman Alec Zimmerman pointed PolitiFact to footage of the Aug. 18, 2020 LGBTQ Caucus meeting from the virtually virtual DNC.", "In addition to the main sessions each night, political conventions include a host of additional meetings -- from state delegations, to caucuses focused on specific topics. There were at least 30 of these during the DNC. In an email, Zimmerman wrote of the LGBTQ Caucus meeting:", "\"The person reciting the pledge takes an extra long pause during the spot where ‘under God’ is normally mentioned, as to acknowledge what she’s doing. All of this was done under the banner of the DNC during the Democrat convention, as is made clear by the header atop the video.\"", "The video, which is posted on YouTube, shows a person introduced as \"Dr. Richmond\" reciting the pledge. Richmond pauses with a head nod at the point in the pledge where \"under God\" is usually said.", "An Aug. 26, 2020 item from Reuters noted that \"under God\" was also omitted at the Muslim Delegates and Allies Assembly meeting.", "This is not the first time the claim has come up. Even President Donald Trump tweeted about it on Aug. 22, 2020.", "Our colleagues at PolitiFact National examined a similar claim from former Republican U.S. Senate candidate Peggy Hubbard of Illinois, who claimed in an Aug. 20, 2020 Facebook post:  \"The DNC omitted ‘one nation under God’ from the Pledge of Allegiance.\"", "As noted by PolitiFact National:", "Some Democratic caucus members omitted \"one nation under God\" from the Pledge of Allegiance during DNC meetings. But the line was not excluded from any of the convention’s primetime televised spots. On each night of the DNC, \"under God\" was included in the Pledge of Allegiance.", "Hubbard’s claim was rated Mostly False.", "Philip Shulman, spokesman for the Democratic Party of Wisconsin, criticized Republicans for highlighting the issue, saying: \"Donald Trump and Wisconsin Republicans know they can’t run on the issues, so instead they are desperately lying to Wisconsinites.\"", "The Wisconsin Republican Party in a mailer sent to voters said \"the Pledge of Allegiance was read with the words 'under God' removed\" at the Democratic National Convention.", "There is some truth here, in that this happened at two of the 30 or so caucus and council meetings. But that’s not the impression left by the GOP mailer. Videos from the convention show that \"under God\" was included on all four nights of the main event, which were livestreamed and carried by many TV stations.", "For a statement that contains an element of truth but ignores critical facts that would give a different impression, our rating is Mostly False.", "Mailer, Republican Party of Wisconsin, mailed to homes of some registered voters, Sept. 17, 2020.", "Email, Alec Zimmerman, Republican Party of Wisconsin senior communications adviser, September 21, 2020.", "Milwaukee Journal Sentinel \"‘We got hosed’\": Even most DNC logos have now erased Wisconsin,\" August 18, 2020.", "YouTube, Democratic National Convention, Day 2, Pledge of Allegiance, August 18, 2020. 1:30 mark", "PolitiFact National, \"The DNC did not omit ‘one nation under God’ from the Pledge of Allegiance,\" August 21, 2020.", "U.S. History.org \"The Pledge of Allegiance\"", "Factcheck.org \"Misleading claim swirls over Pledge of Allegiance at DNC,\" August 26, 2020.", "Reuters \"Fact check: The 2020 DNC did not omit ‘under God’ from every Pledge of Allegiance,\"August 26, 2020.", "Email, Philip Shulman, director of press strategy, Democratic Party of Wisconsin, Sept. 23, 2020.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]