["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Former Florida Gov. Jeb Bush responds to a question during a town hall meeting at the Pearson Community Center in North Las Vegas, Nev., Aug. 12, 2015. (Steve Marcus/Las Vegas Sun via AP)", "In a Twitter back-and-forth with Hillary Clinton’s 2016 campaign, former Florida Gov. Jeb Bush said Democrats don’t have a great track record for keeping student loan debt in check in recent years.", "On Aug. 10, as part of promoting her college affordability plan, Clinton tweeted a graphic that said \"$1.2 trillion, the amount 40 million Americans owe in student debt,\" accompanied by the text, \"Cost won't be a barrier to an education. Debt won't hold you back.\"", "Bush, running for the Republican nomination, responded with his own similar graphic that said, \"100 percent, the increase in student debt under this Democratic White House. Hillary Clinton: mortgaging the future of college grads for four more years.\"", "Has the student debt really doubled in the past seven years, and is it fair to tie it to Barack Obama’s presidency? (We also fact-checked Clinton’s response -- a third graphic that said Florida received an \"F\" in college affordability under Bush. See that article here.)", "The numbers, for the most part check out. But experts told us that rising student loan debt is a trend that started long before the Obama administration.", "\"The long term trend of colleges becoming unaffordable goes back to the mid-1980s -- when private colleges started jacking up the prices,\" said Stephen Burd, a senior policy analyst at the New America Foundation and an expert in higher education policy. \"In more recent years, it's been the publics that have seen bigger percentage increases in tuition.\"", "Total student loan debt has increased about 86 percent since Obama took office -- a bit under the 100 percent increase Bush cited -- according to figures from the Federal Reserve. At the end of 2008, right before Obama was inaugurated, the total student loan debt was $640 billion. By March 2015, student loan debt was $1.19 trillion.", "This graph from the National Center for Education Statistics shows the total student loan debt from 2003 through 2012, adjusted for inflation:", "Experts told us that total student debt increases when tuition increases and when more students enroll, and the 2008 recession caused both of these things to happen -- so the recent increase is more a function of the economic downturn, rather than having a Democrat in the White House.", "The economic downturn pushed states to cut higher education funding, so schools upped tuition to cover costs, said Donald Heller, dean of the College of Education at Michigan State University.", "Since 1980, private college tuition has increased about 200 percent, according to College Board data compiled by Heller. Public school tuition, on the other hand, has increased about 300 percent, with by far the biggest jump happening since 2008.", "As opposed to Obama, \"some critics say governors and state legislators are to blame since they didn't protect higher education funding -- and colleges, since they haven't controlled costs,\" said Joni Finney, director of the Institute for Research on Higher Education at the University of Pennsylvania.", "Even with the increased tuition, more people enrolled in college, as people tend to do when employment prospects appear to dry up, Heller said. Additionally, the recession left households with fewer of their own resources to fund higher education, so they had to take out more loans.", "There haven’t been any big policy changes so far in the Obama administration that would have affected student loan debt significantly, either positively or negatively, said Beth Akers, a Brookings Institution fellow and an expert on the economics of higher education.", "\"It is far reaching to suggest that the president has had a significant impact on student borrowing during his administration,\" Akers said.", "The White House pointed out that the Obama administration has taken other measures to improve college affordability, such as expanding federal scholarships and implementing programs to help borrowers pay back student loans.", "Akers added that more collective debt is not necessarily a bad thing because higher education generally produces large and positive returns for its graduates. More collective debt means that more people are pursuing higher education -- particularly those from lower income brackets, who need loans the most.", "Our ruling", "Bush said there has been a 100 percent \"increase in student debt under this Democratic White House.\"", "There has been a substantial increase in student loan debt over the course of Obama’s presidency -- but it’s an increase of about 86 percent, not 100 percent. Experts also told us that student loan debt was growing before Obama took office, too, and much of the increase that happened under his watch was a result of the recession and other factors out of the White House’s control. We rate Bush’s claim Half True.", "Twitter, Bush and Clinton exchange, Aug. 10, 2015", "Federal Reserve Bank of New York, \"Student Loan Debt by Age Group,\" March 29, 2013", "Federal Reserve Bank of New York, \"Student Loan Borrowing and Repayment Trends,\" April 16, 2015", "Federal Reserve Bank of New York, \"Delinquencies, Foreclosures and Bankruptcies Improve as Household Debt Stays Flat,\" May 12, 2015", "National Center on Education Statistics, \"Financing Postsecondary Education in the United States,\" May 2013", "Email interview, Bush spokesman Matt Gorman, Aug. 11, 2015", "Email interview, Clinton spokesman Ian Sams, Aug. 12, 2015", "Email interview, Michigan State College of Education Dean Donald Heller, Aug. 12, 2015", "Phone interview, Brookings fellow Beth Akers, Aug. 12, 2015", "Email interview, Constantine Yannelis, Ph.D. candidate in economics at Stanford University, Aug. 12, 2015", "Email interview, Joni Finney, director of the Institute for Research on Higher Education at the University of Pennsylvania, Aug. 12, 2015", "Email interview, student loans and legal expert Heather Jarvis, Aug. 12, 2015", "Email interview, White House spokeswoman Katie Hill, Aug. 12, 2015", "Email interview, New America senior policy analyst Stephen Burd, Aug. 13, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]