["About this rating", "On 10 September 2017, the White House's social media director Dan Scavino, Jr. posted several images and videos showing the effects of historically huge Hurricane Irma, which ravaged the Caribbean region before moving up to Florida.", "One such video purported to show the massive storm hitting Miami International Airport, but is actually of a completely different weather system (Lidia) at a completely different location (Mexico's Distrito Federal):", "This video was taken at the Aeropuerto Internacional de la Ciudad de México on 30 August 2017, and it shows the effects of Tropical Storm Lidia, not Hurricane Irma:", "VIDEO | La intensa lluvia de esta tarde obligó a suspender vuelos en el Aeropuerto de la Ciudad de México, cortesía @AICM_mx pic.twitter.com/Jx6eD3zHem", "— La Candente™ México (@LaCandenteMX) August 31, 2017", "(Translation: \"The intense rain this afternoon forced the suspension of flights at the Mexico City Airport, courtesy @AICM_mx.\")", "The Miami International Airport's Twitter account was quick to correct Scavino:", "This video is not from Miami International Airport.", "— Miami Int'l Airport (@iflymia) September 10, 2017", "Scavino deleted the video, explaining that he was inundated with information when he shared his erroneous message:", "Thank you. It was among 100s of videos/pics I am receiving re: Irma from public. In trying to notify all, I shared - have deleted. Be safe!", "Mexico had offered to send help to victims of Hurricane Harvey, which made landfall in Texas in August 2017 just days before its counterpart Irma hit the Caribbean, but rescinded the offer after a massive earthquake hit its Pacific coast on 8 September 2017, killing dozens and leaving millions of people in Mexico in need of aid.", "Agencia EFE..   \"Aeropuerto de Ciudad de México Suspende Operaciones por Fuertes Lluvias.\"\r\n    30 August 2017.", "Selk, Avi.   \"How Trump’s Social Media Director Got Hoaxed About Hurricane Irma.\"\r\n    Washington Post.   10 September 2017.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]