["By Lori Robertson, Robert Farley and D'Angelo Gore", "Posted on March 28, 2019", "In his first extended interview since the completion of the special counsel probe, President Donald Trump repeated several false and misleading claims regarding the investigation into Russian interference in the 2016 election.", "The FBI investigation began in late July 2016, and Robert S. Mueller III was appointed special counsel to oversee the inquiry on May 17, 2017. On March 24, Attorney General William P. Barr released a four-page memo summarizing the principal conclusions of a confidential report from Mueller on the investigation.", "Barr wrote that “despite multiple offers from Russian-affiliated individuals to assist the Trump campaign,” the Mueller report concluded: “'[T]he investigation did not establish that members of the Trump Campaign conspired or coordinated with the Russian government in its election interference activities.’”", "Three days later, the president strayed from the facts on various aspects of the yearslong probe in a lengthy phone interview with Sean Hannity of Fox News.", "Trump said: “[N]ow that they see the Mueller report, where you look at their finding — I mean, the finding was very, very strong. No collusion, no obstruction, no Russia, no nothing.”", "The facts: According to Barr’s memo, the Mueller report “did not draw a conclusion — one way or the other — as to whether the examined conduct [by Trump] constituted obstruction.” Barr wrote: “The Special Counsel states that ‘while this report does not conclude that the President committed a crime, it also does not exonerate him.’”", "Instead, “for each of the relevant actions investigated, the report sets out evidence on both sides of the question and leaves unresolved what the Special Counsel views as ‘difficult issues’ of law and fact concerning whether the President’s actions and intent could be viewed as obstruction,” Barr’s memo said. The attorney general said he and Deputy Attorney General Rod Rosenstein made the determination that the evidence is “not sufficient” to establish that Trump committed obstruction of justice.", "Trump said: “Russia, if they were at all for me – and by the way, if you look at all of the things, they were sort of for and against both, not just one way.”", "The facts: That is misleading. As we have written, indictments handed down in February 2018 against 13 Russians and three Russian organizations for interfering in U.S. elections show their efforts clearly sought to support Trump over Democratic candidate Hillary Clinton in the 2016 presidential general election.", "It’s true that prior to the election, in May 2014, the Russian operation’s aim was to “spread distrust towards the candidates and the political system in general,” the indictment says. And during the presidential primary in 2016, the Russians “engaged in operations primarily intended to communicate derogatory information about Hillary Clinton, to denigrate other candidates such as Ted Cruz and Marco Rubio, and to support Bernie Sanders and then-candidate Donald Trump.” By the general election, the groups’ efforts were clear and focused: to support Trump and oppose Clinton. According to the indictment, “by early to mid-2016, Defendants’ operations included supporting the presidential campaign of then-candidate Donald J. Trump (“Trump Campaign”) and disparaging Hillary Clinton.” After the election, the Russian group went back to sowing discord on both sides of the political aisle, staging rallies both supporting the president-elect and protesting his election.", "Trump said: “The FBI said he wasn’t lying, as I understand it, and if the Mueller group said he was lying, and you know what he has gone through, and what so many others have gone through.”", "The facts: Trump is referring to a report from Republicans on the House intelligence committee. It said former FBI Director James Comey testified to the committee that when two FBI agents interviewed then-National Security Adviser Michael Flynn at the White House on Jan. 24, 2017, they “discerned no physical indications of deception” and saw “nothing that indicated to them that he knew he was lying to them” (see page 54). However, the report goes on to note that FBI Deputy Director Andrew McCabe “confirmed the interviewing agent’s initial impression and stated that the ‘conundrum that we faced on their return from the interview is that although [the agents] didn’t detect deception in the statements that he made in the interview … the statements were inconsistent with our understanding of the conversation that he had actually had with the [Russian] ambassador.’”", "In an interview before a House committee on Dec. 7, 2018, Comey clarified, “My recollection was [Flynn] was — the conclusion of the investigators was he was obviously lying, but they saw none of the normal common indicia of deception: that is, hesitancy to answer, shifting in seat, sweating, all the things that you might associate with someone who is conscious and manifesting that they are being — they’re telling falsehoods. There’s no doubt he was lying, but that those indicators weren’t there.” (See page 106.)", "On Dec. 1, 2017, Flynn pleaded guilty to making false statements to the FBI. Flynn admitted to lying to FBI agents about two discussions he had with Sergey Kislyak, then the Russian ambassador to the United States, in December 2016 when Flynn was still a private citizen and before Trump took office.", "Trump said: “The night I won, they were all screaming ‘lock her up, lock her up.’ Look, she lost 33 – they deleted 33,000 emails, and they were – BleachBit. That’s a big deal and it’s a very expensive process, and almost nobody does it because it’s so expensive. But that’s the way you really get rid of it. So she deleted 33,000 emails.”", "The facts: As we have written, in December 2014, Clinton gave the State Department 30,490 work-related emails that she sent or received while she was secretary of state. There were another 30,000 emails or so that were deemed personal by Clinton. Those were not turned over to the department. An outside contractor for Platte River Networks wiped Clinton’s computer hard drive of all emails sometime between March 25 and March 31, 2015, according to the FBI. PRN used a free software program called BleachBit to delete the emails. During its investigation, the FBI recovered nearly 15,000 deleted emails that were not part of the 30,490 work-related emails that Clinton gave to the department. About 5,600 of the 15,000 emails that were forensically recovered by the FBI were deemed work-related, but a “substantial number” of them were near duplicates of emails that were already released to the public.", "More important, Comey said the FBI “found no evidence that any of the additional work-related emails were intentionally deleted in an effort to conceal them.”", "The State Department’s policy allows its employees to determine which emails are work-related and must be preserved. “Messages that are not records may be deleted when no longer needed,” according to the department’s Foreign Affairs Manual.", "Trump said: “I think it’s very important to know that Russia or anybody else had no impact on votes. And that’s very important for people to know. And that’s been coming out, as you know, from every agency and everybody that’s done it. So whether they tried, and how hard they tried, and President Obama knew, the bottom line is, they had zero impact on the election of 2016. And I’m very happy about that.”", "The facts: We know of no government agency that has concluded that the Russian efforts “had zero impact on the election of 2016.” An October 2016 report by the Department of Homeland Security’s Office of Intelligence and Analysis found that “Russian government cyber actors” potentially targeted “Internet-connected election-related networks” in 21 states. But none of those states reported any evidence of altered voter data or ballots. However, reports from the director of national intelligence and Department of Justice indictments have detailed various other ways that Russians inserted themselves into the presidential election, and those reports specifically avoided commenting on whether those efforts ultimately swayed voters.", "The Office of the Director of National Intelligence on Jan. 6, 2017, released a declassified intelligence report that said “Russian President Vladimir Putin ordered an influence campaign in 2016 aimed at the US presidential election.” Among other things, the report said, Russian intelligence services gained access to Democratic National Committee computers for nearly a year, from July 2015 to June 2016, and released hacked material to WikiLeaks and other media outlets “to help President-elect Trump’s election chances.” The report itself stated that the intelligence community “did not make an assessment of the impact that Russian activities had on the outcomes of the 2016 election,” noting that the agency “does not analyze US political processes or US public opinion.”", "In a Senate intelligence committee hearing on Jan. 10, 2017, then-Director of National Intelligence James Clapper reiterated that the report “does not — repeat does not assess the impact of Russian activities on the actual outcome of the 2016 election or draw any conclusions in that regard one way or the other.”", "Indictments handed down by the Justice Department in February 2018 against 13 Russians and three Russian organizations provided more detail about the Russians’ efforts. The indictments allege a Russian conspiracy that involved using the names of U.S. citizens and companies to illegally buy political ads on social media and stage political rallies. The defendants were alleged to have employed hundreds of people for online operations, “ranging from creators of fictitious personas to technical and administrative support personnel, with an annual budget of millions of dollars,” Deputy Attorney General Rosenstein said. As with the Office of the Director of National Intelligence, Rosenstein said, “There is no allegation in the indictment that the charged conduct altered the outcome of the 2016 election.” In other words, the indictment made no determination about that.", "Trump said: “As far as your other part of the question, in September, if you look, supposedly, the FBI told President Obama all about Russia trying to get involved in some form in the election. And he decided to do nothing about it because he thought Hillary Clinton was going to win. So he didn’t want to do anything because he thought that Clinton was going to win and he didn’t want to upset the applecart. But he knew about it. And the question is – one of the many, many questions, and this is probably not as big as other questions because you’re talking about major, major treason and corrupt and all of the things. But one of the questions, why didn’t he do something?”", "The facts: As we’ve written, Obama’s administration did “do something” after being informed by the CIA in August 2016 about Russia’s election interference.", "Obama said he confronted Russian President Vladimir Putin that September about the hacking of the Democratic National Committee’s computer servers, and three months later he announced sanctions against Russia for that reason.", "Prior to that, Obama said his “principal goal leading up to the election” was to have the Department of Homeland Security and the Election Assistance Commission work with states to prevent Russia from hacking into voting systems and tampering with registration rolls and ballots.", "In a June 2017 congressional hearing, Jeh Johnson, Obama’s second secretary of DHS, said: “I can tell you for certain that, in the late summer, fall, I was very concerned about what I was seeing, and this was on my front burner all throughout the pre-election period in August, September, October, and early November — to encourage the states to come in and seek our assistance. And I’m glad that most of them, red and blue, did.”", "Johnson said there was no evidence that votes were changed in the election.", "Trump said: Well, when I said there could be somebody spying on my campaign, a lot of things happened. It was like — it went wild out there. They couldn’t believe that I could say such a thing. And as it turned out, that was a small potatoes compared to what went on.", "The facts: Trump’s comment came in response to Hannity mentioning the Foreign Intelligence Surveillance Act applications in 2016 and 2017 from the FBI and Department of Justice for electronic surveillance on a former Trump campaign adviser, Carter Page. Hannity said those approved FISA court orders “gave a backdoor into your campaign for spying, which I know the media made fun of at the time, when you said it happened.”", "First, Page wasn’t with the campaign when the FISA surveillance requests were approved. Page was a foreign policy adviser to the campaign for about six months, and he left in late September 2016, after news reports that U.S. intelligence officials were looking into possible communications between him and Russian officials. The first FISA court order was issued to the DOJ and FBI in October 2016, with three subsequent renewals.", "Second, Trump’s claim about spying was decidedly different. He accused President Barack Obama of illegally wiretapping his phones. “Just found out that Obama had my ‘wires tapped’ in Trump Tower just before the victory,” Trump said in a series of tweets on March 4, 2017, calling his predecessor a “Bad (or sick) guy!” and comparing his unsubstantiated allegation to Watergate. There’s no evidence to support that.", "In a September 2017 court filing, the FBI and the National Security Division confirmed they had no record to support the president’s comments. “Both FBI and NSD confirm that they have no records related to wiretaps as described by the March 4, 2017 tweets,” the Justice Department motion said.", "Trump said: “But these people, there were so many lies, and lies before Congress, which is just about the ultimate, sworn testimony where Comey told so much. And he leaked – he leaked classified information. Well, if somebody in our team leaked classified information, it would be years in jail.”", "The facts: We’ve explained Comey has admitted that, after he was fired as FBI director in May 2017, he shared with his “legal team” copies of four of the seven memos he had written about his interactions with Trump. But Comey said the four memos he shared were all unclassified at the time, including a February 2017 memo, which he instructed Columbia Law School professor Daniel Richman to relay the “substance” of to the New York Times.", "In that memo, Comey wrote that when he met with Trump, the president brought up the FBI investigation of former National Security Adviser Flynn and said, “I hope you can see your way clear to letting this go, to letting Flynn go. He is a good guy. I hope you can let this go.”", "Comey said he sent Richman to the Times with that information with the hope that it “might prompt the appointment of a special counsel” in the Russia investigation.", "In an April town hall event broadcast on CNN, Comey said he had decided that only three of the seven memos he wrote contained classified information. However, when all seven of Comey’s memos were sent to Congress in April 2018, four of them had markings indicating they contained some classified information. That means one of the memos that Comey previously shared was “up-classified,” which refers to information that is retroactively deemed classified when documents are reviewed for public release.", "We don’t know which memo that was, but we know it wasn’t the one Comey told Richman to convey to the Times. When that was made public, the memo was labeled “unclassified//FOUO,” which the National Archives and Records Administration says is used by some federal agencies for documents “requiring a degree of control” but does “not designate classified national security information.”", "Update, Aug. 29, 2019: The Department of Justice’s Office of Inspector General issued a report Aug. 29, 2019, that said Comey gave a copy of one memo (identified as “memo 4”) to Richman with instructions to share the contents of the memo with a reporter. The FBI later determined that memo 4 “did not contain classified information,” according to the report.", "“We found no evidence that Comey or his attorneys released any of the classified information contained in any of the Memos to members of the media,” the IG report said.", "Trump said: “But these were people [on Mueller’s team] that contributed, most of them contributed to [Clinton’s] campaign. I mean, it was shocking to see it.”", "The facts: Some of the lawyers who worked on the special counsel’s team did make contributions to Hillary Clinton’s presidential campaign, but not “most of them.”", "As we’ve written before, there were 17 team members, and five of them gave money to Clinton’s 2016 campaign. Those five were: Jeannie Rhee ($5,400), James Quarles ($2,700), Rush Atkinson ($200), Elizabeth Prelogar ($250) and Kyle Freeny ($250), according to contribution information available through the Center for Responsive Politics’ website.", "One other investigator on the team, Andrew Weissmann, gave $2,300 to Clinton in 2007.", "Trump said: “I mean, McCabe, his wife got hundreds of thousands of dollars. He was running the FBI and running all sorts of cases, and his wife got hundreds of thousands of dollars from essentially Clintons, from Clintons’ closest friend. And then he ruled so favorably. I mean, he tries to say that he wasn’t involved. I don’t think too many people believe that.”", "The facts: Trump gives the false impression that former acting FBI Director Andrew McCabe was “running the FBI” and its investigation of Clinton’s emails when McCabe’s wife was running for a Virginia state Senate seat and received nearly $700,000 in campaign contributions from political action committees affiliated with Terry McAuliffe, the former Democratic governor of Virginia and a longtime friend and ally of Hillary and Bill Clinton.", "Jill McCabe lost the election against Republican incumbent Richard Black in November 2015. That was months before the FBI promoted her husband from associate deputy director to deputy director in February 2016, which is when he “assumed for the first time, an oversight role in the investigation into Secretary Clinton’s emails,” according to an FBI spokesman quoted in a Wall Street Journal article about the campaign donations.", "That is backed up by a June 2018 report from the Department of Justice inspector general that says: “The fact that McAuliffe supported Dr. McCabe’s campaign, and was a known associate of Hillary Clinton, did not create any connection between the Clinton email investigation and Dr. McCabe’s financial interests. Indeed, by the time McCabe became Deputy Director and assumed supervisory responsibilities for any Clinton-related matters, Dr. McCabe had already lost her election, and no developments in the Clinton-related matters could have any plausible impact on Dr. McCabe’s financial interests.”", "“Once the campaign was over, officials said, Mr. McCabe and FBI officials felt the potential conflict-of-interest issues ended,” the Journal reported. The article also noted that “any final decisions on that probe” about Clinton’s emails were made by Comey, who was then FBI director.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]