["About this rating", "In June 2020, a screenshot supposedly showing a set of pornographic DVDs on the shelves behind former soccer player John Barnes during an appearance on British TV channel Sky News was circulated on social media:", "This is not a genuine still shot of Barnes during a TV appearance. The pornographic DVDs on the shelves behind Barnes were photoshopped into this image. In the original footage, various books, such as \"Sober\" by Tony Adams, and \"Ghost on the Wall\" by Derek Dohren, can be seen on the shelf behind him.", "Here's a comparison of the fake image (left), and a still shot from the original footage (right):", "Barnes' interview on Sky News, in which he defended comedian Leigh Francis' use of blackface, can be viewed here.", "While this image of pornographic DVDs behind Barnes is obviously fake, the fake photo seems to have been inspired by another embarrassing incident involving him.", "A few days before the Barnes image started circulating online, he shared a meme on social media featuring an image of U.S. President Donald Trump that included a fictitious quote from Trump's mother, in which she calls her son an idiot (you can read about the fake quote here). Barnes also inadvertently included a few stills from his camera roll that featured pornographic images.", "Barnes has since apologized for sharing the NSFW images:", "Kershaw, Tom.   \"John Barnes Apologises for Posting Pornographic Image on Twitter.\"\r\n    Independent.   7 June 2020.", "Sky News.   \"John Barnes Defends Keith Lemon Star Leigh Francis' Portrayals of Black Artists on Bo' Selecta.\"           8 June 2020.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]