["“Here’s the full rant. ‘Motive unknown’ amirite?” reads a tweet by The Daily Mao.", "The accompanying screenshot appears to show a Facebook post from an account called Robert Aaron Long, urging Americans to “fight back against China”.", "“China is engaged in a COVID coverup. They blocked our investigators from going to their lab in Wuhan and finding the truth about the experiments they were conducting there,” the post reads.", "“ALL AMERICANS NEED TO FIGHT BACK AGAINST CHINA, NOW ... THE GREATEST EVIL OF OUR TIME.”", "Robert Aaron Long was charged with murder after opening fire in three Asian massage parlours around the US city of Atlanta on March 16, 2021. The mass shooting left eight people dead, including six women of Asian descent.", "The killings prompted rallies in several major US cities, where thousands marched to denounce anti-Asian racism.", "The same image was shared widely on social media after the shooting, including here, here and here on Twitter; here, here and here on Facebook; as well as here on Reddit.", "However, the image does not show a genuine Facebook post.", "New York Times reporter Davey Alba pointed out that several graphic features in the image did not display in the way seen in a genuine Facebook post.", "“If you look closely at the positioning of the user pic and the Reactions, you’ll see the graphics are misaligned,” he tweeted, accrediting the find to digital investigation expert Benjamin Decker.", "PSA: This screenshot of a supposed post by the suspected Atlanta shooter is spreading on social media but it is a hoax. If you look closely at the positioning of the user pic and the Reactions, you'll see the graphics are misaligned. This is manipulated media. (H/T @btdecker) pic.twitter.com/Tb7vzqyEwG", "These suspicious graphic features include large white space between the Facebook user’s name and the time of the post, as well as the overlapping of emoji reactions from right-to-left rather than left-to-right, as typically seen in Facebook posts.", "A Facebook representative also said the image had been doctored.", "“These screenshots are fake and we’re removing them from the platform for violating our policies,” Andy Stone, Facebook’s policy communications director, said in a tweet.", "Yes, this is a fake. https://t.co/noADBIiQWW", "The photo featured in the profile picture genuinely shows Robert Aaron Long and has been widely published by news media.", "AFP found no trace of a Facebook account with the username and profile picture seen in the hoax image.", "The image was also debunked by fact-checking organisation Snopes and news site ThinkPol.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]