["About this rating", "An Elle interview quoted Harris relaying an anecdote that was similar to an incident recounted by King in 1965. Harris said her experience at a civil rights protest as a toddler was told to her by her mother, so she does not remember it herself.", "We are unable to determine that Harris, who heard the account from her now-deceased mother, deliberately plagiarized it from King.", "An October 2020 interview with U.S. Vice President-elect Kamala Harris in Elle magazine began making the rounds again in January 2021, as many, including conservatives, accused her of plagiarism. At the heart of the controversy was an anecdote she recounted that had eerie similarities to one shared by civil rights icon Martin Luther King Jr. in a 1965 interview with Playboy magazine.", "Our readers wanted to know if Harris did indeed plagiarize King in her 2020 interview. The answer is complicated. While it is true that their stories are similar, her anecdote was told to her by her mother, as Harris describes it.", "At the beginning of the Elle interview, Harris describes something she said as a toddler:", "She laughs from her gut, the way you would with family, as she remembers being wheeled through an Oakland, California, civil rights march in a stroller with no straps with her parents and her uncle. At some point, she fell from the stroller (few safety regulations existed for children’s equipment back then), and the adults, caught up in the rapture of protest, just kept on marching. By the time they noticed little Kamala was gone and doubled back, she was understandably upset. “My mother tells the story about how I’m fussing,” Harris says, “and she’s like, ‘Baby, what do you want? What do you need?’ And I just looked at her and I said, ‘Fweedom.’”", "In a 1965 interview with Alex Haley, King shared the following anecdote:", "I never will forget a moment in Birmingham when a white policeman accosted a little Negro girl, seven or eight years old, who was walking in a demonstration with her mother. “What do you want?” the policeman asked her gruffly, and the little girl looked him straight in the eye and answered, “Fee-dom.” She couldn’t even pronounce it, but she knew. It was beautiful!", "The way Harris described it, her now-deceased mother told her she said “Fweedom.” So she claims to have no direct recollection of the moment. There has been no acknowledgment from Harris regarding this plagiarism accusation, and even then there is no way to determine that her mother, who she attributes the story to, pulled this anecdote from the King interview.", "Harris has told this story multiple times before. The earliest reported instance was in a 2004 interview with W Magazine. In the preface to her 2009 book \"Smart on Crime,\" she recounted it in a similar manner, omitting the part where they were at a civil rights rally: \"My mother used to laugh when she told the story about the time I was fussing as a toddler: She leaned down to ask me, \"Kamala, what's wrong? What do you want?\" and I wailed back, \"Fweedom.\"\"", "She also referenced it in the same way on page 8 of her 2019 book, \"The Truths We Hold: An American Journey,\" in a 2019 interview with Jimmy Fallon, and in an interview on CSPAN, where she continued to describe it as a story recounted by her mother.", "Therefore, we rate this claim as a “Mixture.”", "Nur Nasreen Ibrahim is a reporter with experience working in television, international news coverage, fact checking, and creative writing.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]