["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "U.S. Sen. Marco Rubio, R-Fla. (AP)", "U.S. Sen. Marco Rubio’s tweet about a New Testament verse was an attack on Floridians who support President Donald Trump, according to an article on Facebook that lacked evidence.", "\"Marco Rubio just publicly shamed his own constituents for flocking to Trump rally,\" stated a Dec. 9 headline on verifiedpolitics.com.", "Facebook users flagged the post as being potentially fabricated, as part of the social network’s efforts to combat fake news. We found that this article jumped to a conclusion about what prompted Rubio’s tweet.", "Trump held a rally in Pensacola the night of Dec. 8, when he called on Alabama residents to vote for Republican Roy Moore. A few days later, Moore lost the U.S. Senate election to Democrat Doug Jones. The Washington Post reported in November that Moore, while in his 30s, initiated sexual encounters with several teenagers, according to the women interviewed by the newspaper.", "Verifiedpolitics.com wrote that the crowd in Pensacola, composed largely of Floridians, cheered for Trump.", "\"It was this display that moved the normally mild mannered Senator from Miami to lash out on Twitter and throw Republicans from his own state under the bus,\" the website stated.", "The article then cited Rubio’s tweet on the morning of Dec. 9:", "\"At the sight of the crowds his heart was moved with pity 4 them b/c they were troubled & abandoned like sheep without a shepherd.Matthew 9:36.\"", "At the sight of the crowds his heart was moved with pity 4 them b/c they were troubled & abandoned like sheep without a shepherd.Matthew9:36", "The tweet drew hundreds of replies. While some on Twitter replied with a photo of Trump’s Pensacola rally, a correspondent for the Eternal World Television Network replied that the verse was part of the Roman Catholic daily Mass.", "\"Once again, @marcorubio quotes the daily Gospel for Mass, and Twitter can’t handle it,\" Jason Calvi tweeted.", "In his autobiography An American Son, Rubio wrote that he attends services at Christ Fellowship, his wife’s evangelical church, on most Saturday nights and then mass at St. Louis Catholic Church on Sundays.", "We sent emails to Rubio’s spokeswoman to ask if his tweet related to Trump’s speech or Moore and did not get a reply.", "Rubio had no tweets Dec. 8 or 9 that mentioned Trump or Moore. He tweeted about tax reform, Army vs. Navy football and Venezuela.", "But Rubio had made previous statements critical of Moore.", "In November, Rubio said on Fox & Friends that Moore’s accusers are \"very credible\" and that the charges are \"very serious\" and could be problematic for Moore if elected.", "However, the implication of the verifiedpolitics.com article is that Rubio used his tweet to shame his own Florida constituents for attending the Trump rally. Rubio’s criticism of Moore had been directed at Moore himself -- not Floridians who support Trump. And while Rubio at times has appeared critical of Trump or his administration, on other issues, such as Cuba policy, the two politicians have partnered together.", "Rubio regularly tweets verses", "For several months, Rubio has regularly tweeted lines from the Bible, drawing attention from the media, religious experts and others", "In an October interview with the Christian Broadcasting Network, Rubio defended his practice of tweeting out verses most mornings.", "\"I'll continue to do it,\" he told the network. \"If they don't like it, they don't have to follow me.\"", "We interviewed two experts about the religious meaning of the verse that Rubio quoted: Candida Moss, a theology professor at the University of Birmingham, and Christopher R. Matthews, Research Professor of New Testament at Boston College.", "\"The surface meaning of the verse is rather clear: sheep do not organize themselves (they're not the brightest), so in the absence of a shepherd/leader there is the potential for confusion and chaos,\" Matthews said.", "The verse comes within the context of several stories about Jesus healing the sick, teaching people in the synagogues and proclaiming the good news, Moss said.", "\"In its immediate context this verse is quite clearly about the people needing spiritual leadership and practical assistance (in the form of what we would call health care),\" she said. \"Taken out of context, however, that meaning is expanded so that it becomes a broader statement about people lacking moral and spiritual guidance, and how this state of affairs is distressing to God.", "Founded in 2017, Verified Politics describes itself as a political news website that it is for readers who are tired of fake news. We emailed the website and asked if they had any evidence that Rubio tweeted a New Testament verse to shame his own constituents for flocking to a Trump rally, and we did not get a response.", "Rubio, a regular at Sunday mass, provided no explanation for his tweet so it’s merely speculation to conclude that his point was commentary on Trump’s Pensacola rally the previous night. The verse from Matthew that Rubio tweeted was part of the daily Mass for that Sunday.", "We rate this claim False.", "Verifiedpolitics.com, \"Marco Rubio Just Publicly Shamed His Own Constituents For Flocking To Trump Rally,\" Dec. 9, 2017", "U.S. Sen. Marco Rubio, Tweet, Dec. 9, 2017", "Eternal World Television Network, Daily mass readings, Dec. 9, 2017", "United States Conference of Catholic Bishops, Daily readings, Dec. 9, 2017", "Fox and Friends, Interview with U.S. Sen. Marco Rubio, Nov. 20, 2017", "Politico op-ed by Joel Baden, professor of Hebrew Bible at Yale Divinity School, \"Marco Rubio is tweeting the most Republican part of the Bible,\" July 9, 2017", "Palm Beach Post Post on Politics, \"Marco Rubio triggers Twitter freakout by quoting Bible,\" May 16, 2017", "Freedom from Religion Foundation press release, \"FFRF’s #TuesdayThoughts: @MarcoRubio, silence your bible verses,\" Aug. 22, 2017", "Tampa Bay Times The Buzz blog, \"Rubio on Bible tweets: 'I'll continue to do it,'\" Oct. 19, 2017", "Tampa Bay Times The Buzz blog, \"Marco Rubio: Roy Moore hasn’t done anything ‘convincing or helpful,’\" Nov. 20, 2017", "Tampa Bay Times, \"As Trump whips up controversy over Puerto Rico, Rubio calls for less 'noise,'\" Oct. 13, 2017", "The Hill, \"Rubio pushes back on media for calling Bible verses ‘Republican,’\" July 9, 2017", "Washington Post, \"Rubio-Trump relations blossom even amid investigation,\" June 18, 2017", "Interview, Professor Candida Moss, Cadbury Professor of Theology School of Philosophy, Theology & Religion at the University of Birmingham, Dec. 14, 2017", "Interview, Christopher R. Matthews, research professor of New Testament at Boston College, Dec. 14, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]