["About this rating", "On 15 August 2016 Facebook user Joe Amos shared photographs of automobiles labeled \"Mutation Response Vehicle\" (MRV), purportedly spotted by a friend of his near Longwood, Florida:", "Amos appeared to be simply perplexed by the unusual trucks, but the photographs were quickly noticed by conspiracy forums and inspired YouTube videos questioning their origins:", "We contacted police in Longwood to ask whether they were aware of the Mutation Response Vehicles, but a traffic officer told us he hadn't heard the rumors (nor spotted the vehicles) although he was \"on the road all day,\" and a police sergeant was similarly unfamiliar with the claim.", "However, a YouTube commenter quickly located the source of the trucks. Pathogen Trackers offered some explanation (alongside images of the same vehicles) that wasn't easily parsed by the general public, but the site made reference to Burning Man's Black Rock City and described a purpose consistent with participation in that annual desert festival:", "During the day our massive, customized MRV units serve as a needed landmark and a graphic art exhibition for the passers by. At night, they illuminate fully to again help weary travelers find their way home. Even our well-lit, Chilled Hydration Station and 50' Pathogen Tacking Antenna serve as beacons on the corners our camp.", "Another benefit of the MRV and MSV fleet is there ability to support and keep self-contained many of the camps necessities such as on-site water tanks, power generation, walk-in refrigeration, and sufficient transport capability to haul-out all of our gear and waste in a single convoy. This commitment to operating a self-sufficient camp is a key component in our ability to support our neighbors camps and help feed the members of our larger community.", "Using our Playa Reconnaissance Vehicle (a/k/a Art Car) we are able to scour the desert and help those in need make there way across the scorched earth. We also provide transportation among the countless art projects and also return with others to the safety of our camp.", "Two videos (neither of which is embeddable) explain that the Mutation Response Vehicles were created for use at the Burning Man festival and have nothing to do with any potential disease outbreaks or public health agencies.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]