["About this rating", "On 15 March 2016, a Facebook user published the above anecdote about a Target in Houston, warning fellow users about the dangers of potential kidnappers (or human traffickers) haunting local retail establishments.", "According to the post's author, she was in a checkout lane with her toddler daughter and infant son, when two women flanked her (standing \"way too close\") at the register. After the older of the two women began initiating conversation about her children, the poster wrote that she became \"incredibly uncomfortable\" and she felt that \"something wasn't right about this situation.\"", "The poster said she reacted to her discomfort by making \"a big deal\" of using her shopping cart to barricade the women away from her children, then described the banter taking a sinister turn:", "I asked them to back up so that I could turn my cart around. I made a rather big deal about turning my cart around in line - because NO WAY was I putting my kid out of arms reach while I unloaded my cart. I kept my daughter next to me and turned the backwards cart at an angle so that I could reach the items to place on the belt. This way, the cart was between me and the women and my child was next to me.", "Again, the older woman asked my daughter's name. By now, this was the 4th time one of them had asked her name. I replied and said we were learning about stranger danger and she didn't have to reply. The younger woman answered this by saying \"oh at some point, she will have to talk to strangers. What if she gets lost in this store? Try as we may, you'll take your eyes off of her at some point.\" She stared at me as she said this. WHO SAYS THIS? The older woman again asked my daughter her name, to which I loudly instructed my daughter not to answer her.", "Readers were presumably supposed to infer here that the two women in the story were kidnappers or traffickers \"scouting\" the family. The remark attributed to the younger woman neatly \"proved\" their purported intent, despite the likelihood that criminals of that nature aimed to operate without attracting attention or raising suspicions. But the writer was convinced, possibly before even setting eyes on the women:", "As I loaded my things and my kids into the car, I watched the door and parking lot. The two women never came out of target. This happened around lunch time. I am a prime candidate for being targeted. I have a child of the \"right\" age and am \"distracted\" shopping alone.", "All that readers knew about the situation was supplied by the poster. All the frightening were assumptions on the part of the poster, and the claim sounded very much like a number of others that circulated on social media warning \"distracted\" lone female shoppers of a purportedly growing problem involving kidnappings at large chain stores. Despite a spike in such tales in 2015 and 2016 on Facebook, we have yet to track down one instance involving an abduction of the sort repeatedly described in warnings.", "In May 2015, a Facebook user's harrowing account of an Oklahoma Hobby Lobby near miss circulated widely; in June, Twitter users panicked over stories of sex slavery rings targeting college kids during summer job interviews; later that same month, an old theme park abduction urban legend resurfaced; a terrifying tale of purported teenaged abductors armed with heroin in the bathroom of a Denton, Texas, Dillards department store spread far and wide; a Hickory, North Carolina woman was convinced human trafficking rings were menacing Walmart parking lots, using gift bags as bait; a Long Island Target was briefly cited as the locale of similar kidnappers in August 2015; and the rumor moved to a Target in Longview, Texas in February 2016.", "Exposure to even one of those claims would be enough to make many shoppers wary, and the poster appeared to be working under the expectation that it was just a matter of time until her children were spotted and snatched while she was \"distracted\" by shopping alone. As is generally the case, the events described were inconsistent with known basic facts about kidnapping or sex trafficking. The United Nations Office on Drugs and Crime's FAQ about human trafficking explains the risks and profiles of victims of those crimes.  (Abductors of children from public places don't generally risk calling attention to themselves by directly interacting with their potential victims in an overtly suspicious and hostile manner.)", "We contacted the Target in question and as expected, a manager was unable to answer questions other than to confirm that Target's corporate office was aware of the claim and state that the story was \"completely overblown.\" In addition, we attempted to contact the poster of the item via Facebook to obtain information about her claim but received no response as of this writing.", "We also contacted police in Houston to find out whether there was any basis to the rumor, and an Investigative First Responder in the area of Houston where this Target is located told us:", "I checked every report written from the past week in my district as a part of my daily duties. Lots of car break-ins, thefts, assaults ... a pretty typical week, really. Nothing major. Not one suspicious person report at any of our retail stores, including this Target", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]