["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "In his re-election bid, U.S. Sen. Dean Heller, R-Nev., argued that his leading Democratic opponent wants to take away tax cuts for working families.", "Heller’s campaign announced its latest attack on Rep. Jacky Rosen, D-Nev., in a press release on tax filing day.", "\"Heller campaign releases new digital ad on Jacky Rosen’s reckless promise to repeal middle-class tax cut,\" the campaign wrote on April 17.", "The Heller campaign ad consists mainly of broadcast clips of reporters giving examples of companies that announced bonuses and raises for workers. But it closes by saying Rosen \"wants the tax bill repealed,\" and includes a clip of a newscaster saying \"Nevada Congresswoman Jacky Rosen wants the recently passed GOP tax bill repealed.\"", "The Heller campaign said that report was about a Las Vegas event held by the advocacy group Not One Penny. The event was part of a nationwide protest against the Republican-backed Tax Cuts and Jobs Act, and Rosen participated.", "The group billed the national action as the \"Repeal the Trump Tax Tour,\" saying the new tax law \"will raise taxes for 92 million middle-class families, rip health care away from 13 million people, and threaten life-saving programs — all to give tax breaks to millionaires, billionaires, and wealthy corporations.\"", "According to the Tax Policy Center, a project of the Urban Institute and Brookings, 90 percent of middle-income households would pay less in 2018, but those savings largely disappear by 2027, except for the top 1 percent of earners.", "For its stop in Las Vegas on Jan. 15, 2018, the group called on Republicans to \"repeal the Trump Tax on middle-class Families,\" as the group’s press release put it.", "We watched the full video of the event.", "Rosen left no room for doubt that she opposed the Republican tax cuts.", "\"This tax bill at its core is a giveaway to special interests and the wealthy,\" Rosen said. \"And it will disadvantage millions of working families in the long run. In 10 years, by 2027, more than half of all Americans will pay more in their tax bill.\"", "Rosen said the bill was \"out of balance,\" but stopped short of calling for full repeal.", "\"We must come together to use common sense to fix this reckless tax bill and protect our families against long-term damage,\" Rosen said.", "While the news report quoted in the Heller ad said she called for repeal, Rosen herself didn’t say that. A search of the Nexis news database and of Rosen’s Twitter accounts reveals no mention. Nor could the Heller campaign provide any examples.", "Heller campaign spokesman Keith Schipper said, \"Rosen never made it a point to say she just wanted to change part of it and keep other parts.\"", "In a March 27 op-ed, Rosen said she supports middle-class tax cuts and chastised Heller.", "\"If Sen. Heller and Republicans had really wanted to give a tax cut to working families, why not give them a bigger, permanent tax cut directly instead of relying on trickle-down economics?\" she wrote.", "Heller said that Rosen promised to repeal middle-class tax cuts. The Republican tax law provides immediate tax relief to middle-class families, though those savings expire without further action for all but the highest earners. Rosen spoke at an event that called for repeal of what they called the \"Trump Tax\" on the middle class.", "However, Rosen said the law should be fixed; she did not say it should be repealed. As a point of policy, both Rosen and the organizers of the event where she spoke support middle-class tax cuts, but not the package passed by Republicans.", "There’s some nuance here, but Rosen didn’t vow to repeal the current tax law. We rate this claim Mostly False.", "Heller for Senate, Press release, April 17, 2018", "Heller for Senate, Repeal, April 17, 2018", "Not One Penny, Congresswoman Jacky Rosen to Join State Senator Yvanna Cancela and Assemblywoman Sandra Jauregui For Press Conference Slamming the TrumpTax’s Disastrous Effects on Nevada Families, Jan. 12, 2018", "Tax March, Las Vegas, Jan. 15, 2018", "Tax Policy Center, The TCJA Would Cut Taxes By An Average of $1,600 in 2018, With Most Benefits Going To Those Making $300,000-Plus, Dec. 18, 2017", "Reno Gazette Journal, Heller's tax bill a corporate giveaway: Rosen, March 27, 2018", "PolitiFact, Did Nancy Pelosi vow to raise taxes if Democrats take the U.S. House?, April 9, 2018", "Email interview, Keith Schipper, spokesman, Dean Heller for Senate, April 20, 2018", "Email interview, Stewart Boss, spokesman, Jacky Rosen for Senate, April 20, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]