["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A new ad claims President Barack Obama broke his promise about the impact of the economic stimulus plan.\n\nThe ad uses a familiar Republican talking point, that Obama \"promised\" low unemployment if the stimulus was passed. We've checked many claims it would stay below 8 percent, but this ad says it would drop to 5.6 percent.\n\nIt's a flashy ad from pro-Republican super PAC American Crossroads, using gleaming Minority Report-style graphics manipulated by a narrator in an empty warehouse. The version we've seen still running this week uses an outdated number, saying unemployment is \"actually\" 8.1 percent. The latest monthly report, which came out Friday, says it is now 7.8 percent.\n\nIn this fact-check, we’re focusing on what Obama said the jobless rate would be if Congress passed a stimulus plan.\n\nSeparately, we are checking the ad’s claim that \"Obama’s spending drove us $5 trillion deeper in debt.\"\n\nHere’s the full narration:", "The screen displays the line, \"We can’t afford 4 more years.\"\n\n What Obama said\n\nWe asked American Crossroads for material to support the ad. Spokesman Jonathan Collegio referred us to a Jan. 9, 2009, report prepared before Obama took office, and a speech by the president-elect.\n\nThe report, designed to help Obama argue for an aggressive response to the burgeoning jobs crisis, featured projections for the effect of a stimulus plan.\n\nThose estimates include a chart, \"Unemployment Rate With and Without Recovery Plan,\" that displays a post-stimulus jobless rate around 5.6 percent in mid 2012, like the chart in the American Crossroads ad.\n\nBut Christina Romer, chairwoman of the president's Council of Economic Advisers, and Jared Bernstein, the vice president's top economic adviser, also wrote that their estimates were \"subject to significant margins of error,\" and \"considerable uncertainty.\"\n\nWe’ve previously ruled that the report was not a promise, but a projection, noting its several caveats.\n\nHow about the president-elect’s speech introducing the report?\n\nHere, too, we find it's a stretch to describe it as a promise. It doesn’t get into specific jobless rates, but does talk about projected job gains if a stimulus plan — which Congress had yet to write — were to pass.\n\nCollegio pointed out that Obama:\n\n• Said the report presented \"what this plan will mean,\" not \"roughly what this plan might mean.\"\n\n• Said \"we’ll create jobs\" not \"could create jobs.\"\n\n\"Obama did promise it,\" Collegio said.\n\nBut Obama’s speech first presents the report’s findings as \"projections,\" and later says that a stimulus plan would \"likely\" save or create 3 million to 4 million jobs. Only then does he simplify his language to say, \"we’ll create\" as he talks about a focus on jobs in energy, health care and infrastructure.\n\nHere’s how he sets it up:", "And as we mentioned, the report carried Romer and Bernstein’s warnings about the uncertainty of their projections, including that \"the uncertainty is surely higher than normal now because the current recession is unusual both in its fundamental causes and its severity.\"\n\nAs we now know, as the pair prepared their estimates, the economy was already far worse than the best numbers at the time captured. The unemployment rate hit 8 percent even before Obama signed a stimulus package into law in February 2009.\n\n Our ruling\n\nAn ad from American Crossroads says, \"This is what President Obama said the jobless rate would be if we passed the stimulus: 5.6 percent.\"\n\nBut we find that's a stretch. In the evidence the group provided, Obama doesn’t mention that statistic. Rather, he introduced \"projections\" that included a chart showing the jobless rate falling to 5.6 percent under a recovery plan. The report highlighted the estimates’ \"significant margins of error\" and high uncertainty due to a recession that was \"unusual both in its fundamental causes and its severity.\" The economy was, in fact, much worse than economists knew. The chart is now infamous, but it was never pitched as a promise. We rate the statement Mostly False.", "American Crossroads, \"American Crossroads: 'Actually Happened,'\" Oct. 2, 2012, via YouTube\n\nEmail interview with Jonathan Collegio, American Crossroads, Oct. 8, 2012\n\nWhite House, \"The Job Impact of the American Recovery and Reinvestment Plan,\" by Christina Romer, chairwoman of the president's Council of Economic Advisers, and Jared Bernstein, the vice president's top economic adviser, Jan. 9, 2009\n\nChange.gov, Office of the President-Elect, \"Turning around unemployment,\" Jan. 10, 2009\n\nBureau of Labor Statistics, Employment Situation Summary, September 2012, Oct. 5, 2012\n\nBureau of Labor Statistics, Employment Situation Summary, August 2012, Sept. 7, 2012\n\nPolitiFact, \"Romney repeats claim that Obama promised unemployment would not exceed 8 percent,\" Sept. 18, 2012\n\nPolitiFact, \"Mitt Romney says president promised peak of 8 percent unemployment,\" Feb. 8, 2012\n\nPolitiFact, \"Rep. Michele Bachmann says White House promised stimulus would keep unemployment below 8 percent,\" Jan. 26, 2011\n\nPolitiFact, \"Will: Obama said stimulus would cap unemployment at 8 percent,\" July 13, 2010\n\nPolitiFact, \"Cantor and other Republicans say Obama promised stimulus would keep unemployment rates below 8 percent,\" July 9, 2009\n\nWashington Post, Michael Grunwald, \"Five myths about Obama's stimulus,\" Aug. 10, 2012\n\nMichael Grabell, \"Money Well Spent? The Truth Behind the Trillion-Dollar Stimulus, the Biggest Economic Recovery Plan in History,\" 2012", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]