["About this rating", "Mocking bizarre and costly gift items that appear around Christmas has become somewhat of an annual tradition in the United States, and in late November 2016, people began to notice that high-end department store Nordstrom was selling what appeared to be nothing more than a rock in a leather pouch for $85:", "Still trying to figure out if this $80 rock being sold at @Nordstrom is a joke. #TBD https://t.co/GTwW9Kk5kv", "— Cayla Durrett (@CaylaDurrett) November 27, 2016", "This raised questions about whether Nordstrom's Made Solid Medium Leather Wrapped Stone ($85) and the related Made Solid Small Leather Wrapped Stone ($65) were legitimate retail items; the gift rock quickly drew attention and questions about its authenticity. However, the availability of the Medium Leather Wrapped Stone on Made Solid's web site suggested that the rock is legitimate.", "Nordstrom's web site described precisely what shoppers would get for their $85:", "A paperweight? A conversation piece? A work of art? It's up to you, but this smooth Los Angeles-area stone—wrapped in rich, vegetable-tanned American leather secured by sturdy contrast backstitching—is sure to draw attention wherever it rests. A traditional hardening process gives the leather a beautiful ombré effect. Like all Made Solid leather pieces, this one is cut, shaped, sewn and finished by hand in artist Peter Maxwell's Los Angeles studio. Using vintage leatherworking tools and traditional saddle-stitching techniques, Maxwell aims to create beautiful designs that embody both simplicity and functionality, and that develop rich character and patina over time.", "As of 8 December 2016, the $85 version was sold out on Nordstrom.com. When the page was live, reviewers weighed in on the stone and its qualities:", "rock make all grak friend jealous best rock in village. rock work for hitting things. rock look nice in pouch to wear for hunt or night out with mrs grak. rock cost much but grak get what grak pay for.", "Have to say that this is truly a beautiful product, but I had to send it back because there aren’t any doggone instructions. I don’t even know how to turn the flippin thing on. I know you millenials know how to do all this new techno stuff, but help some of us old guys out, would ya?", "I was so psyched when I first saw this online, because I immediately knew this was going to be the star Christmas gift for my 6 and 9 year olds. What is not to like? It is organic, beautifully crafted, and encourages open play. I was only worried that they might fight over it, so ended up getting to and they compliment each other wonderfully. Can't wait to see my angels' faces when they open the box on Christmas morning. This will definitely be a big hit in our family!", "Another reviewer quipped that the rock was clearly not \"handmade\" as the description promised, and BuzzFeed asked a Nordstrom representative about the stone's details and authenticity:", "The product was designed by a company called Made Solid and has been for sale since Nov. 18 [2016], Nordstrom spokeswoman Brie Cross told BuzzFeed News. The handmade part of the product was the leather pouch, but “only Mother Earth can take credit for rocks,” she said. The description of the product would be updated to make this clear, Cross added.", "Made Solid co-founder Peter Maxwell repeatedly emphasized the product was not a joke, telling Cosmopolitan in what appeared to be an earnest interview:", "It’s a high-end vegetable tanned leather, meaning it’s all natural and darkens with age. The technique is labor intensive. Each piece is made by hand by stretching the leather, shrinking it, sewing, and finishing. This isn’t a simple pocket of machine-stitched cheap leather that a rock was jammed into.", "While Nordstrom's $85 rock in a leather pouch is a genuine product, as of 8 December 2016, the item is sold out on the retailer's web site. But, luckily, it does appear that anyone interested in buying the rock pouch will be able to obtain one directly from the manufacturer. It is not clear whether there will be sufficient leather-wrapped rocks available to meet demand before the end of the 2016 Christmas season.", "Broder Van Dyke, Michelle.   \"Nordstrom Is Selling A Rock In A Leather Case For $85 And People Are Confused.\"\r\n    BuzzFeed.   5 December 2016.", "Koman, Tess.   \"So Here's the Story Behind That $85 Rock Pouch Nordstrom Is Selling.\"\r\n    Cosmopolitan.   6 December 2016.", "Magary, Drew.   \"The 2016 Hater’s Guide To The Williams-Sonoma Catalog.\"\r\n    Deadspin, Adequate Man.   7 December 2016.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]