["About this rating", "Photographs of a crowd estimated at 27,000 in attendance at a Bernie Sanders rally in California are authentic and unaltered.", "The Sanders rally depicted in the photographs did not occur in May 2016, and large Sanders rallies in August 2015 and May 2016 were amply covered by news outlets.", "In May 2016, a meme appeared on social media charging that coverage of crowds in attendance at rallies for Democratic presidential hopeful Bernie Sanders had been ignored in mainstream news coverage of the 2016 presidential campaign:", "The photograph used in the meme was originally published in August 2015 by The Hill in their coverage of a Sanders rally in Los Angeles.  However, the image went into heavy circulation after Sanders drew large crowds during a campaign swing through Sacramento in early May 2016, an event documented by Twitter users:", "This is what 21,000+ looks like at a Bernie Sanders rally in Sacramento #BernieInSacramento #FeelTheBern #bernie2016 pic.twitter.com/RMK4aKK8NO", "— Dave (@fastlife3o5) May 10, 2016", "Another view of one side of the @BernieSanders Sacramento rally. pic.twitter.com/BR85O8W3ut", "— Danny Freeman (@DannyEFreeman) May 10, 2016", "Neither the August 2015 nor the May 2016 rally was ignored by the news media, mainstream or otherwise. The August 2015 Los Angeles rally involving an estimated 27,000 people was reported by The Hill, and the May 2016 Sacramento event was covered by the Los Angeles Times, the Sacramento Bee, SFGate, the New York Times, and the Huffington Post (among others):", "Video of the 9 May 2016 Sacramento rally was also posted to YouTube, bearing the identifying marker of ABC News:", "Several hundred Sanders supporters gathered in late April 2016 in Los Angeles, but that really wasn't a large event (and Sanders wasn't present).  Earlier in May 2016, a meme involving a purported photograph of a Bernie Sanders rally in California was circulated, but the image used in that meme depicted an unrelated 1 May 2016 workers' rally held in Havana, Cuba.", "Ceaser, Stephen and Joel Rubin.   \"Bernie Sanders Supporters Rally In Downtown Los Angeles.\"\r\nLos Angeles Times.   30 April 2016.", "Easley, Jonathan.   \"Sanders Pulls Crowd Of 27,500 in LA.\"\r\nThe Hill.   11 August 2015.", "Palermo, Joseph A.   \"The Bernie Sanders Campaign: Not A Cult Of Personality.\"\r\nHuffington Post.   11 May 2016.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]