["The photo, which shows people swimming and admiring the waterfall, was published on Facebook here on February 17, 2017. The post has been shared over 164,000 times.", "Below is a screenshot of the misleading post:", "The post’s caption reads: “Malaybalay bukidnon falls, Philippines”.", "Malaybalay is a city in Bukidnon, a landlocked province in the southern Philippine island of Mindanao.", "The same photo was also shared on Facebook alongside similar claims about the waterfall being in the Philippines here in 2016 and here in 2020.", "This claim is false; the waterfall is actually located in western Iran.", "Reverse image and keyword searches found the same photo embedded in this June 25, 2015 Persian-language report by the news outlet Parsine, titled: \"Bisheh Waterfall in Lorestan\".", "Below is a screenshot comparison of the photo in the misleading posts (L) and the photo in the Parsine report (R):", "Bisheh waterfall is a major attraction in Lorestan, a province in western Iran, according to this report by the Tasnim News Agency.", "“Bisheh waterfall's height is about 48 meters with wideness of about 10 meters and joins the Sezar River,” the report reads. “At the top of the waterfall, across the Bisheh railway station, there are several springs which join together and make the waterfall.”", "Views of the Bisheh waterfall that are similar to the photo is the misleading post can also be seen throughout this Youtube video.", "Multiple similar photos of the waterfall have also been geotagged on Google Maps, for example here and here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]