["The photo was published here on Twitter on February 9, 2020.", "The tweet states: “Incredible amounts of storm water pouring off #SydneyHarbourBridge this Sunday afternoon!”", "Below is a screenshot of the misleading post:", "Parts of Sydney recorded more than 200 mm of rainfall in 24 hours between February 9 and 10, 2020, according to Australia’s Bureau of Meteorology (BOM). The storms also caused flooding and power cuts throughout the state of New South Wales, the Sydney Morning Herald reported here on February 10, 2020.", "Below is a screenshot of the BOM’s rainfall map with data collected in the 24 hours from 9 am February 9, 2020:", "The photo was also shared here on Twitter and here on Instagram on February 9, 2020, alongside a similar claim.", "The claim is false; the photo was created in 2015 by Australian design agency Creative Order, using Photoshop.", "A Google reverse image search led to a higher-definition version of the photo in this April 22, 2015, tweet from Creative Order, captioned: “So much rain in #sydney - Harbour bridge waterfall #sydneystorm”.", "So much rain in #sydney - Harbour bridge waterfall #sydneystorm pic.twitter.com/vVrWLpu5Pj", "Creative Order, based in Sydney and Melbourne, also shared a similar gif that shows floodwaters rushing out of the Harbour Bridge in this April 23, 2015, Facebook post.", "The agency addressed the virality of the image in the misleading posts in this press release titled “Riding the Storm of Social Media -- Harbour Bridge Sydney Storm”, dated April 24, 2015.", "It reads, in part: “As your grandparents would say, all you need is your imagination… well that, plus an idea, photoshop and a twitter account.", "“Being stuck indoors, hemmed in by the rain and seeing the plethora of images capturing the #sydneystorm one of our thrifty designers took to what he knows best, not a pen and pad but Photoshop, with a cunning plan to visually communicate the severity of Sydney’s storm battered city, shores and streets.”", "The image has been inaccurately described as showing an actual storm in Sydney on various occasions, such as in April 2015, November 2018 and February 2020.", "Meanwhile, a live camera installed at The Sebel Quay West Suites Sydney serviced apartments near the Harbour Bridge captured scenes of gloomy weather without any flooding on the bridge on February 9, 2020, afternoon, as seen below.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]