["About this rating", "In March 2017, an advertisement disguised as a news story appeared to report that Facebook CEO's Mark Zuckerberg was leaving the company in order to sell skin care products. The hoax report was published on the web site GetInkNews.co:", "Neither Katy Perry nor any of the other aforementioned celebrities have endorsed this product, and the web site took unrelated images of Zuckerberg and various celebrities (the image of Katy Perry was taken in 2011) to make it seem as if they had endorsed Zuckerberg's skin care line together.", "The advertisement also claimed that Zuckerberg and his wife Priscilla Chan were giving away free samples of the product (as long as customers paid for shipping and handling):", "ZUCKERBERG GIVES PRODUCTS AWAY FOR FREE!", "So, what if you aren’t rich or famous? Chan and Zuckerberg don’t care. After all, they are already worth more than $556 billion.", "“We aren’t in this to make a fortune,” Chan told a friend recently. “We already have amassed a fortune. I just want to help people.”", "That is why she is now offering readers the opportunity to experience the joys of younger looking skin for FREE!", "The only cost to you is a $4.95 shipping and handling fee, so you can try the EcoMaxx Ageless Moisturizer and EcoMaxx Ageless Eye Revitalizer have it delivered right to your front door. Simply click on the link here for ordering details.", "This a relatively new form of the ubiquitous fake news: an advertisement designed to mimic a genuine news item in order to convince people to buy a skin care product. At the very bottom of this web page, below the comments section, below several links to purchase this product, and below several fake celebrity endorsements, appears a disclaimer:", "THIS IS AN ADVERTISEMENT AND NOT AN ACTUAL NEWS ARTICLE, BLOG, OR CONSUMER PROTECTION UPDATE", "This website is not intended to provide medical advice or to take the place of medical advice and treatment from your personal physician. Visitors are advised to consult their own doctors or other qualified health professional regarding the treatment of medical conditions. The author shall not be held liable or responsible for any misunderstanding or misuse of the information contained on this site or for any loss, damage, or injury caused, or alleged to be caused, directly or indirectly by any treatment, action, or application of any food or food source discussed in this website. The U.S. Food and Drug Administration have not evaluated the statements on this website. The information is not intended to diagnose, treat, cure, or prevent any disease.", "MARKETING DISCLOSURE: You should know that the owner of this website has a monetary connection to the product & services advertised and provided. The owner receives payment whenever a qualified lead is referred. All of the information regarding the goods and services mentioned on this website is provided by the owner.", "ADVERTISING DISCLOSURE: This website is an advertisement and not a news publication. Any photographs of persons used on this site are models. Any photographs of before/after images used on this site are not real and are only used to illustrate the results some may achieve. Many of the articles featured on this site are what is commonly referred to as an advertorial, a combination of advertisement and editorial written in an editorial format as an independent news story. However, unlike an independent news story, an advertorial may promote a particular product or interest. Advertorials take factual information and report it in an editorial format to allow the author, often a company marketing its products, to enhance or explain certain elements to maintain the readers interest. A familiar example is an airline's in-flight magazines that provide editorial reports about travel destinations to which the airline flies.", "In 2018, the same conceit of Facebook's head announcing that he was stepping down was used as fodder for an April Fool's Day joke:", "Last year in June, when Facebook CEO Mark Zuckerberg gave the company a new mission statement, it was too late for him to try to change how things worked at Facebook’s offices. While it wasn’t made public, Cambridge Analytica had already used data from millions of users for voter profiling and other purposes.", "In the wake of the recent data misuse revelation, Facebook founder and CEO Mark Zuckerberg has resigned from the company. While demands were already being made for his resignation, this has come as a big surprise for many. Zuckerberg publicly informed the world via a post on Facebook.", "Altus, Celeste.   \"But Did He Friend Her?\"\r\n    AdWeek.   21 January 2011.", "Get Ink News.   \"Mark Zuckerberg Disgusted with Social Media; Set to Leave Facebook Later This Year.\"\r\n    Retrieved 13 March 2017.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]