["About this rating", "In May 2018, right-wing blogs pounced on a New York Post story concerning alleged campaign contribution violations by actress and comedian Rosie O'Donnell.", "According to the Post, the former co-host of The View exceeded the $2,700 limit on individual campaign contributions in donations to several Democratic Party candidates via the fundraising web site ActBlue, while using five different New York addresses and four variations of her name.", "The report also said that O'Donnell donated $90,000 to 50 different committees and candidates for federal office. O'Donnell reportedly told the Post via email that she did \"nothing nefarious,\" adding that she did not choose to donate over the limit. The newspaper also quoted her as saying:", "My anxiety is quelled by donating to those opposing trump [and] his agenda — especially at night — when most of these were placed.", "Conservative bloggers seized on that remark to accuse O'Donnell of \"pleading insanity\":", "Trump-hating liberal Rosie O’Donnell has accused President Trump of many bogus crimes. She has been obsessed with trying to accuse President Trump of nonsense. She has became completely obsessed with President Trump. Her Twitter feed is filled with incohrrent [sic] rants. Now the Trump curse continues as she is pleading insanity in hopes of not paying the penalty for breaking campaign finance laws. She is facing criminal charges thanks to a campaign finance scheme.", "In fact, there has been no announcement of an investigation into the alleged donations, let alone \"criminal charges.\" The Federal Election Commission did not comment on the Post's report. While the Post's report has been aggregated by blogs and other news outlets, no second source has emerged corroborating its findings.", "An ActBlue spokesperson, Chris Fleming, did not comment on the story, but did tell us:", "ActBlue does not allow over the limit contributions in any one transaction, and ActBlue offers donors the option of saving all their info in an account where they can track their cumulative giving through ActBlue and compare/add to offline giving.", "While the Post reported that FEC violations only rarely lead to penalties, Loyola Law School professor Jessica Levinson said that it can depend on the jurisdiction. \"For instance, some cities and states are much more aggressive about finding and fining people for these violations than others,\" said Levinson, who focuses on campaign finance in her work:", "On the federal level, it is true that the Federal Election Commission is a model of inaction. I think it would be fair to say that fines are not common, but I'm not really convinced that these types of violations are terrifically common.", "For her part, O'Donnell accused the Post on Twitter of employing \"sinister ways to warp the truth.\" She also posted a photograph depicting her contributions on the ActBlue platform, listed at 66 donations totaling $75,500:", "She told the Post that candidates should refund donation money that exceeds the individual limit, adding, \"I don't look to see who I can donate most to.... I just donate assuming they do not accept what is over the limit.\"", "FEC regulations state that campaign committees that receive individual donations over the $2,700 limit have 60 days to refund the excess amount, redesignate it toward another election, or reattribute the money to someone else. In the event of a redesignation or reattribution, the contributor must be notified of the committee's intent and offered the chance to collect a refund instead.", "The newspaper's report centered on contributions from O'Donnell to two current Democratic congressional candidates — Lauren Underwood in Illinois and Omar Vaid in New York — as well as campaigns for three current lawmakers from the same party: Rep. Adam Schiff from California; Doug Jones of Alabama; and Conor Lamb of Pennsylvania.", "Lamb's campaign will reportedly contact O'Donnell and offer to either refund or redesignate her excess contributions; Vaid's told the Post that it would amend its filings. A spokesperson for Underwood told us:", "Because of the data point differences in name, address, and employer, our systems did not flag these contributions as totaling above the limit. In the coming weeks, we will be amending our report.", "Bloggers also attempted to compare O'Donnell's purported violations to the outright illegal donations that led to the 2014 conviction of right-wing documentarian Dinesh D'Souza. D'Souza was sentenced to five years probation and eight months in a halfway house after pleading guilty to making illegal contributions in the names of others. D'Souza asked two friends and their partners to donate $10,000 apiece in 2012 toward Republican Wendy Long's senatorial candidate.", "\"I do think we could find a distinction between what D'Souza was charged with — making a contribution of about 10 times the legal limit — with what O'Donnell is accused of — making a total of $5,400 in contributions over the legal limit to five different candidates,\" Levinson said. \"O'Donnell's error seems more believably to be one of ignorance, while it is hard to believe that D'Souza believed a $20,000 contribution was legal.\"", "Sanders, Anna. \"Rosie O'Donnell's Campaign Donations to Dems Went Over Legal Limit.\"\r\n    New York Post. 5 May 2018.", "Federal Election Commission. \"Remedying an Excessive contribution.\"", "Federal Bureau of Investigations. \"Dinesh D'Souza Sentenced in Manhattan Federal Court to Five Years of Probation for Campaign Finance Fraud.\"\r\n    23 September 2014.", "Arturo Garcia is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]