["“The look of the White House Italian translator as Trump says President Mozzarella for the Italian President and says U.S. and Italy have been allies since Ancient Rome,” a Twitter user joked in an October 16, 2019 post that features two photos of a focused, frowning Italian translator behind the US president.", "Other instances of the same misleading information can be found on Twitter and Facebook. It has also been circulating in French.", "Trump did not pronounce his counterpart’s name or mention “ancient Rome” during the October 16, 2019, bilateral meeting where the picture of the interpreter was taken, according to the official transcript of the conversation. The interpreter’s facial expressions could not have been a reaction to these words since Trump did not mention them at this meeting.", "He did pronounce Mattarella’s name correctly, albeit with an American accent, at the beginning of a press conference held on the same day.", "In his introductory speech, he also said that “the United States and Italy are bound together by a shared cultural and political heritage dating back thousands of years to Ancient Rome. Over the centuries, the Italian people have blessed our civilization with magnificent works of art, science, philosophy, architecture and music.”", "President @realDonaldTrump just wrapped up a joint press conference with President Mattarella of Italy.\n\n\t\t“The United States and Italy are bound together by a shared cultural and political heritage dating back thousands of years to Ancient Rome.\" ???? pic.twitter.com/10Ib2h4O4e", "This sentence has been taken out of context to imply that the US president claimed that both countries “have been allies since Ancient Rome,” a time when the United States didn’t exist yet as a country.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]