["The misleading posts include this one published on Facebook March 18, 2019, and shared more than 2,600 times since. It contains two images: one of the pilot, Rashid Minhas, in uniform; and one of his mother, Rasheeda Minhas, with her eyes closed.", "The text across the top of the photos says in English: “Proud Mother of Shaheed Rashid Minhas died today. InshaAllah Son and his mother will meet in Jannah (paradise) today.”", "The misleading post’s Urdu-language caption says: “Peace be upon the mother who had such a son.\"", "Below is a screenshot of the false Facebook post:", "Pilot Rashid Minhas, who died aged 20, is the youngest person ever to be given Pakistan’s highest award for military gallantry, which was bestowed on him posthumously. Here is a report by Pakistani newspaper Dawn on Minhas.", "Similar photos and claims have been shared widely on social media, for example here on Facebook, here on Twitter and here on Youtube.", "Rashid’s brother Anjum Minhas told AFP by telephone that the posts were false.", "\"By the grace of Allah my mother is fine and is at her home after being discharged from hospital two days ago,\" he said.", "\"This rumour was spread on social media by some cheap people.\"", "Anjum Minhas earlier told the Daily Pakistan newspaper a visitor to the hospital took the photo of Rasheeda Minhas that appeared online.", "He also spoke to Urdu-language TV channel 24 News HD and said his mother was still alive, as seen in this clip from the network's verified YouTube account, embedded below:", "On 24 News HD, Anjum Minhas said he was an administrator of this Facebook page dedicated to the memory of his brother, which has more than two million followers.", "A photo of Rasheeda Minhas was shared here by that page on March 24 with a caption that said she had \"fully recovered\".", "The Facebook post is embedded below:", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]