["About this rating", "No foreign-born terrorist from the seven countries included in President Trump's immigration restriction has been responsible for a lethal terrorist attack on American soil since 1975.", "The data used in the referenced chart only includes lethal attacks by (or convictions of) foreign-born terrorists on American soil and does not consider non-lethal terrorist attacks or other terrorist activity used to assess a country's threat level.", "In late January 2017, President Donald Trump signed an executive order restricting U.S. entry by foreign nationals from seven \"countries of particular concern\" for 90 days. Although the text of order did not specify which countries it referred to, a fact sheet issued by the Department of Homeland Security issued a fact sheet that identified them as Iraq, Syria, Sudan, Iran, Somalia, Libya and Yemen.", "Shortly after issuance of the executive order, a chart (displayed above) was circulated via social media that was a modified version of a graphic published by the Cato Institute, a libertarian think tank. The think tank argued that persons from the countries included in the order did not pose a serious threat to Americans, as no such foreign nationals had ever carried out a lethal terrorist attack in the United States:", "Refugees and immigrants from Muslim-majority countries are not a serious threat to Americans. The order would ban all people entering the United States from Iraq, Iran, Syria, Somalia, Sudan, Libya, and Yemen, and yet no terrorist from these places has carried out a lethal attack in the United States. Indeed, no Libyans or Syrians have even been convicted for planning such an attack. Moreover, the likelihood of being killed by any refugee from any country is just 1 in 3.64 billion a year. This discrimination is arbitrary and cannot be rationally justified based on a assessment of the risk.", "Cato tallied the number of Americans killed in the United States by foreign-born terrorists (categorized by country) and found that nationals from the seven countries included in President Trump's order had not been responsible for any deaths on American soil between 1975 and 2015:", "I compiled a list of foreign-born people who committed or were convicted of attempting to commit a terrorist attack on U.S. soil from 1975 through 2015. Below is a table with the distribution of their countries of origin (Figure 1). The first seven countries are those to be initially and, hopefully, temporarily denied visas. During the time period analyzed here, 17 foreign-born folks from those nations were convicted of carrying out or attempting to carry out a terrorist attack on U.S. soil and they killed zero people. Zero Libyans or Syrians intended to carry out an attack on U.S. soil during this time.", "The Cato Institute's full chart (which can be seen here) also tallied that nationals from Saudi Arabia, Egypt, the United Arab Emirates, and Lebanon had killed hundreds of United States citizens during the same time period. The bulk of these deaths occurred during the terrorist attacks of 11 September 2001, which involved hijackers from all four of those countries (although that information reflected the birthplaces and/or citizenship of the terrorists and did not necessarily indicate the countries in which they resided when they planned and initiated their attacks):", "The three countries where the deadliest terrorists came to the United States from were Saudi Arabia, the United Arab Emirates, and Egypt. Together they all accounted for 94.1 percent of all American deaths in terrorist attacks on U.S. soil committed by the foreign-born. Saudi Arabia and the United Arab Emirates are not beset by any of the supposedly-terrorism increasing problems that are described in this order. Egyptians account for 5.4 percent of all terrorist victims but their attacks occurred between 1993 and 2002 when Egypt was a more stable country than it is today. The only exception to this might be Lebanon which accounts for 5.2 percent of all terrorist victims but nearly all of those were committed by Ziad Jarrah on 9/11 — a single data point. Meanwhile, foreign-born people from Syria, Libya, Iraq, Sudan, Somalia, Iran, and Yemen have not successfully killed anybody in a U.S. terrorist attack.", "The author also noted the limitations of his chart:", "Attempting or committing a terrorist attack on U.S. soil is not the only terrorist offense.  Materially supporting foreign terrorist organizations, seeking to join a foreign terrorist group overseas, plotting or carrying out terrorist attacks in other countries, and others are also terrorism offenses.  I excluded foreign-born people convicted of those offenses because Trump is concerned with “making America safe again,” not with making other countries safe or with a global war on terrorism.  A terrorist attack in another country doesn’t kill Americans inside of the United States and these threats are not what concern American voters nearly as much as terrorism on U.S. soil.  You can call this an America First weighting of terrorism offenses.", "New America, another think tank, came to a similar conclusion, stating that not one of the deadly terrorist attacks taking place since the events of 11 September 2001 was perpetrated by persons who had emigrated from one of the seven countries covered by the executive order:", "On January 27, 2017 President Donald Trump issued an executive order banning entry from seven majority Muslim countries (Iran, Iraq, Syria, Sudan, Libya, Yemen, and Somalia) citing national security reasons. None of the deadly attackers since 9/11 emigrated or came from a family that emigrated from one of these countries nor were any of the 9/11 attackers from the listed countries. Seven of the lethal attackers were born American citizens.", "Of the twelve lethal terrorists in the United States since 9/11:", "Although nationals from the countries covered by the order may not have not been responsible for any lethal terrorist attacks on American soil, they have been implicated in a number of other acts of terrorism. And according to White House Press Secretary Sean Spicer, these countries were also already identified as \"countries of concern\" by the Obama administration:", "The restrictions were part of wide ranging immigration controls that also suspended refugee arrivals. It appears that existing restrictions in place during the Obama administration informed Mr Trump's list.", "These countries were already named as \"countries of concern\" after a law passed by a Republican-led Congress in 2015 altered a visa admissions program.", "The Visa Waiver Program allows citizens from 38 countries to enter the US for 90 days without a visa. The UK, France and Germany are among those countries allowed in under the waiver program. Visitors apply for an Electronic System for Travel Authorization (Esta).", "In December 2015 Congress passed a law — created by senators from both parties, and supported and signed by the White House — that removed waiver benefits for foreign nationals who had visited certain countries since March 2011. The countries were identified as having a terrorist organisation with a significant presence in the area, or the country was deemed a \"safe haven\" for terrorists.", "Foreign nationals from the countries identified in the 2015 law were not explicitly banned from entering the United States at that time. Instead, those who had visited any of those seven countries after 2011 were required to reapply for visas.", "Under the Visa Waiver Program, citizens of participating countries are allowed to travel to the U.S. without a visa for stays of up to 90 days for either business or tourism.", "Goodman, Jack.   \"US Travel Ban: Why These Seven Countries?\"\r\n    BBC News.   30 January 2017.", "New America.   \"Terrorism in America After 9/11.\"\r\n    30 January 2017.", "CNN.com.   \"September 11th Hijackers Fast Facts.\"\r\n    5 September 2016.", "Bier, David.   \"Five Reasons Congress Should Repeal Trump’s Immigrant & Refugee Ban.\"\r\n    Cato Institute.   28 January 2017.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]