["Barbara Shields-Johnson, director of Nursing Services at Loretto Hospital, gets her 2nd and final dose of the COVID-19 vaccine at Norwegian American Hospital in Chicago, Jan. 5, 2021. (Ashlee Rezin Garcia/Sun-Times)", "Illinois’ entry into the second phase of its COVID-19 vaccination plan means many more residents are eligible, but not everyone agrees the state is prioritizing the right groups as vaccine demand still outpaces supply.", "In an image shared on Facebook and Twitter, the Illinois Republican Party said Democratic Gov. J.B. Pritzker’s \"Hierarchy of Vaccine Priorities\" puts prisoners, politicians, and college students into Phase 1B — the current vaccination phase — ahead of \"individuals with high-risk health factors, and everyone else.\"", "Like other states, Illinois’ vaccination plan is modeled from federal guidelines, but states aren’t required to uniformly implement the non-binding guidance.", "So we decided to take a look at the groups the state GOP claimed are now eligible in Illinois. State lawmakers and inmates are now eligible, but college students are not.", "Along with people 65 years or older and frontline essential workers, inmates are part of Illinois’ second vaccination phase, which began Jan. 25.", "Pritzker is no renegade on this.", "The Federal Bureau of Prisons is providing vaccines to inmates, and at least 13 other states have included the group in their first two vaccination phases, according to a comparison of state prioritization plans from the Kaiser Family Foundation.", "U.S. Centers for Disease Control and Prevention guidance says states may choose to vaccinate individuals living in congregate facilities — including prisons or jails — at the same time as frontline staff because of the increased risk of transmission in such close quarters.", "Pritzker’s administration also added Illinois lawmakers to Phase 1B on Feb. 3 following requests from some members of the General Assembly. The requests came after several people tested positive for the coronavirus during the House’s lame-duck session at the Bank of Springfield Center in January. Both the state House and Senate also canceled session days scheduled for February..", "State lawmakers in Colorado, Hawaii and Maryland are also being vaccinated in the second phase. Members of Congress have been receiving vaccines since the distribution began.", "Still not eligible are individuals with high-risk health conditions from ages 16 to 64 who are not frontline essential workers. Pritzker recently announced the group will be added Feb. 25, which would make Illinois the 18th state to include them in their first two phases, according to a Kaiser Family Foundation comparison. Chicago and suburban Cook County, which receive doses separately from the federal government, have opted out of the expansion because of supply shortages.", "CDC guidelines say people younger than 65 years with high-risk medical conditions do not need to be prioritized until the next phase of eligibility, Phase 1C. That means the state remains in line with federal guidance.", "There is nothing in the Illinois vaccination plan allowing college students as a group to qualify.", "A spokesperson for the Illinois Republican Party said its assertion that college students currently qualified for vaccinations was based on a WCIA-TV report in which a student is seen receiving the vaccine at the I Hotel Conference Center in Champaign.", "The report also identifies her as a medical student, which according to the Champaign-Urbana Public Health District puts her squarely into another group that is eligible — healthcare workers.", "Spokespeople for the Illinois Department of Public Health and the governor’s office confirmed college students who do not work in healthcare or another position covered in the current phases do not qualify.", "The Illinois Republican Party says \"Pritzker’s Hierarchy of Vaccine Priorities\" puts prisoners, politicians and college students into Phase 1B, ahead of \"individuals with high-risk health factors, and everyone else.\"", "It’s true inmates and state lawmakers currently qualify for vaccinations, and those under the age of 65 and others who are not frontline workers do not — including people with underlying health risks.", "But it’s not true college students as a group are eligible. College students may only receive the vaccine right now if they meet other qualifying criteria.", "The GOP’s post also ignores how the Pritzker administration’s prioritization plan for inmates and those with high-risk medical conditions is in line with federal guidance.", "We rate it Half True.", "HALF TRUE – The statement is partially accurate but leaves out important details or takes things out of context.", "Click here for more on the six PolitiFact ratings and how we select facts to check.", "Facebook post, Illinois Republican Party, Feb. 5, 2021", "Tweet, Illinois Republican Party, Feb. 5, 2021", "Phase 1B, Illinois Department of Public Health", "Press release, Federal Bureau of Prisons, Jan. 16, 2021", "State COVID-19 Vaccine Priority Populations, Kaiser Family Foundation, Feb. 8, 2021", "Consideration for phased implementation of COVID-19 vaccination, U.S. Centers for Disease Control and Prevention, accessed Feb. 10, 2021", "\"‘Welcomed step’ or ‘ridiculous’? State lawmakers split on decision to move them up in COVID-19 vaccine line,\" Chicago Sun-Times, Feb. 3, 2021", "\"Colorado state lawmakers, legislative journalists receive early access to COVID-19 vaccine,\" Denver Post, Jan. 30, 2021", "\"State lawmakers, legislative staff get COVID-19 vaccine as essential workers,\" Hawaii News Now, Jan. 28, 2021", "\"Maryland lawmakers offered access to coronavirus vaccine in Annapolis,\" The Baltimore Sun, Jan. 29, 2021", "\"Members of Congress to get COVID-19 vaccine in first round, physician says,\" Reuters, Dec. 17, 2020", "\"All with underlying conditions to be eligible for vaccine soon: ‘We need to waste no time in protecting them,’\" Chicago Sun-Times, Feb. 11, 2021", "The Advisory Committee on Immunization Practices’ Updated Interim Recommendation, U.S. Centers for Disease Control and Prevention, Dec. 22, 2020", "COVID-19 vaccination planning guide, Illinois Department of Public Health, accessed Feb. 10, 2021", "Email: Joe Hackler, Illinois Republican Party spokesperson, Feb. 8, 2021", "\"Pritzker: State legislators moved into Phase 1B of vaccination plan,\" WCIA, Feb. 3, 2021", "Email: Awais Vaid, deputy administrator and epidemiologist at the Champaign-Urbana Public Health District, Feb. 10, 2021", "Emails: Melaney Arnold, spokesperson for the Illinois Department of Public Health, Feb. 9-10, 2021", "Email: Jordan Abudayyeh, spokesperson for Gov. Pritzker, Feb. 9, 2021", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]