["The image was shared here on a Nepal-based website. Below is a screenshot of the misleading article:", "The article’s headline reads: “Amazing! Huoshenshan Hospital’s 1st building completed in 16 hours!”", "The report states: “1st building of Wuhan’s special novel Coronavirus hospital, Huoshenshan Hospital, completed construction on Monday, in 16 hours. It is expected to be transferred to the military for management on February 2. Another Leishenshan Hospital is also under construction. Photo: Sina Weibo.”", "China has been racing to contain a new strain of coronavirus which originated in Wuhan more than one month ago. At least 106 people have died since and more than 4,500 have been infected across China, AFP reported here.", "The image was also shared on Twitter alongside similar claims here by People’s Daily, a Chinese state media organisation, and here by Lijian Zhao, the deputy director general for China’s Information Department and Ministry of Foreign Affairs.", "It also appeared beside similar claims here in a Hong Kong blog; here in a Spanish-language tweet; here in a Thai-language tweet; and here on Facebook.", "The photo has been shared in a misleading context; a reverse image search on Google found the image published here on a website of a China-based import and export company on January 18, 2019.", "It was published as part of a selection of images advertisting temporary structures from Hangzhou, China.", "The page title reads: “Quick Installation Hotel / Office / House Collection Hall”. Below is a screenshot of the image:", "It was also published here on another China-based construction site under the title: “Hotel Use and Container Material Prefabricated Modular Home Design”.", "Below is a screenshot of the image:", "It was also published here on another China-based construction site, under the title: “Modular Steel Structure Container Studio Apartments”.", "The same image also appeared on Chinese online shopping website Taobao here under a listing for temporary mobile warehouses.", "Below is a screenshot of the image on Taobao:", "Meanwhile, People’s Daily published this timelapse video on January 27, 2020 purporting to show the construction of Huoshenshan Hospital in Wuhan.", "The caption states: “Timelapse video showing the 4th day of constructing Huoshenshan Hospital, a new facility providing 700 to 1,000 beds for #coronavirus patients in #Wuhan. The hospital is expected to complete on Feb 2.”", "AFP journalists visited the site on January 27, 2020 and found “the outline of a floor began to take shape and electrical switchboards were already up,” as reported here.", "The report states: “It is one of two makeshift hospitals that Chinese authorities are rushing to build within a fortnight in the city of 11 million people to relieve medical facilities swamped with patients waiting for hours to see doctors.”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]