["About this rating", "As an angry pro-Trump mob breached the U.S. Capitol in Washington, D.C., on Jan. 6, 2021, leaving behind death and destruction, many wondered if this was the first time such an event had occurred there. While the Capitol had seen violence and destruction before during its more than two centuries-old history, it was nothing quite like the events of 2021.", "The riots on Jan. 6, 2021, were the first time an angry armed mob breached the walls of the building and rioted against election proceedings at the incitement of a sitting U.S. president — but not the first time it had been violently breached. The last time such an intrusion had occurred was in 1814 by the British armed forces.", "The Capitol’s construction began in 1793, and intermittently continued even after 1800 when the building was occupied by the Congress, the Supreme Court, the Library of Congress, and the courts of the District of Columbia. Work continued on the South Wing of the Capitol in 1811, but funding was diverted because of a second war with Britain.", "The War of 1812 between the United States and Britain resulted in a broad attack on Washington by British troops. In August 1814, according to the U.S. Senate’s historical highlights, word reached the Capitol that “British forces had swept aside the defending American army at Bladensburg, Maryland, and would occupy Washington by dusk. By late afternoon, British soldiers had marched on the Capitol, torching just about everything in sight.”", "The burning by the British left the Capitol as “a most magnificent ruin,” according to architect Benjamin Henry Latrobe. They torched major rooms in the Capitol. The White House, the navy yard, and several American warships were also burned. The Capitol was not completely destroyed, however.", "Since then, the Capitol has seen bombings, violent attacks, and an attempted assassination of a president. In 1954, four armed Puerto Rican separatists opened fire in the House of Representatives. The years 1915, 1971, and 1983 saw different bombings around the building. All these attacks resulted in no casualties.", "Given the well-documented history of the Capitol, we concluded that the events of Jan. 6, 2021, were the first severe intrusion of a violent group of people since the building was set on fire in 1814.", "Nur Nasreen Ibrahim is a reporter with experience working in television, international news coverage, fact checking, and creative writing.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]