["Correction: When we originally reported this fact-check on Sept. 1, we were unable to determine how the Senate Leadership Fund arrived at its figure of \"over $1 million,\" and the group didn’t respond to our query. The evidence seemed to show a total of under $1 million for salary and other benefits. After publication, a spokesman for the group provided additional evidence showing Moore received compensation as a consultant and through an amended filing, bringing the total to more than $1 million. We have corrected our report, and we have changed the rating from Mostly False to Mostly True.", "An attack ad targeting Roy Moore, a Republican candidate in the Alabama Senate special election, claims that he and his wife Kayla Moore paid themselves $1 million from a nonprofit organization they ran.", "The ad, funded by the Senate Leadership Fund, also creates the impression Moore drew compensation from the organization, The Foundation for Moral Law, while sitting on the Alabama Supreme Court.", "\"Despite being one of the highest paid judges in the nation (...) Roy Moore wanted more,\" the advertisement said. \"So Roy Moore and his wife (paid themselves) over $1 million from a charity they ran.\"", "Moore will face Sen. Luther Strange in a Sept. 26 runoff vote for the Republican nomination to fill the senate seat vacated by Jeff Sessions, now the attorney general. Strange, who’s backed by the Senate Leadership Fund, was tapped to fill Sessions’ seat ahead of the Dec. 12 general election. The Senate Leadership Fund is aligned with Senate Majority Leader Mitch McConnell, R-Ky.", "We decided to investigate the Senate Leadership Fund’s claim that the Moore family drew over $1 million from The Foundation for Moral Law.", "The stated mission of The Foundation for Moral Law, founded in 2002, is to \"educate the public and promote current litigation aimed at moral and religious issues,\" according to its website.", "In practice, the group writes friend-of-the-court briefs that advocate a Christian point of view in legal cases involving abortion, gay marriage, public prayer and other litigation with potential to \"restore the knowledge of God in law.\"", "The group’s ethos aligns with Moore’s controversial judicial career, which includes being forced out as Chief Justice of the Alabama Supreme Court in 2003 for defying a federal court order to remove the Ten Commandments from the courthouse grounds. Moore was elected again to the Alabama Supreme Court in 2013 and was suspended in 2016 after he directed Alabama’s probate judges to defy federal court orders on same-sex marriage. He resigned the following year.", "The IRS granted The Foundation for Moral Law tax-exempt status in 2005, and that same year Moore was listed in IRS filings as the foundation’s chairman. Moore served as either chairman or president from 2005 through 2012, and his wife Kayla Moore took over as president in 2013.", "The attack ad claims it was during this 9-year period — from 2005 through 2013 — that the Moore family drew $1,030,875 in compensation (but as the screengrab shows, this time frame appears inconspicuously and in very fine print, perhaps to create the impression the Moores were paid in a single lump sum, when in fact their compensation was spread over nearly a decade).", "As the breakdown below shows, the Moore family did in fact receive $1,030,875 from The Foundation for Moral Law over this period, according to IRS filings:", "Form 990", "‘05", "‘06", "‘07", "‘08", "‘09", "‘10", "‘11", "‘12", "‘13", "Roy Moore", "9,983", "0", "105,500 (Legal consulting)", "55,392", "72,000 (Amended filing)", "90,000", "60,000 (Salary)", "393,000 (Retirement and other deferred compensation)", "138,000", "42,000", "N/A", "Kayla Moore", "N/A", "N/A", "N/A", "0", "0", "0", "0", "0", "65,000", "The ad also creates the impression Moore drew compensation from The Foundation for Moral Law while serving as Chief Justice of the Alabama Supreme Court, a position he began in 2001.", "Moore was kicked off the bench in 2003 for refusing to comply with a federal court order to remove a monument of the Ten Commandments from the rotunda of the state Supreme Court building.", "He began to draw a salary from the foundation in 2005, two years after his dismissal from the bench, according to the foundation’s IRS filings. So the suggestion he drew the two salaries concurrently is wrong.", "Senate Leadership Fund attack ad said, \"Roy Moore and his wife (paid themselves) over $1 million from a charity they ran.\"", "From 2005 through 2013, the Moore family drew $1,030,875 from The Foundation for Moral Law.", "But the ad gave the wrong impression that Moore took a salary from the nonprofit while serving as Chief Justice of the Alabama Supreme Court.", "We rate this Mostly True.", "Senate Leadership Fund ad, \"Fund,\" YouTube, Aug. 2, 2017", "The Foundation for Moral Law website", "Amicus curiae briefs by The Foundation for Moral Law", "Guidestar, report on The Foundation for Moral Law", "ProPublica’s Nonprofit Explorer, The Foundation for Moral Law", "Economic Research Institute, Foundation for Moral Law", "New York Times, \"Roy Moore, Alabama Chief Justice, Suspended Over Gay Marriage Order,\" Sept. 30, 2016", "New York Times, \"Alabama Panel Ousts Judge Over Ten Commandments,\" Nov. 14, 2003", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]