["“I agree with him on this, 100%. But why would anyone vote Democrat? We are setting all time records with the economy!” Trump wrote early on January 15 in a comment accompanying the retweet, which has been “liked” more than 70,000 times.", "The four-second clip that Trump retweeted was posted by Sarah Dolan Schneider, the executive director of the conservative America Rising PAC, the previous night.", "The clip is cut to show billionaire California activist Steyer saying: “Democrats are gonna destroy the economy in 15 minutes if they get in control.”", "However, Steyer’s full quote, which can be viewed below starting at the 18:19 minute mark, makes clear that is not his position.", "In the Iowa debate, Steyer said: “We know how Donald Trump is gonna run for president. He's gonna run on the economy. He's already told Americans last month in Florida, ‘You don’t like me, and I don’t like you, but you’re all gonna vote for me because the Democrats are gonna destroy the economy in 15 minutes if they get in control.’”", "Trump has touted the state of the US economy as a key part of his bid for a second term in office, and Steyer said the Democrat who takes on the president in November will have to be able to speak to that point.", "“Whoever is gonna beat Mr. Trump is gonna have to beat him on the economy, and I have the experience and the expertise to show that he’s a fake there and a fraud,” Steyer said.", "Steyer responded to Trump's tweet: “Read the transcript. It's actually perfect. I said you're a fraud and a failure -- and I'll expose you” -- a reference to the president frequently urging people to read the transcript of the phone call that sparked his impeachment by the US House of Representatives.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]