["“अल्लाह ने तय कर दिया है की इन ज़ालिमों का ख़ात्मा होगा ..हम शरिया बनेंगे ..कहीं न कहीं से शुरुआत तो होती ही है ..” AAP का अमानतउल्लाह खान दोस्तों ये है AAP के विचार अब ज़रा आप भी सोचिए ..सब अल्लाह ही तय करेंगे या आप भी कुछ तय करेंगे? आप शरिया बनना चाहतें है या नहीं??!”(Allah has decided that oppressors will cease to exist..will make Sharia…it will start from somewhere” -AAP’s Amanatullah Khan. Friends, these are AAP’s thoughts, you also think about it. Will Allah decide everything or you too will decide? Do you want to make Sharia or not??)", "The above message was tweeted by BJP spokesperson Sambit Patra along with a video clip of AAP leader Amanatullah Khan. Patra claimed that Khan was talking about creating a ‘Sharia’. It has amassed over 8,400 retweets so far.", "“अल्लाह ने तय कर दिया है की इन ज़ालिमों का ख़ात्मा होगा ..हम शरिया बनेंगे ..कहीं न कहीं से शुरुआत तो होती ही है ..” AAP का अमानतउल्लाह खान दोस्तों ये है AAP के विचार अब ज़रा आप भी सोचिए ..सब अल्लाह ही तय करेंगे या आप भी कुछ तय करेंगे? आप शरिया बनना चाहतें है या नहीं?? pic.twitter.com/v2nRfESBBF", "— Sambit Patra (@sambitswaraj) February 5, 2020", "Patra’s video was retweeted by BJP Delhi leader Kapil Mishra representing Karawal Nagar.", "On carefully listening to the speech, we found that Amanatullah Khan is saying ‘Zaria’ (medium) and not Sharia. At 45 seconds in the speech, he can be heard saying, “Allah is the one writing it, isn’t it? Allah has decided who will become the king, Allah has decided who will win. Allah has decided who will be shamed. Allah has decided who will have respect. That is under Allah’s jurisdiction, under the jurisdiction of revenge, it crushes everything. What status do we have? Everything is of Allah and Allah has decided the oppressors will fall, this will end. The oppression that did, their persecution will end, Inshallah from Okhla, from Jamia. Inshallah, we will become the medium, it begins from somewhere. Today, Shaheen has awakened the world. Inshallah.”", "In the video, a logo which reads, ‘Breaking News’ can be seen. With a relevant search on YouTube, we found a six-minute long video on a YouTube channel called, “Breaking News Express”. The title of the video, posted on February 2. reads, “AMANULLAH KHAN, JAMIA MLA, WARNS ABOUT CAA, NRC & NPR”. The viral portion of the video begins after 3 minutes.", "Thus, Sambit Patra’s claim that Amanatullah Khan was talking about Sharia law, is false. Moreover, the sentence “We will become Sharia” doesn’t make sense. One cannot ‘become’ Sharia or Shariat which is the religious law in Islam dictating social, religious, political, economic, cultural rules of living.", "The video is viral on Twitter and was subsequently shared by BJP National Secretary Y Sathya with a claim that he is talking about creating Sharia.", "Film director Vivek Agnihotri quote-tweeted Sambit Patra and said, “Natural speech, We will finish the oppressors, we will become Sharia – AAP Amanatullah Khan”.", "Donate Now", "Priyanka Jha specialises in monitoring and researching mis/disinformation at Alt News. She also manages the Alt News Hindi portal.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]