["About this rating", "On 21 April 2018, NRA-ILA (the National Rifle Association Institute for Legislative Action) issued a press release reporting that the YETI brand of coolers had severed their business relationship with the NRA:", "Suddenly, without prior notice, YETI has declined to do business with The NRA Foundation saying they no longer wish to be an NRA vendor, and refused to say why. They will only say they will no longer sell products to The NRA Foundation. That certainly isn't sportsmanlike. In fact, YETI should be ashamed. They have declined to continue helping America's young people enjoy outdoor recreational activities. These activities enable them to appreciate America and enjoy our natural resources with wholesome and healthy outdoor recreational and educational programs.", "The e-mail concluded with contact information for YETI's corporate offices, and a note that \"information is power ... [w]e thought you needed this information.\" The claim quickly spread on social media, typically in posts asserting that YETI had \"cut ties\" with the NRA completely:", "The NRA Foundation is a charitable organization, and Yeti products have long been a staple at Friends of NRA Foundation Banquets.", "Yeti Coolers is now cutting ties with the NRA Foundation without explanation or notice. #BoycottYetiCoolers", "— Alana Mastrangelo (@ARmastrangelo) April 22, 2018", "JUST IN: Yeti Coolers Ends Relationship with NRA - https://t.co/OzsRjxxS5Y pic.twitter.com/FaX3d0FmD9", "— Breaking911 (@Breaking911) April 22, 2018", "Yeti cuts ties with the NRA Foundation https://t.co/NPZKg7jUvB", "— Mark R. Levin (@marklevinshow) April 23, 2018", "Heads up all hunters, sportsman and tailgaters @YETICoolers has made the following decision....", "Yeti Coolers Cuts Ties with NRA Foundation | Breitbart https://t.co/PjVPp2jvvV via @BreitbartNews", "— Texas Darlin' ? (@TexitDarling) April 22, 2018", "YETI brand coolers, favored by hunters and campers and others who engage in outdoor recreational activities, range in price from about $250 to $1,300, so offering price discounts to members of organizations such as the NRA can be a powerful sales driver.  NRA-ILA's statement did not actually say YETI had \"cut ties\" with the organization, but rather that the brand \"no longer wished to be an NRA vendor.\"", "YETI countered the NRA-ILA's characterization of their actions in a statement asserting that they were merely \"eliminating a group of outdated discounting programs\" which they had previously offered to a number of organizations, not just the NRA:", "A few weeks ago, YETI® notified the NRA Foundation, as well as a number of other organizations, that we were eliminating a group of outdated discounting programs. When we notified the NRA Foundation and the other organizations of this change, YETI explained that we were offering them an alternative customization program broadly available to consumers and organizations, including the NRA Foundation. These facts directly contradict the inaccurate statement the NRA-ILA distributed on April 20.", "Further, the NRA-ILA stated in that same public communication that “[YETI has] declined to continue helping America’s young people enjoy outdoor recreational activities.” Nothing is further from the truth. YETI was founded more than 10 years ago with a passion for the outdoors, and over the course of our history we have actively and enthusiastically supported hunters, anglers and the broader outdoor community. We have been devoted to and will continue to directly support causes tied to our passion for the outdoors, including by working with many organizations that promote conservation and management of wildlife resources and habitat restoration. From our website to our film footage and from our social media posts to our ambassadors, YETI has always prominently featured hunters pursuing their passions. Moreover, YETI is unwavering in our belief in and commitment to the Constitution of the United States and its Second Amendment.", "An NRA representative expressed skepticism of that statement, suggesting that YETI had not actually dropped their vendor relationship with other organizations and/or were targeting the NRA nonetheless:", "[Former NRA president and current lobbyist Marion P.] Hammer said that it was “news to us” that Yeti dropped not only the NRA Foundation from the discount program but also other organizations.", "“After three days Yeti issued a statement claiming they didn’t really drop the NRA Foundation,” she said. “They claim they simply eliminated the entire program affecting NRA Foundation and other unnamed organizations. Isn’t that like eliminating a job position so you can get rid of an employee?”", "She added that “Yeti decided the NRA Foundation can’t place any more orders and in fact they forced us to cancel orders they would not fill.”", "We have not received a response to our request for comment from the NRA-ILA.", "NRA-ILA.   \"Florida Alert: YETI Drops NRA Foundation.\"\r\n    21 April 2018.", "Flynn, Meagan.   \"NRA Supporters Are Blowing Up Yeti Coolers. Yeti Says It’s All a Big Mistake.\"\r\n    The Washington Post.   24 April 2018.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]