["About this rating", "During a 27 April 2019 political rally in Wisconsin, U.S. President Donald Trump made a false and incendiary remark, claiming that doctors and pregnant women confer with each other to decide whether to \"execute\" newborn babies. There is no truth to this statement.", "In a speech in Green Bay, Trump stated, \"The baby is born. The mother meets with the doctor. They take care of the baby, they wrap the baby beautifully. And then the doctor and the mother determine whether or not they will execute the baby.\"", "The comment is similar to one Trump made in February 2019 on Twitter when Senate Democrats at that time blocked the \"Born-Alive Abortion Survivors Protection Act,\" a bill that would require doctors to provide the same degree of care to a baby born alive after a failed abortion as they would to any other child of the same gestational age. Citing the similarly-titled \"Born Alive Infants Protection Act,\" which has been on the books since 2002, Democratic lawmakers called the new bill an attempt to discourage abortion providers from performing legal procedures.", "In his Wisconsin speech, Trump was referencing a veto by Democratic Gov. Tony Evers of a state-level law that mirrored the federal \"Born-Alive Abortion Survivors Protection Act,\" which Wisconsin's GOP lawmakers had advanced. (Evers blasted Trump's remarks, stating, \"To say that doctors in the state of Wisconsin are executing babies is just a blasphemy.\")", "\"It is not at all true,\" said Dr. Daniel Grossman, professor of obstetrics, gynecology and reproductive sciences at the University of California at San Francisco, in regards to the president's comments about \"executing\" babies. Doing so would be illegal, as illustrated by the infamous case of Kermit Gosnell, who was convicted of murder in 2013 for delivering babies of unwanted pregnancies and ending their lives by severing their spinal cords at his Philadelphia abortion clinic.", "Stories about babies surviving abortions and either being killed or callously left alone to die is a common pro-life trope, as are over-representations about the frequency and legality of late-term abortions.", "Grossman says a fetus likely could not survive an abortion, and if it did, the law requires that it be cared for in the same manner as any other baby of its same gestational age. (Although there's no bright line, fetuses are generally considered viable outside the uterus sometime between the 24th and 26th week of gestation, depending on its health, Grossman said.)", "According to the Centers for Disease Control and Prevention (CDC), only 1.3 percent of all abortions occurred at 21 weeks or more of gestation in 2015 (the latest figures available). Cases after 24 weeks are a small minority of that 1.3 percent, Grossman said.", "The majority of second-trimester abortions are done surgically, while the majority of terminations after 24 weeks are done with medication. Injections are used first to induce fetal demise, and then medications are given to induce delivery, Grossman told us.", "In rare cases a pregnancy must be ended to save the life of the pregnant woman. And those cases sometimes involve a delivery in which the fetus can't survive outside the uterus or would suffer severe disabilities if it did, Grossman added. Conditions can include preeclampsia, a deadly condition that can occur as early as 20 weeks into pregnancy characterized by high blood pressure and organ damage in the woman. It can only be treated by delivering the fetus.", "Those cases result in painful decisions that the parents and their medical care team must make — either take what's known as \"heroic measures\" to intervene aggressively in an effort to save the baby's life, or to instead provide comfort care as the baby's life ends naturally. \"That's a very difficult and personal decision that family has to make with their care team,\" Grossman said.", "It's also important to note that \"heroic measures\" in these cases can be painful, not just futile, as they involve starting intravenous (IV) lines in tiny, fragile blood vessels to push drugs; multiple blood draws' and sticking a breathing tube down the baby's windpipe to force air into the lungs. \"These are really severe cases involving severe malformation [and/or] extreme prematurity, where really the chance [of survival] is close to zero if not zero, and it just doesn't make sense to put both the baby and the family through that,\" Grossman added.", "Grossman told us that Trump's most recent remarks are worrisome because while the physical safety of abortion providers has always been an immediate concern, the statement widens the target to include regular providers. \"What he said most recently, that wasn't really just talking about abortion providers. He was kind of implying that regular OB-GYNs might do what he described.\"", "In a statement released by the American College of Obstetricians and Gynecologists, Dr. Lisa Hollier, the organization's president, called Trump's comments inflammatory and offensive, saying, \"The rhetoric used to describe the delivery of abortion care was offensive, wrong, and dangerous. Claims of this sort undermine the public’s trust in OB-GYNs and stigmatize necessary health care for women. Politicians must never use inflammatory language that can contribute to or encourage hostility or violence toward doctors, other medical professionals or individuals seeking or receiving health care.\"", "Spicuzza, Mary, and Dirr, Alison. \"Gov. Tony Evers Calls Donald Trump's Accusation That Doctors Execute Babies 'Blasphemy.'\"\r\n  Milwaukee Journal Sentinel. 30 April 2019.", "Cameron, Chris. \"Trump Repeats a False Claim That Doctors ‘Execute’ Newborns.\"\r\n  The New York Times. 28 April 2019.", "American College of Obstetricians and Gynecologists. \"ACOG Denounces False Claims About Ob-Gyns.\"\r\n  30 April 2019.", "Updated to clarify medical versus surgical abortions used at various stages of gestation.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]