["About this rating", "In August 2020, presumptive Democratic presidential nominee Joe Biden named U.S. Sen. Kamala Harris as his running mate. Harris made history as the first woman of color on a major-party presidential ticket, and would break further ground if elected on Nov. 3, 2020, becoming the first woman to assume the office of U.S. vice president.", "In response, critics of President Donald Trump again turned their attentions to his history of making demeaning and disrespectful statements toward and about women. In particular, internet users widely shared the following quotation, attributed to Trump: \"You have to treat 'em like shit.\"", "On August 12, the author Stephen King tweeted: \"Trump on women, in 1992: 'You have to treat 'em like shit.'\"", "On Facebook, others shared a meme that featured a photograph of Trump, along with the following text: \"'Women, you have to treat 'em like shit.\" — Donald Trump to New York magazine, 1992\":", "The quotation did not first emerge in 2020. It is among several pronouncements and utterances made by Trump that have been cited by his critics as examples of his attitude toward women. In 2017, an artist with the moniker Saint Hoax used the quotation as part of a series entitled \"Making America Misogynistic Again,\" which took misogynistic magazine advertisements from past decades and added Trump quotations to them.", "In 2016, Our Principles, an anti-Trump political action committee founded by Katie Packer, deputy campaign manager for Republican presidential candidate Mitt Romney's unsuccessful 2012 campaign, used the line in a television advertisement that featured women reciting various quotations attributed to Trump:", "In 2017, the artist Aria Watson used the line as part of her series \"Signed by Trump,\" which involved painting various demeaning and offensive quotations, attributed to the president, onto a model.", "The quotation is authentic and originally appeared in a Nov. 9, 1992, feature article about Trump, written by Julie Baumgold and published in New York magazine. The article can be read in full here (beginning on page 36).", "The line actually appears twice in the the piece, first as the author's synopsis of Trump's attitude toward women and later as a direct quotation:", "...He says outrageous things: \"[The social people] all kiss your ass if you're hot, and they're kissing hard now. If not, they think you're a piece of garbage.\" He likes to say things like this even when the mikes may be on. He boasts about having poured a whole bottle of wine down Marie Brenner's back after she wrote a story on him that he hated.", "His contempt for beautiful women who like to be abused is boundless, and he is full of stories of supermodels, women he might call twelves (not their size), clinging to a rock star's legs and the rock star kicking them away. You have to treat them like s---.", "Later in the article, Baumgold describes a car journey to Trump's Taj Mahal casino in Atlantic City, New Jersey, in the company of Trump and the renowned architect Philip Johnson, whom Trump had asked to redesign part of the casino (emphasis added):", "Philip Johnson looks at his watch. He is going to Berlin this evening to design a building at Checkpoint Charlie. Trump is talking about women and says, \"You have to treat 'em like s---.\" \"You'd make a good mafioso,\" says Johnson. \"One of the greatest,\" says Donald as the car glides through the protected pinelands into the corrupted city.", "Baumgold's article then recounts Trump's discussion of the recent conviction of boxer Mike Tyson, who was found guilty of raping 18-year-old Desiree Washington and given a 10-year prison sentence, with four years suspended, in March 1992:", "Donald is discussing his buddy Mike Tyson. Tyson told Trump the woman who put him in jail \"wanted it real bad.\" Trump feels Tyson is doing time on a bad rap: \"She knocked on his door at 1am and was up and dancing at eight the next morning.\" This speech is another of the set pieces he is so fond of delivering. When he defended Tyson and suggested a payoff and community service for the champ, his mother got so angry she raised her voice to him for the first time in his 46 years.", "We could not find any record of Trump having denied that he said of women, \"you have to treat them like shit.\" Snopes asked both the White House and Trump's reelection campaign if he now denied having made those remarks, but we did not receive a response from either in time for publication.", "Interestingly, a letter to the editor appeared in New York magazine a few weeks after Baumgold's article, purportedly written by Trump's secretary and offering a firm defense of him. In the Dec. 7, 1992, issue (on page 11), a \"Carolin Gallego\" wrote:", "Based on the fact that I work for Donald Trump as his secretary — and therefore know him well — I think he treats women with great respect, contrary to what Julie Baumgold implied in her article \"Fighting Back\" [November 9.] No man that I have seen has given women a greater opportunity in business. The real-estate, construction, and gaming industries are awash with successful women who got their big break from Donald Trump. Likewise, women adore him. I do not believe any man in America gets more calls from women wanting to see him, meet him, or go out with him. The most beautiful women, the most successful women — all women love Donald Trump. \n\nCarolin Gallego\nManhattan", "In 2017, when New York reprinted the Gallego letter in the magazine's 50th anniversary issue, several internet users speculated that it may have been bogus or written by Trump himself. Several journalists have over the years attested that Trump had a habit of boosting his own reputation in conversations with reporters, while posing as publicists named \"John Miller\" or \"John Baron.\" In a sworn deposition in 1990, Trump himself admitted to having used the name \"John Baron\" in the past.", "In one recorded conversation from 1991, \"John Miller\" told a reporter for People magazine that Trump \"gets called by everybody, he gets called by everybody in the book, in terms of women\" — a remarkably similar formula of words to the one used by \"Carolin Gallego\" in the December 1992 letter to New York magazine.", "The use of repetition, superlatives, and hyperbole seen in the Gallego letter (\"The most beautiful women, the most successful women — all women love Donald Trump\") are also characteristic of Trump's own patterns of speech and writing. Washingtonian magazine reported in 2017 that they had been unable to locate or identify any woman named Carolin Gallego who worked as Trump's secretary, noting that the future president's long-time secretary was Norma Foerderer, who was replaced in that role by Rhona Graff in 2005. Trump's former personal attorney Michael Cohen told the magazine he did not recognize the name Carolin Gallego.", "We asked the White House and Trump's reelection campaign if he denied having written the Gallego letter or having asked someone else to write it on his behalf, but we did not receive a response from either in time for publication.", "Isenstadt, Alex.  \"Top Former Romney Aide Launches Anti-Trump Super PAC.\"\r\n    Politico.  21 January 2016.", "Baumgold, Julie.  \"Fighting Back: Trump Scrambles Off the Canvas.\"\r\n    New York.  9 November 1992.", "Shipp, E.R.  \"Tyson Gets 6-Year Prison Term for Rape Conviction in Indiana.\"\r\n    The New York Times.  27 March 1992.", "Gallego, Carolin.  \"Letters to the Editor -- Rich Man, Boor Man?\"\r\n    New York.  7 December 1992.", "Gingras, Abbey.  \"Carolin Gallego Wrote a 1992 Letter Saying Women Love Donald Trump. We're Having Trouble Finding Her.\"\r\n    Washingtonian.  26 October 2017.", "Fisher, Marc; Hobson, Will.  \"Donald Trump Masqueraded as Publicist to Brag About Himself.\"\r\n    The Washington Post.  13 May 2016.", "Borchers, Callum.  \"Trump Claims He Didn't Regularly Use a Fake Name. That's Not What He Said Under Oath.\"\r\n    The Washington Post.  13 May 2016.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]