["One of the posts, archived here, has been shared hundreds of times on Facebook and claims that “the US health dept chief J Anthony said that salons have been responsible for almost 50% deaths”, adding that “Barber's salon poses the biggest risk factor for Corona! This threat is going to remain for a long duration (sic)”.", "The same post has been shared here, here, and here.", "The US health department chief quoted in the post is said to be “J Anthony”, but multiple searches show that there is nobody with that name and title. The US Secretary for Health and Human Services is Alex Azar and the closest health professional with a similar name is Dr Anthony S. Fauci, the director of the US National Institute of Allergy and Infectious Diseases (NIAID).", "Fauci has been leading the battle against COVID-19 in the US and has stressed the need for social distancing at all times. But AFP found no record of Fauci having made comments linking hair salons and barbers to coronavirus mortality.", "The issue is one of social distancing, as highlighted by New York governor Andrew Cuomo, who shut down salons in his state, saying “these services cannot be provided while maintaining social distance”.", "The potential to be infected increases with gatherings and for this reason the World Health Organization (WHO) advises against making physical contact with a person or group of people who may have been infected. It advises people to keep a metre apart.", "“When someone coughs, sneezes, or speaks they spray small liquid droplets from their nose or mouth which may contain virus. If you are too close, you can breathe in the droplets, including the COVID-19 virus if the person has the disease,” the WHO's site states.", "Based on this advice, many countries under lockdown like France and South Africa have shut services such as hair salons and barber shops to curb the spread of COVID-19.", "But, simply put, there is no evidence to show that these businesses globally are responsible for almost half the world’s fatalities from COVID-19 -- which totaled 226,955 as of April 30, 2020, according to an AFP tally.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]