["The 30-second video was published here in a Facebook post on January 23, 2018, where it has been viewed more than 35,000 times.", "Below is a screenshot of the misleading Facebook post:", "The video’s caption states: “A priceless clip of 1970 of Bruce Lee playing Table Tennis with his Nan-chak !! His focus on speed.” (sic)", "Bruce Lee was an actor and martial artist who died in 1973.", "“Nan-Chak” refers to nunchucks or nunchaku, a Japanese martial arts weapon.", "The video has also been shared elsewhere on Facebook, for example here, here and here alongside a similar claim.", "The video has also been shared with the identical claims here and here on Twitter, here and here on Youtube and here and here on Instagram.", "The claim is false; the video shows an advert for a mobile phone with an actor posing as Bruce Lee.", "A reverse image search on Yandex using keyframes from the video obtained with video verification tool InVID and a subsequent keyword search found this longer video published on YouTube on November 18, 2008.", "The video is embedded below:", "The title of the video reads: “NOKIA N96 - BRUCE LEE Edition Promotion Video.”", "Nokia is a Finnish communications corporation and the Nokia N96 was a mobile phone handset released by the company in 2008.", "At the one minute six seconds mark of the YouTube video, traditional Chinese language text in the clip translates to English as: “The video is dedicated to Bruce Lee. The Nokia N96 Bruce Lee Limited edition has arrived.”", "Below are three comparison screenshots of the video shared in misleading Facebook posts (L) and the YouTube video (R):", "The advertisement for Nokia N96 was created by a marketing communication company J.Walter Thompson in 2008, thirty-five years later after the death of Bruce Lee.", "In this interview with Australia based online magazine Agency Asia published on May 12, 2009, representatives for JWT’s Shanghai and Beijing team said the advert was produced as a tribute to Lee.", "The advert promoted Nokia’s N96 Bruce Lee Limited edition mobile phone, according to this report published by the technology website www.gsmarena.com.", "The advert was also published here on the official Bruce Lee Facebook page on April 25, 2009.", "The title states: “Nokia N96 Bruce Lee vs. Ping Pong”.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]