["In Kenya, the claim was published on Facebook pages (here and here) registered in the name of the country’s Sports Minister, Amina Mohammed.", "“World Bank frustrated at low uptake of Covid fund,” read the posts, which have since been removed from Facebook. “The World Bank has complained of the low number of Kenyans applying for the Covid fund which was approved all the way in May. The fund was meant to cushion small businesses against shocks caused by the pandemic but most Kenyans have shied away from applying. Kenyans willing to apply for the fund can do so only through IFC website.”", "IFC is the International Finance Corporation, a member of the World Bank Group.", "Mohammed was also cited by Kenya’s People Daily, an online news site, in connection with the purported financing arrangement, while in Namibia, a similar claim was published here by an account created under the guise of the country’s finance ministry, which Facebook’s transparency information shows as being administered from Kenya.", "Links included in the posts supposedly lead potential applicants to the IFC website and a page with a form where they are invited to fill in their details.", "While the page appears to be official, on closer inspection the entire website is nothing more than a sophisticated clone of the real thing.", "Searching the URL provided in one of the posts on GoDaddy, an American internet domain registrar, reveals several suspicious details: the site domain was created on October 16, 2020 – just three days before the first of the false posts was published. Additionally, the domain is also registered in Kenya, while the World Bank has its headquarters in the US.", "A GoDaddy search of the link supplied in the post targeting Namibians reveals that this URL was registered on November 24, 2020, about a month before the false claim was shared on Facebook. The country of registration is indicated as Canada.", "The IFC’s authentic website – www.ifc.org – was created in December 1995 and registered to the World Bank in the US.", "Melissa Bryant, a spokeswoman for the World Bank, dismissed the Facebook posts as “fake”, noting that the fraudulent URLs were part of a larger cybercrime attack on the financial institution.", "“The stories and their content are inaccurate,” she said in an email to AFP Fact Check. “The World Bank mention originated on fake social media postings and websites that were part of a broader cybercrime attack against the World Bank Group.”", "Bryant explained that unknown attackers had impersonated the World Bank Group and Kenyan government officials to scam entrepreneurs and small businesses into paying advance fees, also called “processing fees” or “finder’s fees” for non-existent loans.", "This statement warning the public about the fraud was published on the real IFC website.", "Sports minister Mohammed’s chief of staff, Rose Wacuka, also told AFP Fact Check that the Facebook accounts linked to the minister were “fake”. Her authentic account can be found here.", "Mohammed’s page differs from the imposter accounts in notable ways: firstly, her page contains the prefix “Amb” for “ambassador” in the name (Mohammed was formerly a diplomat), which the others don’t.", "And, secondly, the fake accounts were created on October 19, 2020, and November 28, 2020, coinciding with the days that each one posted the same false claim. Mohammed had her page set up on June 4, 2014.", "AFP has previously debunked similar loan scams here and here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]