["About this rating", "On Oct. 23, 2019, the U.K. tabloid Express published an article that left some readers believing they need not make Christmas plans this year because Earth was in danger of being hit by a large asteroid:", "The article was entitled \"Asteroid terror: NASA spot mammoth space rock to hit Earth's orbit five days before X-mas.\" The subheading gave earthlings an even smaller chance of survival: \"AN ASTEROID the size of the World Trade Centre is on a dangerous Earth-bound orbit that could see the rock smash the planet during Christmas festivities.\"", "When the article was regurgitated by even less-reputable websites, the fear-mongering title morphed into a factually inaccurate claim. For instance, the website Digital Wise rehashed this article under the title \"NASA Issues Warning Over Asteroid Predicted To Hit Earth Five Days Before Christmas!\"", "NASA has made no such announcement, and Earth is not in danger of being hit by an asteroid around Christmas.", "These articles are all based on a real asteroid (known as 216258 2006 WH1) and its holiday approach toward Earth. However, these articles present the information as if this asteroid is particularly dangerous. But there's nothing unusually threatening about asteroid 216258 2006 WH1.", "NASA's Center for Near Earth Object Studies (CNEOS) currently lists 26 near-Earth objects that are scheduled to pass by our planet within the next 60 days. While asteroid 216258 2006 WH1 (which was discovered in 2006) will truly be passing by earth around Christmas, CNEOS reports that the asteroid is expected to safely pass by earth at a distance of about 15.19 LD (lunar distance), approximately 3.6 million miles.", "Dr. Paul W. Chodas, the Director of the Center for Near Earth Object Studies, told us in an email that there is \"nothing unusual or dangerous\" about asteroid 216258 2006 WH1:", "No, there is nothing unusual or dangerous about this asteroid. It is simply making a close approach to the Earth. Astronomers have been observing this asteroid’s position for 13 years, we know its orbit very accurately, we can predict its close approaches accurately for the next 200 years, and we know with certainty that it cannot hit our planet.", "Lindley Johnson, NASA’s Planetary Defense Officer and Program Executive of the Planetary Defense Coordination Office (PDCO), also told us that this asteroid \"poses no hazard to impacting earth\":", "NASA and other US agencies are lead players in the international effort to develop plans to respond to a possible Near-Earth Object (NEO) impact. In 2018, the White House released the National Near-Earth Object Preparedness Strategy and Action Plan, which identifies key steps that US agencies need to take to better prepare the United States—and the world—for detecting and responding to a possible impact. NASA has been directed by Congress to catalogue and characterize all NEOs bigger than 140 meters, the ones that could be catastrophic. NASA is approximately 35% complete for NEOs 140 meters and larger, and approximately 96% complete for those 1 km and larger. Strategic investments in our space-based programs will lead to the benefit of all of humanity as we continue to catalogue any NEOs that pose a potential threat. This particular asteroid’s trajectory has been well tracked by NASA’s Center for Near-Earth Object Studies since it’s discovery 13 years and poses no hazard to impacting Earth.", "Here's a little more information about near-earth objects from CNEOS. The organization writes on its website (emphasis ours):", "On a daily basis, about one hundred tons of interplanetary material drifts down to the Earth’s surface. Most of the smallest interplanetary particles that reach the Earth’s surface are the tiny dust particles that are released by comets as their ices vaporize in the solar neighborhood. The vast majority of the larger interplanetary material that reaches the Earth’s surface originates as the collision fragments of asteroids that have run into one another some eons ago.", "With an average interval of about 10,000 years, rocky or iron asteroids larger than about 100 meters would be expected to reach the Earth’s surface and cause local disasters or produce the tidal waves that can inundate low lying coastal areas. On an average of every several hundred thousand years or so, asteroids larger than a kilometer could cause global disasters. In this case, the impact debris would spread throughout the Earth’s atmosphere so that plant life would suffer from acid rain, partial blocking of sunlight, and from the firestorms resulting from heated impact debris raining back down upon the Earth’s surface. Since their orbital paths often cross that of the Earth, collisions with near-Earth objects have occurred in the past and we should remain alert to the possibility of future close Earth approaches. It seems prudent to mount efforts to discover and study these objects, to characterize their sizes, compositions and structures and to keep an eye upon their future trajectories ...", "... No one should be overly concerned about an Earth impact of an asteroid or comet. The threat to any one person from auto accidents, disease, other natural disasters and a variety of other problems is much higher than the threat from NEOs. Over long periods of time, however, the chances of the Earth being impacted are not negligible so that some form of NEO insurance is warranted. At the moment, our best insurance rests with the NEO scientists and their efforts to first find these objects and then track their motions into the future. We need to first find them, then keep an eye on them.", "NASA Near-Earth Object Observations Program is constantly monitoring the skies for approaching asteroids and meteors. So far, the program has discovered more than 19,000 NEOs. When NASA discovers an NEO, it works to determine as much information as possible about the object, such as its size, speed, and orbit, so that the agency can calculate when it will approach Earth and how close it will come when it does.", "But the 19,000 NEOs in NASA's database aren't really what we have to worry about. The organization writes that thousands of NEOs have yet to be discovered:", "Asteroid impacts are a continuously occurring natural process. Every day, 80 to 100 tons of material falls upon Earth from space in the form of dust and small meteorites (fragments of asteroids that disintegrate in Earth’s atmosphere). Over the past 20 years, U.S. government sensors have detected nearly 600 very small asteroids a few meters in size that have entered Earth’s atmosphere and created spectacular bolides (fireballs). Experts estimate that an impact of an object the size of the one that exploded over Chelyabinsk, Russia, in 2013 – approximately 55 feet (17 meters) in size – takes place once or twice a century. Impacts of larger objects are expected to be far less frequent (on the scale of centuries to millennia). However, given the current incompleteness of the NEO catalogue, an unpredicted impact – such as the Chelyabinsk event – could occur at any time.", "Still, the chances of an asteroid larger than 140 meters hitting earth in the next 100 years is minimal:", "The current congressionally directed objective of the NEO Observations Program is to find, track, and characterize at least 90 percent of the predicted number of NEOs that are 140 meters and larger in size–larger than a small football stadium–and to characterize a subset representative of the entire population. Objects of this size and larger pose a risk to Earth of greatest concern due to the level of devastation an impact would cause, and should continue to be the focus of global search efforts. While no known asteroid larger than 140 meters in size has a significant chance to hit Earth for the next 100 years, less than half of the estimated 25,000 NEOs that are 140 meters and larger in size have been found to date.", "Asteroid 216258 2006 WH1 will pass by Earth a few days before Christmas. However, NASA has issued no warnings about a catastrophic impact, and CNEOS reports that this asteroid will get no closer than 3 million miles from Earth during its approach.", "NASA.   \"Near-Earth Object Observations Program.\"\r\n    Retrieved 8 November 2019.", "NASA.   \"Planetary Defense Frequently Asked Questions.\"\r\n    Retrieved 8 November 2019.", "Day, Joel.   \"Asteroid Terror: NASA Spot Mammoth Space Rock to Hit Earth's Orbit Five Days Before X-Mas.\"\r\n    Express.   23 October 2019.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]