["About this rating", "On Jan. 26, 2020, Los Angeles Lakers basketball star Kobe Bryant was killed in a helicopter crash in Calabasas, California, that also claimed the lives of eight other people, including Bryant's 13-year-old daughter Gianna.", "The following day, a video was posted to social media sites such as YouTube with the caption, \"Kobe Bryant Daughter Gianna Bryant Final Hours Before Death.\" The video appeared to show a person lying in a bed which was being wheeled down a hospital corridor, attended by various medical personnel:", "https://youtu.be/y6GcLf3QVEs\n\nHowever, all of the victims of the Calabasas helicopter crash were pronounced dead at the scene, and none of them was transported to a hospital for treatment.", "The alleged clip of \"Gianna Bryant's final hours\" was actually a repurposed video that had been uploaded to YouTube on Sept. 4, 2019, several months before the crash that killed Kobe and Gianna Bryant:", "The description of that original video stated it depicted an \"honor walk\" for a 28-year-old woman named Ariana, who was declared brain dead after being struck by a car in Downey, California, on Aug. 28, 2019, and whose organs were subsequently donated to six different recipients:", "Ariana had a spark like no other. She was a happy and caring 28 year old who many confused as teenager due to her spunk, laughter and her childlike antics. She was always doing what she could to make you laugh, but one evening on 8/29/2019, our lives would change forever. She was on her way to the arcade to meet up with friends with her boyfriend, and as they were crossing an intersection in the city of Downey, California, a distracted driver, ran a red light and struck Ariana and her boyfriend, Jason. Upon arrival to the hospital, Jason died 2 hours later from severe head trauma and on 8/30/2019, Ariana was also declared brain dead due to severe head trauma as well. Being that she was a kind and giving soul, donating her organs was something she would have wanted and because of that, she is helping 6 recipients to have a better life. Our Ariana is now in Paradise but her compassion and love will forever remain in our hearts and in those recipients’ lives.", "This description corresponds with various reports of a pedestrian accident that claimed the life of a person of the same name and age on that date.", "An \"honor walk\" is the name given to a ritual undertaken \"to show respect to patients at the end of life who are donating organs to others.\"", "Hospitals across the United States are holding honor walks as dignified ways to honor each patient’s final contribution.", "https://youtu.be/F8j5oWqLHs0\n\nThe honor walk takes place at an odd pause between life and death: Either brain death has been declared already in a donor whose heart still beats, or the donor’s heart will soon stop beating.", "An honor walk is a powerful act of community. Something solemn, even sacred, happens in those 15 minutes in the hallway. We wait and talk with people from all professions and all walks of life. Together, we honor a great sacrifice. We give thanks. We hope to help a grieving family in a moment of fathomless loss.", "Los Angeles Times.   \"Mothers, Fathers, Daughters, Coaches: Here Are the 9 Killed in the Kobe Bryant Helicopter Crash.\"\r\n    28 January 2020.", "Staudinger, Stephanie.   \"Kobe Bryant, 13-Year-Old Daughter Among 9 Killed in California Helicopter Crash.\"\r\n    WDJT-TV.   26 January 2020.", "Lahey, M.D., Tim.   \"Rituals of Honor in Hospital Hallways.\"\r\n    Los Angeles Times.   2 April 2019.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]