["About this rating", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "In the video game series \"Resident Evil,\" a virus created by the pharmaceutical company \"The Umbrella Corporation\" turns many of the residents of Raccoon City into zombie-like creatures. While the events in this game were obviously fiction, some social media users pointed to a few strange coincidences in January 2020 as China and other countries responded to the real-world spread of a new coronavirus.", "Social media posts claimed that the logo of a biotech lab in Wuhan, the Chinese city at the center of the January 2020 outbreak, was eerily similar to the logo of the Umbrella Corporation. Furthermore, these posts noted how \"corona\" was an anagram for \"racoon,\" the city at the center of \"Resident Evil.\"", "This eerie coincidence wasn't too eerie on second glance.", "For starters, the picture on the left did not show the logo for a biotech company in Wuhan. As one can infer from its name (which can be fully seen on an uncropped version of this image), Shang Hai Ruilan Bao Hu San Biotech Limited is located in Shanghai, not Wuhan. These two Chinese cities are approximately 500 miles away from one another.", "The company's website (ruiblue.com) shows that the blue-and-white, umbrella-like logo is real, and that the company is located in Shanghai, China.", "The claim that \"Corona\" is an anagram for \"Raccoon\" is also a curious one. As you'll notice by re-reading the previous sentence, \"Corona\" has a single \"C\" while \"Raccoon\" has two \"c's.\" While Merriam-Webster noted that \"Racoon\" is a valid, albeit less common, spelling for this dumpster-diving mammal, the city in the \"Resident Evil\" games is spelled \"Raccoon City.\"", "In short, the logo for the Umbrella Corporation is similar to the logo of a biotech company in China. However, this company, which no longer appears to be in operation, was not located in Wuhan, the Chinese city at the center of the coronavirus outbreak in 2020, but in Shanghai, a city about 500 miles to the east.", "Ashcraft, Brian.   \"Chinese Resident Evil Fans Think This Biotech Company's Logo Looks Familiar [Update].\"\r\n    Kotaku.   18 June 2019.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]