["About this rating", "A video by Donald Trump Jr., the president's son, showed Trump and members of his inner circle dancing, smiling, and watching television screens inside a private tent at Ellipse Park near the White House on Jan. 6, 2021. The footage was recorded roughly one hour before some supporters started breaking security barriers at the Capitol.", "The screens inside the tent did not show supporters breaching or vandalizing the Capitol. Rather, they depicted a crowd gathering in front of a stage where Trump would later speak for 70 minutes. The president reportedly watched the peak of the insurrection on television from inside the White House.", "In the aftermath of an attack by American right-wing extremists on the U.S. Capitol — which resulted in the deaths of five people, including a police officer, numerous injuries and arrests, and damage to the federal building — a video from one of U.S. President Donald Trump's sons, Donald Trump Jr., surfaced online as alleged evidence that the president watched the siege from a private tent party.", "The footage, which appeared on YouTube and Twitter shortly after the Jan. 6, 2021, insurrection, showed Trump Jr. recording himself with a front-facing camera as Laura Branigan's 1982 pop hit \"Gloria\" played in the background. He told the camera:", "Just awesome patriots that are sick of the bullshit, so thank you all for that. In fact, it's hard to believe. Unfortunately, there's no room in between the main ground and then the masses. Love to see them getting closer 'cause I think it'd be pretty awesome, but this is pretty incredible.", "Then, at about the 21-second mark, the camera flipped to show what was in front of Trump Jr.: a few dozen people including the president standing around several screens depicting a crowd of supporters.", "The group was gathered inside a large outdoor party tent. While panning the scene for the viral 2:20-minute clip, Trump Jr. briefly stopped the camera on his girlfriend, Kimberly Guilfoyle, a former Fox News personality and adviser for Trump's 2020 presidential campaign. Trump Jr. yelled her name, she noticed the camera, and then she smiled and danced for about 10 seconds.", "After that, the video went back and forth between showing the screens with the president in front of them and \"selfie\" mode on Trump Jr. and White house Chief of Staff Mark Meadows. Trump Jr. and Guilfoyle conclude the viral video saying:", "Trump Jr.: I think we're T-minus a couple of seconds here, guys, so check it out, tune in. We're going to livestream it. It's going to be good. The Mark Meadows, an actual fighter, one of the few, a real fighter. Thank you, Mark. [...]", "Guilfoyle: Have the courage to do the right thing. Fight!", "The video was indeed authentic and was recorded on the day the pro-Trump mob breached the Capitol in an unsuccessful attempt to halt a Congressional vote to certify Joe Biden's presidential win. However, it depicted the moments before Trump addressed supporters at the Ellipse Park (which is directly south of the White House and a roughly 20-minute walk from the Capitol), but it did not show him watching a livestream of supporters breaking into and vandalizing the Capitol.", "We will lay out our evidence for those findings. According to an archive of Trump Jr.'s Facebook history, the video was posted to his official account with the title, \"A Little Backstage Time With POTUS Before His Speech\" and garnered tens of thousands of shares. By the time of this report, the video no longer existed on the social media platform.", "According to video footage of the event at Ellipse Park by Bloomberg, Branigan's \"Gloria\" blared through loudspeakers two times: once around 11:30 a.m. and then again about a half hour later, immediately before Trump took the stage. That audio was proof that the tent party was indeed a backstage event that showed him waiting to make his headline appearance. (An official Twitter account for Branigan, who died in 2004, said the Trump team did not have permission to use the song, and that it was \"absolutely appalling\" to hear it in the viral video.)", "Additionally, the screens depicted in Trump Jr.'s footage showed a crowd of people in front of a stage and signs with slogans for the pre-planned event, such as \"SAVE AMERICA MARCH\" and \"THE BEST IS YET TO COME!\" There was no evidence of the party-goers watching footage of the nearby Capitol, which was where violence and chaos ensued.", "Emmanuelle Saliba, a former investigative journalist for NBC News, confirmed those findings, tweeting that Trump Jr. posted the backstage footage around noon, shortly before the president said on stage he would march with them to the Capitol to \"demand that Congress do the right thing.\" (Here's more of what Trump said on stage.)", "During the approximately 70-minute speech, members of the far-right crowd began leaving the park and heading toward the Capitol, Saliba reported. See the below-displayed map by BBC to visualize the scene.Shortly before 1 p.m. (approximately an hour after Trump Jr. posted the livestream), posts started surfacing on social media showing extremists breaching barriers around the Capitol designed to prevent trespassing. Then, by 1:05 p.m., Saliba reported hundreds of people were charging toward the Capitol.", "In other words, it was true that some extremists started breaking into the federal property during Trump's speech, which immediately followed the backstage tent party.", "However, once he finished his remarks, he did not follow through with the pledge to join them in walking down Pennsylvania Avenue to the Capitol. Instead, Trump returned to the White House, according to New York Times reporter Maggie Haberman.", "There, officials told Haberman that Trump watched his supporters breach and vandalize the Capitol on television, while berating aides and disparaging Vice President Mike Pence for not agreeing to his agenda. Haberman wrote:", "The president holed up in the Oval Office, speaking with Mark Meadows, the White House chief of staff, who was said to have been rattled by the day, and Pat A. Cipollone, the White House counsel.", "In other words, while the exact location of the president at the peak of the chaotic insurrection was unknown, no evidence showed he was at a tent party. Rather, a reputable news outlet said he was in the West Wing.", "At 2:38 p.m., as pressure mounted on Trump to condemn the violence, he tweeted: \"Please support our Capitol Police and Law Enforcement. They are truly on the side of our Country. Stay peaceful!\"", "Later, he posted a video on social media sites saying he loved the rioters and that they should \"go home in peace\" — footage the platforms later deleted for violating policies aiming to prevent violence and misinformation. Additionally, Twitter locked the account of @realDonaldTrump for 12 hours.", "By Jan. 8, The Associated Press reported:", "The final days of Trump’s presidency are spinning toward a chaotic end as he holes up at the White House, abandoned by many aides, leading Republicans and Cabinet members. He was tweeting again after his Twitter account was reinstated, reverting to an aggressive statement that his supporters must not be “disrespected” after he sent out a calmer Thursday video decrying the violence.", "On the evening of Jan. 8, Twitter announced it was permanently banning Trump from its site, citing \"risk of further incitement of violence.\"", "This article was updated to note that Branigan's \"Gloria\" played twice through loudspeakers at the Jan. 6 Trump rally at Ellipse Park.", "Jessica Lee is Snopes' Senior Assignments Editor with expertise in investigative storytelling, media literacy advocacy and digital audience engagement.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]