["A special SC/ST court in Jodhpur, Rajasthan directed the police to file an FIR against cricketer Hardik Pandya after a complaint was filed against him alleging that he had made derogatory remarks about B R Ambedkar. The complainant had alleged that Pandya had made a casteist remark and had hurt the sentiments of a community, for which he must be prosecuted. The tweet which landed the cricketer in a soup is posted below.", "This tweet, on the basis of which the FIR has been filed is a parody account. The handle for this account is @sirhardik3777 whereas the cricketer’s official Twitter account is @hardikpandya7. This detail was not mentioned by some media houses when they initially reported the story. The reports were however updated later.", "On his part, the cricketer has issued a statement through Twitter in which he categorically denies having made derogatory remarks about Ambedkar and clarifies that the statement was not made from his account but from a fake account operating in his name.", "My statement. pic.twitter.com/P67YZLJqsl", "— hardik pandya (@hardikpandya7) March 22, 2018", "Alt News had earlier reported how there is a factory of fake quotes that works round the clock, attributing outrageous and provocative statements to public figures from sports persons to politicians to movie stars. In fact, the parody account of Hardik Pandya @sirhardik3777 that has come under the scanner in this recent controversy had been chronicled by Alt News for attributing a blatantly communal remark to the cricketer. It was earlier named @sirPK3777. The account has now been deleted.", "Fake quotes have become a daily affair. Today, the following fake quotes are circulating on social media, attributing words to singer Sonu Nigam and Aaj Tak anchor Sweta Singh.", "Posted by ग्रेट नरेन्द्र मोदी on Friday, March 23, 2018", "अप इस बात से सहमत हैं तो इस पोस्ट को ज्यादा से ज्यादा शेयर एवं इस पेज को लाइक करें", "Posted by सौगंध राम की खाते है हम मंदिर वही बनाएंगे on Friday, March 23, 2018", "On March 22, Alt News reported about a fake quote attributed to Aaj Tak journalist Sweta Singh. The quote was through a parody account on Twitter and was being shared on Facebook. Today i.e. March 23, the same quote is circulating in the form of a meme on Facebook. Memes use pictures of celebrities along with text for greater impact and more often than not, social media users believe them to be true.", "It is not easy for social media users to distinguish a real account from a fake account. This problem is exacerbated by the use of screenshots and images of fake accounts that may be taken from one social media platform and shared on another. For example, Facebook users may not be familiar with spoof accounts on Twitter and might end up sharing fake messages. Typically, the blue tick feature of Twitter is used to indicate authenticity of accounts of many individuals and especially celebrities. However, tweets from parody accounts are often mistaken to be those of actual persons since there are no visual markers to suggest that a particular tweet has been posted from a parody account. The menace of fake quotes has reached epic proportions, and the Hardik Pandya episode may not be the last.", "Donate Now", "Arjun Sidharth is a writer with Alt News. He has previously worked in the television news industry, where he managed news bulletins and breaking news scenarios, apart from scripting numerous prime time television stories. He has also been actively involved with various freelance projects. Sidharth has studied economics, political science, international relations and journalism. He has a keen interest in books, movies, music, sports, politics, foreign policy, history and economics. His hobbies include reading, watching movies and indoor gaming.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]