["“This train from China to Germany travels through kazakhstan, Russia, Belarus and Poland. Distance travelled 10214 kms. Started on the 13th of June last year. Goods transporting train. Plying from Europe (Germany) to China n vice versa. 200 containers per trip n there are plans to increase to 300. Travelling time abt 14 days. If by ship takes abt 2 mths. Spectacular shots 👍🏿 This is most interesting and must see to the end. The train is like a snake going round the hill. Take note 4 engines to pull 200 containers. Fantastic.”", "This message is being shared widely, along with a video showing a train with numerous coaches emerging from a tunnel and going around a hillock in a serpentine fashion.", "This train from China to Germany travels through Kazakhstan, Russia, Belarus and Poland. Distance travelled 10214 kms. Started on the 13th of June, 2018. It’s a Goods transporting train plying from Europe (Germany) to China and vice versa carrying 200 containers per trip. THREAD! pic.twitter.com/LfP7576I29", "— Manney Uto (Ph.D by 🇳🇬Affidavit!) (@BrosManney) September 14, 2019", "The above tweet of September 2019 has been retweeted widely. The video, however, is being circulated widely on WhatsApp at present. Alt News received scores of requests on the official Alt News app for verification of the accompanying claim. The video is 4:57 minutes long.", "Alt News found that this video with the said narrative has been posted on Facebook since 2018.", "Alt News found the narrative accompanying the video to be false. This train seen in the video does not ply from China to Germany as claimed. It is in the USA.", "To begin with, Alt News searched Google with the keywords ‘China to Germany train’, and found the same video posted on YouTube in 2018 with the same claim– this is a train that travels from China to Germany via Kazakhstan, Russia, Belarus and Poland. However, in the comments section, we found a comment by a user who claimed that the video shows a cargo train in the USA, and the route is the Tehachapi loop.", "On the basis of this information, Alt News found several videos posted on YouTube on the Tehachapi loop, which resembles the video shared by social media and WhatsApp users. The Tehachapi loop is a spiral railway route, connecting Bakersfield and Mojave in California. The route, hailed as an engineering marvel, became operational in 1876.", "Posted below is another video showing the Tehachapi Loop. As can be seen, it is the same route which has been shown in the viral video.", "It may be noted that a freight train does indeed ply from China to Germany. The Chongqing-Xinjiang-Europe railway route links the city of Chongqing in southwestern China to Duisberg in Germany, passing through Kazakhstan, Russia, Belarus and Poland before reaching Germany. The total length of the track is 11,179 kilometres, and the railway was launched in 2011. The video in question, however, shows a railway route in California, USA. The social media claim is false.", "Donate Now", "Arjun Sidharth is a writer with Alt News. He has previously worked in the television news industry, where he managed news bulletins and breaking news scenarios, apart from scripting numerous prime time television stories. He has also been actively involved with various freelance projects. Sidharth has studied economics, political science, international relations and journalism. He has a keen interest in books, movies, music, sports, politics, foreign policy, history and economics. His hobbies include reading, watching movies and indoor gaming.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]