["The 50-second clip was published here on Facebook on February 18, 2020. It has been watched more than 12,000 times and shared almost 390 times.", "The post's Indonesian-language caption translates to English as: “#BALOOT gambling arena in Saudi Arabia. Opened and inaugurated for the first time”.", "Below is the screenshot of the misleading post:", "A logo for Saudi Arabian television channel Al Ekhbariya TV can be seen on the bottom right-hand corner of the video.", "“Baloot” is similar to the French Belote. It is a popular card game among the Arabian Gulf youth, particularly the Saudis.", "The same video also appeared with a similar claim on Twitter here, where it has been viewed more than 1,500 times.", "The video has been shared in a misleading context; the footage actually shows a card game tournament in Riyadh, Saudi Arabia, which awarded cash prize to its winners; gambling is prohibited in Saudi Arabia, and in Islam.", "A Google reverse image followed by a subsequent keyword search found this original video on the verified YouTube page of Al Ekhbariya TV, the country’s news satellite TV channel, on February 15, 2020.", "An Arabic-speaking AFP journalist translated the video’s title as: “Women present in the Baloot game championship”.", "The narrator in the clip can be heard explaining that Baloot is a popular card game in the Gulf region and that this marked the first time women had participated in such a championship.", "The journalist can also be heard interviewing a female participant, who appears at the 30-second mark in the footage. She says that her husband taught her how to play Baloot and allowed her to participate in the championship. She also says that it was the first time women could participate.", "Below is a screenshot comparison of the video in the misleading post (L) and the Al Ekhbariya TV video (R):", "The Baloot Championship began from February 13 to February 20, 2020 and held at Riyadh Front shopping mall, according to the General Entertainment Authority of Saudi Arabia here.", "Saudi Gazette, a Saudi-based English daily, published this report about the championship on February 17, 2020, headlined: “Passion grips Baloot championship as women face off men for the first time”.", "The first two paragraphs of the report read: “Eagerness, passion and joy gripped the Riyadh Winter Baloot Championship as women faced off men for the first time in one of the most popular games in the Kingdom.", "“The championship is being held at the Riyadh Front from Feb. 13 – 22, 2020, with gamers competing for prizes worth a total of over SR2 million.”", "Below is the screenshot of the Saudi Gazette report:", "Arab News, another English-language Saudi daily, also published this report on the event on February 17, 2020, headlined: “Female Baloot players show off their skills at Saudi championship”.", "The tournament gave a total prize money of two million Saudi riyal to winners, according to the official website here.", "Gambling is prohibited in Saudi Arabia. Its constitution is based on the Koran. The gambling prohibition in the Koran can be read here and here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]