["A video of passengers in a train throwing food packets on railway platform is being shared with the claim that migrants discarded the food provided to them by the government and other agencies during their travel amidst the lockdown. Twitter user Vidyasagar Jagadeesan posted the video with the message, “Migrants throwing food given to them on the platform. Worst culture. Govt and agencies provide them food for their journey. But this is how they treat it.” It has been retweeted more than 600 times so far.", "Migrants throwing food given to them on the platform. Worst culture. Govt and agencies provide them food for their journey. But this is how they treat it. 😠😠😠 pic.twitter.com/vipovKyt7S", "— 🇮🇳 Vidyasagar Jagadeesan 🇮🇳 (@jvidyasagar) May 5, 2020", "Swarajya columnist Vikas Saraswat quote-tweeted the video and opined, “Disgusting behaviour. We often blame politicians, Babus, this and that. The real problem is indisciplined, selfish, mean minded folks with no sense of nationalism and societal obligation. Yes all Indians aren’t like that but these are still large numbers to affect nationally.”", "Alt News has also received several requests on its official Android application to fact-check this video.", "Another claim suggests the passengers are migrant workers from Maharastra", "The video is also getting shared on Facebook and Twitter with Marathi text, “अत्यंत खेदाची गोष्ट आहे* या परप्रांतियांना महाराष्ट्राने भरभरून दिले तेच आता आपापल्या गावी जाताना महाराष्ट्राला शिव्या शाप देत चालले आहेत ते सुखरूप गावी पोचावे म्हणून सरकारने जेवण, गाडी यांची व्यवस्था करून दिली तरीही जेवण रस्तावर फेकून देत चालले आहेत किती हा माज पण एक गोष्ट लक्षात ठेवा पुन्हा याल तर याद राखा”.", "the text suggests that the incident took place in Maharastra where migrants workers threw relief food and cursed the state.", "*अत्यंत खेदाची गोष्ट आहे* या परप्रांतियांना भरभरून दिले तेच आता आपापल्या गावी जाताना शिव्या शाप देत चालले आहेत ते…", "Posted by Prashant Nikam on Wednesday, 6 May 2020", "Alt News found that the video shows an incident of stale food being thrown by migrant workers travelling from Ernakulam in Kerala to Danapur in Bihar at West Bengal’s Asansol station. The video was shot on May 4, 2020. According to a report by The Quint, many of the migrant labourers complained that the food was stale and started throwing it on the railway station. In another video of the same incident posted below, one can hear the migrants saying that the food stinks and it’s inedible.", "Hello @RailMinIndia, passengers travelling in Shramik train from #Kerala to #Danapur complained of being served stale food at #Asansol station. The food packets were thrown by them on the platform in protest. Please ensure safe edible food for migrants. 🙏🏼 pic.twitter.com/AltaHdbENw", "— Sreyashi Dey (@SreyashiDey) May 5, 2020", "Responding to a user who shared the video, the official handle of Indian Railways Seva tweeted on May 5, “Maam, it was yesterday incident and alternative arrangement was done at Jhajha station . Also corrective measures have taken to avoid such issue.”", "Speaking with The Quint, Eastern Railways PRO Ekalabya Chakraborty said, “The food arrangement was made by IRCTC. In some coaches, it was reported that the food was not up to the mark. There is no question of denial. There were problems with the food. Because of the paucity of time, we couldn’t rectify it at the Asansol station itself. However, we arranged for food again in the next station. It was a mishap, yes. But we tried to rectify it.” Twitter user Vidyasagar later clarified that the passengers threw the food as it was stale.", "Thus, the video showed migrants travelling from Kerala to Bihar throwing stale food at a railway station in West Bengal, however, it was falsely claimed that the incident happened in Maharashtra. More importantly, social media claims failed to highlight the reason that compelled these migrants to throw the food. As admitted by the Indian Railways, the food had gone bad.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "Amid the ongoing Israel-Palestine conflict, media outlet Times Now put out a report claiming that…", "A 45-second video clip is being shared widely on social media where a group of…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…"]