["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A bicycle lodged in a tree in Vashon Island, Wash., is the stuff of lore, including a myth that persists about a boy who never returned from war.", "\"Lest we forget,\" a May 27 Facebook post begins. \"A boy went to war in 1914 and left his bike chained to a tree. He never came home and the family left the bike there as a memorial to the fallen soldier.\"", "This post, which includes a photo of a rusty red bike seemingly growing out of a tree, was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "In 2009, the Vashon-Maury Island Beachcomber, a local publication on Vashon, an island about 15 minutes away from Seattle, reported on a longtime family that \"laid a solid claim to the bicycle.\"", "Don Puz, who graduated from Vashon High School in 1963 and worked as a sheriff’s deputy until he retired in 1991, said that the bike was donated to him after his family’s home burned down, the Beachcomber says. It was too small for him and he claims that in 1954 he left it in the woods, forgot about it and never returned for it.", "His mother told the publication that her son and his friends had been playing in the woods and that Puz was the only child to ride his bike there. When the boys left, he abandoned his bike and walked home with them.", "After the bike was discovered and drew media attention, Puz visited the bike, the Beachcomber says.", "\"We went down there in the woods and there was this bike in the tree, and I said, ‘That’s my bike,’\" the Beachcomber quotes Puz as saying. \"I recognized it immediately. … When I saw that bike, I recognized it, because I don’t think I’ve ever seen another one like it.\"", "In 2013, Seattle TV station KOMO News also talked to Puz who said he had no doubt the bike was his.", "\"It’s a couple hundred feet from my mom’s house where I used to play in the woods,\" he said.", "The scene led Berkeley Breathed, who grew up on Vashon Island, to write a children’s book called, \"Red Ranger Came Calling,\" Atlas Obscura reports. The story follows a boy living on an island who wants a Red Ranger bicycle.", "The bicycle suspended feet above the ground also spurred the legend that a boy left the bike there before going to war.", "\"While it may be factually flawed, it shows that with its uncertainty, a simple but unusual thing like the Bike in the Tree can inspire fantasy and speculation,\" reads an essay on HistoryLink.org, a free online encyclopedia of Washington state history.", "Still, we rate this Facebook post False.", "Facebook post, May 27, 2019", "Vashon-Maury Island Beachcomber, \"Islander sets record straight about Vashon’s bike in a tree,\" Dec. 29, 2009", "KOMO News, \"Vashon mystery: How did the bike become embedded in the tree,\" Nov. 14, 2013", "HistoryLink.org, \"Vashon Island’s ‘Bike in the Tree,’\" Aug. 28, 2014", "Atlas Obscura, \"Vashon Island bike tree,\" visited June 17, 2019", "\"Red Ranger Came Calling,\" 1997", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]