["By D'Angelo Gore", "Posted on May 5, 2016", "Donald Trump again has repeated the false claim that Hillary Clinton “started” the so-called “birther” movement against Barack Obama in 2008.", "As we wrote last year, there’s no evidence that Clinton or her campaign had anything to do with bogus claims that Obama wasn’t born in the United States and thus was ineligible to be president.", "What we do know, as we wrote in November 2008, is that some of Clinton’s most loyal supporters pushed that theory during that year’s presidential campaign.", "Trump previously linked Clinton to the “birther” movement during a speech at the Conservative Political Action Conference in February 2015. On Sept. 22, 2015, he tweeted, “Just remember, the birther movement was started by Hillary Clinton in 2008. She was all in!” He made the claim most recently during a May 4 interview with CNN’s Wolf Blitzer.", "Trump, May 4: Do you know who started the “birther” movement? Do you know who started it? Do you know who questioned his birth certificate? One of the firsts? Hillary Clinton. She’s the one that started it. She brought it up years before it was brought up by me.", "But Trump’s campaign has never provided any evidence that claims that Obama was not born in the U.S. originated with Clinton or her campaign.", "In 2011, Politico did publish an article on the origins of “birtherism” that said that it began with Democrats, not Republicans.", "Politico, April 22, 2011: The answer lies in Democratic, not Republican politics, and in the bitter, exhausting spring of 2008. At the time, the Democratic presidential primary was slipping away from Hillary Clinton and some of her most passionate supporters grasped for something, anything that would deal a final reversal to Barack Obama.", "Philip Berg, a former deputy Pennsylvania attorney general and a self-described “moderate to liberal” who supported Clinton, was among the first to file a lawsuit over Obama’s birth certificate. Berg’s suit was dismissed on grounds that he had no legal standing to file it.", "But one of the authors of the Politico story, Byron Tau, now a reporter for the Wall Street Journal, told FactCheck.org via email that “we never found any links between the Clinton campaign and the rumors in 2008.”", "The other coauthor of the Politico story, Ben Smith, now the editor-in-chief of BuzzFeed, previously told MSNBC during a 2013 interview that the conspiracy theories traced back to “some of [Hillary Clinton’s] passionate supporters.” But he said the theories did not come from “Clinton herself or her staff.”", "On March 19, 2007, then Clinton adviser Mark Penn wrote a strategy memo to Clinton that identified Obama’s “lack of American roots” as something that “could hold him back.” That memo, which was part of campaign documents featured in a September 2008 article in The Atlantic, cited Obama’s “boyhood in Indonesia and his life in Hawaii” as life experiences that made his “basic American values … at best limited.” But Penn’s memo did not question Obama’s birthplace or his birth certificate. It advised Clinton to contrast her life experiences in middle America “without turning negative.”", "“We are never going to say anything about his background,” Penn wrote.", "If Trump has evidence that proves otherwise, it is long past time for him to produce it.", "https://www.sharethefacts.co/share/a20417aa-cd2d-42fe-8976-65e60d11e742", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]