["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "In a speech this month, former Vice President Joe Biden, the presumptive Democratic presidential nominee, offered the third installment of a four-part economic plan being rolled out in advance of the  Democratic National Convention in August. This set of proposals focused on caregivers — whether for children, older adults or people with disabilities — and is about \"easing the squeeze on working families who are raising their kids and caring for aging loved ones at the same time,\" Biden said.", "His campaign’s sweeping set of initiatives, which represent a $775 billion expenditure in a variety of programs, aims to get significant traction among middle-class voters, whose struggles with caregiving issues have been exacerbated during the coronavirus pandemic.", "When it came to home health workers, Biden zeroed in on their paychecks. \"They’re doing God’s work,\" he said. \"But home health workers aren’t paid much, they have few benefits. Forty percent are still on SNAP or Medicaid. So my plan is direct. It gives caregivers and early childhood educators a much-needed raise.\"", "That 40% is a striking number.", "After all, there are an estimated 3.3 million home health and personal care aides in the United States, according to the Bureau of Labor Statistics. These workers provide a range of daily living services to millions of older Americans and people with disabilities, chronic illness or cognitive impairment — making them an important part of the health care continuum. As the baby boom population ages, demand for home health workers is expected to increase rapidly. And, because Biden put a spotlight on the role caregivers could have in boosting the economy, we decided to investigate further.", "We contacted the Biden campaign to find out the source for the 40% statistic. A spokesperson pointed us to information from PHI National’s Workforce Data Center. PHI is a New York-based advocacy organization that studies the direct-care workforce, which is frequently cited as a source on this topic.", "The group indicated that in 2017 42% of direct care workers, a category composed of personal care aides, home health aides and nursing assistants, received some form of public assistance — defined by PHI as food and nutrition assistance, public health insurance or cash assistance. A further breakdown of this broad job category showed that 53% of home care workers received public assistance, with 30% having received food and nutrition assistance and 33% Medicaid insurance coverage.", "Based on these figures, Robert Espinoza, PHI’s vice president of policy, said Biden was certainly in the ballpark.", "But there’s more.", "The two programs Biden mentioned by name — SNAP, or the Supplemental Nutritional Assistance Program, and Medicaid, the state-federal health insurance program for low-income people — peg eligibility to income limits at or near the federal poverty level, which for an individual is $12,760. Those eligibility limits vary by program and state.", "Medicaid eligibility for adults depends on where they live, and ranges from 138% of poverty in states that chose to expand the program under the Affordable Care Act to a median of 40% of poverty in those states that didn’t. For SNAP, those limits are set at 130% percent of the poverty level for gross monthly income and 100% for net monthly income. For an individual, that’s $1,354 and $1,041, respectively.", "According to the Bureau of Labor Statistics, the median pay for home health workers is about $24,060 per year, and a 2019 report by PHI concluded that 47% of home health workers have incomes at or below 138% of the poverty level. These numbers further back up Biden’s assertion about the number of home health workers on Medicaid or SNAP. If anything, they suggest his 40% figure may be a lowball estimate.", "And one more bit of evidence that Biden was on the right track: The National Employment Law Project noted that many of these workers \"supplement their home care work with other jobs to make ends meet.\" That PHI report asserted that half of home care workers have only a high school education and often work part time or inconsistent schedules. These jobs are also marked by high turnover rates.", "Biden said home health workers were paid very little, citing a statistic that 40% of these workers relied on public assistance programs like SNAP and Medicaid as evidence.", "According to the experts with whom we spoke, and the documents we consulted, Biden accurately described home health workers’ income and their reliance on these programs. His number appears to represent the low end of the spectrum.", "We rate this statement True.", "Child and Elder Care Plan Speech, former Vice President Joe Biden, July 21", "Email and telephone exchanges with spokesperson for Joe Biden for President campaign, July 22, July 23", "Telephone interview with Robert Espinoza, vice president for policy, PHI National, July 22", "Telephone interview with Sara Rosenbaum, a professor of health law and policy at George Washington University’s Milken Institute School of Public Health, July 24", "PHI National, PHI Workforce Data Center, accessed July 22", "PHI, U.S. Home Care Workers Key Facts, 2019", "U.S. Department of Agriculture Food and Nutrition Service, Supplemental Nutrition Assistance Program, accessed July 22", "The New York Times, Biden Announces $775 Billion Plan to Help Working Parents and Caregivers, July 21", "Centers for Medicare & Medicaid Services, Medicaid, accessed July 23", "Bureau of Labor Statistics, Home Health Aides and Personal Care Aides, Sept. 4, 2018", "National Employment Law Project, Surveying the Home Care Workforce, Sept. 22, 2017", "Department of Health and Human Services, 2020 Poverty Guidelines, Jan. 21", "KFF, Medicaid and CHIP Eligibility, Enrollment, and Cost Sharing Policies as of January 2019: Findings from a 50-State Survey, March 27, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]