["About this rating", "On April 29, 2019, the entertainment website Geno Breaker published a junk news article stating that Crayola had named its new blue crayon \"Nipsey Blue\" in honor of the late musician Nipsey Hussle. The article took another lap around the internet a few months later when it was shared by Lil Boosie, a musician with more than 5 million followers, on Facebook:", "Crayola did not name a crayon \"Nipsey Blue\" after Nipsey Hussle. The above-displayed article originated with an entertainment website that carries a disclaimer stating: \"Genobreaker.com is a combination of real shocking news and satire news. Please note that articles written on this site are for entertainment and satirical purposes only.\"", "The Geno Breaker article was commenting on an April 2019 social media push to have Crayola name a blue crayon in honor of Nipsey Hussle. That effort was largely wasted, however, as it was based on a two-year-old marketing campaign.", "Here's a tweet from NBA star Lebron James suggesting that Crayola name its new blue color \"Nipsey Blue.\" Notice the date of James' tweet is from April 2019, while the article about Crayola's new blue crayon was posted in 2017:", "By the time social media users were pushing Crayola to label their new crayon \"Nipsey Blue,\" the company had already settled on a different name. In 2017, Crayola announced that its new blue would be called \"Bluetiful.\"", "The Geno Breaker article included a photograph of what appears to be a physical crayon with the name \"Nipsey Hussle\" written on it. However, this crayon was never mass produced by Crayola. A spokesperson for the company told the AFP that the \"Nipsey Blue\" crayon was created at a \"Crayola Experience\" location, which allows users to make their own custom crayon labels:", "“The photo circulating on social media is a crayon that was made by a visitor at one of our Crayola Experience locations in the United States,” said a Crayola spokesperson via Facebook Messenger.", "Crayola says the attraction allows a visitor to personalize and print an authentic Crayola crayon label, and then wrap it onto a crayon.", "“We do not make a box of crayons that contains a Nipsey Blue colored crayon.”", "Geno Breaker.   \"Crayola Renames Crayon Color in Honor Of Late Rapper Nipsey Hussle!!!.\"\r\n    29 April 2019.", "Lewis, Sophie.   \"Nipsey Hussle Fans, Including LeBron James, Want Crayola to Rename Crayon After Late Rapper.\"\r\n    CBS News.   25 April 2019.", "AFP.   \"‘We Do Not Make a Box of Crayons That Contains a Nipsey Blue Colored Crayon’: Crayola.\"\r\n    17 June 2019.", "Ainley, Nathaniel.   \"The Newest Blue Crayon Is 200 Years in the Making.\"\r\n    Vice.   31 May 2017.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]