["About this rating", "In early August 2018, amid hearings before the U.S. Senate Judiciary Committee on the confirmation of Supreme Court nominee Brett Kavanaugh, we began receiving requests from readers to check the veracity of Internet reports stating that Democrats had demanded that Kavanaugh submit to DNA testing.", "Some of these messages linked to a website promoting the claim that the Democrats were insisting the tests were necessary to prove that President Trump's second SCOTUS nominee \"literally\" isn't Adolf Hitler:", "WASHINGTON, D.C. -- As the confirmation hearings for President Trump’s SCOTUS pick Brett Kavanaugh began Tuesday, the leaders of the Democratic Party immediately turned up the heat on the nominee.", "While several Democrats have simply questioned Kavanagh’s prior political opinions, a growing contingent within the Party is demanding that the nominee submit to a DNA test in order to prove that he’s not literally Adolf Hitler.", "“History books claim that Hitler committed suicide by ingesting cyanide and then shooting himself in the head, but we don’t know anything for sure,” said Sen. Cory Booker (D-NJ). “Wouldn’t it be just like this president to choose Hitler to serve on the Supreme Court?”", "This article was not \"literally\" true, of course. Not a single mainstream news source reported that any such demand was made by Democrats, nor that Sen. Cory Booker said it would be \"just like this president\" to choose Hitler. No such discussion can be found in C-SPAN video coverage of the hearings. And if Adolf Hitler were alive today, he would be 129 years old.", "In point of fact, the article was a work of satire making fun of Democrats' partisan reactions to the appointee's conservative record. This point becomes more and more obvious the further one reads:", "As the hearings started up Tuesday morning, Sen. Dick Durbin (D-IL) claimed that Kavanaugh’s judicial decisions “put him on the same level as Hitler.” He added: “How can we know he’s not der Führer until we have DNA proof?” He then grilled Kavanaugh: “Are you now or have you ever been ADOLF HITLER HIMSELF, GOOD SIR???”", "The spoof originally appeared on the Babylon Bee website, whose disclaimer states that “The Babylon Bee Is Your Trusted Source for Christian News Satire.”", "Cope, Kevin and Joshua Fischman.   \"It's Hard to Find a Federal Judge More Conservative Than Brett Kavanaugh.\"\r\n    The Washington Post.   5 September 2018.", "The Babylon Bee.   \"Democrats Demand Kavanaugh Submit to DNA Test to Prove He’s Not Actually Hitler.\"\r\n    4 September 2018.", "C-SSPAN.   \"Supreme Court Nominee Brett Kavanaugh Confirmation Hearing.\"\r\n    4 September 2018.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]