["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Senate Majority Leader Mitch McConnell of Ky., speaks with reporters following a closed door luncheon on Capitol Hill in Washington, Tuesday, June 26, 2018. (AP)", "Election security has come under the microscope since North Carolina nullified the results of a November congressional race.", "The state elections board ordered a new election after finding ballot tampering in the 9th District, where Republican Mark Harris appeared to beat Democrat Dan McCready. Political operatives working for the Harris campaign had collected absentee ballots and then, according to some testimony, cast illegal votes and forged witness signatures.", "In a speech on the Senate floor, Republican Majority Leader Mitch McConnell recently cited North Carolina’s case while criticizing Democrats for not doing more to prevent election fraud. He said loose absentee voting laws threaten the \"nature of our representative democracy\" because they allow political operatives to take control of ballots.", "\"And once those operatives take a hold of those ballots, the voters have no way to keep tabs on whether they were ever delivered,\" he said in the Feb. 26 speech, according to this copy.", "Is it true that absentee voters have no way of knowing whether their ballots were delivered? McConnell’s speech didn't refer to any state specifically. But his claim was made as he spoke about what happened in North Carolina.", "However, in North Carolina, election officials do provide a method for voters to track their ballots.", "The method requires voters to have access to a computer and know how to navigate the internet, which may be an obstacle for some voters. (About 11 percent of Americans don’t use the internet, according to a 2018 Pew Research survey.)", "Still, it’s a way voters can \"keep tabs\" on their ballots.", "\"An absentee vote, by law, is not tallied until Election Day, although absentee applications are approved throughout the absentee period via absentee meetings of county boards,\" said Pat Gannon, a spokesman for the NC elections board.", "\"There are ways to track absentee ballots through our public data, and many people outside this agency used that data to look into absentee voting irregularities in the 2018 election cycle,\" he said.", "ONLINE TRACKING", "One way to track your ballot is through the NC elections board’s \"voter lookup\" tool on its website: ncsbe.gov. The tool currently appears on the left side of the website’s homepage.", "Once registered voters enter their name and hit \"search,\" they’ll be taken to a webpage with search results. Those results may show several names in a list. Voters can click on their name, which will take them to a new page.", "The page will show a voter’s information such as their address, political party affiliation and polling place. One section of the page is titled \"absentee request.\" By clicking on it, voters can see when an absentee ballot was sent, what address it was sent to, and whether a voted ballot was received by the county board.", "County election boards in North Carolina are tasked with tracking the progress of absentee ballot requests.", "\"If a voter wanted to do so, they could look up their information in the daily online spreadsheet file that the counties and State Board of Elections produces every day of early voting,\" said Michael Bitzer, politics professor at Catawba College in Salisbury.", "They can look in the column marked \"Received,\" to see if their absentee by-mail ballot was received, Bitzer said. They can also see if the ballot was \"accepted\" or rejected, with the associated date.", "MCCONNELL PUSHBACK", "When we presented this information to McConnell’s office, McConnell spokesman Don Stewart suggested that absentee ballot delivery opens the door to fraud. Voters \"have no way of knowing whether it was the actual ballot or a replacement,\" Stewart said.", "\"If you hand me (someone who you don’t know) your ballot, and I sign your name to a different ballot and turn in the different ballot, you have no way to keep tabs on whether or not YOUR ballot was delivered,\" he continued. \"You can only trust that I did the right thing, but no way of tracking that.\"", "That theory is not only far-fetched but \"next to impossible\" to execute, said Gannon, the NC election board spokesman.", "\"What they’re suggesting would take a conspiracy of a grand scale, and it would result in the conspirators committing multiple felonies for each ballot,\" Gannon said, referring to the scenario presented by Stewart.", "Each absentee ballot in NC has special markings and a special number, Gannon said. First, the person who might try to replace someone’s absentee ballot would have to get blank ballots, \"which include special markings and are printed on special card stock and cut in specific ways,\" he said.", "\"That would require theft from a county board office, or a county employee or ballot printing vendor would have to be in on the conspiracy,\" Gannon said.", "\"Second, each county typically has numerous ballot styles for each election, so anyone trying to switch out ballots likely would have to have access to all of the ballot styles,\" he continued.", "\"Third, county board employees write a CIV number on each ballot. That number is assigned to an individual voter. Conspirators would have to write that number on each fraudulent ballot in such a way that it wouldn’t raise a red flag to the county board when the ballots came back.\"", "OUR RULING", "McConnell said that, once political operatives take hold of those ballots, \"voters have no way to keep tabs on whether they were ever delivered.\" The NC elections board enables voters to track the status of their absentee ballots online. That may not help some voters who don’t use the internet. Nonetheless, it’s an available tracking option. We rate this claim Mostly False.", "This story was produced by the North Carolina Fact-Checking Project, a partnership of McClatchy Carolinas, the Duke University Reporters’ Lab and PolitiFact. The NC Local News Lab Fund and the International Center for Journalists provide support for the project, which shares fact-checks with newsrooms statewide. To offer ideas for fact checks, email [email protected].", "A digital copy of a speech delivered by U.S. Senate Majority Leader Mitch McConnell (R-Kentucky) on Feb. 26, 2019.", "Email correspondence with Don Stewart, spokesman for U.S. Sen. Mitch McConnell.", "Email correspondence with Patrick Gannon, spokesman for the North Carolina State Board of Elections.", "Email correspondence with Michael Bitzer, politics professor at Catawba College.", "Story about a Pew Research Center survey, \"11% of Americans don’t use the internet. Who are they?\" posted March 5, 2018.", "The voter lookup tool on the North Carolina State Board of Elections website.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]