["About this rating", "In late July 2020, Snopes readers inquired about an image circulating on social media that lead some to believe the grocery chain Kroger was collecting money for the Black Lives Matter movement from its customers.", "Black Lives Matter is a national racial justice movement that originated in the 2010s in response to police killings and violence against Black Americans. After Black Lives Matter protests swept the nation in the spring of 2020, Kroger did announce that through its charitable foundation, it would create a $5 million fund \"to improve social diversity, equity and inclusion.\"", "The image in question purportedly showed a Kroger receipt itemizing a carton of milk for $2.39 and a \"BLM CHARGE\" (circled in red in the photo above) of 59 cents.", "But Kroger isn't adding a fee to customer transactions in order to raise money for Black Lives Matter. A spokesperson for the company confirmed the image was altered from an actual receipt showing 59 cents charged for a \"change shortage.\"", "As we previously reported, that 59-cent charge was added as the result of a confusing company policy regarding returning coin change amid a national coin shortage. A statement from Kroger states, \"The Federal Reserve is experiencing a significant coin shortage across the U.S., resulting from fewer coins being exchanged and spent during the COVID-19 pandemic. Like many retailers and businesses, we are adjusting to the temporary shortage in several ways while still accepting cash.\"", "As we noted, store policy on how customers receive coin change has been a point of confusion. A customer in Illinois reported that a cashier refused to return change in coin form, charging them $3 for an item that cost $2.41, resulting in the 59-cent charge on the receipt.", "Kroger spokeswoman Kristal Howard told us by email on July 24, 2020, that the policy as of this writing is that customers can use credit or debit cards, opt to have the difference loaded onto loyalty cards as credit for future purchases, provide coin change in a lane that has coins available, or round their purchase total up and donate the difference to charity.", "The BLM Kroger receipt hoax appears to be a classic case of \"Fauxtography,\" an altered photograph meant to spread misinformation. We therefore rate this claim \"False.\"", "Redman, Russell.   \"Grocery Retailers Take Stand Against Racism.\"\r\n    Supermarket News.   10 June 2020.", "MacGuill, Dan.   \"Did Kroger Supermarkets Overcharge Customers Due to a Coin Shortage?\"\r\n    Snopes.com.   23 July 2020.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]