["About this rating", "Several times over the last few years social Facebook posts have appeared proposing that users who followed instructions to \"like\" and \"share\" them could win myriad prizes in a purported giveaway sponsored by Ellen DeGeneres:", "<!--", "-->", "The Ellen DeGeneres Show does run segments involving prize giveaways that may have online components, including ties to official social media accounts, but not ones involving randomly choosing viewers who \"like\" and \"share\" posts stemming from counterfeit Facebook accounts such as the one shown above.", "Any legitimate promotional offer using Facebook should be tied to an account bearing a blue badge indicating the account has been verified by Facebook as authentic:\n\nAs we have noted on previous pages about similar hoaxes, these counterfeit promotional posts exhibit a number of red flags, primarily that the underlying pages are not endorsed by any official channel associated with Ellen DeGeneres:\n\nThe first clue that the giveaways following this format are not on the up-and-up is that the pages to which Facebook users are directed are ones created just days before the giveaway posts begin to appear. Not only are the secondary Facebook pages involved new, they are also not linked with automobile companies or other interests one might imagine could reasonably be expected to offer up a car in exchange for social media advertising (such as automobile dealerships, insurance companies, or large retailers). Were a legitimate company to engage in such a high-ticket contest giveaway, the incentive would be exposure, but no corresponding promotional return on advertising investment is discernable in these Facebook giveaway claims.\n\nThe aim of schemes such as the celebrity giveaway hoaxes are typically to rapidly build a large Facebook following in order to sell pages with high \"like\" counts to third parties. While such hoaxes appear to present little risk to participants, liking and sharing the false information is not entirely safe: in addition to advancing the interests of and encouraging social media scammers, page likes potentially enable user data mining by scammers.  And in some cases, the giveaway hoaxes lure victims into downloading malware-bearing files.", "Any legitimate promotional offer using Facebook should be tied to an account bearing a blue badge indicating the account has been verified by Facebook as authentic:", "As we have noted on previous pages about similar hoaxes, these counterfeit promotional posts exhibit a number of red flags, primarily that the underlying pages are not endorsed by any official channel associated with Ellen DeGeneres:", "The first clue that the giveaways following this format are not on the up-and-up is that the pages to which Facebook users are directed are ones created just days before the giveaway posts begin to appear. Not only are the secondary Facebook pages involved new, they are also not linked with automobile companies or other interests one might imagine could reasonably be expected to offer up a car in exchange for social media advertising (such as automobile dealerships, insurance companies, or large retailers). Were a legitimate company to engage in such a high-ticket contest giveaway, the incentive would be exposure, but no corresponding promotional return on advertising investment is discernable in these Facebook giveaway claims.", "The aim of schemes such as the celebrity giveaway hoaxes are typically to rapidly build a large Facebook following in order to sell pages with high \"like\" counts to third parties. While such hoaxes appear to present little risk to participants, liking and sharing the false information is not entirely safe: in addition to advancing the interests of and encouraging social media scammers, page likes potentially enable user data mining by scammers.  And in some cases, the giveaway hoaxes lure victims into downloading malware-bearing files.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]