["Several users on Facebook and Twitter have shared a news clip with the claim, “The United States has just discovered the man who made and sold the Corona virus to China. Dr. Charles Lieber, Head of the Department of Chemistry and Biology at Havard University, USA. USA He was arrested today according to sources from the US department.”", "A Twitter user posted the viral video. It has over 3,000 views.", "نواں کٹا کھُل گیا جے", "USA just discovered the man who manufactured and sold the Corona virus to China. Dr Charles Lieber, head of the chemistry and biology department at Havard University, USA. He was just arrested today according to American department sources.", "Check 👉🏽👇🏼👇🏼👇🏼 pic.twitter.com/7sPRbxu11x", "— Basit Alvi (@bpk69) April 5, 2020", "In the video, US attorney Andrew Lelling can be heard saying that the chairman of the chemistry department at Harvard University Dr Charles Lieber was arrested from his office. Liebling says that the complaint filed against Dr Lieber alleges that he signed a contract with the Chinese University in Wuhan and was paid up to $50,000 per month and up to $158,000 in living expenses. It was further reported that Dr Lieber allegedly received more than one and a half million dollars to set up a research lab in China all while working at Harvard and receiving multiple research grants from the US Department of Defense and national institutes of health.", "Alt News has received several requests to fact-check the video on WhatsApp (+917600011160) and on our official Android application.", "This slideshow requires JavaScript.", "The video carries a logo of US-based ABC News on the bottom right corner. Alt News performed a keyword search ‘dr charles lieber abc news’ on YouTube and found that the video was uploaded by WCVB Channel 5 Boston on January 29. The channel is affiliated with ABC News. The title of the video reads, “Harvard department chair arrested; charged with concealing ties to China.”", "Next, Alt News performed a keyword search on the official website WCVB Channel 5 Boston and found three articles that include the keywords ‘Dr Charles Lieber’.", "On April 9, WCVB Channel 5 Boston published a fact-check report debunking conspiracy and false claims surrounding Lieber, China and COVID-19. Lieber was arrested on January 28 for “making false statements to the agency of the United States Government,” or lying to federal authorities about his ties to China, as per the fact-check report. The channel added that prosecutors have never alleged that Lieber was involved in manufacturing and/or selling a virus to China. The full federal court complaint against Dr Lieber can be read here.", "The report also clarified Lieber’s links to Wuhan. The report stated, “Lieber travelled to WUT (Wuhan University of Technology) in mid-November 2011 ostensibly in order to participate in a Nano-Energy Materials Forum.”", "On July 29, Dr Lieber’s attorney Marc Mukasey told WCVB Channel 5 that he didn’t hide anything or get paid as the government alleges.", "Thus, the social media claim that Harvard professor Dr Charles Lieber “made and sold” the COVID-19 virus to China is false.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]