["About this rating", "On 22 February 2019, the Facebook page for Republican Revival, a group whose purported mission is to \"help Americans see through the Progressive Liberal bias,\" posted a photograph of Bernie Sanders, the U.S. senator from Vermont who was once again seeking the Democratic nomination for President.", "The photograph showed a man being dragged off by two police officers and was accompanied by a caption proclaiming that \"In 1963 Bernie Sanders was arrested for throwing eggs at black civil rights protestors. This is the side of Bernie that CNN and the fake news media don’t want you to know\":", "The photograph was one that surfaced during the 2016 presidential campaign and was verified at that time as a genuine picture of Sanders being hauled off to a police wagon by Chicago police -- but the real back story to the image was the opposite of what the viral Facebook post's caption claimed.", "The photograph was taken at a South Side protest in Chicago in 1963, when Sanders was 21 years old. According to the Chicago Tribune, Sanders was charged with resisting arrest in connection with a protest against segregation in area schools, not for \"throwing eggs at black civil rights protesters\":", "At the University of Chicago, [Sanders] was a leader of the Congress of Racial Equality [CORE], a major civil rights group. News accounts from the time had Sanders leading protests over racial inequality.", "In the early 1960s, protests over segregation in the Englewood area raged over mobile classrooms dubbed \"Willis Wagons,\" named for then-Chicago Schools Superintendent Benjamin Willis. Critics charged that the trailers kept black children in the area instead of sending them to white schools.", "Sanders was arrested Aug. 12, 1963, and charged with resisting arrest. He was found guilty and fined $25, according to a Tribune story about the protests.", "When another photograph of Sanders engaged in civil rights activism emerged in February 2016, it was initially disclaimed as picturing someone else, but it proved to be a genuine image of Sanders speaking to fellow CORE members at a sit-in. Likewise, the arrest photograph was confirmed by the Sanders campaign as a real picture of him:", "The subjects of the photographs were not listed on the negatives, but information filed with them indicated that the Tribune arrest photo was taken in August 1963 near South 73rd Street and Lowe Avenue, which is in the Englewood neighborhood.", "A January 1964 Tribune story on the court cases of those who had been arrested in August identified a Bernard Sanders. The negatives were scanned and an image was shown to the Sanders campaign [and] the campaign confirmed that [the arrest] photo also shows Sanders.", "\"Bernie identified it himself,\" said Tad Devine, a senior adviser to the campaign, adding that Sanders looked at a digital image of the photo. \"He looked at it -- he actually has his student ID from the University of Chicago in his wallet — and he said, 'Yes, that indeed is (me).'\"", "Chicago magazine also weighed in on story behind the photograph back in March of 2016:", "Sanders’s activist record got a boost when a photo surfaced that showed him getting arrested in Chicago during protests in 1963 against the use of so-called “Willis Wagons.” The trailers, named for the despised (in the black community) CPS superintendent, Benjamin Willis, were deployed disproportionately on the South and West Sides as overflow space for African Americans whose segregated schools were overcrowded. Black parents argued that the trailers, typically placed on on schools’ parking lots or playgrounds, were being used to keep black students out of white schools, some of which were underpopulated. In the resulting boycotts, a whopping 200,000 students, mostly African American, stayed home from school.", "One hundred and sixty-nine people had been arrested in the summer of ’63 and four people were charged, and one of them was Bernard Sanders, 21.", "Skiba, Katherine.   \"Arrest Photo of Young Activist Bernie Sanders Emerges from Tribune Archives.\"\r\n    Chicago Tribune.   22 February 2016.", "Felsenthal, Carol.   \"The Story Behind Bernie Sanders’s 1963 Arrest.\"\r\n    Chicago.   15 March 2016.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]