["This Facebook post, which includes multiple photographs of a grocery store damaged by a fire, was published on November 17, 2019.", "The same images and claim were shared in multiple Sri Lankan WhatsApp groups.", "Below is a screenshot of the misleading Facebook post:", "The Tamil-language caption translates to English as: “First outcome before elections result. A Muslim man’s shop was burnt in Bandarakoswatta.”", "Sri Lanka’s Presidential election was held on November 16, 2019. Gotabaya Rajapaksa won a landslide victory on the back of a nationalist campaign promising security and to crush religious extremism in the Buddhist-majority country. Here is an AFP report about the presidential polls.", "Bandarakoswatte is a small town located in North Western Sri Lanka.", "All of the same images were published here in another Facebook post on November 17, 2019 alongside a similar claim. The post also included additional images of the same burned shop. Below is a screenshot of the post:", "The Sinhala-language caption translates to English as: “Gota faction thugs attack a store in Hettipola, Bandarakoswatte area. Is this the country’s security? Is this why the flower bud was given the vote?”", "“Gota” refers to Gotabaya Rajapaksa, Sri Lanka’s former Defense Secretary and the newly elected President who contested the recent election under the Sri Lanka Podujana Party (SLPP).", "A flower bud is the official party symbol of the SLPP.", "Both of the Facebook posts' claims are misleading.", "The shop owner told AFP the fire was not the result of foul play but was most likely due to an electrical fault.", "AFP spoke to the owner of the Bandarakoswatte store destroyed by fire, Siddique Faiz, by phone on November 18, 2019.", "“I was contacted by a house located near the store, at around 3am on November 17, and informed a fire had broken inside the shop. I immediately rushed to the scene and doused the fire with the help of several other neighbours,” he told AFP.", "Faiz says he does not suspect or single out any individual or political group in connection to the fire.", "“Nothing suspicious happened on the day of the election or in the days leading up to the polls. It's been about a decade since I opened this store and there is no reason why my store should be singled out for an attack. I cannot point the finger at any party or faction. My suspicions are that this could be the result of an electrical fault,” he added.", "The Officer in Charge of the Wariyapola Police division told AFP by phone on November 18, 2019 they also suspect it was an electrical fire.", "“Preliminary investigations have not revealed any signs of external tampering of the shop premises that would indicate an outside party instigated the fire. Moreover, the owner himself admits that he had to break into the store to douse the fire,” the OIC told AFP.", "He added the Government Analyst's Department and the Ceylon Electricity Board had launched separate investigations into the cause of the fire.", "Sri Lanka’s independent election observation body, the Center for Monitoring Election Violence (CMEV), said that its independent fact gathering led them to believe the fire was not a result of malicious, politically-motivated actions.", "CMEV National Coordinator Manjula Gajanayake told AFP: “The fire is a likely result of an electricity leak and not the work of an ill-intentioned individual or group motivated by political revenge.”", "He also noted that the CMEV had probed 16 reports of post-election violence and had not found evidence to prove any of the attacks were racially or communally motivated.", "“They were cases of political rivals meeting face to face and experiencing various altercations,” he added.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]