["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A south Florida politician said that the word picnic shouldn’t be used to describe an annual gathering of city employees.", "Fort Lauderdale City Commissioner Robert McKinzie said the word has racist origins, referring to hangings of African Americans.", "\"It is a very racially insensitive word if you look at it,\" he said during a Feb. 19 commission meeting.", "McKinzie elaborated: \"You can Google it. I don’t want it to be printed in the paper, but it’s racially insensitive. It is a tradition that was used to celebrate the hanging of black folks back in the days, so just, we need to change it to ‘family outing, cookout, barbecue,’ but I would never use that word.\"", "(Hat-tip to South Florida Sun Sentinel reporter Brittany Wallman who tweeted McKinzie’s statement.)", "We wanted to know if McKinzie’s point was accurate, so we interviewed professors of language and African-American history.", "They said it does not refer to lynchings.", "Instead, picnic has French roots and refers to a social gathering where people eat. (Snopes long ago debunked a similar claim.)", "McKinzie, a Democrat and owner of a general contracting firm, was appointed by the commission to fill a vacancy in 2014 and has since won election twice. He represents a district that includes most of the city’s historically black neighborhoods.", "We asked McKinzie and his assistant to provide evidence to support his claim and did not get a response by our deadline.", "Claims have circulated for at least two decades that the word \"picnic\" has racist connotations.", "In 2002, Yohuru R. Williams, then an associate professor of history at Delaware State University, wrote an article for the Black History Bulletin, \"Anatomy of an untruth: the controversy over 'picnic’ and the true cause of lynching.\"", "Williams wrote the article a couple years after he heard a presentation by Ron Wallace, president of Dularon Entertainment. Wallace said the word picnic was short for \"pick a n-----' to lynch.\"", "We found the same statement by Wallace in the Oakland Post in 1997.", "But Williams, who is now a dean at the University of St. Thomas in St. Paul told us that \"picnic\" is not a racially insensitive term.", "However, McKinzie would have been on more solid ground if he had said that many lynchings had a picnic-like atmosphere.", "The term historians use is \"spectacle lynchings,\" Williams said. These were large public gatherings where people took photographs and looked for souvenirs, he said.", "Other writers and experts have also debunked the idea that the word picnic has racist origins, including David Pilgrim, founder and curator of the Jim Crow Museum of Racist Memorabilia at Ferris State University in Michigan.", "Pilgrim told us in an interview that it’s possible someone used the word picnic to refer to lynchings, but \"what we know for a fact is that’s not where the word picnic came from.\"", "Other historians have also documented the picnic-like atmosphere of lynchings.", "Philip Dray, who wrote a book, At the Hands of Persons Unknown: The Lynching of Black America, wrote that crowds consumed food or drink.", "\"Lynching was an undeniable part of daily life, as distinctly American as baseball games and church suppers,\" he wrote. \"Men brought their wives and children to the events, posed for commemorative photographs, and purchased souvenirs of the occasion as if they had been at a company picnic.\"", "University of North Carolina history professor W. Fitzhugh Brundage told us that the term \"negro barbecue\" was used to describe instances in which whites burned their victims.", "\"Such extreme mutilation happened in fewer than a quarter of the lynchings, but of course the horror of the events and the publicity surrounding them meant that they left a lasting impression,\" Brundage said. \"So if someone has a problem with words associated with lynching, it should arguably be barbecue and not picnic.\"", "Joseph T. Acquisto, professor of French who chairs the department of romance languages and linguistics at the University of Vermont, said the word picnic has French origins. It is a composite of two French words: the verb piquer and the noun nique (pronounced: pea-kay and neek).", "Acquisto said the term dates back to 1694, according to the Trésor de la langue française, an extensive dictionary of 19th and 20th century French.", "\"It notes that the original meaning was a meal where everyone paid their share or brought their own food, and then later became an outdoor meal,\" he said.", "Kevin Rottet, an associate professor of French linguistics at Indiana University, told us that the first appearance of the word picnic in English was in 1748.", "\"From a linguistic point of view, the accusation of racial insensitivity does not at all accord with the facts in the history of this word,\" Rottet said. \"I would categorically reject the claim of racist connotations here.\"", "McKinzie said that the word picnic is a \"racially insensitive word.\"", "There is no evidence that the origin of the word traces back to lynchings of African-Americans. The word has French origins and refers to a gathering with food.", "During lynchings, the settings were sometimes social occasions where white people ate food. While that was a picnic-like atmosphere, it doesn’t mean that the word \"picnic\" is a racist word.", "We rate this statement False.", "Fort Lauderdale City Commission, Video of afternoon meeting, Feb. 19, 2019", "City of Fort Lauderdale, Commissioner Robert McKinzie biography, Accessed Feb. 20, 2019", "Sun Sentinel reporter Brittany Wallman, Tweet, Feb. 19, 2019", "Etymology Online, Picnic, Accessed Feb. 20, 2019", "Oxford Dictionary, Picnic, Accessed Feb. 20, 2019", "Merriam-Webster, Picnic, Accessed Feb. 20, 2019", "Morning Call, Strong sense of injustice spurs lynchings collector, Nov. 11, 2011", "Black History Bulletin article written by Dr. Yohuru R. Williams, \"Anatomy of an untruth: the controversy over \"picnic\" and the true cause of lynching,\" July 2002", "Oakland Post article by Ron Wallace, Black Wallstreet: A holocaust no one talks about, March 30, 1997", "Snopes, Did the Word ‘Picnic’ Originate with Lynchings? Jan. 21, 2011", "Black Voice News, An urban legend that binds us: the word picnic, March 17, 2008", "David Pilgrim, Blacks, Picnics and Lynchings, January 2004", "Sun Sentinel, Fort Lauderdale commissioners fill commission vacancy, Nov. 4, 2014", "Sun Sentinel, Lauderdale's District 3 to choose commissioner, Jan. 29, 2015", "Philip Dray’s book, \"At the hands of persons unknown: the lynching of black America,\" 2002", "Interview, David Pilgrim, founder and curator of the Jim Crow Museum at Ferris State University, Feb. 19, 2019", "Interview, David Colburn, director of the Bob Graham Center at the University of Florida and former history department chair, Feb. 20, 2019", "Interview, W. Fitzhugh Brundage, University of North Carolina-Chapel Hill history professor, Feb. 19, 2019", "Interview, Joseph T. Acquisto, professor of French who chairs the department of romance languages and linguistics at the University of Vermont, Feb. 20, 2019", "Interview, Kevin J. Rottet, Associate Professor of French Linguistics Department of French & Italian, Indiana University, Feb. 20, 2019", "Interview, Dr. Yohuru Williams, Dean, College of Arts and Sciences University of St. Thomas, Feb. 20, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]