["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Hardly a day passes where vicious snarls don’t somehow tie up the George Washington Bridge.", "But those snarls aren’t limited to traffic. More and more, daily questions are arising from the September closure of some local-access lanes on the span. To date, they have resulted in the resignation of two high-ranking transportation officials and calls for a federal investigation into what’s become known as ‘Bridgegate.’", "And none of the questions are going away quietly.", "Among the latest claims to enter the fray? One by Gov. Chris Christie, who complained earlier this month about the local-access lanes for Fort Lee, where the bridge is located.", "\"The fact that one town has three lanes dedicated to it, that kind of gets me sauced,\" Christie said Dec. 2 in response to Democratic lawmakers subpoenaing the director of the Port Authority of New York and New Jersey -- which operates the bridge -- to appear before a state Assembly committee about the lane closures from Sept. 9-13. The closures caused massive traffic jams in Fort Lee, leaving some drivers stranded for hours.", "Three lanes of a 29-lane span (12 lanes on the upper level, 10 on the lower level and seven from the Palisades Parkway) dedicated to a relatively small borough in Bergen County? The governor isn't even close to correct.", "Let’s look at some numbers here.", "The 2012 census notes that Fort Lee’s land area is 2.54 square miles and the borough’s population that year was 35,732. And not all of those people are drivers or even users of the bridge connecting upper Manhattan with the borough.", "So why the hullabaloo about bridge lanes and Fort Lee? It goes to the September closures, when two of three local-access lanes were closed, purportedly for a traffic study, according to Port Authority officials questioned about the closures.", "Some Democrats have questioned whether the closures were political retribution against Fort Lee’s Democratic mayor for failing to endorse Republican Gov. Chris Christie for re-election last month..", "And the matter has continued to heat up.", "Assemblyman John Wisniewski (D-Middlesex), chairman of the Assembly Transportation, Public Works and Independent Authorities Committee, and an outspoken critic of the Port Authority, has convened hearings on the matter and issued subpoenas to Port Authority officials to testify about what happened. David Wildstein, the Port Authority’s director of interstate capital projects, who ordered the bridge’s general manager to carry out the closures, and agency Executive Director Bill Baroni have since resigned.", "On Dec. 10 the Port Authority’s inspector general launched an investigation into the closures and now U.S. Sen. Jay Rockefeller, a West Virginia Democrat who chairs the Senate Commerce, Science and Transportation Committee, has asked the federal transportation secretary to investigate.", "Both Wisniewski and Sen. Loretta Weinberg (D-Bergen) are dumbfounded by Christie’s claim that the local access lanes are dedicated to Fort Lee.", "\"These lanes are open to the general public,\" Wisniewski said. \"They’re physically located in Fort Lee but they’re not dedicated to Fort Lee.", "\"I think it’s the word ‘dedicated’ to Fort Lee that creates the problem here,\" Wisniewski added. \"There’s an access point at Fort Lee that people (who live there) use and that many other people use.\"", "Wisniewski explained that use of the access lanes in Fort Lee is similar to drivers using the New Jersey Turnpike Extension, for example, to get to the Holland Tunnel connecting Manhattan and Jersey City. It’s one way of using the tunnel, but not the only way.", "And Weinberg, who lives near the bridge, noted that there is no residency requirement for the people of Fort Lee or anyone else to use the bridge.", "\"There are no specific dedicated lanes,\" she said. \"There are lanes that come from local streets in Fort Lee, but all lanes come through Fort Lee because the bridge is there. There are some local streets where you don’t have to get on the main highway.\"", "Since neither Christie’s spokespeople, Port Authority spokespeople or even the Fort Lee Police Department would respond to requests for comment on the matter, the Truth-O-Meter went on the road last week to check out the local access lanes.", "We found that Wisniewski’s and Weinberg’s assessments are correct: there are lanes from local Fort Lee streets but none are dedicated specifically to the borough. Anyone can use them -- or not.", "Our ruling", "Earlier this month, in response to subpoenas being issued in the so-called ‘Bridgegate’ scandal, Christie said, \"The fact that one town has three lanes dedicated to it, that kind of gets me sauced.\"", "Christie is way off here. Never mind that his claim makes it seem as if a significant part of the bridge’s total number of lanes are dedicated to a borough with a land area only 2.5 square miles in size, with approximately 35,000 residents. The facts are that the George Washington Bridge is physically in Fort Lee and there are local access lanes from the bridge. But none of the lanes are dedicated for use only in or by the borough. All motorists are able to use them as an entry point to the span.", "Know what gets the Truth-O-Meter sauced, governor? Ridiculously false claims. Pants on Fire!", "To comment on this story, go to NJ.com.", "PolitickerNJ.com, Christie: Fort Lee's dedicated lanes should be reviewed, Dec. 2, 2013, accessed Dec. 17, 2013", "FortLeeonline.com, George Washington Bridge page, accessed Dec. 17, 2013", "Phone interview with Assemblyman John Wisniewski, Dec. 17, 2013", "Phone interview with Sen. Loretta Weinberg, Dec. 18, 2013", "Port Authority of New York and New Jersey website, George Washington Bridge page, accessed Dec. 18, 2013", "Port Authority of New York and New Jersey website, History of the George Washington Bridge, accessed Dec. 18, 2013", "NJ.com, NJ lawmaker issues more subpoenas in George Washington Bridge closure controversy, Dec. 13, 2013, accessed Dec. 18, 2013", "U.S. Census Bureau website, Fort Lee Quick Facts page, accessed Dec. 19, 2013", "NJ.com, Timeline of the Port Authority's George Washington Bridge lane closure controversy, Dec. 19, 2013", "NJ.com, Chris Christie said 'Bridgegate' nothing more than partisan politics, Dec. 19, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]