["About this rating", "Maggots can be introduced to any jarred food or substance if the seal is broken after manufacturing.", "Maggots can survive the canning process and live inside a sealed jar of sauce (or any other substance).", "Whether the jar depicted was compromised post-canning, at the store, or in a home environment.", "On 28 April 2015, a Facebook user published the above-reproduced image and comment, claiming he and his wife found clearly live maggots inside a new jar of Bertolli spaghetti sauce they had bought at a Walmart in Grants Pass, Oregon.", "On 5 May 2015, the same individual published a second, similar claim. This time, the brand in question was Prego, and the content was a video demonstrating what appeared to be identical contamination found on the shelves of the same Walmart:", "Returned to the scene of the 'maggot sauce' incident 6 days later and just for the hell of it I looked at the Spaghetti sauces..Unbelievable!! Figure it out Walmart!! #walmart #moldysauce #qualitycontrol Grants Pass Walmart", "Posted by Gene Finocchiaro on Tuesday, May 5, 2015", "On 29 April 2015, the claim was republished by Oregon news outlet KTVL, but it offered no information regarding whether they'd personally investigated the claim before sharing it, nor did it link to an article or video content with further information.", "As commenters observed, the depicted jar of Bertolli sauce had a visibly \"popped\" seal.  However, it was impossible to tell whether or not the seal was broken before or after purchase.  The seal was also broken on the Prego jar, but again, it was impossible to tell when.", "Scientifically, the notion that maggots could survive the canning process and go on to live in a sealed jar is (at the very least) suspect. Accepted safe temperatures in canning range between 240 and 250 degrees, a temperature well over the necessary level of heat to kill maggots and other forms of larvae.", "An entomologist commented on a similar claim of maggots in tomato cans or jars:", "Garry McDonald, an entomologist from Melbourne University, said it was \"highly unusual\" for a maggot to be found living in processed food, like a jar of tomato paste.", "\"It's a pretty acidic, hostile environment ... It is unlikely to have been a maggot originating from within that bottle, unless it had been previously opened ... The average life of a maggot - from egg hatch to developing into a pupa - might take two or three weeks. It could be a bit less, or a bit more. It's not all that long.", "\"If the maggot was alive, the egg would have had to have been laid in the last two or three weeks.\"", "It's extremely unlikely that maggots can survive the canning process, not to mention subsequent life in an acidic environment (such as tomato sauce, paste, or similar products). Occasionally, contamination occurs after jars are sealed, resulting in a \"popped\" lid. The photographs and videos in question appeared to depict unsealed jars of Bertolli and Prego sauce, and it was unclear at which point the purported contamination occurred.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]