["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Cormick Lynch, a Republican running to replace Democrat U.S. Rep. David Cicilline, is concerned about the cost of education.", "During a debate with his GOP challenger, Stan Tran, on the WPRI Newsmakers program that aired Aug. 3, Lynch complained that college tuition and fees have gone through the roof over the past 36 years.", "\"College education has gone up 1,200 percent since 1978,\" he said. \"This isn't your parents' college education. Students -- young students -- are issuing outrageous amounts of debt to go to college and get a degree, and the only thing the schools are guaranteeing them after that is a bill.\"", "Lynch said the injection of federal money is one of the reasons the costs have gone up so much. \"Education costs should not increase more than the rate of inflation.\"  Critics have long argued that escalating government loan problems have pushed college costs higher and higher.", "A 1,200 percent increase means the cost of education is 13 times higher than in 1978.", "That sounded high to us, so we thought we'd check his statistic.", "Lynch said he based the number on an April 23, 2013 article on the business website fastcoexist.com, where it says -- in a story and in a graphic -- that since 1979, public and private college costs have increased 1,120 percent. It's based on a report by Bloomberg and Business Week.", "Lynch then added 33 percent a year for 2013 and 2014 and rounded it up to 1,200 percent.", "We confirmed the trend -- and got more up-to-date numbers -- by going to the Bureau of Labor Statistics. It shows a 1,172 percent increase from July 1978 to June 2014, which rounds up to the amount cited by Lynch.", "Lynch's problem: His statement doesn’t account for inflation, which increased the cost of things we buy -- from a dozen eggs to a college education -- by 265 percent from 1979 to 2012.", "We confirmed the numbers by turning to data from National Center for Education Statistics, which looks at costs a bit differently using dollar amounts from the schools as far back as the 1963-64 school year. The latest statistics cover the 2012-13 school year and look at costs with and without inflation.", "Without inflation, the typical price tag for tuition and fees for the 1977-78 school year was $984.  It was $10,683 for the 2012-13 school year -- a 985 percent increase.", "But when changes in the cost of living are taken into consideration, the typical $984 college bill for 1977-78 would now be about $3,636. Then the average bill for the 2012-13 school year ($10,683) would be 194 percent higher, not 1,200 percent.", "The inflation-adjusted increases were 147 percent for private or nonprofit four-year colleges and universities, 234 percent for public four-year institutions and 147 percent for public two-year colleges.", "Point of interest: At URI, tuition and fees for in-state students totaled $924 for the 1977-78 school year. The total for 2012-13 was $12,450, an increase of 277 percent if you adjust for inflation and 1,247 percent if you don't.", "Our ruling", "Cormick Lynch said the cost of \"college education has gone up 1,200 percent since 1978.\"", "He should have made it clear that he wasn't adjusting for inflation.", "His statement is only close to true if the median household income had remained at $15,000 per year (according to the U.S. Census Bureau) and a loaf of bread was still 54 cents (as it was in 1978, according to the Bureau of Labor Statistics).", "If you adjust those tuition numbers for the rising cost of living, Lynch's percentage is six times too high.", "The statement is accurate in the sense that college cost have increased many times faster than the cost of other things we buy. But it fails to account for inflation -- an important omission -- that would put the comparison in context.", "We rate it Half True.", "(If you have a claim you’d like PolitiFact Rhode Island to check, email us at [email protected]. And follow us on Twitter: @politifactri.)", "WPRI.com, \"Newsmakers: GOP Congressional candidates Cormick Lynch and Stan Tran,\" Updated Aug. 1, 2014, aired Aug. 3, 2014, accessed Aug. 2, 2014", "Emails, Cormick Lynch, Republican candidate, U.S. Congress, District 1, Aug. 1 and 5, 2014", "FastCoExist.com, \"Charting The Insanely High (And Rapidly Rising) Cost of College,\" April 23, 2013, accessed Aug 5, 2014", "BusinessWeek.com, \"College Tuition's 1,120 Percent Increase,\" Aug. 23, 2012, accessed Aug. 5, 2014", "Bloomberg.com, \"Cost of College Degree in U.S. Soars 12 Fold: Chart of the Day,\" Aug. 15, 2012, accessed Aug. 5, 2014", "NCES.Ed.gov, \"Table 330.10. Average undergraduate tuition and fees and room and board rates . . . 1963-64 through 2012-13,\" National Center for Education Statistics, accessed Aug. 1, 2014", "Emails, Ilan Kohert, Bloomberg News, Aug. 6, 2014", "Interviews, Gary Steinberg, spokesman, U.S. Bureau of Labor Statistics, and David Lavallee, spokesman, University of Rhode Island, both Aug. 6, 2014", "BLS.gov, \"CPI Databases,\" Bureau of Labor Statistics, tuition data accessed by selecting \"Subjects\" tab, \"Consumer Price Index,\" \"CPI Databases,\" the \"One Screen Data Search\" button on the \"All Urban Consumers (Current Series)\" line, \"U.S. city average\" from Box 1, \"College tuition and fees\" in Box 2, and \"Get Data\" on Line 4; Consumer price data accessed by selecting \"All Items\" in Box 2; both accessed Aug. 6, 2014", "Census.gov, \"Historical Income Tables: Households,\" Table H-6, \"Regions-by Median and Mean Income; all races,\" accessed Aug. 6, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]