["A video that shows a mass gathering of sadhus is viral with the claim that the Juna Akhara has threatened a protest after lockdown if speedy justice is not served in the Palghar lynching incident. On April 16, three sadhus affiliated with Shri Panch Dashnam Juna Akhara were mistaken for thieves and lynched in Maharashtra’s Palghar. The perpetrators and the victims hailed from the same community and more than 100 people have been arrested for the crime. Juna Akhada sadhus have also informed that they would gather at Trayamkeshwar in Nashik to demand a high-level probe into the murder, per a report by Hindustan Times.", "Below is a tweet by one Gunjan Kashyap who identifies as a BJP and RSS supporter. Her tweet has garnered over 300 retweets. It reads, “महाराष्ट्र सरकार । क्या यह तूफान रोक पाएगी? मैं मांग करती हूं जल्द से जल्द पालघर कांड पर इंसाफ हो। नहीं तो जूना अखाड़े ने लोक डाउन के बाद महाराष्ट्र में प्रदर्शन करने की चेतावनी दी है।”", "महाराष्ट्र सरकार । क्या यह तूफान रोक पाएगी? मैं मांग करती हूं जल्द से जल्द पालघर कांड पर इंसाफ हो। नहीं तो जूना अखाड़े ने लोक डाउन के बाद महाराष्ट्र में प्रदर्शन करने की चेतावनी दी है। pic.twitter.com/DxXdi9Hcsg", "— Gunjan Kashyap (@iGunjankashyap) April 20, 2020", "The video is massively viral on social media.", "Alt News had fact-check this video earlier in January when it was shared with the false claim that it shows sadhus and agoras coming out in large numbers in support of the Citizenship Amendment Act (CAA). However, we had found that the same video was earlier shared by a Twitter user Aviator Anil Chopra with the message, “The greatest temporary spectacle on earth, peaceful and orderly for such a great mass of humanity. Incredible Indian civilisation. #Kumbh2019“. It was posted on March 7, 2019.", "The greatest temporary spectacle on earth, peaceful and orderly for such a great mass of humanity. Incredible Indian civilisation. #Kumbh2019 pic.twitter.com/GBQKraOZ6E", "— Aviator Anil Chopra (@Chopsyturvey) March 7, 2019", "The reverse image search also led us to a March 11, 2019 Facebook post by one Suresh Kumar, where the video is accompanied with the caption, “Kumbh Mela Naga sadhu”.", "Kumbh Mela Naga sadhu,,,,,", "Posted by Suresh Kumar on Monday, 11 March 2019", "Kumbh Mela was celebrated from January 15 to March 4 last year and saw a footfall of over a million pilgrims.", "The video, however, was also uploaded with different description on YouTube. A channel uploaded the clip on March 3, 2019, with the caption, “Junaghad Naga bava” suggesting that the video pertains to Mahashivratri. This festival fell on March 4 in 2019.", "While the origin of the video could not be established, it certainly is unrelated to the Palghar lynching incident.", "[Also read: Palghar lynching incident falsely communalised on social media]", "Donate Now", "Kinjal Parmar holds a Bachelor of Science in Microbiology. However, her keen interest in journalism, drove her to pursue journalism from the Indian Institute of Mass Communication. At Alt News since 2019, she focuses on authentication of information which includes visual verification, media misreports, examining mis/disinformation across social media. She is the lead video producer at Alt News and manages social media accounts for the organization.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "Amid the ongoing Israel-Palestine conflict, media outlet Times Now put out a report claiming that…", "A 45-second video clip is being shared widely on social media where a group of…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…"]