["About this rating", "At least one person reacted angrily to a lecture given by Bill Nye in Waco, Texas.", "The incident occurred \"recently\" in 2015 and involved the majority of audience members.", "An old rumor concerning Bill Nye the Science Guy, the origins of moonlight, and an overtly religious crowd in Waco, Texas, has been circulating around the internet since at least 2006.", "The most common iteration comes from the web site Think Atheist, which claimed that several audience members stormed out of a theater after Nye supposedly contradicted a biblical passage about the \"two great\" lights during a lecture at McLennen Community College in 2006:", "But nothing got people as riled as when he brought up Genesis 1:16, which reads: “God made two great lights — the greater light to govern the day and the lesser light to govern the night. He also made the stars.”", "The lesser light, he pointed out, is not a light at all, but only a reflector.", "At this point, several people in the audience stormed out in fury. One woman yelled “We believe in God!” and left with three children, thus ensuring that people across America would read about the incident and conclude that Waco is as nutty as they’d always suspected.", "This paraphrased story tends to circulate around the internet whenever a piece of pseudoscience enters the news cycle. In this case, the rumor about Bill Nye's infamous Waco speech embarked on another viral journey shortly after a few residents in North Carolina town balked at the idea of installing solar panels in December 2015.", "While the above-quoted story is often shared to illustrate how religious beliefs can interfere with science, it should be noted that this event took place in 2006, and that it only involved a small number of audience members. In fact, the original story published by The Waco Tribune stated that Nye was greeted with \"raucous standing ovation\":", "Speaking as part of MCC's Distinguished Lecturer Series, Nye spoke to two audiences, one at 1:30 p.m. and the second at 7 p.m., of about 600 each. He said the first audience, though littered with young children listening to some rather adult scientific topics, \"was very supportive.\"", "The second group also was rapt from the beginning, greeting the scientist with a raucous standing ovation upon his introduction.", "While some people may have heckled Nye during his presentation in Waco, Texas, the television host said that he barely noticed the disruption. Nye appeared on Countdown With Keith Olbermann on 7 April 2006 to discuss the controversy:", "Guest Host Brian UNGER:  Let's start first, though, with what happened to you during that lecture.  Now as a scientist you come across this sort of heckling from time to time?  Is this just .", "NYE:  I have to tell you guys, I didn't think I was heckled.  People left.  I don't remember being heckled.  I got a standing O at the end.  I was just .", "UNGER:  Lots of shouts out there.  That was kind of a heckle.", "NYE:  Let's—I don't want to get to far afield here and talk too much about me, but I was talking about how a very famous reverend, Jerry Falwell insisted that he thinks that global climate change, global heating is a myth, and he was going to buy a Chevy Suburban the next time he had an opportunity, and I pointed out that that's bad.", "And that the literal interpretation of the bible, to me, is not satisfactory, it's just not enough information.  The Bible is not about the process of evolution or relativity or anything else.  The Bible is about - I think it's about the human condition and so on.  So this - these details that this wire service picked up are fascinating and charming, but it wasn't really the whole point.", "UNGER:  I'm going to go with you and blame the media myself.", "NYE:  Not the media.  I just didn't think I was heckled.", "UNGER:  I understand.  Yeah.", "NYE:  Some people left because they were concerned.  Knock yourselves out.  But people—we have taxpayers and voters that don't believe in global heating, think it's a myth.  That's not in anybody's best interest.  I'm going to tell you, as a scientist and so on, engineer and taxpayer and voter that global heating, global warming is a very serious problem.  And you can't ignore it.  It's a problem discovered through the process of science.  So it's a worthy thing.", "In summation, it's true that Bill Nye gave a scientific lecture at McLennen Community College in Waco, Texas. It's also true that his speech angered at least one audience member. This event, however, did not occur recently, and did not involve a majority — or even a significant portion — of the audience.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]