["About this rating", "In early May 2016, a number of tabloids around the world published stories about a \"new\" trend called sex roulette, in which people gather for unprotected sex with at least one member is secretly HIV-positive.  On 16 May 2016, Britain's Mirror and Daily Mail published articles documenting the alarming \"rise\" of sex roulette.  The former reported that an exotic dancer from Serbia had attested to the existence of the events:", "Extreme ' sex roulette ' parties - where one person secretly has HIV and no one is allowed to wear a condom - are on the rise, doctors have warned.", "The risky orgies are usually attended by gay men and offer the so-called 'thrill' of not knowing whether or not you will be infected .", "Doctors in Barcelona have seen a rise in the number of such parties, which they claim is a sign that people have \"lost respect\" for HIV.", "Dr Josep Mallolas of Hospital Clinic Barcelona told el Periodico : \"There is everything: sex roulette parties, or sex parties you can only attend if you already have HIV.\"", "He added that some of the events are known as 'blue' parties because attendees take anti-viral drugs to reduce the risk of transmitting the virus.", "Last year, a Serbian stripper called Tijana claimed the parties originated in Serbia – and were named Serbian sex roulette, after Russian roulette, Metro reported.", "Speaking last year, she told Serbian newspaper Telegraf: \"I can see that everyone is talking about sex parties now, but in fact they have been common for a long time even here in Serbia.", "A Spanish-language source cited by English-language tabloids seemed to stipulate that the activity was restricted to gay men. That article (translated) mentioned sex roulette, before addressing a single doctor's larger cautionary viewpoint:", "Doctors at Hospital Clínic dealing with infectious diseases and AIDS have warned that Barcelona residents are having encounters known as sexual roulette, in which one person of the group is infected with HIV, the virus that causes AIDS, in order to give them a more stimulating experience. Specialists, including Dr. Josep Mallolas, warn that people have \"lost respect\" for a disease that, when treated, is no longer deadly, but is incurable and life threatening.", "These meetings, reports Cadena Ser, consist of groups of people — usually gay men — who engage in orgies or group sex that include the guest suffering from AIDS, but without disclosing which participant is the sick individual.", "There is no credible evidence that such an event has ever occurred, much less is \"on the rise.\" The claim of HIV-infecting sex parties sweeping the globe is based on vague statements purportedly made by a single physician in Spain, and none of the published articles carried firsthand reports. The closest was a statement made at one time by a stripper in Serbia who simply claimed such events were happening (not that she had ever attended or witnessed one).", "In 2003, columnist Andrew Sullivan published a piece critical of a related moral panic over what is called \"bug chasing.\" While the term remains in the vernacular as a practice in which an individual deliberately seeks out HIV infection, Sullivan took issue with reports that it was a widespread practice:", "It was an all-red, over-the-banner Drudge headline, guaranteed to grab attention. “MAG: 25% OF NEW HIV-INFECTED GAY MEN SOUGHT OUT VIRUS, SAYS SAN FRAN HEALTH OFFICIAL.” Drudge was referring to a four-page story by one Gregory A. Freeman, in Rolling Stone magazine, owned by gay media mogul Jann Wenner. It was quickly picked up by conservative talk-show host Sean Hannity, who never misses an opportunity to denigrate gay men. For many who witnessed the media onslaught, it will soon be accepted as fact.", "That’s a shame, because not long after hitting the newsstands, the story has completely fallen apart.", "The story centers on a bizarre sub-subcultural phenomenon known as “bug chasing.” A few HIV-negative gay men, for all sorts of deep and dark psychological reasons, appear actually to be seeking out HIV infection. Some HIV-positive men, it is also alleged, are just as willing to infect these troubled souls with HIV. This disturbing phenomenon is not new. There were occasional stories about it in the late 1990s, stories that fueled an urban legend but that never made it to the mainstream. Why? Because of simple lack of hard evidence that anyone but a very few disturbed people were involved.", "When nearly identical claims surfaced in early May 2016, gay culture site Towleroad compared the concept to the \"bug chasing\" panic, pointing out that the rumors are improbable as well as implausible:", "First of all, the assertion that such parties could even be orchestrated is kind of ridiculous. Logistically, in order to guarantee that at least one person at such a party is ‘secretly’ HIV positive, one of the event’s planners would have to make sure to invite someone who is HIV positive. In other words, the identity of the HIV positive guest would be known to at least one person–making it not a secret.", "Second, there is little evidence to back up the reports that were carried by outlets such as The Sun, The Mirror and The Daily Mail (and later picked up by some gay news outlets). So far, there seems to be only one doctor from Spain and one psychotherapist who have attested to the rise of the gay ‘sex roulette’ party ... Again, the report seems to only reference one doctor and one psychotherapist. Who are all these other Spanish doctors attesting to the existence of these events?", "As with sex bracelets, gerbiling, or tales of lobster-based gratification gone awry, sex roulette (and its predecessor, \"bug chasing\") appear to be solely based on extrapolation. No version of the rumor delved into the fact that HIV remains a dangerous and life-threatening condition most of humanity seeks to avoid.", "In July 1999, relationship and sex advice columnist Dan Savage dismissed fantastical gay sex urban legends as a thing that existed only \"in the imaginations of some straight people whose sex lives are so dull, they have to make up bullshit\".  We contacted Savage about \"sex roulette,\" and he told us:", "No one ever went broke tossing up stories about the gross things all gay men allegedly do all the time.", "My rule of thumb: if I only get questions from people who’ve heard about it — icey mikes, donkey punching, bug-swapping parties — and never any questions from people who’ve actually done it… no one is really doing it.", "Evans, Natalie.   \"'Sex Roulette' Parties Where One Person Secretly Has HIV Are On The Rise, Doctors Warn.\"\r\nMirror.   17 May 2016.", "Mandell, Sean.   \"Are HIV Sex Roulette Parties Actually a Thing?\"\r\nTowleroad.   18 May 2016.", "Moore, Charlie.   \"Sex Roulette Parties Where One Person Is Secretly HIV+ And Nobody Is Allowed To Use Condoms Are On The Rise, Warn Doctors.\"\r\nDaily Mail.   16 May 2016.", "Savage, Dan.   \"Swap Meet.\"\r\nSavage Love.   8 July 1999.", "Sullivan, Andrew.   \"Sex- And Death-Crazed Gays Play Viral Russian Roulette!\"\r\nSalon.   24 January 2003.", "SER Catalunya.   \"La Ruleta Sexual.\"\r\n18 April 2016.", "El Periódico.    \"Ruletas Sexuales En Barcelona Con Un Enfermo De Sida Como Invitado De Incógnito En La Orgía.\"\r\n18 April 2016.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]