["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "\"If you need to call 911 but are scared to because of someone in the room, dial and ask for a pepperoni pizza.\"", "So begins a June 23 Facebook post that has been shared more than 13,000 times. It goes on to claim that the dispatcher will ask if the caller knows they’re calling 911.", "\"Say yes,\" it says, \"and continue pretending you’re making an order. They’ll ask if there’s someone in the room. You can ask how long it will take for the pizza to get to you, and they will tell you how far away a patrol unit is. Share this to save a life!!! Dispatchers are trained to ask specific yes or no questions..don’t hang up!\"", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "That’s because it’s not accurate, even though it’s been repeated often in recent years.", "In 2014, a Reddit user who said they were a 911 operator published a post that said a woman called 911 and ordered a pizza because she was in the room with someone who couldn’t know she was reporting an emergency.", "In 2015, a Super Bowl ad designed to raise awareness about domestic violence depicted a 911 call in which a woman orders a pizza while a camera cuts to different rooms in the house that are in disarray.", "\"Do you have an emergency or not?\" the dispatcher in the ad says.", "\"Yes,\" the woman replies.", "But the claims in the Facebook post are wrong. Back in March 2018, many media outlets reported that police were warning people not to follow this advice.", "The Los Angeles Police Department tweeted in March 2018 that texting 911 with your exact location and the nature of your emergency \"is what’s needed to send the right resources.\"", "The post \"gives the impression that asking for a pepperoni pizza is somehow a ‘secret code’ to the 9-1-1 operator,\" LAPD said on Twitter. \"That is false. Operators are trained to recognize voice inflection, odd conversations that would indicate a dangerous situation, among other things.\"", "Situations where someone needs to call 911 without another person in the room knowing aren’t uncommon, according to LAPD, and texting is a good option in areas where it’s available.", "\"If a voice call is an absolutely must,\" the agency wrote, \"your options for discretion are not limited to ordering a pepperoni pizza.\"", "We rate this Facebook post False.", "Facebook post, June 23, 2019", "Reddit, \"911 Operators, what is that 1 call that you could never forget?\" May 10, 2014", "YouTube, \"Super Bowl XLIX Ad - 911 Pizza Call,\" Feb. 2, 2015", "Fox News, \"Law enforcement bust myth about ‘pepperoni pizza’ 911 code, despite Internet claims,\" March 27, 2018", "CBS Los Angeles, \"Don’t call 911 to order a pizza - even if it’s a real emergency, LAPD says,\" March 21, 2018", "nbc4i.com, \"Law enforcement warn not to call 911 to order ‘pizza,’ even if it’s a real emergency,\" March 25, 2018", "LAPD Communications Division tweet, March 21, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]