["About this rating", "On 21 February 2017, web site DailyKos.com shared a photograph of White House advisor Stephen Miller, along with a claim that the image clearly shows him using a hand gesture that signifies white nationalism:", "That’s Steve Miller, senior advisor to Donald Trump. He’s also an avowed racist.", "Don’t take my word for it—that’s what his friends and family say. He hasn't been quiet about it at all: he has openly disparaged blacks, Latinos, and Asians throughout his school career, from high school to Duke University, where he palled around with white supremacist leader Richard Spencer.", "You might think that’s an odd natural gesture to make. And it is. What Steve is doing is completely intentional:", "The right hand, on top, is showing just three fingers: \"W\".\nHis left hand curls to make the \"P\" formation.\nWP. White Power. White nationalists know exactly what that sign means.\nAccording to the Anti-Defamation League, this is a common white supremacist hand sign “particularly” used in California. (Stephen Miller is from Santa Monica.)", "Twitter users also shared this image of Miller alongside pictures of gang symbols taken by the Anti-Defamation League:", "The photograph was taken on 12 February 2017 by Reuters photographer Joshua Roberts, shortly before Miller appeared on Face the Nation: \"Senior White House Advisor Stephen Miller waits to go on the air in the White House Briefing Room in Washington, U.S., February 12, 2017.\"", "It is impossible to tell, in the absence of additional images or video to use for comparison purposes whether Miller was deliberately using a hand gesture of any sort or whether this picture simply captured him during a fleeting moment while he was adjusting his tie and jacket. We have reached out to Roberts to see if any such footage is available.", "However, the position of Miller's hands do not match the white power hand symbol image provided by the ADL:", "Some white supremacists, particularly in California, may use a two-handed handsign in which one hand forms the letter \"W\" and the other hand forms the letter \"P,\" to represent WP or \"White Power.\"", "While Miller's right hand may resemble a \"W\", it is a stretch to say that his left hand resembles a \"P\". Miller's gesture more closely resembled the Aryan Circle's hand symbol, although this would be problematic: the Aryan Circle is a white supremacist prison gang, and as far as we know Miller has never been in prison (generally a prerequisite for prison gang membership). Furthermore, the symbol (per the ADL) consists of holding up the thumb and the middle, ring, and little fingers of one hand, signifying the numbers 1 and 3, yet Miller's thumb is not raised:", "Anti-Defamation League senior researcher Mark Pitcavage told us that the claim is not credible:", "A photo of White House staffer Stephen Miller has been circulating on social media in which people claim that Miller is surreptitiously sending a “white power” hand sign to, one presumes, viewers.  However, he seems merely to be adjusting his suit and tie, while his hand positioning does not actually resemble the \"WP\" hand sign that some California-based white supremacist street gang members use.  More importantly, there is no reason why Miller would even know of such an obscure symbol, much less use it, and in any case, Miller is Jewish and would be rejected by white supremacists on that basis.  There is simply no credibility to this claim.", "Evidence that Miller was actually using a controversial gesture is slight at best, and most likely the image simply captured him in the act of adjusting his outfit just before appearing on camera.", "In September 2018, the same claim was made of Zina Bash during the confirmation hearings for Trump Supreme Court nominee Judge Brett Kavanaugh:", "Anti-Defamation League.     \"Hate on Display. Hate Symbols Database.\"\r\n      Retrieved 13 February 2017.", "Blake, Aaron.     \"Stephen Miller’s Authoritarian Declaration: Trump’s National Security Actions ‘Will Not Be Questioned.’\"\r\n      The Washington Post     13 February 2017.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]