["By D'Angelo Gore", "Posted on April 10, 2019", "Last year, the Trump administration announced a “zero tolerance” border policy that resulted in children being separated from their parents who were detained for entering the U.S. illegally. Yet President Donald Trump recently claimed that “President Obama separated the children. …  I’m the one that stopped it.”", "The suggestion that there was a similar policy under Obama is false. Trump “stopped” his own policy after a public backlash to the family separations.", "The Trump administration policy, announced in April 2018, required the Department of Homeland Security to refer all adults who illegally entered the U.S. for criminal prosecution. That resulted in children being separated from their parents, who entered the federal court system and were placed in detention centers for adults only.", "Immigration experts told us that previous administrations did not have a blanket policy to prosecute parents and separate them from their children.", "We first wrote about the Trump administration policy when the president falsely claimed, “We have to break up families” because of “bad laws that the Democrats gave us.” We wrote about it again when administration officials started defending the policy by making the misleading argument that Obama and President George W. Bush did the same.", "Trump has now twisted the facts again by referring to an executive order he signed that halted the separations caused by his own administration’s border policies, not Obama’s.", "He made his most recent claim at the White House before a meeting with Egyptian President Abdel Fattah el-Sisi. A reporter asked Trump if he was again “considering child separations” to deter illegal immigration, and Trump said that it was Obama who “had child separation” and that Trump “was the one that changed it.”", "Reporter, April 9: Are you considering child separations, sir? Can you rule that out, Mr. President? You wouldn’t start separating the children again, would you, Mr. President?", "Trump: Obama separated the children, by the way.", "Reporter: Would you consider doing it again?", "Trump: Just so you understand, President Obama separated the children. Those cages that were shown — I think they were very inappropriate — they were built by President Obama’s administration, not by Trump. President Obama had child separation. Take a look. The press knows it. You know it. We all know it. I didn’t have — I’m the one that stopped it. President Obama had child separation.", "Now, I’ll tell you something: Once you don’t have it, that’s why you see many more people coming. They’re coming like it’s a picnic because “let’s go to Disneyland.” President Obama separated children. They had child separation. I was the one that changed it.", "But immigration experts told us last year that family separations under Trump’s most recent predecessors did not occur on the same scale as they did under Trump.", "“Bush and Obama did not have policies that resulted in the mass separation of parents and children like we’re seeing under the current administration,” Sarah Pierce, a policy analyst with the Migration Policy Institute, told us for an article published last June.", "She said child separations under previous administrations were done in “really limited circumstances” such as suspicion of trafficking or other fraud.", "We also interviewed Theresa Cardinal Brown, director of immigration and cross-border policy at the Bipartisan Policy Center, who made a similar point.", "She and her co-author, Tim O’Shea, wrote a piece for the Bipartisan Policy Center that explained why families were being separated at the border under Trump.", "“Previous administrations used family detention facilities, allowing the whole family to stay together while awaiting their deportation case in immigration court, or alternatives to detention, which required families to be tracked but released from custody to await their court date,” Brown and O’Shea wrote. “Some children may have been separated from the adults they entered with, in cases where the family relationship could not be established, child trafficking was suspected, or there were not sufficient family detention facilities available. … However, the zero-tolerance policy is the first time that a policy resulting in separation is being applied across the board.”", "The Office of the Inspector General for the Department of Health and Human Services also said in a January 2019 report that the Office of Refugee Resettlement, the agency that assumes responsibility for the unaccompanied children once they are separated from their parents, noticed “a steep increase in the number and proportion of separated children referred from DHS” during the Trump administration. The report went on to say: “[ORR] Staff had begun informally tracking separations in 2016, recognizing that additional information and effort was required to locate parents of separated children. … ORR officials noted that, according to this tracking, the proportion of separated children rose from approximately 0.3 percent of all UAC intakes in late 2016 to 3.6 percent by August 2017.” (The report doesn’t give more recent figures than August 2017, which was eight months before the “zero tolerance” policy triggered a wave of separations.)", "More than two months after the Trump administration’s border policy was announced, and amid an intense public backlash, Trump signed an executive order on June 20, 2018, directing the DHS secretary to keep families in custody together “during the pendency of any criminal improper entry or immigration proceedings involving their members” at least “to the extent permitted by law and subject to the availability of appropriations.”", "Trump signed the executive order just six days before a federal judge issued a preliminary injunction requiring the administration to stop separating most families and to begin reunifying children in its custody with their parents — unless it was determined the parents were unfit or they voluntarily declined to be reunited with their children.", "DHS could not tell us how many children were separated from their parents during previous administrations, but the Trump administration has identified more than 2,800 children it says were possibly affected by its policies, according to a Feb. 20 court filing in a case brought by the American Civil Liberties Union. The filing notes that at least 2,735 of those children have been released from ORR custody, including 2,155 who were reunified with their parents and 580 who were released to other adult sponsors or were now 18 years old themselves. As for the other 81 children in ORR care as of Feb. 13, most of them had parents who said they wouldn’t reunite with their children or who were determined to be unfit for reunification.", "But those figures do “not represent the full scope of family separations” during the Trump administration, according to the HHS OIG.", "In its January report, the inspector general said: “The total number of children separated from a parent or guardian by immigration authorities is unknown. Pursuant to a June 2018 Federal District Court order, HHS has thus far identified 2,737 children in its care at that time who were separated from their parents. However, thousands of children may have been separated during an influx that began in 2017, before the accounting required by the Court, and HHS has faced challenges in identifying separated children.”", "Federal officials have since said that it could take another year or two to identify all of the children who were separated after entering the U.S. on or after July 1, 2017.", "The evidence shows that border enforcement policies that separated families were not the same under Trump and Obama. The policy of criminally prosecuting all illegal border crossings was unique to the Trump administration. That’s what caused the separations that Trump said he “stopped” with this executive order — it wasn’t anything Obama did.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]