["Several users on Twitter and Facebook shared an aerial image of a crowded locality. The most prominent structure in the image is a mosque. As per the viral claim, the image is from Mumbai. The state of Maharashtra has been in the news amidst actor Kangana Ranaut’s tussle with Shiv Sena. After alleged illegal construction at the actor’s office in Palli Hill was demolished by the Brihanmumbai Municipal Corporation (BMC), some social media users wonder when will mosques in the city be torn down.", "A Facebook user Vinit Hindu shared the viral image and wrote in Hindi, “In Mumbai, over 200 illegal mosques are built in the middle of thousands of roads. But BMC is only busy with Kangna’s illegal office construction. #Shameful.” This post has been shared over 3,000 times. (archived link)", "(Translated from मुंबई में 200 से ज्यादा अवैध मस्जिदें हजारों मजारें सड़कों के बीच बनी हैं! पर BMC को सिर्फ कंगना का ऑफिस अवैध निर्माण लगा! #लानत_है)", "Hindu Yuva Vahini member Yogi Devnath tweeted the viral image and wrote, “This is also illegal construction, when will Uddhav break this. (ये भी अवैध निर्माण हैं इसे कब तोड़ेंगे उद्धव).” This tweet has been retweeted close to 4,000 times. (archived link)", "Alt News performed a reverse image search and found that the image was published by Dainik Bhaskar in August. The image is a drone shot of the Katra Bazaar area in Sagar city of Madhya Pradesh. The photographer is Tonu Nirmal as per the photo credits. According to the report, the market was crowded due to the relaxation in lockdown, and the fact that festivals of Eid and Rakshabandhan were around the corner.", "When we looked for mosques in the same area on Google, we noticed that Jama Masjid (Marqaz) has the same green-coloured shed on top and is located in the middle of a crossway junction just like the mosque in the viral image.", "This slideshow requires JavaScript.", "Additionally, we compared a photo of the mosque uploaded on Google Maps with the viral image and found five visual points to authenticate that the viral image is of Jama Masjid in Sagar, MP and not Mumbai.", "1) Green shed 2) Two domes and a minaret 3) Seven windows in the same sequence 2,2,3 (from right to left) 4) Exact windows beneath the domes 5) Identical slanting wall", "Thus the social media claim that the mosque is in Mumbai is false. It’s from Sagar’s Katra Bazaar in Madhya Pradesh.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]