["Recently, an image of Jawaharlal Nehru was shared by a few users on social media, suggesting that the first Prime Minister of India was thrashed by a mob after “failure on China war” in 1962.", "In 2016, Twitter user Mahveer Mehta also circulated the image. He claimed that Nehru was thrashed by people “along J&K for failure on China war”. Mehta is followed on Twitter by PM Modi and Railway Minister Piyush Goyal’s Office. His post implied that the photograph was taken after the 1962 Indo-Sino war.", "Womaniser Nehru Was d Reason of All Problems! Along J&K, Ppl Thrashed Him 4 Failure on China War #NehruBetrayedIndia pic.twitter.com/LdrorcTysU", "— Mahaveer Mehta (@MahaveerM_) January 24, 2016", "Several other Twitter users who are followed by BJP leaders, including PM Modi have been circulating the image through the years. The oldest instance that Alt News found was from 2013.", "Several websites/blogs have also shared the same picture through the years.", "Earlier this month, the same image was shared with an altered narrative suggesting that the former Prime Minister was arrested in 1946 when he attempted to enter Kashmir without a visa. The identical claim was also shared in August 2018 by an individual user on Facebook. It attracted 3,400 shares.", "This is how Mr Ramchand Kak then PM of J&K State Kashmir arrested Nehru to enter in Kashmir without visa… How Kashmir is integral part of so called democratic India.", "Posted by Bashir Shahdhar on Friday, 31 August 2018", "Several other pages and users, including those who identify themselves as a part of “India occupied Kashmir”, circulated the photograph with the identical claim.", "Alt News cropped out the text from the image, reverse searched it on Google and found that it was published by Outlook Magazine in 2014. The photograph was captioned – “Braced for the worst: Nehru is prevented from plunging into a riotous crowd in 1962, before the war”. The picture was attributed to AP (Associated Press).", "We searched for the image in the archives of AP with the keywords “Nehru 1962” and found that it was indeed taken that year, however, the narrative used was false. AP described the image as – “A security man grabbed Indian Prime Minister Nehru to keep him from plunging into a riotous crowd at a meeting of the Congress Party in Patna, India, January 1962. Later in the year, Communist China’s attack on India plunged Nehru into new troubles.” This implies that the photograph was taken before the Indo-Sino war in 1962.", "As the image was captioned as – “meeting of the Congress Party in Patna, India, January 1962”, we looked for newspaper editions published at the time. While rummaging through January 1962 publications of The Indian Express on news.google.com/newspapers, we found an article that pertained to the incident.", "The January 6, 1962 edition of The Indian Express has an article titled – “Open Session Adjourns Amidst Disorder. Crowd Rush To Dias, Many Swoon. Nehru Appeals In Vain.”", "According to the report, on January 5, 1962, a stampede broke up the Congress plenary session as a “seething mass of humanity” was continually pressing forward to get a glimpse of Nehru. The article further mentions that Nehru, who has “handled crowds all his life” was only partially successful at controlling them. “At one stage, an angry Nehru, completely oblivious to his own safety, used his fists and hit out at security men and Congress leaders who prevented him from jumping into the crowd…”", "Another publication The Florence Times, on January 8, 1962, had also reported the incident as – “Security men hold back Indian Prime Minister Jawaharlal Nehru to prevent him from plunging into a disorderly crowd in Patna, India, Friday, in personal effort to restore order. A wild demonstration by Indian peasants broke up this meeting of Nehru’s Congress Party and set 24 persons to the hospital.”", "The articles and the Associated Press description of the image match, therefore, claims of Nehru being “thrashed by a mob due to failure on China war” are completely false.", "The other narrative used to circulate the image – “Nehru was arrested while trying to illegally enter Kashmir without a passport” – also stands untrue as we have conclusively established the origin of the photograph. In 1946, Nehru was indeed stopped from entering Kashmir to represent politician Sheikh Abdullah who started the ‘Quit Kashmir Movement’, advocating for self-rule in the state. The then Prime Minister of (the princely state of) Kashmir, Ram Chandra Kak, barred Nehru’s entry into the state and put him in arrest. However, the viral picture does not pertain to this incident.", "Images of Jawaharlal Nehru have often circulated with false narratives on social media. As with the aforementioned case, a photograph of an incident unrelated to the claims being made was notoriously shared to malign the reputation of India’s first Prime Minister. Earlier, an image of the former PM was falsely shared as him attending an RSS shakha meeting. At another instance, BJP IT Cell head Amit Malviya circulated a collage of Nehru’s photographs to portray him as an immoral man canoodling with different women.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]