["About this rating", "In December 2015, the Washington Examiner ran a column called, \"Obama and Trump are ‘Misunderestimating’ the American People.\" In the piece, which was then picked up by several other publications, the author contended: “Government statistics show that ‘hate crimes’ are directed much more frequently against Jews, the target of prejudice against the ages, than against Muslims.”", "However, no statistics nor sources were cited. With all the anti-Muslim sentiment being reported in the news, could this possibly be true?", "Hate crimes of all types are, thankfully, fairly rare. And it is true that hate crimes against Jews outnumber the number of hate crimes perpetrated against Muslims. The FBI reported that in 2014, there were 609 incidents of hate crimes against Jews and 154 against Muslims.", "Case closed? Not quite. This could, after all, be an example of lazy reporting. Sure, the raw number of hate crimes against Jews is higher, but national crime statistics are typically reported as a rate: number of crimes per 100,000 population.", "Since the U.S. is typically described as a Judeo-Christian nation, we might expect that there are far more Jews than Muslims in the United States. Perhaps when we look at the number of hate crimes as a ratio of the population of each religion in the U.S., we’d see more hate crimes against Muslims than against Jews.", "It’s more difficult to collect population figures by religion than you might think. The U.S. Census Bureau doesn’t routinely capture that information, and religion-specific websites tended to have widely varying estimates.", "Although estimates of the Jewish population in the U.S. were fairly stable across various websites, estimates of the Muslim population varied dramatically – anywhere from 2.1 million to 6.7 million. The Pew Research Center’s 2014 Religious Landscape Study seemed to offer the most reliable and objective statistics on religious affiliation in the United States.", "According to the Pew study, Jews and Muslims both represent fairly small proportions of the U.S. population, coming in at 1.9% and 0.9% of the U.S. population as a whole. With a total U.S. population of 318.9 million as of 2014, there are approximately 6.1 million Jews and 2.9 million Muslims in America.", "Easy math tells us that although there are roughly twice as many Jews in the U.S. than there are Muslims, hate crimes against Jews occur four times as often. Expressed as more official rates per 100,000 population, Jews suffer from hate crime incidents at a rate of 10.05 incidents per 100,000 population while the Muslim rate is roughly half as much, at 5.37 incidents per 100,000 population.", "Although hate crimes against Jews don’t seem to make the headlines as often, the Washington Examiner is correct: hate crimes really are directed more frequently against Jews than Muslims.", "[article-meta]", "Barone, Michael, “Obama and Trump are ‘Misunderestimating’ the American People.” Washington Examiner, 9 December 2015.\nhttp://www.washingtonexaminer.com/misunderestimating-the-american-people/article/2577989", "“2014 Hate Crime Statistics.” U.S. Federal Bureau of Investigation, Table 1.\r\nhttps://www.fbi.gov/about-us/cjis/ucr/hate-crime/2014/tables/table-1", "“2014 Religious Landscape Study.\" Pew Research Center.\r\nhttp://www.pewforum.org/religious-landscape-study/", "“American Fact Finder.” U.S. Census Bureau, 2014 population estimates.\r\nhttp://factfinder.census.gov/faces/tableservices/jsf/pages/productview.xhtml? src=bkmk", "Stephanie Larsen is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]