["About this rating", "An employee at a California location of the Buffalo Wild Wings restaurant chain muted the national anthem before a football game on 11 September 2017, the 16th anniversary of the September 11th attacks, saying the anthem was divisive and citing company policy, according to several news reports.", "Los Angeles television station KCAL reported that:", "Customers at a Buffalo Wild Wings in Eastvale say an employee refused to let them hear the anthem before an NFL game Monday night – which happened to be the 16th anniversary of the terrorist attacks on Sept. 11, 2001. A customer who identified herself as Lori said the employee refused to play the sound of the anthem for one game, but played it for the game before. When he was asked why, the employee — who was not identified -- said the anthem is too controversial, and it was company policy not to play it.", "Later, the company appeared to confirm an incident had occurred involving the national anthem at the Eastvale location and issued an apology:", "We apologize that Guests at the Eastvale, California location didn’t receive the positive sports viewing experience we strive to provide in all of our restaurants every day. This was the action of one individual and does not reflect our corporate practice. Our intent is to show game broadcasts in their entirety including the National Anthem, post-game interviews, and highlights.", "According to San Francisco Bay Area news channel KRON 4, World Wide Wings -- a Washington state-based company that operates the restaurant location in question -- also confirmed the incident in an apology sent to the channel: \"World Wide Wings, a Buffalo Wild Wings franchise, apologizes for what happened at a restaurant before the Monday Night Football game. We do not have a policy regarding this matter.\"", "Joe Janaszek, Chief Marketing Officer for World Wide Wings, told us that the employee concerned no longer works for World Wide Wings and emphasized that it was not company policy to turn down the volume during the playing of the national anthem:", "This gentleman [the employee at Eastvale], who no longer works for us, made the decision to turn the volume down during the national anthem ... He claimed it was company policy, because it was too controversial. We don't know why he did that, and we wish he hadn't done it.", "Janaszek pointed out that World Wide Wings CEO Tom Cook is a military veteran, and \"could not be more disappointed about this incident.\"", "The controversy surrounding this episode came in the midst of an ongoing public debate about the decision by some NFL players -- in particular African-American players -- to kneel during the National Anthem as a protest against police killings of unarmed African Americans.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]