["About this rating", "James Comey and Robert Mueller are former Department of Justice colleagues with a work-related friendship.", "Comey's attorney asserted the Comey and Mueller not \"best friends\", and government ethics experts say the relationship doesn't rise to the level of an illegal conflict in relation to Mueller's investigation into Russian election influence.", "On 12 June 2017, Breitbart published a article reporting that former Assistant FBI Director James Kallstrom had asserted that fired FBI director James Comey was \"best friends\" with Robert Mueller, a former Bureau director who has been appointed special counsel to lead an investigation into alleged Russian influence in the 2016 U.S. presidential election.  Furthermore, Kallstrom reportedly told Brreitbart, that relationship presents a conflict of interest which is hampering the Russia probe: \"Bob Mueller and Jim Comey are the best of friends and have been for over two decades. How do you appoint a special counsel who is a longtime friend? It’s a massive conflict of interest.\"", "Breitbart also cited a Politico piece by journalist Garrett Graff in which Graff described the pair's working relationship as follows:\nWhile Mueller technically reported to Comey as deputy attorney general, Comey, two decades his junior, treated Mueller as a close friend and almost mentor. The men had known each other for years as each rose into the small, elite fraternity of prosecutors at the top of the Justice Department\nAs to Kallstrom's comment, it should be clarified that Comey didn't appoint Mueller, and the former had been fired from his position at the FBI by President Trump by the time by Deputy Attorney General Rod Rosenstein brought Mueller on board to head the Russia investigation.\nWe spoke to Comey's attorney, who said the extent of the friendship between the two men has been exaggerated. We also consulted experts about whether a past friendship could present a perception of a current conflict. As the term \"perception\" implies, the answer to that question is subjective.\nDavid Kelley, Comey's attorney, told us that the notion Comey is \"best friends\" with Mueller is an overstatement. He said the two have a genial relationship as former colleagues, given that both men have long legal careers that involved overlapping time spent working within the Department of Justice. Their history has been well-documented by the news media, and Kelley pointed out they are not close personal friends:\nJim and Bob are friends in the sense that co-workers are friends. They don’t really have a personal relationship. Jim has never been to Bob's house and Bob has never been to Jim's house ... They’ve had lunch together once, dinner together twice, once with their spouses and once after Jim became FBI director so Bob could give him a run-down on what to look out for. [Bob] is not a mentor. He’s friendly, as colleagues are.\nFriendship or no, a pre-existing relationship doesn't mean that Mueller's role in the investigation rises to the level of the legal definition of a conflict of interest that would require recusal, said Craig Holman, government affairs lobbyist for the accountability and transparency lobbying organization Public Citizen: \"Conflict of interest means there’s some financial or pecuniary benefit that could come one's way [as a result of an investigation]. For example, If I had worked at a business and business has something at stake, that’s a conflict. But just people being friends and knowing each other, that's not a conflict.\nHana Callaghan, director of the Government Ethics Program for Santa Clara University's Markkula Center for Applied Ethics, told us she doesn't believe the pair's past ties rise to the level of a recusable event, but she added that it's not a clear-cut issue when it comes to public perception:\n[A friendship] could give rise to the appearance that [Mueller] was acting out of loyalty to his friend as opposed to the public's best interest in finding out what happened. By the same token [Mueller] has a reputation for being a fair and and impartial public servant. So it’s not a black and white question. ...\nNot knowing what their past relationship was and knowing former director [Mueller's] reputation, as an impartial public servant, I’m not sure this is a recusable event, just because they knew each other or worked together.\nNational Security attorney Mark Zaid also told us via e-mail that \"At worst, there could be a perceived appearance of a conflict to some but not an actual one. Additionally, Special Counsel Mueller has a whole team of prosecutors involved who will participate in any decisions and reports.\"\nKelley placed additional doubt on the claim by maintaining that Comey didn't have anything at stake in the investigation's outcome:\n[Comey] is merely one of many, many witnesses and frankly a witness whose credibility has been tested publicly for all to evaluate. The important thing here is Jim has been fired and he accepted that. He doesn’t have skin in this game. So where’s the conflict? A conflict speaks to how Bob would do something to benefit Jim.\nPerceptions about Mueller and Comey's shared history seem to be largely drawn along partisan lines, and the winding sequence of events shows how politically fraught the investigation has been.\nMueller was brought on board when Rosenstein came under pressure from members of Congress after he penned a letter to President Trump suggesting Comey be ousted, a suggestion the president then acted on. Rosenstein's participation in Comey's firing raised questions both about his impartiality and about obstruction of justice on the part of the president, since at the time the FBI was investigating alleged Trump campaign collusion with the Kremlin.\nAfter he was fired, Comey revealed he had written extensive contemporaneous memos documenting meetings he had with the president that made him uncomfortable. Comey recounted that Trump demanded loyalty and pressured him to back off investigating former national security adviser Michael Flynn.\nDespite the tumult, Mueller enjoys bipartisan respect as a nonpartisan, seasoned, and professional prosecutor. His selection to lead the Russia probe was initially praised by both Republicans and Democrats. But as the investigation has intensified, so too has criticism from the president and his allies. For example, in less than two days (between 15 June and mid-afternoon on 16 June 2017), President Trump posted seven separate, disparaging tweets decrying the investigation as a \"witch hunt\":\n\nI am being investigated for firing the FBI Director by the man who told me to fire the FBI Director! Witch Hunt\n— Donald J. Trump (@realDonaldTrump) June 16, 2017\n\nIn an example of how dialogue surrounding the probe has evolved, Trump surrogate Newt Gingrich tweeted praise for Mueller on the day he was appointed, saying: \"Robert Mueller is superb choice to be special counsel. His reputation is impeccable for honesty and integrity. Media should now calm down.\"\nJust one month later, Gingrich had completely changed course with a mistrustful and paranoid statement, writing that \"Mueller is setting up a dragnet of obstruction, financial questions and every aspect of Trump's life and his associates lives. very dangerous.\"", "Breitbart also cited a Politico piece by journalist Garrett Graff in which Graff described the pair's working relationship as follows:", "While Mueller technically reported to Comey as deputy attorney general, Comey, two decades his junior, treated Mueller as a close friend and almost mentor. The men had known each other for years as each rose into the small, elite fraternity of prosecutors at the top of the Justice Department", "As to Kallstrom's comment, it should be clarified that Comey didn't appoint Mueller, and the former had been fired from his position at the FBI by President Trump by the time by Deputy Attorney General Rod Rosenstein brought Mueller on board to head the Russia investigation.", "We spoke to Comey's attorney, who said the extent of the friendship between the two men has been exaggerated. We also consulted experts about whether a past friendship could present a perception of a current conflict. As the term \"perception\" implies, the answer to that question is subjective.", "David Kelley, Comey's attorney, told us that the notion Comey is \"best friends\" with Mueller is an overstatement. He said the two have a genial relationship as former colleagues, given that both men have long legal careers that involved overlapping time spent working within the Department of Justice. Their history has been well-documented by the news media, and Kelley pointed out they are not close personal friends:", "Jim and Bob are friends in the sense that co-workers are friends. They don’t really have a personal relationship. Jim has never been to Bob's house and Bob has never been to Jim's house ... They’ve had lunch together once, dinner together twice, once with their spouses and once after Jim became FBI director so Bob could give him a run-down on what to look out for. [Bob] is not a mentor. He’s friendly, as colleagues are.", "Friendship or no, a pre-existing relationship doesn't mean that Mueller's role in the investigation rises to the level of the legal definition of a conflict of interest that would require recusal, said Craig Holman, government affairs lobbyist for the accountability and transparency lobbying organization Public Citizen: \"Conflict of interest means there’s some financial or pecuniary benefit that could come one's way [as a result of an investigation]. For example, If I had worked at a business and business has something at stake, that’s a conflict. But just people being friends and knowing each other, that's not a conflict.", "Hana Callaghan, director of the Government Ethics Program for Santa Clara University's Markkula Center for Applied Ethics, told us she doesn't believe the pair's past ties rise to the level of a recusable event, but she added that it's not a clear-cut issue when it comes to public perception:", "[A friendship] could give rise to the appearance that [Mueller] was acting out of loyalty to his friend as opposed to the public's best interest in finding out what happened. By the same token [Mueller] has a reputation for being a fair and and impartial public servant. So it’s not a black and white question. ...", "Not knowing what their past relationship was and knowing former director [Mueller's] reputation, as an impartial public servant, I’m not sure this is a recusable event, just because they knew each other or worked together.", "National Security attorney Mark Zaid also told us via e-mail that \"At worst, there could be a perceived appearance of a conflict to some but not an actual one. Additionally, Special Counsel Mueller has a whole team of prosecutors involved who will participate in any decisions and reports.\"", "Kelley placed additional doubt on the claim by maintaining that Comey didn't have anything at stake in the investigation's outcome:", "[Comey] is merely one of many, many witnesses and frankly a witness whose credibility has been tested publicly for all to evaluate. The important thing here is Jim has been fired and he accepted that. He doesn’t have skin in this game. So where’s the conflict? A conflict speaks to how Bob would do something to benefit Jim.", "Perceptions about Mueller and Comey's shared history seem to be largely drawn along partisan lines, and the winding sequence of events shows how politically fraught the investigation has been.", "Mueller was brought on board when Rosenstein came under pressure from members of Congress after he penned a letter to President Trump suggesting Comey be ousted, a suggestion the president then acted on. Rosenstein's participation in Comey's firing raised questions both about his impartiality and about obstruction of justice on the part of the president, since at the time the FBI was investigating alleged Trump campaign collusion with the Kremlin.", "After he was fired, Comey revealed he had written extensive contemporaneous memos documenting meetings he had with the president that made him uncomfortable. Comey recounted that Trump demanded loyalty and pressured him to back off investigating former national security adviser Michael Flynn.", "Despite the tumult, Mueller enjoys bipartisan respect as a nonpartisan, seasoned, and professional prosecutor. His selection to lead the Russia probe was initially praised by both Republicans and Democrats. But as the investigation has intensified, so too has criticism from the president and his allies. For example, in less than two days (between 15 June and mid-afternoon on 16 June 2017), President Trump posted seven separate, disparaging tweets decrying the investigation as a \"witch hunt\":", "I am being investigated for firing the FBI Director by the man who told me to fire the FBI Director! Witch Hunt", "— Donald J. Trump (@realDonaldTrump) June 16, 2017", "In an example of how dialogue surrounding the probe has evolved, Trump surrogate Newt Gingrich tweeted praise for Mueller on the day he was appointed, saying: \"Robert Mueller is superb choice to be special counsel. His reputation is impeccable for honesty and integrity. Media should now calm down.\"", "Just one month later, Gingrich had completely changed course with a mistrustful and paranoid statement, writing that \"Mueller is setting up a dragnet of obstruction, financial questions and every aspect of Trump's life and his associates lives. very dangerous.\"", "Flynn, Daniel.   \"Comey’s Best Friend as Special Counsel ‘Massive Conflict of Interest,’ Former Assistant FBI Director Says.\"\r\n    Breitbart.   12 June 2017.", "Graff, Garrett.   \"What Donald Trump Needs to Know About Bob Mueller and Jim Comey.\"\r\n    Politico Magazine.   18 May 2017.", "Ruiz, Rebecca R. and Mark Landler.   \"Robert Mueller, Former F.B.I. Director, Is Named Special Counsel for Russia Investigation.\"\r\n    The New York Times.   17 May 2017.", "Watkins, Eli.   \"Mueller and Comey Have a History.\"\r\n    CNN.   17 May 2017.", "Barrett, Devlin, et al.   \"Special Counsel Is Investigating Trump for Possible Obstruction of Justice, Officials Say.\"\r\n    The Washington Post.   14 June 2017.", "Singer, Phil.   \"Rare Bipartisan Moment: Both Sides Embrace Robert Mueller as Special Counsel.\"\r\n    USA Today.   17 May 2017.", "Jarrett, Gregg.  \"Trump Should Demand Mueller Quit as Special Counsel.\"\r\n    Fox News.   15 June 2017.", "Painter, Richard, and Norman Eisen.   \"The White House May Claim Mueller Has Conflicts of Interest. Oh, the Irony.\"\r\n    The Washington Post.   22 May 2017.", "Samuelsohn, Darren.   \"Trump Surrogates Go After Mueller.\"\r\n    Politico.   12 June 2017.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]