["Nancy Pelosi's daughters, whatever their names might be, did not get arrested for smuggling drugs, as a series of fake news stories claimed. (AP photo)", "A series of fake news posts appearing across several websites said U.S. Rep. Nancy Pelosi’s daughters were arrested for smuggling drugs, but the articles are so inaccurate, they don’t even bother to consistently use the same fake names.", "The bogus saga of the House minority leader’s children is widespread and convoluted: Facebook users flagged a string of stories starting on July 6, 2017, appearing on wazanews.tk, as part of the social media site’s efforts to combat fake news.", "The posts all invoked Pelosi’s name, but details from story to story did not agree. Essentially, the articles said two of the California Democrat’s adult daughters had been arrested for smuggling cocaine.", "But the details of what happened after that premise was asserted varied wildly in the following days.", "At first the women were said to be caught in Berkeley, Calif., with more than 200 pounds of cocaine in their Winnebago. Later stories claimed they were apprehended at the Mexican border. The yarn went on and on, across several posts.", "The gist is that the women ran a drug ring out of a pool house, and agreed to turn on their mother after they were caught. Somehow Nancy Pelosi faced charges for ethical violations, breaking federal drug laws and committing treason. (It’s never really specified how.)", "Eventually Hillary Clinton was implicated, and the women were in protective custody when the cabin in which they were staying burned down. They turned up alive in Buffalo, N.Y., however, so all was well.", "Wazanews.tk is a website registered in Amsterdam, but the stories appeared to originate on OurLandOfTheFree.com, FreedomCrossroads.us or TheLastLineOfDefense.org, a site run by Christopher Blair. He writes absurd stories about Democrats with the goal of tricking conservative readers into believing they (and his website) are real.", "OurLandOfTheFree.com said it \"makes no guarantee that anything you find here will be based at all in reality.\" FreedomCrossroads.us has an About Us page that claims the site \"uses facts that don’t exist and relies more on imagination than the truth.\"", "The posts don’t align very well, with details varying from story to story, such as the women’s ages or even names, which change constantly.", "Sometimes the pair are called Heather and Nicole. Or maybe Julie Marie and Nicole Lynn. Or Jillian and Veronica. Or Amber and Carly. Or Louanne and Marissa.", "For the record, Pelosi’s five children are daughters Christine, Alexandra, Jacqueline and Nancy, and one son named Paul.", "At least a couple of images used on posts were actually of two women arrested for smuggling drugs. But those photos were of a pair of Scots arrested in Peru for trying to sneak cocaine to Spain in 2013.", "The grand finale is a July 9 post on TheLastLineOfDefense.org under the headline, \"Liberal troll paid $100K for Nancy Pelosi drug bust hoax.\"", "The post said George Soros paid the author to fool people for his own amusement, but that \"in the end, everyone knows Pelosi is guilty and (Hillary) Clinton is behind everything.\"", "Don’t be fooled by tales of Pelosi’s daughters being busted for drugs. It’s a fictional soap opera created to amuse trolls.", "We rate this claim Pants On Fire!", "U.S. News & World Report, \"10 Things You Didn't Know About Nancy Pelosi,\" Nov. 7, 2006", "The Herald, \"Peru drugs mule Melissa Reid to be released from prison,\" May 14, 2016", "Daily Mail, \"From jailbird to reality TV star... with a quick stop at the dole office: How Peru Two cocaine mule Michaella McCollum is making a shameless bid for stardom (and she's even got a manager),\" May 15, 2017", "PunditFact, \"If you're fooled by fake news, this man probably wrote it,\" May 31, 2017", "Wazanews.tk, \"Julie And Nicole Pelosi Dragged Into Court In Handcuffs,\" July 6, 2017", "Wazanews.tk, \"Julie And Nicole Pelosi Dragged Into Court In Handcuffs,\" July 6, 2017", "NewsFeedHunter.com, \"Pelosi Daughters Just Gave Up Their Mom To Stay Out Of Jail,\" July 6, 2017", "FreedomCrossroads.us, \"Julie And Nicole Pelosi Dragged Into Court In Handcuffs Julie And Nicole Pelosi Dragged Into Court In Handcuffs,\" July 6, 2017", "FreedomCrossroads.us, \"Pelosi Daughters Just Gave Up Their Mom To Stay Out Of Jail,\" July 6, 2017", "OurLandOfTheFree.com, \"Nancy Pelosi Taken From Her Home By DEA After Her Own Daughters Sold Her Out,\" July 6, 2017", "OurLandOfTheFree.com, \"Pelosi Daughters Drug Arrest: They Gave Up More Than Just Their Mom-More Arrests Coming,\" July 7, 2017", "OurLandOfTheFree.com, \"Pelosi Girls Drug Ring Update: Nicole Pelosi Says ‘Hillary Clinton Stood In The Room’,\" July 7, 2017", "Wazanews.tk, \"Pelosi Daughters Drug Arrest: They Gave Up More Than Just Their Mom-More Arrests Coming,\" July 7, 2017", "Wazanews.tk, \"Nancy Pelosi Taken From Her Home By DEA After Her Own Daughters Sold Her Out,\" July 7, 2017", "TheLastLineOfDefense.org, \"Bodies In Cabin Fire Identified As Marshals Assigned To Protect Drug-Smuggling Pelosi Girls,\" July 8, 2017", "OurLandOfTheFree.com, \"Nancy Pelosi’s Missing Drug-Smuggling Daughters Found Alive,\" July 8, 2017", "Wazanews.tk, \"Nancy Pelosi’s Missing Drug-Smuggling Daughters Found Alive,\" July 8, 2017", "Wazanews.tk, \"Bodies In Cabin Fire Identified As Marshals Assigned To Protect Drug-Smuggling Pelosi Girls,\" July 8, 2017", "TheLastLineOfDefense.org, \"Liberal Troll Paid $100K For Nancy Pelosi Drug Bust Hoax,\" July 9, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]