["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "MSNBC host Ed Schultz ties falling middle class incomes to a drop in union membership.", "In the days before workers rejected an attempt to unionize a Volkswagen plant in Chattanooga, Tenn., MSNBC host and union supporter Ed Schultz attempted to underscore what he thought was at stake.", "\"If it fails, it could be a major setback for workers all across this country,\" Schultz told viewers.", "Schultz then pointed to a chart showing two lines that headed down over time. One was the percentage of union workers and the other was, in his words, \"middle class income.\"", "\"Quite the parallel there, isn’t there?\" Schultz said. \"When union membership goes down, so do wages. This vote is a pivotal moment for union workers in this country.\"", "Schultz, who did not respond to our requests for comment, is right to point out that union membership affects wages. But his wording takes things a little too far. We’ll explain why in this fact-check.", "How unions affect wages", "We found the chart that Schultz had on his show. It comes from the Center for American Progress, a liberal advocacy group, and shows the percentage of union workers falling from about 28 percent in 1967 to about 11 percent today. In the same period, the share of the nation’s income going to the middle 60 percent of households declined from 52.3 percent to 45.7 percent.", "That seems to support Schultz’s claim, but actually it doesn’t prove his point. First, he talked about wages and the chart talks about the share of the national income, which is different. One is money in your pocket and the other is money in your pocket compared to the money in rich peoples’ pockets. In fact, according to the Pew Research Center, a reliable source of neutral number crunching, household median income rose between 1967 and 2012 by about $7,000 after accounting for inflation.", "If you want to find the strongest evidence for Schultz’s statement, you have to look at the wages for men. Work by economists Michael Greenstone and Adam Looney finds median wages for men slipped slightly starting in 1970 and have remained stagnant ever since.", "But while wages and union membership might have fallen (or flatlined) at the same time, it doesn’t mean one caused the other. That’s where independent research picks up.", "Most analysts have looked at Schultz’s claim from another angle, by seeing if unions raise wages.", "The research shows generally, yes. We found near consensus that unions tend to deliver higher pay for their members.", "\"Unions raise wages for people in the middle of the skills distribution about 10 to 15 percent,\" said David Card, one of the leading economists in this field at the University of California-Berkeley.", "Card’s work is full of daunting equations and statistical techniques, but within those, he teases out the role a person’s skill level plays. Card has found that people with higher skills are less inclined to join unions and that union employers tend to avoid lower-skilled workers. That means the biggest impacts of unions are felt among people in the middle.", "Another leading researcher, David Macpherson at Trinity University, uses data from the federal government’s Current Population Survey to produce a database called Unionstats.com. In the latest numbers for 2013, Macpherson finds unions play a larger role in shaping wages in the private sector than in the government sector.", "\"The union premium is about 20 percent in the private sector,\" Macpherson said. \"While in the public sector, it’s about 9 percent.\"", "Any number, however, has caveats and is imprecise, economists told us. They point to holes in the data and the challenge of separating the impact of unions compared to other macroeconomic forces, such as global competition. There’s also evidence the union effect has dropped over time. Still, according to the experts we reached, unions are good for their members.", "For the record, economist John DiNardo at the University of Michigan studied companies where unionization votes -- both for and against -- were very close. DiNardo found that it didn’t really matter whether workers approved or rejected unions. Wages in both kinds of companies followed the same path.", "Where Schultz goes too far", "So there is broad consensus that unions are typically good for people who join them in that it results in increased wages.", "But Schultz’s claim was broader than that.", "He said that when union membership goes down, people not only lose the potential to earn more -- their wages drop. And that happens regardless of whether you had the chance to join a union or not.", "That’s a trickier claim to substantiate, but there are some theories on how that could happen.", "Labor economist Richard Freeman at Harvard University speaks of the \"threat effect\", that is, when non-union employers raise wages to avoid a successful union vote by their workers. Freeman found evidence of companies raising wages to undermine union growth in the 1950s and 1960s when unions were strong. But today is a different story, he said.", "\"To go from those situations and show they affect the whole economy is a stretch,\" Freeman said. \"Schultz's claim is plausible, and it may be right, but we don't really know the magnitude of the spillover.\"", "Other powerful forces are also at play, Freeman said. Global competition and much greater use of technology hurt some workers and helped others. There is no consensus on the role unions by themselves played over the decades.", "On one end, there is the work of Macpherson and his colleagues. Macpherson looked at how much of the nation’s total income went to workers since the mid 1960s. It has gone up a bit and down a bit, but generally it held steady even as the percentage of union workers fell.", "\"I don’t see any evidence that wages across the board went down as union membership declined,\" Macpherson said.", "But Macpherson’s data didn’t look at the distribution of those wages. A CEO’s pay was mixed in with that of a store clerk.", "Other researchers have focused on how pay is spread around. Sociologists Jake Rosenfeld at the University of Washington and Bruce Western at Harvard concluded that men who work full-time would be doing appreciably better if union membership hadn’t fallen since the 1970s.", "How much better? Rosenfeld said if more men -- again, it’s the male workers -- had belonged to unions, their yearly wages would have increased about $2,600.", "Card at the University of California had similar results.", "\"The decline in unionization has reduced wages for people in the middle relative to those in the top,\" Card said.", "Setting aside the matter of unions and income inequality, here is one point on which Rosenfeld, Macpherson and Freeman generally agree. The impact of unions depends heavily on the nature of the work and where it takes place. When unions are strong in a particular industry and a particular region, Rosenfeld said it raises the bar and non-union managers tend to mimic their neighbors.", "\"If that (other) firm happens to be union, then you're paying union-level wages regardless of whether your company is organized,\" Rosenfeld said.", "\"Was Ed Schultz right to say that 'when union membership goes down, so do wages?' \" Rosenfeld said. \"Sure -- for union members and for those non-members who worked in areas and occupations where labor was strong. For everyone across the whole economy? Probably not.\"", "Our ruling", "Schultz said when union membership goes down, so do wages. Schultz emphasized that \"all workers\" have a stake in this and his chart tied union membership to the income of everyone in the middle class.", "Schultz would have done better to have talked about the distribution of income rather than wages. His claim is most likely to be true for male union workers and only partly true for non-union workers. Even for union workers, other factors such as globalization and technology have diminished the union effect. The ability of unions to push up wages for workers outside the union is limited to certain industries that operate in the same region.", "Schultz’s statement has a measure of truth but in today’s economy, the data don’t support the strong tie he suggests between unions and wages overall. We rate the claim Half True.", "MSNBC, The Ed Show, Feb. 12, 2014", "Econometrica, The effect of unions on the structure of wages: A longitudinal analysis, July 1996", "Scholars Strategy Network, Union decline and rising U.S. wage inequality, March 2012", "Journal of Labor Research , Unions and Wage Inequality, Fall 2004", "American Progress, Latest Census data underscore how important unions are for the middle class, Sept. 17, 2013", "Pew Research Center, Four takeaways from Tuesday’s Census income and poverty release, Sept. 18, 2013", "Economic Policy Institute, Union wage premium by demographic group, 2011", "Milken Institute Review, Trends, Third Quarter 2011", "National Bureau of Economic Research, What Do Unions Do?: The 2004 M-Brane Stringtwister Edition, June 2005", "National Bureau of Economic Research, What Effect do Unions Have on Wages Now and Would 'What Do Unions Do' Be Surprised?, September 2003", "National Bureau of Economic Research, Economic impacts of unionization on private sector employers 1984-2001, June 2004", "Reuters, After rejecting UAW, VW workers may still get works council, Feb. 16, 2014", "Unionstats.com", "Email interview, Heidi Shierholz, economist, Economic Policy Institute, Feb. 13, 2014", "Interview, David Macpherson, economist, Trinity University, Feb. 17, 2014", "Email interview, David Card, economist, University of California - Berkeley, Feb. 17, 2014", "Email interview, Richard Freeman, economist, Harvard University, Feb. 13, 2014", "Email interview, Jake Rosenfeld, sociologist, University of Washington, , Feb. 17, 2014", "Email interview, Michael Saltsman, research director, Employment Policies Institute, Feb. 13, 2014", "Email interview, David Blanchflower, economist, Dartmouth College, Feb. 13, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]