["House Speaker Nancy Pelosi is one of the richest members of Congress, but a social media post circulating about the wealth she has built while earning a congressional salary is wrong about her net worth.", "The post claims Pelosi has been in office for 28 years, during which she earned $193,400 per year. That math adds up to about $5.4 million, according to the post, which goes on to claim that Pelosi’s net worth is $196,299,990", "The meme quotes Pelosi: “Something is wrong with this picture.”", "In fact, several things are wrong. Pelosi entered Congress in 1987 — 34 years ago, not 28 — and the meme has the wrong current salary for the House speaker. A review of Pelosi’s most recent financial disclosure shows that it got her net worth wrong, as well.", "It also ignores that Pelosi’s husband, Paul Pelosi, owns and operates a San Francisco-based investment firm.", "The Facebook user who shared the meme did not respond to a request for comment.", "Pelosi routinely ranks among the richest members of Congress when the Center for Responsive Politics compiles and analyzes financial disclosure forms that members of Congress are required to file.", "The net worth number in the misleading meme is attributed to the group, but it appears to be from the organization’s 2010 report, not its most recent 2018 data.", "Because Congress members are required only to disclose a range of values for their assets and liabilities, the Center for Responsive Politics provides a minimum and a maximum net worth for each member. It calculates an average of those two numbers to determine an estimated net worth.", "While the meme uses Pelosi’s maximum net worth from 2010, the average is nearly half that: about $100 million.", "More:Fact check: Rep. Alexandria Ocasio-Cortez's net worth is not close to $1 million", "The center has not released a report yet on 2019 filings, but a USA TODAY review of Pelosi’s report filed in August 2020 shows that, on the low end, Pelosi could be nearly $40 million in the hole. Her maximum net wealth could be as much as about $251 million.", "Using the Center for Responsive Politics method of averaging the two leaves a net worth of about $106 million. That’s about $90 million less than the figure cited in the meme.", "Pelosi has been in Congress since 1987, when members were paid $89,500. Today, as speaker, Pelosi earns $223,500. As minority leader, Pelosi would have earned the $193,400 spelled out in the meme.", "But her salary from a 34-year career in Congress, including 18 years as minority leader and speaker, doesn’t tell the whole story about the personal wealth she and her husband have built.", "California business records show Paul Pelosi as owner of Financial Leasing Services Inc. Paul Pelosi also paid about $12 million for the California Redwoods, a professional football team in the now-defunct United Football League, according to The Washington Post.", "More:Fact check: Nancy Pelosi's husband's investments unrelated to Joe Biden's executive order", "Financial disclosures show that Pelosi has millions of dollars in real estate investments, business partnerships and stock holdings.", "A Napa, California, home and vineyard the California Democrat owns is worth between $5 million and $25 million and generated between $100,001 and $1 million in income from grape sales, according to her 2019 report.", "The couple also own several commercial properties that generate rental income in that same range and hold investments in undeveloped real estate.", "While assets listed on the form total between $57 million and $271 million, liabilities range from $20 million to $97 million. Liabilities include multimillion-dollar mortgages on several properties and equity credit lines.", "Pelosi’s office did not immediately respond to a request for comment.", "The claim that House Speaker Nancy Pelosi is worth more than $196 million while working on a $193,000 salary is FALSE. Financial disclosures show that Pelosi’s net worth isn’t close to $196 million, and the salary used in the post is wrong. Pelosi earns $223,500 a year as speaker and is worth about $106 million, using the method the Center for Responsive Politics outlines for calculating net worth of Congress members.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook."]