["About this rating", "Voting in the 2020 U.S. Election may be over, but the misinformation keeps on ticking. Never stop fact-checking. Follow our post-election coverage here.", "One of the many claims U.S. President Donald Trump repeatedly made in his futile attempt to overturn his loss to Democratic rival Joe Biden in the 2020 general election was to assert that his own popular vote total was indicative of a \"rigged election.\" How could he possibly have lost in 2020, Trump reasoned, when he received some 11 million votes more than he did in 2016, when he won?", "\"Perhaps the biggest difference between 2016 and 2020 is @FoxNews, despite the fact that I went from 63,000,000 Votes to 75,000,000 Votes, a record 12,000,000 Vote increase. Obama went down 3,000,000 Votes, and won. Rigged Election!!!\"", "The answer to this question is a simple one: Neither the voting-age population of the U.S., nor the percentage of that population that actually turns out to vote, is a constant. Those figures can -- and do -- vary widely from election to election.", "It is true that former U.S. President Barack Obama won reelection in 2012, despite garnering some 3.5 million fewer votes that year than he did when he was initially elected in 2008. Why? Largely because some 2.2 million fewer people turned out to vote in 2012 than in 2008. (Obama still received well over 50% of the popular vote in both years, nonetheless.)", "And it is true that Trump was elected President in 2016 after receiving about 63 million votes, yet lost his reelection bid in 2020 despite receiving over 11 million more votes than he had in the previous election. How did this happen? For two very important (and obvious) reasons that Trump consistently overlooks or ignores:", "1) Voter turnout skyrocketed between 2016 and 2020, rising from 55.7% of eligible voters in the former year to 66.7% in the latter -- a difference of some 22 million additional voters. So even though the increased turnout brought Trump an additional 11 million votes, it also brought another 11 million votes cast for someone other than him.", "2) Popular vote doesn't determine the election winner; electoral votes do. Trump won the presidency in 2016 despite receiving some 3 million fewer votes than Hillary Clinton nationwide, because he managed to pull of narrow victories in three key states: Pennsylvania, Michigan, and Wisconsin.", "In 2020, however, Trump's popular vote deficit was over twice as large as the previous election (he received some 7 million fewer votes than winner Joe Biden), and, more crucially, he lost all three of the key states he had managed to capture in 2016 as they flipped back to blue:", "The fact that far fewer voters cast their ballots for third-party candidates in 2020 than in 2016 also seems to have worked against Trump, as his Democratic opponent in 2020 (Biden) tallied over 15 million more votes than his Democratic opponent in 2016 (Clinton) had -- a figure constituting far more than half of the 22 million additional ballots cast in 2020 over 2016.", "David Mikkelson founded the site now known as snopes.com back in 1994 as a creative outgrowth of his wide-ranging interests in a variety of subjects (particularly folklo ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]