["The video was published on Facebook here on January 10, 2021. It has been viewed more than 1,200 times.", "The 24-second video shows various items on a boat and then the ocean waters filled with floating debris. A man’s voice can be heard listing items in a heap, “children’s shoes, a bag, a wallet,” then he said in Indonesian, “This is all human flesh.”", "The Facebook post’s Malay caption translates to English as: “Oh God this is all human skin.”", "The Facebook user wrote in the comment section that she believed it was a footage of the Sriwijaya Air plane crash.", "The post was posted shortly after Sriwijaya Air flight SJ182 crashed into the sea just minutes after taking off from the Indonesian capital of Jakarta on January 9, 2021, as AFP reported here.", "The video also appears with a similar claim in Indonesian here on Facebook, here on TikTok and here on YouTube.", "The claim, however, is false.", "A reverse image search on Yandex with video keyframes extracted using digital verification tool InVID-WeVerify found a longer version of the footage published on YouTube here on November 1, 2018.", "Translated to English, the Indonesian-language title of the one-minute, 35-second video reads: “Goodbye little brother/sister [Casualties of airplane Lion Air JT-610 / PK-LQP] - Tugboat AS JAYA 11”.", "The caption reads: “Tug Boat AS JAYA 11, which sailed from Pulang Pisau regency, Central Kalimantan province towards Marunda, was the first ship to approach the wreckage of the Lion Air JT-610 plane and became witness to the crash of the plane.”", "The part seen in the misleading video matches the YouTube video’s 0:23 mark.", "On October 29, 2018, Indonesia’s Lion Air flight JT 610 crashed into the Java Sea after taking off from Jakarta’s airport, killing all 189 passengers and crew, as AFP reported here.", "Below is a screenshot comparison of the video from the misleading post on Facebook (L) and the YouTube video (R):", "Indonesian TV broadcasters tvOne and Metro TV published video reports, such as this, this and this, noting that the crew of an Indonesian tugboat witnessed the Lion Air crash and helped the search and rescue team recover the wreckage.", "At the 3:59 mark of this video report, posted on the YouTube channel of Indonesian online media Kumparan, on October 30, 2018, its reporter holds a red children’s shoe, as seen in the start of the misleading video.", "The other clips shared in the misleading YouTube post, claimed to be footage from the Sriwijaya Air plane crash, have been debunked by AFP here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]