["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Democrat Jon Ossoff debated alone on Dec. 6 in Atlanta. His opponent, Sen. David Perdue, R-Ga., declined to participate. (AP)", "We found no evidence that Perdue has held open town halls during his nearly six years in the Senate.", "He does offer meetings with political action committees that make annual donations to his campaign.", "In a debate where he appeared alongside an empty lectern, Democrat Jon Ossoff attacked his absent Republican opponent, saying Georgia Sen. David Perdue hasn’t been accessible to his constituents and has sold his time for donations from political action committees.", "Perdue \"hasn't held a single public town hall meeting in six years,\" Ossoff declared Dec. 6. \"He openly sells access for corporate PAC checks. He sells four meetings a year and a retreat on a private island for a $7,500 corporate PAC check.\"", "Perdue’s campaign manager has indicated the first-term senator won’t do any debates with Ossoff ahead of their Jan. 5 runoff election. Along with another Georgia runoff the same day, which pits Democrat Raphael Warnock against GOP Sen. Kelly Loeffler, the race will determine which party controls the Senate.", "As for town halls, Perdue’s Senate office did not cite any that Perdue has held.", "Ossoff’s claim about donor access refers to a solicitation for a Perdue campaign fundraising event. That invitation shows political action committees that contributed $7,500 annually (not a single contribution) would qualify to attend quarterly events and an annual \"sea island retreat.\"", "A town hall, as it’s typically understood, is a meeting that is publicized in advance and open to the public, in which the elected representative answers questions from members of the public that are not screened. Traditionally, these have been in-person events, but particularly since the onset of the COVID-19 pandemic, more have been held online.", "We found no evidence that Perdue has held such a meeting, and his office didn’t offer any.", "Ossoff has been making the town halls claim about Perdue since at least August, and we found several media reports about Perdue not holding public forums.", "In May, the student-run Harvard Political Review reported that Perdue had not held any town halls since he took office in January 2015. Atlanta TV station WGCL reported in August about Perdue’s lack of accessibility to the public, and noted the Harvard story. In September, Atlanta TV station WXIA referred in a news report to a 2017 Perdue event that drew protesters. It didn’t describe the event, but said Perdue hasn’t held a town hall since then.", "Perdue’s staff did not respond to those reporters for those stories. But in 2017, Perdue told reporters he had held \"impromptu\" town hall meetings while making an unannounced visit to the state Capitol, and that he prefers holding meetings with individuals or small groups.", "The nonprofit Town Hall Project told PolitiFact that Perdue has not held a public town hall since it began tracking town halls held by members of Congress in January 2017. The project uses staff and volunteer researchers to track lawmakers’ public schedules, subscribe to their newsletters, follow them on social media and visit their websites, said executive director Nathan Williams.", "According to the Town Hall Project, a meeting is a town hall if it is open to the public and the press; announced with at least 24 hours’ notice; and has at least 30 minutes of open questions and answers; that is, the questions are not screened.", "Perdue's Senate office told PolitiFact that he regularly participates \"in public events and local visits to hear directly from\" constituents. The office did not cite any town hall event, either in person or online, but said Perdue has held \"constituent conference calls\" since taking office, including weekly calls during the COVID-19 pandemic.", "It’s not clear whether those calls were publicized in advance or whether constituents were allowed to ask Perdue questions that weren’t screened by staff. His office didn’t comment on those issues.", "To back the second part of Ossoff’s claim, his campaign cited a two-part tweet from Dave Levinthal, who was then an editor-at-large for the nonprofit Center for Responsive Politics and is now a Washington correspondent for Business Insider.", "The June 5, 2019, tweet showed images of an invitation to a Perdue fundraising event the same day that was hosted by Perdue Victory, a joint fundraising committee of Perdue’s campaign and One Georgia PAC, which is affiliated with Perdue.", "The invitation solicited annual donations at three levels from individuals and political action committees for the Boardroom, an effort helping Perdue’s 2020 re-election run. At the top level, called \"Chairman,\" a PAC donating $7,500 per year or an individual donating $5,400 per year would be invited to an annual retreat at Sea Island, a private community on St. Simons Island in Georgia, including a reception at Perdue’s residence; \"invitations to special events throughout the year\"; \"quarterly events\"; and an \"end-of-year thank you.\"", "Images of a fund-raising solicitation to support Sen. David Perdue's reelection campaign were posted on Twitter by journalist Dave Levinthal:", "The invitation did not say whether Perdue would be at all the events. Perdue’s office did not comment on the fundraising solicitation, and his campaign did not respond to requests for comment.", "WXIA-TV reported in February 2020 that on Feb. 13, 2019, Perdue attended a meeting of his Boardroom donors, and did not attend a Senate hearing held at the same time by two Armed Services subcommittees on substandard military housing at Georgia’s Fort Benning and other facilities nationwide. Perdue is a member of one of the subcommittees.", "Perdue’s office released a statement saying the senator \"has taken strong action to improve military housing at bases in Georgia,\" but didn’t address his scheduling on Feb. 13, 2019, according to the news report.", "Ossoff said Perdue \"hasn't held a single public town hall meeting in six years\" and \"sells four meetings a year and a retreat on a private island for a $7,500 corporate PAC check.\"", "Perdue’s office said the senator has held weekly conference calls with constituents. But we found no evidence that Perdue has held a town hall — a meeting publicized in advance, open to the public and allowing the public to ask him unscreened questions — since he took office in January 2015.", "An invitation to a 2019 campaign fundraising event for Perdue offered political action committees that made an annual donation of $7,500 access to an annual retreat at Perdue’s residence in a private community on St. Simons Island, Ga., as well as access to  quarterly meetings and other events, though it was not clear whether Perdue himself would attend each event.", "We rate the statement Mostly True.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more.", "Rev.com, Jon Ossoff debate (18:02), Dec. 6, 2020", "Email, Jon Ossoff campaign spokeswoman Miryam Lipper, Dec. 9, 2020", "Email, David Perdue Senate office spokeswoman Cherie Gillan, Dec. 10, 2020", "Email, Nathan Williams, executive director, Town Hall Project, Dec. 10, 2020", "Sen. David Perdue, news release, June 25, 2020", "WGCL-TV, \"Campaign 2020: Trying to connect to Senator Perdue,\" Aug. 14, 2020", "Harvard Political Review, \"Health Care, a Private Island, and the STOCK Act: Two Senate Races Play Out in Georgia, Part I,\"  May 27, 2020", "Atlanta Journal-Constitution, \"Protesters continue to press Georgia’s Perdue to hold town halls,\" April 12, 2017", "WXIA-TV, \"Sen. David Perdue's stealth campaign,\" Sept. 4, 2020", "WXIA-TV, \"Sen. Perdue attends donor event, skips hearing on military families,\" Feb. 3, 2020", "Twitter, two-part tweet by Dave Levinthal, then editor-at-large with the Center for Public Integrity, June 5, 2019", "Forbes, \"After Insider Trading Probe, Loeffler Offers Donors Access In ‘Co-Investor Program,’\" June 11, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]