["By Angelo Fichera", "Posted on November 3, 2020", "A viral blog post falsely claims that an “Antifa flyer” shows that left-wing activists are planning to masquerade as supporters of President Donald Trump and riot following the election. The purported flyer cited as evidence has been around since 2017.", "Amid concerns of potential Election Day violence, a blog post spreading on social media is using a years-old “Antifa flyer” to suggest that left-wing activists will be committing violence while dressed as supporters of President Donald Trump.", "“Antifa gearing up for false flag violence disguised as Trump-supporters,” reads the headline on AmericanThinker.com. The Nov. 3 post was shared on Facebook more than 8,000 times, according to analytics data from CrowdTangle.", "Antifa, as we’ve written, is an umbrella term for far-left anti-fascism groups.", "The American Thinker post claims that “progressive fascists appear to have a plan in place to make (the violence) even worse: disguising their rioters as Trump-supporters in order to make the case that Donald Trump truly is a dictator that must be violently overthrown if he wins or arrested.”", "Its sole evidence is a screenshot of a supposed “Antifa flyer” that the website claims was procured by a “source that has always been reliable.”", "But, in fact, the same supposed flyer has been circulating since 2017, as other fact-checking organizations have previously found.", "The “flyer” is addressed to “ANTIFA COMRADES!” and says: “On Nov. 4, don’t forget to disguise yourselves as patriots/Trump supporters.” It suggests wearing MAGA hats and U.S. flags.", "Reporter Will Sommer documented the existence of the image in a Medium post on Oct. 31, 2017, about a conspiracy theory that left-wing activists would try to overtake the country on Nov. 4, 2017. He referred to such images as “fabricated ‘planning documents’ that urge antifa guerrillas to commit violence while posing as police or Trump supporters.”", "And the specific Facebook post of the flyer that is captured in the screenshot shared by American Thinker was shared as an apparent joke.", "Snopes two months ago tracked down the user who made the Facebook post in question (the flyer was shared with the comment, “Election Day nears Comrades!!! Prepare to defend your rights!!”) on a page called “Hickman County Antifa.” The original post is no longer available.", "That user told the website: “Hickman County Antifa was a satire page, either the creator or Facebook took it down, that post was just a bad joke. I deleted soon after it got shared because it made a lot of people freak out more than I expected, nobody in the group was really actually connected, we were just sharing dumb antifa memes.”", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here for more.", "Ferkenhoff, Eric. “Fact Check: Antifa Is NOT Calling For Election Rioting By Members Dressed As Trump Supporters — It’s An Old Post That Was Shared As Satire. And It Gets The Election Date Wrong.” Lead Stories. 15 Sep 2020.", "Ibrahim, Nur. “Did an Antifa Flyer Tell ‘Comrades’ To Pose as Trump Supporters and Riot After Election Day?” Snopes. 4 Sep 2020.", "Pegues, Jeff. “Cities across U.S. bracing for possible Election Day violence and unrest.” CBS News. 2 Nov 2020.", "Robertson, Lori. “Trump Can’t Designate Antifa — or Any Movement — Domestic Terrorist Organization.” FactCheck.org. 1 Jun 2020.", "Sommer, Will. “How the ‘November 4’ conspiracy theory took over the pro-Trump internet.” Medium. 31 Oct 2017.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]