["About this rating", "Louisiana resident Tessica Brown put Gorilla Glue in her hair, causing it to become cemented to her head for weeks. TMZ recorded the surgery procedure removing the glue from Brown's hair.", "Brown stated that she has never expressed interest in suing Gorilla Glue over the incident. Her talent management company confirmed she is not suing.", "Why no rating on this article? This is a trending topic but has not yet been rated by Snopes for reasons we’ll outline below.", "In early February 2021, Louisiana resident Tessica Brown posted a video to her profile on the social media platform TikTok in which she stated that she put Gorilla Glue in her hair to hold the style after running out of Got2Be Glued spray, her regular styling product:", "Brown said that as the result of putting the glue on her hair, it's been frozen solid for a month, despite many attempts to get it out with no success. In other pictures and videos, Brown said she went to the emergency room at St. Bernard's Parish Hospital in Chalmette, Louisiana, seeking medical help with the glue.", "A representative from Brown's talent management told Snopes in an email that Brown left the hospital with the glue still in her hair.", "Gina Rodriguez, Brown's talent manager, told Snopes in an emailed statement, \"She is flying out to Los Angeles this week to meet with Beverly Hills plastic surgeon Dr. Michael Obeng. He will be removing the glue.\"", "On Feb. 11, 2021, celebrity news outlet TMZ published video of Obeng performing the procedure that finally removed the glue from Brown's hair.", "Although there have been reports that Brown may sue Gorilla Glue as a result of her experience, Brown stated she has never voiced her intent to do so. Her management company confirmed in an email to Snopes that Brown is not suing Gorilla Glue.", "In a statement posted to the company's official Facebook page, Gorilla Glue said the product was \"not indicated for use on hair\" because once applied, it is \"considered permanent.\" It said that the can containing the spray adhesive used by Brown has a caution label warning against swallowing the glue or getting it in one's eyes or on one's skin or clothing.", "The company added that the glue \"is used for craft, home, auto or office projects to mount things to surfaces such as paper, cardboard, wood, laminate and fabric.\"", "Brown's videos about her plight have gone viral. Her original video was viewed more than 21 million times on TikTok alone. She launched a GoFundMe crowdfunding campaign for her medical expenses.", "A GoFundMe for Brown raised more than $20,000 to cover her medical expenses, but Obeng performed the procedure free of charge. Brown's management company confirmed in an email to Snopes that Brown is donating $20,000 to the Restore Foundation, which provides reconstructive surgery to those in need.", "Updated with further information about Brown's procedure, reports that she considered suing Gorilla Glue, and her plans to donate most of her GoFundMe money.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]