["About this rating", "Rumors are surging in the wake of George Floyd's death and resulting protests against police violence and racial injustice in the United States. Stay informed. Read our special coverage, contribute to support our mission, and submit any tips or claims you see here.", "A number of tweets and posts began circulating online in June 2020, unearthing old posts from the Obama Foundation and alleging a conspiracy connecting the foundation to George Floyd. Floyd, an unarmed Black man, died on May 25, 2020, after a Minneapolis police officer held him down and kneeled on his neck. Protests around the country against police brutality followed, with some people carrying posters with Floyd's face to commemorate him.", "In early June, social media users stumbled upon an Obama Foundation tweet dated May 17 that featured a photograph of a poster with Floyd's face on it. They questioned how the photo could have been shared days before Floyd's death and how a Twitter post allegedly could be edited retroactively:", "The Hal Turner Radio Show, a far-right program, said about this and some other tweets that featured the same image, \"Something stinks here.\" Some social media users speculated that the foundation somehow knew in advance that Floyd would die.", "This rumor has no truth to it. The Obama Foundation's tweets shared links to its website, Obama.org. The preview image for that page updates dynamically on Twitter when the platform's web crawlers (bots) re-index (restructure the website data for) the preview image for the website every week.", "In other words, at a certain point following Floyd's death the foundation changed the Twitter Card image for the website, which retroactively updated the image on past tweets. A Twitter spokesperson told Snopes that the image shown in the card updates when the foundation updates the data used to generate the card. The group did not edit the tweet, according to the spokesperson, but may have changed the data associated with the link. This is the image shared on May 16, in a screenshot:", "We reached out to the Obama Foundation to ask about the photo on June 8. On June 9, the image from the May 16 post had been changed to the foundation's logo:", "An Obama Foundation spokesperson confirmed for us that the rumor is false, and that the preview image for Obama.org updates dynamically based on information set in the link. The photograph of the poster with Floyd's face on it was taken on May 30, 2020, according to the foundation, and was first used on the site on May 31.", "We therefore rate this claim as \"False.\"", "Cheung, Helier.   \"George Floyd Death: Why US Protests Are So Powerful This Time.\"\r\n   BBC News.   8 June 2020.", "Hal Turner Radio Show.   \"How Did the Obama Foundation Tweet a George Floyd Poster on May 17, When He Wasn't Killed Until May 25?\"\r\n   6 June 2020.", "Southern Poverty Law Center.   \"Hal Turner.\"", "True Pundit.   \"WATCH: Suspicious Mystery Grows Debating Obama’s Tweeted Photo of George Floyd NINE DAYS Before His Death.\"\r\n   9 June 2020.", "Nur Nasreen Ibrahim is a reporter with experience working in television, international news coverage, fact checking, and creative writing.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]