["About this rating", "About 50 American nuclear weapons are stored at the U.S. Incirlik Air Base in Turkey, and new tensions between the U.S. and Turkey have made it more complex to remove them from that base.", "However, the United States remains in possession of the weapons on its base and can elect to remove them from Incirlik at will.", "In mid-October 2019, frightening headlines circulated online implying that Turkey had taken hold of 50 nuclear weapons owned by the United States, and that the weapons were being held \"hostage.\"", "An example of such headlines warned, \"Turkey holding 50 US nuclear bombs ‘hostage.'\" Various such stories were picked up by a number of websites. These stories were aggregated selectively from an Oct. 14, 2019, New York Times report in which the term \"hostage\" is used to describe the status of the weapons.", "The report reflects new tensions at the border of Turkey and northern Syria after President Donald Trump abruptly pulled U.S. troops from their positions supporting Kurdish allies in that region, where troops had been fighting with Islamic State terrorists. Trump's actions precipitated a deadly attack by Turkey against the Kurds.", "Trump's decision also drew sharp bipartisan rebuke and resulted in a deterioration of U.S. relations with Turkey, including economic sanctions imposed by the Trump administration and reports that American troops came under Turkish fire.", "The escalation drew attention to the long-standing concern that some 50 nuclear weapons are stored at the U.S. air base in Incirlik, just dozens of miles from the Syrian border. Some have for years expressed concerns about the security of those weapons, citing instability in the region. The Times reported:", "And over the weekend, State and Energy Department officials were quietly reviewing plans for evacuating roughly 50 tactical nuclear weapons that the United States had long stored, under American control, at Incirlik Air Base in Turkey, about 250 miles from the Syrian border, according to two American officials.", "Those weapons, one senior official said, were now essentially Erdogan’s hostages. To fly them out of Incirlik would be to mark the de facto end of the Turkish-American alliance. To keep them there, though, is to perpetuate a nuclear vulnerability that should have been eliminated years ago.", "“I think this is a first — a country with U.S. nuclear weapons stationed in it literally firing artillery at US forces,” Jeffrey Lewis of the James Martin Center for Nonproliferation Studies wrote last week.", "For his part, Mr. Erdogan claims nuclear ambitions of his own: Only a month ago, speaking to supporters, he said he “cannot accept” rules that keep Turkey from possessing nuclear weapons of its own.", "The report, which came just after Turkey's invasion of northern Syria, raised the potentially disastrous specter of the Turkish government taking hold of American nukes.", "It's not an impossible scenario, but it's unlikely, said Jeffrey Lewis, director of the East Asia Nonproliferation Program at the James Martin Center for Nonproliferation Studies at the Middlebury Institute of International Studies at Monterey, a private graduate school in Vermont. And describing the weapons as \"hostages\" is metaphorical. The weapons are not literally being held \"hostage\" by Erdogan in that the U.S. can take them out of Incirlik any time it chooses.", "“The U.S. could take them out tomorrow if they wanted,” Lewis said. But the problem is that “some people don’t want to take them out, because if they do, they’ll never be able to put them back in.”", "Lewis added that he doesn’t believe it would end diplomatic relations between the U.S. and Turkey if the U.S. decided to remove the weapons, although he noted it would be tricky amid the tense situation involving the Kurds.", "He also raised doubts about how much the Turks prioritize the weapons, noting the weapons stored at Incirlik are gravity bombs — they can only be delivered via aircraft, and no Turkish aircraft certified to deliver nuclear weapons exist. The United States also doesn’t keep an aircraft that can deliver nukes permanently parked at Incirlik, either. In other words, Lewis said, “it’s basically a storage depot.”", "Although it's true there are about 50 American nuclear weapons being stored at Incirlik Air Base in Turkey, the weapons are in the possession of the U.S. military. Erdogan is not literally holding them \"hostage\" so much as new developments in Turkey have made it more complicated for the U.S. to move them out. However, the weapons remain under U.S. control, and as it stands, the U.S. retains the power to move them out of Turkey at will.", "Sanger, David. \"Trump Followed His Gut on Syria. Calamity Came Fast.\"\r\n  The New York Times. 14 October 2019.", "Fuhrmann, Matthew and Todd S. Sechser. \"Can the U.S. Protect Its Nuclear Weapons in Turkey?\"\r\n  The Washington Post. 18 October 2019.", "WNYC. \"Coup Attempt Raises Concerns About NATO Nukes in Turkey.\"\r\n  19 July 2016.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]