["About this rating", "Although the intent of this piece is to demonstrate a government endorsement of Judeo-Christian tradition through the symbols and words used in U.S. federal buildings and the writings of America's founding fathers, much of the information it presents is inaccurate.", "Did you know ...", "As you walk up the steps to the Capitol Building which houses the Supreme Court you can see near the top of the building a row of the world's law givers and each one is facing one in the middle who is facing forward with a full frontal view — it is Moses and the Ten Commandments!", "As you enter the Supreme Court courtroom, the two huge oak doors have the Ten Commandments engraved on each lower portion of each door.  As you sit inside the courtroom, you can see the wall right above where the Supreme Court judges sit a display of the Ten Commandments!", "There are Bible verses etched in stone all over the Federal Buildings and Monuments in Washington, D.C.", "James Madison, the fourth president, known as \"The Father of Our Constitution\" made the following statement \"We have staked the whole of all our political institutions upon the capacity of mankind for self-government, upon the capacity of each and all of us to govern ourselves, to control ourselves, to sustain ourselves according to the Ten Commandments of God.\"", "Patrick Henry, that patriot and Founding Father of our country said, \"It cannot be emphasized too strongly or too often that this great nation was founded not by religionists but by Christians...not on religions but on the Gospel of Jesus Christ\".", "Every session of Congress begins with a prayer by a paid preacher...whose salary has been paid by the taxpayer since 1777.", "Fifty-two of the 55 founders of the Constitution were members of the established orthodox churches in the colonies.", "Thomas Jefferson worried about that the Courts would overstep their authority and instead of interpreting the law would begin making law...an oligarchy...the rule of few over many...", "The very first Supreme Court Justice, John Jay, said, \"Americans should select and prefer Christians as their rulers.\"", "As you walk up the steps to the Capitol Building which houses the Supreme Court you can see near the top of the building a row of the world's law givers and each one is facing one in the middle who is facing forward with a full frontal view — it is Moses and the Ten Commandments!", "Law as an element of civilization was normally and naturally derived or inherited in this country from former civilizations. The \"Eastern Pediment\" of the Supreme Court Building suggests therefore the treatment of such fundamental laws and precepts as are derived from the East. Moses, Confucius and Solon are chosen as representing three great civilizations and form the central group of this Pediment.", "The two other lawgiver figures (Confucius and Solon) are not \"facing [the] one in the middle\" (i.e., Moses) as claimed above — all three of the lawgivers are depicted in full frontal views, facing forward.  (The allegorical figures who flank the three lawgivers are indeed facing towards the middle, but they are looking in the direction of all three men, not just Moses.)  The two tablets Moses holds in his arms are blank, without inscription.", "As you enter the Supreme Court courtroom, the two huge oak doors have the Ten Commandments engraved on each lower portion of each door.", "As you sit inside the courtroom, you can see the wall right above where the Supreme Court judges sit a display of the Ten Commandments!", "Weinman's training emphasized a correlation between the sculptural subject and the function of the building and, because of this, [architect Cass] Gilbert relied on him to choose the subjects and figures that best reflected the function of the Supreme Court building. Faithful to classical sources, Weinman designed for the Courtroom friezes a procession of \"great lawgivers of history,\" from many civilizations, to portray the development of secular law.", "Moses is not given any special emphasis in this depiction: his figure is not larger than the others, nor does it appear in a dominant position.  Also, the writing on the tablet carried by Moses in this frieze includes portions of commandments 6 through 10 (in Hebrew), specifically chosen because they are not inherently religious. (Commandments 6 through 10 proscribe murder, adultery, theft, perjury, and covetousness.)", "James Madison, the fourth president, known as \"The Father of Our Constitution\" made the following statement \"We have staked the whole of all our political institutions upon the capacity of mankind for self-government, upon the capacity of each and all of us to govern ourselves, to control ourselves, to sustain ourselves according to the Ten Commandments of God.\"", "Patrick Henry, that patriot and Founding Father of our country said, \"It cannot be emphasized too strongly or too often that this great nation was founded not by religionists but by Christians ... not on religions but on the Gospel of Jesus Christ\".", "Every session of Congress begins with a prayer by a paid preacher ... whose salary has been paid by the taxpayer since 1777.", "\"The Constitution of the U.S. forbids everything like an establishment of a national religion,\" Madison wrote. \"The law appointing Chaplains establishes a religious worship for the national representatives, to be performed by Ministers of religion, elected by a majority of them; and these are to be paid out of the national taxes. Does not this involve the principle of a national establishment, applicable to a provision for a religious worship for the Constituent as well as of the representative Body, approved by the majority, and conducted by Ministers of religion paid by the entire nation?\"", "Continued Madison, \"[If] it be proper that public functionaries, as well as their Constituents should discharge their religious duties, let them like their Constituents, do so at their own expense.\"", "Fifty-two of the 55 founders of the Constitution were members of the established orthodox churches in the colonies.", "Thomas Jefferson worried about that the Courts would overstep their authority and instead of interpreting the law would begin making law ... an oligarchy ... the rule of few over many...", "The very first Supreme Court Justice, John Jay, said, \"Americans should select and prefer Christians as their rulers.\"", "It certainly is very desirable that a pacific disposition should prevail among all nations. The most effectual way of producing it is by extending the prevalence and influence of the gospel. Real Christians will abstain from violating the rights of others, and therefore will not provoke war.", "Providence has given to our people the choice of their rulers, and it is the duty as well as the privilege and interest of our Christian nation to select and prefer Christians for their rulers.", "1   Some critics contend that anything that is tablet-shaped cannot possibly be interpreted as representing the U.S. Constitution, because that document \"was not written on tablets.\"  But one could use that same argument to contend that anything bearing the common version of Roman numerals cannot possibly represent the Ten Commandments, because that numbering system was not yet in use at the time of the events described in Exodus.", "2   Although the authenticity of the Weinman letter has been challenged because it does not bear the hallmarks of his other business correspondence, there are several prosaic reasons that might explain the differences, such as that the item is a draft of a letter (which may or may not have been formally prepared and sent) or an archival copy of a piece of correspondence whose original has since been lost.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]