["Several social media users have either posted an image of a woman holding a brassiere or shared an article by Janata Ka Reporter with the same image. As per the claim, a frustrated ex-serviceman’s wife sent Prime Minister Narendra Modi a 56-inch brassiere. The image is circulating in the backdrop of the death of 20 Indian army soldiers in Galwan Valley during clashes with China.", "On June 17, Twitter user @DKforIndia posted such a tweet and wrote in Hindi, “Solider’s wife took out her frustration and gave a 56-inch bra to PM Modi. The people of the nation are also waking up, the Modi government is running.” This tweet has been retweeted over 600 times. (archive link)", "(Translated from सैनिक की बीवी ने 56 इंच के साइज की ब्रा भेजकर PM मोदी पर निकाली भड़ास देश की जनता जाग रही है। #मोदी_सरकार भाग रही है।)", "The claim, including the report by Janta Ka Reporter, is viral on both Facebook and Twitter.", "The article by Janta Ka Reporter was published on May 12, 2017. As per the report, the woman in the viral image is Suman Kajla, wife of ex-serviceman Dharambir Kajla from Haryana. She sent a 56-inch brassiere to PM Modi along with a letter expressing anguish at the killing of Indian army soldiers by Pakistan.", "Alt News performed a keyword search and found that this news was also reported by Outlook, Nagpur Today, News Track Live and Free Press Journal in 2017.", "In her letter, the woman referred to the beheading of Lance Naik Hemraj by Pakistan’s Border Action Team in January 2013, per Outlook. “At the time of the 2014 Lok Sabha polls, we felt that no more of our soldiers will be beheaded like Hemraj and enemy will think ten times before doing such action, but they have been repeated,” she wrote urging PM Modi to give the army a “freehand” to tackle the situation at the border.", "Thus, three-year-old news of an ex-serviceman’s wife giving a 56-inch brassiere to PM Modi was revived amid the Indo-China border conflict.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]