["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "President Donald Trump delivers a statement on the Iran nuclear deal from the Diplomatic Reception Room of the White House, Tuesday, May 8, 2018, in Washington. (AP Photo/Evan Vucci)", "President Donald Trump posted on Twitter last week that Sen. Charles Schumer flip-flopped on the Iran nuclear deal.", "The tweet came two days after Trump announced the U.S. would withdraw from the Obama deal — a move Schumer criticized.", "\"Senator Cryin’ Chuck Schumer fought hard against the Bad Iran Deal, even going at it with President Obama, & then Voted AGAINST it!\" Trump tweeted. \"Now he says I should not have terminated the deal - but he doesn’t really believe that!\"", "Trump promised during his campaign to renegotiate the Iran deal, an agreement he opposed since its inception. Then-President Barack Obama announced the pact with five other countries and Iran to limit Iran’s nuclear capabilities in exchange for lighter sanctions in 2015.", "Is Trump right about Schumer’s record on the deal?", "Schumer in 2015", "A spokesperson for Trump referred us to comments Schumer made about the Iran deal in 2015.", "Obama announced the Joint Comprehensive Plan of Action, or Iran nuclear deal, in July of that year.", "The agreement did not require a vote from Congress because it wasn’t a trade deal. Past deals, like the North American Free Trade Agreement, had to be approved by Congress before they were implemented.", "Instead, Republicans who controlled the Senate introduced a measure to reject Obama’s deal.", "Schumer came out against the deal about a month before the Senate voted on the measure. In a statement, he said he would vote against the deal for three reasons:", "• The U.S. could not unilaterally demand inspections of Iran’s nuclear sites at any time.", "• Iran would have more resources to develop nuclear weapons after a decade of lighter sanctions, Schumer argued. As we’ve rated before, Iran was not free to build nuclear weapons after a decade.", "• Iran would also have more money to expand its influence in the region. The U.S. State Department has labeled the country a state sponsor of terrorism.", "Schumer wanted to keep the sanctions on Iran and pursue a different path to denuclearization.", "\"I believe Iran will not change, and under this agreement it will be able to achieve its dual goals of eliminating sanctions while ultimately retaining its nuclear and non-nuclear power,\" Schumer said.", "A few days after his break with Obama, Schumer said the U.S. \"should go back and try to get a better deal.\"", "He voted to reject the nuclear agreement but Republicans in the Senate didn’t have enough votes to send the measure to Obama. Schumer was one of four Democrats to support it.", "When asked after the 2016 election if he would support leaving the deal with Trump as president, Schumer told POLITICO he wanted to see how it played out for a few years and that \"it would be wrong to repeal it now.\"", "Schumer in 2018", "Schumer has been critical of Trump’s decision to pull out of the deal he once opposed.", "A reporter asked him earlier this month if he supported leaving the deal based on his position in 2015.", "\"No. There are no reports that Iran has violated the agreement and to me, the greatest worries from Iran are not right now the nuclear side,\" Schumer said,\"but rather what they’re doing in Syria, what they’re doing to arm Hezbollah with rockets.\"", "Schumer said he wants the U.S. to work with its allies to curb Iran’s influence in the region while maintaining the country’s nuclear restrictions.", "He clarified his position on the Senate floor a few days later.", "\"Telling Iran, you continue giving missiles to Hezbollah, you continue sending troops to Iran, you continue your stuff with the Houthis, developing missiles, we’re going to put additional sanctions on you,\" Schumer said. \"That to me is the smartest thing to do.\"", "Schumer also said he did not regret voting against the deal in 2015.", "\"I didn’t think the deal was a good deal. Proud I voted no,\" Schumer said. \"But at this time and this place for so many reasons, pulling out precipitously without our allies involved, does not achieve any of the goals we need to achieve and hurts Americans in different ways.\"", "Our ruling", "Trump said Schumer wants to keep the U.S. in the Iran nuclear deal after opposing it three years ago.", "That’s all true. Schumer came out against the Iran deal and voted to reject it in 2015. He disagreed with Trump’s decision to leave the deal this month, saying the U.S. should have threatened Iran with tougher sanctions alongside the nuclear restrictions.", "We rate Trump’s claim True.", "Tweet from President Trump, May 10, 2018", "Email conversation with Steven Cheung, Special Assistant to the President and Director of Strategic Response", "Email conversation with Justin Goodman, press secretary from Sen. Schumer", "Trump-O-Meter: Renegotiate the Iran deal", "Floor remarks from Sen. Chuck Schumer, May 10, 2018", "Schumer speaks to reporters about the Iran deal, May 8, 2018, C-SPAN", "Schumer’s statement on the Iran deal in 2015, Schumer’s Senate website", "\"Iran deal foe Schumer not ready to scrap it,\" POLITICO, Nov. 19, 2016", "\"How The Iran Vote Is Engineered To Pass,\" NPR, Sept. 2, 2015", "\"Obama secures Iran nuclear deal with Barbara Mikulski vote,\" CNN, Sept. 2, 2015", "\"Obama scores policy win in securing votes for Iran nuclear deal,\" Sept. 2, 2015", "PolitiFact: Donald Trump says wrongly the Iran nuclear deal expires in 7 years, May 2, 2018", "\"Schumer: Go back and get better Iran deal,\" The Hill, Aug. 10, 2015", "\"Deal Reached on Iran Nuclear Program; Limits on Fuel Would Lessen With Time\", New York Times, July 15, 2015", "\"Chuck Schumer Opposes Iran Nuclear Deal, Shaking Democratic Firewall,\" New York Times, Aug. 7, 2015", "\"Democrats Hand Victory to Obama on Iran Nuclear Deal,\" New York Times, Sept. 10, 2015", "\"Senate rejects attempt to derail Iran deal in victory for Obama,\" Washington Post, Sept. 10, 2015", "\"State Department report finds Iran is top state sponsor of terror,\" CNN, June 2, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]