["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Chris Moews, a lieutenant with the Milwaukee Police Department (left) and Milwaukee County Sheriff David Clarke Jr. are squaring off in the Aug. 12 primary", "With the critical Democratic primary approaching, Milwaukee County Sheriff David A. Clarke Jr. is emphasizing his fiscal record over his past decade in office.", "Clarke will face Chris Moews, a Milwaukee Police lieutenant, for the second time in the Aug. 12, 2014 primary. In November, the winner will face independent challenger Angela Nicole Walker, who is running as a Socialist candidate.", "In a July 27, 2014 interview on Upfront with Mike Gousha, which airs on WISN-TV, Clarke declared: \"I’ve either balanced every budget or we’ve turned back a surplus.\"", "A great talking point.", "But is Clarke right?", "To be sure, the county is required to balance the overall budget every year. So, to evaluate Clarke’s claim, we are looking at what happened specifically within the Office of the Sheriff's budget. And we’re looking at the final numbers for the year, which reflect actual spending.", "According to County Comptroller Scott Manske, it is expected that each department lives within the amount it is allocated. Most of the money comes from the property tax levy, though there are other sources of revenue, such as fees and grants.", "Clarke did not respond to our request for backup, so we turned to County Auditor Jerome Heer. He directed us to the county’s annual fiscal reports from 2003 to 2013. Clarke was appointed sheriff in 2002, but the first full year with his own budget was in 2003.", "All told, the sheriff's office will spend about $78 million this year, compared to $64 million in 2003.", "These are the budget surpluses and deficits the office has encountered under Clarke:", "2003", "-$2,393,755", "2004", "$1,510,200", "2005", "$1,363,322", "2006", "$442,806", "2007", "$1,296,949", "2008", "$52,338", "2009", "$1,380,056", "2010", "$1,420,322", "2011", "$237,127", "2012", "-$660,579", "2013", "-$217,000*", "So, the fiscal reports prepared by the Comptroller's office show Clarke's office actually had a deficit in three of the 11 years. The number for 2013 is an estimate, since the books have not been closed.", "Here is a look at the three exceptions:", "2003: In Clarke’s first full-year budget, the office ran a $2,393,755 deficit, because revenue from fines, forfeitures, grants and reimbursements came in nearly $2.2 million less than expected.", "2012:  The office was hit with another deficit, totaling $660,579. A $942,666 difference between budgeted and actual revenues contributed to the deficit for that year.", "2013: The auditor’s office has yet to determine final surplus and deficit figures because year-end adjustments are still \"firming up,\" Heer said.", "In any case, Heer said he believes the office's final deficit will be between $162,000 and $217,000.", "Another factor to consider is Clarke’s temporary control over the House of Correction, inheriting a $5 million deficit on overtime pay when he took it over in January 2009. A court ruling unraveled his authority over the House of Correction in May 2013.", "Before Clarke took it over, the House of Correction was its own separate entity that oversaw a $45 million budget and includes about 500 employees.", "While Clarke cut the overtime spending by 70 percent in his first year, two budgets sustained deficits in 2012 and 2013.", "In an Aug. 1, 2014 appearance with host Charlie Sykes on WTMJ-AM, Clarke rephrased his claim a bit: \"I have a 10-year record where I’ve balanced every budget or some of those years I’ve turned back budget surpluses. Ten consecutive years.\"", "The numbers show it is actually eight consecutive years where the office didn’t have a deficit:", "Our rating", "Clarke said he’s balanced the budget or returned a surplus to Milwaukee County for every year since he became sheriff in 2002.", "But county numbers show he didn’t in 2003, 2012 and most likely won’t in 2013.", "We rate his claim False.", "Interview, County Auditor Jerome Heer, July 31, 2014", "Interview, County Comptroller Scott Manske. August 4, 2014", "Milwaukee County Auditor’s Office Fiscal Reports 2003-2013", "Milwaukee Journal Sentinel, Clarke drops plan for early prisoner releases, January 27, 2010", "Milwaukee Journal Sentinel, Sheriff seeks $6 million for House of Corrections improvements, July 19, 2009", "Milwaukee Journal Sentinel, Dispute could derail lockup merger Sheriff Clarke, some board members at odds, October 14, 2008", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]