["About this rating", "The California state Republican party acknowledged that it set up drop boxes with an inaccurate label calling them “official.” California state authorities initially stated that the boxes were illegal and took legal action. Later, however, the California attorney general and secretary of state dropped legal challenges, citing mitigating actions taken by the California GOP.", "A controversy broke out in the fall of 2020 when California Republicans set up their own ballot drop-off boxes for voters to leave mail-in ballots for the November general election. The controversy initially circulated around an Oct. 8, 2020, tweet posted by Jordan Tygh, a regional field director for the California GOP.", "Tygh’s tweet contained a photograph of him standing in front of a dark gray box with a sign that said, “OFFICIAL BALLOT DROP OFF BOX.” The post was later removed by Twitter, according to Tygh, but an archived version remains viewable. As Los Angeles TV news station KTTV detailed in a Feb. 10, 2021, story, Tygh's tweet caught him off guard by going viral for \"all the wrong reasons\" (we will explain more below.)", "The online fury over the tweet and the drop boxes prompted Snopes readers in October 2020 to ask whether it was true that the California Republicans had installed the unofficial mail-in ballot drop boxes.", "The California GOP acknowledged that it owned the boxes. And the California secretary of state and attorney general had responded with forceful statements that such unauthorized ballot drop boxes were illegal, setting up what appeared to be a political game of chicken.", "Then-California Secretary of State Alex Padilla, during an Oct. 12 news conference, said multiple drop boxes had been installed in Fresno, Los Angeles, and Orange counties. Padilla’s office and then-California Attorney General Xavier Becerra issued cease-and-desist letters to state and county Republican parties.", "Ballot collection, sometimes referred to as “ballot harvesting,” is the practice of a voter designating a third party to deliver a mail-in ballot to election officials. It’s legal in many states, including California.", "What was not legal, according to the Secretary of State’s Office, is posing as an election officer and \"handling, counting, or canvassing of any ballots\" by anyone who isn’t an election officer. Violating the law is a felony that could result in two to four years in prison, if a person is convicted, officials had stated.", "Election officials ordered California Republicans to remove the unauthorized boxes by Oct. 15, with Becerra warning that his office would take legal action.", "\"Without equivocation,\" Becerra had stated, the drop boxes set up by California Republicans \"are illegal.\" He added, \"If you participate in those activities, you are knowingly engaging in activity that is against the law.\"", "A judge on Oct. 21 rejected state officials’ efforts to get California Republicans to comply with a subpoena seeking information about the boxes and the voters who had used them. The GOP meanwhile blamed the \"official\" labels on some of the boxes as the work of \"overzealous\" volunteers and stated those labels had been replaced.", "In a news conference held Oct. 16, Padilla and Becerra told reporters that the California GOP had, \"agreed not to place unauthorized ballot drop boxes outdoors, leave drop boxes unattended or present them as official, the party said it will continue to accept ballots delivered by voters to local party offices and secure them in boxes attended by staff or volunteers,\" per NPR.", "The California GOP denied they had been leaving the ballot boxes unattended to begin with, stating in a tweet, \"We can't agree to not do something we weren't doing to begin with.\"", "In late November 2020, Becerra’s office dropped the lawsuit that sought information on voters who had put ballots in the California GOP drop boxes, telling reporters in a statement, \"We are confident that this election was safe and secure in California — as it was across the country.\"", "In the aftermath of the controversy, Tygh told KTTV that the initial furor over his tweet had heavy negative consequences for him personally. As the California GOP and state officials pointed fingers at each other, Tygh, a Coast Guard veteran, told KTTV he was caught in the middle. Here's what Tygh told KTTV:", "\"We were told that we were going to be doing ballot harvesting operations, that we were gonna have these boxes in our office for people to come and drop the ballots off that we could harvest ourselves and bring to the registrar of voters,\" Tygh said. \"The program was heavily vetted by the GOP attorneys so there was never any question in my mind as a low-level operative that this was something illegal or criminal.\"", "Tygh's tweet, however, ended up going viral for all the wrong reasons.", "\"Twitter started going out of control, people were accusing me of setting up a fake ballot box, accusing me of a felony, and I was alerting my supervisors to this like look this is getting a lot of attention,\" he said. \"We’ve got to do something about this. They told me to keep my head down, that the Democrats were just trying to intimidate me and everything was good, everything was legal.\"", "But Tygh says the California GOP waited more than a day to announce the ballots were their operation and told him to keep his head down.", "\"They weren’t coming public or admitting it, so a lot of those initial stories were about me as an individual, that I was this criminal, election fraudster setting up these illegal ballots,\" Tygh said.", "The drop boxes were later deemed to be legal in court. And while the California Attorney General's Office did launch an investigation into GOP's use of the boxes, the investigation was dropped and no charges were filed after the GOP agreed to stop labeling the boxes as \"official.\"", "Nevertheless, Tygh told KTTV, the controversy sullied his reputation. “A lot of people won’t touch me, I’ve had all these false accusations, it’s affected my social life, people think I’m a criminal,\" Tygh told KTTV. \"I would rather lose an election than cheat one, when I joined the military I took an oath to defend the constitution, and even though I’m out now, the oath still stands.\"", "Shepherd, Katie. \"California GOP Installed Unofficial Ballot Drop-Off Boxes. State Officials Say They’re Illegal.\"\r\n  Washington Post. 12 October 2020.", "Gardner, Amy. \"'We Got Our Clocks Cleaned': GOP Quietly Works to Expand Ballot Harvesting in California While Criticizing Democrats for the Practice.\"\r\n  Washington Post. 14 March 2019.", "Associated Press. \"California GOP Says It Owns Unofficial Ballot Drop Boxes.\"\r\n  12 October 2020.", "Associated Press. \"California Orders GOP to Remove Unofficial Ballot Boxes.\"\r\n  13 October 2020.", "Myers, John. \"Judge Rejects California Attorney General’s Effort to Investigate GOP Ballot Boxes.\"\r\n  Los Angeles Times. 21 October 2020.", "Sprunt, Barbara, et al. \"California Eases Off Legal Threats Over GOP Unauthorized Ballot Drop Boxes.\"\r\n  NPR. 16 October 2020.", "Updated to note that a judge rejected an attempt by state authorities to get the California GOP to comply with a subpoena seeking information about the boxes, and that state Republicans replaced signs on boxes that said \"official.\"", "Update/Correction: California authorities have dropped legal actions taken against the state GOP over the ballot boxes.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]