["About this rating", "Voting in the 2020 U.S. Election may be over, but the misinformation keeps on ticking. Never stop fact-checking. Follow our post-election coverage here.", "In the aftermath of the 2020 U.S. presidential election, U.S. President Donald Trump and his team launched a massive misinformation campaign to try to convince Americans that his political opponents were running a grand conspiracy to undermine Trump's reelection. (Read more fact checks like this one here.)", "As part of that communication strategy, the Trump campaign alleged without evidence that Joe Biden — who was projected the winner on Nov. 7 — only secured the popular vote in key battleground states because polling workers there had counted all ballots, regardless of their legality.", "In several emails obtained by Snopes, the campaign alleged: \"The Biden campaign wants ballots counted even if they are fraudulent, manufactured, or cast by ineligible or deceased voters.\"", "The claim was false. No evidence showed president-elect Biden, nor any other Democrat, was engaged in large-scale electoral fraud, nor that his campaign wanted ineligible ballots to count in the 2020 presidential election. Rather, Biden's campaign framed such claims by Trump as attempts to stop the democratic process.", "Nonetheless, this baseless allegation by Trump appeared verbatim and in alternate forms across social media in the days after polls closed. Here, for example, we debunked one viral video that Trump and his supporters claimed showed Biden \"admitting\" to voter fraud, when, in reality, that wasn't the case.", "All states require voters to be U.S. citizens, over age 18, and meet certain residency requirements to legally vote. Additionally, eligible mail-in ballots must meet postmarking deadlines, which vary by state, and include signatures of voters.", "But local governments  — not politicians in Washington, D.C., including Biden — establish rules governing the process for counting votes. In fact, most state laws grant counties the authority to administer elections via a board of electors, an election official or officials, or both. As a result, thousands of local jurisdictions come together to run federal elections, including presidential races, and they all operate under their own rules governing vote counting. Many state laws allow mail-in ballots received after Election Day to be counted.", "For the alleged conspiracy to be true, Biden's team would have had to infiltrate a variety of election boards or jurisdictions, and direct their poll workers to count fake ballots or those completed by ineligible voters, despite state laws imposing severe punishments for that criminal activity.", "However, according to top elections officials from both political parties in the battleground states of Arizona, Georgia, Michigan, Pennsylvania, and Nevada, there were no widespread voting irregularities, nor any major instances of fraud or illegal activity in the 2020 presidential election, The Associated Press reported.", "Here's what's key: No elections expert doubts voter fraud exists in U.S. elections, including cases where people who aren't eligible to vote try to cast ballots. Typically, as reported by The Associated Press, the crime happens when people wanting to honor the wishes of loved ones who recently died illegally fill out ballots for the deceased. But all instances of voter fraud taken together are extremely minuscule in comparison to the number of ballots cast, and do not change the outcome of an election.", "In sum, since no evidence existed to show local elections were nefariously counting fraudulent ballots under directives from Biden, his campaign, or the Democratic Party in the 2020 presidential election, we rate this claim \"false.\"", "Jessica Lee is Snopes' Senior Assignments Editor with expertise in investigative storytelling, media literacy advocacy and digital audience engagement.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]