["N.J. Gov. Chris Christie campaigns in New Hampshire, touting his record as governor (AP)", "A key talking point for New Jersey Gov. Chris Christie in his bid for the GOP nomination is that he is a can-do Republican in a Democratic state. That, of course, leaves him open to challenges about what he’s actually achieved.", "Democratic pundit and occasional party operative Donna Brazile took a jab at Christie’s track record on managing his state’s finances.", "\"Governor #ChrisChristie has led New Jersey to a record-breaking 9 credit downgrades. Yes, you read that right: nine credit downgrades,\" Brazile tweeted on June 30, 2015.", "We’ve checked similar statements about Christie before and took this moment to update our findings.", "In short, yes, the three major credit rating firms have collectively downgraded the state’s bond rating nine times. The latest move came from Moody’s Investor Service in April. The Moody’s rating fell from A1 to A2.", "The rating firm said it based the change on the state’s \"weak financial position and large structural imbalance, primarily related to continued pension contribution shortfalls.\"", "In addition to Moody’s, there are two other rating agencies -- Standard & Poor’s Rating Services and Fitch Ratings.", "Here’s the history of downgrades since Christie took office.", "Date", "Rating service", "Rating change", "1", "Feb. 9, 2011", "Standard & Poor’s", "AA to AA-", "2", "April 27, 2011", "Moody’s", "Aa2 to Aa3", "3", "Aug. 17, 2011", "Fitch Ratings", "AA to AA-", "4", "April 9, 2014", "Standard & Poor’s", "AA- to A+", "5", "May 1, 2014", "Fitch Ratings", "AA- to A+", "6", "May 13, 2014", "Moody’s", "Aa3 to A1", "7", "Sept. 5, 2014", "Fitch Ratings", "A+ to A", "8", "Sept. 10, 2014", "Standard & Poor’s", "A+ to A", "9", "April 16, 2015", "Moody’s", "A1 to A2", "Do the nine downgrades set a record? Yes, for New Jersey. According to news reports, that is the highest number ever for a single New Jersey governor. The previous record was six credit downgrades, which happened while Democrat James McGreevey was governor. McGreevey presided over his drops in less than three years in office (2002-04); Christie is in his sixth year in office.", "Pension system blues", "Ratings agencies assess the state’s ability to repay its lenders, not just today but for years to come. Their opinion matters because the lower the rating, the higher the interest rate the state faces when it wants to borrow money.", "A point of ongoing concern for the agencies has been New Jersey’s pension obligations. It’s total commitments are about $43 billion. According to a report by the National Association of State Retirement Administrators, as of 2013, New Jersey ranked last in the country in its efforts to put enough money into the system each year to make good on its promises to it current and future retirees. It was putting in 38 percent of what the association calculated was needed.", "As Moody’s put it, \"the state's plan to restore long-term structural balance relies on economic growth and further pension reforms, which have uncertain timing and impact.\"", "Recent events in New Jersey have fueled such skepticism. In 2011, Christie struck a deal with lawmakers, and public workers, to increase state contributions to the pension funds in exchange for higher payments from employees, a bump in the retirement age, and lower cost-of-living increases for retirees. But in 2014, with tax revenues coming in lower than predicted, Christie trimmed the state’s pension payments.", "Christie says deeper changes are needed.", "Does Christie deserve all the blame for this mess? No. Democratic and Republican governors alike have failed to put enough money into the pension system going back to the late 1990s. The problem ballooned in the early 2000s when the dot-com bubble burst and tax revenues fell, and the Great Recession later in the decade did even more damage to state finances. Also, the state Legislature has been controlled by Democrats.", "But while the problem was created before he took office, Christie can’t sidestep at least some responsibility for what has taken place on his watch.", "Our ruling", "Brazile said that Chistie led New Jersey to a record-breaking nine credit downgrades. Her tally is correct, Christie was the chief executive throughout and no other New Jersey governor has overseen so many reductions in the state credit rating. The previous record was six.", "But the underlying problem with pensions began before his time and the economy made it harder to fix past errors. It's also worth noting that Democracts have controlled the Legislature during Christie's time in office.", "With those caveats, we rate this claim Mostly True.", "Donna Brazile, tweet, June 30, 2015", "PunditFact, Claim: New Jersey has had 7 credit downgrades since Chris Christie took office, Nov. 9, 2014", "Moody’s Investor Service, Moody's downgrades New Jersey's GO bonds to A2 from A1, April 16, 2015", "Bloomberg, New Jersey Debt Rises to $85 Billion on Pension Obligations", "National Association of State Retirement Administrators, The Annual Required Contribution Experience of State Retirement Plans, FY 01 to FY 13, March 2015", "WNYC, NJ Gets Record Number of Downgrades Under Christie, Sept. 11, 2014", "NJ.com, How did N.J. get into this pension mess?, Jan. 19, 2015", "NJ.com, N.J. credit rating cut record ninth time as Moody's cites pension shortfall, April 17, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]