["About this rating", "On Aug. 7, 2019, following two mass shootings in El Paso, Texas, and Dayton, Ohio, President Donald Trump visited two hospitals that had responded to the victims of these violent acts. White House pool reporters were not allowed to cover the visits. White House Press Secretary Stephanie Grisham said that the administration didn't want to turn the visit into \"a photo op.\" Instead, White House photographers covered the events in a series of photos and a video later shared by Trump’s social media team:", "Websites and viral social media posts began running with a rumor that the nurses and other hospital staffers pictured in photographs with the president during his visit to Dayton were not actual hospital employees. The DC Tribune ran a story with the headline “Dayton Hospital Insider Says Many Of The People Who Posed With Trump During Photo-Op Were Not Actually Hospital Employees.”", "That article, like nearly every viral social media post making the same claim, cites as the sole source of that information a Georgia man who, in a series of tweets, claimed that a “friend who knows a nurse” at the hospital in Dayton (Miami Valley Hospital) told him that the photos showed non-employees, strongly suggesting “fake nurses” were used for the shots. Though he was directing his comments in response to a specific photo shared by another Twitter user, his claim broadly concerned the general existence of non-employee nurses during the visit in general:", "We reached out to Ghalili, the Georgia man, to ask if he could provide any corroborating evidence for this rumor. In a lengthy email reply, he told us “I personally can not corroborate [my friend’s] nurse friend’s comments\":", "As I stated I got a text from a friend actually a former employee who indicated that a nurse friend of his told him that many of the people including those in nurses uniforms did not work at that hospital and she did not know where they came from.", "After I tweeted this and received tweets back as to the claim I reached back to my friend, he did not know I had tweeted his remarks but was ok with it. I asked him if he or his nurse friend would be willing to go public. He said no way and for obvious reasons and requested i don't disclose his name. I don't know the identity of the nurse and was not about to ask him. The only thing he said that knowing her she has no reason to make up something like this.", "He added his personal view that “I don't put [it past] Trump's aides to have staged this. As his visit to both hospitals were controversial.” He told us that a reporter should be able to get to the bottom of it.", "We reached out to officials at the Miami Valley Hospital, sending them the video of Trump’s Dayton visit and asking if any unknown non-employee nurses appeared in any that video. In response, Ben Sutherly, a spokesman for Premier Health and Miami Valley Hospital, told us that “I can confirm that those were Miami Valley Hospital employees.” That video, at 0:18 seconds, captures the same group of people in the photo that inspired Ghalili's tweet.", "Further, Snopes has identified several Miami Valley employees whose photographs appear in unrelated press reports about the hospital who also appear to have been shown in photographs during Trump’s visit. We have reached out to one of those individuals, but have received no response.", "All told, this claim has its origins in one man with no direct connection to the hospital. Based on the lack of corroborating evidence, the apparent presence of previously documented Miami Valley Hospital nurses in some of the photos, and confirmation from the hospital that everyone in the video produced by Trump’s team was, in fact, an employee, we rank the claim \"False.\"", "Stokols, Eli.   “Subject: Out of Town Pool Report #4 - Dayton.”\r\n    Public Pool.   7 August 2019.", "Koerner, Claudia.   “Injured Victims At An El Paso Hospital Refused To Meet Trump During His Visit.”\r\n    BuzzFeed News.   7 August 2019.", "Simpson, Andrew.   “Dayton Hospital Insider Says Many Of The People Who Posed With Trump During Photo-Op Were Not Actually Hospital Employees.”\r\n    DC Tribune.   8 August 2019.", "Kindelan, Katie.   “11 Labor and Delivery Nurses Pregnant at Ohio Hospital. What's Behind These Baby Booms?.”\r\n    Good Morning America.   19 April 2019.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]