["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Donald Trump’s first words Sunday on NBC’s Meet the Press were an attack on his biggest rival in the Iowa caucuses, Texas Sen. Ted Cruz.", "Before bringing on Trump, host Chuck Todd showed a new Cruz ad criticizing the real estate tycoon’s support for eminent domain, the government’s power to seize private property in order to make way for public development projects. The ad quotes Trump as saying, \"I think eminent domain is wonderful.\"", "\"It made him rich — like when Trump colluded with Atlantic City insiders to bulldoze the home of an elderly widow for a limousine parking lot at his casino,\" the ad says.", "Trump launched into his critique right away.", "\"Good morning,\" said Trump in the clip, \"and I have to tell you his ad is wrong because I never knocked down that house. I wanted to get that house to build a major building that would have employed a tremendous numbers of people, but when the woman didn’t want to sell, ultimately I just said forget about it. So he’s got me bulldozing down a house, I never bulldozed it down, it’s false advertising.\"", "Todd said, \"Well, all right, the accusation was that that’s what you wanted to do.\"", "Trump stood by his takedown: \"No, the accusation was that I did it, and I didn’t do it.\"", "It turns out that both Cruz and Trump are stretching the truth about what happened with a widow’s home.", "In this fact-check, we’ll focus on Trump saying Cruz has \"got me bull-dozing down a house. I never bulldozed it down. It's false advertising.\"", "Donald vs. Vera", "In a prior fact-check, we found Trump is sort of a poster boy for eminent domain (and he really did call the practice \"wonderful\" as recently as October.)", "Eminent domain traditionally involves a proposal for a government-run project. However, the Supreme Court’s decision in the 2005 case Kelo vs. New London, Conn., said eminent domain could be used to make way for private commercial development. The court decided the development qualified as a public use because it would bring jobs and tax revenues to a blighted area.", "Cruz’s ad references a period in the 1990s, prior to Kelo, when Trump wanted the state of New Jersey to use its eminent domain power to help him with a casino project. Trump planned to build a limousine garage to service the Trump Plaza Hotel and Casino in Atlantic City but several pieces of private property were in the way, including a home owned since the 1960s by a widow in her late 60s named Vera Coking.", "Trump has said he offered Coking millions for her property, but she wouldn’t give up her home. In 1994, New Jersey’s Casino Reinvestment Development Authority threatened to use eminent domain to seize the house.", "The dispute ended up in front of a New Jersey court, which ruled against Trump and the government in 1998. After losing the case, Trump gave up his plan to buy Coking’s house, telling the New York Daily News that he was \"no longer an interested buyer.\"", "\"The bottom line is it's too bad for Atlantic City, but it's not too bad for me because I'm not interested in the property,\" Trump said. \"Nobody gets under my skin.\"", "Coking’s supporters painted Trump as a villainous fat cat. Coking herself called him \"a maggot, a cockroach and a crumb.\"", "Trump Plaza closed in September 2014 after struggling financially. Trump told the New York Times that ownership of Coking’s property would not have saved it.", "Back to Cruz’s ad, Trump has a point that it is misleading to imply he got \"rich\" after bulldozing an elderly widow’s home, given that Coking kept her property, and Trump never got anything out of it. But Trump exaggerated  when he said \"when the woman didn’t want to sell, ultimately I just said forget about it.\" It took several years of failed negotiations and losing a lawsuit for him to decide he was no longer interested.", "Our ruling", "Trump says Cruz's ad has \"got me bull-dozing down a house. I never bulldozed it down. It's false advertising.\"", "If you read the ad as Trump does, he is right: The woman’s home was never destroyed as a result of eminent domain. He never got rich off of this deal because the case for eminent domain didn’t pan out.", "But that reading ignores another interpretation of Cruz’s point: Trump certainly tried to take over the property before the state Superior Court stepped in and ruled in the woman’s favor. Trump didn’t mention the years-long legal battle on Meet the Press.", "For glossing over some important context, we rate his claim Half True.", "PolitiFact, \"Trump supports eminent domain 'abuse,' says conservative Club for Growth,\" Oct. 7, 2015", "NPR, \"Get Off My Lawn: Conservatives Critique Trump On Eminent Domain,\" Sept. 24, 2015", "New York Times, \"Ted Cruz Condemns Donald Trump for His Use of Eminent Domain,\" Jan. 22, 2016", "New York Times, \"A Homeowner’s Refusal to Cash Out in a Gambling Town Proves Costly,\" July 21, 2014", "New York Daily News, \"She kicks sand in Trump’s face, sneers at the Donald’s bucks,\" July 26, 1998", "Institute for Justice, \"Atlantic City Condemnation – Vera Coking,\" accessed Jan. 24, 2016", "Washington Post, \"Trump Plaza closes, making it official: A third of Atlantic City’s casinos have closed this year,\" Sept. 16, 2014", "Washington Post, \"The time Donald Trump’s empire took on a stubborn widow — and lost,\" Sept. 9, 2015", "NJ.com, \"Trump eminent domain comment rekindles his 1990s Atlantic City property battle,\" Oct. 11, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]