["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A photo of what looks to be a homeless camp lined up on an old railroad claims to be taken in the United States this year.", "Text along the bottom of the photo says \"Los Angeles California 2019.\"", "The post, which was shared nearly 900 times in one day, was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The photo was not taken in 2019. It’s also not showing Los Angeles.", "It’s from 2015 and depicts a shantytown in Paris, located along a disused railway line.", "A reverse-image search of the photo led to a December 2015 Daily Mail story that discusses the large Roma community in Paris, often referred to as Roma gypsies, who have built hundreds of shacks using wooden boards and scrap material along an old railway line.", "The Petite Ceinture is a 19-mile belt that has been derelict for several decades, the Guardian reported in 2016, and its redevelopment has long sparked debates in the country.", "Shortly after the migrant crisis hit Europe in 2015, the camp took root.", "Around the time the photo was taken, the camp, which has no electricity or running water, spanned about 500 meters and was home to approximately 350 people.", "This post is False.", "Facebook post, Feb. 17, 2019", "Reverse image search, Feb. 18, 2019", "Daily Mail,  The Third World shanty town... in the heart of Paris: Roma gypsies create their own village built from rubbish and scrap in one of Europe's great cities, Dec. 18, 2015", "The Funambulist Magazine, PRECARIOUS ROMA VILLAGE OF NORTHERN PARIS: A FEW CAUTIOUS CONSIDERATIONS, Dec. 20, 2015", "The Guardian, Life in the new shanty town taking root on Paris's abandoned railway, Jan. 5, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]