["About this rating", "A photograph captures Joe Biden giving a teenager a \"quick peck on the lips.\"", "The pictured woman was 19 years old (not 15) and was Biden's granddaughter, Finnegan.", "Former Vice President and 2020 Democratic presidential candidate Joe Biden has drawn scrutiny for his behavior around adult women and girls, which led to Biden's declaring in April 2019 that he would \"be more mindful about respecting personal space in the future\":", "Attempts to disparage Biden by posting photographs (many of them fake) supposedly showing him touching women in inappropriate ways are a common occurrence on social media, including the following example from mid-2020:", "In this particular case the photograph was real, albeit somewhat mislabeled and missing in context.", "This image originated with a February 2020 campaign rally in Iowa (by which time Biden was actually 77, not 76), and the pictured woman was 19 years old (not 15) and was in fact Biden's granddaughter, Finnegan Biden. A video of that event shows that after Biden introduced Finnegan at the start of the rally, he gave his granddaughter what the New York Post described as a \"quick peck on the lips\" before she walked offstage (around the 2:39 mark):", "The former vice president entered the event at Clarke University in Dubuque holding the hand of Finnegan Biden, the daughter of his son Hunter.", "“I would like to introduce you to my granddaughter Finnegan Biden. The reason I asked Finnegan — grandfathers are always allowed to embarrass their granddaughters — that goes along with the territory,” said Biden, 77, his hand over her shoulder. “Her other grandma graduated from Clarke College in the mid-’60s and talks about it all the time.”", "He then described the difference between daughters and granddaughters to the crowd as he walked around the stage before circling back to Finnegan.", "“But granddaughters not only love their grandpops but they like them. And that’s the great thing. Thank you, baby,” he said before giving her a quick peck on the lips.", "Although the affectionate kiss (as documented by the above video) was a very brief and light \"peck,\" something not evidenced in still images taken from the event, some commenters still professed to find it gross, while others asserted the opposite:", "Moore, Mark.   \"Joe Biden Kisses Granddaughter on Lips During Iowa Rally.\"\r\n    New York Post.   3 February 2020.", "New Zealand Herald.   \"Joe Biden Kisses Granddaughter on Lips During Iowa Rally.\"\r\n    4 February 2020.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]