["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Vice President Mike Pence, visiting Milwaukee to talk about tax cuts, also made a claim about border crossings. (Rick Wood/Milwaukee Journal Sentinel)", "The security of the U.S. border with Mexico remains a hot-button issue.", "On April 4, 2018, President Donald Trump signed a memorandum to deploy the National Guard, a move aimed at improving border security.", "\"The security of the United States is imperiled by a drastic surge of illegal activity on the southern border. Large quantities of fentanyl, other opioids, and other dangerous and illicit drugs are flowing across our southern border and into our country at unprecedented levels, destroying the lives of our families and loved ones,\" the memorandum says.", "In line with this initiative, Vice President Mike Pence, during a April 25, 2018, speech at the Wisconsin Center in Milwaukee said:", "\"Our president also promised to secure our borders and enforce our laws. … As I stand before you today, illegal crossings at our southern border have been cut by over 40 percent.\"", "The 40 percent decrease figure is often bandied about by administration officials.", "Is it accurate?", "The evidence", "In January 2018, the Department of Homeland Security announced the U.S. Customs and Border Protection’s apprehension numbers for the previous year.", "\"The final border apprehension numbers of 2017, specifically at the southern border, undeniably prove the effectiveness of President Trump’s commitment to securing our borders,\" said Tyler Q. Houlton, acting press secretary, in the release. \"This administration has overseen a 40 percent decrease in 2017 compared with the last year of Obama’s presidency. U.S. Border Patrol apprehensions in Fiscal Year 2017 were at the lowest level in 45 years.\"", "But untangling the numbers is not so easy.", "Let’s step back.", "According to the Department of Homeland Security figures, in Fiscal Year 2017 the U.S. Border Patrol caught 303,916 people crossing the southern border, down from 408,870 in 2016 -- a drop of 25.6 percent.", "That’s not 40 percent.", "We turned to the vice president’s office, but they did not respond to our requests for comment.", "Meanwhile, a public affairs officer with the Department of Homeland Security said the 40 percent figure is correct and told PolitiFact Wisconsin to \"Google it.\" The officer also cited an earlier fact check by our colleagues at PolitiFact National, which checked this March 13, 2017, claim from Trump:", "In the first full month of my administration following the issuance of my executive orders, illegal immigration on our southern border fell by an unprecedented 40 percent.", "Politifact National rated the claim Mostly True.", "It found that according to a Homeland Security Fiscal Year 2017 chart, apprehensions by border patrol along the U.S.-Mexico border decreased about 40 percent, from 31,576 in January 2017 to 18,754 in February 2017.", "But that 40 percent decrease refers to a one-month drop. And the figure is greatly outdated -- there is now more than a year of data to work with since Trump took office.", "The spokesman also sent us a link to a Dec. 5, 2017, National Public Radio article, which noted arrests for illegal border crossings had hit a 46-year low. That article also references a drop, but it reports one much smaller than 40 percent.", "\"Border officers apprehended 310,531 people for being in the country illegally in fiscal 2017, a 25 percent decrease from the year before\" the article states.", "And it provides a slightly skewed picture: The 310,531 apprehensions in 2017 is a nationwide figure. According to the Homeland Security report \"CBP Border Security Report, Fiscal Year 2017,\" of the national total, 303,916 were along the southern border.", "In any case, that brings us back to the percentage drop we started with.", "But the fiscal year measure is not a perfect one. The federal fiscal year begins Oct. 1, so Fiscal Year 2017 takes in the final few months under President Barack Obama.", "So, let’s try a few other ways.", "Trump took office in January 2017, when the monthly apprehension figure was at 31,576. A year later, in January 2018, monthly apprehensions were at 25,978 -- a drop of about 18 percent (less than half the boasted about 40 percent).", "What’s more, the situation flips when you use subsequent months to make the same comparison. That is, monthly apprehensions were higher in February 2018 than February 2017; higher in March 2018 than March 2017, and higher in April 2018 than April 2017.", "A look at the most recent month-to-month changes -- the approach Trump used in his initial boast -- shows that from February 2018 to March 2018, there was an increase of nearly 40 percent. And from March to April, there was an increase of about 2.3 percent.", "Our rating", "Pence said \"Illegal crossings at our southern border have been cut by over 40 percent.\"", "The most recent official fiscal year numbers show a much smaller drop of about 26 percent. And the latest month-to-month numbers show an increase, not a decrease in apprehensions.", "We rate Pence’s claim False.", "The White House, \"Remarks by Vice President Pence,\" April 25, 2018.", "CNN, \"READ: Trump's memo ordering National Guard troops to the border,\" April 4, 2018.", "Newsweek, \"Under Trump, 40% Fewer People Have Been Caught Illegally Crossing U.S. Border,\" Jan. 10, 2018.", "U.S. Customs & Border Protection, \" Southwest Border Migration FY 2018,\" May 3, 2018.", "U.S. Department of Homeland Security, \"DHS Acting Press Secretary Statement on December Border Apprehension Numbers,\" Jan. 9, 2018.", "U.S. Department of Homeland Security staff official, email and phone call May 9, 2018.", "PolitiFact National, ‘Donald Trump trumpets 40 percent decrease in illegal border crossings. Is he right?\" March 14, 2017.", "National Public Radio, \"Arrests For Illegal Border Crossings Hit 46-Year Low,\" Dec. 5, 2017.", "U.S. Department of Homeland Security, CBP Border Security Report, Fiscal Year 2017, Dec. 5, 2017.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]