["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Sen. Chris Murphy, D-Conn., a vocal advocate of tighter gun laws, called out President Donald Trump’s pick for the Supreme Court for the nominee’s position on the Second Amendment.", "\"Brett Kavanaugh is a true Second Amendment radical,\" Murphy tweeted July 9. \"He believes assault weapon bans are unconstitutional, a position way out of the judicial mainstream, far to the right of even late Justice Scalia.\"", "Brett Kavanaugh is a true Second Amendment radical. He believes assault weapon bans are unconstitutional, a position way out of the judicial mainstream, far to the right of even late Justice Scalia.", "We wondered whether Kavanaugh, who will replace Justice Anthony M. Kennedy if confirmed, on the issue of assault weapons indeed stands to the right of Scalia, who as a young man would tote his rifle on the New York City subway.", "After reading the relevant court decisions, experts told us both Kavanaugh and Scalia hold that assault weapons are protected under the Second Amendment.", "Assault weapons encompass a series of semi-automatic firearms, mostly rifles. Semi-automatic weapons are those where one trigger pulled equals one bullet shot.", "One of the defining cases on gun rights in recent years is D.C. vs. Heller. Alongside five others, Richard Heller, a special police officer for the District of Columbia, filed a lawsuit in 2003 challenging the constitutionality of the Firearms Control Regulations Act of 1975, which restricted D.C. residents from owning handguns. The suit eventually reached the Supreme Court, which ruled 5-4 in Heller’s favor. The majority decision was written by Scalia.", "Scalia argued that handguns have not traditionally been banned and are in common use. He also pointed out, however, that the right granted by the Second Amendment \"is not unlimited,\" and upholds \"laws imposing conditions and qualifications on the commercial sale of arms.\"", "The question of assault weapons never came up.", "Instead, rifles came up in a later legal challenge between Heller and Washington, when Heller questioned the constitutionality of the district’s Firearms Registration Amendment Act of 2008, created in response to the Supreme Court decision.", "The U.S. Court of Appeals for the District of Columbia Circuit favored the district two to one, but Kavanaugh dissented.", "\"There is no meaningful or persuasive constitutional distinction between semi-automatic handguns and semi-automatic rifles,\" Kavanaugh wrote. \"Semi-automatic rifles, like semi-automatic handguns, have not traditionally been banned and are in common use by law-abiding citizens for self-defense in the home, hunting, and other lawful uses.\"", "When the question of whether assault weapons bans are unconstitutional was raised of the Supreme Court, Scalia was unable to answer because the court rejected the case.", "The case in question was Friedman vs. Highland Park, a challenge to a Chicago suburb’s ordinance banning semi-automatic assault weapons and large-capacity magazines. However, Justice Clarence Thomas voiced a similar opinion to Kavanaugh’s in the rejection, which Scalia joined.", "Scalia and Thomas wrote that in accepting the ban, the court was not complying with the precedent set by Heller.", "\"The city’s ban is thus highly suspect because it broadly prohibits common semi-automatic firearms used for lawful purposes,\" Thomas wrote. \"Roughly five million Americans own AR-style semi-automatic rifles. The overwhelming majority of citizens who own and use such rifles do so for lawful purposes, including self-defense and target shooting. Under our precedents, that is all that is needed for citizens to have a right under the Second Amendment to keep such weapons.\"", "\"In the Highland Park case, we should say Kavanaugh was on the same page as Scalia,\" said Eugene Volokh, a constitutional law professor at the University of California, Los Angeles.", "Murphy’s office pointed out that Scalia’s opinion explicitly allowed for regulations, which some lower courts found included assault weapons bans. But the rulings are not unanimous.", "\"You have more courts upholding the bans than finding them unconstitutional, but there’s definitely a split of opinion on this,\" said David Kopel, an associate policy analyst at the Independence Institute.", "Murphy said that on assault weapons, Kavanaugh’s position is \"way out of the judicial mainstream, far to the right of even late Justice Scalia.\"", "Kavanaugh stated that assault weapons bans were unconstitutional in the circuit court case Heller vs. District of Columbia. Scalia’s opinion on the Supreme Court allowed for some regulations in District of Columbia vs. Heller, which some courts have interpreted to rule in favor of assault weapons bans. But the decision was not about assault weapons.", "We found at least one instance where Scalia signed off on saying an assault weapons ban would be unconstitutional. So Kavanaugh’s position and Scalia’s are substantially similar. Leaving room for legal interpretation, we rate this statement Mostly False.", "Twitter, Chris Murphy, July 9, 2018", "Email interview with Chris Harris, communications director for Chris Murphy, July 10, 2018", "Phone interview with David Kopel, associate policy analyst at the Independence Institute, July 10, 2018", "Phone interview with Eugene Volokh, Gary T. Schwartz Distinguished Professor of Law at University of California, Los Angeles, July 10, 2018", "Phone interview with Mark Tushnet, William Nelson Cromwell Professor of Law at Harvard University, July 10, 2018", "Email interview with Jamal Greene, Dwight Professor of Law at Columbia Law School, July 10, 2018", "Cornell University Law School, District of Columbia et al. v. Heller, 2008", "SupremeCourt.gov, Arie S. Friedman et al. v. City of Highland Park, Illinois Thomas dissent, 2015", "SCOTUS Blog, Arie S. Friedman et al. v. City of Highland Park, Illinois, 2015", "Washington Post, Does the Second Amendment really protect assault weapons? Four courts have said now, Feb. 22, 2018", "Deseret News, Young Scalia carried rifle while riding N.Y. subway, Feb. 27, 2006", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]