["By Eugene Kiely", "Posted on January 27, 2017 | Corrected on February 10, 2017", "President Donald Trump claimed that the Islamic State, or ISIS, would not exist if the U.S. “kept the oil when we got out” of Iraq. In fact, ISIS largely has been funded through extortion, robbery, taxes and Syrian oil, according to government reports and terrorism financing experts.", "“Trump is absolutely correct that oil sales have been a critical part of ISIS’s revenue stream since at least early 2014, but he’s wrong that an ongoing American occupation of the Iraqi oilfields would have bankrupted ISIS,” Peter Harrell, the deputy assistant secretary for Counter Threat Finance and Sanctions in the State Department under President Obama, told us in an email. “If you look at the facts on the ground ISIS has likely always produced more oil in Syria than in Iraq.”", "Howard J. Shatz, a staff member of President George W. Bush’s Council of Economic Advisers, concurred. In a phone interview, Shatz — who is now a senior economist at the RAND Corporation and whose research includes the finances and management of ISIS — told us revenue from Iraqi oil fields “would not have made much of a difference” to ISIS.", "“They did have control over some Iraq oil fields, but they were nothing compared with Syrian oil fields,” Shatz said.", "As a candidate, Trump frequently mentioned that the United States should have kept the oil in Iraq as compensation for the money that the U.S. spent during the Iraq War and reconstruction. It is something that he has been saying for years, dating to at least 2011.", "In remarks he made at the CIA during his first full day in office, Trump brought up the Iraq oil fields again. He turned at one point to Rep. Mike Pompeo, who has since been confirmed by the Senate as Trump’s CIA director, and suggested that ISIS probably would not exist “if we kept the oil” in Iraq.", "Trump, Jan. 21: I always used to say, keep the oil. I wasn’t a fan of Iraq. I didn’t want to go into Iraq. But I will tell you, when we were in, we got out wrong. And I always said, in addition to that, keep the oil. Now, I said it for economic reasons. But if you think about it, Mike, if we kept the oil you probably wouldn’t have ISIS because that’s where they made their money in the first place. So we should have kept the oil. But okay. Maybe you’ll have another chance. But the fact is, should have kept the oil.", "The president repeated that claim three times during an interview with ABC News’ David Muir that aired on Jan. 25, when Trump was asked about his remarks at the CIA.", "Muir, Jan. 25: You brought up Iraq and something you said that could affect American troops in recent days. You said, “We should’ve kept the oil but okay maybe we’ll have another chance.” What did you mean by that?", "Trump: Well, we should’ve kept the oil when we got out. And, you know, it’s very interesting, had we taken the oil, you wouldn’t have ISIS because they fuel themselves with the oil. That’s where they got the money.", "In that same interview, Trump later said, “We should have taken the oil. You wouldn’t have ISIS if we took the oil.” And still later he said, “We should’ve taken the oil. And if we took the oil you wouldn’t have ISIS.”", "Let’s briefly recap how and when ISIS formed, and then look at how it was financed.", "As we have written before, the terrorist group has its roots in the U.S. invasion of Iraq in March 2003. Abu Musab al-Zarqawi, a Jordanian, formed al Qaeda in Iraq (AQ-I) in October 2004, according to a Jan. 18 report by the nonpartisan Congressional Research Service. Zarqawi was killed in a U.S. airstrike in June 2006, and shortly after “AQ-I leaders repackaged the group as a coalition called the Islamic State of Iraq (ISI),” CRS said.", "Islamic State of Iraq became known as ISIS in April 2013.", "CRS, Jan. 18: By early 2013, the group was conducting dozens of deadly attacks a month inside Iraq and had begun operations in neighboring Syria. In April 2013, Abu Bakr al Baghdadi announced his intent to merge his forces in Iraq and Syria with those of the Syria-based, Al Qaeda affiliated group Jabhat al Nusra (Support Front), under the name of the Islamic State of Iraq and the Levant (ISIL/ISIS).", "Experts we interviewed attributed the rise of ISIS to multiple factors, most flowing from the U.S.-led invasion of Iraq: sectarian strife in Iraq (Sunni opposition to U.S. forces and the ruling Shia party); decisions by the U.S.-led provisional coalition government in 2003 to disband the Iraqi army and ban the Baath Party, driving Sunnis into militant groups; the rule of Iraqi Prime Minister Nuri al-Maliki, whose Shia government further ostracized Sunnis; the withdrawal of U.S. troops from Iraq by Dec. 31, 2011 — a date agreed to by President Bush and carried out by the Obama administration; the Syrian civil war, which began in 2011; and the weakening of the Iraqi army, which abandoned its posts in Mosul in June 2014 and gave control of the city to ISIS.", "For this story, we interviewed experts on ISIS and terrorism financing and reviewed government statements and reports regarding the group’s finances.", "In its early years, the Islamic State of Iraq’s revenue-generating activities “closely resembled that of petty criminality, including significant revenues generated from sales of stolen goods,” according to “Foundations of the Islamic State: Management, Money and Terror in Iraq 2005-2010,” a 2016 report co-authored by Shatz for the RAND Corporation.", "RAND Corporation report, May 19, 2016: ISI’s revenue-generating activities in its formative years in Anbar governorate closely resembled that of petty criminality, including significant revenues generated from sales of stolen goods. In its new stronghold of Mosul, the group made money from new sources, particularly theft and extortion from the local oil sector and contract-based projects that were vulnerable to the group’s influence. ISI’s revenue-generating activities in Mosul in 2008 and 2009 closely resembled activities commonly used by organized-crime syndicates.", "The RAND Corporation’s report is based on documents and ledgers obtained from high-level officials within the Islamic State of Iraq. Shatz told us the group’s oil revenue was not a source of financing from 2005 to 2008, and there was not much from 2010 to 2012.", "But for a brief time, from August 2008 to early 2009, the Islamic State of Iraq received about 39 percent of its revenue from Iraqi oil fields.", "“But don’t forget this is happening at a time when we have 150,000 troops on the ground, when we are working very closely with Iraq on security, conducting a withering counter-terrorism strategy,” Shatz said, referring to the heavy presence of U.S. troops in the late 2000s. “This says we can’t be every place at every time.”", "Luay al-Khatteeb, the founding director of Iraq Energy Institute, wrote in February 2016 that the importance of oil revenue for ISIS and its predecessor was “vastly over-estimated,” writing “oil was not and is still not critical for IS.”", "“Its predecessor, the Islamic State of Iraq, managed to cause chaos for almost a decade without control over a single wellhead,” wrote Khatteeb, who is also a nonresident fellow at the Center on Global Energy Policy at Columbia University.", "In March 2011, the Syrian civil war started and the terrorist group began taking control of that country’s oil producing regions, as explained in an April 2015 report by the Congressional Research Service.", "CRS, April 10, 2015: Much of the physical and economic damage to the Syrian oil sector took place between March 2011 and June 2014, when IS forces expanded their control of oil producing regions in northeast.", "By late 2012, the Islamic State was reaping “massive cashflows” from eastern Syrian oil wells, selling the crude oil back to the Syrian government, as reported by the Guardian.", "Guardian, June 15, 2014: Over the past year, foreign intelligence officials had learned that Isis secured massive cashflows from the oilfields of eastern Syria, which it had commandeered in late 2012, and some of which it had sold back to the Syrian regime. It was also known to have reaped windfalls from smuggling all manner of raw materials pillaged from the crumbling state, as well as priceless antiquities from archaeological digs.", "But oil revenue was not the group’s primary source of funds in 2014 or 2015, according to U.S. terrorism financing officials and government reports.", "In a February 2015 speech, Deputy Assistant Secretary for Terrorist Financing Jennifer Fowler listed four primary revenue sources, in order:", "Harrell, who was the deputy assistant secretary for Counter Threat Finance and Sanctions from 2012 to 2014, told us in an email that revenue from Iraqi oil fields was not as important as robbery and other criminal activity.", "“Within Iraq, ISIS’s largest sources of revenue were robbery and looting — for example, in 2014 ISIS may have looted more than $400 million from the Iraqi central bank branch in Mosul (when ISIS overran Mosul in 2014),” Harrell said. “ISIS also always extorted large sums of money from the population under its control in Iraq.”", "In her speech, Fowler did not say how much of ISIS’s oil revenue came from Iraq in 2014. But al-Khatteeb of the Iraq Energy Institute in a September 2014 CNN interview estimated at that time that two-thirds of ISIS’s oil production came from Syria: 25,000 barrels per day from Iraq and 50,000 barrels per day from Syria.", "ISIS generated much more oil revenue in 2015. But again, it was not the group’s primary source of financing, and most oil revenue still came from Syrian oil fields — not Iraqi oil fields.", "ISIS had total revenues of $1.18 billion in 2015, according to a 2016 report by the inspectors general for the State Department, Defense Department and US AID. The terrorist group’s primary source of financing that year was extortion, stolen goods and taxes, at a combined total of $600 million. Oil accounted for $480 million.", "That report didn’t say how much oil revenue came from Iraq and how much came from Syria. However, a former Bush administration counterterrorism official told the House Financial Services Committee in May 2015 that about 90 percent of oil produced by ISIS came from Syrian oil fields.", "“The group is estimated to produce forty-four thousand barrels a day from Syrian wells and four thousand barrels a day from Iraqi ones. The group then sells the crude to truckers and middlemen, netting an estimated $1 to $3 million a day,” said Celina Realuyo, who served as the State Department director of Counterterrorism Finance Programs from 2002 to 2006 and is now a professor at the William J. Perry Center for Hemispheric Defense Studies at the National Defense University.", "At a Nov. 13, 2015, press conference, Col. Steve Warren, a defense spokesman, said about two-thirds of ISIS’ oil revenue comes from one region in Syria along the eastern border with Iraq. “We estimate that about two-thirds of their oil revenue comes from the Deir ez-Zor region,” Warren said.", "While ISIS has controlled most of Syrian oil fields, the group has had control of only some smaller oil fields in Northern Iraq, Shatz said. Iraq’s principal petroleum centers are located in the south and have been largely unaffected by the Iraq War and Syrian civil war.", "For that reason, Shatz said that ISIS’ revenue from Iraqi oil fields has been helpful, but not essential to the group’s finances.", "“Even if the Northern Iraqi fields had been well protected [by the U.S.], it would not have made much of a difference because they had Syrian fields,” Shatz said.", "Trump said “you wouldn’t have ISIS” if the U.S. had “kept the oil” in Iraq, because “that’s where they got the money.” But the evidence shows ISIS had a diversified portfolio and received more of its finances from robbery, extortion, taxes and Syrian oil than it did from Iraqi oil fields.", "Correction, Feb. 10: We have fixed a typo. Instead of “million,” the article originally said that in 2015 ISIS made $480 billion from oil and $600 billion from extortion, stolen goods and taxes.", "FactCheck.org Rating:", "Read More", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]