["An NYPD anti-terrorism officer stands guard with a K-9 unit at a military recruiting station in Times Square, on July 17, 2015. Security at military recruiting centers will be reviewed in the aftermath of a shooting in Tennessee. (AP/Bebeto Matthews)", "A day after the shooting rampage at two military sites in Chattanooga that would ultimately take the lives of four Marines and a Navy petty officer, former Florida Gov. Jeb Bush -- a Republican presidential candidate -- pointed the finger at former President Bill Clinton’s administration for a law that he said banned the carrying of guns by military recruiters.", "The shootings took place at two sites -- a military recruiting office in a strip mall and a Navy Operational Support Center. The gunman -- Mohammad Youssef Abdulazeez, 24, a native of Kuwait who had lived in Tennessee for most of his life -- was shot dead by police. Authorities are investigating the killings but haven’t yet confirmed a terrorist motive.", "Speaking at a Carson City, Nev., town hall on July 17, Bush said, \"A law was passed, apparently in the Clinton administration, about whether, in recruiting offices … Marines or other military should be able to have guns. Apparently it is prohibited.\"", "Bush was one of several Republican candidates to call for an end to such a gun prohibition. Former Arkansas Gov. Mike Huckabee, another GOP presidential candidate, also pointed blame at Clinton.", "Bush’s claim raised two questions for us: Are guns prohibited at recruiting offices? And if so, is that due to a law passed under President Clinton?", "Policies about guns and the military", "As it turns out, there is a policy that’s relevant here -- but it’s not as straightforward as Bush suggests, and it wasn’t written under Clinton. It stemmed from an effort under Bush’s father, then-President George H.W. Bush.", "In 1992, when Bush was president, the Department of Defense issued a directive related to firearms for military personnel. That directive replaced an earlier one from 1986. The directive doesn’t specifically address recruiting offices, but it applies broadly to military sites.", "The 1992 directive, signed by then-Deputy Secretary of Defense Donald Atwood, didn’t outright ban military personnel from carrying weapons. Instead, it said that only certain employees could carry weapons, including those who worked in law enforcement, security and prisons. The directive also did not apply in certain situations, such as in war zones.", "The policy explains that the intent is \"to limit and control the carrying of firearms by DoD military and civilian personnel.\" So the policy did cover most military personnel.", "Those who have opposed this policy have sometimes referred to it as a Clinton-era policy because the Army did release a regulation that implemented the Defense Department directive in March 1993, two months after Clinton took office. (For more on a similar claim that circulated after a mass shooting at the Washington, D.C., Navy Yard, see the fact-checking website Snopes.)", "A new Defense Department directive issued in April 2011 after a mass shooting at Ft. Hood in Texas tweaked the policy with some new phrases, including that workers have an \"inherent right to self-defense.\" However, the overall policy essentially remained the same. Here is part of that directive:", "\"Arming DoD personnel (i.e., administrative, assessment, or inspection, not regularly engaged in or directly supervising security or law enforcement activities) shall be limited to missions or threats and the immediate need to protect DoD assets or persons’ lives. DoD Components have the discretion to keep designated staff personnel qualified and available or on call to perform duties.\"", "The recruiting office where the shooting occurred represented all four branches of the military. We could not reach a spokesperson for the Marines. However Brian Lepley, a spokesman for U.S. Army Recruiting Command, said that \"weapons are not permitted in recruiting stations by DoD because there are no law enforcement personnel there.\"", "Many on the Internet noted the gun-free sign on the military recruiting office door.", "\"Once you cross that door, you are not allowed to have a weapon in there,\" Lepley said.", "The president’s role", "So should we blame Clinton -- or any president -- for the Department of Defense directive?", "\"No, I wouldn’t,\" said Richard Brennan, a senior political scientist at the RAND Corporation and a career Army officer. \"And frankly I’m unaware of any statute that prevents military personnel from carrying weapons. What there has been at least since 1975 when I was a cadet were policies and regulations that govern the circumstances under which military personnel can carry weapons.\"", "Over the years, those policies have consistently said that personnel working as law enforcement and protecting life or federal property can carry firearms.", "\"There hasn’t been marked change in this,\" he said.", "While a president could get involved in this level of detail if they wanted to, this is generally settled at a lower pay grade. Such directives are \"internally generated by a need seen either within civilian military leadership or military leadership,\" Brennan said. Typically, they update earlier policies, he added.", "Steven Bucci, a military expert for the Heritage Foundation and former Army colonel, told PolitiFact that the policy about firearms existed for decades before Clinton, or Bush for that matter.", "\"As far back as when I joined the military in 1973, and probably further back, you have never been able to carry firearms, privately owned or government, on military installations. You always had to register it with the MP's and keep them locked in the arms rooms,\" he said, referring to military police.", "Bucci has disputed previous claims that President Clinton \"disarmed\" the military.", "\"No one ‘disarmed’ the military -- the military itself prefers to manage good order and discipline by not having everyone armed,\" he told PolitiFact.", "In the wake of the shooting rampage in Tennessee, several lawmakers have said they plan to introduce bills to get rid of the military directive about firearms. Then-Rep. Steve Stockman, R-Texas, introduced a bill in 2013 to repeal the Defense Department directive and prohibit the military from instituting any restrictions on guns. But it never received a vote.", "We sent a summary of our findings about the defense directives to a spokeswoman for Bush. She reiterated his viewpoint.", "\"The Clinton administration implemented this policy to prohibit guns in military recruitment offices,\" said Allie Brandenburger. \"Gov. Bush believes military recruiters should be allowed to carry guns.\"", "Our ruling", "Bush said that \"a law was passed, apparently in the Clinton administration, about whether, in recruiting offices … Marines or other military should be able to have guns. Apparently it is prohibited.\"", "The Department of Defense issued a directive, not a law, in 1992 -- when Bush’s father was president. It did not ban firearms outright; it limited them to military personnel who held certain jobs, such as positions in law enforcement. And while the Army issued a regulation implementing that directive in 1993 -- two months after Clinton was in office -- experts say it is not the sort of matter that would typically rise to the attention of a president.", "Bush has a point that, for the most part, military personnel can’t have firearms at recruiting offices. But most of everything else he said was incorrect. We rate this claim Mostly False.", "Former Florida Gov. Jeb Bush, Carson City, Nevada town hall, July 17, 2015", "U.S. Department of Defense, Directive AD A272 176, Feb. 25, 1992", "U.S. Department of Defense, Directive, April 1, 2011", "U.S. Army, Army Regulation 190-14, March 13 1992", "Snopes, \"Alarming disarming,\" Last updated July 16, 2015", "Fox News op-ed , \"Gun-free zones are really just sitting duck zones for Islamic radicalists,\" July 17, 2015", "Washington Post, \"From Tenn. to Times Square, military recruiting centers prove easy targets,\" July 17, 2015", "Associated Press, \"Bush, Walker, Trump criticize gun ban in recruiting offices,\" July 18, 2015", "Chattanooga Free Press, \"Nation’s defenders defenseless, some say,\" July 18, 2015", "Christian Science Monitor, \"Fort Hood shooting: Could armed soldiers on base prevent tragedy?\" April 4, 2014", "The Blaze, \"This is why most military personnel aren’t armed on bases -- and it’s not Clinton’s fault,\" Sept. 17, 2013", "Military Times, \"Bill would let troops carry guns on military stateside bases,\" Sept. 27, 2013", "Tampa Bay Times, \"Gov. Rick Scott orders National Guard recruiters to armories,\" July 18, 2015", "Interview, Brian Lepley, U.S. Army Recruiting Command spokesman, July 20, 2015", "Interview, Rick Brennan, senior political scientist at the RAND Corporation and a career Army officer, July 20, 2015", "Interview, Steven Bucci, Director, Douglas and Sarah Allison Center for Foreign and National Security Policy at the Heritage Foundation, July 20, 2016", "Interview, LCDR Nicole Schwegman Navy Office of Information, July 20, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]