["The screenshot can be seen on a Facebook post, which received hundreds of shares and is archived here, captioned: “Sums up everything g that is wrong with this God forsaken place..”", "Another post this month shared the claim here. Claims from 2017 can be found here and here.", "The claims were attributed to Angie Motshekga, minister of basic (primary and lower secondary) education. Her department released a statement on July 7, 2017 dismissing and condemning the reports.", "“Another fake news doing its rounds is that the Minister of Basic Education wants to help school “drop outs” get employment by giving them Matric certificates as long as they are able to read and write,” said the statement.", "“This is not true, the Minister has said no such thing and there are no plans to give anyone who does not pass the National Senior Certificate examinations a Matric Certificate.”", "The other claim the department denied at the time suggested that Motshekga believed that too much studying causes brain cancer.", "The department noted that despite the “ridiculous” nature of the statements, members of the public had expressed concern over the reports.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]