["About this rating", "On June 10, 2019, the supermarket tabloid Globe published a story exclaiming that singer Dolly Parton was \"paralyzed!\":", "Despite the matter-of-fact nature of this clickbait headline, the story has numerous problems. Anyone who flipped past the sensational cover to read the contents of this article would have seen that the \"expert diagnosis\" was not provided by Parton's personal physician but by someone who simply watched a video of the singer.", "Here's an excerpt from the report (emphasis ours):", "“The muscles on the left side of her face are not functioning properly,” says Florida-based Dr. Gabe Mirkin, who has not treated Dolly, but reviewed video of the 73-year-old blond bombshell. “They aren’t moving and appear to be paralyzed!”", "Mirkin thinks Dolly may have Bell’s palsy, a viral infection he believes paralyzed the muscles in her cheek near the left side of her mouth.", "Surprisingly, this isn't the biggest problem with the article's claim.", "The included picture appears to come from an interview Parton gave to \"60 Minutes Australia\" in 2013. Presumably, this is the same video that Mirkin reviewed to \"diagnose\" Parton with Bell's Palsy. In other words, this \"breaking news\" is based on a piece of footage that is more than five years old. Since this interview, Parton has released a new album and toured North America.", "Here's a side-by-side graphic featuring the Globe photograph and a comparable still from the \"60 Minutes Australia\" interview. Notice how Parton is wearing the same earrings and same-colored dress in both images:", "While this single still may have captured Parton's expression in an awkward moment, nothing appears wrong with her in the actual video:", "Bliss, Karen.   \"Dolly Parton Talks 'Pure & Simple': 'This Particular Album Is Almost Like a Garage Band.'\"\r\n    Billboard.   7 August 2016.", "Gambrell, Mandy.   \"Dolly Parton And Hallmark Are Teaming Up To Make A Christmas Movie.\"\r\n    Simple Most.   17 July 2019.", "Pao, Maureen.   \"Dolly Parton Gives The Gift Of Literacy: A Library Of 100 Million Books.\"\r\n    NPR.   1 March 2018.", "Globe.   \"Dolly Parton's Paralyzed!\"\r\n    10 July 2019.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]