["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "In an April 15, 2014, debate on immigration, Democrat Julián Castro said Republican Dan Patrick filed legislation akin to the 2010 Arizona mandate that police officers ask individuals about their immigration status.", "\"He filed (Senate Bill) 1070-like show-me-your-papers legislation,\" the San Antonio mayor said in the debate aired by the Univision network. Castro said this action left Patrick out of step with Texas Democrats and Republicans who, he suggested, are more supportive of immigrants regardless of origin.", "Patrick, the Houston state senator in a May 27 runoff with incumbent David Dewhurst for the GOP lieutenant governor nomination, replied: \"No, mayor. That’s a lie.\" Asked to elaborate, Patrick said: \"First of all, that bill, which didn’t pass, would have only … come into play had police had suspicions that someone had committed a crime and then\" they would \"turn it over to\" the federal Immigration Customs Enforcement agency, he said, \"to try to keep us in line with Secure Communities,\" the program enabling fingerprints of arrested individuals to be checked against federal crime and immigration databases.", "Patrick further said he’d decided, \"based on things the federal government has done, that that bill will not pass and will not be effective.\"", "We wondered if indeed Patrick filed an Arizona-type \"show-me-your-papers\" proposal.", "Looks like it.", "Castro's basis", "By email, Castro spokesman Jaime Castillo quoted Patrick’s measure, which died without a hearing in the 2011 legislative session, and said it was similar to a vital part of Arizona’s law.", "As recapped by Castillo, Patrick’s legislation specified: \"A peace officer shall inquire into the lawful presence of any person who is lawfully stopped, detained, or arrested on other grounds if the officer has a reasonable suspicion to believe the person has violated a criminal provision of the federal immigration laws (sic).\"", "Castillo said Arizona's law \"included language authorizing police officers to check immigration status if they have reasonable suspicion to believe that someone is here illegally and, before\" court rulings  \"to arrest without a warrant, anyone ‘the officer has probable cause to believe … has committed any public offense that makes the person removable from the United States.’\"", "Let’s look at both.", "Arizona law", "Arizona’s 21-page measure, signed into law in April 2010, included provisions intended to \"work together to discourage and deter the unlawful entry and presence of aliens and economic activity by persons unlawfully present\" in the country.", "A key element of the law--which included state-level restrictions on human smuggling and workers congregating in search of day jobs--directed law officers at all levels to check the status of people stopped for various reasons who might appear to be in the U.S. illegally. Another section said the immigration status of arrested individuals must be checked before their release. The law also provided for officers to transport individuals lacking proof of legal residency to federal authorities.", "Generally, as noted in a 2010 fact check, the law required legal immigrants to carry papers that confirmed their legal status, though the U.S. Supreme Court later threw out parts of the law that would have made state crimes out of federal immigration violations, as reported by The Associated Press in June 2012. According to the AP’s account, the court rejected the law’s mandate that immigrants obtain or carry immigration registration papers. It also tossed language making it a state criminal offense for an illegal immigrant to seek work or hold a job, the AP said, and voided a provision permitting police to arrest suspected illegal immigrants without warrants.", "The court let stand the law’s requirement that police officers check the status of people stopped for various reasons who might appear to be in the U.S. illegally. Even then, the AP reported, the justices said the provision could be subject to additional legal challenges. Also, they removed some teeth by prohibiting officers from arresting people on immigration charges.", "Patrick’s proposal", "According to a Texas legislative website, Patrick filed his measure, SB 126, on Nov. 8, 2010 in anticipation of the 2011 legislative session. The proposal called for revising the state’s Code of Criminal Procedure by specifying that a \"peace officer shall inquire into the lawful presence of any person who is lawfully stopped, detained, or arrested on other grounds if the officer has a reasonable suspicion to believe the person has violated a criminal provision of the federal immigration laws.\"", "If the officer has \"probable cause\" to believe as much, the officer could arrest the person and \"shall identify and report the person to\" ICE, the proposal said. Also, Patrick’s measure voided any local ordinance, regulation or policy interfering with an officer carrying out the described duty, furthermore giving legal immunity to an officer, agency or other governmental entity for any cause of action connected to carrying out such duties aside from intentional misconduct, recklessness or gross negligence connected with the intended law.", "At the time, news stories said Patrick had filed a proposal like the show-your-papers part of the Arizona law, though Patrick stressed in interviews that police officers would be required to ask a person if they were in the state legally only if they reasonably suspected otherwise. A Nov. 13, 2010, news story in the San Antonio Express-News quoted him as saying law agencies wanted the question to be required, instead of being optional, to avoid complaints of profiling.", "In January 2011, Patrick separately told the Associated Press and an MSNBC host that he’d been to Arizona to see its law in action. Patrick said on MSNBC: \"It's workable for our police. And then once a police officer says to someone, are you legally present, because they don't have any identification, we then give the discretion to the officer to take the next step. Is that an arrest, is it detaining that person on suspicion of another possible crime?\"", "Logan Spence, Patrick’s lieutenant governor campaign manager, replied to our query about Patrick’s proposal with an email suggesting Patrick’s proposal was more narrow than the entire Arizona statute. By phone, Castillo said Castro didn’t say in the debate that Patrick filed the entire Arizona law.", "Our ruling", "Castro said Patrick \"proposed Arizona-style show-me-your-papers legislation.\"", "Patrick’s unsuccessful proposal was similar to, and modeled on, Arizona’s show-your-papers provision. We rate this claim as True.", "TRUE – The statement is accurate and there’s nothing significant missing.", "Click here for more on the six PolitiFact ratings and how we select facts to check.", "Email and telephone interview,  Jaime Castillo, interim chief of staff, San Antonio Mayor Julián Castro, April 16 and May 6, 2014", "Senate Bill 126, 2011 legislative session, bill history and text, Texas Legislature Online, Texas Legislative Council (accessed May 1, 2014)", "Arizona’s Senate Bill 1070, as signed into law April 2010, Office of the Governor of Arizona (accessed May 1, 2014)", "Truth-O-Meter article, \"Cornyn says the Arizona immigration law bans racial profiling,\" PolitiFact Texas, May 28, 2010", "News story, \"High court rejects part of Arizona immigration law,\" the Associated Press, June 25, 2012 (accessed May 1, 2014)", "Senate Bill 126, 2011 legislative session, bill history and text, Texas Legislature Online, Texas Legislative Council (accessed May 1, 2014)", "Emails, Logan Spence, campaign manager, Dan Patrick lieutenant governor campaign, May 5, 2014", "News story, \"Immigration will be lawmakers' hot potato,\" San Antonio Express-News, Nov. 13, 2010 (accessed May 1, 2014)", "Transcript, interview of state Sen. Dan Patrick by Contessa Brewer, MSNBC, Jan. 3, 2011, Federal News Service (Nexis search)", "Emails, Logan Spence, campaign manager, Dan Patrick lieutenant governor campaign, May 5, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]