["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "President Donald Trump speaks in an address to the nation from the Oval Office at the White House about the coronavirus, March, 11, 2020, in Washington. (Doug Mills/The New York Times via AP, Pool)", "Health insurance companies said they will waive costs for coronavirus tests, not treatment.", "A shortage in diagnostic supplies means that testing is limited.", "A major health insurance lobbying group said that there are currently no industry-wide plans to waive costs for hospital stays or other treatment.", "As coronavirus cases multiply in the United States, one concern Americans have is what they can expect to pay if they seek treatment.", "Speaking from the White House, President Donald Trump suggested that people with health insurance shouldn’t have to worry about that.", "\"Earlier this week, I met with the leaders of the health insurance industry who have agreed to waive all co-payments for coronavirus treatments, extend insurance coverage to these treatments, and to prevent surprise medical billing,\" Trump said March 11.", "We found that’s an exaggeration at best.", "We contacted spokespeople for the White House and the Department of Health and Human Services seeking clarification and did not get a response. But in an appearance March 12 on CNN, Vice President Mike Pence said insurers have agreed to waive copays for coronavirus tests — not treatment.", "The telecast of Trump’s March 10 meeting with the insurance industry shows that, in fact, company leaders agreed to waive all co-payments for coronavirus tests — not treatments.", "\"All the insurance companies here — either today or before today — have agreed to waive all copays on coronavirus testing and extend coverage for coronavirus treatment in all of their benefit plans,\" Pence said.", "That’s a big distinction.", "For one thing, a shortage in diagnostic supplies means that many people aren’t receiving tests. You have to present symptoms to qualify. If you don’t receive a test, but do get screened, that qualifies as a doctor’s visit — not a coronavirus test. That qualifies for a copay.", "\"It’s not even waiving copays or deductibles for services you need to get tests — emergency visits, doctors, etc.,\" noted Sabrina Corlette, a professor at Georgetown University's Health Policy Institute. \"It’s ‘we’ll waive copays for the tests,’ which is the lab service.\"", "Health plans will cover treatment for coronavirus, including hospital stays, said Kristine Grow, a spokeswoman for America’s Health Insurance Plans, a major lobbying group. But they won’t necessarily waive copays or cost-sharing for that treatment.", "And there are other nuances to getting treatment that might entail higher cost-sharing. If a coronavirus diagnosis ultimately means a patient needs to be put in a private room, or some other form of isolation, that’s a service that costs more. And even if it’s covered, patients could end up paying part of the price out-of-pocket, Corlette said.", "For surprise medical bills, it’s trickier. There is a lot insurance plans can do, such as waiving in-network cost-sharing when someone gets treatment for the coronavirus, or agreeing to change their benefit structure if a patient gets care from someone out of network. But they don’t appear to have explicitly committed to doing those things, Corlette said.", "And the responsibility for surprise billing doesn’t just fall on insurance companies, said Zack Cooper, a health economist at Yale University, who studies surprise billing. Doctors and hospitals who are out-of-network are still able to balance bill — that is, send patients a bill for whatever insurance has not paid.", "Plus, big insurance companies are only part of the picture. About 61% of Americans with employer-sponsored health care have what is called a \"self-insured\" plan. Those plans, which are regulated by federal law,  can opt out of the agreements around copayments.", "With all those caveats, Corlette said, Trump’s assertion is \"misleading.\"", "The statements released by health insurance companies about waived costs are not as comprehensive as Trump indicated.", "UnitedHealthcare announced that it has \"waived all member cost sharing, including copays, coinsurance and deductibles, for COVID-19 diagnostic testing provided at approved locations in accordance with Centers for Disease Control and Prevention guidelines for all commercial insured, Medicaid and Medicare members. UnitedHealthcare is also supporting self-insured customers choosing to implement similar actions.\"", "Ethan Slavin, a spokesman for Aetna, gave a similar response: He said the company will waive associated costs for members who get tested \"at any authorized location.\"", "Anthem announced March 6 that it would provide coverage of the coronavirus screening test at no out-of-pocket-cost.", "But again, those commitments are not comprehensive.", "The statement by UnitedHealthcare doesn’t state that they are waiving all cost-sharing with respect to all emergency treatment or post stabilization, for example.", "\"The only place you can get tested in a lot of communities is still the hospital emergency room department, so that’s an emergency visit,\" said Sara Rosenbaum, a George Washington University professor of health law and policy.", "While the White House meeting shows that at the moment health insurance companies have agreed to not charge copays for the tests, the rules could change rapidly for other costs, said Thomas Miller, an expert on health care policy at the conservative American Enterprise Institute.", "\"Looking over the horizon we are going to be doing a lot of things differently,\" he said.", "Joseph Antos, another health care expert at AEI, said that since the final bills for treatment are settled after the patient has been treated, that allows negotiation or other consideration for patients who can’t cover what could be very high cost-sharing amounts in full.", "\"Most higher income people with good insurance should be able to deal with those costs and should not expect additional discounts related to coronavirus,\" he said.", "It’s also possible that Congress will decide to pass surprise billing legislation given the circumstances.", "Trump said the health insurance industry has \"agreed to waive all co-payments for coronavirus treatments.\"", "This isn’t what those companies said. They agreed to waive copayments for coronavirus testing. That’s only one component, and it’s a far cry from waiving copayments for all treatment. And, despite what the president’s phrasing may imply, the Americans who seek a test and are turned away will not have their copayments waived either.", "Patients who seek testing for coronavirus, and even those who end up needing treatment, will likely still end up facing medical bills. The size and scope depends on their insurance plans, and on what doctors they see.", "The president’s statement is inaccurate. We rate it False.", "Factbase, Remarks: Donald Trump Addresses the Nation on the Coronavirus from The Oval Office - March 11, 2020", "White House, Remarks by President Trump in Address to the Nation, March 11, 2020", "Anthem, Anthem’s affiliated health plans waive member costs for COVID-19 testing, while supporting telehealth and 90-day maintenance medication supply, March 2020", "KFF, 2019 Employer Health Benefits Survey, Sep. 25, 2020.", "United Healthcare Group, UnitedHealth Group Reinforces Actions Taken to Provide Members and Patients with COVID-19 Support and Resources, March 2020", "The Hill, Pence: Major health insurers have agreed to waive copays for coronavirus tests, March 10, 2020", "CNN New Day, Interview with Vice President Mike Pence, March 12, 2020", "Politico newsletter, March 12, 2020", "Telephone interview, Kristine Grow, Senior Vice President of Communications for America’s Health Insurance Plans, March 12, 2020.", "Telephone interview, Sara Rosenbaum, George Washington University professor of health law and policy, March 12, 2020", "Telephone interview, Sabrina Corlette, a professor at Georgetown University's Health Policy Institute, March 12, 2020.", "Email interview, Zack Cooper, associate professor of public health at Yale University, March 12, 2020.", "Email interview, Ethan Slavin, spokesman for Aetna, March 12, 2020", "Email interview, Joseph Antos, American Enterprise Institute health policy expert, March 12, 2020", "Email interview, Thomas Miller, American Enterprise Institute health policy expert, March 12, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]