["जिस फौजी ने बेक़सूर आतंकवादी को घसीटा उसको फांसी दो नहीं तो देश में आग लगा देंगे (The soldier who dragged an innocent terrorist should be hanged, otherwise we will set the country on fire- translated). This statement has been attributed to Priyanka Chaturvedi, national spokesperson of the Congress party, by a Facebook page Yogi Sarkar. Yogi Sarkar has a following of over 480,000. The quotation was posted on September 17 and has been shared over 6200 times so far.", "Posted by Yogi Sarkar on Sunday, September 16, 2018", "On September 13, three terrorists belonging to the Jaish-e-Mohammed were killed in an encounter with security forces at Reasi district in J&K. After the encounter ended, the slain terrorists were chained and dragged by security personnel. It is in the context of this photograph that the quote has been attributed to Chaturvedi.", "The Congress spokesperson meanwhile has clarified via a tweet that she has not made the statement ascribed to her.", "Another day, another fake quote attributed to me, yet again viral on Facebook. Facebook is becoming a hub of lies and fake stories. Get well soon wishes to those afflicted by liar-itis and fake-itis virus since 2014. https://t.co/w2e4pZFyou", "— Priyanka Chaturvedi (@priyankac19) September 18, 2018", "Priyanka Chaturvedi has been a constant target for purveyors of misinformation who have credited false statements to her. Earlier, when the Mandsaur rape case had surfaced, a quotation was ascribed to Chaturvedi according to which she had defended the rapist saying that the Congress party stands with him, and that it is the right of Muslims to rape.", "Following the circulation of this fake quote, Chaturvedi and her daughter were threatened on social media.", "In another instance, when the Asian Games were on at Jakarta in August 2018, a fake quote ascribed to Chaturvedi was doing the rounds, according to which she had said, “करोड़ों रुपये खर्च करके हम देश के लिए १० ग्राम सोना जीतने जाते हैं, इतने में तो कई किलोग्राम सोना ख़रीदा जा सकता है, किसान भूखा मर रहा है और इन्हें खेल और बुलेट ट्रैन की पड़ी है” (We spent crores to win 10 grams of gold, with this money we can buy many kilograms of gold instead. Farmer is dying hungry and they are concerned about sports and bullet trains- translated).", "This too was fake, as was confirmed by Chaturvedi herself in a tweet of August 24.", "A fake quote attributed to me about India’s sporting heroes representing us in the Asian Games by a parody handle of ANI has gone viral on Facebook. Wish the imbeciles behind this, engaged on issues rather than fake quotes.", "— Priyanka Chaturvedi (@priyankac19) August 24, 2018", "Attributing false quotations to public figures is among the most predictable and routinely used tactic on social media, requiring only an image and provocative and/or ludicrous text to be placed together. Despite the obvious nature of these quotations and clarifications to the contrary, there hardly seems to be a let-up.", "Donate Now", "Arjun Sidharth is a writer with Alt News. He has previously worked in the television news industry, where he managed news bulletins and breaking news scenarios, apart from scripting numerous prime time television stories. He has also been actively involved with various freelance projects. Sidharth has studied economics, political science, international relations and journalism. He has a keen interest in books, movies, music, sports, politics, foreign policy, history and economics. His hobbies include reading, watching movies and indoor gaming.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]