["On May 7, it was reported in the media that 24-year-old accused Mohammed Shakeel was arrested by Chaderghat police for allegedly raping a minor Dalit girl. Several outlets claimed that the accused was a local AIMIM worker. According to reports, the accused allegedly lured the 16-year-old minor and had raped her in Hyderabad’s Chaderghat. The police has registered a case under sections 448, 376, 508 of the Indian Penal Code along with sections 3 and 4 of the POSCO Act and section 3 (2) (v) of Scheduled Caste and Scheduled Tribe Prevention of Atrocities (PoA) Act.", "“The issue has become political in Telangana as the perpetrator has been accused of being an aide of AIMIM Malakpet MLA Ahmed Bin Abdullah Balala and several pictures of them together have surfaced online. However, the legislator has denied any links and has assured that strict action will be taken by the police against the accused.” reported The News Minute.", "On May 8, AIMIM MLA Ahmed Balala retweeted a tweet posted by one Sumaiya Khan. It carried two graphics refuting the claims that Mohammed Shakeel is associated with the party. Shockingly, one of the graphics has misused Alt News logo. The graphic falsely claims that an Alt News fact-check found that Shakeel has no links with AIMIM.", "Alt News hasn’t published any fact-check claiming that Shakeel is not a member of AIMIM. The poster has misused Alt News logo. As reported by media outlets, several images of Shakeel have surfaced online where he is seen along with AIMIM leaders including Malakpet MLA Ahmed Balala. However, it may be reiterated that the legislator has denied any links with the accused.", "#Our work is our identity#", "Minor (15years) girl raped by #MIM leader Shakeel at Chaderghat police station limits Hydreabad", "#JusticesForMahalaxmi#", "Posted by Khaja Bilal Ahmed on Wednesday, 6 May 2020", "We spoke with a party functionary who on the condition of anonymity confirmed that Shakeel was a very active party worker. While Alt News is independently unable to verify Shakeel’s association with the AIMIM, it is true that he was seen with party leaders in several photos.", "A fake graphic created by misusing Alt News logo was falsely passed off as an authentic fact-check to inject credibility in the claim that Shakeel has no association with AIMIM.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]