["On March 15, at least 49 people were killed in a horrific massacre at two mosques in Christchurch, New Zealand. Two days later, a claim started circulating on social media that 350 people have converted to Islam, after the Christchurch massacre, in New Zealand. “Did you know? The terrorist attack in #Christchurch killed 51 Muslims, today approximately 350 people have converted/reverted back to #Islam in New Zealand. Stop fearing/hating Islam, please try to understand it.”, tweeted Zain Khan, a broadcast journalist based in UAE, on March 18. The tweet included three pictures of women wearing a hijab.", "Did you know? The terrorist attack in #Christchurch killed 51 Muslims, today approximately 350 people have converted/reverted back to #Islam in New Zealand. Stop fearing/hating Islam, please try to understand it.#NewZealandShooting #Islamophobia pic.twitter.com/X02TditdBI", "— Zain Khan (@ZKhanOfficial) March 18, 2019", "One Facebook user Javed Shaikh has posted these photographs with the same narrative. The post has garnered over 2000 shares so far.", "Multiple people on Twitter have shared the claim based on a blog published on March 17, 2019. “50 Muslims were killed on Friday in New Zealand & 350 people accepted Islam today in New Zealand”, states the title of a blog according to which 350 people have converted to Islam after the mass shooting in Christchurch. The blog also carried a photograph of a couple, where the woman was seen donning a hijab. It has garnered close to 3.8 lakh shares on Facebook alone.", "A website named KashmirGlacier.com had also used the same image featuring a couple with an identical narrative. A tweet by @ibrocan2007, an individual user was one of the earliest that Alt News could trace back to on social media. This was several hours before a blog was published by Loveforislamic. The archived version of the blog can be accessed here.", "ALHAMDULILLAH…", "They killed 50 Muslims while praying yesterday and today over 350 accepted Islam in New Zealand 🙌🏽💝🌹 pic.twitter.com/QhRQ6LHlmU", "— ABOKI MX CITY (@ibrocan2007) March 17, 2019", "A Facebook page, Sajid Hashmat has shared a video with an identical narrative, which has gathered more than 38,000 shares and 4 lakh views so far.", "50 Muslims were killed on Friday in New Zealand & 350 people accepted #Islam today in #NewZealand.", "Posted by Sajid Hashmat on Monday, 18 March 2019", "Several other individuals and pages have posted the same video claiming that 350 people have converted to Islam after the christchurch massacre.", "The video now viral on social media with a narrative that 350 people have been proselytized to Islam in New Zealand is at least 10 years old and unrelated. It was posted on YouTube on September 27, 2009, while the video stated that it dates back to 2007.", "Alt News found that the photographs shared as those of proselytized individuals are several years old and are not related to the claim. Using Google reverse image search on the images circulating on social media, here is what we have discovered:", "2. Nancy Allen, a Christian woman from South Carolina, USA had worn a hijab in support of Muslim women and freedom of religion, according to an article published by an online edition of American newspaper Arkansas Democrat-Gazette on February 14, 2016.", "3. The image of a woman wearing a blue coloured hijab is generic and has existed on the internet at least since September 2018.", "4. On Facebook, the picture of a woman holding a Quran in her hand was posted on December 22, 2016.", "Thus, old and unrelated pictures and video were circulated on the internet as those of people who converted to Islam after the attack in Christchurch. The source of the ‘350’ number was a poorly written blog. While the figure of 350 people converting to Islam cannot be independently verified, there are no references to any mass conversations in any media report.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]