["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Tim Hortons did not run out of donuts the day that Canada legalized marijuana. (AP Photo/Matt Rourke)", "Canadian donut sales were unlikely hurt by the legalization of marijuana.", "However, one blog’s claim that a Mary Jane-induced donut shortage caused Tim Hortons stores across the country to close early is laughable. Still, the story has been shared more than 100,000 times on Facebook, so we thought we’d clear the air, just in case.", "This story was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "On Oct. 17, 2018, Canada became the second country in the world to legalize recreational marijuana. The first was Uruguay. In the days that followed, several false news stories surfaced on social media speculating about repercussions of the legalization.", "The donut shortage story was published on World Daily News Report, and relied on quotes from a spokesman for Tim Hortons named James Dyke. There is no evidence that such a spokesman exists — Dyke has not been quoted in any other article and is not listed as an author on any Tim Hortons press releases.", "The World Daily News Report site includes a disclaimer that says all of its stories are fictional and that \"all characters appearing in the articles in this website – even those based on real people – are entirely fictional and any resemblance between them and any persons, living, dead, or undead is purely a miracle.\"", "The first day of marijuana sales did result in shortages — of cannabis, not donuts. Customers in Quebec waited in lines for hours. Cannabis-selling websites glitched, sold out of product and crashed. We can’t say the same for the Canadian donut industry.", "We rate this claim Pants on Fire!", "World Daily News Report, \"Canadians face major donut shortage after first day of cannabis legalization,\" Oct. 18, 2018", "The New York Times, \"If you’re going to Canada to buy weed, here’s what you need to know,\" Oct. 22, 2018", "Government of Canada, \"The Cannabis Act: The Facts,\" June 20, 2018", "Vice, \"Canada is already experiencing cannabis shortages,\" Oct. 18, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]