["The image was published on this New Zealand-based Facebook page on August 31, 2020.", "The Facebook post's caption reads in part: “Yesterday in Berlin. 5 million from all over Europe gathering for up to 5 days or more as they demand their government to resign for the Unite for Freedom Rally…”", "On August 29, 2020, thousands protested in Berlin against coronavirus restrictions before they were stopped by police for violating social distancing regulations, AFP reported here.", "The photo has been shared hundreds of times on Facebook alongside a similar claim here, here and  here . The claim was also circulating in Spanish, as AFP reported here.", "The claim, however, is false.", "A reverse image search on Google found the photo published here on July 12, 1997, by Berlin-based aerial photography agency Euroluftbild.", "The photo was taken here near the Strasse des 17 Juni.", "Its caption states: “Participants of the Loveparade at Ernst-Reuter-Platz - Strasse des 17. Juni music festival on the event concert site in the Charlottenburg district in Berlin, Germany”.", "Below is a screenshot comparison of the image in the misleading post (right) and the 1997 photo from Euroluftbild (left):", "Other photos from the 1997 edition of Love Parade, an annual music festival in Berlin, can be seen here and here on Euroluftbild’s website.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]