["About this rating", "In October 2017, a video posted to the YouTube page of Deerpark Christian Brothers School (a secondary school in Cork, Ireland) purported to show closed-circuit television footage from a school security camera that caught a \"ghost\" opening and closing doors and knocking over signs:", "The video was a viral hit. It earned coverage by a wide variety of outlets, including Today and the New York Post, and racked up more than 12 million views within a few weeks of its initial posting. Aaron Wolfe, the school's deputy principal, told news outlets that he didn't know how the video was made:", "\"We couldn’t understand how this had occurred,'' Wolfe told TODAY in an email. \"If it is a prank, it’s very well done!\"", "[..]", "\"The school is built on a site known as Green Gallows,'' Wolfe said. \"In the 19th century, criminals were hanged here. We only found that out on Monday. The pub nearby is actually called the Gallows.\"", "[...]", "\"People have suggested that we’ve used a green screen, or edited someone out,'' Wolfe said. \"I wish our school had these types of resources. Others have suggested that fishing line is used. I don’t see how fishing line could open the locker because the locker doors don’t stay closed unless the latch on it is turned.", "Despite Wolfe's spooky innuendo, we found a few clues indicating that this video featured some clever editing rather than a ghost.", "A few days after this video was originally posted, the school shared a photograph of the \"haunted hallway\" to their Facebook page along with a brief passage describing their hope that the area would be \"paranormal free\" that weekend. This image gives a wider view of the hallway — and also shows the security camera that presumably filmed this paranormal encounter. However, the placement of the school's actual security camera does not match up with the position of the camera used in the video:", "The ghost footage was taken at nearly eye level, whereas the visible security camera is located several feet higher and above the door. Also, the ghost footage shows the picture frames along the same wall that the actual security camera is located. If this footage was truly taken with this security camera, these frames would have been obscured or hidden.", "So the camera that shot the footage was either floating in mid-air (possibly held by a second ghost?) or — more likely — was set up on a tripod in the middle of the hallway, indicating that this is the work of humans, not ghosts.", "As these two cameras were in different positions, it wasn't possible to perfectly match up the resulting images. However, this comparison shows that the \"ghost\" footage was not taken from this security camera, despite the claim:", "This ghostly footage also conveniently appeared just a few weeks before the school's annual \"Fearpark\" event for Halloween. In fact, it was prominently featured in social media posts promoting the event:", "There were a few other clues that the phenomena in the footage were not the work of ghosts. For instance, when the caution sign is upended, the pattern on the floor briefly disappears, indicating that this footage featured clever editing, not paranormal activity:", "Even more telling, however, is how the locker door vanishes for a split second before the \"ghost\" flings papers on the floor. We've slowed down that moment to make it more apparent:", "All the students would have needed to make this video is a tripod, a camera, and some film editing software like After Effects — not the green that Wolfe alluded to in his interview with the Today Show.", "Here's a tutorial showing how a similar video was made using masking techniques in After Effects:", "The Cork school does appear to have a penchant for the paranormal. Students created elaborate props for the \"Fearpark\" event:", "Lots of preparation for FEARPARK going on in the Art room #FEARPARK #Art #Halloween ??? pic.twitter.com/e1S7B0sYLL", "— DeerparkCBS (@DeerparkCBS) October 24, 2017", "In April 2016, a group of first year film students created a zombie film.", "When we have reached out to the school to clarify the contents of the video, Wolfe told us that it was “100 percent not a student project”, and that if it was a prank “no one has come forward.” Wolfe also said that a second disturbance had been caught on camera:", "It seems that the creator of the first video learned from some of the apparent mistakes in the original. The camera is in a slightly higher position that more closely matches the angle of a security camera, and the editing is less obvious. However, some artifacts of editing can still be glimpsed; they are most noticeable as the chair crosses the floor (note the disappearing line between the legs and the blurry outline surrounding the chair):", "The school may not be know (or at least won’t admit) how this video was created, but they don’t appear to be afraid of the alleged ghoul stalking their hallways. The school’s Halloween celebration is going on as scheduled and several faculty members dressed up for the occasion, including one person who will roam the hallways as a ghost:", "Stump, Scott.   \"School Security Camera Captures Creepy Footage — Is It a Ghost?\"\r\n    Today.   11 October 2017.", "Update [June 20, 2022]: Updated SEO/social.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]