["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A liveable wage is high on the Democratic agenda, and Rep. Ilhan Omar, D-Minn., focused on a fast-food icon to drive home her message.", "Omar highlighted the pay difference at McDonald’s.", "Her tweet said: \"In 2017, the CEO of McDonalds got paid $21.8 million. The median pay for a McDonald's worker that year was $7,000. This is a moral outrage. We need a $15 minimum wage so that no one is paid a poverty wage. #RaiseTheWage\"", "In 2017, the CEO of McDonalds got paid $21.8 million.The median pay for a McDonald's worker that year was $7,000.This is a moral outrage. We need a $15 minimum wage so that no one is paid a poverty wage. pic.twitter.com/TIxZMlzQF6 #RaiseTheWage", "The tweet features a video of Omar at a Feb. 7 congressional hearing in which she said, \"The median pay for a McDonald’s worker was $7,000 in 2017. That is the pay gap between the CEO that’s making $21.8 (million) to the $7,000 that a worker who has put in 40 hours a day gets paid.\"", "If you’ve heard of Omar before, it’s because she was in the news recently apologizing for comments about campaign contributions and Israel, after her fellow Democrats said the comments were anti-Semitic.", "Most of Omar’s public comments since her 2018 election have focused on families and wages.", "Omar’s staff told us the McDonald’s numbers come from the company itself. (She meant to say 40 hours \"a week\" and not \"a day\" during her remarks.) As part of the Dodd-Frank regulatory reforms, publicly traded companies have to report how much compensation the CEO got and how much the median worker got.", "In McDonald’s SEC filing, it said CEO Steve Easterbrook made $21.8 million in 2017. The amount was largely driven by stock price and other company performance incentives.", "The company also said its median worker made $7,017, as Omar said. But there are two important qualifications: That was for all McDonald’s workers across the globe. And it included \"all full-time, part-time, seasonal and temporary workers.\" The company’s filing gave the example of a part-time restaurant crew worker in Poland who made the median amount.", "Omar’s statement was about raising the U.S. hourly wage to $15.", "McDonald’s worldwide median pay doesn’t say anything about pay in the United States, with its very different labor market and all the things that affect those markets, such as health insurance, labor laws and more.", "If $7,000 a year isn’t the right number for a median American McDonald’s worker, what is?", "McDonald’s couldn’t provide the answer, although the press office told us that the average pay of hourly workers is over $10 an hour, for corporate-owned establishments. That represents about one out of nine McDonald’s, because most are franchise-owned.", "The economics firm Indeed posts McDonald’s pay on its website. The average crew member, like the one in Poland, makes $9.21 an hour in the United States. The U.S. Bureau of Labor Statistics says the median pay for a someone doing that work in the fast-food industry is $9.70 an hour.", "According to the Bureau of Labor Statistics, the average hours worked per week at a limited-service restaurant is 24.2 hours.", "Scale that up to a full year and, using the slightly higher rate from the BLS, the typical crew worker makes about $12,200.", "We invited McDonald’s to respond to our calculation and the press office said the company had no further information to share.", "The Economic Policy Institute, a labor-oriented think tank, compares the pay of CEOs to typical workers. The institute estimated that in the United States, the typical CEO makes 312 times more than the average worker. Based on our analysis, the ratio at McDonald’s is about 1,786 to one.", "Omar said that while the McDonald’s CEO made $21.8 million, the median worker made $7,000.", "Those numbers reflect the company’s official filing, but Omar failed to note that the worker pay was a worldwide estimate and that it included part-time workers. Based on available information, we estimated that the typical McDonald’s crew member works part-time and makes about $12,000 a year. That’s about two-thirds more than Omar said.", "The disparity between the CEO and the typical worker remains vast. But the specifics Omar offered leave the wrong impression about the real numbers for U.S. workers who would be affected by a minimum wage hike. We rate this claim Mostly False.", "Ilhan Omar, tweet, Feb. 7, 2019", "McDonald’s Corporation, Proxy statement, April 12, 2018", "Indeed, McDonald's Salaries in the United States, accessed Feb. 11, 2019", "U.S. Bureau of Labor Statistics, Table B-7a. Average weekly hours and overtime, Feb. 1, 2019", "U.S. Bureau of Labor Statistics, Combined Food Preparation and Serving Workers, Including Fast Food, May 2017", "Securities and Exchange Commission, SEC Adopts Rule for Pay Ratio Disclosure, Aug. 5, 2015", "Market Realist, Why do most workers at McDonald's work part-time?, Dec. 11, 2013", "Nation’s Restaurant News, Sizing up restaurant CEO-to-worker pay gaps, July 2, 2018", "Harvard Law School Forum on Corporate Governance and Financial Regulation, CEO Pay Ratio: A Deep Data Dive, May 31, 2018", "Economic Policy Institute, CEO compensation surged in 2017, Aug. 16, 2018", "PolitiFact, Bill Maher: Average fast food worker is 29, most are on public assistance, Nov. 4, 2013", "Interview, Lawrence Mishel, distinguished fellow and economist, Economic Policy Institute, Feb. 11, 2019", "Interview, Lauren Altmin, spokeswoman, McDonald’s Corporation, Feb. 11, 2019", "Email interview, Jeremy Slevin, communications director, Office of Rep. Ilhan Omar, Feb. 11, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]