["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Brian Sims has held Philadelphia’s 182nd District House seat since 2012, earning a reputation as a progressive in an area featuring a wide area of Center City. This year in the primary he will face Democratic candidates Louis Lanni, Marni Snyder and Ben Waxman.", "On Saturday, Sims’ camp sent a fundraising email to his supporters addressed from him in which he said, \"I never expected to have this big of a target on my back. The right-wing extremists are trying to take this seat so they can push their anti-choice and anti-equality agenda through our State House.\"", "Though Sims has competition from Democrats in the primary, he does not have any from Republicans. No Republicans are on the ballot, according to the City Commissioners Office. And because no candidates are running as Republicans in the primary, no candidates can run as Republicans in the general election.", "None of the Democrats Sims is facing appear to be \"right-wing extremists.\" Like Sims, Lanni is openly gay. He’s run as a Republican in the past, unsuccessfully, but has stated the importance of a hate crimes statute for Pennsylvania and describes himself as a moderate on his campaign’s official Facebook page. Waxman and Snyder have also promoted progressive issues, such as gay rights, increased education funding, school reform, women’s rights and criminal justice reform.", "\"I don’t think any of us are right-wing extremists,\" Snyder said.", "Snyder, who described Sims’ email as \"extremely poorly worded,\" said she received a call from Sims the day the email went out while she was out \"knocking on doors\" in the district.", "\"He called my cell phone and said, ‘I want you to know that this email went out and was terribly worded,’\" she said.", "Waxman also said Sims called him to apologize after sending the email. Lanni could not be reached for comment.", "Both Snyder and Waxman said they were not bothered by the email, citing their concerns for the district and their respective campaigns.", "Sims followed up his fundraising email the same day with another email saying he was \"sincerely sorry for offending my challengers for the State House.\" He said in the email, \"when I wrote about the right-wing extremists and their anti-choice, anti-equality agenda, I was referring to the Donald Trumps and Koch brothers of the world, not the Democrats running for my State House seat.\"", "Dan Siegel, a lead consultant on Sims’ campaign, said the original email was meant to capture the same meaning as the clarification email but was worded poorly.", "\"It read another way to people,\" he said.", "Joe DeFelice, chairman of the Philadelphia Republican City Committee, called Sims’ actions \"political puffing.\"", "\"The people at the other end of his emails probably don't know what his district looks like,\" DeFelice said. \"It's normal campaign rhetoric but frankly disingenuous in this point.\"", "Our ruling", "Democratic State Rep. Brian Sims sent a fundraising email to his supporters notifying them of an attack on his seat: \"The right-wing extremists are trying to take this seat so they can push their anti-choice and anti-equality agenda through our State House.\"", "But no Republicans are running for his seat, and it’s too late for any to enter the race as Republicans. The three Democrats running against him are not \"right-wing extremists.\" The clarification email sent the same day apologized for the word choices but doesn’t undo the statement that had been prepared, written and sent to followers, asking them for a donation.", "We rate the statement Pants On Fire.", "Email, \"Big Target,\" Brian Sims, March 12.", "Email, \"This Morning's Email,\" Brian Sims, March 12.", "Email interview, Ben Waxman, candidate 182nd District, March 17.", "Phone interview, Marni Snyder, candidate 182nd District, March 17.", "Phone interview, Dan Siegel, lead consultant for Brian Sims' re-election campaign, March 17.", "Facebook, Ben Waxman.", "Facebook, Lou Lanni 4 State Rep.", "Website, Marni For Philly.", "News article, \"Candidate Ben Waxman: LGBTQ ally,\" Ernest Owens, Philly Mag, February 25, 2016.", "News article, \"Lou Lanni on Running for State Rep as an LGBTQ Candidate,\" Ernest Owens, Philly Mag, March 4, 2016.", "News article, \"Marni Snyder Says She Would be Tough on LGBT Hate Crimes,\" Ernest Owens, Philly Mag, March 11, 2016.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]