["About this rating", "In February 2020, we received multiple inquiries from readers about the veracity of social media posts and news articles which claimed that the U.S. economy had added 1.5 million more jobs during former President Barack Obama's final three years in office, than it did during President Donald Trump's first three years.", "On Feb. 17, Rep. Carolyn Maloney, D-New York, tweeted that Obama had \"created 1.5 million more jobs in his last 3 years than Donald Trump has in his first 3 years.\"", "Earlier, the left-leaning Democratic Coalition group posted a link to a Yahoo! News article with the headline \"Trump's First 3 Years Created 1.5 Million Fewer Jobs Than Obama's Last 3,\" adding \"FACT: New figures from Trump’s own Department of Labor show that 6.6 million new jobs were created in the first 36 months of Trump’s tenure, compared with 8.1 million in the final 36 months of Obama’s ― a decline of 19% under Trump.\"", "That article was itself a republication of a Feb. 10 report published by HuffPost, which read as follows:", "\"As President Donald Trump takes the stage at his reelection rally here [Manchester, New Hampshire] Monday and boasts of his economic record, there is one statistic he is likely to omit: He created 1.5 million fewer jobs in his first three years in office than predecessor Barack Obama did in his final three. Newly revised figures from Trump’s own Department of Labor show that 6.6 million new jobs were created in the first 36 months of Trump’s tenure, compared with 8.1 million in the final 36 months of Obama’s ― a decline of 19% under Trump, according to a HuffPost analysis.\"", "The HuffPost article didn't specify the exact metric it used in order to arrive at those numbers, but the standard figure used to gauge jobs growth in the United States is total, seasonally adjusted non-farm payroll employment, which is released every month as part of the Bureau of Labor Statistics (BLS) establishment survey, in which BLS collects data from a sample of around 145,000 businesses and government agencies throughout the country.", "When a news headline states that, for example, the economy \"added 225,000 Jobs in January,\" that's typically a reference to seasonally adjusted non-farm payroll employment and it means there were 225,000 more jobs in the United States in January 2020, than there were in December 2019.", "Once a year, the BLS revises its employment data after consulting more official figures collected from each state's unemployment insurance agency. This \"benchmark\" revision process enhances the accuracy of jobs figures and typically results in retrospective adjustments to employment statistics from every month over the preceding 10 years.", "That's what happened on Feb. 7, when the BLS released both the preliminary employment figures for January and revised jobs numbers from 2010 through 2019. Those revisions meant that jobs growth in 2018 turned out to be slower than was originally recorded, prompting Slate to report that:", "\"On Friday, the Bureau of Labor Statistics released its latest batch of employment numbers, along with its annual benchmark revisions adjusting its estimates from prior months. Before, the government believed that the U.S. had added 223,000 jobs per month in 2018, the year that the GOP’s tax cuts and new, higher spending levels took effect. It has now lowered that estimate to 193,000 per month, a significant drop.\"", "For its part, MSNBC wrote that:", "The revisions for 2019 showed that the economy generated nearly 2.1 million jobs last year, which is a pretty good number. The trouble, however, is the job totals from last year were down from the year before, and were actually the lowest since 2011. Or put another way, while Trump spent the year boasting that the U.S. job market was the strongest it's ever been, 2019 saw job growth slow to an eight-year low.", "What's more, the best year for jobs during Trump's presidency — 2.31 million in 2018 — fails to reach the job growth in any of the three final years of Barack Obama's presidency. It adds a degree of irony to his rhetorical record: Trump ran for president in 2015 and 2016, telling the nation that the economy was horrible and he'd make it vastly better. But annual job growth totals from both 2015 and 2016 were better than any year of the Republican's tenure, at least so far.", "Taking this one step further, Trump has now been in office for 36 full months — February 2017 through January 2020 — and in that time, the economy has created 6.56 million jobs. In the 36 months preceding Trump's presidency — February 2014 to January 2017 — the economy created 8.08 million jobs.", "Before we present the figures at the heart of this fact check, it should be noted that as a rule, politicians overstate their influence over the economy when indicators are healthy, and downplay their influence when things are bad. As Neil Irwin wrote for The New York Times, before Trump's inauguration in January 2017:", "\"The reality is that presidents have far less control over the economy than you might imagine. Presidential economic records are highly dependent on the dumb luck of where the nation is in the economic cycle. And the White House has no control over the demographic and technological forces that influence the economy. Even in areas where the president really does have power to shape the economy — appointing Federal Reserve governors, steering fiscal and regulatory policy, responding to crises and external shocks — the relationship between presidential action and economic outcome is often uncertain and hard to prove.\"", "However, Trump himself has repeatedly insisted on tying positive economic indicators like employment growth to his own presidency. So even if we might dispute the premise that presidents should receive unqualified praise or blame when the economy grows or tanks, it's worth checking the numbers involved. After all, if Trump proposes that he is to be thanked for employment growth, his own logic dictates that he should be blamed if that rate of growth is slowing down.", "In order to measure and compare jobs growth during Obama's final three years in office and jobs growth during Trump's first three, we obtained a data set containing 10 years' worth of monthly non-farm payroll employment figures, which BLS confirmed for Snopes was the most reliable and up-to-date data set available, and took into account the February 2020 benchmark revisions. The spreadsheet can be downloaded here, and the table is shown below:", "It's important to note that the monthly employment figures for December 2019 and January 2020 are both still preliminary. The January 2020 figure will be revised in March, and all the monthly figures shown in the table are liable to be further revised in 2021, when BLS conducts its annual benchmark revisions again.", "There are several potential ways to compare jobs growth under Obama and Trump, depending on where you place the transition between the two administrations. Since Trump was inaugurated on Jan. 20, 2017, there is a case for \"starting the clock\" in January 2017, but also for starting it in February 2017, since that was his first full month in office. If the purpose of the comparison is to gauge the possible influence of a presidency on employment trends, one could also measure jobs growth starting in November 2016, since that's when Trump was actually elected, or in December 2016, since that was the first full month of what could be described as the \"Trump era.\"", "Finally, if one wished to use only the most reliable figures available, and exclude the preliminary data from December 2019 and January 2020, one could track jobs growth for just the first 34 months of Trump's presidency (from February 2017 to November 2019), and compare that to the final 34 months of Obama's tenure (from April 2014 to January 2017).", "The following table takes into account all five methods. Each of them demonstrates that the final three years of Obama's presidency saw significantly superior jobs growth than the first three years of Trump's presidency.", "As the table shows, Obama's final three years in office saw significantly greater jobs growth than Trump's fist three years did, no matter where the transition between presidencies is placed. Across the first four different methods, the gap averages out at around 1.5 million jobs — meaning the claim at the center of this fact check was accurate.", "Employment has grown during the first three years of Trump's presidency, but at a significantly slower rate than it did towards the end of Obama's tenure — across the first four methods used here, jobs growth under Trump has averaged out at around 19% slower than the rate of growth experienced during his predecessor's final three years in office.", "When we exclude the two months of preliminary data (December 2019 and January 2020) and compare blocks of 34 months each (as opposed to blocks of 36 months), the jobs growth gap is naturally slightly smaller (because the time periods in question are slightly shorter), but the gap in the rate of growth is still significant, with Trump's presidency seeing employment grow 18.2% more slowly than it did during the final 34 months of Obama's time in office.", "Date, S.V.  \"Trump’s First 3 Years Created 1.5 Million Fewer Jobs Than Obama’s Last 3.\"\r\n    Yahoo! News.  10 February 2020.", "Date, S.V.  \"Trump’s First 3 Years Created 1.5 Million Fewer Jobs Than Obama’s Last 3.\"\r\n    HuffPost.  10 February 2020.", "U.S. Bureau of Labor Statistics.  \"Economic News Release -- the Employment Situation, January 2020.\"\r\n    7 February 2020.", "Weissmann, Jordan.  \"Trump’s Jobs Record Is Weaker Than Everyone Thought.\"\r\n    Slate.  7 February 2020.", "Benen, Steve.  \"The Nagging Detail About Job Growth Trump Probably Won't Like.\"\r\n    MSNBC.  7 February 2020.", "Irwin, Neil.  \"Presidents Have Less Power Over the Economy Than You Might Think.\"\r\n    The New York Times.  17 January 2017.", "Boak, Josh; Miller, Zeke.  \"Trump Claims Credit for Economy, Jobs in New York Speech.\"\r\n    The Associated Press.  12 November 2019.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]