["The image was published here on Facebook on December 29, 2019.", "The text in the screenshot of the purported Instagram story reads: “Along with the Michael Jackson’s jacket and hat, North also got the shirt John F. Kennedy wore when he was assassinated.”", "Below is a screenshot of the misleading post:", "The image was also posted on Twitter here, where it has been liked for more than 1,700 times, and on Reddit here.", "The claim in the posts is false. The clothing worn by Kennedy on the day he was assassinated remains in the “legal and physical custody” of the US government’s National Archives and Records Administration (NARA), according to this page on its website.", "“The apparel is located in a secure area, under climate-controlled conditions, and stored flat in special containers for preservation purposes,” the agency’s website reads. “In addition, NARA created detailed color photos of these materials as part of a larger preservation effort to photograph the significant artifacts in the JFK Assassination Records Collection. Due to the restraints of the deed of gift under which the materials were transferred to NARA, NARA has not posted these photographs online, as we have with photographs of other JFK assassination related artifacts. However, the photographs of the clothing are available for examination in our research room in College Park, Maryland, or may be purchased for a fee.”", "Below is a screenshot of the statement on the NARA’s website:", "The image in the misleading post contains a card with this former seal for the US National Archives.", "Below is a screenshot comparison of the seals:", "Another photo of the same shirt, credited to the National Archives, was published here by Getty on January 1, 1995.", "Kardashian refuted the claim that she had bought the shirt after Refinery29, a US-based news and lifestyle website, reported the story.", "“WOW this is obviously fake!” Kardashian tweeted here on December 31, 2019. “@Refinery29 I did not get JFK’s shirt. That is a sick joke that someone tweeted as a fake ig story that I never posted.”", "Refinery29 issued a correction in this article on December 31, 2019, which stated that an earlier version of the report included a “falsified Instagram image” that had been removed.", "The correction states: “This story has been updated from the original version. Earlier, it included a falsified Instagram image, which has been removed.”", "Below is a screenshot of the article and the correction:", "Kardashian’s denial and the Refinery29 correction were reported here by US media site Insider and here by US tabloid the New York Daily News on December 31, 2019.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]