["About this rating", "In July 2017, Facebook user Andre Lightner posted a photograph appearing to show the actor Tom Hanks wearing a t-shirt emblazoned with a series of liberal and environmentalist slogans: \"Science is Real - Black Lives Matter - No Human is Illegal - Love is Love - Women's Rights Are Human Rights - Kindness is Everything.\"", "As many commenters have pointed out, and has you may have noticed, the lettering on this t-shirt is conspicuously straight, considering it's supposedly being worn across Hanks' chest. But in this case, even the t-shirt itself has been (fairly convincingly) digitally added to the image.  In fact, this is the latest in a series of social media posts to falsely present Tom Hanks championing various slogans using a doctored version of a real photograph.", "The original picture was posted by Hanks himself to Facebook and Twitter on 29 June 2015. In it, he's wearing a United States soccer team jersey to support the women's national team ahead of their World Cup semi-final match against Germany the following day:", "Fake turf or not, I'm full Bosom Buds if coach Ellis needs me. No yellow cards! Hanx pic.twitter.com/4eT5cYzmjD", "— Tom Hanks (@tomhanks) June 29, 2015", "Hanks was referring to a controversy leading up to the 2015 World Cup, which was hosted by Canada and the first to be played on artificial turf rather than grass. A group of international players (including members of the U.S. squad) took legal action to prevent this, because playing on artificial turf is widely considered to increase the risk of injury. The lawsuit was later dropped.", "The actor also referred to Bosom Buddies, a 1980s sitcom in which he and Peter Scolari played young men pretending to be women in order to stay in a cheap Manhattan apartment.", "Since then, the image has been doctored to show Hanks championing environmentalist causes, including the April 2017 March for Science:", "Please Support @ScienceMarchDC in ur state! April 22nd is Earth Day & there is 'NO PLANET B'! Tom Hanks agrees! #SaveOurPlanet @MrSpock2017 pic.twitter.com/ns6Ta2Inac", "— Jayne ?Resist? (@WienerJaMD) April 18, 2017", "Tom Hanks gets it! March for Science!@ScienceMarchDC @ACSNatlMtg #ACSSanFran pic.twitter.com/UQA2qzpJx3", "— Paul Dauenhauer (@pauldauenhauer) April 3, 2017", "Hanks has broad appeal and a reputation as a likeable person, and he is actually a prominent celebrity supporter of environmentalist and liberal causes, such as same-sex marriage and LGBT rights. This probably explains why he — and his shirt — continue to be a blank canvas for creative image editors promoting causes and selling merchandise.", "Rogers, Martin.    \"U.S. Women: Men Would Never Play World Cup on Turf.\"\r\n     USA Today.    5 June 2015.", "Queerty.    \"Tom Hanks Accepts LGBT Award and Shows Why He's the Best-Liked Man in Show Business.\"\r\n     Queerty.com.    10 November 2015.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]