["By Chloe Wilson", "Posted on December 4, 2018 | Updated on May 23, 2019", "President Donald Trump did not call the flu shot a “scam,” as is being claimed by a number of widely circulated blog articles.", "An article appearing on several websites falsely claims that President Donald Trump once warned that flu shots are a “scam.” He didn’t. In 2015, Trump, then a presidential candidate, merely said that he had never gotten a flu shot.", "All of the websites carry the item under the same inaccurate headline, “Trump Warns Flu Shots Are The Greatest ‘Scam’ In Medical History.” Facebook users recently flagged the inaccurate story on wisemindhealthybody.com, a website that posts items about health and beauty. But it dates to at least late January 2017, when Trump became president, and has appeared on Health Freedom Alliance, State of the Nation, a self-described alternative news website, and News Punch, which used to be called YourNewsWire, a website known for spreading misinformation.", "The article starts by saying, “The flu shot is the greatest scam in medical history, created by Big Pharma to make money off vulnerable people and make them sick, warns President Donald Trump.” It then points to an interview with Jim Norton and Gregg Hughes, who also goes by the nickname “Opie,” in which Trump admitted to never having gotten the vaccine and never getting sick with the flu.", "Trump, October 2015: No, I’ve never had one, and thus far I’ve never had the flu. I don’t like the idea of injecting bad stuff into your body, which is basically what they do. And I guess this one has not been very effective to start off with, the last one. But I’ve never had a flu shot and I’ve never had the flu. …", "I have friends that religiously get the flu shot and then they get the flu, you know that helps my thinking because, I say “Why am I doing this?” And then I’ve seen a lot of reports that the last flu shot is virtually, totally ineffective.", "The article is right that Trump called the 2014-2015 flu vaccine “ virtually, totally ineffective,” and said that he doesn’t like the idea of injecting what he called “bad stuff” into his body.", "He never says, however, that it is a “scam,” a word that appears in quotation marks in the headline. Nor does Trump refer at all to “Big Pharma,” let alone blame pharmaceutical companies for intentionally making people sick in order to get money.", "The CDC publishes information about the flu vaccine on its website, detailing how it works, the side effects and risks, as well as the ingredients of the vaccine. Two of the ingredients, according to the CDC, are thimerosal and formaldehyde, which were mentioned in the article posted on wisemindhealthybody.com.", "Thimerosal is used in multidose vials as a preservative. It is not used in single-dose vials, where the vaccine contained in a single vial is only administered to one person. “There is no evidence that the small amounts of thimerosal in flu vaccines cause any harm, except for minor reactions like redness and swelling at the injection site,” the CDC says.", "Formaldehyde is used to “inactivate viruses so that they don’t cause disease,” and is present in too small a concentration in vaccines to pose a safety concern, according to the U.S. Food and Drug Administration. “Formaldehyde has a long history of safe use in the manufacture of certain viral and bacterial vaccines,” the FDA says.", "The CDC has also published and referenced studies that say the vaccine reduces the risk of flu-related hospitalizations and deaths among certain demographics. The CDC also notes that the risk of the more serious side effects from the vaccine is lower than the risk of developing severe consequences from contracting the virus.", "So, despite Trump’s choice to not get vaccinated, there is notable evidence that doing so is safe and can, in some cases, avoid unnecessary hospitalizations and deaths.", "CDC early estimates indicate that more than 900,000 people were hospitalized and over 80,000 died as a result of flu-related causes last season.", "Update, May 23: The website wisemindhealthybody.com has retracted the story “Trump Warns Flu Shots Are The Greatest ‘Scam’ In Medical History,” and posted an update that says the story was “found to be at odds with numerous scientific studies.”", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on the social media network.", "“Trump Warns Flu Shots Are The Greatest ‘Scam’ In Medical History.” wisemindhealthybody.com. Undated. Accessed 4 Dec 2018.", "Norton, Jim and Gregg Hughes. Interview with Donald Trump. Opie Radio. Oct 2015.", "“Making the Vaccine Decision.” Centers for Disease Control and Prevention. 16 Oct 2018.", "“Thimerosal in Vaccines.” Centers for Disease Control and Prevention. 27 Oct 2015.", "“Common Ingredients in U.S. Licensed Vaccines.” U.S. Food and Drug Administration. Q&A. 30 Apr 2018.", "“CDC Study Finds Flu Vaccine Saves Children’s Lives.” Press release. Centers for Disease Control and Prevention. 12 Jul 2018. 3 Apr 2017.", "“Possible Side-effects from Vaccines.” Centers for Disease Control and Prevention. 12 Jul 2018.", "Thompson, Mark G., and Nevil Pierse et al. “Influenza vaccine effectiveness in preventing influenza-associated intensive care admissions and attenuating severe disease among adults in New Zealand 2012–2015.” Vaccine. 18 Sep 2018.", "“National Press Conference Kicks Off 2018-2019 Flu Vaccination Campaign.” Centers for Disease Control and Prevention. Press release. 27 Sep 2018.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]