["One version of the video, shared more than 4,800 times on Facebook, and seen by over 93,000 people, is captioned: “Beninours attack Nigeria embassy in Benin republic over border closure by Nigerian government”. The same claim and video was also shared on YouTube. This video, seen nearly 2,000 times, claims to show the “Nigerian Embassy under attack in Benin Republic over border closure”.", "The same video was shared by other Facebook users, also claiming to show an attack on the Nigerian embassy in Cotonou in Benin Republic. We archived some of those videos here, here, here, and here.", "The Nigerian government announced a partial closure of its land borders in August 2019 in a bid to halt smuggling of rice, petrol, and other goods. The closure affects Benin, Cameroon, Chad and Niger.", "As reported by AFP, President Muhammadu Buhari’s office said the restrictions on cross-border trade would \"allow Nigeria’s security forces to develop a strategy\" to combat smuggling, which it called a \"dangerous trend\".", "AFP also reported that the move has especially affected Benin, and cast a shadow over the newly-signed Africa Continental Free Trade Agreement which aims to reduce tariffs and other trade barriers in the region.", "Nigeria’s Ambassador to the Republic of Benin, Kayode Oguntuase, told News Agency of Nigeria (NAN) in a statement that there had been no attack at the Nigerian embassy in Cotonou.", "“The embassy of Nigeria in Cotonou was never attacked and the embassy is not under any form of attack,” he said, adding that his office had been \"inundated with telephone calls\" about the alleged attack.", "We analysed the video with the INVID verification tool and found that it had been uploaded to a Facebook page created only in April 2019 called Nicepec. The page had uploaded the video on October 2, 2019 -- showing that it had been shot earlier than when it began circulating in Nigeria from October 12, 2019.", "We searched Google for frames of the video and found a few YouTube videos dating from more than four years ago.", "The earliest version of the video was from March 2013. The video shows an attack on the Nigerian embassy in Dakar. It was reported in the local media in Nigeria at the time, and discussed in the Nigerian house of representatives in Abuja.", "Katyen Jackden, the Nigerian ambassador to Senegal at the time, said the attack on the embassy followed a killing and the disappearance of a body from a morgue in Senegal.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]