["About this rating", "On 16 May 2017, dubious web sites reported that former Federal Bureau of Investigation director James Comey had covered up evidence linking murdered Democratic National Committee worker Seth Rich to document-dumping site WikiLeaks:", "...The fact is the FBI has been in possession of Rich’s laptop and the agency’s director at the time, James Comey locked down the contents to protect either certain people at the DNC, or members of Hillary’s campaign team, or Hillary Clinton, or likely all three.", "The story provides no source or evidence for the claim that Comey was personally responsible for securing the contents of Rich's computer, or that he had done so specifically for the benefit of the DNC or Hillary Clinton.", "Seth Rich was shot dead in Washington, D.C. on 10 July 2016, almost two weeks before Wikileaks released a trove of hacked emails that embarrassed the DNC and became a point of controversy during last year's presidential election campaign.  That sequence of events, combined with Rich's employment at the DNC, has given rise to conspiracy theories linking his death with the subsequent Wikileaks email dump.", "The Patriot Crier article appears to rely heavily on reporting by Fox News, which quoted Rod Wheeler — a Fox News contributor and private investigator — as saying that \"FBI sources\" had told him they had evidence establishing a link between Seth Rich and Wikileaks.The Fox News report also claimed an anonymous \"federal investigator\" had corroborated Wheeler's claims.", "However, local Fox affiliate WTTG, which originally interviewed Wheeler, now reports that he has since \"backtracked\" on his claims. On 16 May 2017, Wheeler told CNN that, contrary to his earlier claims, he did not, in fact, have evidence linking Seth Rich to Wikileaks, and that he \"only got that [information] from the reporter at Fox News\".", "The family of Seth Rich has repeatedly condemned attempts to link his death to Wikileaks' release of hacked DNC emails, and asked both Fox News and WTTG to retract their stories and issue an apology. On the same day reports first surfaced about the now-unravelling story, a spokesperson for Rich's family told us:", "I think there's a very special place in hell for people that would use the memory of a murder victim in order to pursue a political agenda.", "Zimmerman, Malia.  \"Family of Slain DNC Staffer Seth Rich Blasts Detective Over Report of WikiLeaks Link\".\r\n  Fox News.  16 May 2017.\r\n\r\nMarraco, Marina; Wagner, Paul.  \"Seth Rich Murder: What We Know and What We Don't Know\".\r\n  WTTG/Fox News 5.  16 May 2017\r\n\r\nDarcy, Oliver.  \"Story on DNC Staffer's Murder Dominated Conservative Media - Hours Later It Fell Apart.\"\r\n  CNN.  17 May 2017.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]