["About this rating", "A photograph shows a woman in a nun's habit being patted down by a TSA screener at an airport.", "The photograph has nothing to do with \"Obama's America,\" as it antedates Barack Obama's election to the White House.", "An older photograph purportedly showing a female Muslim TSA agent screening a nun at an airport began recirculating on the internet in June 2016,  frequently accompanied by disparaging remarks about President Obama, Muslims, or alarmist messages about national security:", "Obama's America...", "The picture shows an airport screening area and a Muslim lady on her knees with her head covering searching a nun in full attire.", "Folks, The insanity marches on. You know why we scream at the TV? This is why. We don’t want to insult a hajib clad Muslim woman, but it’s OK to search a nun.", "Yep, makes sense to me. You cannot make this stuff up!", "Airport security (Detroit Metro Concourse A)... A Catholic nun being frisked by a Muslim security agent!", "Excuse me? Did you say a MUSLIM security agent — in the USA — screening for suspected terrorists?", "Whatever this photograph depicts, \"Obama's America\" isn't part of it.  The picture was taken by Dean Shaddock at a Detroit airport and posted to Flickr on 20 September 2007, more than a year before Barack Obama was elected to the White House:", "This was captured as I collected my things from airport security (Detroit Metro Concourse A). I think of it as something like a Rorschach test. Is an elderly Catholic nun being frisked by a Muslim security agent the celebration of blind justice? Or is it simply an admission of absurdity?", "Although it's likely that two women pictured are Muslim and Catholic, that's an assumption based on their mode of dress and not something that was apparently verified by the photographer. While some viewers may find irony in a Muslim TSA agent's being employed to pat down a Catholic nun, there is no legal reason why a Muslim can't be a TSA agent or why a nun can't be subject to additional screening at an airport. In fact, the TSA web site states that people wearing \"head coverings, loose fitting or bulky garments,\" such as a nun in a habit, \"may undergo additional security screening.\"  (And contrary to common rumor, Muslim women are not exempt from similar screenings.)", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]