["Former President Pranab Mukherjee will be addressing RSS cadres at an event in Nagpur on June 7. Mukherjee’s acceptance of the invitation has taken many by surprise. While there are those who are alarmed by Mukherjee’s nod to the RSS, others contend that dialogue is an intrinsic part of democracy and there is nothing inherently objectionable about the move. In this context, it has been observed that a number of quotations attributed to Mukherjee have been circulating on social media in the last few months and particularly in the last few days. This trend had started not long after Mukherjee released his autobiography The Coalition Years in October 2017.", "Alt News discovered at least three dubious quotations ascribed to Mukherjee which have circulated widely on social media. Let us take a look at these quotes.", "1. “I am not a slave like Manmohan Singh”", "मैं मनमोहन की तरह गुलाम नहीं हूं मुझे जो ठीक लग रहा है मैं वह कर रहा हूं आज भारत को RSS जैसे संगठन की आवश्यकता है (I am not a slave like Manmohan Singh. I am doing what I consider to be right. Today, India needs an organisation like the RSS- translated). These are the words of former President Pranab Mukherjee, if an image circulating on social media is to believed. This image carries a picture of Mukherjee along with the aforementioned words.", "The image posted above shows the logo of ‘Poster Maker’ which is a picture-based application. It has been uploaded and shared by many individual users on Facebook identically, mentioning the quote in their posts, thus indicating that the image may have been shared on WhatsApp and subsequently uploaded on social media platforms. Many Facebook pages too have shared this quote, such as India Against Congress from which it has been shared more than 2000 times already.", "Apart from this quote, another claim that is circulating widely on social media is that the former President has claimed that Sonia Gandhi, President of the Congress party, hates Hindus. “सोनिया गांधी करती हैं हिंदुओं से नफरत” (Sonia Gandhi hates Hindus-translated) is the quote circulating widely.", "This claim has appeared on some dubious Hindi online publications. A website named Channel Hindustan published an article on February 5, 2018 which claims that Mukherjee has revealed in his book The Coalition Years that Congress President Sonia Gandhi took numerous anti-Hindu decisions when she was at the helm of affairs during UPA-I and UPA-II.", "Another website, www.performindia.com has also published an article with the same claim on October 30, 2017. It may be noted that The Coalition Years was released in October 2017. Another article with the identical claim has been uploaded on June 4, 2018 by a website www.hindi.indiasamvad.co.in. Regardless of the fact that this claim has been in the online domain for a few months now, it is being shared widely on Facebook. In one post uploaded by a user in March 2018, it has been shared in the form of what appears to be a newspaper excerpt. However, Alt News could not trace the origin of this image which has been shared more than 8800 times so far.", "हिन्दुओ से नफरत करती है सोनिया गांधी प्रणब मुखर्जी की किताब द कोएलिशन इयर्स में हुआ ख़ुलास", "क्या अब भी आप कांग्रेस को वोट देंगे???", "Posted by Akshay Bansal Janalia on Saturday, March 10, 2018", "An article published by PostCard News also reported about this quote by Pranab Mukherjee.", "Yet another statement credited to the former President which has circulated widely in the last few months is “कांग्रेस की छवि अब देशद्रोही संगठन की, कांग्रेस का 2019 में सर्वनाश तय” (Congress’ image is of an anti-national organisation, Congress’ decimation is 2019 is certain- translated). Among the Faceook pages which shared it is Dainik Bharat which has over 540,000 followers.", "भ्रष्टाचारी छवि के कारण 2014 में हारी कांग्रेस, अब कांग्रेस की छवि देशद्रोही संगठन की, 2019 में सर्वनाश तय : प्रणब मुखर्जी", "Posted by Dainik Bharat on Tuesday, January 23, 2018", "Interestingly, Alt News found that this same quotation had been shared by not less than four pages on Facebook on the same day- January 24, 2018. The pages which posted it apart from Dainik Bharat are Yogi Raj- 2017, Bharatiya Yuva Shakti and Chitkar: Meri Awaaz Suno. BJP Another page named posted the quote among its more than 200,000 followers on January 29.", "Alt News contacted the office of former President Pranab Mukherjee. They denied the statement vis-a-vis Dr. Manmohan Singh that was attributed to Mr Mukherjee and also the statement about Congress being perceived as an anti-national organisation. Further, regarding the statement according to which Mr Mukherjee claimed that Sonia Gandhi hates Hindus, in his book The Coalition Years, they stated that the book is in the public domain and that it does not have any such references.", "The quotation on Sonia Gandhi ascribed to Mukherjee- finds inspiration and imagination from this excerpt of The Coalition Years, found on Page 209 of the book. Mukherjee’s memoir with regard to the arrest of Jayendra Saraswati, erstwhile Shankaracharya of Kanchi in a murder case, finds reference on this page. It may be noted that Saraswati had been arrested by the state government in Tamil Nadu which was ruled by the Jayalalithaa led AIADMK. The union government had no role in the arrest.", "Mukherjee recalls how he was in thorough disagreement over the arrest of the Shankaracharya at a time when Diwali festivities are on, and was “extremely critical of the timing of the arrest and questioned if the basic tenets of secularism of the Indian state were confined to only Hindu monks and seers? Would the state machinery dare to arrest a Muslim cleric during Eid festivities?”", "This recollection by Mukherjee and his objection over the Shankaracharya’s arrest has in all likelihood been used by pro-BJP pages to allege that the Congress President is anti-Hindu. It may be reiterated that the Shankaracharya had been arrested by the Tamil Nadu government in 2004 and not by the Central government.", "Pranab Mukherjee’s nod to the RSS to attend the Nagpur event has evoked keen interest among political observers and lay citizens alike. Mukherjee on his part has maintained a stoic silence, asserting that he will say whatever he has to on June 7. The organised manner in which fake quotes ascribed to him have circulated online in the last few months strongly indicates that an attempt is being made to project Pranab Mukherjee as disgruntled with the Congress party leadership.", "Donate Now", "Arjun Sidharth is a writer with Alt News. He has previously worked in the television news industry, where he managed news bulletins and breaking news scenarios, apart from scripting numerous prime time television stories. He has also been actively involved with various freelance projects. Sidharth has studied economics, political science, international relations and journalism. He has a keen interest in books, movies, music, sports, politics, foreign policy, history and economics. His hobbies include reading, watching movies and indoor gaming.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]