["About this rating", "A woman at a Florida Burger King restaurant filmed a nasty exchange between two customers and the store's manager in which the customers told the man he should speak English or \"go back to your Mexican country.\"", "According to local news reports, the incident took place at a Burger King in Eustis, a small city in Central Florida, on July 6, 2019. But the video, originally posted on Facebook, went viral on social media about a week after the incident, perhaps spurred by a national controversy centered on tweets posted by U.S. President Donald Trump. In the tweets, he told four Democratic lawmakers who are women of color to \"go back\" to the countries they came from (all are Americans).", "The video was shot by Neyzha Borrero, who was dining at the restaurant with her boyfriend. The two overheard the exchange, and Borrero started filming. In the video, the two customers can be heard assailing the store's general manager, Ricardo Castillo, for speaking Spanish to an employee. \"Go back to Mexico if you want to keep speaking Spanish,\" one of the women said. \"Go back to your Mexican country.\" Castillo then informed them he is not Mexican and told them to leave, calling them ignorant and disrespectful.", "According to the local Daily Commercial newspaper, Castillo is Puerto Rican. Puerto Rico is a U.S. territory, and its residents are American citizens.", "The story was picked up by national outlets several days after it was originally posted. On July 14, Trump posted a series of tweets targeting U.S. Reps. Ilhan Omar, D-Minn., Alexandria Ocasio-Cortez, D-New York, Ayanna Pressley, D-Mass., and Rashida Tlaib, D-Mich., saying they should \"go back and help fix\" the countries they \"originally came from.\" All except Omar were born in the U.S., and Omar, the first of two Muslim women elected to serve in Congress, is a naturalized citizen.", "The denouement to the Burger King incident came when the women wrote a letter to Castillo expressing contrition for their actions, stating that they were influenced to behave that way by bereavement and financial troubles. Castillo not only accepted their apology but called for compassion, saying he will set up a GoFundMe account to help the women.", "Sartoris, Katie. \"Eustis Manager Told to 'Go Back to Mexico’ for Speaking Spanish.\"\r\n  Daily Commerical. 9 July 2019.", "Bernabe, Angeline Jane. \"Two Women at a Burger King Tell Manager to 'Go Back to Mexico': Video.\"\r\n  ABC News. 15 July 2019.", "Castrodale, Jelisa. \"Burger King Manager Accepts Apology From Women Who Told Him to 'Go Back to Mexico.'\"\r\n  Vice. 30 July 2019.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]