["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "When Houston Mayor Sylvester Turner announced Carrin Patman as the new chairwoman of the Metropolitan Transportation Authority of Harris County board, he emphasized the vital role Patman would play in reducing Houstonians’ dependence on cars.", "\"We have been focusing so much, especially the Texas Department of Transportation, on that 97 percent of people in single-occupancy vehicles,\" he said.", "Since Turner became mayor in January 2016, he’s emphasized public transit and other ways of fighting congestion in contrast to building more highways, a traditional focus of TxDOT. Turner, introducing Patman, brought up TxDOT’s focus on single-occupancy vehicles because he disagrees with the strategy of building roads to ease traffic congestion.", "We wanted to check his facts. Are 97 percent of people in single-occupancy vehicles?", "Origin of the 97 percent statistic", "The 97 percent statistic wasn’t limited to the March 4, 2016, event at City Hall. In fact, it’s been a regular part of Turner’s stump speeches of late, according to Houston Chronicle transportation reporter Dug Begley.  He also mentioned the number at an announcement for other Metro appointments March 18, 2016, and at the Texas Active Transportation and Trails Conference in Houston on March 9, 2016, Begley said.", "We called the mayor’s staff to see where the 97 percent figure came from. His press team referred us to the city’s Planning and Development Department, which they said wrote Turner’s  March 4 speech.", "By phone, Suzy Hartgrove, the planning department’s public affairs manager, told us the statistic referred to drivers in all of Texas -- not just Houston -- and that it had come from TxDOT Commissioner Bruce Bugg of San Antonio. Hartgrove said Bugg brought up the statistic at a January 25, 2016, meeting in to discuss traffic congestion in the Houston region.", "By email, Hartgrove forwarded Bugg’s slide show from a Jan. 28, 2016, presentation to Houston TranStar, the body that coordinates city and state agencies to respond to Houston-area traffic incidents. A slide in the presentation says that Austin, Dallas, Fort Worth, Houston and San Antonio were \"home to 97 of the top 100 most congested roadway segments in Texas in 2015.\" In the email Hartgrove forwarded to us, planning department staff discussed how Bugg’s 97-of-100 point may have been misinterpreted in its drafting of Turner’s remarks.", "We turned to TxDOT; Austin-based spokeswoman Veronica Beyer responded by email, saying that Bugg \"never used the words ‘single-occupancy vehicle.’\" On the other hand, Beyer said, Bugg has offered a few similar statistics, including that \"97 percent of Texans who choose to travel do so by car, truck or van.\"", "What that statistic means", "When Turner first started bringing up this statistic in January, the Houston Chronicle took a close look at his facts. In Jan. 28, 2016, remarks before the Texas Transportation Commission, Turner said that \"TxDOT has noted that 97 percent of Texans currently drive a single-occupancy vehicle for their daily trips.\"", "That comment differs slightly from his statement at hand -- it refers to daily trips, not 97 percent of all people. Begley’s analysis of that number in an annotated transcript of the speech helps with the number we’re looking at, too:", "\"This number is commonly used in various ways but is misapplied most of the time,\" the Chronicle said. \"In a 2006 study by Texas A&M University, it was stated 95.4 percent of workers over age 16 use a car, van or truck to get to work. However the number included carpoolers and only covered trips to [and] from work, as opposed to all driving. According to the Census Bureau, 79.9 percent of commuters drive alone to work in the state. Around 11 percent share a ride to work. About 4 percent work at home and 1.6 percent statewide use public transit.\"", "The upshot: \"Solo drivers dominate any breakdown of how Texans travel, but it is not as high as many people claim,\" the story said.", "Beyer, from TxDOT, also offered some backup that points to these numbers from the Chronicle as the most reliable. She sent us a chart from the U.S. Department of Commerce indicating that in 2013, 96.1 percent of Texans who commuted to work chose a car, truck or van. Notably, that figure folded in carpools so it wasn’t referring solely to single-occupancy vehicles.", "How many people are in single-occupancy vehicles?", "Absent other data, then, we suspect it’s not quite 97 percent of people driving single-occupancy vehicles. So, how many are driving solo?", "It’s hard to say exactly. We have the numbers on commuters from the Census Bureau: 79.9 percent of Texas workers in 2013 drove alone to work. For all driving, however, it’s tougher to pinpoint how many people driving solo.", "We reached out to the Texas Transportation Institute at Texas A&M University, which connected us with Phil Lasley, a researcher there.", "Lasley told us by phone that it is difficult to get numbers related to all trips. Surveys that measure that data are rarely done, he said.", "Lasley was looking at the Census data that says 79.9 percent of people drive alone to work.", "Lasley, asked if that number would be higher or lower if it took into account all driving, said he thought it would be higher. \"People who carpool are generally going to work. People wouldn’t jump in a carpool to go to the dry cleaners or pick up kids from school,\" he said. During the school day especially, when many people are on the road getting errands done, drivers tend to be by themselves, he said.", "Lasley also pointed out that trips to and from work -- which is the data the 79.9 percent refers to, and the closest survey result we found to generally gauge single-occupancy drivers -- only made up 16 percent of all trips in Texas from April 2008 to April 2009, according to the 2009 National Household Travel Survey, the most recent (the 2016 survey is underway). Most driving was for social and recreational trips, errands and shopping before commuting.", "The average vehicle in that time frame, driving for all purposes, had 1.67 people in it, according to the National Household Travel Survey.", "Our ruling", "Houston Mayor Sylvester Turner, decrying traditional emphases on road building to ease traffic congestion, said 97 percent of people drive single-occupancy vehicles.", "This figure looks like it was based on a misread of another official’s declarations. And while we found little data about how many of us always drive solo, Census research suggests that about 80 percent of commuters drive alone, but commuting accounts for less than 20 percent of total driving, according to the latest survey we could find.", "It is 100 percent time to park this stat; we rate his claim False.", "FALSE – The statement is not accurate.", "Click here for more on the six PolitiFact ratings and how we select facts to check.", "https://www.sharethefacts.co/share/de2b979b-980b-4bba-bfa4-22db6680f96d", "Quote, heard by Houston Chronicle transportation reporter Dug Begley, March 4, 2016", "Phone interview, Janice Evans, director of communications, Houston Mayor Sylvester Turner, March 15, 2016", "Phone and email interviews, Suzy Hartgrove, public affairs manager, Houston Planning and Development Department, March 15, 28 and 29, 2016", "Email interview, Veronica Beyer, director of media relations, Texas Department of Transportation, March 22, 2016", "Phone interview, Phil Lasley, researcher, Texas Transportation Institute, Texas A&M University, March 29, 2016", "News article, \"Turner tries to turn a page on Houston transportation,\" Houston Chronicle, Feb. 3, 2016 (accessed March 22, 2016)", "News article, \"Turner taps attorney Patman, former board member, as Metro chair,\" Houston Chronicle, March 4, 2016 (accessed March 24, 2016)", "Study, \"Need for Speed: Commute Time Influences Homebuyers,\" Texas A&M University, July 2006 (accessed March 29, 2016)", "Presentation, \"Update on Texas Congestion Relief Initiative,\" Texas Transportation Commission (accessed March 29, 2016)", "Report, \"2009 National Household Travel Survey,\" U.S. Department of Transportation, June 2011 (accessed March 30, 2016)", "Data, \"Commuting (Journey to Work),\" U.S. Census Bureau (accessed April 12, 2016)", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]