["By Jessica McDonald", "Posted on September 19, 2019", "President Donald Trump has repeatedly criticized energy-efficient lightbulbs, saying that the bulbs people are “being forced to use” are more expensive, contain hazardous gases and give off light that’s “not as good” as incandescents. Experts, however, say that’s an outdated and inaccurate description of the current technology.", "Much of what Trump said applies to some degree to compact fluorescent, or CFL, bulbs, which contain mercury and tend to have less-than-ideal color quality. But light-emitting diode, or LED, bulbs are the dominant environmentally friendly technology. They have no such safety risks and in most cases provide comparable or even superior light at a cheaper lifetime cost than incandescents.", "Trump spoke about lightbulbs at his Sept. 9 rally in Fayetteville, North Carolina, where he referenced his administration’s decision to reverse a 2017 rule that would have extended energy-efficiency standards to irregularly shaped bulbs and prohibited the sale of most traditional incandescents by Jan. 1, 2020. Trump said he wasn’t a “vain person,” but that he looks “better under an incandescent light than these crazy lights that are beaming down on.”", "He said “they were forcing you to buy lightbulbs that cost a fortune” and that the bulbs were “very dangerous with all of the gases.” If a lightbulb breaks, he added, “it’s considered almost like a waste site.”", "Three days later, he gave those comments another spin at a dinner speech delivered at the House Republican retreat in Baltimore. “The bulb that we’re being forced to use — No. 1, to me, most importantly, the light’s no good,” he said. “I always look orange. And so do you. The light is the worst.” He also said the bulbs are “many times more expensive than that old incandescent bulb that worked very well,” and he repeated the concern about a bulb breaking and being “a hazardous waste site.”", "At a rally this week in Rio Rancho, New Mexico, Trump returned to the idea again.", "Trump, Sept. 16: They took away our lightbulb. I want an incandescent light. I want to look better, okay? I want to pay less money to look better. Does that make sense? You pay much less money and you look much better. And on top of that, with the new bulbs, if they break it’s considered a hazardous waste site. It’s all gases inside and you’re supposed to bring it back to where you bought it in a sealed container. Give me a break.", "I asked the people, the professionals. Well, what do people do when it breaks, because they break all the time? What do they do? Nothing, they throw it away. So I owe — a lot of people didn’t know, they didn’t understand. You get a much better light at a much reduced cost, and it’s much safer. Because when those other bulbs break they really are dangerous. The gases come out, they’re dangerous.", "Experts told us that Trump was likely thinking of CFLs in his litany of complaints. But that’s misleading because there’s little reason to buy a CFL now that LED lights are available and have dropped in price.", "According to data from the National Electrical Manufacturers Association, in the first quarter of 2019, CFLs accounted for less than 5% of all sales of the classic pear-shaped bulbs. LEDs, in contrast, made up more than 70% of sales. Some manufacturers, such as General Electric, don’t even make CFLs anymore, and some retailers don’t sell them. Ikea, for example, has only sold LEDs as a lighting option since September 2015.", "“Whereas compact fluorescents do have mercury, that’s not really what we’re talking about today,” said Mark Rea, a lighting researcher at the Rensselaer Polytechnic Institute’s Lighting Research Center. “We’ve passed that. LEDs are the technology at the forefront.”", "Eric Hittinger, an associate professor of public policy at Rochester Institute of Technology who has a background in engineering, agreed. “He is pretty well mistaken about what lightbulbs are and how they work,” he said of Trump. “A lot of his talking points may have been accurate 10 or 15 years ago, but a lot has changed in the world of lighting in 10 or 15 years.”", "We’ll review each of Trump’s key claims, and we’ll also shed some light on what’s happened with lightbulb energy-efficiency standards over the last decade or so.", "Today’s lightbulb standards stem from the bipartisan Energy Independence and Security Act of 2007 passed under President George W. Bush. Under that law, Congress required general-use lightbulbs to gradually become more efficient. In phase one, the bulbs had to improve by at least 27% between 2012 and 2014, or the equivalent of making a 100-watt bulb provide the same brightness on just 72 watts. This effectively ended the sale of the classic pear-shaped traditional incandescents. A slightly modified and more efficient version of that bulb, known as a halogen incandescent, was still allowed. As the EPA’s website explains, the law did not ban the sale of all incandescent bulbs, and it did not require the use of CFLs.", "The legislation allowed the Department of Energy to revise the standards as needed to make them more stringent, and to consider expanding them to more types of bulbs. But if DOE did not set a standard, or set its standard too low, Congress included a “backstop” provision to prohibit the sale of bulbs that did not get at least 45 lumens per watt in 2020. Only CFLs and LEDs can meet this standard, which is 60%-70% more efficient than a traditional incandescent.", "Initially, these rules only applied to the classic pear-shaped lightbulbs that make up a little more than half of the nation’s bulbs. But in 2017, the Obama administration decided to extend the rules to more than half a dozen other categories of nontraditional bulbs, such as the candelabra bulbs that fit into chandeliers and sconces, the globe-shaped bulbs popular in bathroom vanities, and reflector bulbs used in recessed or track lighting. The change was set to begin on Jan. 1 2020, which is when the stricter 45-lumens-per-watt standard was also set to kick in.", "On Sept. 4, however, Trump’s Department of Energy announced it was finalizing a rule withdrawing the planned expansion, effectively limiting the standards to pear-shaped bulbs. The administration also proposed a new determination finding that the current standards for general-use incandescent bulbs do not need to be amended, which, if it passes legal muster, could mean the congressionally approved automatic standard for 2020 doesn’t apply.", "One of Trump’s primary concerns about energy-efficient lightbulbs is the light quality they provide. CFLs do provide noticeably worse light, but that’s not the case for most LEDs, several experts told us.", "“Compact fluorescents tend to not have a very good color spectrum,” said Hittinger. “But LED lighting improved significantly on compact fluorescents, and depending upon which LED bulbs you buy, [they] can be superior to incandescent bulbs.”", "In evaluating lightbulbs, researchers consider three main elements, Michael Murdoch, a color scientist at the Rochester Institute of Technology, explained. First, there’s the brightness of a lightbulb, which is measured in lumens. Second, there’s the color, or tint of the light, which is the correlated color temperature. This accounts for whether a white light source looks more orange, or “warm,” or blue, which comes off as “cold.” Last, but not least, there’s how the light affects objects in the world.", "As Murdoch said, “You care what stuff looks like when you light it with the light.” And it’s this latter component that is the most difficult to measure. Generally speaking, light sources that cover all the different wavelengths of visible light to an equal degree — and therefore have smooth, continuous spectra when those wavelengths are plotted out — are good, he said. They allow for people to see colors as they are, and also distinguish between similar hues. This is the case for daylight, and it’s mostly true of incandescents, although Rea noted that blues tend to be muted because of a deficiency in shorter wavelengths. Fluorescent lighting, in contrast, is more patchy. Its spectra is spiky, Murdoch said, “which is why it gives funny color renditions sometimes.”", "One metric that the industry uses as a proxy for light quality is the Color Rendering Index, or CRI. The index tells how realistic or natural objects look under a given light source compared with either an incandescent or daylight. In this sense, it’s a relative scale; incandescents and daylight score perfect 100s because they are the reference lights. CFLs usually come in around 80 and LEDs vary, but can score 90 or above, said Oregon State University architectural engineer and lighting specialist Kevin Houser. A score below 50, the Lighting Research Center says, is poor and colors will look unnatural.", "Because of this scoring system, LEDs might appear to be slightly worse. But that’s not necessarily true — a score less than 100 simply means the light doesn’t make objects look exactly like an incandescent would. And indeed, Murdoch, who has expertise in LEDs, said the light that the two bulb types produce is not exactly the same. “They’re not a perfect match,” he said. But the differences are negligible. Placed side-by-side, he said, most people would not be able to tell the difference. “It’s not something that would stick out.”", "The CRI, which by definition gives incandescents an upper hand, is subject to much debate in lighting circles. All of the light experts we spoke with said the CRI has its limitations, and there are other metrics to evaluate color rendering. In some cases, even though a bulb’s CRI score might be lower, people might still prefer it.", "In tests at the Lighting Research Center, Rea noted, people unaware of the identity of the light sources have preferred run-of-the-mill LEDs to incandescents 60-40 or 70-30. It’s “not true that the technology is inherently poorer,” he said.", "That’s not to say all LEDs are good. “You can get bad ones,” said Rea. Other experts echoed this, warning customers away from the cheapest LED bulbs, whose manufacturers may have taken shortcuts. But for the most part, LEDs are comparable to and potentially even better than incandescents in light quality.", "As for Trump’s claim that energy-efficient bulbs make him and others look orange, Murdoch said lower-quality LEDs can leave white skin tones looking dull instead of pink. “I wouldn’t characterize it as orange. But it doesn’t look as red and lively,” he said, adding that over the last decade, the spectral quality of LEDs has improved, and most bulbs today “are going to do a pretty good job of skin tones and normal colors.”", "In the end, Rea recommended that consumers avoid labels and instead take a look at the lightbulb display cases at their local home improvement stores. “The proof is in the eye,” he said. “People will see if they do a side-by-side comparison that LEDs are mostly better than incandescents, with some exceptions.”", "Trump also said that energy-efficient bulbs “cost a fortune” and were “many times more expensive” than incandescents. It is true that both CFLs and LEDs cost more upfront. But the energy-efficient models last around 10 times longer, if not more. And thanks to the fact that they take less electricity to run, they also cost far less to use. Indeed, if a bulb is used with any frequency at all, a CFL and especially an LED will be cost-saving to consumers compared with an incandescent.", "Oregon State University’s Houser said Trump’s omission about total outlays made his information on cost “dead wrong.” “He’s only thinking of initial cost,” he said. “That’s an incorrect way of looking at the problem.”", "When LEDs first debuted for common use in 2012, the price was shockingly high. A standard pear-shaped bulb went for around $60, according to the National Electrical Manufacturers Association. But the cost today can be as low as $3, compared with around $1 for an incandescent, said RPI’s Rea. And that price differential quickly swings the other way when factoring in LEDs’ longer lifespan and increased efficiency.", "“If you have a light fixture in your house that you use a couple hours a day, paying the extra money for an LED lightbulb is basically like an investment that pays itself back in a few months,” Hittinger said. “And then after that, it’s just free money.”", "He added that the cost savings can really add up if people upgrade most or all of their regularly used bulbs. Replacing one bulb might save a few dollars on a person’s electricity bill in the first year, he said, “but if you multiply that by, you know, 10 or 20 lightbulbs that are in commonly used fixtures in a house, you’re starting to talk about an amount of money that matters to real people.”", "A large portion of Trump’s lightbulb complaint focuses on the idea that energy-efficient lightbulbs are dangerous, and that when they break they can release hazardous gases. Although the president doesn’t mention them by name, experts said he’s almost certainly thinking of CFLs, which can release mercury vapor if broken.", "CFLs, like most tube fluorescent bulbs, work by exciting mercury molecules to produce ultraviolet light, which then activates a UV-sensitive phosphor coating on the bulb to make it light up. This process is around 75% less energy-intensive than a traditional incandescent, which wastes 90% of its energy on heat. But because mercury is a neurotoxin, it does mean that if a bulb is broken, special steps should be taken during cleanup.", "The Environmental Protection Agency recommends airing out the room for 5-10 minutes before carefully collecting and placing any glass fragments or other bulb remnants into a glass jar, then placing the jar outside until the bulb can be taken to a recycling center. If a person’s local government does not have any disposal requirements, then the EPA says the bulb can be thrown out in the regular trash.", "While mercury in the bulbs is a serious concern, Houser said it’s not quite as dire a picture as Trump painted in his description. The EPA even tells people not to panic if they fail to follow the recommended steps. “Don’t be alarmed; the steps outlined below are only precautions that reflect best practices for cleaning up a broken CFL,” the agency’s website reads. “Keep in mind that CFLs contain a very small amount of mercury — less than 1/100th of the amount in a mercury thermometer.”", "A standard CFL contains 4 milligrams of mercury, which the Department of Energy’s website notes is “significantly less” than the amount made by power plants to produce the extra energy needed to run a less-efficient incandescent bulb.", "The mercury issue is a legitimate drawback to CFLs. But because no one is compelled to buy CFLs over LEDs — which do not contain mercury or any other hazardous gases — it’s not true that people are “forced” to buy bulbs with hazardous gases. “It’s kind of a non-issue now because of LEDs,” said Rea.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]