["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Calling his opponent \"too extreme for Central Texas,\" U.S. Rep. Lloyd Doggett, D-Austin, says in a mailer that Republican nominee Donna Campbell \"has called for ending all federal funding for education.\"", "We won’t judge whether Campbell’s extreme for Doggett’s constituents. But has she proposed an end to federal education aid?", "Some perspective: Federal aid accounts for a sliver of overall U.S. public school funding. During the 2007-08 school year, such aid totaled $48 billion, which was 8.2 percent of total public school funding, according to the National Center for Education Statistics, an arm of the U.S. Department of Education.", "The federal slice was slightly bigger in Texas: about 10 percent of the public education budget, according to the center. According to the Texas Education Agency, during the 2007-08 school year, Texas public schools received $4.3 billion in federal aid, amounting to about 9.5 percent of public education funding in the state.", "We wondered if Campbell wants to stop the flow of those dollars. Mike Asmus, a spokesman for Campbell’s campaign, said: \"I’ve not heard her call for ending all federal funding for education.\"", "We asked Doggett’s campaign for its back-up. Spokeswoman Amanda Tyler forwarded two video clips. The first, from a Nov. 23, 2009 episode of the Austin public-access cable TV show, \"The Trailer Park Show.\" The clip shows Campbell looking slightly out of place in a suit sitting behind a table with a diverse cast of characters.", "\"Would you vote to end federal funding for education?\" a man calling into the show asks.", "Campbell responds: \"Federal funding for education? Yes. Because ... it’s a job of the states. Choices need to be put back in the hands of the parents and state.\"", "Another man sitting at the table says he thinks that it’s the federal government’s responsibility to educate citizens, which means helping students attend college if they otherwise couldn’t afford it. \"And I strongly believe through financial aid, government should step in there and support these students because they are working hard,\" he says. \"They want to be productive citizens of our society.\"", "Campbell responds: \"But government is state also. The states can do it.\"Later, she says: \"Do I support education? Absolutely. But it needs to go back in the choices of the parents and leave it with the state.\"", "Doggett quotes the first part of that exchange — Campbell saying she would vote to end federal funding for education — in his mailer and shows it in an ad posted on YouTube Oct. 13.", "We e-mailed the video clip to Asmus. He replied: \"Thanks for running this clip past me — having now watched it, I still see the statement on Mr. Doggett’s mailer as inaccurate.\" In a later e-mail, Asmus told us Campbell \"has not ‘called’ for anything; she is answering a question. Also, the question does not include the word ‘all,’ nor does her answer.\"", "The other clip Doggett’s campaign sent us — also posted on Campbell’s campaign website — shows both candidates talking about federal education aid at an Oct. 19 Bastrop Chamber of Commerce candidates forum.", "According to the clip, Campbell was asked how she would fund education while cutting federal spending. She replied that too many strings are currently attached. \"Why not have money that is from Texas stay in Texas to fund Texas schools?\" she said. \"Why should any Texas money — when we have a good economy within Texas, relative to other states — why should Texas money go to other schools in the nation?\"", "We looked for other instances of Campbell explaining her position on federal education funding when her campaign e-mailed an Oct. 22 statement in which she stands against federal involvement in the schools, saying improvements happen \"best when driven at the local level.\" It doesn’t say anything about stemming federal education aid.", "On her campaign website, Campbell also challenges the federal role in education, though we found no call to end federal aid. \"Federal bureaucrats have become too involved in our schools,\" an education issues page on the site says, \"preventing teachers from doing their jobs effectively... I will fight for local educators and stand up against the broken and unaccountable bureaucracy in Washington that is all too willing to experiment with our children’s education.", "In an interview aired Oct. 22 by Austin’s KXAN, Channel 36, Campbell responded to Doggett’s ad: \"Monies that arise from Texas from our taxes should stay in Texas to fund Texas schools, not be sent to Washington D.C. to redistribute that education money. Leave it in Texas.\"", "We sought to interview Campbell; Asmus said she wasn’t available.", "And our grade? No question, Campbell said last year she would vote to end federal funding for education. She has not repeated that exact statement. In campaign materials, she advocates against federal involvement in Texas schools, but doesn’t explicitly call for ending federal aid.", "That said, Campbell also has not clarified or backed off on saying she’d vote to end such federal funding. We rate Doggett’s statement Mostly True.", "Mailer from the Lloyd Doggett for U.S. Congress Committee", "Clip of the Trailer Park Show episode with Donna Campbell, Nov. 23, 2009, posted on YouTube by Rep. Lloyd Doggett on Oct. 1, 2010", "\"Job Killer\" ad by Rep. Lloyd Doggett, posted on YouTube Oct. 13, 2010", "\"Lloyd Doggett and his opponent debate at forum in Bastrop,\" posted on YouTube by Rep. Lloyd Doggett, Oct. 20, 2010", "The Trailer Park Show, Editorial: Taking on Lloyd Doggett, Oct. 25, 2010", "Calendar of upcoming events on Donna Campbell's campaign website, accessed Oct. 22, 2010", "\"Improving education\" statement on Donna Campbell's campaign website, accessed Oct. 22, 2010", "E-mail statement from Donna Campbell on education, Texas and Washington red tape, Oct. 22, 2010", "Austin American-Statesman, Doggett picks fight with Perry over schools money, Sept. 12, 2010", "Austin American-Statesman, Lawsuit puts hold on U.S. aid; State sues so $830 million can't be spent elsewhere, Sept. 24, 2010", "KXAN.com, Doggett refuses to debate Campbell; Candidates talk federal education money with KXAN, Oct. 22, 2010", "Legislative Budget Board, Fiscal Size-up for 2010-11 Biennium", "Legislative Budget Board, Fiscal Size-up for 2008-2009 Biennium", "E-mail interview with Mike Asmus, spokesman for Donna Campbell's campaign, Oct. 21, 2010", "E-mail interview with Amanda Tyler, campaign manager, Lloyd Doggett for Congress, Oct. 20 and 21, 2010", "Interview with Eva De Luna Castro, senior budget analyst, Center for Public Policy Priorities, Oct. 26, 2010", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]