["About this rating", "City Blue Imaging, a printing store in New York, sustained a devastating fire.", "This business was not involved with printing ballots in the 2020 election.", "Over the Christmas holiday in December 2020, a New York printing company, City Blue Imaging Services, sustained a devastating fire that left the building in ruins. While this was certainly a terrible blow for the owners of the store, its employees, and the local community, the fire garnered attention from a national audience when rumors started to spread that this business was involved in printing ballots for the 2020 election.", "There truly was a fire at City Blue Imaging over the holiday. However, this company did not print ballots for the 2020 election.", "John Mealy, the store's sales manager, told local news outlet 13 ABC Wham:", "“It’s crazy, the amount of misinformation that you see ... It’s disgusting. It really is. And that’s not what we’re about. We’re focusing on moving forward.”", "There's no truth to the claim that City Blue Imaging printed ballots for the 2020 election. But that didn't stop conspiracy theorists from attempting to connect the dots. In this case, they found a company that truly did print ballots for the 2020 election, Phoenix Graphics, and claimed that it owned City Blue Imaging. This, too, is false. City Blue Imaging is not owned, nor has it ever been owned, by Phoenix Graphics.", "On Dec. 27, City Blue Imaging attempted to dispel this rumors on social media:", "To the misinformed people on @Twitter and @instagram #cityblueimaging does not print #ballots, does not do work for #Phoenixgraphics and was never owned by the owner of #phoenixgraphics. You may want to read a book some day to learn about my reference to rising like a #phoenix", "This is the second incident in the last week that has been used by conspiracy theorists in a fruitless attempt to support false allegations of widespread voter fraud. As mentioned in the above-displayed tweet from Lin Wood, an attorney and avid Trump supporter who has pushed several dubious claims about election fraud, some social media users falsely claimed that the explosion at the AT&T building in Nashville, Tennessee, had destroyed Dominion voting machines. You can read more about the false rumors attempting to connect that catastrophe to election fraud here.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]