["About this rating", "The CDC shared a July 2020 study that showed layering a sleeve of “sheer nylon hosiery material” over a mask may improve the wearer’s protection.", "The U.S. government has not issued a mandate requiring Americans to wear nylon hosiery-type sleeves over their masks.", "As more people around the United States get vaccinated against COVID-19, the federal government and Centers for Disease Control and Prevention (CDC) continue to emphasize the need for masks as a source of protection. In late Jan. 2021, U.S. President Joe Biden signed mandates stating that masks must be worn on all federal property, in airports, on many planes, trains, ships, and intercity buses.", "The transportation mask mandate went into effect on Feb. 1, 2021. Presently, at least 38 states in the country have universal masking mandates in effect as well. Snopes readers asked us if the government was also imposing a requirement to wear pantyhose over masks for more protection.", "We learned that while the government has enforced no such requirement, recent research has shown that wearing nylon hosiery material over masks has proven to be effective in protecting people.", "The CDC shared a report on Feb. 10, 2021, that described new methods of mask-wearing. Titled “Maximizing Fit for Cloth and Medical Procedure Masks to Improve Performance and Reduce SARS-CoV-2 Transmission and Exposure, 2021,” the report cited research being conducted on how to make masks more effective in reducing the spread of COVID-19. The report stated:", "Other studies found that knotting and tucking a medical procedure mask or placing a sleeve made of sheer nylon hosiery material around the neck and pulling it up over either a cloth or medical procedure mask (3,4) also significantly improved the wearer’s protection by fitting the mask more tightly to the wearer’s face and reducing edge gaps.", "In the July 2020 study, researchers from Northeastern University found that adding an outer layer made from nylon stocking to a surgical mask significantly improved the fit of the mask. The nylon stocking layer also helped homemade cloth masks match or exceed the filtering capability of medical-grade surgical masks. Testing showed that a 3M surgical mask with an added nylon pantyhose layer went from blocking out 75% of small particles to 90% of particles.", "An NPR video showed how the nylon stocking layer fits over a face mask:", "https://www.youtube.com/watch?v=r7ywjj6mJGk&feature=emb_title", "Given that the CDC did cite studies indicating that sheer nylon hosiery-type sleeves may make masks more effective but has not announced a U.S. government mandate to wear such sleeves, we rate this claim as “Mostly False.”", "Nur Nasreen Ibrahim is a reporter with experience working in television, international news coverage, fact checking, and creative writing.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]