["About this rating", "In February 2018, a graphic attempted to blame Sen. Cory Booker (D-New Jersey) for a second brief shutdown of the U.S. federal government within a month with a fabricated statement:", "Cory Booker (d) today annouced Senior Citizens, disable military, will have their monthly payments held up Until DACA passes, or hell freezes over if that's what it takes with the looming democrat shut down of government.", "He added he wasn't elected by \"Those sort of people in the first place\" and credits his win to Dreamers Brave enough to register to vote for him.", "Further he stated DACA recipients need to be treated as first Class citizens, not as undocumented aliens, while seniors and disable Veterans as well as active duty need to be removed from preferential treatment and learn to pass their privlage onto our most honored Citizens Dreamers. DACA or shut down the government till Dreamers can vote in midterm elections.", "Besides losing coherence as it goes along in what we can only describe as sheer laziness, the post spreads a number of falsehoods: first of all, both DREAMers (the term for immigrant youths who would have been covered under the proposed DREAM Act) and enrollees in the Deferred Action for Childhood Arrivals (DACA) program cannot vote. Conservatives have consistently insisted — without any proof to back it — that Democrats have benefitted from receiving millions of illegal votes, whether it be from undocumented immigrants or African-Americans.", "Further, the remarks about \"those sort of people\" and veterans having to \"pass their privlage [sic]\" were fabricated. And while the graphic fretted about a government shutdown, it was brief; President Donald Trump signed a congressional budget agreement early on 9 February 2018, which ensured that the government would continue to function.", "We contacted Booker's office seeking a response to the fabrications in the graphic, but did not receive a response by press time.", "Walters, Joanna.    \"What is Daca And Who Are the Dreamers?\"\r\n   The Guardian.    14 September 2017.", "Davis, Susan et al.    \"Trump Signs 2-Year Spending Pact.\"\r\n   NPR.    9 February 2018.", "Arturo Garcia is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]