["Legendary astronaut Buzz Aldrin made history in 1969, when he helped to pilot the first lunar landing module to reach the moon and became the second man to set foot on the lunar surface as part of NASA's Apollo 11 mission.", "One recent Facebook \"Did You Know\" post claims that following his voyage to the moon, Aldrin informed NASA he witnessed aliens.", "\"Buz (SIC) Aldrin was the second person to walk on moon. After he returned, he made a shocking claim that he saw Aliens while he was there. He told NASA and later took a lie detector test, which he passed,\" reads a March 20 meme.", "The claim was posted to the Facebook group \"Facts you didn't know about\" and the post has over 1,200 reactions and 360 shares.", "\"Personally I think there are extra terrestrial life,\" reads the caption of the post by a Facebook user, to whom USA TODAY reached out to for comment.", "Fact check: Mars Perseverance rover landing happened, Ingenuity helicopter can fly on Mars", "Rumors that Aldrin said he saw aliens when he traveled to the moon started in April 2018, when British tabloid Daily Star published a story claiming that he passed a lie detector test confirming he encountered an alien.", "The Daily Star reported the lie detector test was allegedly performed by the Institute of BioAcoustic Biology and Sound Health and proved that the Aldrin and the other astronauts were \"completely convinced\" they witnessed aliens.", "However, the test used decades-old recordings of Aldrin and his fellow astronauts and not live interviews with the astronauts themselves, USA TODAY reported in 2018. While Aldrin himself had previously denied this claim, the \"top secret\" test claimed a hidden truth was discovered in the tone of Aldrin's voice that overrode his conscious statements.", "The Independent debunked the findings in 2018 and wrote that the institute's claim that it can tell when people are lying through the frequencies of our voice \"is impossible according to modern science.\"", "\"It is theoretically possible that it could be possible to understand whether someone is lying by listening to their voice, but previous examples have been unreliable and the institute reported on by the Daily Star did not make its working available to the public or to other scientists,\" the Independent reported.", "Fact check:Image claiming to show the first sunset captured on Mars is an illustration", "Aldrin has previously spoken publicly about what he saw, and spokespersons have denied the claims included in the Daily Star report.", "In a 2014 \"Ask Me Anything\" Reddit thread, Aldrin wrote that while \"the probability is almost CERTAIN\" of life somewhere in space, \"It was not an alien\" that he saw on his Apollo 11 route to the moon.", "“There were many explanations of what that could be, other than another spacecraft from another country or another world - it was either the rocket we had separated from, or the 4 panels that moved away when we extracted the lander from the rocket, and we were nose-to-nose with the two spacecraft,” Aldrin wrote.", "He added that when he returned to Earth he was debriefed and learned that what he had observed was the sun reflecting off of one of those panels.", "NASA spokeswoman Stephanie Schierholz also told USA TODAY in 2018 that Aldrin likely saw four panels that had separated from the spacecraft in flight.", "\"The panels would have had the same momentum as the rest of the spacecraft and would have followed them along (generally) toward the moon,\" Schierholz said. She added that the word \"unidentified\" in UFO can be problematic because It does not have to mean \"of alien origin.\"", "\"While engineers and scientists can be reasonably confident what was seen was one of the panels, to an engineer/scientist, it is still technically 'unidentified' — hence the use of the terminology,\" she said.", "A spokesperson for Aldrin also told Snopes in 2018 that \"Buzz did not take a lie detector test. He has never said he saw a UFO.\"", "Fact check:Image claiming to show the first sunset captured on Mars is an illustration", "The claim that Buzz Aldrin told NASA he saw aliens during his trip to the moon and it was confirmed by a lie detector test is FALSE, based on our research. The claim originates from a study that has been debunked and did not include any actual interviews with the astronauts. Aldrin and NASA have both confirmed that what he saw was not an alien or a UFO. What he likely saw were panels that separated from the spacecraft in flight.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook."]