["About this rating", "At an August 2018 meeting with a local chapter of Young Americans for Freedom, Ripon College officials criticized a poster created by the group that referenced eight Islam-related acts of violence against Americans as part of the group's planned 9/11 commemoration. Some administrators discouraged the group from displaying the poster on campus.", "The college does not require prior approval for flyers or posters on campus, and nobody from Ripon College banned the poster, which Young Americans for Freedom displayed on campus in 2017.  The poster is also not a \"9/11 memorial\" as such, since 9/11 is only one of eight incidents depicted on the poster.", "Controversy surrounded a small Wisconsin liberal arts college in August 2018, after a conservative youth organization accused school administrators of censorship and excessive political correctness over a flyer about Islamic terrorism.", "In a blog post on 29 August, Young America's Foundation (YAF) spokesperson Spencer Brown claimed Ripon College had barred a local chapter of its affiliate, Young Americans for Freedom, from posting copies of the flyer around campus:", "Citing bias reports filed during last year’s 9/11: Never Forget Project, administrators at Ripon College in Ripon, Wisconsin, ruled that YAF’s 9/11: Never Forget Project posters are creating an “environment” where “students from a Muslim background would feel singled out and/or harassed.” As a result, Ripon administrators will not allow the Ripon Young Americans for Freedom to hang the flyers as part of their work to remember the victims of September 11 or other victims of radical Islamist terrorism.", "When leaders from Ripon YAF pressed administrators in a meeting to explain what was objectionable about the posters which merely depict history, the school’s “Bias Protocol Board” failed to provide anything more than the usual bizarre leftist excuses that rely on feelings, rather than facts, to back up their censorship.", "According to administrators, the objections were “raised to the administration and the bias incident team about the environment that that [the poster] creates .... That because of the focus, in this case relentlessly on one religious organization, one religious group, one religious identity -- in associating that one religious identity with terrorist attacks which go back far before 9/11 and after 9/11 -- creates for some students here an environment which they feel like they are not able to learn.”", "The claim that administrators had banned the posters, motivated by a concern for the \"feelings\" of Muslim students, formed the basis of reports by the Washington Examiner, the Daily Wire, and the Daily Caller. The story was also promoted on Twitter by Fox News host Sean Hannity and his network colleague Shannon Bream, the latter of whom included it in her \"Real News Roundup\" on 30 August. Newsweek originally published an article headlined \"Wisconsin College Bans 9/11 Memorial Posters Saying They Are Biased Against Muslims\" but later altered that article after consultation with Ripon College.", "It's true that certain school administrators discouraged Young America's Foundation from displaying their posters, but administrators did not \"ban\" the material. On the whole, reports claiming such were inaccurate and misleading.", "No ban", "A spokesperson for Ripon College firmly denied that administrators had banned the posters, pointing out that the school does not have a policy requiring students to clear flyers and posters with authorities in advance, and that the same poster had been put up on campus in 2017:", "Ripon College did not ban the posters ... Ripon's posting policy never requires prior approval for posting ... When these were posted last year, it led to a vigorous debate on campus, including counter postings.", "The college provided us with a photograph of one of the posters hanging on the campus in 2017, with a counter-poster next to it which read \"Get to the point, focus on the victims of 9/11, not on Islam\":", "The student handbook stored on the college's web site states that only advertisements produced by off-campus businesses must be approved in advance by administrators if they are to be placed in residence halls. Otherwise, the handbook does not require any \"prior approval\" for posters or flyers.", "However, the handbook does state that \"Postings may not promote violence; contain abusive/hateful language that targets individuals or members of a certain race, gender, sexuality, and/or ethnic group.\" The college spokesperson outlined the procedure in place for instances of students' objecting to a particular poster:", "If it is a bias complaint it goes to the bias incident team to review. They usually connect with the party who hung the posters and discuss things. If they feel there is bias, the Dean of Students usually talks with the party who hung the posters.", "The spokesperson confirmed that the YAF poster was the subject of several such complaints in 2017. The Bias Incident Team examined those complaints, but the team has no enforcement authority, and their report did not result in any action's being taken with respect to the poster.", "The YAF blog post itself contains elements which actually reinforce the notion that Ripon College does not \"ban\" posters in advance. For example, the post quotes an unnamed school official as telling the group \"If you put this poster out there ... you’re going to get the same negative results ...\" That language strongly suggests that, in the view of school authorities, the decision on whether or not to put up the flyers rested with YAF itself, although certain administrators were keen to discourage the group from doing so.", "It is noteworthy that Spencer Brown's blog entry included multiple quotations from school officials criticizing the premises and potential consequences of the flyer, but none in which a Ripon College administrator forbade or barred YAF from posting the flyers on campus. We asked Brown whether he stood by his claims in light of statements from Ripon College and whether he could provide any evidence which might support the assertion that the school had banned the flyer, but we did not receive a response in time for publication.", "Objections were not to a \"9/11 memorial,\" as such", "The poster in question features eight images of Islam-related violence against Americans, with captions for each image, centered around a panel which reads \"Never forget\":", "The incidents depicted on the poster were the 1979 Iran hostage-taking crisis, the 2012 attack on U.S. government facilities in Benghazi, the 1983 bomb attack on U.S. and French peacekeepers in Beirut, the Isis beheading of American journalist James Foley in 2014, the Al-Qaeda bombing of the U.S.S. Cole in Yemen in 2000, Al-Qaeda's 2002 beheading of the journalist Daniel Pearl, the 2016 mass shooting at the Pulse nightclub in Orlando, and the terrorist attacks on New York's World Trade Center of 11 September 2001.", "Since the latter appeared in only one of the eight panels, it is misleading to describe the poster as a \"9/11 memorial,\" as many news reports did in August 2018. But this framing of the narrative unfairly and inaccurately created the impression that Ripon College officials had forbidden a commemoration of the 9/11 attacks specifically. (And the school didn't forbid the poster at all, as we've outlined.)", "YAF asked for a meeting with administrators; they were not summoned to one", "The account presented by YAF and others suggested that Ripon College officials, including those from the Bias Protocol Board, intervened to halt the group's \"9/11 memorial\" plans. This was not the case. In fact, YAF itself requested a meeting with the Bias Protocol Board in order to discuss the fallout resulting from display of the same poster in 2017.", "Ripon College provided us with email correspondence between a local YAF chapter representative and a school official showing that the YAF representative actually initiated the dialogue with college authorities as far back as May 2018, seeking to \"get some clarity on what exactly was wrong with our posters.\" The exchange was cordial and respectful, and at no time did the YAF representative seek the administrator's permission to put up the posters:", "To whom it may concern:", "We were recently informed of some issues with Young Americans for Freedom’s 9/11 Posters that were found by the Bias Protocol Board. We, as officers, would like to set up a meeting with you before next year’s September 11th to get some clarity on what exactly was wrong with our posters. If we had been informed earlier, we most certainly would have tried to arrange this meeting before the end of the school year. Hopefully we can meet early in the upcoming semester. Thank you.", "That meeting appears to have taken place on 28 August, which prompted YAF's blog post's false claims that administrators had said they \"will not allow\" the group to put up the posters. According to a college spokesperson, the meeting involved an \"intellectual exchange\" which did not culminate in any action by school authorities:", "The YAF group requested to meet with the Bias Team because YAF wanted to understand what concerns had been expressed by students -- they were not called before any sort of hearing or disciplinary process. Nor were they required to meet; again, the meeting was requested by YAF.", "The content of the meeting was an academic discussion of the issues raised in this debate, in which a wide range of ideas were explored. It was not an evidentiary hearing or a disciplinary body, but an intellectual exchange. The meeting did not result in any action, apart from an invitation for further conversation should YAF desire it.", "Conclusion", "YAF's poster does not exclusively commemorate 9/11; it also refers to seven other well-known Islam-related terrorist attacks or incidents of violence against American citizens. When YAF put up the poster around the campus of Ripon College in 2017, it caused a controversy and prompted complaints from some students.", "In August 2018, at a meeting which YAF itself requested, some Ripon College administrators criticized the poster and discouraged YAF from displaying it on campus again. However, school officials did not ban the poster, and Ripon College does not have a policy requiring prior approval for posters on their campus (unless they are advertisements for outside businesses).", "It remains to be seen whether YAF will put up the poster on campus again in 2018, whether other students will complain to school officials if they do, and what course of action (if any) Ripon College will take in response.", "Brown, Spencer.   \"Ripon College 'Bias Protocol Board' Rules Against YAF's 9/11: Never Forget Posters.\"\r\n    Young America's Foundation.   29 August 2018.", "Cooley, Lauren.   \"Campus Bans Sept. 11 Memorial for 'Bias' Against Muslims.\"\r\n    The Washington Examiner.   30 August 2018.", "Dillon, Kassy.   \"Ripon College Bans Poster for 9/11 Memorial Claiming It Singles Out and/or Harasses Muslim Students.\"\r\n    The Daily Wire.   29 August 2018.", "Prince, Molly.   \"College Bans 9/11 Memorial Citing Muslims' Feelings.\"\r\n    The Daily Caller.   30 August 2018.", "Hetherington, James.   \"Wisconsin College Outright Denies Claims It Banned 9/11 Memorial Posters.\"\r\n    Newsweek.   31 August 2018.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]