["In a post shared to his Facebook page, Texas Agriculture Commissioner Sid Miller highlighted the actions of National Guard Sgt. Leigh Ann Hester, the first female soldier to receive the Silver Star Medal since World War II.", "Hester received the award in 2005 for her role in \"thwarting an Iraqi insurgent ambush,\" where she and a \"handful of other Guard soldiers fought off more than 30 insurgents armed with assault rifles, machine guns and rocket-propelled grenades after the force attacked a supply convoy southeast of Baghdad,\" according to The New York Times.", "The citation for her award stated that she killed three people in the \"anti-Iraqi Forces\" ambush.", "Miller’s post includes text copied from an article about Hester published by Military Times. It also includes a photo of a woman in a military uniform with mud splattered across one side of her face. Text across the top of the image includes the name Leigh Ann Hester and a description of her actions.", "It reads: \"Ambushed in Salman Pak, Iraq. Killed 3 enemy combatants in close-quarter battle. Awarded a Silver Star.\"", "The only problem? The woman in the photograph Miller shared is not Hester.", "Todd Smith, a spokesman for Miller, said several veterans who follow Miller on Facebook asked him to share the image with text to his followers.", "\"The information was accurate, but it appears the photo was of a different person,\" Smith said. \"We wouldn’t have had any way to know that. We were just trying to honor a brave, courageous member of our armed forces who did something extraordinary. That’s why we posted it.\"", "Hester was profiled by multiple news outlets after receiving the Silver Star and there are dozens of accompanying photographs of her that are accessible online. An action figure was modeled in her image, and a wax figure of her is on display at the U.S. Army Women’s Museum in Virginia.", "The woman in the photograph Miller shared has vastly different facial features than Hester, and her hair is a deep brunette, while Hester’s looks closer to blonde.", "A Google Reverse Image Search shows that the photo Miller used in his post came from a 2013 GQ magazine series about women who serve in the military. The lead photo in the digital version of the story is the same one that appears in Miller’s Facebook post. The caption in the GQ article identifies the woman as Lt. Tina Turner.", "The article features different women who serve in the U.S. Armed Forces, and the first story highlighted in the piece is about Hester, who described the circumstances surrounding her Silver Star award.", "Smith pointed to the fact that the GQ article including the image also discussed Hester and her experiences.", "\"Someone could certainly make the same mistake,\" he said.", "A different GQ profile from the same 2013 project — called \"Women of the 101st Airborne Division\" — includes remarks from Turner and other female soldiers stationed at Fort Campbell in Kentucky.", "At the time the article was published, the soldiers were preparing to deploy to Afghanistan as part of the 4th Brigade Combat Team, 101st Airborne Division.", "The photo was part of a series called \"Military Women\" shot by photographer Danielle Levitt. The series featured female soldiers completing a training exercise, which included crawling through mud.", "In another photo in the series, Turner’s name is visible on her uniform.", "This is not the first time Turner’s photo has been used online with inaccurate information about her.", "In a post on her personal Facebook page from January, Turner said the image of her used in the GQ feature \"pops up on the internet from time to time.\"", "Turner shared a link to a different doctored version of the photo which included the caption: \"I turned down a modeling contract to join the Army.\"", "\"The comments that ensued on this post were disappointing, to say the least,\" Turner wrote in her Facebook post, which highlighted negative comments left by others on the image. \"This isn’t the first time this picture has been shared, which means this isn’t the first time I’ve seen comments like this so it doesn’t really phase me anymore. It just disappoints me more than anything.\"", "Turner did not return a message sent to her on Facebook.", "Our Ruling", "Miller shared an image to his Facebook page that he said was of a Silver Star recipient: Sgt. Leigh Ann Hester.", "But the image he shared was actually a photo of Lt. Tina Turner, who served in the 4th Brigade Combat Team, 101st Airborne Division.", "We rate this image False.", "Correction (Dec. 5, 2019): An earlier version of this story included the wrong date that the claim was made on Facebook. It was made on Nov. 29, 2019. This change does not affect the ruling.", "Facebook post, Sid Miller, Nov. 29, 2019", "Military Times, This sergeant became the first woman in the US Army to earn a Silver Star for combat valor, June 14, 2019", "GQ, Natural Born Killers, April 23, 2013", "DS Reps, Military Women, Danielle Levitt, accessed Dec. 2, 2019", "NPR, Silver Star Recipient A Reluctant Hero, Feb. 22, 2011", "The Tennessean, Franklin Silver Star recipient talks women in military, Aug. 29, 2015", "The New York Times, Female M.P. Wins Silver Star for Bravery in Iraq Firefight, June 17, 2005", "Home of Heroes, Silver Star - Global War on Terror - Army, accessed Dec. 2, 2019", "Department of Defense, Fact Sheet: Women in Service Review (WISR) Implementation, accessed Dec. 2, 2019", "Facebook post, Tina Turner, Jan. 21, 2019", "Email interview with Stephanie Porto, editorial stills and video content manager for Danielle Levitt, Dec. 2, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]