["By Katherine Hartzell", "Posted on July 2, 2020", "A viral Facebook post whose author expresses frustration with COVID-19, racial and political divisions, and other topics is falsely attributed to tennis star Serena Williams. It was actually written by another Facebook user with the same name.", "Tennis star Serena Williams has not been afraid to voice her opinions both on and off the court.", "Williams has spoken out about sexism in the professional tennis industry, and the gender and racial pay gap. She has been a longtime supporter of the Black Lives Matter movement, writing in a 2015 Wired article, “To those of you involved in equality movements like Black Lives Matter, I say this: Keep it up.”", "In 2019, she published a story in Harper’s Bazaar about her controversial loss in the 2018 singles Grand Slam tournament, where she was charged with the code violation of “verbal abuse” after calling the referee “a thief.” Williams wrote, “Ever since I was a little girl, I’ve felt a need to voice my opinion and be heard.”", "But a screenshot of a widely shared Facebook post that expresses frustration with current health, social and political issues is falsely attributed to the tennis icon.", "The screenshot reads: “I’m sick of COVID-19. I’m sick of black vs. white. I’m sick of Democrats vs. Republicans. I’m sick of Christians vs. atheists. I’m sick of no one being allowed to think what they want & feel what they do without offending someone.” It urges readers to “stop thrusting your beliefs on others” and claims that “if you can’t handle the fact that you may have a friend that has opposing views of you, then you are not any better than the bigots and the racists.”", "In a tweet that has been shared over 6,000 times, one Twitter user wrote: “They should give Serena Williams credit for winning another grand slam for this post.”", "“Couldn’t have said it better myself!” wrote NBA player Rudy Gobert, tagging the Twitter account of the 23-time Grand Slam singles winner in a mistaken tweet that has since been deleted.", "These posts attached the screenshot of the Facebook post by user Serena Williams. But it appears to be a case of mistaken identity. The post originated from the account of a different Facebook user also named Serena Williams — not the account of the American tennis star.", "In fact, the Facebook bio of the original poster reads, “Nope, not THAT Serena Williams.” The popular post appears on this person’s Facebook page, dated June 14.", "This is not the first time a social media post written by a user with the same name as a public figure has sparked confusion. In September, we wrote about a viral rant that was falsely attributed to the actor and comedian Tim Allen after it was shared by another Facebook user who goes by the same name.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "Chavez, Nicole. “Serena Williams is calling out sexism in tennis. Here’s why.” 10 Sep, 2018.", "Hartzell, Katherine. “Conservative Rant Misattributed to Actor Tim Allen.” FactCheck.org. 13 Sep 2019.", "Holland, Jesse. “Serena Williams champions issues on — and off — tennis court.” Associated Press. 20 Feb 2018.", "“Rudy Gobert tweets post of wrong Serena Williams, gets trolled heavily.” Yahoo Sports. 21 Jun 2020.", "Williams, Serena. “Serena Williams: How Black Women Can Close the Pay Gap.” Fortune. 31 Jul 2017.", "Williams, Serena. “Serena Williams Poses Unretouched for Harper’s Bazaar.” Harper’s Bazaar. 9 Jul 2019.", "Williams, Serena. “The Ball Is In Your Court.” Wired. Nov 2015.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]