["The photo was published here on Facebook on November 7, 2019. It has been shared more than 20,000 times. The image was captioned with a lengthy warning of an imminent 7.1-magnitude earthquake in Manila, the Philippine capital, and its surrounding areas.", "Below is a screenshot of the misleading Facebook post:", "The first part of the Tagalog-language post translated to English states: \"WOW THERE'S ALREADY A WARNING ABOUT THE EARTHQUAKE", "\"From DRRM DepEd IMPORTANT TO LET EVERYONE KNOW …", "\"Warning of Phivolcs to us all about an earthquake that will be experienced in Metro Manila. There is a 100 kilometer fault line that is currently in Bulacan, Quezon City, Markina, Pasig, Makati, Taguig, Muntinlupa, Rizal, Cavite and Laguna where an intensity 7.1 earthquake could be experienced.", "\"Government agencies studying the earthquake estimate that over 30,000 could die and over 100,000 could be injured or wounded.”", "The post purports to cite Phivolcs, the Philippine Institute of Volcanology and Seismology, and references DRRM, a disaster risk reduction and management team that the Department of Education (DepEd) formed in 2018. The areas mentioned in the post are cities within the Manila metropolitan area and its neighboring provinces.", "Similar posts without the image have also been shared on Facebook here on November 3 and on Twitter here on November 4.", "But the claim is false, and the photo has been used in a misleading context.", "A reverse image search and subsequent keyword search found this stock photo published by UK-based photo agency Alamy of the poster for San Andreas, a disaster film from 2015. A textless version of the poster can be found here on Moviemania, a website that publishes movie wallpapers.", "Below is a screenshot comparison showing the misleading photo (L), the Alamy stock photo (C) and the textless San Andres poster (R):", "The caption in the misleading post was recycled from an old hoax previously debunked by AFP on April 24. As it did in April, Phivolcs again this month posted statements on Facebook here and on Twitter here refuting the purported warning.", "The agency’s post on Facebook, written in a mix of Tagalog and English, states: “AGAIN A REMINDER FROM DOST-PHIVOLCS:", "“The PHIVOLCS-DOST does NOT GIVE PREDICTIONS about earthquakes.", "“What we do is prepare earthquake scenarios of hazards and impacts to be used as a guide for mitigation, preparedness, and response.", "“#NoToFakeNews #ReadAndUnderstand”", "Below is a screenshot of the Phivolcs post:", "The Tagalog-language infographic attached to Phivolcs’ post quotes the first part of the misleading post.", "Translated to English, the infographic adds: “We would like to let the public know that this message did not come from DOST-PHIVOLCS and our agency does not have enough basis to release a warning about an imminent big earthquake. At present, there is no technology in the world that can predict a big earthquake. Regardless, DOST-PHIVOLCS continues to monitor areas where earthquakes originate to provide adequate advisory based on gathered data especially when there are unusual events happening there.", "“We urge those who have received the message to refrain from spreading it through text and internet.”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]