["About this rating", "In November 2016, the web site TMZWorldNews (formerly CelebtriCity) published an article reporting that the cigarette brand Newport planned to introduce marijuana cigarettes dubbed the \"Newport Nirvana\":", "Reynolds American Inc. Chief Marketing Executive Lawrence Harrison, said in an interview that the company has been ecstatic on the idea of marketing cannabis, and has been monitoring the market for some time. It was only when the recent legalization initiatives — winning in Colorado and Washington — that the company finally made the decision to take part in the cannabis market.", "Harrison added that they have purchased thousands of acres of land to grow natural hemp. The tobacco company has been setting up a distribution process across North and South American territories, to streamline the supply lines.", "Like its fellow outlets (TMZWorldStar/TMZUncut/TMZBreaking),  TMZWorldNews is a fake news site appropriating the name of popular gossip site TMZ. None included a disclaimer warning readers its content consisted entirely of falsehoods. Prior fabrications from TMZWorldStar and related pages included claims a police officer shot a black baby after mistaking a pacifier for a gun, a penile implant could alert women to cheating romantic partners, a college student fell into a coma after participating in a social media semen-drinking challenge, KKK members committed suicide en masse due to the introduction of the Harriet Tubman $20 bill, a non-existent study proved 80 percent of black men in Atlanta were gay, and police found a satanic dungeon under a Chuck E. Cheese (a falsehood which bears striking resemblance to the late-2016 Pizzagate conspiracy theory).", "This article appears to have been lifted from a previous (but almost identical) hoax story that Marlboro would soon be selling \"Marlboro M\" cannabis cigarettes in a signature green box.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]