["About this rating", "On 14 January 2017, Rep. John Lewis of Georgia told NBC anchor Chuck Todd he planned not to attend the inauguration of President-elect Donald Trump, asserting it would be the first time during his tenure in the U.S. Congress (where he has held a seat since 1987) that he had skipped the ceremony:", "Rep. Lewis explained to Todd that he did not consider Trump a \"legitimate president.\" When Todd inquired why Lewis felt that way, the congressman cited his belief that Russia had interfered with the 2016 U.S. presidential election:", "It will be the first one that I miss since I've been in Congress. You cannot be at home with something that you feel that is wrong, is not right.", "Later that day President-Elect Trump lashed out at Rep. Lewis on Twitter, enraging Democrats by describing the former civil rights leader as \"all talk ... no action\":", "Congressman John Lewis should spend more time on fixing and helping his district, which is in horrible shape and falling apart (not to......", "— Donald J. Trump (@realDonaldTrump) January 14, 2017", "mention crime infested) rather than falsely complaining about the election results. All talk, talk, talk - no action or results. Sad! — Donald J. Trump (@realDonaldTrump) January 14, 2017", "Congressman John Lewis should finally focus on the burning and crime infested inner-cities of the U.S. I can use all the help I can get!", "— Donald J. Trump (@realDonaldTrump) January 15, 2017", "The President-Elect did not allude to the interview that apparently prompted his ire in his initial series of tweets, but it didn't take long for Lewis' assertion he'd never missed an inauguration before to come under scrutiny. A Washington Post article from 21 January 2001 recorded that Lewis had indeed skipped the swearing-in of the previous Republican president, George W. Bush, in 2001 for the same proclaimed reason:", "Some members of the Black Caucus decided to boycott Inauguration Day; John Lewis, for instance, spent the day in his Atlanta district. He thought it would be hypocritical to attend Bush's swearing-in because he doesn't believe Bush is the true elected president.", "CBS News similarly reported that Lewis had passed on attending the 2001 inauguration:", "... Lewis said it would be the first time he’d be skipping an inauguration as a congressman, but in fact, there was another missed inauguration — also a protest — and that was the 2001 swearing in of President George W. Bush.", "“His absence at that time was also a form of dissent,” Lewis’ communications director, Brenda Jones, told CBS News’ Walt Cronkite in an email. “He did not believe the outcome of the election, including the controversies around the results in Florida and the unprecedented intervention of the US Supreme Court, reflected a free, fair and open democratic process. “", "That information did not escape the notice of the President-elect's Twitter feed:", "John Lewis said about my inauguration, \"It will be the first one that I've missed.\" WRONG (or lie)! He boycotted Bush 43 also because he...", "— Donald J. Trump (@realDonaldTrump) January 17, 2017", "\"thought it would be hypocritical to attend Bush's swearing-in....he doesn't believe Bush is the true elected president.\" Sound familiar! WP", "— Donald J. Trump (@realDonaldTrump) January 17, 2017", "Merida, Kevin.   \"So Close, So Far: A Texas Democrat's Day Without Sunshine.\"\r\n    The Washington Post.   21 January 2001.", "Todd, Chuck et al.   \"Rep. John Lewis: ‘I Don’t See Trump as a Legitimate President’.\"\r\n    NBC News.   14 January 2017.", "CBS News.   \"John Lewis to Skip Inauguration for Second Time in Congressional Career.\"\r\n    17 January 2017.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]