["About this rating", "Sasha and Malia Obama wore dresses worth about $20,000 each to a state dinner.", "Taxpayers paid for the dresses.", "On 11 March 2016, several web sites published photos of Sasha and Malia Obama at their first White House state dinner, along with the claim that the dresses worn by the first two First Daughters were worth about $20,000 each:", "Malia, 17, who was seated next to Saturday Night Live’s Lorne Michaels and actress Sandra Oh, wore a strapless faille gown with crystal beading from the pre-fall 2015 collection. The 100 percent silk piece is no longer available for purchase, but it originally retailed for $17,990. The embellished piece didn’t need any more bling, so she went without jewelry. Malia blew out her hair in loose waves and had a subtle cat eye and nude lips.", "While Malia went for a more classic, elegant look, her younger sister added a young, fresh flair. Also in Naeem Khan, Sasha chose a look from the Indian-American designer’s resort 2016 collection, a gown embroidered with allover threadwork, beading, and appliqué, accentuated by a fitted bodice and ball skirt. The 14-year-old complemented the red, black, and sheer piece, which retails for $19,990, by styling her hair in Dutch braids and tying a thin ribbon around her neck as a choker.", "Some publications used the price of the dresses to criticize the Obama administration, while others falsely claimed that taxpayers bought and paid for the dresses worn by Sasha and Malia:", "Wisdom often brings humility, but apparently, both the Obamas and Canadian Prime Minister Justin Trudeau disagree.", "According to the U.K. Daily Mail, President Barack Obama and first lady Michelle Obama let their daughters Malia and Sasha wear $20,000 gowns to a posh state dinner event at the White House with Trudeau last Thursday.", "This disgusting disrespect for American tax-payers needs to be spread everywhere. Obama’s shameful waste must be exposed now.", "While it's true that Sasha and Malia Obama wore two dresses worth about $40,000 to a state dinner at the White House, American taxpayers didn't pick up the tab. In 2014, Michelle Obama's press secretary Joanna Rosholm said that the First Lady's (and, by extension, the First Daughters') gowns are generally paid for for out of pocket, although dresses are occasionally donated:", "\"Mrs. Obama pays for her clothing. For official events of public or historic significance, such as a state visit, the first lady's clothes may be given as a gift by a designer and accepted on behalf of the U.S. government. They are then stored by the National Archives.''", "The Washington Post reported in 2011 that the First Lady's personal assistant buys many of her dresses at discounted prices:", "\"(Michelle Obama's personal assistant Meredith Koop's) responsibilities include advising the first lady on her wardrobe and acting on her behalf in arranging for purchases, including considering the best offered price and buying on discount if discounts are available,\" said Kristina Schake, a spokeswoman for Michelle Obama.", "The issue of clothing is one that bedevils many First Families. While Presidential spouses are expected to dress extravagantly for state functions, they receive no salary or clothing allowance, taxpayer-funded or otherwise.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]