["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Travelers wear face masks as they sit in a waiting room at the Beijing West Railway Station in Beijing on Jan. 21, 2020. Chinese authorities are responding to an outbreak of a new coronavirus that started in Wuhan, China. (AP)", "A claim circulating on Facebook suggests a coronavirus outbreak roughly 100 times more deadly than authorities and the news media are letting on.", "\"CORONAVIRUS: Reports of 10,000 DEAD in Wuhan, China,\" reads a Jan. 24 story from the Geller Report. The website is run by Pamela Geller, an activist who co-founded Stop Islamization of America, a far-right group.", "This is just one of many false statements circulating on social media at what appears to be a break-neck pace – far faster than the spread of the health threat itself.", "This latest post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "First, the Geller Report article is questionably sourced. It says that a guy named Bill Holter heard from a friend named Robert who heard from an American friend who heard from a Chinese friend who has relatives in Wuhan that \"there may already be ~10,000 dead there from the virus.\"", "But here’s what we know from credible sources about the Wuhan coronavirus:", "According to a Jan. 26 report from the World Health Organization, more than 2,000 people have contracted the virus, the vast majority of whom live in China. More than 100 people in the United States are being evaluated for possible infection. According to the New York Times, 81 people have died, all of them in China.", "The figure of 81 deaths was also reported by CBS News and other media.", "As of 7 p.m. Eastern on Jan. 27, the figure reported by Johns Hopkins University, which is mapping the virus, was 82", "However, as we were putting this fact-check together, Agence France-Presse, in a report carried by CBS, said the death toll, according to Chinese authorities, had reached 106.", "The South China Morning Post also reported the 106 figure and attributed it to Chinese authorities.", "So, while the death toll appears to be climbing, the Geller Report story is way, way off.", "A claim circulating on Facebook says: \"CORONAVIRUS: Reports of 10,000 DEAD in Wuhan, China.\"", "There is nothing but mostly anonymous hearsay to back it up.", "Credible news and university reports put the death toll at a tiny fraction of what is claimed — 106 as of the evening of Jan. 27.", "We rate the statement Pants on Fire!", "The Geller Report, \"CORONAVIRUS: Reports of 10,000 DEAD in Wuhan, China,\" Jan. 24, 2020", "PolitiFact, \"Fact-checking hoaxes and conspiracies about the coronavirus,\"", "New York Times, \"Coronavirus Live Updates: Alarm Grows as Markets Tumble and Death Toll Rises,\" Jan. 27, 2020", "South China Morning Post, \"China coronavirus death toll climbs to 106 as confirmed cases surpass 4,000,\" Jan. 28, 2020", "CBS News, \"Coronavirus outbreak: Death toll rises in China as U.S. plans evacuations from Wuhan,\"", "FactCheck.org, \"Misinformation on Coronavirus Death Toll,\" Jan. 27, 2020", "Johns Hopkins University, \"Wuhan Coronavirus (2019-nCoV) Global Cases,\" Jan. 27, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]