["The photo was posted to Facebook here on September 16, 2020, with the caption: “Peter Makal, a teacher at a primary school in Juba, was seriously confused after he prepared the lesson for his class, but found them asleep following their breakfast.”", "Juba is the capital of South Sudan.", "In the image, more than a dozen small children are seen asleep beneath the shade of a tree while a man sitting on a chair keeps watch. Next to him is a small chalkboard.", "The photo was also posted with the same claims on Facebook here, here, here, and here.", "While the image is genuine, the claim that it was taken in South Sudan is false.", "Children under a tree in Nigeria", "AFP Fact Check conducted a reverse image search that led to an article from October 17, 2017, published on a Nigerian online news and entertainment website called Kemi Filani News. The headline reads: “Viral photo of primary school pupils sleeping under the tree in Kwara state.”", "According to the brief report, the photo shows children from a local school in Mancha village, Edu, in Nigeria’s Kwara state.", "Similar articles were published in several Nigerian blogs and websites in the same year, such as Nigeria Newspaper, GistMania, and Nairaland.", "Another reverse image search result led to the Facebook page of the Ask The Paediatricians Foundation and a post by them on November 3, 2017, containing the same photo along with an appeal for donations to help renovate the school in Mancha village, Kwara state.", "“We need your support to get these children back to their classrooms!” reads part of the caption, which includes bank account details for donations.", "AFP Fact Check contacted Ask The Paediatricians Foundation, whose representatives confirmed their involvement in the fund-raising effort and supplied other images of the school, also available on their website, taken before and after the renovation work.", "The foundation, which focuses on children’s health and welfare through various outreach programmes, had renovated existing classrooms and provided furniture and stationery to the school in 2018.", "“When we saw the state of learning on the viral picture posted on Facebook ... of children in a school sitting and sleeping on a dirty muddy floor under a tree to learn, we just couldn't look away,” said the Lagos-based foundation’s Vera James in an email to AFP Fact Check. “Though it was a huge task for us at the time, we had to do something about it. It was disheartening seeing Nigerian children learning under such conditions. Beyond the fact that that was a very uncomfortable learning environment, it was also a source of several skin infections, which could be fatal to children's health and wellbeing.”", "“The project was commissioned in January 2018, with a medical outreach for over 500 hundred children in the community,\" James said. \"The outreach covered paediatric consultations, nutritional status checks, medications, healthy meal packs, among others.”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]