["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Rep. Lucy Kay McBath, D-Ga., speaks during a House Judiciary Committee markup of the Justice in Policing Act of 2020. (AP)", "In a new ad, Georgia Democratic Rep. Lucy McBath points a finger at her competitor, saying former GOP Rep. Karen Handel’s actions in Congress hindered the nation’s ability to respond to COVID-19.", "\"Karen Handel slashed the Centers for Disease Control's ability to fight diseases, cutting millions in research funding,\" the ad’s narrator says over flashing images of a tired medical worker, an empty laboratory and a patient lying in a hospital bed, her eyes closed.", "The ad ends by stating McBath believes the CDC should be protected, \"not gutted.\"", "But the attack misses due to cherry-picking: What McBath points to as evidence is Handel’s vote for a massive spending bill to avert a government shutdown, not an up-or-down vote on money for the CDC.", "This is not the first time McBath and Handel are running for the same seat. Handel served in the House from June 2017 to January 2019, after winning a special election. McBath defeated Handel in Handel’s bid for re-election in November 2018.", "The McBath-Handel rematch is one of 18 pivotal House and Senate contests up for election on Nov. 3 that PolitiFact is tracking. It is rated \"lean Democratic\" by the Cook Political Report, meaning it’s a competitive race but that the Democrat appears to have the advantage.", "In this campaign, we’ve rated one McBath attack on Handel as Half True; a Handel claim about McBath as False; and an attack by the National Republican Congressional Campaign on McBath as False.", "McBath’s ad cites Handel’s vote in February 2018 for a budget bill, that cleared the House on a 240-186 vote and was signed into law byinto law three days later by President Donald Trump. The measure provided continuing appropriations for numerous federal agencies into March 2018, including the agriculture, commerce, defense, energy, health and human services, interior, justice and transportation departments. The bill was a stopgap measure to avert a government shutdown and keep the government running for six weeks.", "The bill called for a reduction of $1.35 billion over 10 years in the CDC’s Prevention and Public Health Fund which, at the time, accounted for 12% of the CDC’s budget.", "According to the CDC, the fund must be used \"to provide for expanded and sustained national investment in prevention and public health programs to improve health and help restrain the rate of growth in private and public health care costs.\"", "But a vote for a massive budget bill hundreds of pages long isn’t proof that a representative is voting for, or against, any single provision in the bill. In other words, this was not an up-or-down vote on one portion of the CDC’s budget any more than it was a vote on $14 million in hurricane assistance for Puerto Rico and the Virgin Islands, or on $1 million for the office of the inspector in the Economic Development Administration, both of which also were in the bill.", "Handel’s campaign acknowledged that Handel voted for the bill that reduced the Prevention and Public Health Fund, but argued that overall, the CDC’s operating plan for fiscal 2019 showed an increase in funding in most areas.", "It’s worth noting that federal support to build state and local capacity to manage a new viral crisis fell by 50% after 2003. The decline in federal aid spans three presidencies and many sessions of Congress. President Trump sought $100 million in cuts that would have made the situation harder. But Congress ignored the president’s budget plans and largely kept the flow of dollars steady, even increasing them slightly.", "McBath claimed in an ad that Handel \"slashed the Centers for Disease Control's ability to fight diseases, cutting millions in research funding.\"", "What Handel voted for was a big stopgap funding measure that kept numerous government agencies funded for six weeks and averted a shutdown. It was not an up-or-down vote on CDC funding, though it did include a reduction in one of the CDC’s funds.", "We rate the statement Mostly False.", "YouTube, Lucy McBath \"Gutted\" ad, Sept. 28, 2020", "Interview, Lucy McBath campaign staffers Ayesha Syed and Jake Orvis, Oct. 19, 2020", "Email, Karen Handel campaign spokesman Brian Robinson, Oct. 19, 2020", "Centers for Disease Control and Prevention, FY 2019 Operating Plan, accessed Oct. 20, 2020", "Centers for Disease Control and Prevention, \"Prevention and Public Health Fund,\" July 13, 2018", "Congress.gov, \"H.R.1892 - Bipartisan Budget Act of 2018,\" accessed Oct. 17, 2020", "Center for Healthcare Research and Transformation, XXX, February 2018", "NPR, \"House Passes Funding Extension After Trump Says 'I'd Love To See A Shutdown,'\" Feb. 6, 2018", "New York Times, \"Trump Threatens Shutdown as Negotiators Close In on Budget Deal,\" Feb. 6, 2018", "Health Affairs, \"New Budget Bill Eliminates IPAB, Cuts Prevention Fund, And Delays DSH Payment Cuts,\" Feb. 9, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]