["About this rating", "In January 2020, we started receiving queries about an essay supposedly written by actor and director Ron Howard that began \"I am a liberal, but that doesn't mean what a lot of you apparently think it does.\"", "Here's an excerpt from the start of the essay. The original text can be found at the bottom of this article:", "I'm a liberal, but that doesn't mean what a lot of you apparently think it does. Let's break it down, shall we? Because quite frankly, I'm getting a little tired of being told what I believe and what I stand for. Spoiler alert: not every liberal is the same, though the majority of liberals I know think along roughly these same lines:", "1. I believe a country should take care of its weakest members. A country cannot call itself civilized when its children, disabled, sick, and elderly are neglected. PERIOD.", "While several postings of this text attributed the essay to Howard, this article circulated on social media long before his name was attached to it.", "The article was actually written by author Lori Gallagher Witt and was posted to her Facebook page in January 2018. As this article spread on social media, Witt's name was eventually stripped from the text. When the article appeared on the website Medium in August 2019, for instance, it was preceded by an introduction explaining that a \"friend\" had posted the article from an anonymous author on Facebook:", "A friend of mine posted the document below on his Facebook page. He did not write it, but felt that it was a good description of his personal feelings and felt a need to share it.", "Witt has commented on how her work was separated from her name. In July 2019, she noted how one website was sharing her text without proper attribution:", "Wow, talk about some brass balls.", "He posts my words, doesn't even mention that they're written by someone else (though after someone told him I wrote it, there was a line added at the very bottom as an afterthought, while still keeping HIS NAME as the byline). In the comments, he responds to compliments by saying this is him making a stand, AND he uses the post to encourage people to follow him on social media.", "In January 2020, she lamented that her work was once again spreading on social media without her name attached to it:", "Oh yay, it's that time of year again, when people start sharing the \"anonymous\" list of \"why I'm a liberal.\" *eyeroll*", "Anonymous, my ass. Someone just took my name off it and added \"copy and paste -- I did!\"", "Here's Witt's original Facebook post:", "In short, the popular internet essay starting \"I'm a liberal, I've always been a liberal, but that doesn't mean what a lot of you apparently think it does\" was not written by director Ron Howard but by author Lori Gallagher Witt.", "Brenkle, George.   \"The Devil is in the Details.\"\r\n    Medium.   15 August 2019.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]