["About this rating", "In late August 2018, a number of pro-life web sites such as LifeNews.com published articles reporting that 125 women \"took abortion pills to kill their babies\" during a protest concerning the legality of abortion in South Korea:", "The accompanying photograph did depict a protest in South Korea, but the claim that 125 women took \"abortion pills\" during that demonstration in order to terminate their pregnancies as part of the demonstration does not appear to be accurate. The majority of participants in the protest were intended to simply take harmless vitamin pills.", "Activists in South Korea put out a call in August 2018 for 125 women to join them for a protest at Boshingak (a large pavilion at the center of Seoul) to demand the end of Clause 269, a portion of the South Korean legal code that criminalizes abortion, and to legalize the abortion drug Mifepristone. The protest, which was organized by the Korean feminist organizations Femidangdang and Baumealame in collaboration with Women on Waves, featured 125 women because that's the number of women, according to the activists, who have  abortions in South Korea every hour:", "Terminating a pregnancy is not a sin. It is not taboo. Right here in South Korea, where abortion is prohibited by law, we speak for women choosing to terminate pregnancies. Abortion is a right that must be secured no matter the social status of the woman. Society speaks of abortion as a decision that only promiscuous or unmarried women choose. Pregnancy is considered a just punishment that such women must bear. However, abortion is an operation that is most frequently enacted worldwide, and many women choose abortion for various reasons. According to the Korean Association of Obstetricians & Gynecologists, it is estimated that around 3000 surgical abortions are conducted within our country every day. This is three times the amount our government estimates. During the single hour that our performance is taking place, 125 South Korean women decide to terminate their pregnancy. Right at this moment, we speak of the women that choose abortion. 125 of us have come together to make the following demands to a country that imposes the responsibility of unwanted pregnancies upon women, and women only.", "The invitation for the event informed participants that while one activist would truly be taking the abortion drug Mifepristone, all 125 volunteers would be given harmless vitamins to take instead:", "What do you do?", "125 women gather in front of the hospital and eat medicine together. The organizer activist eats a drug called mifepristone, a drug that stops pregnancy. The rest of the participants eat vitamin pills.", "125명의 여성이 보신각 앞에 모여 다함께 약을 먹습니다. 주최 측 활동가는 임신중단 약물, ‘미프진(미페프리스톤)’ 알약을 먹습니다. 나머지 참가자는 비타민 알약을 먹습니다.", "A message posted to Twitter announcing the event also stated that all of the pills handed out by the event organizers would be vitamins, not actual abortion pills:", "We went through the sign-up process to find out more about the demonstration and noted that the sponsoring organization had stated on numerous occasions that the pills handed out to the 125 women participants would be nothing more than vitamins. In the event's FAQ section, for instance, the activists wrote that \"all the pills distributed by the organizer to the participants are vitamin D.\"", "This event reportedly did feature at least one activist taking the drug Mifepristone. However, it's unclear if she or any other activists who might have actually taken the drug were pregnant at the time of the protest. A portion of the FAQ section explained that while the protest trod the line of legality, authorities would not be able to tell who had taken the drug or whether any of protest participants were pregnant:", "Is this performance illegal?", "We all use the same medicine box. The general participant protects the activist by eating vitamins similar to Miffin. Organizer activists take actual pills but it is against the law to force them to be pregnant. You can not tell if an abortion actually happened, so eating these pills in public is not in violation of abortion law.", "Another section explained that medical staff would be on hand to provide aid to the participants:", "The activists who take myopin know the precautions in advance and the medical staff will be waiting for the situation on the spot.", "We reached out to Women on Waves and Femidangdang for more information about the protest but did not receive a response prior to publication.", "Bilger, Micaiah.   \"125 Women Take Abortion Pills to Kill Their Babies to Protest Pro-Life Laws.\"\r\n    Life News.   27 August 2018.", "Women on Waves.   \"Abortion Pill Protest in Seoul, South Korea.\"\r\n    Retrieved 2 September 2018.", "Work, Clint.   \"Taboo No More? Abortion in South Korea.\"\r\n    The Diplomant.   9 December 2017.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]