["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "In this image from video, Tom Hanks speaks during the Celebrating America event on Wednesday, Jan. 20, 2021, following the inauguration of Joe Biden as the 46th president of the United States. (Biden Inaugural Committee via AP)", "About one year ago, on March 11, 2020, actor Tom Hanks announced that he and his wife, the actress Rita Wilson, had tested positive for COVID-19 in Australia, where he was shooting a movie.", "Social media posts at the time made Pants on Fire claims that the diagnosis was a cover for criminal charges.", "Now, a new post that’s being widely shared on Instagram alleges that Hanks died in Australia a couple days after announcing he had COVID-19.", "What looks like a news headline from March 13, 2020, says \"coronavirus claims life of Tom Hanks.\" It attributes the information to a \"Queensland Health spokeswoman.\"", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "There’s no information to support this claim.", "The screenshot of the story that appears in the Instagram post was taken from a website called the-daily-star.com. Though the original story has since been deleted, an archived version of the report says \"News24\" at the top, lending credence to the idea that this is a credible news site. But scroll down and you’ll see this disclaimer: \"This is satire.\"", "And there’s plenty of evidence refuting the claim that Hanks died back in March 2020.", "A couple of weeks after his COVID-19 announcement, American news outlets were reporting that Hanks and Wilson were both back stateside and had been photographed driving around Los Angeles, where they live.", "The Daily Mail published the photos of Hanks that appear in the Facebook post in May 2020. Captions on the images say Hanks is in Los Angeles, not Australia.", "On April 11, Hanks, hosted a special remote episode of \"Saturday Night Live.\"", "And in January, Hanks, now 64, hosted an evening celebration of President Joe Biden’s inauguration.", "We rate this Instagram post Pants on Fire!", "Instagram post, March 16, 2021", "PolitiFact, Another Tom Hanks hoax about unfounded criminal allegations, July 23, 2020", "News24, Breaking: Coronavirus claims life of Tom Hanks, March 13, 2020", "The Hollywood Reporter, Tom Hanks hosts special remote episode of ‘Saturday Night Live at Home,’ April 11, 2020", "BBC News, Tom Hanks hosts star-studded concert for Joe Biden’s inauguration, Jan. 21, 2021", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]