["By D'Angelo Gore", "Posted on May 1, 2019", "In announcing that he will withdraw the United States from the United Nations Arms Trade Treaty, President Donald Trump falsely claimed that under the international agreement, the U.S. would “surrender American sovereignty” and allow “foreign bureaucrats to trample on your Second Amendment freedom.”", "As a matter of fact, the treaty’s preamble clearly states that it reaffirms “the sovereign right of any State to regulate and control conventional arms exclusively within its territory, pursuant to its own legal or constitutional system.” And the nonpartisan Congressional Research Service said the treaty “does not affect sales or trade in weapons among private citizens within a country.”", "Rachel Stohl, an international arms trade expert who was a consultant during the Arms Trade Treaty process, said Trump was reinforcing “a false narrative.”", "Trump made his announcement during the National Rifle Association’s annual meeting on April 26. His decision was applauded by the NRA’s lobbying arm, which also said the treaty was a “threat to our national sovereignty and Second Amendment.”", "Trump, April 26: So, in the last administration, President Obama signed the U.N. Arms Trade Treaty. And in his waning days in office, he sent the treaty to the Senate to begin the ratification process. This treaty threatened your subjugate — and you know exactly what’s going on here — your rights and your constitutional and international rules and restrictions and regulations.", "Under my administration, we will never surrender American sovereignty to anyone. We will never allow foreign bureaucrats to trample on your Second Amendment freedom. And that is why my administration will never ratify the U.N. Arms Trade Treaty.", "The president repeated a similar claim the next day at a rally in Wisconsin.", "Trump, April 27: Just yesterday, I announced that my administration is unsigning the U.N. Arms Trade Treaty. We’re unsigning it, we’re pulling it back out of the United Nations. We’re pulling it back out of Congress. All of you Second Amendment people, you know you know what it is. You’ll be very happy with it because we will never allow foreign bureaucrats to trample on America’s freedom. We’re not going to allow it. That was a President Obama disaster.", "But Trump is making unsupported claims about the treaty that are similar to ones spread in a viral email we debunked years ago — before the ATT was even finalized.", "The treaty, which went into force in December 2014, requires parties to establish standards for regulating the international trade of conventional weapons such as battle tanks, warships, missiles and small arms. It aims to “prevent and eradicate the illicit trade in conventional arms” by prohibiting cross-border sales when U.N. arms embargoes would be violated, or when exporting nations suspect the weapons would be used by importers to commit war crimes, genocide, terrorism or other offenses against civilians.", "Under President Barack Obama, the U.S. was one of the 100-plus nations that signed the treaty, but it did not ratify it. More than three years after then-Secretary of State John Kerry signed the treaty in September 2013, Obama sent it to the Senate, which never held a vote on a resolution of ratification. (In 2013, the Senate voted 53-46 in favor of a nonbinding amendment to prevent the U.S. from entering into the pact.)", "Still, when signing the treaty, Kerry said that it was about “reducing the risk of international transfers of conventional arms that will be used to carry out the world’s worst crimes,” and that it “will not diminish anyone’s freedom” because it actually “recognizes the freedom of both individuals and states to obtain, possess, and use arms for legitimate purposes.”", "“Make no mistake, we would never think about supporting a treaty that is inconsistent with the rights of Americans, the rights of American citizens, to be able to exercise their guaranteed rights under our constitution,” Kerry stated.", "The Congressional Research Service also said in a report updated in March that the treaty “does not affect sales or trade in weapons among private citizens within a country.” In addition, CRS, the independent research arm of Congress, said that “[b]ecause the United States already has strong export control laws in place, the ATT would likely require no significant changes to policy, regulations, or law.”", "Stohl, managing director of the nonpartisan Stimson Center, which promotes global security and prosperity, said Trump’s claims were not true.", "“Trump reinforced a false narrative about the treaty — one that was generated and propagated by the NRA, politicians and other special-interest groups to prey on fears of ‘full-scale gun confiscation’ and boost fundraising efforts,” Stohl wrote in an April 29 op-ed published by the Washington Post. “These groups want the American public to believe that the ATT infringes on U.S. sovereignty and Second Amendment rights. This is a lie.”", "She added: “The ATT purposefully excludes issues surrounding domestic gun laws or regulations. It does not restrict or hinder the Second Amendment, nor does it create a national gun registry. In fact, the preamble makes specific reference to the legitimate trade, lawful ownership and use of certain conventional arms for recreational, cultural, historical and sporting activities. Insinuating that the ATT undermines U.S. laws and puts American liberty under foreign control is dishonest and misleading.”", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]