["About this rating", "In September 2017, as the attention of the United States turned to National Football League players who took to kneeling during the national anthem as a form of a protest against police brutality, a photograph purportedly showing a Seattle Seahawks player burning an American flag in a locker room started making the usual outrage rounds:", "This image, posted by the \"Vets for Trump\" Facebook page on 28 September 2017, has been digitally altered, but offered up as genuine.", "The original was taken by Seattle Seahawks photographer Rod Mar, and it showed NFL player Michael Bennett performing a \"now-traditional post-victory dance\" in the Seahawks locker room: \n\nBennett has participated in pre-game protests, and on 28 September 2017 he spoke at a CNN event about what he and the other NFL players hope to accomplish by kneeling during the anthem:\n\"I would like to challenge every American that is watching this show to treat people better,\" said Bennett, speaking at a CNN town hall moderated by Anderson Cooper. \"That really is what it's about. It's about treating people like human beings. That's the first step.\"\n\"The changes start with the heart,\" he continued. \"This is not a violent protest. This is a peaceful protest. We are challenging people spiritually, not physically, spiritually to change the way you have been doing. Change the culture.\"\nHowever, while Bennett has kneeled in protest and although he has appealed to change the culture, he has not burned an American flag to make his point.", "The original was taken by Seattle Seahawks photographer Rod Mar, and it showed NFL player Michael Bennett performing a \"now-traditional post-victory dance\" in the Seahawks locker room:", "Bennett has participated in pre-game protests, and on 28 September 2017 he spoke at a CNN event about what he and the other NFL players hope to accomplish by kneeling during the anthem:", "\"I would like to challenge every American that is watching this show to treat people better,\" said Bennett, speaking at a CNN town hall moderated by Anderson Cooper. \"That really is what it's about. It's about treating people like human beings. That's the first step.\"", "\"The changes start with the heart,\" he continued. \"This is not a violent protest. This is a peaceful protest. We are challenging people spiritually, not physically, spiritually to change the way you have been doing. Change the culture.\"", "However, while Bennett has kneeled in protest and although he has appealed to change the culture, he has not burned an American flag to make his point.", "Ryan, Josiah.   \"NFL Star Michael Bennett Challenges Americans to Treat Each Other Better.\"\r\n    CNN.   28 September 2017.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]