["The video was published on Weibo here on October 25, 2020. It has been viewed more than 18,000 times.", "The post’s simplified Chinese caption translates to English as: “#LiuKaichi# My God, it's really the TVB's golden supporting actor Liu Kai-chi. Why is he selling clothes now?”", "Liu Kai-chi is a Hong Kong actor who has been working for Hong Kong broadcasting company TVB for decades.", "The video has also been viewed hundreds of thousands of times alongside similar claims here, here and here on Weibo; here, here and here on Facebook; and here, here and here on Douyin, the Chinese version of video-sharing app TikTok.", "The claim is false.", "L&P Entertainment Ltd., the agency representing Liu, published a statement on Weibo here on October 26, 2020, saying the claim about the footage is false.", "“Recently, some media platforms such as Douyin have seen posts about our artist Liu Kai-chi reduced to selling clothes on the street to make ends meet,” part of the traditional Chinese statement reads.", "“We hereby declare that the video shows movie filming titbits. And film staff can be seen from the clip working nearby!”", "A keyword search found that the scene shown in the footage is from Ladies Market, a Hong Kong film that has not been released. A trailer can be seen on YouTube here.", "In the trailer, Liu can be seen wearing the same striped shirt that he is seen wearing in the footage shared in the misleading social media posts.", "Below are four screenshots of the trailer showing Liu in the same shirt:", "Signs seen in the footage shared in the misleading posts also show that the film set was located in Hong Kong’s Mong Kok neighbourhood. The exact location can be seen on Google Maps here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]