["“Canadian Govt Publishes Bid Request For ‘Programmable Hydraulic Guillotines’ Needed ‘in support of Canada’s response to COVID-19,’” reads the headline of a November 16, 2020 article shared hundreds of times on Facebook.", "The claim spread across websites and was shared on Facebook, Twitter and YouTube.", "The social media attention followed the publication of a document by the federal agency in charge of awarding public contracts, after purchasing hydraulic paper cutters (guillotines) for Statistics Canada, the national statistics agency.", "The original document, which read “Programmable Hydraulic Guillotines,” was later amended to read “Hydraulic Paper Cutter.”", "“It is indeed a tender notice for Hydraulic Paper Cutter, not to cut people’s heads,” a spokeswoman for Public Services and Procurement Canada told AFP in an email.", "Contacted by phone, a spokesman for Sydney Stone, the company that won the government bid, declined to comment.", "A search for “guillotine” on the company’s website shows that the items in question are indeed paper cutters.", "A video showing how a hydraulic guillotine works can be found here.", "Canada formally abolished the death penalty in 1998, but there had not been an execution since 1962, according to Amnesty International.", "This is not the first time that a government form from the buyandsell.gc.ca website has been targeted by false claims on social media.", "AFP Fact Check debunked posts in October that Canada was building “internment camps” -- claims sparked by a government document about quarantine facility management.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]