["The video has been viewed more than 140,000 times in this Facebook post published on May 7, 2020.", "It has been shared more than 8,000 times, including here to an Australia-based Facebook group with more than 45,000 members.", "The two-minute three-second footage shows a tall structure burning next to two flags and a building. Firefighters can be seen and a male voice can be heard reporting in Italian, saying he can see a telecommunications tower and a boat on fire.", "The Dutch-language caption claims that the video shows a 5G tower that was set on fire by Italians “out of anger” in La Spezia, a port city in northwest Italy, in April 2020.", "Also in April, the video was shared alongside similar claims in Italian, German and Polish. Some of those posts states the fire was linked to online claims that 5G has caused the novel coronavirus pandemic.", "However, the claims are misleading.", "A keyword search on Google found this April 6 statement from La Spezia fire brigade, which said it intervened in “a fire that involved a metal lattice for telecommunications and a boat located in adjacent storage”.", "This April 7 report from local newspaper Citta della Spezia dismissed claims that the blaze was related to “actions against 5G” and added that the most likely cause of the fire was a short circuit, citing authorities.", "According to nPerf, a platform that maps the locations of telecommunications transmitters, the tower that caught fire belonged to the Italian telecom operator Wind Tre. The tower is marked by a red arrow in the screenshot below:", "The tower’s exact location can be seen on Google Street View here.", "Below is a screenshot comparison of the video in the misleading post (L) and Google Street View imagery (R) with corresponding elements circled in red by AFP:", "A spokesperson for Wind Tre confirmed it operated the telecommunications tower, which carried 3G and 4G antenna.", "“The technologies installed on the antenna are UMTS (3G) and LTE (4G) and provide voice and data services,” a Wind Tre representative wrote in an email to AFP on April 14. Wind Tre also said it had not installed any 5G transmitters in La Spezia.", "OOKLA 5G Map, which maps global 5G networks, also shows 5G has not been rolled out in La Spezia as of May 13, 2020.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]