["About this rating", "In late June 2019, the junk news site Big League Politics reported a rather disturbing but baseless story that a 10-year-old migrant girl had been found with \"20 types of semen in her.\" The same story also reported unrelatedly that three people were under quarantine in El Paso, Texas, with an \"unknown disease.\"", "The two-fer rumor is rooted in the ongoing national controversy around immigration. Migration on the U.S.-Mexico border has been a topic of high public scrutiny throughout the duration of the Trump administration, both because families and unaccompanied children seeking refuge from violence in Central America have arrived at border stations in large numbers, and also because of President Donald Trump's harsh rhetoric and policies.", "Incidents of large-scale human suffering are often exploited by purveyors of hoaxes and misinformation, and this is no different.", "Big League Politics quotes a source reporting, \"There was a female, 10 years old, who was found with 20 different types of semen inside her body.\"", "We checked with U.S. Customs and Border Protection (CBP) about this claim. Roger Maier, CBP spokesman covering west Texas and New Mexico, told us the agency has no information substantiating it, and that the rumor has been circulating for at least a year.", "Citing an unnamed \"medical professional on the border in Texas\" as its only source, Big League Politics also reported that \"three individuals [are] now quarantined at a privately-owned hospital in El Paso with an unknown disease. The Centers For Disease Control and Prevention (CDC) has not even been able to identify the disease the three migrants have, as the military guards the quarantine area.\"", "We checked with both the CDC and the Texas Department of State Health Services. Neither agency corroborated the report that anyone was in quarantine in Texas.", "A similar rape rumor was circulated in December 2018 by the viral junk news site NewsPunch (formerly YourNewsWire), but in that iteration of the hoax, the girl was 6 years old and \"had been raped by at least 30 men, according to military physicians.\"", "Uncorroborated accusations related to pedophilia or child-trafficking rings are commonly circulated by conspiracy blogs and personalities in the far-fight media ecosystem. Pizzagate, the now-infamous viral hoax that took off around the 2016 presidential election, posited that one such trafficking ring was being operated by members of the Democratic party out of the basement of a Washington, D.C., pizzeria that had no basement.", "In another example of hoaxes about immigration intertwining with child-trafficking conspiracy theories, a group of men alleged in viral social media posts that they had found a bunker used for child sex trafficking in Tucson, Arizona. Tucson police, however, confirmed that the site was nothing more than an abandoned homeless encampment.", "Silverman, Craig. \"A Former Heavy Metal Musician Who Worked for Obama’s Half-Brother Is Pushing Pedophile News on Facebook.\"\r\n  BuzzFeed News. 4 March 2019.", "Ellis, Emma Grey. \"Crying 'Pedophile' Is the Oldest Propaganda Trick in the Book.\"\r\n  Wired. 1 August 2018.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]