["screenshot", "A North Carolina congressman claims the Democrats’ proposed stimulus plan has very little to do with the coronavirus.", "The \"American Rescue Plan\" calls for $1.9 trillion in spending.", "\"There’s about 9% of it actually going to COVID, meaning 91% of it is not even COVID-related,\" Republican. Rep. Ted Budd said in a speech, which he tweeted.", "Is Budd right about those percentages?", "The first part of Budd’s quote is accurate. Expert analysis shows a small percentage of the spending is directed at combating the virus through vaccines, protective equipment or resources for health care providers.", "But that doesn’t mean the rest of the bill isn’t related to COVID-19. A significant percentage of the bill aims to address the financial fallout caused by the pandemic.", "Experts we spoke with put the bill’s spending into three categories: coronavirus containment, things that are tightly or loosely related to the pandemic, and things that shouldn’t be considered related at all.", "Let’s look first at spending that directly targets COVID-containment. Depending on how COVID-containment is measured, the cost ranges between $100 billion and $160 billion.", "The Committee for a Responsible Federal Budget, a group focused on reducing federal deficits, put COVID-19 \"containment\" efforts at $110 billion, or 6% of the bill. The group put vaccine-related activities in a separate group costing about $17 billion, less than 1% of the entire bill.", "For his part, President Joe Biden said $160 billion would go towards COVID-19 testing, protective gear, vaccine production and distribution. Even if we take this higher number, that would mean the funds directed to fight COVID account for roughly 8.4% of the $1.9 trillion.", "That means the first part of Budd’s claim is nearly spot-on.", "But the second part of his claim is off-base. While a lot of the proposed spending doesn’t directly go toward combating COVID, that doesn’t mean it’s not related to the coronavirus.", "A significant portion is designed to offer economic relief to businesses and people affected by the pandemic.", "Perhaps the most famous part of the plan, direct stimulus payments to individuals, is estimated to cost more than $420 billion. The plan would also extend unemployment benefits and offer financial aid to help schools reopen.", "Erica York at the Tax Foundation and Stan Veuger at the American Enterprise Institute both described economic relief efforts as \"COVID-related.\"", "\"Whether you think they’re wise or not, they’re clearly a response to the economic crisis,\" Veuger said in a phone interview.", "The Committee for a Responsible Federal Budget reported that $246 billion would go toward extending unemployment benefits through August and raising the federal supplement payment — a move that would account for roughly 13% of the budget. The Congressional Budget Office also said the proposed unemployment benefits would cost $246 billion. The unemployment benefits, combined with a $400-a-week supplement to state unemployment insurance payments, would cost a combined $350 billion, PolitiFact reported.", "The CRFB reported that $130 billion, or 7%, would go toward helping schools reopen safely.", "We asked Budd whether he believes the extension of unemployment benefits is unrelated to the COVID-19 crisis. Spokesman Curtis Kalin didn’t directly answer the question. He said Budd wants to reopen the country. For aid, he said the federal government could use the $1 trillion that hasn’t been spent yet — a claim we’ve rated Half True.", "To be clear, the bill does include proposals that experts don’t necessarily see as pertinent.", "\"The Democratic proposal is going beyond what we’ve seen in past relief measures by significantly expanding existing tax credits and making changes to the international tax system,\" York said.", "\"For instance, lawmakers are proposing expanding the child tax credit,\" she said. \"Opponents might argue that’s wish list and isn’t a speedy form of relief, but proponents might argue it’s COVID-related because the pandemic and downturn have disproportionately affected lower-income households and so policies are being targeted toward the affected populations.\"", "In total, the CRFB estimates the House Democrats’ relief package includes \"at least $312 billion of policies that have little to do with the current crisis.\" The group cited the $110 billion to expand the Child Tax Credit and $50 billion to expand health care access through the Affordable Care Act.", "The CRFB proposed alternative plans costing $1.3 trillion and $1.1 trillion, respectively. Meanwhile, a group of Republican senators proposed a $600 billion plan.", "Budd said about 9% of Biden’s stimulus plan \"is actually going to COVID, meaning 91% of it is not even COVID-related.\"", "In the first part of his statement, Budd accurately describes the proposed spending on efforts to combat the virus itself.", "However, he’s wrong to suggest the rest of the bill isn’t related to COVID-19 at all. He may disagree with how much the bill would spend on unemployment insurance and other financial relief efforts. But the bill does aim to address the financial cost of the pandemic.", "His statement is partially accurate but leaves out important details. We rate it Half True.", "Tweet by U.S. Rep. Ted Budd (R-NC) on Feb. 24, 2021.", "Email exchange with Curtis Kalin, spokesman for U.S. Rep. Ted Budd (R-NC)", "Email exchange with Erica York, economist at the Tax Foundation.", "Phone interview with Stan Veuger, resident scholar at the American Enterprise Institute.", "U.S. House Budget Committee, American Rescue Plan Act of 2021, Feb. 19, 2021", "Congressional Budget Office, Estimated Budget Effects of the American Rescue Plan Act of 2021, Feb. 19, 2021", "Congressional Budget Office, Reconciliation Recommendations of the House Committee on Energy and Commerce, Feb. 14, 2021.", "Posts by the Committee for a Responsible Federal Budget, \"Four Key Elements of the American Rescue Plan,\" posted Feb. 24, 2021; \"Five Ways to Improve the House COVID Relief Package,\" posted Feb. 22, 2021; \"What's in the $1.9 Trillion House COVID Relief Bill?\" posted Feb. 18, 2021.", "Story by the Washington Post, \"Biden to meet with Senate Republicans offering covid relief counter-proposal,\" posted Jan. 31, 2021.", "Stories by PolitiFact, \"How much goes to COVID-19 vaccines in the stimulus bill?\" posted Feb. 26, 2021; \"Has $1 trillion in COVID-19 relief gone unspent?\" posted Feb. 23, 2021; \"What’s in Joe Biden’s $1.9 trillion American Rescue Plan?\" posted Jan. 15, 2021.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]