["Democratic presidential candidate Hillary Clinton uncorked a torrent of criticism on her opponent, Donald Trump, at a rally in Ohio’s capital city. The premise: what America’s economy would look like with Trump in charge.", "\"Over the years, he’s said all kinds of things about women in the workforce,\" Clinton said. \"He once called pregnant employees -- and I quote -- ‘an inconvenience.’ \"", "Clinton went on to say that even she was incredulous that Trump made remarks like the \"inconvenience\" statement, despite assurances from her researchers and speechwriters.", "We searched for the clip.", "Trump’s comment stems from a Dateline NBC interview of Trump from 2004. The segment, \"Blonde Ambition,\" was about Carolyn Kepcher, Trump’s Apprentice sidekick and executive vice president of Trump’s golf properties. Kepcher had just released Carolyn 101, a memoir of her business experience.", "Kepcher describes herself as a straight-shooter, but as her Dateline interviewer points out, that seems to conflict with an anecdote in the book in which Kepcher recounts waiting six months before telling Trump that she was pregnant.", "\"You were worried that he might feel inconvenienced?\" the reporter asked.", "\"Maybe, in my mind, he might think perhaps that this might be a setback,\" Kepcher answered.", "When the piece turned to Trump, he answered a question that the viewers don’t get to hear, due to editing. \"Well you know, pregnancy is never, um -- it’s a wonderful thing for the woman, it’s a wonderful thing for the husband, it’s certainly an inconvenience for a business. And whether people want to say that or not, the fact is it is an inconvenience for a person that is running a business.\"", "Because the viewers don’t hear the question Trump is responding to, and the only other person to use the word \"inconvenience\" was the Dateline reporter, it’s possible that the term may have been introduced as part of the reporter’s question.", "Studies have shown that the costs of accommodating pregnant employees is minimal. The National Women’s Law Center published a fact sheet in 2012 that pointed out that the accommodations employers already provide for disabled employees are much the same as what pregnant women require, only temporarily. And the positive gains -- better recruitment and retention of workers, boosts in productivity, reductions in absenteeism, better workplace safety -- far outweigh any costs, according to the fact sheet.", "Trump’s views on pregnancy didn’t sway Kepcher’s admiration for her former boss. \"If there’s one thing I’ve learned from Donald, it’s to make a decision, make it fast, and stick with it,\" she said.", "Trump certainly didn’t view his daughter Ivanka’s pregnancy as an inconvenience when she stood beside him, well into her third trimester, stumping in New Hampshire and South Carolina. Trump told crowds in both states that he’d love for his daughter to have her baby there.", "\"You know, she had a baby like five days ago,\" Trump said of Ivanka at a March rally in New York, about 10 days after Ivanka gave birth. \"She did a good job. So I should not say Ivanka, you're fired, right? I promise.\"", "We searched but were unable to find any additional comments made by Trump about women employees becoming pregnant.", "Our ruling", "Clinton said that Trump called pregnancy \"an inconvenience\" for business owners. Trump indeed used that word in a 2004 interview with NBC’s Dateline.", "\"The fact is it is an inconvenience for a person that is running a business,\" Trump said.", "Clinton’s claim is accurate. We rate it True.", "NBC News, \"Trump in 2004: Pregnancy is ‘an inconvenience’ for employers,\" May 26, 2016", "Vanity Fair, \"Decoding Ivanka Trump’s unusual campaign role,\" Mar. 1, 2016", "National Women’s Law Center, \"The Business Case for Accommodating Pregnant Workers,\" December 2012", "Clinton campaign email, June 21, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]