["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "• The 2020 Democratic Party platform includes a reference to “God-given potential.” It also includes numerous references to faith and religious freedom.", "• The party attracted national attention in 2012 when all references to God initially were omitted from its platform. The platform was amended one day after its introduction to include a reference to “God-given potential.”", "• The party’s platform has had fewer references to God in recent years: three in 2016 and one reference each in 2008, 2012 and 2020, compared with seven in 2004.", "The Democratic Party made headlines in 2012 when it unveiled a platform that did not include any reference to God. Party leaders quickly amended it to restore language from 2008 about helping people \"make the most of their God-given potential.\"", "The party’s 2020 platform includes the same reference to \"God-given potential,\" but critics continue to cite the 2012 omission. One Facebook post says, \"Dems have removed any mention of ‘God’ from their Platform. Why are they getting support from any Christian?\"", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "When the 2012 platform was unveiled and did not include the word God, Democrats, under pressure from President Barack Obama, quickly changed it. The Washington Post reported at the time that a press secretary for the Democratic National Committee called it a \"faux controversy,\" referred to a section of the platform about faith and pointed out there were multiple uses of the words faith, religion, religious, church and clergy.", "The 2020 platform similarly includes references to faith and religion, including a section titled \"Supporting Faith and Service,\" that reads, \"Religious freedom is a core American value and a core value of the Democratic Party. Democrats will protect the rights of each American for the free exercise of his or her own religion. It will be the policy of the Democratic Administration to advocate for religious freedom throughout the world.\"", "It also says, \"Democrats remain committed to ending poverty and enabling all Americans to live up to their God-given potential.\"", "We reached out to the Democratic National Committee for comment but did not receive a reply.", "Over time, the Democratic Party has reduced its use of the word God in its platform. In 2004, the platform included the phrase \"one nation under God,\" and also referred to \"God’s children,\" \"eyes of God\" and \"God’s gifts.\" In 2008, 2012, 2016 and 2020, the only references to God in the platform were to \"God-given potential.\" A search of the Republican Party platform turns up 16 mentions of the word \"God.\"", "A Facebook post says that \"Dems have removed any mention of ‘God’ from their Platform.\" That’s not true, as the party’s 2020 platform includes a reference to \"God-given potential.\" It also makes numerous references to faith, including a section that outlines its intent to protect religious freedom and uphold \"separation of church and state enshrined in our Constitution.\"", "The Democratic Party in 2012 introduced a platform that did not mention God, only to quickly re-insert the reference. The party’s platforms in recent years have had fewer mentions of the word God than in the past.", "But the assertion that the Democratic Party platform doesn’t include a reference to God is wrong. We rate it False.", "2020 Democratic Party Platform, accessed Nov. 1, 2020", "2016 Democratic Party Platform, accessed Nov. 1, 2020", "2012 Democratic Party Platform, accessed Nov. 1, 2020", "2008 Democratic Party Platform, accessed Nov. 1, 2020", "2004 Democratic Party Platform, accessed Nov. 1, 2020", "ABCNews, \"Dems quickly switch to include ‘God,’ ‘Jerusalem,’\" Sept 6, 2012", "Ballotpedia, The Democratic Party Platform 2012, accessed Nov. 1, 2020", "Facebook post, Oct. 16, 2020", "Washington Post, \"Democrats under fire for removing ‘God’ from party platform,\" Sept. 5, 2012", "2016/2020 Republican Party Platform, accessed Nov. 2, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]