["About this rating", "On June 12, 2020, Madhouse Magazine published an article positing that officials in West Virginia had announced the removal of a statue depicting comedian and actor Don Knotts:", "WV to Remove Don Knotts Barney Fife Statue Following Complaints", "West Virginia will remove a statue of actor and comedian Don Knotts that is located in his hometown of Morgantown, WV.", "[...]", "It was his role as Barney Fife, however, that caused many protestors to demand the statues removal. “Barney Fife, was a nervous, twitchy little man with an itchy trigger finger” said protestor Joanne Miller.", "This item was not a factual recounting of real-life events. The article originated with a website that describes its output as being humorous or satirical in nature, as follows:", "Disclaimer – Satire is awesome. And it is protected by the First Amendment. We here at Madhouse Magazine believe in Embellishments, Exaggerations and complete Fabrications. It’s all in good fun and no harm was meant. All rights reserved and all content copyright Madhouse Magazine 2020. Names, characters, business, events and incidents are the products of the author’s imagination. Any resemblance to actual persons, living or dead, or actual events is purely coincidental !!!!", "This piece of satire was published amidst social unrest in the United States in 2020 as protesters and politicians decried police brutality and also called for the removal of Confederate statues. Although the rumor that the Knotts statue was being removed originated with a satire website, this claim was shared on social media with no mention of its satirical origins, leading some to mistakenly believe that West Virginia was attempting to erase its TV history.", "For background, here is why we sometimes write about satire/humor.", "Madhouse Magazine.   \"WV to Remove Don Knotts Barney Fife Statue Following Complaints.\"\r\n    12 June 2020.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]