["By Lori Robertson", "Posted on June 20, 2018", "In defending its “zero tolerance” border policy that has caused the separation of families, the Trump administration has argued that the Obama and Bush administrations did this too. That’s misleading. Experts say there were some separations under previous administrations, but no blanket policy to prosecute parents and, therefore, separate them from their children.", "“Bush and Obama did not have policies that resulted in the mass separation of parents and children like we’re seeing under the current administration,” Sarah Pierce, a policy analyst with the Migration Policy Institute, told us.", "Department of Homeland Security Secretary Kirstjen Nielsen said at a June 18 press briefing: “The Obama administration, the Bush administration all separated families. … They did — their rate was less than ours, but they absolutely did do this. This is not new.”", "Nielsen went on to explain that there is indeed something new, as we wrote in another article on this topic. Under a “zero tolerance policy” on illegal immigration announced by Attorney General Jeff Sessions in early April, the administration is now referring all illegal border crossings for criminal prosecution. By doing that, parents have been separated from their children, because children can’t be held in detention facilities for adults.", "DHS told us that 2,342 children were separated from their parents between May 5 and June 9.", "But DHS couldn’t provide any statistics on how many children may have been separated from their parents under the Obama administration.", "Instead, when we asked, it pointed to numbers that show 21 percent of apprehended adults were referred for prosecution under President Barack Obama. From fiscal year 2010 to fiscal 2016, there were 2,362,966 adults apprehended illegally crossing the Southern border, and 492,970 were referred for prosecution, those figures show. But that doesn’t tell us anything about how many children may have been separated from their parents under Obama.", "And we don’t have such statistics to compare the past to the present.", "“We have not seen any data out of the current or prior administration on how many cases that were prosecuted were individuals who arrived with minors,” Theresa Cardinal Brown, director of immigration and cross-border policy at the Bipartisan Policy Center, told us in an email. “So we cannot make any guesses or assumptions about how many separations based on prosecution there were or are.”", "Brown said that even though DHS says 2,342 children have been separated from their parents in about one month, we don’t know what percentage of those cases are due to prosecutions for illegal crossings, and how many are due to other policies that would require separations — such as suspicion of trafficking, another outstanding warrant or insufficient proof of a family relationship.", "We asked DHS if it would provide such a breakdown, but we haven’t received a response.", "MPI’s Pierce said that the likely reason data aren’t available on child separations under previous administrations is because it was done in “really limited circumstances” such as suspicion of trafficking or other fraud.", "“Previous administrations used family detention facilities, allowing the whole family to stay together while awaiting their deportation case in immigration court, or alternatives to detention, which required families to be tracked but released from custody to await their court date,” Brown and her co-author, Tim O’Shea, wrote in an explainer piece for the Bipartisan Policy Center’s website. “Some children may have been separated from the adults they entered with, in cases where the family relationship could not be established, child trafficking was suspected, or there were not sufficient family detention facilities available. … However, the zero-tolerance policy is the first time that a policy resulting in separation is being applied across the board.”", "Jeh Johnson, DHS secretary under the Obama administration, told NPR earlier this month that he couldn’t say that family separations “never happened” during his tenure. “There may have been some exigent situation, some emergency. There may have been some doubt about whether the adult accompanying the child was in fact the parent of the child. I can’t say it never happened but not as a matter of policy or practice. It’s not something that I could ask our Border Patrol or our immigration enforcement personnel to do,” Johnson said.", "The Obama administration faced a surge of unaccompanied children from Central America trying to cross the border in 2014. Cecilia Muñoz, director of the Obama administration’s Domestic Policy Council, told the New York Times this month that a multi-agency team was considering “every possible idea” at the time, including separating families. “I do remember looking at each other like, ‘We’re not going to do this, are we?’ We spent five minutes thinking it through and concluded that it was a bad idea,” the Times quoted Muñoz saying. “The morality of it was clear — that’s not who we are.”", "Brown told us that while the Obama administration “did separate some families,” it also tried to detain families together. In 2016, a court ruling limited how long children with their parents could be in family detention centers. That ruling confirmed that a 1997 settlement applied to both unaccompanied and accompanied minors, as we’ve explained before.", "“At that point,” Brown said, “family detention dwindled and most families were released into the US, either on their own with a notice to appear or under Alternatives to Detention, which could be an ankle bracelet or a supervised monitoring provision where they had to check in with ICE regularly until their immigration court hearing.”", "On June 20, President Donald Trump signed an executive order directing Nielsen to keep families in custody together “during the pendency of any criminal improper entry or immigration proceedings involving their members” at least “to the extent permitted by law and subject to the availability of appropriations.”", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]