["The appearance by President Barack Obama on comedian Zach Galifianakis’ faux-interview show Between Two Ferns set social media ablaze.", "Galifianakis’ deadpan spoof of a cable-access TV interview show had already become a magnet for Web surfers, and especially for younger Americans -- the demographic that Obama has been trying to convince to purchase insurance at the healthcare.gov website.", "Just hours after the presidential \"interview\" went live on FunnyorDie.com, the humor site became \"the #1 source of referrals to HealthCare.gov ,\" according to a triumphal tweet by White House health care spokeswoman Tara McGuinness on March 11, 2014.", "Like many Americans, we watched the video and thought it was pretty funny. Most of the exchanges between Obama and Galifianakis were clearly intended to be jokes -- nothing checkable there.", "But we did find one snippet to put to the Truth-O-Meter -- when Obama said that \"most young Americans\" are not covered by health insurance. It came during the meat of Obama’s pitch for young Americans to get covered, and it struck us as wrong.", "Here’s the exchange:", "Galifianakis: \"So do you go to any websites that are .com’s or .net’s, or do you mainly just stick with .gov’s?\"", "Obama: \"No, actually we go to .gov’s. Have you heard of healthcare.gov?\"", "Galifianakis: \"Here we go. (Sigh) Okay, let’s get this out of the way. What did you come here to plug?\"", "Obama: \"Well, first of all I think it’s fair to say that I wouldn’t be with you here today if I didn’t have something to plug. Have you heard of the Affordable Care Act?\"", "Galifianakis: \"Oh yeah, I heard about that, that’s the thing that doesn’t work. Why would you get the guy that created the Zune to make your website?\"", "Obama: \"Healthcare.gov works great now, and millions of Americans have already gotten health insurance plans. And what we want is for people to know that you can get affordable health care. And most young Americans right now, they’re not covered. And the truth is that they can get coverage all for what it costs to pay your cell phone bill.\"", "Galifianakis: \"Is this what they mean by ‘drones’?\"", "For answers, we turned to data from the U.S. Census Bureau. We found an age breakdown for Americans who were not covered by health insurance at any time in 2012. (That’s the standard yardstick for determining whether someone is \"uninsured.\"):", "Age range", "Percentage in age group not covered at any time in 2012", "18 to 24 years of age", "25.3 percent", "25 to 34 years of age", "27.4 percent", "All ages", "15.4 percent", "So the description Obama offered on Between Two Ferns was way off -- the actual rate of uninsurance among both groups that could be considered \"young\" (but who aren’t children) is only a quarter, not \"most.\"", "These percentages are very similar to those found in the most recently released Gallup poll -- 23 percent of 18- to 25-year-olds are uninsured, and a little less than 27 percent of those are age 26 to 34. (The White House did not offer any additional data when we asked.)", "What Obama said is \"absolutely inaccurate,\" said Gail Wilensky, who headed Medicare and Medicaid under President George H.W. Bush. Wilensky said young people are statistically more likely to be uninsured than either children or middle-aged Americans are -- something we explored in this fact check -- but she added that most are, in fact, insured.", "Our ruling", "Obama said, \"Most young Americans right now, they’re not covered\" by health insurance. That’s wrong -- only about a quarter of Americans between 18 and 24 and between 25 and 34 are considered uninsured. We rate his claim False.", "Barack Obama, interview with Zach Galifianakis on Funnyordie.com’s Between Two Ferns, March 11, 2014", "U.S. Census Bureau, \"Table HI01. Health Insurance Coverage Status and Type of Coverage by Selected Characteristics -- All Races,\" 2012", "Washington Post, \"Zach Galifianakis is now HealthCare.gov’s biggest traffic driver,\" March 11, 2014", "Gallup, \"U.S. Uninsured Rate Continues to Fall,\" March 10, 2014", "PolitiFact, \"Rand Paul says young people are a major part of the uninsured population,\" Aug. 16, 2013", "Email interview with Gail Wilensky, head of Medicare and Medicaid under President George H.W. Bush, March 11, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]