["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A group holds rifles as they watch protesters on the street on Aug. 25, 2020, in Kenosha, Wis. (AP)", "EDITOR'S NOTE, Nov. 16, 2021: Judge Bruce Schroeder recently dismissed a misdemeanor charge of possession of a dangerous weapon by a person under 18 against Kyle Rittenhouse.", "Readers asked us if this made the fact-check below invalid. We don’t think so. Here’s why.", "In August 2020, we fact-checked a claim that it was \"perfectly legal\" for Rittenhouse to possess an AR-15 without parental supervision. Our reporting found that it was far from perfectly legal, and that it was, in fact, legally murky. That’s why we rated the claim False.", "Wisconsin law says that \"any person under 18 years of age who possesses or goes armed with a dangerous weapon is guilty of a Class A misdemeanor.\"", "In our fact-check, we cite the possibility of an exception for rifles and shotguns. The exception is aimed at letting children ages 16 and 17 hunt. But, as it is also clear, Rittenhouse wasn’t in Kenosha to hunt.", "This same legal debate played out a couple of times during the Rittenhouse trial, according to the Associated Press.", "Rittenhouse’s defense asked Schroeder to dismiss the firearm possession charge during a pretrial hearing in October. Schroeder, according to the Associated Press, acknowledged the intent of the statute was murky but decided not to dismiss the charge.", "The issue came up again on Nov. 15 as lawyers were debating instructions to the jury.", "Prosecutors argued that allowing an exception for hunting-style weapons would effectively eliminate the prohibition on minors carrying weapons.", "But in this instance, Schroeder dismissed the charge, saying he had a \"big problem\" with the state statute.", "In its reporting, the Associated Press quoted Kenosha defense attorney Michael Cicchini, who is not involved in the case. Cicchini said when statutes aren't clear, they must be read in favor of the defense. \"This is the price the government must pay when it is incapable of drafting clear laws,\" Cicchini wrote in an article.", "The ruling does appear at odds with the intent of legislators. In 2018, the Wisconsin Legislative Council Staff, a nonpartisan legislative service agency akin to the Congressional Research Service, wrote that, \"Under Wisconsin law, with certain exceptions for hunting, military service, and target practice, a person under age 18 is generally prohibited from possessing or going armed with a firearm.\"", "These subsequent events show the grey areas of local gun laws — hardly a case of something being \"perfectly legal.\" Our fact-check remains unchanged.", "• • •", "The 17-year-old accused of shooting three people during a protest in Kenosha, Wis., faces several charges, including first-degree intentional homicide. But some widely shared Facebook posts say he should be cleared of at least some of them.", "In an Aug. 27 post, one Facebook user said it was \"perfectly legal\" for Kyle Rittenhouse — who was arrested in Antioch, Ill., after fleeing Wisconsin — to brandish an assault-style rifle on the streets of Kenosha.", "\"Carrying a rifle across state lines is perfectly legal,\" the poster said. \"Based on the laws I can find of this area at 17 years old Kyle was perfectly legal to be able to possess that rifle without parental supervision.\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "On Aug. 25, two protesters were killed and one injured after police say someone opened fire on them. The violence occurred on the third night of protests over the shooting of Jacob Blake, a Black man, by a white police officer in Kenosha. Blake survived, but he is partially paralyzed from a bullet that severed his spinal cord.", "Rittenhouse stands accused of shooting the protesters. Since his lawyer has said that Rittenhouse obtained the assault-style rifle from a friend in Wisconsin (meaning that he didn’t transport it with him from Illinois), we’re going to focus on the second half of the claim — that it was \"perfectly legal\" for the teenager to carry a firearm in Kenosha.", "Is that true? State laws suggest not.", "The Wisconsin Department of Justice honors concealed carry permits issued in Illinois. But Rittenhouse did not have a permit to begin with, and he was not legally old enough to carry a firearm in Wisconsin.", "In Illinois, concealed carry applicants must be at least 21 years old. Since Rittenhouse is 17, he would not qualify for a permit. In Wisconsin, it is legal for adults to carry firearms in public without a license if the gun is visible. However, to open carry, you must be at least 18 years old.", "Wisconsin law stipulates that \"any person under 18 years of age who possesses or goes armed with a dangerous weapon is guilty of a Class A misdemeanor.\" On Aug. 27, prosecutors charged Rittenhouse with a misdemeanor count of possession of a dangerous weapon under the age of 18, according to court records.", "John Monroe, an attorney who specializes in gun rights, told the Milwaukee Journal Sentinel that there’s an exception for rifles and shotguns, which is aimed at letting children ages 16 and 17 hunt, that could apply. But Rittenhouse wasn’t in Kenosha to hunt.", "The newspaper reported that — based on interviews, videos and social media posts — Rittenhouse considered himself to be a militia member protecting private property. His Facebook page, which has since been taken down, had several posts expressing support for police.", "RELATED: What we know about Jacob Blake's shooting in Kenosha, Wis.", "\"People are getting injured and our job is to protect this business,\" Rittenhouse told the Daily Caller in a video interview before the shooting. \"And my job also is to protect people. If someone is hurt, I’m running into harm’s way. That’s why I have my rifle; I’ve gotta protect myself, obviously. But I also have my med kit.\"", "We reached out to the person who published the Facebook post for a comment, but we haven’t heard back.", "Whether Rittenhouse violated Wisconsin law by possessing a firearm underage is the subject of ongoing litigation. But the Facebook post claimed that it was \"perfectly legal\" for the teenager to carry an assault-style rifle in Kenosha.", "At best, that’s unproven. At worst, it’s inaccurate. Either way, we rate the post False.", "UPDATE, Sept. 3, 2020: This fact-check has been updated to include mention that Wisconsin law permits people 18 years and older to carry firearms in public without a license if the gun is visible. The ruling is unchanged.", "CNN, \"Kenosha shooting suspect faces more homicide charges,\" Aug. 27, 2020", "Facebook post, Aug. 27, 2020", "Milwaukee Journal Sentinel, \"Kyle Rittenhouse, charged in Kenosha protest homicides, considered himself militia,\" Aug. 26, 2020", "Milwaukee Journal Sentinel, \"What to know about Wisconsin's open-carry laws, self defense and more in Kenosha protest shootings,\" Aug. 26, 2020", "Tweet from L. Lin Wood, Aug. 28, 2020", "Tweeted video, Aug. 26, 2020", "U.S. Department of Justice, Federal Firearms Laws, accessed Aug. 28, 2020", "Wisconsin Circuit Court Access, accessed Aug. 28, 2020", "Wisconsin Department of Justice, Reciprocity: Out-of-state Licenses Recognized in Wisconsin, accessed Aug. 28, 2020", "29.304 - Wisconsin Legislature", "430 ILCS 66/ Firearm Concealed Carry Act", "948.60 - Wisconsin Legislature", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]