["About this rating", "Neonicotinoids are a class of insecticides commonly used in agriculture and increasingly associated with declines in bee populations, and bee viability is an important concern given the utility they have to ecosystems as pollinators. Low levels of neonicotinoid chemicals, also known as neonics, have been found in honey samples all over the world, and some research suggests a potential causal link between that chemical and declines in the viability of bee colonies.", "In April 2018, the European Union (EU) announced a ban on three neonicotinoid insecticides over concerns about their effects on bees, but neonicotinoid use remains legal for most agricultural applications in most states of the U.S. Legislation to ban neonicotinoid application in nationally protected wildlife refuges was passed under President Barack Obama but was repealed by the Trump Administration in August 2018.", "Though studies do link these chemicals to bee declines, debate continues over suitable insecticide replacements for them, and over the harm of their use when applied in ways intended to protect bee populations (especially when compared to potential replacement chemicals).", "Back in 2013, several groups -- notably Friends of the Earth -- launched a concerted effort to highlight that “bee-friendly” plants sold at big box retailers such as the Home Depot home improvement chain had been treated with neonicotinoids. In response to those concerns, Home Depot first pledged to label any plants grown with the aid neonicotinoids, and later enacted a gradual phase-out of products treated with these chemicals which was meant to conclude by the end of 2018.", "Counterintuitively, Home Depot’s decision to be transparent about this process and label products treated with neonicotinoids led to a public backlash when images of warning tags appeared in viral posts in 2015, even though many other companies also sell neonicotinoid-treated flowers without disclosure. Such posts, which include a picture of the Home Depot warning tag, continue to be shared at the time of this report without acknowledgment of the actions Home Depot has taken:", "In response to our question about Home Depot’s current neonicotinoid use, public relations spokesperson Christina Cornell told us that 98 percent of their plant products are neonicotinoid-free, and the only ones that remain so treated are the result of state-level regulations requiring neonic pesticide application and are labeled as such:", "Through partnerships with our suppliers, we’ve made tremendous progress on removing neonics from our plants and they are now 98 percent free of neonicotinoids. However, there are states that require some plants be treated with neonics. The Home Depot is one of the few retailers that labels plants that are treated with neonics so customers can choose for themselves.", "We rank the assertions made of Home Depot’s neonicotinoid use outdated because the pictures arose in response to concerns raised years ago, Home Depot has since almost entirely phased out the sale of plants treated with these insecticides, and products that may still be so treated are clearly labeled -- a process that is not necessarily followed by other companies.", "Mitchell, E.A.D. et al.   “A Worldwide Survey of Neonicotinoids in Honey.”\r\n    Science.   6 October 2017.", "Cresswell, James E.   “A Meta-Analysis of Experiments Testing the Effects of a Neonicotinoid Insecticide (Imidacloprid) on Honey Bees.”\r\n    Ecotoxicology.   16 November 2011.", "Carrington, Damian.   “EU Agrees Total Ban on Bee-harming Pesticides.”\r\n    The Guardian.   27 April 2018.", "Reuters.   “Trump Administration Lifts Ban on Pesticides Linked to Declining Bee Numbers.\"\r\n    3 August 2018.", "Entine, Jon.   “Global Consensus Finds Neonicotinoids Not Driving Honeybee Health Problems -- Why Is Europe So Determined to Ban Them?”\r\n    Genetic Literacy Project.   26 April 2018.", "Friends of the Earth.   “Gardeners Beware: Bee-Toxic Pesticides Found in ‘Bee-Friendly’ Plants Sold at Garden Centers Nationwide.”\r\n    August 2013.", "Greenhouse Magazine.   “Home Depot to Phase Out Neonics by 2018.”\r\n    3 December 2015.", "Home Depot.   “How Home Depot’s Addressing 'Neonic' Concerns.”\r\n    4 May 2016.", "Pollinator Network @ Cornell.   “Neonicotinoids.”\r\n    Accessed 26 March 2019.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]