["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Wisconsin Gov. Scott Walker is touting his tax cuts as he runs for a third term in the 2018 election. (C.T. Kruger/NOW Newspapers)", "In May 2017, Gov. Scott Walker made a claim about tax cuts since he took office in 2011.", "He said the cuts that had been approved, and those that were proposed in his 2017-’19 state budget, would \"exceed $8 billion by the time the budget is done.\"", "We rated the statement True.", "Now the budget is done and Walker is making the claim without qualifications. For example, he declared on May 31, 2018, on Twitter:", "\"Since taking office, we have enacted more than $8 billion in cumulative tax relief.\"", "Campaigning for a third term in the November 2018 election, it’s a statement Walker will repeat.", "Let’s see if it’s right.", "More governor’s race fact checks:", "How Walker and the Democratic candidates for governor stack up on the Truth-O-Meter.", "The numbers", "The governor’s office provided us tallies from the State Budget Office. They show that through June 2019, when the current 2017-’19 state budget ends, the tax cuts will exceed $8.85 billion.", "We also went to a nonpartisan source, the state Legislative Fiscal Bureau, which did calculations in May 2018 and arrived at a slightly lower figure.", "The fiscal bureau told us it estimated the reduction in general fund tax revenues and property tax revenues, as a result of tax law changes enacted since 2011, at $8.47 billion:", "Income and franchise tax reductions", "$4.82 billion", "Property tax reductions", "$3.56 billion", "Other tax cuts", "$90 million", "Total tax reductions 2011 through mid-2019", "$8.47 billion", "Democrats' reaction", "We asked the state Democratic Party about Walker’s claim. The party did not challenge the $8 billion tally, but criticized a number of Walker’s policies.", "Like us on Facebook. Follow us on Twitter: @PolitiFactWisc", "Among them:", "The manufacturing and agricultural tax credit gave an estimated $22 million in credits to 11 individuals who had an adjusted gross income of $30 million or more in 2017, according to the state fiscal bureau.", "Our rating", "Walker says: \"Since taking office, we have enacted more than $8 billion in cumulative tax relief.\"", "The state’s official nonpartisan budget scorekeeper puts the figure -- since Walker took office in 2011 and through the current budget that runs through mid-2019 -- at $8.47 billion.", "We rate Walker’s statement True.", "Twitter, Scott Walker tweet, May 31, 2018", "Email, Gov. Scott Walker spokeswoman Amy Hasenberg, June 13, 2018", "Interview, Wisconsin Legislative Fiscal Bureau program supervisor Sean Moran, June 14, 2018", "Email, Wisconsin Democratic Party spokesman TJ Helmstetter, June 14, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]