["In this 2015 event, then-candidate Donald Trump said \"I don't like losers” about then-Sen. John McCain, R-Ariz.", "Trump called McCain a loser at a televised event in Ames, Iowa, on July 18, 2015.", "After that 2015 event, Trump tweeted out a web post touting the “loser” exchange that was headlined “Donald Trump: John McCain Is ‘A Loser.’”", "An article in the Atlantic about President Donald Trump’s private remarks about service members and veterans took social media by storm the moment it was published on Sept. 3. Trump aggressively pushed back, rejecting the article’s conclusion that he had, on multiple occasions, disparaged those serving in the military, particularly service members who had been wounded or killed.", "One of the claims in the article, which is based on anonymous sources, was about Trump’s private remarks about the late Sen. John McCain, R-Ariz. Trump and the 2008 Republican presidential nominee often tangled, including over McCain’s pivotal vote against a bill that would have overturned much of the Affordable Care Act.", "The article by Atlantic editor Jeffrey Goldberg reads:", "\"Trump remained fixated on McCain, one of the few prominent Republicans to continue criticizing him after he won the nomination. When McCain died, in August 2018, Trump told his senior staff, according to three sources with direct knowledge of this event, ‘We’re not going to support that loser’s funeral,’ and he became furious, according to witnesses, when he saw flags lowered to half-staff. ‘What the f--- are we doing that for? Guy was a f---ing loser,’ the president told aides.\"", "After the article was published, Trump took to Twitter to reject its reporting, including what he said about McCain.", "Over three linked tweets, Trump wrote,", "\"I was never a big fan of John McCain, disagreed with him on many things including ridiculous endless wars and the lack of success he had in dealing with the VA and our great Vets, but the lowering of our Nations American Flags, and the first class funeral he was given by our Country, had to be approved by me, as President, & I did so without hesitation or complaint. Quite the contrary, I felt it was well deserved. I even sent Air Force One to bring his body, in casket, from Arizona to Washington. It was my honor to do so. Also, I never called John a loser and swear on whatever, or whoever, I was asked to swear on, that I never called our great fallen soldiers anything other than HEROES. This is more made up Fake News given by disgusting & jealous failures in a disgraceful attempt to influence the 2020 Election!\"", "....John a loser and swear on whatever, or whoever, I was asked to swear on, that I never called our great fallen soldiers anything other than HEROES. This is more made up Fake News given by disgusting & jealous failures in a disgraceful attempt to influence the 2020 Election!", "Here, we’ll focus on Trump’s assertion that he \"never called (McCain) a loser.\"", "The reality is that Trump did say that about McCain in a widely noted public event in 2015.", "The event in question was a family leadership summit in Ames, Iowa, on July 18, 2015. Here’s the full video, with the remarks in question coming at about the 5:10 mark.", "After Trump recalled McCain saying something that Trump considered an insult to him and his supporters, \"I said, 'Somebody should run against McCain,' who has been, in my opinion, not so hot. And I supported him for president! I raised a million dollars for him. That's a lot of money! I supported him. He lost. He let us down. But he lost. So I never liked him much after that, because I don't like losers.\"", "Amid audience laughter, the moderator, Republican pollster Frank Luntz, then interjected, \"But he's a war hero!\"", "Trump responded, \"He’s not a war hero. He’s a war hero because he was captured. I like people that weren’t captured.\"", "Later that day, Trump retweeted, with seeming approval, a web post headlined \"Donald Trump: John McCain Is ‘A Loser,’\" that recapped his exchange at the summit.", "Via @fitsnews: “Donald Trump: John McCain Is ‘A Loser’” http://t.co/sgiETvdUqi", "Neither the White House nor Trump’s campaign responded to an inquiry for this article.", "Trump tweeted, \"I never called John (McCain) a loser.\"", "That’s false. He called McCain a loser at a televised event in 2015 and then, later that day, tweeted out a web post recapping the event.", "We rate the statement Pants on Fire!", "Donald Trump, three linked tweets, Sep. 3, 2020", "The Atlantic, \"Trump: Americans Who Died in War Are ‘Losers’ and ‘Suckers,’\" Sept. 3, 2020", "YouTube, Family Leadership Summit in Ames, Iowa, July 18, 2020", "Donald Trump, tweet, July 18, 2020", "New York Times, \"Donald Trump Says John McCain Is No War Hero, Setting Off Another Storm,\" July 18, 2020", "Politico, \"Trump attacks McCain: 'I like people who weren't captured,'\" July 18, 2015", "Snopes.com, \"Did Trump Call McCain a Loser?\" Sept. 4, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]