["The photo was published here on Facebook September 13, 2020. It has been shared more than 1,800 times.", "The post’s caption states: \"YELLOWS are SHAMED on the Manila Bay white sand issue. So obvious they're only out to ruin the Duterte government. In Aid of Elections 2022. But we keep on saying, Liberal Party Go Straight Again to the Toilet.\"", "Further text overlaid on the photo states: \"Update Manila Bay: World Class After Rehabilitation\".", "Manila Bay is a harbour in the Philippine capital of Manila.", "“Yellow” is a pejorative term for the opposition Liberal Party in the Philippines.", "The post circulated online on the same day the Philippine government defended itself against criticism for building an artificial beach along a portion of Manila Bay.", "The same photo also circulated on Facebook here and here alongside a similar claim. The image can also be seen in a frame in this YouTube post alongside a similar claim.", "The claim, however, is false.", "A reverse image and keyword searches on Google found the image in this 52-second video posted on YouTube on February 20, 2019.", "The video is captioned: \"Manila Bay [How it should be]... This sea side is at Nice, South of France.\"", "In the video, a person can be heard saying in Tagalog: “This is the new Manila Bay… That’s just a joke. This isn’t Manila Bay. But it would be great if it were this clean!”", "Below is a screenshot comparison of the photo in the misleading posts (L) and the six-second mark of the 2019 YouTube video (R):", "The photo in the misleading posts corresponds with this Google Street View of the Promenade des Anglais in the French city of Nice.", "The misleading claim was also debunked by Philippine news organisation Vera Files here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]