["By Eugene Kiely, Lori Robertson, Robert Farley and D'Angelo Gore", "Posted on December 5, 2019", "As the House Judiciary Committee began public hearings on whether to draft and approve articles of impeachment, Republicans presented a set of facts that they claimed cleared President Donald Trump of any wrongdoing.", "The Republican National Committee on Dec. 4 selectively highlighted several facts from the investigation, providing an incomplete picture on what the congressional testimony has revealed.", "The same day, Rep. Jim Jordan repeated some of those talking points in the House Judiciary Committee’s hearing. “The facts are on the president’s side,” Jordan declared.", "Here we review the Republican statements in the context of documents and testimony that House investigators have gathered since House Speaker Nancy Pelosi announced the impeachment inquiry on Sept. 24.", "RNC: “As the transcript of the [July 25] call between President Trump and Ukrainian President [Volodymyr] Zelensky, as well as the testimony before the House Intel committee have both revealed, there was no quid pro quo.”", "Jordan: “We have the transcript. There was no quid pro quo in the transcript.”", "This is a familiar Republican talking point, repeated by the president and printed on T-shirts of his supporters: “Read the Transcript.”", "The fact is, Trump asked Zelensky for “a favor” in the July 25 phone call that could have benefited the president’s reelection in 2020, and witnesses testified that there was an elaborate effort by some within the administration to carry out what Fiona Hill, a former National Security Council aide, called Trump’s “domestic political errand.”", "Trump, according to the White House memo on the call, asked Zelensky to look into CrowdStrike, the cybersecurity firm hired by the Democratic National Committee after its computer network was hacked by Russian intelligence officers during the 2016 election. (Trump repeatedly has advanced the debunked conspiracy theory that CrowdStrike hacked the DNC and blamed the Russians.)", "Trump also asked Zelensky in the phone call to investigate former Vice President Joe Biden and his son, Hunter. As we’ve written, Trump has distorted the facts when he has claimed that Joe Biden, as vice president, threatened to withhold “billions of dollars to Ukraine” unless it removed the prosecutor general who “was prosecuting” Biden’s son, Hunter, and Burisma, the Ukrainian gas company on whose board Hunter Biden had served. There’s no evidence Hunter Biden was ever being investigated or prosecuted.", "In addition, since the release of the transcript, the House impeachment probe has uncovered evidence that the White House sought Ukraine’s public announcement of the investigations in exchange for three things: a phone call between Zelensky and Trump, a White House visit for Zelensky, and the release of nearly $400 million in security aid to Ukraine.", "Gordon Sondland, the U.S. ambassador to the European Union, testified that there was a quid pro quo, at least on two of the three things that Ukraine was seeking.", "“I know that members of this committee frequently frame these complicated issues in the form of a simple question: Was there a quid pro quo? As I testified previously with regard to the requested White House call and the White House meeting, the answer is yes,” Sondland testified on Nov. 20.", "As for security aid, Sondland said he presumed that a promise of investigations “might have to be done in order to get the aid released.”", "Sondland’s conclusions were supported by testimony from other witnesses, as well as text messages, emails and WhatsApp messages that were provided to the committee.", "On July 19, Sondland sent an email to several top Trump administration officials, including Secretary of State Mike Pompeo and acting White House Chief of Staff Mick Mulvaney that said: “I Talked to Zelensky just now… He is prepared to receive Potus’ call. Will assure him that he intends to run a fully transparent investigation and will ‘turn over every stone’. He would greatly appreciate a call prior to Sunday so that he can put out some media about a ‘friendly and productive call’ (no details) prior to Ukraine election on Sunday.” Sondland released this email at a public hearing on Nov. 20, and he testified that he was referring to the investigations of the 2016 elections and Burisma.", "Also on July 19, Sondland sent a WhatsApp message to Kurt Volker, Trump’s special envoy to Ukraine, and William Taylor, the charge d’affaires at the U.S. Embassy in Ukraine, that said a phone call between Trump and Zelensky would soon take place. Volker’s message said what is “[m]ost impt is for Zelensky to say that he will help investigation — and address any specific personnel issues — if there are any,” according to Sondland’s Nov. 20 testimony. Taylor also discussed the messages in the opening statement at his closed-door Oct. 22 deposition.", "A week earlier, on July 12, Robert Blair, an assistant to the president and senior adviser to Mulvaney, sent an email to Michael Duffey, the associate director of the Resource Management Organization at the Office of Management and Budget, that said the president is directing a hold on security aid for Ukraine. Mark Sandy, the deputy associate director for national security at OMB, testified at his Nov. 16 deposition that Duffey forwarded him a copy of the email.", "Sandy testified that he signed a document that officially placed the first hold on the security aid to Ukraine on July 25 — the same day as the phone call between the two leaders.", "Sondland and Taylor both testified that they came to believe that the security aid, too, was linked to the investigations.", "Taylor testified that on Sept. 7 National Security Council aide Tim Morrison told him about a phone call earlier that day between Sondland and Trump. “According to Mr. Morrison, President Trump told Ambassador Sondland that he was not asking for a ‘quid pro quo.’ But President Trump did insist that President Zelenskyy go to a microphone and say he is opening investigations of Biden and 2016 election interference, and that President Zelenskyy should want to do this himself,” Taylor told Congress.", "RNC: “Zelensky has said multiple times that there was no quid pro quo, ‘no blackmail,’ and that no one ‘pushed’ him.”", "Jordan: “The two guys on the [July 25] call, President Trump and President Zelensky, both said no pressure, no pushing, no quid pro quo.”", "It is true that Zelensky told reporters on Oct. 10 that there was “no blackmail” on the phone call and that no one “pushed” or pressured him on that call, as he told reporters during a joint appearance with Trump at the United Nations on Sept. 25. Zelensky said he only learned about the blocked aid after the phone call.", "More recently, Zelensky said he “never talked to the president from the position of a quid pro quo,” but he also took issue with Trump’s hold on military aid to his country.", "“We’re at war,” Zelensky said in an interview published Dec. 2. “If you’re our strategic partner, then you can’t go blocking anything for us. I think that’s just about fairness. It’s not about a quid pro quo. It just goes without saying.”", "But the RNC’s focus on Zelensky’s response to the July 25 phone call and Jordan’s description of there being “two guys on the call” ignore others who were listening in on that conversation and were concerned by Trump’s request that Zelensky undertake investigations into the Bidens and the Democrats.", "Lt. Col. Alexander S. Vindman, a Ukraine expert on the White House’s National Security Council who listened in on Trump’s July 25 call with Zelensky, told House investigators that the call was “troubling and disturbing” and reported his concerns to the NSC’s legal counsel.", "“I was concerned by the call,” Vindman said in his Oct. 29 deposition. “I did not think it was proper to demand that a foreign government investigate a U.S. citizen, and I was worried about the implications to the U.S. government’s support of Ukraine. … I realized that if Ukraine pursued an investigation into the Bidens and Burisma, it would likely be interpreted as a partisan play which would undoubtedly result in Ukraine losing the bipartisan support it has thus far maintained. This would all undermine U.S. national security.”", "Tim Morrison, the outgoing senior director of European affairs at the National Security Council and a deputy assistant to the president, also listened in on the call and later told House investigators that he reported the call to the lawyers, worrying that the political nature of call would be “damaging” to U.S. interests if leaked to the public.", "“I didn’t necessarily fully understand how everybody could use it, but I was concerned that it would wind up politicizing Ukraine. I was concerned that that would, in turn, cost bipartisan support [in Congress],” he said. “And I was concerned about how the Ukrainians would internalize that.”", "Jennifer Williams, a special adviser for Europe and Russia for Vice President Mike Pence, also listened to the call, which she described as “unusual.”", "“I certainly noted that the mention of those specific investigations seemed unusual as compared to other discussions with foreign leaders,” Williams said when asked in her Nov. 7 deposition if she had “any concerns” about the conversation. “I believed those references to be more political in nature and so that struck me as unusual.”", "RNC: “Gordon Sondland testified multiple times that President Trump ‘said I want nothing. I want no quid pro quo.’”", "Sondland, the U.S. ambassador to the European Union, did tell the House intelligence committee Trump told him that in a Sept. 9 phone call. But when he was asked, Sondland declined to say whether he believed the president.", "“I’m not going to characterize whether I believed or didn’t believe. I was just trying to convey what he said on the phone,” Sondland told Republican counsel Steve Castor.", "Furthermore, as we’ve written before, Sondland also testified that “yes” there was a “quid pro quo” when it came to granting Zelensky a White House visit, claiming that the president’s personal lawyer, Rudy Giuliani, was acting on Trump’s behalf.", "“[A]s I testified previously, Mr. Giuliani’s requests were a quid pro quo for arranging a White House visit for President Zelensky,” Sondland said in his opening statement. “Mr. Giuliani demanded that Ukraine make a public statement announcing investigations of the 2016 election/DNC server and Burisma. Mr. Giuliani was expressing the desires of the President of the United States, and we knew that these investigations were important to the President.”", "Sondland said such a visit was “vital to cementing the U.S.-Ukraine relationship, demonstrating support for Ukraine in the face of Russian aggression, and advancing broader U.S. foreign policy interests.” And, Sondland said, it was openly communicated among numerous officials in the leadership of the State Department and National Security Council that there were efforts to get Zelensky to make a public statement about the investigations to “satisfy President Trump’s concerns” and as a condition for a White House call and visit.", "Also, while Sondland testified that he “never heard from President Trump that aid was conditioned on an announcement” from Ukraine, Sondland said he later “came to the conclusion that the aid, like the White House visit, was jeopardized” unless Zelensky made a public statement about the investigations.", "That was “my own presumption,” Sondland told the committee.", "And, again, we’d note that Sept. 9 — when Trump and Sondland spoke by phone — is the same day that the inspector general of the intelligence community notified the House intelligence committee that he received a whistleblower’s complaint relating to an “urgent concern,” and the same day three House committees announced they would investigate whether Trump and Giuliani tried to pressure Ukraine into conducting “politically-motivated investigations under the guise of anti-corruption activity.”", "It was also several days after Trump was first briefed by White House lawyers on the whistleblower complaint, as the New York Times first reported.", "“Lawyers from the White House counsel’s office told Mr. Trump in late August about the complaint, explaining that they were trying to determine whether they were legally required to give it to Congress,” the Times said, citing “two people familiar with the matter.”", "RNC: “And David Hale also confirmed that he was not aware of any connection between the pause in aid to Ukraine and investigations.”", "Hale, the under secretary of state for political affairs, testified on Nov. 20 that he wasn’t aware of such a connection, but the RNC leaves out the fact that several other officials testified they believed there was a connection between the freeze on security aid to Ukraine and the investigations Trump asked for in his July 25 phone call with Zelensky.", "For instance, Sondland said that “in the absence of any credible explanation for the suspension of aid, I presumed that the aid suspension had become linked to the proposed anti-corruption statement,” and he communicated that to Andrey Yermak, a close aide to Zelensky, on Sept. 1, telling him that “resumption of U.S. aid would likely not occur until Ukraine provided the public anti-corruption statement that we had been discussing for many weeks.”", "Sondland also testified in his Nov. 20 public hearing that he mentioned his concerns that the freeze on the aid was tied to investigations to Vice President Pence, before Sept. 1 meetings with Ukrainian officials and that Pence had nodded, in a “sort of duly noted” way. (Pence’s chief of staff later denied Sondland’s account.)", "Also, Taylor, the charge d’affaires at the U.S. Embassy in Ukraine, told congressional investigators that by mid-July it was clear to him “that the meeting President Zelensky wanted [with Trump] was conditioned on the investigations of Burisma and alleged Ukrainian interference in the 2016 U.S. elections.” And in a Sept. 1 phone call with Sondland, Taylor learned the security aid was also tied to those investigations.", "“During that phone call, Ambassador Sondland told me that President Trump had told him that he wants President Zelenskyy to state publicly that Ukraine will investigate Burisma and alleged Ukrainian interference in the 2016 U.S. election,” Taylor said in his prepared statement. “Ambassador Sondland also told me that he now recognized that he had made a mistake by earlier telling the Ukrainian officials to whom he spoke that a White House meeting with President Zelensky was dependent on a public announcement of investigations — in fact, Ambassador Sondland said, ‘everything’ was dependent on such an announcement, including security assistance. He said that President Trump wanted President Zelensky ‘in a public box’ by making a public statement about ordering such investigations.”", "David Holmes, a political counselor for the U.S. Embassy in Ukraine, testified that “with no explanation” given for the hold on security aid, the logical conclusion was that there was a link between the hold and the investigations. He said he would be “surprised” if the Ukrainians “wouldn’t have drawn that conclusion” as well.", "RNC: “Sondland also testified that America’s aid was released to Ukraine without an investigation and a meeting between President Trump and Ukraine President Zelensky was held without an announcement of investigations.”", "Jordan: “The Ukrainians never started, never promised to start and never announced an investigation in the time that the aid was paused. Never once.”", "This is a familiar Republican talking point that Ukraine got what it wanted — a phone call, a meeting with Trump and U.S. security aid — without having to publicly announce that it would investigate the Bidens and the allegations of Ukraine inference in the 2016 election. But this is misleading.", "Let’s take them one at a time, beginning with the phone call.", "Jordan is wrong to claim that the Ukrainians “never promised to start” an investigation. The July 25 phone call happened after Trump’s top aides secured a promise that Zelensky would agree to the investigations.", "As we mentioned earlier, Sondland exchanged WhatsApp messages on July 19 with Volker, Trump’s special envoy to Ukraine, and Taylor, the charge d’affaires at the U.S. Embassy in Ukraine, that said a phone call between the two leaders would soon take place. Volker said it is “[m]ost impt … for Zelensky to say that he will help investigation — and address any specific personnel issues — if there are any.”", "Zelensky did exactly that, promising Trump that his next prosecutor general would investigate Burisma.", "“Since we have won the absolute majority in our Parliament, the next prosecutor general will be 100% my person, my candidate, who will be approved by the parliament and will start as a new prosecutor in September. He or she will look into the situation, specifically to the company that you mentioned in this issue,” Zelensky told Trump in the July 25 phone call.", "As for meeting Trump, Zelensky did meet with the president at the United Nations on Sept. 25 — but it came after the House intelligence committee learned about the whistleblower complaint alleging Trump’s misuse of power and after House Speaker Nancy Pelosi announced an impeachment inquiry.", "Also, their meeting was not the White House meeting that Trump’s top aides had been offering to Zelensky.", "In his prepared remarks at an Oct. 22 closed-door hearing, Taylor recalled how Sondland told him on Sept. 1 that a White House meeting and U.S. security aid were both conditioned on Ukraine’s announcement of the investigations sought by Trump.", "But soon the White House’s hand would be forced by events.", "On Sept. 9, the House intelligence committee learned about the whistleblower complaint and House committees announced investigations into whether Trump and Giuliani tried to pressure Ukraine into conducting “politically-motivated investigations under the guise of anti-corruption activity.”", "Two days later, the White House suddenly released the aid. “It really came quite out of the blue,” Laura Cooper, deputy assistant secretary of defense for Russia, Ukraine and Eurasia, testified about the administration’s decision to lift the hold on the aid. “It was quite abrupt.”", "So, while it’s true that the aid was released, it came abruptly and under duress.", "RNC: “Kurt Volker and Tim Morrison both testified that there was no quid pro quo, no bribery, and no extortion.”", "This claim refers to answers provided by Morrison, a National Security Council aide, and Volker, Trump’s special envoy to Ukraine, to questions posed by Republican Rep. Elise Stefanik during the Nov. 19 public impeachment inquiry hearings.", "Morrison, who was listening in on the July 25 call between Trump and Zelensky, and Volker, who later got a readout of the call, testified that on the call there was no mention of withholding aid, no quid pro quo, bribery or extortion.", "In a deposition to House committees on Oct. 31, Morrison said he was “not concerned that anything illegal was discussed” but later declined to offer an opinion about whether Trump did anything illegal on the call. In his public testimony on Nov. 19, Morrison reiterated that point, stating, “I made no judgment about any illegal conduct occurring.”", "But, as we noted earlier, Morrison was concerned that the contents of the phone call would be “damaging” to U.S. interests if leaked to the public.", "Stefanik later asked both Morrison and Volker whether they had “any evidence of a quid pro quo … any evidence of bribery … any evidence of treason.” Both said they did not.", "But Morrison also testified that he was concerned about what Sondland was asking of the Ukrainians. That concern was piqued by two conversations he had with Sondland.", "The first time came after Sondland privately spoke with Yermak, Zelensky’s aide, on Sept. 1, after the Ukrainian president had met in Poland with Pence. According to Morrison, Sondland told Yermak “what could help them move the aid was if the prosecutor general would go to the mic and announce that he was opening the Burisma investigation.” Morrison said he was concerned enough about Sondland’s conversation with Yermak that he reported it to then-National Security Adviser John Bolton and NSC lawyers.", "Morrison also described a conversation he had with Sondland regarding a Sept. 7 conversation between Sondland and Trump.", "“If I recall this conversation correctly, this was where Ambassador Sondland related that there was no quid pro quo, but President Zelensky had to make the statement and that he had to want to do it,” Morrison said, noting that he understood the “statement” was about an investigation into the Bidens and the 2016 election.", "Morrison said Sondland believed, after speaking with Trump, that the statement was a condition for the security aid to be released. “I was concerned about what Ambassador Sondland was–was saying were requirements,” Morrison said.", "Morrison said he again provided this information to Bolton, who recommended he again relay the information to NSC attorneys, which Morrison did.", "Jordan: “The Ukrainians, third, didn’t know the aid was held up at the time of the phone call.”", "This was one of “four key facts” that the Ohio Republican said “will not change, have not changed, will never change.”", "But his claim that the Ukrainians “didn’t know the aid was held up at the time of the phone call” isn’t an established fact. Jordan’s statement also ignores actions taken by some in the Trump administration after July 25 and into early September to get Ukraine to publicly announce the investigations that were sought by the president.", "The first hold on the Ukraine aid formally occurred on July 25 — the same day as the Trump-Zelensky phone call.", "Mark Sandy, the deputy associate director for national security at the White House Office of Management and Budget, testified that Robert Blair, an assistant to the president and senior adviser to acting White House Chief of Staff Mick Mulvaney, sent an email to Michael Duffey, the associate director of the OMB’s Resource Management Organization, that said the president was directing a hold on security aid for Ukraine. No explanation was given, but it was up to OMB’s legal department to come up with a rationale for the hold.", "The issue, Sandy explained, was “how could we institute a temporary hold consistent with the Impoundment Control Act,” which prevents a president from unilaterally changing how to spend congressionally appropriated funds. Sandy testified that he signed a document that officially placed the first hold on the security aid to Ukraine on July 25.", "“Amounts apportioned but not obligated as of the date of this reapportionment for the Ukraine Security Assistance Initiative are not available for obligation until August 5th, 2019, to allow for an interagency process to determine the best use of such funds,” according to the document Sandy signed on July 25. There were “at least a half-dozen” holds put in place in August and September, he said.", "On the same day as the Trump-Zelensky phone call and the official hold on the security funds, some Ukrainian government officials began to question the delay in funding.", "Laura Cooper, deputy assistant secretary of defense for Russia, Ukraine and Eurasia, said this in her Nov. 20 testimony: “On July 25th, a member of my staff got a question from a Ukraine Embassy contact asking what was going on with Ukraine security assistance.”", "At the time, Cooper said, her staff did not know that OMB had placed a hold on the Defense Department funds for Ukraine.", "“The OMB notice of apportionment arrived that day, but this staff member did not find out about it until later,” she said. “I was informed that the staff member told the Ukrainian official that we were moving forward on USAI [the Defense Department’s Ukraine Security Assistance Initiative], but recommended that the Ukraine Embassy check in with State regarding the FMF [State Department-administered funds].”", "Catherine Croft, who served as a special adviser for Ukraine under Volker, told a similar story in her Oct. 30 deposition.", "Croft said she attended a July 18 meeting where an OMB representative disclosed that Mulvaney “had placed an informal hold on security assistance to Ukraine … at the direction of the president.” She also said the Ukrainians “found out very early on” that the U.S. was withholding the funds, but she could not recall the date — except to say it was before it became publicly known on Aug. 28, when Politico first wrote about the hold in a story headlined “Trump holds up Ukraine military aid meant to confront Russia.”", "“Two individuals from the Ukrainian Embassy approached me quietly and in confidence to ask me about an OMB hold on Ukraine security assistance,” she recalled. The Ukrainians wanted to keep word about the hold quiet, she said, because it would signal “an expression of declining U.S. support for Ukraine.”", "“I remember being very surprised at the effectiveness of my Ukrainian counterparts’ diplomatic tradecraft, as in to say they found out very early on or much earlier than I expected them to,” Croft said.", "We don’t know exactly when the Ukrainians first learned about the hold. As we said earlier, Zelensky has told reporters that he learned about the blocked aid after the phone call. However, other Ukrainian officials were aware of it on the same day as Trump’s call with Zelensky.", "Also, as we document elsewhere, the campaign to get Ukraine to publicly announce the investigations sought by Trump continued long after the July 25 call and into September, when it had become public knowledge that the U.S. had placed a hold on Ukraine security funds.", "As for the next step in the impeachment process, Pelosi announced on Dec. 5 that she has directed the Judiciary Committee chairman to draft articles of impeachment.", "The committee is scheduled to meet next on Dec. 9.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]