["In the backdrop of recent India-Pakistan cross-border skirmish, several Pakistani social media users have shared an image of slain soldiers claiming that they are Indian army men killed by the Pakistani army. The tweet posted below was shared by a user who identifies as ‘Cyber Defense & combat team of Pakistan’. She wrote, “Indian Army struggling to pick dead bodies…”", "Indian Army struggling to pick dead bodies and evacuate injured soldiers. Indian Army raising white flag. This they should think before initiating unprovoked CFVs and respect military norms by avoiding to target innocent civilians.#PakistanArmy pic.twitter.com/pVHvGXsXfR", "— Saira rajpoot (@Saira0112) October 20, 2019", "India and Pakistan traded fire in the Tangdhar sector of Kupwara district in North Kashmir on October 20. While India claims to have lost two soldiers and killed at least six Pakistani army men, the neighbouring country claimed to have lost only one solider and killed nine Indian army men. Both nations have rejected each other’s claims.", "Another Pakistani citizen shared the same image and wrote, “In today’s clash, the brave army of Pakistan sent nine Indian soldiers to hell.”", "In today’s clash, the brave army of Pakistan sent nine Indian soldiers to hell. Don’t Mess With The Best ✌️#PakistanArmy 🇵🇰💪#IndianArmy 😂 pic.twitter.com/13ytrrKIB6", "— Zahid Siddique (@ZahidSiddique_) October 20, 2019", "One Milan Zahid took a step further and claimed that 53 Indian soldiers were killed the firing.", "A simple reverse image search on Google reveals that Pakistani handles used an old, unrelated photograph to depict slain Indian army men. The oldest instance of this image discovered by Alt News dates back to 2014. A May 11, 2014 Gujarati report by Oneindia carried the image in a story about a Naxal attack in Maharashtra’s Gadchiroli where seven policemen were killed.", "An old image was therefore shared by several Pakistani Twitter handles to portray slain Indian army men in the recent cross-border skirmish.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]