["About this rating", "Some Binghamton University resident assistants (RAs) utilized material with the words \"stop white people,\" inspired by a popular Twitter hashtag, for use during an optional RA program developed by students.", "Binghamton University is not offering a \"stop white people\" course.", "On 25 August 2016, multiple Fox News-linked accounts published tweets and articles about a school \"training course\" that led many social media users to believe was a class offered at the State University of New York at Binghamton (commonly known as Binghamton University) called \"Stop White People.\"", "Columnist Todd Starnes penned a column about the controversy, describing a \"workshop\" offered as \"an official part of the residential assistant training program\":", "Nothing screams tolerance and diversity like a university workshop designed to target white people.", "The State University of New York in Binghamton has a bit of explaining to do after they held a workshop titled, “#StopWhitePeople2K16.”", "The workshop was an official part of the residential assistant training program at the taxpayer-funded university.", "The Binghamton Review, the university’s conservative newspaper, exposed this nonsense and they deserve a round of applause for their efforts.", "Starnes referenced a 24 August 2016 item published by student newspaper the Binghamton Review  that included additional detail about the teacup tempest, but the latter was far clearer about the minute scope and origin of the printed material (depicted above) that prompted the rumors:", "On Friday, August 12, an optional conference for Binghamton University Residential Assistants entitled “#StopWhitePeople2K16” was held in an effort to “take the next step in understanding diversity, privilege, and the society we function within.” Naturally, that title garnered a significant amount of attention in a very short period of time, and before long, the University delivered an official response to concerns from those who believed the title was racist.", "Brian Rose, Binghamton University’s Vice President of Student Affairs, wrote in his response to the controversy that the program was not \"anti-white,\" and instead was simply a “discussion” that “explored reverse racism, the relationship of communities of color with police, whiteness, crime and segregation in an open conversation format.”", "Rose also wrote that the titular hashtag “is commonly used ironically,” and “as the senior student affairs officer on campus,” he is “supportive of the students’ efforts to facilitate dialogue around a challenging set of topics.”", "Rose indeed issued an undated statement about an optional 12 August 2016 event for resident advisors (RAs) at Binghamton, during which three RAs hosted the presentation described in the printed material. Rose noted that the presentation in question centered on race relations and referenced a popular existing Twitter hashtag that was not created by Binghamton RAs:", "A program facilitated by three student resident advisors (RA’s) as part of an educational program for RA staff training has prompted public and internal comment and inquiry. The program title “#StopWhitePeople2K16” was drawn from a familiar hashtag in use on Twitter, and was not invented by the program facilitators. It is my understanding that the hashtag is commonly used ironically.", "The optional program was developed by the students themselves, supported by a young professional staff person. Its purpose, as conceived, was to facilitate a discussion among the RA’s that would improve their ability to handle conflicts among residents around issues of diversity.", "Upon learning of the concerns expressed over the session’s title by some off-campus groups and individuals, the university’s student-affairs office reviewed the session and the program content more closely to obtain an accurate understanding.", "We verified that the actual program content was not “anti-white”. The inclusion of the program in the educational session was not driven by any university administration initiative to advocate any specific viewpoint on diversity. About 40-50 RA’s chose to attend the session which ran concurrently with some other sessions. Topically the discussion in the program was far-ranging, student driven and explored reverse racism, the relationship of communities of color with police, whiteness, crime and segregation in an open conversation format. Post session feedback predominantly described the session as a respectful and productive conversation. Professional staff followed up directly with a few participants who had a mixed reaction to the program in support of those participants.", "What we strive to do from an administrative level is cultivate an environment where our students listen to one another, learn from one another and do so in a manner that doesn’t cause unnecessary harm. I have no indication that this particular program was inconsistent with the respectful environment we hope to support and sustain.", "Nevertheless, rumors quickly spread on social media indicating that Binghamton was offering a full course in their curriculum called \"Stop White People,\" and a number of web sites and online users reacted to that misinterpretation.", "We contacted the university's media relations department and a representative with whom we spoke reiterated that the RA-only presentation was student-led and student-managed, adding that Binghamton at no time has offered a \"Stop White People\" class as part of any school curriculum.", "Hecht, Howard.   \"Binghamton University’s Office of Student Affairs Supports “#StopWhitePeople2K16” RA Event, Despite Its Controversial Title.\"\r\n    Binghamton Review.   24 August 2016.", "Starnes, Todd.   \"University Hosts 'Stop White People' Workshop.\"\r\n    Fox Nation.   25 August 2016.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]