["About this rating", "A Donald Trump rally in Panama City, Florida, drew thousands of attendees.", "A putative photograph of the Trump rally actually pictured the crowd at a jazz festival held three years earlier.", "On 11 October 2016, the right-wing blog Liberty Writers posted a story, apparently in response to a New York Times report indicating that Hillary Clinton was leading early voting underway in Florida, claiming that Republican nominee Donald Trump drew a huge crowd at a rally at the Aaron Bessant Park in Panama City, Florida:", "Political pundits want you to believe that Trump has already lost this election. Just today, the liberal media announced that Trump lost his chances in Florida. They claim that Florida is now a blue state and Hillary will win for sure.", "It looks like Florida voters disagree.", "Trump held a rally in Panama City Beach Florida and brought in a crowd no one could believe!", "The rally was held at Aaron Bessant Park, a location with a maximum capacity of 7,500 people.", "When Trump stepped on stage he greeted 30,000 supporters chanting his name!!!", "The web site then posted a photograph it claimed was a \"bird's eye view\" of the rally. But the picture actually captured a jazz festival held at the same venue back in 2013:", "The photograph was originally published alongside a 24 April 2013 story in SoWal.com, a tourism-oriented blog about South Walton, Florida, regarding the Seabreeze Jazz Festival.", "It's unclear how many people attended the Trump rally. According to the city, the venue seats 7,500 people; according to Pensacola television station WEAR, the Trump campaign announced the crowd had reached 11,200, with an additional 10,000 outside the gate; according to Panama City station WJHG,  organizers were expecting \"up to 7,500\" people at the event; and according to a Panama City Beach Fire Department estimate, between 8,000 and 8,500 people were inside with another 10,000 to 11,000 outside.", "Regardless, the rally without doubt drew thousands of supporters. WCTV's James Buechele posted pictures to Twitter showing a large crowd lined up, waiting to get inside the venue to hear Trump speak:", "More of the crowd waiting to get into the Trump rally that starts at 8:30 eastern 7:30 local time @WCTV pic.twitter.com/6NsDxvioV8", "— James Buechele (@JamesBuechele) October 11, 2016", "People waiting to get into a Trump rally at Panama City Beach @WCTV pic.twitter.com/AAWpe4PsWe — James Buechele (@JamesBuechele) October 11, 2016", "Lischka, Kurt.   \"SoWal Needs the Seabreeze Jazz Festival.\"\r\n    SoWal.com.   24 April 2013.", "Peters, Jeremy W.   \"Early Voting Could Point to Hillary Clinton Victory Well Before Nov. 8.\"\r\n    The New York Times.   11 October 2016.", "Bruce, Lindsey. \"OH MY GOD! Trump Just Stepped on Stage in Panama City Florida and Got the SURPRISE of His LIFETIME!.\"\r\n    Liberty Writers News.   11 October 2016.", "WJHG-TV.   \"Crowd builds for Trump Rally in Panama City Beach.\"\r\n    11 October 2016.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]