["The one-minute 20-second video was published on Facebook here on May 13, 2020. The video has been viewed more than 893,000 times.", "The post’s Hindi-language caption translates to English as: “Sad incident: Some unsocial elements set 300 Muslim homes on fire in West Bengal. The incident took place at 7 am in Telinipara district of West Bengal. India is burning in the fire of  Hindu-Muslim hatred. How long will it continue?”", "Telinipara, a small town in the east Indian state of West Bengal, recently experienced sectarian violence and arson attacks, according this report published by Indian newspaper The Hindu and this report published by Indian television media company NDTV.", "The video was also shared alongside a similar claim on Facebook here, here, here and here; and on Twitter here, here, here and here.", "The claim is false.", "A reverse Google image search found that the logo seen in the top-right corner of the footage is the branding for Rohingya National News (RNN), a non-profit news agency founded in 2018 by displaced Rohingyas.", "The same footage can be seen in a video published on RNN’s Facebook page here on May 12. The exact scene can be seen between the ten-minute five-second mark to the 11-minute 25-second mark of the RNN video.", "According to the RNN video post, the footage shows a “devastating fire” at the “Kutupalong refugee camps” in Bangladesh.", "At the video’s ten-minute 30-second mark, a male voice speaking broken English can be heard saying: “There is fire at Kutupalong refugee camp. No fire service come. Very dangerous fire. Very difficult fire at Kutupalong refugee camp but no fire service come here.”", "Below is a screenshot comparison of the video in the misleading Facebook post (L) and the video shared on RNN Facebook page (R):", "AFP contacted the manager of the RNN Facebook page, Mohammad Rafiq. He identified himself as a Rohingya refugee living in the Kutupalong camp.", "Rafiq said he filmed the footage in the Kutupalong camp shortly after the May 12 fire swept through the area.", "Below is a screenshot of the original copy of the video he sent to AFP through WhatsApp on May 17, 2020:", "He also shared several photos of the accident published by RNN, for example here and here.", "Citing local officials, AFP reported here on May 13 that at least 330 structures were destroyed in the Kutupalong fire.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]