["About this rating", "\"Papa Bear\" George Halas is a legend in the world of professional football. A member of the charter group of inductees in the Pro Football Hall of Fame, Halas was one of the co-founders of the National Football League (NFL) in 1920, and he is most famous for his long tenure as owner and head coach of the Chicago Bears franchise, which he led to multiple championships during a coaching career that spanned 40 seasons.", "However, Halas actually began his professional sports career as a baseball player, piquing the interest of the New York Yankees while playing college ball and signing with the team after he was discharged from the U.S. Navy at the end of World War I. Halas reported to the Yankees for spring training in 1919 and made the remarkable jump from college player to big-league outfielder.", "That one season was the extent of Halas' major-league baseball career, however, as a hip injury limited his performance. He was sent down to the minors, and he opted not to return to pro baseball the following year. By the end of 1919, he was playing professional football, and in 1920 he took part in the meeting that formed the American Professional Football Association (which became the NFL in 1922). In the process, Halas purportedly gained another measure of sports immortality as the answer to the trivia question, \"Whom did Babe Ruth replace as the Yankees' right fielder?\"", "But Halas couldn't have been \"replaced\" by Babe Ruth -- or anyone else -- in the Yankees' outfield (as he reportedly claimed for the rest of his life) because he had never been a regular in the first place. In his single season with the New York club, Halas took part in only a dozen games, and half of those appearances were as a pinch-runner or pinch-hitter. He played the outfield in only six games (five in right and one in center) before he was sent down, never to return.", "In 1919, the Yankees' primary outfielders were Ping Bodie, Duffy Lewis, and Sammy Vick. After New York acquired Babe Ruth from the Boston Red Sox during the 1919-20 off-season and installed him as a full-time outfielder, the player who suffered the greatest curtailment in playing time was Sammy Vick, who started 96 games in right field for the Yankees in 1919 but only 24 games in 1920 (and was then shipped off to the Red Sox at the end of the 1920 season).", "All of us who eventually have to give up our jobs in favor of newer and better arrivals may like to think we were supplanted only by someone of world-class talent, but in this case, that notion was more wishful thinking than reality.", "David Mikkelson founded the site now known as snopes.com back in 1994 as a creative outgrowth of his wide-ranging interests in a variety of subjects (particularly folklo ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]