["The misleading claims about Australia Day were published in this lengthy Facebook post on January 18, 2021.", "“AUSTRALIA DAY CELEBRATES THE DAY ALL AUSTRALIANS STOPPED BEING BRITISH CITIZENS AND BECAME AUSTRALIAN CITIZENS IN 1949,” it reads.", "It goes on to make a series of claims about the origins of Australia Day.", "Similar posts were shared on Facebook here, here and here.", "However, the posts are misleading, according to historians and government websites.", "According to a 2018 report on the Australian Parliament's website, Australia Day dates back to January 26, 1788.", "Australia Day “is the anniversary of Captain Arthur Phillip landing in Sydney Cove and raising the Union Flag, after the previous abortive landing in Botany Bay on 18 January 1788. The colony was formally founded and Arthur Phillip’s Governorship proclaimed on 7 February,” it explains.", "Captain Arthur Phillip was the Commander of the First Fleet, which sailed to Australia from Britain, according to an article by the Museum of Sydney.", "The New South Wales Migration Heritage's website details the arrival of the First Fleet.", "This description of Australia Day corresponds with a report on the National Australia Day Council's website, which states the event began as a “celebration for emancipated convicts”.", "Emeritus Professor Tim Rowse, of Western Sydney University’s Institute for Culture and Society told AFP that Australia Day is a continuation of “Anniversary Day”, which was first marked on January 26, 1791.", "“Anniversary Day” was celebrated by Captain Arthur Phillip, the founding Governor of the colony of New South Wales on January 26, 1791. It marked the anniversary of Captain Phillip's arrival at Sydney Cove on January 26, 1788. The celebration was noted here on page 8 of “Australians 1838”, a book on the country’s early colonial history.", "Australia Day has not, however, always been marked on January 26, nor does it commemorate the recognition of Australian citizenship, experts said.", "Australian citizenship", "Professor Amanda Nettlebeck, a researcher of Australian colonial history from the University of Adelaide’s School of Humanities told AFP that the Facebook posts contained “some mixed accuracies, misleading statements, and factual errors.”", "She said the posts incorrectly state Australia Day was established to celebrate the creation of Australian citizenship on January 26, 1949.", "“Australia Day 1949 was the date when the newly-passed Australian Citizenship Act 1948 came into effect, but the author is incorrect in implying that Australia Day was created to celebrate this event,” she said. “National celebrations on 26 January had existed in one form or another since 1915.”", "The post is incorrect in claiming that “all Australians stopped being British citizens” on January 26, 1949, Nettlebeck added.", "“In fact, all people born into the British Empire until that point were British subjects, not citizens. Britain passed a citizenship act in 1948 which created the legal category of British citizenship,” she said.", "“Other Commonwealth nations introduced their own citizenship acts around that time, including Australia. However, even after the passage of the Australian Citizenship Act 1948, Australian citizens continued to hold dual status as Australian citizens and British subjects.”", "The definition of the status of “British subject” was repealed in the Australian Citizenship Amendment Act 1984.", "Although Australia Day was established as a national public holiday in 1994, the origins of “Australia Day” go back to 1915, Nettlebeck said. It was originally celebrated as a morale-booster for soldiers and to raise funds for them during World War One, she said. At that time, the date agreed on for this “Australia Day” was July 30, 1915, as noted here by the Australian War Memorial.", "Nettlebeck went on to say the Facebook posts accurately state that Australia Day “has nothing to do with Captain Cook”.", "“Captain Cook” refers to British naval officer James Cook. According to the Australian government's official Australia Day website, Cook “raised the Union Jack on what is now called Possession Island on 22 August, 1770, to claim the eastern half of the continent as New South Wales for Great Britain.”", "“Cook landed as part of a longer navigation expedition in 1770 but this was when New South Wales and the Australian continent had not yet been claimed as a British territory,” Nettlebeck said.", "“[The Facebook post’s author] is also correct to say that the First Fleet landed on Australian shores on 18 January 1788, not 26 January. 26 January 1788 is the day the crew and convicts disembarked at Sydney Cove.”", "Indigenous population", "Although Australia Day historically marked the arrival of the British fleet in New South Wales, the event has been contentious, particularly for Indigenous Australians, who have branded it “Invasion Day”.", "On January 26, 2021, thousands of Australians defied coronavirus rules to protest against Australia Day, held on the anniversary of British colonisation of the vast continent.", "Aboriginal and Torres Strait Islander national advocacy organisation ANTaR, explained that for Indigenous people, January 26 “is a reminder of the pain and suffering of their ancestors”.", "Nettlebeck said the post is misleading in stating the Nationality and Citizenship Act 1948 “granted Indigenous Australians with new legal protections they hadn’t previously had.”", "“With the passage of the Australian Citizenship Act 1948, Indigenous people technically became citizens like everyone else. However, the vast majority of Aboriginal people were still living under the oppressive authority of Welfare and Protection Boards up to the 1960s which made them subject to discriminatory laws,” she said.", "The posts also misleadingly imply that Indigenous people gained the status of British subjects under the Nationality Act 1920, Nettlebeck said.", "“The Nationality Act 1920 didn’t create British subjecthood; it served to codify the categories of natural-born subjects and ‘aliens’ who could become British subjects through naturalisation,” she said.", "“At least in theory, Australian Indigenous people received the same protections of the law as did other British subjects after the 1830s. However, the reality was very different, in that Indigenous people rarely received the full protections of the law in practice, then or since.”", "Professor Rowse also said the posts falsely claim that Indigenous people gained British subjecthood through the Nationality Act 1920.", "“This Act makes no mention of ‘Aboriginal natives’ and so made no difference to their legal status,” he said in an email on January 27, 2021.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]