["The post, that credits US-based news organisation CNN as the source, was shared widely on WhatsApp among Sri Lankan users.", "Below is a screenshot of the misleading WhatsApp message:", "The message reads in part: \"Breaking news from CNN. Dr Li Wenliang, China's hero doctor who was punished for telling the truth about corona virus and later died due to the same disease, had documented casefiles for research purposes and had in casefiles proposed a cure that would significantly decrease the impact of the COVID-19 virus on the human body.", "\"The chemical Methylxanthine, Theobromine and Theophylline stimulate compounds that will ward off the virus in a human with at least an average immune system. Whats more shocking is that these complex words that were difficult for people in China to understand is actually called tea in India.\"", "Dr Li Wenliang was an ophthalmologist working in the Chinese city of Wuhan who died in February, 2020 after contracting COVID-19. Before his death, he was one of a group of doctors in Wuhan who shared posts on social media warning of a SARS-like virus spreading in the city in December, as reported by AFP here.", "Methylxanthine, theobromine and theophylline are all stimulants and caffeine derivatives, commonly found in tea.", "Similar posts were also shared on Facebook here, here, here, here and here.", "A similar claim was also reported by Sri Lanka’s TNL television network during its evening news bulletin on March 24, 2020.", "The claim is false.", "A keyword search on both Google and the CNN website for the alleged report cited in the misleading posts yielded no results.", "Dr. Jayaruwan Bandara, director of the Sri Lanka Medical Research Institute, told AFP by phone on March 26, 2020 that while tea may strengthen immunity, there is “no research” on the benefits of drinking tea for COVID-19 patients.", "He said: “While drinking tea can be beneficial for one’s health, it cannot be touted as a preventive measure or a treatment in the case of COVID-19. The only way to minimise infection as recognised by other international health agencies, is social distancing, following proper hand hygiene and refraining from touching one’s eyes, mouth and nose.”", "A spokeswoman for Sri Lanka National Science Foundation also said there was no evidence to suggest tea can \"alleviate or prevent COVID-19 infections\".", "During a phone conversation with AFP on March 26, 2020, she said: “The three chemical compounds mentioned in the claim are mostly found in green tea due to the difference in the way it is processed. The antioxidants in green tea can be good sources to provide certain conditionings to the body in specific situations. But so far, there is no study done, clinically or microbiologically to ascertain if tea can alleviate or prevent COVID-19 infections.”", "The WHO also states in the Q&A section of its website here, that “there is no evidence that current medicine can prevent or cure the disease”.", "Dr. Ashan Pathirana, the registrar at Sri Lanka’s Health Promotion Bureau (HPB) told AFP on March 25, 2020 that “the circulation of false information relating to various COVID-19 ‘cures’ without a scientific basis, can have grave repercussions”.", "“While there is no harm to health by consuming tea, these types of information circulated among vulnerable masses creates a sense of false security, which can be deadly in itself,” he said.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]