["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Utah Jazz center Rudy Gobert talks with guard Donovan Mitchell, left, during an NBA basketball game against the Detroit Pistons, in Detroit, on March 7, 2020. (AP/Burleson)", "After Utah Jazz center Rudy Gobert tested positive for the novel coronavirus, the state of Oklahoma administered tests to 58 people in a matter of hours.", "A spokesperson for the Oklahoma State Department of Health said it was the first incident where that many people met the criteria for testing in such a short timespan.", "It’s hard to say how many tests are available and how many have been run, but one tally shows some states testing fewer than 50 people per day as of March 12.", "The novel coronavirus reached the NBA this week, with Utah Jazz center Rudy Gobert testing positive in Oklahoma City moments before the Jazz were set to tip off against the Thunder.", "The development led the NBA to suspend its season. The Jazz said in a statement that after diagnostic tests were administered to team players, staff and traveling beat reporters, only one of the reported 58 people tested in connection with Gobert — guard Donovan Mitchell, who confirmed his positive test on Instagram — was found to be carrying COVID-19.", "The Jazz’s quick access to 58 coronavirus tests seemed at odds with the fact that the United States has lagged behind other countries where testing has been more widespread.", "\"Some states are only getting 50 tests per day, and the Utah Jazz got 58?\" said Michael Dougherty, a senior writer for the National Review, in a March 12 tweet.", "Some states are only getting 50 tests per day, and the Utah Jazz got 58? If tests are going to remain scarce, how they're distributed will be a subject not just of controversy, but of fury and reprisal. https://t.co/Eip3nNOOXR", "We wondered how the Jazz team personnel got their hands on COVID-19 tests in a matter of hours, and what kind of access states have had to testing by comparison.", "We found that Dougherty’s claim lined up with the information that’s available, despite some murkiness around the number of tests that have been conducted across the country.", "After a sprinting medical staffer alerted referees to Gobert’s confirmed infection minutes before the game was supposed to start, the state of Oklahoma quickly completed tests for 58 people close to the organization who had come in contact with Gobert.", "The results for those 58 people came back within nine to 10 hours, said Andy Larsen, a Jazz beat writer for the Salt Lake Tribune who was tested for having been in recent contact with Gobert.", "The process was fast, with medical professionals taking throat and sinus swabs from the team personnel at the arena, Larsen said. \"It really only does take like two minutes,\" he said.", "The specimens were then shipped to Oklahoma’s public health lab, where they were tested overnight using test kits provided by the Centers for Disease Control and Prevention, said Jaime Dukes, a spokesperson for the Oklahoma State Department of Health.", "Dukes told us the Oklahoma lab has been running tests since March 6, and that the lab has completed roughly 150 tests since then, including the tests on the Jazz personnel.", "That means many of the tests in Oklahoma were completed in one night. Dukes said that’s because Oklahoma has been following the CDC’s case-definition requirements, which currently say that clinicians should use judgment to decide if a symptomatic patient should be tested.", "Clinicians are supposed to prioritize people with serious symptoms, people who are older or have underlying medical conditions, and people who had close contact with a confirmed or suspected coronavirus patient or recently traveled to an affected area, according to the CDC.", "\"That honestly was the first incident we’ve had where 58 people at one time needed to be tested,\" Dukes said. \"We’ve been meeting the demand, but we are being very clear about our criteria for testing.\"", "NBA spokesman Tim Frank said Oklahoma health officials directed the Jazz testing without intervention from the NBA, and that there was \"nothing we did to accelerate it.\"", "But state epidemiologist Laurence Burnsed, speaking at a March 12 press conference, said the NBA has \"policies in place\" that helped Gobert get tested quickly. NBA team trainers regularly monitor players for illness and work with local physicians when needed, Burnsed said.", "According to the Associated Press, a number of other NBA franchises are having employees self-quarantine or get tested after coming into contact with Gobert and Mitchell in recent weeks.", "It’s hard to precisely say how many tests the U.S. has administered, in part because the CDC has outsourced some responsibility to states as well as private, academic and commercial labs. There’s no centralized database tracking everything.", "Testing in the U.S. was slowed from the get-go by flaws with the government’s early test kits and barriers that have been relaxed but still limit who can get tested.", "Stephen Hahn, commissioner of the Food and Drug Administration, said March 7 that public health labs have the ability to test a total of 75,000 people.", "He also said 1.1 million tests had been shipped to private labs, with another roughly 1 million on the way and still more to come from other academic and commercial labs.", "The U.S. took another step toward increasing its capabilities on March 13 when it gave over $1 million to two companies to develop new, one-hour tests.", "It’s not clear that those capabilities are being met, however.", "According to a tracker from the American Enterprise Institute, the different labs running tests throughout the U.S. should have been capable of cumulatively testing more than 25,000 per day, at least as of March 13. (Dougherty is also a visiting fellow at AEI.)", "Updated to reflect #coronavirus testing lab capacity at Assurance Scientific Labs and increased capacity in CA public health labs, Stanford, and NorthShore University HealthSystems pic.twitter.com/mEZgrkHbUF", "Plus, the number of tests isn’t the same as the number of people who have been tested. Not everyone seeking a coronavirus test can get one. Even sick people have been denied.", "As of March 12, the CDC’s website said it had tested roughly 3,903 specimens in CDC labs, plus about 9,721 in public health labs across the U.S.’s various states.", "Those numbers, while incomplete, pale in comparison with countries like South Korea, which ramped up testing weeks ago by setting up drive-thru screening clinics.", "\"Widespread testing was a key component of China and South Korea's response strategy,\" said Caitlin Rivers, an epidemiologist at the Johns Hopkins Center for Health Security. \"Both countries have made significant progress in controlling their outbreaks.\"", "The U.S. pace has been more sluggish. Dougherty told us his claim could be traced to early March reports from the Atlantic and Buzzfeed News, which said public health labs in states such as Hawaii and Arkansas were capable at the time of running fewer than 50 tests per day.", "Dougherty also cited a recent report from Yahoo News, which relied on state and federal data from the COVID Tracking Project, a project of the Atlantic run by reporters and data scientists.", "The project tracks the numbers presented on state government websites to provide a more accurate overall testing count. (While the CDC website highlights the number of specimens tested, the COVID Tracking Project tracks the number of people.)", "The Yahoo News article noted that the COVID Tracking Project counted 2,728 people tested by states and the District of Columbia on March 10, for an average of less than 55 per state. Some states tested fewer than 50 that day, according to the project’s tally. The project reported that 2,219 people were tested by states on March 11, or roughly 43 people per state.", "Our daily 4pm ET update is out. The topline number is not good: ~10000 people tested, according to our state-level data, which cannot track all negative tests. That's a smaller day-over-day increase than yesterday.The ramp is not happening fast enough. https://t.co/Zc39AZVRge pic.twitter.com/2UfGBYOifc", "Dougherty said \"some states are only getting 50 tests per day, and the Utah Jazz got 58.\"", "Oklahoma public health officials quickly completed tests on 58 people who had had recent contact with Gobert, the Jazz’s center, after he tested positive for COVID-19.", "It’s not clear how many tests each state is running per day. But Dougherty’s claim that \"some states are only getting 50 tests per day\" lines up with what had been reported at the time the claim was made.", "We rate this statement True.", "Michael Brendan Dougherty on Twitter, March 12, 2020", "Shams Charania on Twitter, March 12, 2020", "The Utah Jazz, \"Statement from the Utah Jazz,\" March 12, 2020", "The COVID Tracking Project, accessed March 13, 2020", "Department of Health and Human Services, \"HHS funds development of COVID-19 diagnostic tests,\" March 13, 2020", "Business Insider, \"Celebrities are getting coronavirus tests faster than everyone else,\" March 13, 2020", "COVID-19 Test Capacity on Twitter, March 13, 2020", "The Atlantic, \"How to Understand Your State’s Coronavirus Numbers,\" March 12, 2020", "The Associated Press, \"Jazz stars Mitchell, Gobert test positive; Gobert apologizes,\" March 12, 2020", "The New York Times, \"Sick People Across the U.S. Say They Are Being Denied the Coronavirus Test,\" March 12, 2020", "The Daily Beast, \"How Did the NBA Push Through 58 Coronavirus Tests When Almost No One Else Can Get Them?\" March 12, 2020", "Yahoo News, \"CDC tested only 77 people this week; coronavirus testing slow around the nation,\" March 12, 2020", "Centers for Disease Control and Prevention, \"Testing in the U.S.,\" accessed March 12, 2020", "Vox, \"America’s shamefully slow coronavirus testing threatens all of us,\" March 12, 2020", "The Oklahoman on YouTube, \"Coronavirus in Oklahoma: Gov. Stitt, health officials press conference,\" March 12, 2020", "ESPN on YouTube, \"Jazz-Thunder postponed just before tip-off | 2019-20 NBA Highlights,\" March 11, 2020", "Food and Drug Administration, \"Coronavirus (COVID-19) Update: White House Press Briefing by FDA Commissioner Stephen M. Hahn, M.D.,\" March 7, 2020", "The Atlantic, \"Exclusive: The Strongest Evidence Yet That America Is Botching Coronavirus Testing,\" March 6, 2020", "Buzzfeed News, \"Here’s How Your State Is Handling Coronavirus Testing,\" March 6, 2020", "Centers for Disease Control and Prevention, \"Evaluating and Testing Persons for Coronavirus Disease 2019 (COVID-19),\" March 4, 2020", "Phone interview with Andy Larsen, Utah Jazz beat writer for the Salt Lake Tribune, March 12, 2020", "Phone interview with Jamie Dukes, communications officer for the Oklahoma State Department of Health, March 12, 2020", "Email interview with Tim Frank, senior vice president of basketball communications for the NBA, March 12, 2020", "Email interview with Caitlin Rivers, senior associate at the Johns Hopkins Center for Health Security and assistant professor in the department of environmental health and engineering, March 13, 2020", "Email interview with Michael Dougherty, senior writer at the National Review and a visiting fellow at the American Enterprise Institute , March 12, 2020", "PolitiFact, \"Would Tom Hanks have qualified for a coronavirus test in the US?\" March 12, 2020", "PolitiFact, \"Donald Trump’s wrong claim that ‘anybody’ can get tested for coronavirus,\" March 11, 2020", "PolitiFact, \"Lou Dobbs says United States ‘screening fewer people’ for coronavirus than other countries,\" March 4, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]