["About this rating", "Two young men were photographed wearing Nazi-style armbands in conjunction with  a Donald Trump political event.", "The men were legitimate Trump supporters, and their use of Nazi-like armbands expressed their genuine political beliefs.", "On 14 March 2016, a Fox News producer sent a tweet positing that supporters of Republican presidential candidate Donald Trump were spotted at a Florida rally wearing armbands not dissimilar to those associated with the Nazis:", ".@realDonaldTrump supporters sporting armbands in Florida https://t.co/MoJjuXcVOk", "— Nick Kalman (@NickKalmanFN) March 14, 2016", "The armband rumor was one of many that invoked Nazi imagery in connection with Trump's campaign (earlier quips suggested Godwin's Law was suspended for the duration of the 2016 election cycle). Nazi armbands (cataloged extensively by the United States Holocaust Memorial Museum) remain a strong visual reminder of Nazi-era German politics, World War II, and the Holocaust, due in part to their enduring presence in pop culture representations of those events:", "However, it appeared that the initial tweet was sent without much verification as to whether the Trump armbands were legitimate campaign memorabilia sported unironically by dutiful supporters of the GOP presidential hopeful. Not long after the image hit Twitter hard, users began pointing out that the \"Trump supporters\" looked awfully familiar:", "Trump armband guy looks like the \"Rubio stole my girlfriend\" guy. Maybe everyone wait a min https://t.co/Hx21ucwKO7 pic.twitter.com/7f84UddJLG — Alex Seitz-Wald (@aseitzwald) March 14, 2016", "Political pranksters: Guys in “Trump armbands” appear to be same guys in “Settle for Hillary” shirts at her rally. pic.twitter.com/8d0TVTWleJ", "— Matt Viser (@mviser) March 14, 2016", "These are the same two guys I saw disrupt a Christie event and Jeb event on separate days in Iowa https://t.co/F2GthTmuq8 — Andrew Johnson (@AndrewE_Johnson) March 14, 2016", "Check tape from Jeb's caucus day event in Des Moines: These two were sitting in stands behind him & heckled him before security removed them — Andrew Johnson (@AndrewE_Johnson) March 14, 2016", "@BecketAdams @aseitzwald They were also present at Iowa events. Saw them at Christie and Jeb causing commotion as well — Andrew Johnson (@AndrewE_Johnson) March 14, 2016", "The Washington Post noted that the men pictured were \"bipartisan pranksters\" who had also \"hit\" rallies for Democratic candidates:", "Today the Internet (briefly) went nuts over this photo, of two men described as Trump supporters, taken by a Fox News producer at a Trump campaign rally.", "But those guys looked familiar. And not from Trump rally sightings.", "Very familiar.", "Very, very familiar. (They're bipartisan pranksters, who've reportedly also hit Clinton and Sanders rallies.)", "TL;DR summary: Not everything you see on the Internet is real.", "So, although this photograph may be real and unaltered, the assumptions commonly made about what it depicts are not. The two men seen here are not Trump partisans genuinely donning armbands as a show of support for the candidate. Rather, the pair are well-known in the media for their ongoing interest in disrupting or otherwise \"making it weird\" at events for candidates from both parties.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]