["About this rating", "Back in May 2016, a Home Depot employee in Staten Island, New York, caused a brief stir when she was photographed wearing a \"America Was Never Great\" on the job (as a rebuke to then-presidential candidate Donald Trump's campaign slogan of \"Make America Great Again\"):", "When a Fox News article on the subject was posted to Facebook, it seemingly drew a caustic response from a Home Depot Guest Relations representative, who described the cable news network's fans as \"angry and brainwashed people\":", "That reply wasn't a real response from a Home Depot customer rep, however. It was the work of comedian Ben Palmer, who gained notoriety through creating faux \"Customer Service\" accounts on Facebook and using them to troll commenters in response to their complaints:", "Fake customer service on social media is nothing new. What Atlanta-based comedian Ben Palmer is doing on Facebook is different. Palmer targets the most entitled, prickly complaints on the Facebook pages of certain brands, and then swoops in like a mischievous angel, leaving sick burns in his wake. With the Facebook handle “Customer Service,” Palmer bluntly responds to the most unwarranted parts of each complaint, and tops it off with a snarky “Hope this helps.” It probably doesn’t help the customer very much, but it helps observers have a laugh when they visit Palmer’s site, where he posts screenshots of his interactions.", "Additional examples of Palmer's work can be viewed here.", "Berkowitz, Joe.   \"A Comedian’s Fake Customer Service Account on Facebook Serves Up Next-Level Trolling.\"\r\n    Fast Company.   14 July 2015.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]