["The Facebook post, which has been viewed more than 1.3 million times since it was posted on January 9, 2019, contains a video of a man slapping another man in the face alongside a screenshot of an Indonesian news report.", "The media report is dated November 12, 2018, and features the logo of Jakarta-based news outlet Poskotanews.com. It is headlined: “Officials have started to record data of mentally-ill patients for election voters’ list”.", "Poskotanews.com did publish an article with an identical headline on November 12.", "The article’s first paragraph says: “Officials from Bekasi’s electoral commission, election monitoring agency and municipal administration visited the Jamrud Biru mental health rehabilitation center November 12 to record patients’ electronic data for the 2019 election voters list.”", "Bekasi is a city near Indonesia’s capital, Jakarta.", "The article does not contain any video clip and there is no evidence to suggest the footage in the misleading Facebook post is linked to the Poskotannews article.", "There is also no evidence suggesting the video shows what is reported in the Poskotanews.com article.", "The video clip has circulated online since at least April 2018.", "The earliest version AFP found of the video was here, on the Dampit TV Facebook page on April 28, 2018.", "The Facebook post is captioned: “Be careful when you sit in a mental hospital. Make sure you’re not slapped in the face.”", "It was then published in this April 29, 2018 article by Indonesia’s Liputan6.com.", "The Liputan6.com article was titled “VIDEO: This man was slapped in the face by a mental hospital patient”.", "Neither story mentions any links between the video and election-related activities.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]