["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "President Donald Trump took a swipe at former President Barack Obama as he renewed his pledge to tackle the opioid epidemic, which claims the lives of tens of thousands of people a year.", "Trump said that opioid overdose deaths have nearly quadrupled since 1999, speaking after a briefing on the issue.", "But while deaths soared, Trump said overall drug prosecutions declined in recent years -- a trend Trump vowed to reverse.", "\"We're going to be bringing them up and bringing them up rapidly,\" he said Aug. 8. \"At the end of 2016, there were 23 percent fewer than in 2011. So they looked at this scourge, and they let it go by, and we're not letting it go by.\"", "We found that Trump is correct that federal drug prosecutions declined from 2011 to 2016 under Obama, but he lacks evidence to prove that’s the culprit for the opioid overdose crisis. A White House spokesman declined to comment on the record.", "The Justice Department filed drug charges against 24,638 defendants in 2016, down 23 percent from 2011, according to the Pew Research Center, which analyzed federal data. The data reflects felonies and some serious misdemeanors.", "But that’s overall drug prosecutions, not just prosecutions related to opioids. And it only includes federal prosecutions -- the vast majority of criminal prosecutions are in state courts.", "We found that the drop was due to some of the specific actions the Obama administration took to stop the prosecution of low-level offenders.", "Pew noted that in 2013, then-Attorney General Eric Holder directed federal prosecutors to ensure that each case they brought served \"a substantial federal interest.\"", "Holder mandated that certain low-level nonviolent drug offenders, with no ties to gangs or cartels, would no longer face mandatory minimum sentences. He called for more treatment and alternatives to prison.", "Also in 2013, U.S. Deputy Attorney General James Cole issued a memorandum to federal attorneys related to prioritizing marijuana prosecutions. He directed attorneys to focus on cartels or other criminal organizations and the use of violence to distribute the drug.", "Federal marijuana prosecutions fell to 5,158 in 2016, down 39 percent from five years earlier, Pew found.", "Trump implied that lack of prosecutions likely led to a worsening of the opioid crisis. But experts we contacted had a different view.", "\"No serious analyst would argue that federal prosecutions have consequences for opioid overdoses,\" said University of Maryland criminology professor Peter Reuter. \"The drivers of that increase are the arrival of fentanyl, since about 2012, and the overprescription of opioids before it. There has been some decline in heroin retail prices. But no prior effort against high-level distributors and traffickers has ever had sustained success at the retail level.\"", "Some drug experts including Dr. Andrew Kolodny, co-director of opioid policy research at Brandeis University's Heller School for Social Policy and Management, have criticized Obama for taking too long to address the crisis, but not because of a lack of prosecutions.", "\"Obama deserves blame for neglecting the epidemic and failing to ensure a coordinated federal response,\" Kolodny said. \"I can think of several areas where it's fair to criticize him. The decline in federal drug prosecutions is not one of them.\"", "Trump has a point that the Obama administration was slow to respond to the opioid crisis, said Jon Caulkins, a Carnegie Mellon professor and expert on drug policy.", "\"Anyone looking at the basic death stats knew we had a problem by 2000,\" Caulkins said. \"So this is a national disgrace, and Obama was in power for eight of the more recent years, and if ‘the buck stops on the president’s desk’ then it’s fair to put some blame there.\"", "A September 2016 report from the Obama administration’s Justice Department found that prosecutors could help combat the epidemic by prioritizing prosecution of heroin distributors and of medical professionals who improperly prescribe opioids. The report also stated that federal prosecution had \"lagged,\" and more prosecutors were needed.", "The report noted, however, that investigations \"can be difficult when the victim is deceased and the source of the drugs is not immediately obvious.\"", "Trump said \"at the end of 2016, there were 23 percent fewer federal prosecutions than in 2011, so (prosecutors) looked at this surge and they let it go by.\" Trump made the statement in the context of rising opioid overdose deaths.", "An analysis of data shows that federal drug charges overall declined 23 percent between 2011 and 2016. But that data doesn’t tell us anything about opioid cases specifically.", "Where Trump misses the mark is his suggestion that the drop in prosecutions is to blame for the opioid epidemic, which started before Obama’s tenure and then grew worse during his presidency. Obama could have done more earlier to address the epidemic, experts said, but there is no evidence that his strategy on federal drug prosecutions led to a spike in opioid overdose deaths.", "We rate this claim Half True.", "White House, \"Remarks by President Trump Before a Briefing on the Opioid Crisis,\" Aug. 8, 2017", "White House, Press Briefing on the Opioid Crisis, Aug. 8, 2017", "PBS, \"President Trump delivers statement on U.S. opioid crisis,\" Aug. 8, 2017", "Pew Research Center, \"Federal criminal prosecutions fall to lowest level in nearly two decades,\" March 28, 2017", "Commission on Combating Drug Addiction and the Opioid Crisis, Interim report, July 31, 2017", "U.S. Department of Justice press release, Attorney General Sessions Announces Opioid Fraud and Abuse Detection Unit, Aug. 2, 2017", "U.S. Surgeon General, Facing addiction in America, 2016", "CDC Morbidity and Mortality weekly report, \"Increases in Drug and Opioid Overdose Deaths — United States, 2000–2014,", "National Conference of State Legislatures, \"Preventing opioid misuse: legislative trends and predictions,\" Jan. 31, 2017", "White House, Press Briefing on the Opioid Crisis, Aug. 8, 2017", "Science Daily Cornell University, \"Opioid abuse drops when doctors check patients’' drug history,\" May 1, 2017", "U.S. Attorney General Eric Holder, Memorandum and speech, Aug. 12, 2013", "Deputy Attorney General James M. Cole, Memorandum, Aug. 29, 2013", "United States Department of Justice Executive Office for United States Attorneys, \"Addressing the Heroin and Opioid Crisis,\" September 2016", "New York Times, \"Vowing Again to Tackle Opioid Crisis, Trump Faults His Predecessor,\" Aug. 8, 2017", "Vox, \"How to stop the deadliest drug overdose crisis in American history,\" Aug. 1, 2017", "The Weekly Standard, \"Trump Declares War on Opioids,\" Aug. 8, 2017", "National Institute on Drug Abuse, \"America’s Addiction to Opioids: Heroin and Prescription Drug Abuse,\" May 14, 2014", "PolitiFact, \"Did federal inmate population drop under Obama for first time since Carter?\" May 18, 2017", "PolitiFact, \"Donald Trump wrong that Hillary Clinton wants to release all violent criminals from prison,\" May 26, 2016", "Interview, Andrew Kolodny, co-director of opioid policy research at Brandeis University's Heller School for Social Policy and Management, Aug. 8, 2017", "Interview, Marc Mauer, Executive Director of the The Sentencing Project, Aug. 8, 2017", "Interview, John Gramlich Writer/editor, Fact Tank at Pew Research Center, Aug. 8, 2017", "Interview, Peter Reuter, professor at the School of Public Policy and Department of Criminology University of Maryland and founder and director of RAND's Drug Policy Research Center from 1989-1993, Aug. 8, 2017", "Interview, Steven Duke, Yale Law professor who teaches and writes on criminal law, criminal procedure, evidence, and drug policy, Aug. 8, 2017", "Interview, Jon Caulkins, a Carnegie Mellon professor of Operations Research and Public Policy, Aug. 8, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]