["About this rating", "This is a genuine video of a whale surfacing while extremely close to a kayak.", "The kayaker was unharmed in this incident.", "In October 2020, a video started circulating on social media that supposedly showed a  humpback whale breaching dangerously close to a woman in a kayak. One popular version of this video with more than 1 million views carried the caption: \"Yo a whale really ate this lady.\"", "This video (which can be viewed in full below) is real. However, the whale did not eat the woman. The kayaker in this video survived unscathed.", "CNN reported that this incident took place off the coast of Avila Beach in California and shows two kayakers who were out whale watching on Nov. 2 when a whale breached a little too close to one of the kayaks.", "CNN writes:", "Julie McSorley and Liz Cottriel were watching humpback whales on Monday when one decided to get up close and personal. A whale came up underneath them and caused them to capsize.", "\"I saw the big pool of fish, the big bait ball come up out of the water,\" McSorley told CNN affiliate KMPH. \"I saw the whale come up. I thought, 'Oh, no! It's too close.'\"", "\"All of a sudden, I lifted up, and I was in the water.\"", "While the video appears to show the whale swallowing or eating the kayakers, both whale watchers escaped unharmed.", "Melissa Newman, a reporter with the California news outlet KSBY, posted two videos of the incident on Twitter:", "While this video is certainly real, it does not show a whale \"eating\" or \"swallowing\" a kayak. Interestingly, this fear — an oversized whale accidentally swallowing an undersized boat — appears to be somewhat common. In 2016, a photoshopped image showing a group of humpback whales breaching dangerously close to a small boat went viral. In 2010, we wrote about a photoshopped image that showed a kayak in the mouth of a breaching humpback whale.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]