["President Donald Trump listens during a roundtable discussion with law enforcement officials on June 8, 2020, in the White House in Washington. (AP/Semansky)", "This is an unsubstantiated conspiracy that made its way from a conservative blog site to Trump via a report on the One America News Network.", "There’s no evidence that Gugino is an “ANTIFA provocateur.” Antifa is a loosely affiliated coalition of anti-fascist groups without a national leader. Antifa activists have a history of attacking police officers and journalists during demonstrations.", "There’s no evidence that the incident was a “set up” or that, in the seconds before police knocked Gugino to the ground, he was using his phone as a “scanner.”", "President Donald Trump tweeted a baseless conspiracy theory about the 75-year-old protester shoved to the ground by police in Buffalo, N.Y., accusing the man whose injury was captured on video of being a member of antifa, trying to disrupt police communications and faking his fall.", "\"Buffalo protester shoved by Police could be an ANTIFA provocateur,\" Trump said in the June 9 tweet, which he posted with no supporting evidence. \"75 year old Martin Gugino was pushed away after appearing to scan police communications in order to black out the equipment.\"", "Buffalo protester shoved by Police could be an ANTIFA provocateur. 75 year old Martin Gugino was pushed away after appearing to scan police communications in order to black out the equipment. @OANN I watched, he fell harder than was pushed. Was aiming scanner. Could be a set up?", "The president referenced a TV segment from One America News Network, a cable network that has \"repeatedly published false or misleading information,\" according to NewGuard, a company that monitors news outlets.", "\"I watched,\" Trump wrote. \"He fell harder than was pushed. Was aiming scanner. Could be a set up?\"", "The OANN segment cited a conservative blog post. It claimed Gugino was \"using his phone as a capture scanner\" to \"monitor the location of police\" before he was pushed to the ground.", "Here's the absolutely insane OAN report that Trump is referencing: \"The latest tensions in the Buffalo police department could be the result of a false flag provocation by far left group antifa\" pic.twitter.com/d709XfSj8U", "Sage Green, who knows Gugino through activism work in Buffalo, said she never knew him to be related to any antifa-type work, nor to be savvy with technology.", "\"I’ve never known him to be someone who has any radical tactics,\" Green said. \"He’s not the troublemaker in the crowd.\"", "There’s no evidence that Gugino was trying to \"scan police communications\" before he was shoved — or that Gugino’s fall, which left him bleeding from his ear and resulted in second-degree assault charges against two officers, was part of \"a set up.\"", "\"Not a piece of proof,\" said New York Gov. Andrew Cuomo in a press conference.", "Kelly V. Zarcone, Gugino’s attorney, said in a statement that Gugino has \"always been a peaceful protester.\"", "\"No one from law enforcement has even suggested anything otherwise, so we are at a loss to understand why the president of the United States would make such dark, dangerous, and untrue accusations against him,\" she said.", "The Trump campaign did not respond to requests for comment.", "A roughly 40-second video of the incident — which Buffalo police initially described as a \"skirmish involving protesters\" in which Gugino \"tripped and fell\" — was captured by WBFO’s Mike Desmond on June 4. The video is graphic, but can be viewed here.", "The video shows Gugino approaching a line of police officers with a phone in his right hand and what looks like a helmet in his left. Gugino stands face-to-face with a pair of officers and talks for a few seconds as a third officer shouts for Gugino to move.", "One officer shoves Gugino with a baton while another pushes him with his hand. The force sends Gugino stumbling backward and hitting the ground hard.", "\"He’s bleeding out of his ear,\" a person says repeatedly as Gugino lays motionless and blood pools on the pavement beneath him.", "Zarcone, Gugino’s attorney, said Gugino remains hospitalized.", "The incident is under both internal affairs and criminal investigations, and the two officers facing charges have been suspended without pay. More than 50 members of the Buffalo police riot response team have since resigned from the unit but are still working for the department.", "The Buffalo Police Department and a spokesperson for the Erie County district attorney’s office both told us they could not comment on the case pending investigations.", "Gugino has worked on causes around Buffalo through PUSH Buffalo, the Western New York Peace Center and other organizations. The Buffalo News reported that he is also involved in Catholic peace activism and nuclear disarmament.", "Three activists who have worked with Gugino described him as willing to be involved in a range of social justice causes but said he was not an agitator.", "\"From what I know of Martin, he has never spoken to me with being affiliated with antifa-type work,\" Green said.", "In a statement to PolitiFact, OANN’s Pearson Sharp said the network is working on another report detailing Gugino’s background as an activist.", "\"We have found substantial evidence that suggests Martin Gugino is, if not a professional provocateur, at least an enthusiastic one,\" Sharp told PolitiFact, citing past tweets, arrest records, and comments he said others made about Gugino.", "The blog post cited by OANN includes a since-deleted tweet from Gugino saying, \"F--- the police.\" The Buffalo News reported that the Twitter account belonged to Gugino. Another tweet featured an anti-police hashtag.", "The blog post also linked to Gugino’s personal blog, where he says he’s been arrested — but not convicted — for participating in prior protests.", "OANN’s Sharp said Buffalo Mayor Byron Brown called Gugino an \"agitator\" and a \"key and major instigator,\" adding that Brown wouldn’t \"single someone out like that without good reason.\" But in those comments, Brown was talking about a different protester.", "Trump’s claims that the incident was a \"set up\" and that Gugino was waving his phone in an attempt to scan police communications are similarly unsubstantiated, with the only proof being that Gugino was holding a phone at the moment that he was pushed.", "There are several mobile apps that let users listen to police scanners, and as the Washington Post noted, the Buffalo police radio frequencies are publicly available online. These apps don’t give users the ability to \"black out the equipment,\" according to BBC News.", "Green, Gugino’s friend, said she didn’t think Gugino had any capability to interfere with police communications.", "The OANN segment said \"newly released videos appear to show Gugino using a police tracker on his phone, trying to scan police communications.\" But the segment showed only an edited version of the original video that was slowed down.", "The OANN segment — and the blog post it pulled from — also highlighted a photo of Gugino standing beside WBFO’s Desmond, as well as a separate Twitter video that shows an unidentified protester saying, \"He’s looking to get punched in the face.\"", "But that doesn’t substantiate Trump’s claims about a \"set up\" and a \"scanner,\" either.", "Trump said, \"Buffalo protester shoved by Police could be an ANTIFA provocateur. 75 year old Martin Gugino was pushed away after appearing to scan police communications in order to black out the equipment ... Was aiming scanner. Could be a set up?\"", "This is an unsubstantiated conspiracy that made its way from a conservative blog site to Trump via One America News Network. There’s no evidence that Gugino is connected to antifa, that he was \"aiming (a) scanner\" or that he was staging his fall as \"a set up.\"", "We rate this statement False.", "Donald J. Trump on Twitter, June 9, 2020", "Lis Power on Twitter, June 9, 2020", "Dan Telvock on Twitter, June 9, 2020", "The Conservative Treehouse, \"Buffalo Officials Duped By Professional Antifa Provocateur – Arrest and Charge Two Police Officers – Righteous Police Team Stand Together and Walk Out…\" June 6, 2020", "The Daily Beast, \"Trump Spreads Baseless Conspiracy Theory That Video of Buffalo Cops Shoving Elderly Man Was Antifa ‘Set Up,'\" June 9, 2020", "The Buffalo News, \"Who is injured protester Martin Gugino? Here's what we know,\" June 9, 2020", "The Washington Post, \"Trump tweets outrageous conspiracy theory about injured Buffalo man,\" June 9, 2020", "The Buffalo News, \"Trump, without evidence, claims Gugino 'could be an ANTIFA provocateur,'\" June 9, 2020", "CNN, \"Lawyer for Buffalo man pushed by officers says she's 'at a loss to understand' Trump's tweet,\" June 9, 2020", "BBC News, \"Martin Gugino: Donald Trump's police scanner tweet fact-checked,\" June 9, 2020", "WKBW, \"President Trump tweets about Buffalo protester Martin Gugino,\" June 9, 2020", "The Washington Post, \"Trump sides with deranged conspiracy theories over Black Lives Matter protesters,\" June 9, 2020", "Byron W. Brown on Twitter, June 9, 2020", "The Buffalo News, \"Protester pushed to ground by police is longtime peace activist from Amherst,\" June 5, 2020", "The Buffalo News, \"'Buffalo, you got problems,' says man tackled from behind by police,\" June 5, 2020", "Tweet, June 5, 2020", "WBEN Radio, \"Mayor Addresses Police Incident, Contingency Plan,\" June 5, 2020", "WBFO on YouTube, \"Two Buffalo police officers shove a man to the ground in front of City Hall (WARNING: GRAPHIC),\" June 4, 2020", "Vice News, \"Thousands of People Are Monitoring Police Scanners During the George Floyd Protests,\" June 1, 2020", "Email interview with Pearson Sharp, writer at One America News Network, June 9, 2020", "Phone interview with John Washington, organizer, People’s Action, June 9, 2020", "Phone interview with Harper Bishop, activist, June 9, 2020", "Phone interview with Sage Green, former program manager of PUSH Buffalo, June 9, 2020", "Phone Interview with Jeff Rinaldo, captain of the Buffalo Police Department, June 9, 2020", "Email interview with Kait Munro, public information officer at the Eric County District Attorney, June 9, 2020", "Email interview with Kelly V. Zarcone, attorney at Lipman & Zarcone, PLLC, June 9, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]