["By Brooks Jackson", "Posted on August 1, 2018", "President Donald Trump is saying that the U.S. balance of trade improved by a “tremendous” $52 billion in the second quarter of 2018. But the correct figure is much smaller — $22 billion — as two economists with expertise in trade statistics have confirmed for us.", "Actually, the government hasn’t yet released its official trade figures for the second quarter. The Bureau of Economic Analysis has only released figures covering through the end of May, and it will publish June (and second quarter) figures Aug. 3.", "So where does Trump get the notion that “the quarterly trade deficit has been reduced by $52 billion,” when it hasn’t?", "That figure comes from the trade components of the BEA’s estimate of gross domestic product released July 27. That’s OK, in theory; the GDP trade figures closely parallel the more commonly used “trade in goods and services” figures from BEA. The two differ only a little, due to differing coverage, definitions and timing of revisions. For example, the GDP figures count goods shipped between Puerto Rico and the 50 states as U.S. exports and imports, while the official trade figures count the island as part of the US.", "But Trump — or whoever came up with this figure — makes a couple of rookie errors in his calculations.", "Most important, the trade components of the quarterly GDP figures he uses are stated as annual rates, not as the actual value of imports and exports during the quarter. They are, in other words, four times larger than the actual value of imports and exports for the quarter.", "Also, Trump takes his figure from table 3b, which gives “real” or inflation-adjusted figures for net exports of goods and services. These are stated in 2012 dollars, not today’s dollars.", "Correcting Trump’s mistakes — taking the figures from table 3a to get the annual-rate figures in today’s dollars, and dividing by four to get the actual value of imports and exports for the quarter — shows a drop in the second-quarter trade deficit of $21.7 billion from the previous quarter.", "That’s notable to be sure. The trade deficit — which totaled more than $570 billion during the most recent 12 months on record — has been going down since March, after rising at the beginning of 2018. It dropped 6.6 percent in May alone, as we noted in our recent update of “Trump’s Numbers” (though, as we explained, exporters may have been trying to beat retaliatory tariffs from China). The deficit in the most recent three months on record (March, April and May) was nearly $24 billion less than in the three months immediately preceding, a drop of 15 percent.", "But Trump’s mistaken figure of a $52 billion quarterly drop is a big exaggeration. We checked our calculations with two economists, who agreed.", "“I got the same number as you got ($21.7 billion/quarter) using BEA quarterly data,” said Lucy Lu, a research analyst at the Peterson Institute for International Economics, in an email exchange.", "And a government economist familiar with trade statistics told us, “you are correct to focus on current-dollar values,” not the 2012 dollars Trump uses, adding: “And, as you note, the GDP data are reported at annual rates. Simply dividing those values by 4 will result in quarterly rates.” Trump did not do that. (This economist did not wish to be named or identified by agency.)", "Nevertheless, Trump has been repeating his bogus figure enthusiastically. In his July 27 remarks touting the GDP report, he called it “one of the biggest wins”  and “a tremendous drop.” And at a July 30 press conference with Italy’s prime minister, he again boasted of a “52 billion reduction in the trade deficit for the quarter.”", "Trump also said the $52 billion figure “was not reported very much.” Turns out, there’s good reason for that. The figure is wrong.", "Update, Aug. 3: The BEA released its June figures for trade in goods and services. Those figures show that the trade deficit went down by $20 billion from the first quarter of 2018 to the second quarter (see Exhibit 1).", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]