["About this rating", "The 100+ mph winds of Typhoon Manghut destroyed homes, caused landslides, and left dozens of people dead when it swept across Southern China in mid-September 2018. As footage of the destruction started making its way online, millions of viewers came across a dramatic video which purportedly showed a DragonAir B-737 airliners being tossed about in the typhoon-force winds as it struggled to land at an airport:", "WATCH: Pilot amazingly saves his passengers’ lives during a typhoon", "But this video was not real: it was a combination of computer-generated graphics and genuine footage of an unrelated airliner incident.", "The first segment of the video was created by \"MeniThings,\" a production company which specializes in CGI and frequently posts content about UFOs and alien encounters. This video was originally shared to YouTube under the title \"Extreme Crosswind | Airliner spins 360\" and filed under the \"entertainment\" tag:", "Meni Tsirbas, the director and owner of MeniThings, confirmed that this portion of the video was CGI when he retweeted a message from @UFOInterest explaining how the video was made:", "The second portion of the video shows a real, albeit unrelated, incident that was filmed at Shenzhen airport in August 2018. Reuters reported that a passenger plane operated by Capital Airlines was en route from Beijing to Macao when it encountered wind shear and was forced to make an emergency landing.", "AIRLive.net also reported of the event that:", "Capital Airlines flight #JD5759 from Beijing to Macao was damaged in a hard landing attempt during windshear at Macao Airport.", "Parts of the nose gear broke away and hit the left engine during the landing attempt.", "The Airbus A320 (reg. B-6952) diverted to Shenzhen, where it landed safely.", "One of the airport’s two runways was shut after emergency landing the other runway was operating normally.", "Five passengers were slightly injured.", "Some of the same footage used in the viral hoax video can be seen in this video report from China Global Television Network:", "BBC News.   \"Typhoon Mangkhut: South China Battered by Deadly Storm.\"\r\n    17 September 2018.", "Reuters.   \"Chinese Passenger Plane Makes Emergency Landing Minus Two Wheels.\"\r\n    28 August 2018.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]