["About this rating", "As tensions rose in September 2017 in response to football players' protesting police brutality and inequality by kneeling during the U.S. national anthem, astronaut and former football player Leland Melvin jumped into the fray with a lengthy open letter to president Donald Trump. During a September speech in Alabama, Trump had called for a boycott of the National Football League (NFL), saying:", "Wouldn’t you love one of the NFL owners when someone disrespects our flag, ‘get that son of a bitch off the field right now' . . . If you see it, leave the stadium, I guarantee things will stop.", "Trump's words heightened emotions on both sides of the issue, but for athletes and team owners, it seemed to heighten solidarity and even spread the protest to as quarterback Tom Brady and National Basketball Association players Steph Curry and Lebron James spoke out against Trump. Amidst all this, a lengthy open letter to the President purportedly penned by astronaut and former NFL Player Leland Melvin came to light:", "To Donald Trump", "I believe in the Declaration of Independence and the Constitution of this country even though at the time they were drafted, their tenets of life, liberty justice for all and eventual freedom of speech, religion, assembly, press and petition amendment ratified in Dec 1791, only applied to a select group of people and not ones that looked like me. Donald Trump I listened to your Alabama rally rant and could not believe how easily you say what you say. We have become numb to your outlandish acts, tweets and recent retweet of you knocking down Hillary Clinton with a golf ball that you hit. Donald Trump your boorish and disgusting actions are not funny. They actually promote violence against women especially when your followers act out what you say.", "I used to walk the grounds of UVA in Charlottesville, VA as a graduate student only to watch in horror as those same grounds became a battlefield being trod by Nazi and anti-Semitic worshippers armed with assault style weapons ready to fight to make America White again. (their words). You actually said there were nice people on both sides. People armed and ready to kill other Americans for the purpose of eradicating Blacks, Jews, Hispanics, Mexicans, Asians, Latinas and even the first real Americans, Native Americans to make America Great Again were “nice people”? Verses what you say in condemnation of an unarmed black man peacefully protesting by exercising his constitutional First Amendment rights by silently taking a knee is appalling, unnerving and reprehensible. You called Colin Kaepernick “a son-of-a-bitch.” And said he should be fired. You are basically calling his white mother a bitch. The strong contrast in language for a black man and a Nazi is very telling. Do you have any sense of decency or shame in what you say to the American people that are part of your duty to serve respectfully with dignity, presidentially?", "The National Anthem that we listen too has been edited to try not to offend because when Francis Scott Key penned the song he watched freed slaves fighting for the British and wrote this stanza:", "“And where is that band who so vauntingly swore,\nThat the havoc of war and the battle’s confusion\nA home and a Country should leave us no more?\nTheir blood has wash’d out their foul footstep’s pollution.\nNo refuge could save the hireling and slave\nFrom the terror of flight or the gloom of the grave,\nAnd the star-spangled banner in triumph doth wave\nO’er the land of the free and the home of the brave.”", "I guess if I were a slave back then I probably would have done anything to obtain freedom from my American oppressors who were whipping, killing, raping, dismembering, hanging or releasing the dogs on people like me all under our Constitution. In 1814 former slaves fought with the British for their freedom from their American enslavers and Key witnessed a battle from a ship off the Maryland shore at Fort McHenry which inspired him to write what became our National Anthem.", "I served my country not in the military but as 1 of 362 American Astronauts that have explored the universe to help advance our civilization. Not just Americans but all humans. I also was briefly in the NFL and stood for the National Anthem with my hand over my heart. What makes us great is our differences and respecting that we are all created equally even if not always treated that way. Looking back at our planet from space really helps one get a bigger perspective on how petty and divisive we can be. Donald Trump maybe you should ask your good friend Mr. Putin to give you a ride on a Soyuz rocket to our International Space Station and see what it’s like to work together with people we used to fight against, where your life depends on it. See the world and get a greater sense of what it means to be part of the human race, we call it the Orbital Perspective.", "Donald Trump please know that you are supposed to be a unifier and a compassionate and empathetic leader. If you can’t do the job then please step down and let someone else try. I pray that you do the right thing. May God bless you.", "Sincerely,\nLeland Melvin\nFormer Astronaut and \nNFL Player", "It's unclear why this particular response was met with skepticism, but several readers wrote in to ask us if the letter was authentic. It's possible that many were unfamiliar with Melvin. Some may have also questioned the authenticity of the national anthem stanza mentioned by the former NFL Player (it is indeed part of the song). The length of Melvin's post, which was significantly longer than most of the other responses that circulated on social media, may have also raised some doubts.", "However, this open letter was truly written by Leland Melvin. It was originally posted to his Facebook page on 23 September 2017:", "Melvin also shared his letter on Twitter:", "To @realDonaldTrump\nI believe in the Declaration of Independence and the Constitution of this country even... https://t.co/FezF6vqZuO pic.twitter.com/VUGdZa7lL0", "— Leland Melvin (@Astro_Flow) September 23, 2017", "Belson, Ken.   \"Trump Attacks Warriors’ Curry. LeBron James’s Retort: ‘U Bum.’\"\r\n    New York Times.   23 September 2017.", "Wright, David.   \"Tom Brady Calls Trump's Comments 'Divisive,' Backs Protests.\"\r\n    CNN.   25 September 2017.", "Jacobs, Ben.   \"Kim Jong-un, the NFL and 'Screaming at Senators': Trump's Strange Night in Alabama.\"\r\n    The Guardian.   23 September 2017.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]