["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Former coal miner Chuck Nelson looks out on an impoundment of coal slurry in Raleigh County, W.Va., which he says is polluting the groundwater. (AP)", "• In standard federal government rankings of drinking water quality and child mortality, West Virginia ranks among the bottom five states.", "• The state also ranked no higher than ninth from the bottom in several common math and reading tests for the National Assessment of Educational Progress.", "• However, a measure of the state’s high-school graduation rate shows West Virginia among the nation’s best.", "Paula Jean Swearengin, the Democrat who challenged Sen. Shelley Moore Capito, R-W.Va., in 2020, took to Twitter to argue that their state needs to improve its standing in some key quality-of-life metrics.", "Swearengin was replying to a tweet by Andrew Yang, who ran in the Democratic presidential primary earlier this year. Yang had tweeted, \"America is 33rd in access to quality education, 33rd in child mortality and 31st in clean drinking water. But our stock market is up.\"", "In her Sept. 10 reply tweet, Swearengin brought home those metrics for West Virginia voters. \"West Virginia is near last in the U.S. in these rankings. There are conditions in this state comparable to a 3rd world country. Our incumbents have done nothing but line their pockets with dark money while we suffer.\"", "West Virginia is near last in the US in these rankings. There are conditions in this state comparable to a 3rd world country. Our incumbents have done nothing but line their pockets with dark money while we suffer. #NoMoore #WestVirginia https://t.co/Tx7XYj2M3Y", "We decided to check whether credible rankings show West Virginia to be \"near last in the U.S.\" in all three areas. We’ll address them one by one. (Swearengin’s campaign did not respond to inquiries. She eventually lost the election to Capito.)", "Statistics for K-12 graduation rates differ somewhat, depending on how you measure them, and as we’ve reported previously, no measure is foolproof.", "Still, West Virginia performs well in a measure that analyzes the \"cohort\" of students entering school in a given year and then follows them to see whether they graduate, adjusting for students who move in and out of the state. By this measure, West Virginia was one of only seven states in the U.S. to reach a 90% graduation rate for the 2017-18 class.", "Another closely watched metric for K-12 education is the National Assessment of Educational Progress, a national test of scholastic achievement at various grades.", "In both fourth-grade and eighth-grade math, West Virginia ranked fourth from the bottom among the 50 states in 2019. In fourth-grade reading, West Virginia was ninth from the bottom, and fourth from the bottom among eighth graders.", "So West Virginia has uniformly poor rankings in national standardized testing.", "Independent analyses suggest a broadly similar picture. An analysis by U.S. News and World Report, using these statistics and a few others, ranked West Virginia 42nd in the nation overall on K-12 education. Another analysis, by the website WalletHub, used 33 metrics to evaluate schools by state. In the metrics for educational \"quality,\" West Virginia ranked 45th nationally.", "The metrics we cited above on education are \"reasonable ones to use,\" said David Bills, a professor at the University of Iowa College of Education.", "The Environmental Protection Agency measures the number of violations by public water systems per 1,000 residents in 2017. West Virginia ranked 46th among the 50 states on this metric that year. The only states ranking lower were Maine, Vermont, Montana and Alaska.", "According to data compiled by the Centers for Disease Control and Prevention, West Virginia ranked fifth worst among the 50 states for child mortality in 2018. The only states with worse rates were South Carolina, Arkansas, Louisiana and Mississippi.", "Swearengin said, \"West Virginia is near last in the U.S.\" rankings of education, clean drinking water and child mortality.", "In standard federal government rankings of drinking water and child mortality, West Virginia does rank in the bottom five states. It also ranked no higher than ninth from the bottom in several common math and reading tests for the National Assessment of Educational Progress.", "But by one measure, the state’s high-school graduation rate is among the nation’s best.", "On balance, we rate the statement Mostly True.", "Paula Jean Swearengin, tweet, Sept. 10, 2020", "U.S. Education Department, \"Public High School Graduation Rates,\" 2020", "National Assessment of Educational Progress, main page, accessed Nov. 3, 2020", "Environmental Protection Agency, \"Analyze Trends: Drinking Water Dashboard,\" accessed Nov. 3, 2020", "Centers for Disease Control and Prevention, \"Infant Mortality Rates by State,\" accessed Nov. 3, 2020", "U.S. News and World Report, \"Air and Water Quality Rankings,\" accessed Nov. 3, 2020", "U.S. News and World Report, \"Pre-K-12 Rankings,\" accessed Nov. 3, 2020", "WalletHub, \"States with the Best & Worst School Systems,\" July 27, 2020", "Email interview with David Bills, professor at the University of Iowa College of Education, Nov. 6, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]