["A Facebook post claims that vaccine maker Johnson & Johnson has failed to update the public on why “volunteers” fell ill during the trials of its Covid-19 shot in 2020, an event that brought a temporary halt to clinical testing. This claim is misleading; only one trial participant reportedly fell sick, and while the illness remains unexplained, the company released a statement of its findings in October 2020 that ruled out the vaccine as a cause.", "The caption of a Facebook post from February 20, 2021 reads: “Johnson & Johnson Trials Were Also Paused, Due To Volunteers Getting Sick From An Unknown Disease. Johnson & Johnson Said They Will Share More Information About The Disease After Learning More About It, Till This Day Johnson & Johnson Never Came Back With The Information (sic)”.", "The post, which was shared more than 170 times, includes a screenshot of an October 2020 Fox Business article.", "On October 13, 2020, Johnson & Johnson announced it had temporarily halted its Covid-19 vaccine trial in the United States because one of its 44,000 participants fell sick, as AFP reported.", "“We have temporarily paused further dosing in all our Covid-19 vaccine candidate clinical trials, including the Phase 3 ENSEMBLE trial, due to an unexplained illness in a study participant”, the company said in a statement.", "A report here by The New York Times noted that it was unclear whether the person who fell ill had received a placebo or the candidate vaccine.", "On October 23, 2020, Johnson & Johnson updated their statement, announcing that the company would resume the trial after “a thorough evaluation of a serious medical event experienced by one study participant”.", "While the company said it could not identify “a clear cause”, Johnson & Johnson indicated that the vaccine was likely not to blame.", "“There are many possible factors that could have caused the event. Based on the information gathered to date and the input of independent experts, the company has found no evidence that the vaccine candidate caused the event.”", "According to the Washington Post, the trial volunteer who fell ill was a man who suffered a stroke. Independent investigators determined the stroke was unrelated to the vaccine.", "Halting a trial in these circumstances is normal, possibly even encouraging, as David Lo, professor of biomedical sciences at the University of California, Riverside, told AFP after the Oxford-AstraZeneca vaccine trial was paused in September 2020.", "“Probably right now it’s just being cautious – it’s a pause, it’s not the same thing as saying, ‘We can't move forward’”, Lo said.", "“In some ways I’m quite relieved, it means they’re really paying attention,” he added.", "The misleading post further claimed that “South Africa Became The First Country To Use The Unapproved Vaccine & Without Telling It's Citizens How The Vaccine Trials Went (sic)\".", "This is misleading. On February 17, 2021, South Africa’s President Cyril Ramaphosa was among the first to receive the Covid-19 vaccine manufactured by Janssen Pharmaceutical Companies of Johnson & Johnson.", "“Taking the vaccine was quick, easy and not so painful,” he tweeted, along with a two-minute video of the shot being administered. “I urge all our healthcare workers to register to receive their vaccinations as they are our first line of defence against the coronavirus pandemic.”", "Taking the vaccine was quick, easy and not so painful. I urge all our healthcare workers to register to receive their vaccinations as they are our first line of defence against the coronavirus pandemic. #WeChooseVacciNation #VaccineforSouthAfrica ?? pic.twitter.com/11tyl1f9Xs", "A day later, the South African government announced in a statement that the Johnson & Johnson trial results had been released in early February 2021 and that “applications for licensing were underway in the United States, Europe and South Africa”.", "In the meantime, the government explained that the country’s “Sisonke” national vaccination programme for public sector healthcare workers allowed them to make vaccines immediately available to consenting healthcare workers. This would be classified as a research study.", "“Sisonke is not the same as a clinical trial, rather a way that research can help to make it available while the licensing process takes place”, the government’s statement said.", "This decision was also explained two days earlier in a fact sheet released on the South African Medical Research Council’s website published on February 16, 2021.", "According to the statement by the South African government, officials gave this programme the green light “because it would be unethical to withhold a vaccine known to be safe and effective”.", "“It is important to understand that the fact that it is not yet licenced does not mean that it is not safe or effective\", the statement adds.", "The South African Health Products Regulatory Authority (SAHPRA) approved the use of the vaccine for the programme as a study in the interim.", "SAHPRA has approved a Phase IIIb extension of the completed Phase III J&J study to allow for a limited rollout of the J&J vaccine to health workers at the frontline of the Covid-19 pandemic.", "On February 27, 2021, the US Food and Drug Administration issued an emergency use authorization (EUA) for Johnson & Johnson’s vaccine to be distributed in the United States for people 18 and older.", "An EUA is used to facilitate the availability of medication, including vaccines, during public health emergencies such as the Covid-19 pandemic.", "The European Medicines Agency (EMA) is also expected to give its recommendation for the Johnson & Johnson Covid-19 shot on March 11, 2021.", "[Thread] 1. How long will it take for the J&J #CovidVaccine to be approved for full registration so we can use it for wider roll-out (outside a study setting) and is there a way around it? https://t.co/EKagko2MFp", "AFP Fact Check previously debunked a false claim from the same Facebook account about the Moderna and Pfizer-BioNTech Covid-19 vaccines.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]