["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Nothing in the bill would give any bonus to members of the House or Senate.", "The $1.9 trillion coronavirus pandemic relief package includes nontaxable stimulus checks of $1,400 for many Americans.", "An image widely shared on Facebook claims the American Rescue Plan would also give $25 million to members of the House of Representatives.", "The image states:", "\"Did you know? Line 17 of the $1.9 TRILLION CV #Stimulus awards a $25 MILLION BONUS to House Reps?\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "H.R.1319, a 628-page bill divided into sections, contains hundreds of Line 17s. Congress isn’t mentioned. The House of Representatives is mentioned exactly once, in the first sentence — a reference to the fact that the version of the bill taken up by the Senate came from the House.", "Nothing in the legislation would bestow a bonus of any kind to House members.", "In March 2020, a widely shared Facebook post claimed that a $2 trillion COVID-19 relief package that President Donald Trump was about to sign contained $25 million in pay raises for Congress.", "There was nothing in that legislation that gave a pay raise to members of Congress, and we rated the post Pants on Fire!", "Same here.", "The claim that the new stimulus contains a $25 million bonus for House members is false and ridiculous. We rate it Pants on Fire!", "Facebook, post, March 7, 2021", "Congress.gov, H.R.1319, accessed March 10, 2021", "Associated, Press, \"House members were not given bonuses in $1.9T COVID bill,\" March 9, 2021", "Check Your Fact, \"Fact Check: Does The $1.9 Trillion Covid-19 Stimulus Bill Include A $25 Million Bonus For House Members?\", March 10, 2021", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]