["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Burlington Mayor Miro Weinberger speaks to the city council on April 1, 2019. Photo by Glenn Russell/VTDigger", "Burlington’s efforts to fight the opioid epidemic have earned the city national attention, with Mayor Miro Weinberger and other officials touting the 50 percent decrease in opioid deaths between 2017 and 2018 in Chittenden County.", "During Weinberger’s State of the City address Monday, the mayor called on the Legislature to pass H.162, a bill which would make it legal to possess buprenorphine without a prescription. Chittenden County State’s Attorney Sarah George announced in June 2018 that her office would no longer prosecute those arrested for possessing unprescribed buprenorphine.", "But H.162 has been met with opposition by some who argue that legalizing buprenorphine will increase the supply of an opiate that could still be abused. U.S. Attorney Christina Nolan has said she believes that more people will start using buprenorphine outside of the medical context if it is legalized.", "Vermont health commissioner has said legalizing the anti-addiction drug would be a good idea in any state, apart from Vermont, where he says opioid addiction treatment is accessible to everyone.", "Weinberger argued in his state of the city speech that the public health questions are beyond doubt. \"The public health science is clear that the use of of the addiction medicine buprenorphine saves lives whether that use has been prescribed or not,\" he said.", "So is Weinberger right that the public health science is clear that buprenorphine, whether it has been prescribed or not, saves lives? VTDigger decided to check it out.", "Olivia LaVecchia, Weinberger’s spokesperson, provided a briefing reviewing the literature on non-prescribed buprenorphine the city has relied on by a team at Johns Hopkins University.", "The review includes 13 articles, which overwhelmingly found that those using non-prescribed buprenorphine were using it to treat withdrawal symptoms and rarely using it to get high. The studies also found that non-medically prescribed buprenorphine is often used to self-treat opioid addiction", "For example, one 2013 study of buprenorphine use in Baltimore found that 91% of people who used street-obtained buprenorphine were attempting to manage withdrawal symptoms and only 2% were using it to get high.", "Use of non-prescribed buprenorphine is also associated with an increased interest in treatment and is associated with the inability to access treatment, the review found.", "A 2018 study in Rhode Island found that almost 80% of people using diverted buprenorphine were self-treating opioid use disorder or managing withdrawal symptoms. This study also found that using diverted buprenorphine was positively tied to later seeking treatment, which the authors believed showed that unprescribed buprenorphine use illustrated a severe treatment shortage.", "The mayor’s office also pointed us in the direction of Josh Sharfstein, a vice dean and professor at Johns Hopkins Bloomberg School of Public Health, who was a panelist at the city’s Opioid Town Hall in March and has been advising the city on buprenorphine.", "Sharfstein said devoid of all context, Weinberger’s statement could raise some questions, because buprenorphine use does have risks.", "But Burlington has a major opioid use problem, Sharfstein said, and studies show that those using unprescribed buprenorphine are using it to stave off withdrawal, not to feel euphoria.", "Sharfstein said the public health science is clear that use of unprescribed buprenorphine is an indicator for seeking treatment.", "While visiting Burlington last month, Sharfstein said he spoke to an emergency room doctor at the University of Vermont Medical Center who told him people are showing up in the emergency room asking for buprenorphine after using unprescribed buprenorphine on the street.", "\"When read in the specific context, I think it’s a reasonable statement, understanding that for the people the mayor is talking about, buprenorphine is an alternative to heroin and fentanyl,\" Sharfstein said.", "But is the science really clear that unprescribed buprenorphine decreases mortality rates?", "\"I am not aware of any literature looking at the efficacy of non-prescribed buprenorphine for decreasing mortality in patients with opioid use disorders,\" said Daniel Alford, a professor at the Boston University School of Medicine who has researched treatment of opioid dependence.", "Sharfstein said that he’s not aware of any studies specifically looking at the use of unprescribed buprenorphine and mortality rates. But he said that because the science is clear that use of unprescribed buprenorphine increases the likelihood of going to treatment, it would follow that going to treatment increases the likelihood of survival.", "\"There are studies about non-prescription buprenorphine and going into treatment, and studies that going into treatment decreases mortality,\" Sharfstein said.", "Our ruling", "Experts say there haven’t been any studies of unprescribed buprenorphine use on mortality rates, so saying the science is clear on that question isn’t a complete slam dunk.", "But studies suggest that unprescribed buprenorphine use is an indicator for seeking treatment, and getting treatment is proven to increase survival rates.", "Plus, using buprenorphine does not carry the same risk of overdose death as heroin and fentanyl, which is often the alternative for those with substance use disorder.", "We rate Weinberger’s statement Mostly True.", "VTDigger, \"Burlington leaders draw praise for efforts to stem opioid epidemic,\" March 20, 2019", "VTDigger, \"The Deeper Dig: Drawing the line on recovery drugs,\" March 1, 2019.", "VTDigger, \"Health commissioner says decriminalizing buprenorphine is a good idea – but not in Vermont.\" April 2, 2019", "VTDigger, \"Burlington mayor highlights improved finances and infrastructure in key speech,\" April 2, 2019", "VTDigger, \"Chittenden County opioid deaths drop 50 percent,\" February 14, 2019.", "New York Times, \"When an Iowa Family Doctor Takes on the Opioid Epidemic,\" June 23, 2019.", "Vice, \"Doctors Should Be Handing Out Addiction Meds on Demand,\" June 26, 2018.", "Addictive Behaviors, \"Prevalence and correlates of street-obtained buprenorphine use among current and former injectors in Baltimore, Maryland,\" December 2013.", "Journal of Addiction Medicine \"The More Things Change: Buprenorphine/naloxone Diversion Continues While Treatment Remains Inaccessible,\" Nov/Dec 2018.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]