["Accompanying an array of images in a recent Facebook post, including photos of civil court filings, screenshots of tweets, and a picture of U.S. House Speaker Nancy Pelosi, is one explosive allegation: that the California Democrat was arrested.", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "There are screenshots of several tweets from one account in the Facebook post, including these:", "\"BREAKING While leaving the US Capitol nancy Pelosi has been intercepted by US Marshals and ARRESTED (!) under the direct order of President Trump. WH claims ripping up speech was violation of decorum provision of Rule XIX!\"", "\"Marshals holding Pelosi are NOT(!) allowing her a phone call or to contact her attorneys. Chuck Schumer is racing back to the US capitol. White House sources say that she will be transported to undisclosed location TONIGHT (!) to face MILITARY TRIBUNAL (!!!)\"", "First of all, Pelosi didn’t break the law when she tore up a copy of President Donald Trump’s State of the Union address on Feb. 4. Trump, among others, wrongly claimed it was illegal.", "And while some people have signed a Change.org petition calling for her arrest after she ripped up her copy of the president’s speech, no arrest has happened. We found no news coverage online about Pelosi being taken into custody. If she had been arrested, it would have drawn plenty of media attention.", "We rate this Facebook post Pants on Fire!", "Facebook post, Feb. 7, 2020", "Tweet, Feb. 4, 2020", "Tweet, Feb. 4, 2020", "Tweet, Feb. 5, 2020", "PolitiFact, Donald Trump says Nancy Pelosi’s speech tear was illegal. That’s wrong, Feb. 7, 2020", "PolitiFact, Charlie Kirk wrongly suggests Pelosi broke law by ripping Trump State of the Union speech, Feb. 5, 2020", "Change.org, Have Nancy Pelosi arrested for destruction of government property, visited Feb. 18, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]