["About this rating", "On 25 August 2014, the Colombian Navy, in collaboration with the Office of the Attorney General of Colombia (CTI), reported the seizure of roughly 90 pounds (~40 kilograms) of cocaine hidden in the anchor chain storage space of a dry bulk transport boat named the Ping May (as translated from Spanish):", "Units of the National Navy ... with personnel of the CTI ... seized 39.8 kilograms of cocaine hydrochloride on board the coal transport vessel \"Ping May\" ... The inspection of the vessel, which was anchored in the Ciénaga-Magdalena sector ... found ... 40 packages containing the alkaloid, which were located in the chain store ... The \"Ping May\" coal ship arrived in Colombia six days ago, coming from England and heading to the port of Rotterdam - Holland.", "No arrests have been made in this case, and the amount of cocaine seized was fairly low by the standards of international drug trafficking. Joaquin Perez, a criminal defense lawyer in Miami who specializes in international drug-trafficking cases, told the Washington Post in May 2018 that “Forty kilos in a big ship with containers and stuff like that is not a significant amount.” He argued that establishing responsibility for the drugs, especially when they were not found in a registered shipping container, would be challenging. “If it was found in the captain’s room, then you can charge the captain, or in one of the crew members’ rooms,” Perez said. “But short of that, I don’t know how you can charge anything.”", "Later, in October 2014, The Nation published a story headline “Mitch McConnell’s Freighted Ties to a Shadowy Shipping Company,” linking the Ping May with a company that was at the time owned and operated by Mitch McConnell's father-in-law, James Chao:", "The Republican Senate minority leader has the closest of ties to the owner of the Ping May, the vessel containing the illicit materials: the Foremost Maritime Corporation, a firm founded and owned by McConnell’s in-laws, the Chao family ... Like many international shipping companies, Chao’s firm is shrouded from public view, concealing its identity and limiting its legal liability through an array of tax shelters and foreign registrations. Registered through a limited liability company in the Marshall Islands, the Ping May flies the Liberian flag.", "According to U.S. Coast Guard records and maritime tracking services, the Ping May was then, and is still now, a Liberian-registered cargo ship owned by a shell company (Ping May LLC) controlled by the Foremost group. That group is now run by James Chao’s daughter Angela Chao, whose sister is Elaine Chao, the U.S. Transportation Secretary and wife of Senate Majority Leader Mitch McConnell.", "The issue of the Ping May was raised again in 2018 as part of a widely debunked primary campaign ad against McConnell from wealthy coal magnate Don Blankenship that inexplicably (at the time) labeled the senator “Cocaine Mitch.” Later, by way of an explanation, Blankenship made the claim in a press release that:", "Mitch McConnell and his family have extensive ties to China. His father-in-law who founded and owns a large Chinese shipping company has given Mitch and his wife millions of dollars over the years.", "The company was implicated recently in smuggling cocaine from Colombia to Europe, hidden aboard a company ship carrying foreign coal was $7 million dollars of cocaine and that is why we’ve deemed him “Cocaine Mitch.”", "The Foremost Group is not a Chinese Company, but an American company founded in New York in 1964 and run by Americans of Chinese descent who immigrated to the United States in the 1960s. Seven million dollars for 90 pounds of cocaine also appears to be, at best, an overestimate of the value of the smuggled contraband, according to the Washington Post. Nevertheless, an even more factually divorced version of this claim eventually evolved into a meme that suggested Mitch McConnell — not Foremost — owned the boat:", "As we have explained, Mitch McConnell's only connection to this incident was the fact that his wife’s family (but neither Mitch McConnell nor his wife specifically) owned and operated a shipping company that contracted out a Liberian-registered dry bulk cargo boat for the transport of coal in which someone back in 2014 attempted (and failed) to hide cocaine. No evidence has ever come to light that suggests Foremost was legally liable for the cocaine incident, and Mitch McConnell, as a matter of simple fact, does not own the Ping May. As such, we rank the claim false.", "Armada Nacional de Colombia.   “Incautados 40 Kilogramos de Cocaína en Buque de Liberia.\"\r\n    25 August 2014.", "Rizzo, Salvador.   “The Kooky Tale of ‘Cocaine Mitch.’”\r\n    The Washington Post.   4 May 2018.", "Fang, Lee.   “Mitch McConnell’s Freighted Ties to a Shadowy Shipping Company.”\r\n    The Nation.   30 October 2014.", "AngelaChao.com.   “Family.\"\r\n    Accessed 1 April 2019.", "DonBlakenship.com.   “Don Blankenship Releases \"Cocaine Mitch\" Ad Explanation.\"\r\n    1 May 2018.", "Prokop, Andrew.   “Cocaine Mitch: Don Blankenship’s Factually Dubious Attack on McConnell, Explained.”\r\n    Vox.   7 May 2018.", "ForemostGroupUsa.com.   “About\"\r\n    Accessed 1 April 2019.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]