["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Mexico, Britain, France, and Denmark had all abolished slavery before the United States adopted the 13th Amendment in 1865.", "Other claims in the post are inaccurate.", "As the Black Lives Matter protests have continued over the past two months, there has been an influx of misinformation surrounding the group’s donations and goals.", "A recent Facebook post suggested that Black Lives Matter protestors don’t know America’s history with slavery.", "The post reads: \"Slavery used to be a normal throughout the world. America was the ONLY country that ended it! Black people owned slaves, too. White people were slaves, too. How many of these morons from black lives matter know that?!\"", "It was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Let’s address the main claim of this post first.", "\"America was the ONLY country that ended\" slavery", "The claim that \"America was the only country that ended\" slavery is inaccurate.", "Compared with some European countries and American territories, the United States was late to abolish slavery.", "Mexico abolished slavery in 1829. The abolition of slavery was one of the reasons that white slave-holders in Texas rebelled and that the Republic of Texas re-instated slavery when it was formed in 1836. Though there was little documentation, historians estimate that at least 5,000 enslaved people escaped the United States and lived freely in Mexico.", "Britain abolished slavery in its colonies in 1833. When the Slavery Abolition Act went into effect, it dismantled the structure of plantation slavery in the Caribbean colonies, but only freed enslaved people under the age of six in British North America. In modern Canada, enslaved people over the age of six were forced to be apprentices to slave owners for another four to six years.", "France abolished slavery in 1848, after a 70-year period of abolishing and re-instating slavery in its colonies. Its former colony, Haiti, had already abolished slavery after the majority Black population won the Haitian Revolution in 1804.", "Denmark abolished slavery in the Danish Colonies in 1848, 50 years after it had abolished the transatlantic slave trade in the West Indies. In 1847, the Danish government announced that all future children of enslaved people would be free and that slavery would be completely abolished by 1859. However, large scale slave rebellions in 1848 pressured Danish official Peter von Scholten to announce the abolition of slavery immediately.", "The United States didn’t officially abolish slavery until 1865 when the 13th Amendment passed Congress and was signed by President Abraham Lincoln. Lincoln’s 1863 Emancipation Proclamation freed enslaved people in the 11 Confederate states at war against the Union, and specifically applied to territory in those states that weren’t under Union control. It addressed only a small portion of the institution of slavery in the U.S., which could only be permanently abolished through a constitutional amendment.", "Brazil was the last country in the Americas that relied on legal enslaved labor. The imperial government finally abolished slavery in 1888 after years of intense pressure from abolition organizations across the country.", "Other claims in the post", "The post also claimed that Black people owned slaves and that whites were enslaved as well.", "While Black slave owners were not the norm, they definitely did exist.", "Using data from Carter G. Woodson’s research, historian Henry Louis Gates Jr. wrote that a total of \"3,776 free Negroes owned 12,907 slaves\" in 1830. To put that in perspective, free Black Americans owned about half a percentage point of the total 2,009,043 slaves owned in the United States in 1830, at almost the height of slavery in the United States.", "The claim that \"white people were slaves, too\" is false but has been circulating online since the early 2000s. While Irish immigrants may have endured harsh conditions as indentured servants, their servitude lasted for five to seven years, and they were not enslaved for life.", "There are no historical accounts of \"white slaves.\" Slavery in the United States was based on the chattel slavery of Black people with African heritage, meaning that enslaved Black people were treated like property and their children were also born into slavery. Mixed-race people were enslaved in America because of their African heritage, but they weren’t considered \"white slaves.\"", "Our ruling", "A Facebook post made many claims about slavery, and specifically said that \"America was the ONLY country that ended\" slavery.", "The United States was definitely not the only country that abolished slavery and was actually one of the last countries to abolish slavery in the Americas. Mexico, Britain, France, and Denmark had established freedom for enslaved people before the 13th Amendment was passed in 1865.", "We rate this claim False.", "The New York Times, Black Lives Matter May Be the Largest Movement in U.S. History, July 3, 2020", "PolitiFact, Conservative pundits share false claim about Black Lives Matter, ActBlue, June 12, 2020", "PolitiFact, No evidence Black Lives Matter made 'kill a white on sight' flyers, June 26, 2020", "PolitiFact, Viral post gets it wrong about extent of slavery in 1860, August 24, 2017", "The Root, Did Black People Own Slaves?, March 4, 2013", "NAACP, NAACP History: Carter G. Woodson, accessed on July 30, 2020", "The New York Times, Debunking a Myth: The Irish Were Not Slaves, Too, March 17, 2017", "PolitiFact, No, the first slaves shipped to the American colonies weren't white Irish children, June 28, 2019", "PBS, Indentured Servants In The US, accessed on July 30, 2020", "Slavery & Abolition, White slavery: An American paradox, 1998", "Brandeis University, Chattel Slavery, accessed on July 30, 2020", "History.com, The Little-Known Underground Railroad That Ran South to Mexico, August 29, 2019", "Encyclopedia Britannica, Slavery Abolition Act | History & Impact, July 25, 2020", "UNESCO, French Revolution, accessed on July 30, 2020", "Encyclopedia Britannica, Haitian Revolution | Causes, Summary, & Facts, March 9, 2020", "Danish National Archives, The emancipation of the enslaved in 1848, accessed on July 30, 2020", "Danish National Archives, The slave rebellion on St. Croix and Emancipation, accessed on July 30, 2020", "History.com, 13th Amendment, June 9, 2020", "History.com, Emancipation Proclamation - Definition, Dates & Summary, Jan 6, 2020", "Oxford Research Encyclopedia, Abolition of Brazilian Slavery, 1864–1888, Oct 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]