["About this rating", "In August 2019, the website Daily World Update published an article reporting that former U.S. President Barack Obama had purchased a $200 million plane, and that President Donald Trump had opened an investigation into Obama's \"financials\":", "After reading this, you are bound to have one question at the forefront of your mind : How did a civil servant get enough money to buy a private jet? For you see, past president, Barack Hussein Obama has done just that. And he reportedly paid cash. $198 million. Where did the money come from?", "He certainly didn’t earn it at the White House. The office of the president pays $400000 per year. A substantial amount to be sure but not $198 mil substantial. It would take a million lifetimes in office to make that kind of coin.", "It wasn’t from book sales. All the books of all the Obamas only netted them maybe $20 million. Not even close to 747 money.", "So where? There has been much speculation online that President Obama would routinely walk into Fort Knox and help himself to barrel loads of thousand dollar bills. It’s been further said that Iran kicked back a significant portion of the $650 billion dollars he gave to them in the cash-for-nothing deal the two parties made. Others have alleged tax fraud and a drug empire.", "Whatever the source of the funds, we can be sure it wasn’t legal. We can also be sure that he won’t have that plane for long after President Trump opens an investigation into his dealings.", "This item was not a factual recounting of real-life events. The article originated with a website that describes its output as being humorous or satirical in nature:", "Everything on this website is fiction. It is not a lie and it is not fake news because it is not real. If you believe that it is real, you should have your head examined. Any similarities between this site’s pure fantasy and actual people, places, and events are purely coincidental and all images should be considered altered and satirical. See above if you’re still having an issue with that satire thing.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]