["One website post from Nigeria claims the image is no photographic trick, stating that “a young man left his bike chained to a tree in his family house when he went away to the war in 1914”.", "“Sadly, he never returned, leaving the tree no choice but to grow along with his precious bike. Today, the tree is mature and has become one with the bike,” the post claims. The brief article, published in November 2015 and archived here, claims a 98-year union between bicycle and tree.", "Britannia Digital Communications, Britannia PR, with over 73,000 followers on Twitter, made a similar claim in this tweet here.", "The same pictures were shared in a video by Indian Suman TV as one of the “7 wonders that no scientist in the world can tell”. The video has been watched more than 1,6 million times since it was posted in August 2017.", "AFP ran multiple reverse image searches of the pictures and found stories about the bicycle dating back more than a decade. Many of the reports said the tree could be found in the United States, while others contended it was in the United Kingdom.", "This BBC article, for example, refers to a “bicycle tree” in Trossachs, Scotland, UK, which is protected by the local parks authority under a provisional preservation order.", "The Scottish bicycle tree, however, is not the one featured prominently in all the social media posts.", "AFP searched Google Maps for a “bicycle tree” in the United States and traced its home to Vashon Island in Washington. Take a look here.", "We also found a YouTube video uploaded by a tourist.", "In 2009, a Vashon Island-based newspaper, Vashon-Maury Island Beachcomber, set the record straight on the numerous tales about the bicycle.", "The Newspaper spoke to Helen Puz, a 97-year-old woman who lived a few hundred metres from the tree for 55 years. She claimed the bicycle was left in the woods by her son, Don Puz, who was only eight years old at the time.", "After the bicycle made headlines, mother and son said they went to see it.", "“We went down there in the woods, and there was this bike in the tree, and I said, ‘That’s my bike,’” Don told the newspaper. “I recognised it immediately… When I saw that bike, I recognized it, because I don’t think I’ve ever seen another one like it.”", "There is less of the bicycle remaining today but, as is clear in the comparison photographs above, enough of it remains to mark its home unmistakably as being on Vashon Island.", "And despite its diminished appearance, tourists still visit the site - see pictures here and here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]