["Martin Luther King Jr. had harsh words for both major political parties, experts say. (AP Photo)", "On the birthday of the Rev. Martin Luther King Jr., gun rights supporters rallied on the state Capitol grounds against efforts to tighten firearm restrictions.", "Philip Van Cleave, president of the Virginia Citizens Defense League, which organized the rally, disparaged the Democratic Party as the party of gun control. He then uttered what he said was a little-known fact:", "\"We’re here on a holiday, and this holiday is Martin Luther King’s birthday, right? Somebody who fought for civil rights to bring people to be equal,\" Van Cleave said. \"Let me ask you a question. What party was he with? He was a Republican.\"", "That was news to us. We decided to investigate.", "We asked Van Cleave to support his claim that the slain civil rights leader was a Republican. He told us in a telephone interview that he’d heard that statement many times. He said he’d do some research on the origin of the claim and get back to us.", "He followed with an email saying his research found some claims that King was with the GOP and others saying his party affiliation was unknown.", "\"I’m also not finding an unimpeachable source either way. So I’d have to say that one can’t claim he was a Republican with absolute certainty, nor can one say he wasn’t a Republican with absolute certainty,\" Van Cleave wrote.", "\"Rather than get mixed up in this gray area, I’m just going to drop that one off my talking points,\" he added.", "Indeed, the Internet is replete with declarations from conservative groups that King was a brethren Republican. The claim rests, in large part, on comments made at least eight years ago by Alveda C. King, the civil rights leader’s niece.", "\"My uncle, Dr. Martin Luther King Jr., during his lifetime was a Republican,\" Alveda King said in a video posted on the National Black Republican Association website.", "Her statement has been dismissed by other members of King’s family. \"It is disingenuous to imply that my father was a Republican,\" Martin Luther King III, the civil rights leader’s son, told The Associated Press in 2008. \"He never endorsed any presidential candidate, and there is certainly no evidence that he ever even voted for a Republican.\"", "And on the same day Van Cleave made his statement, Bernice King, the civil rights leader’s daughter, said in a radio interview that her father was \"never\" a member of the Republican Party.", "The video of Alveda King’s comments has been circulating for years. But in 2013, she retracted her claim in an op-ed for Newsmax.com, a conservative news website. King wrote that she regrets \"having said to a group of peers that my Uncle M. L. (Dr. Martin Luther King, Jr.) was a Republican. I said that without having all the facts.\"", "Alveda King wrote that her uncle was \"an independent, who in his own words tended to vote Democrat.\"", "She wrote that she had assumed her uncle was a member of the GOP because his father - Martin Luther King, Sr. - was a Republican. Alveda King wrote that before the election of Democrat John F. Kennedy as president in 1960, most blacks were Republicans.", "Our colleagues at PolitiFact Rhode Island in 2012 also examined a claim that the civil rights leader was a Republican. They wrote that it wasn’t surprising that King’s father, who lived in Atlanta, was a Republican because most Southern Democrats at the time backed racial segregation.", "For more insight, we contacted Clayborne Carson, founding director of the Martin Luther King Jr. Research and Education Institute at Stanford University. We asked him if King was a Republican and whether there are any voter registration records that would confirm that’s the case.", "\"To the best of my knowledge, the answer to both questions is no,\" Carson replied in an email.", "Carson also is director of the King Papers Project, a research initiative with the King Center in Atlanta that is compiling the civil rights leader’s sermons, correspondence, speeches and other writings. He said that project has not found any records that show King registered with either political party.", "Carson said King wasn’t completely enamored with Republicans or Democrats.", "\"There are many documents indicating that King was critical of both major political parties, because they were insufficiently committed to civil rights and ‘a better distribution of wealth,’\" he wrote.", "Lewis Baldwin, a professor emeritus of religious studies at Vanderbilt University who has written six books about the civil rights leader, told us there’s \"no evidence whatsoever\" that King was a Republican. Any assertion that King was a member of the GOP is \"absolutely false,\" he said.", "King said blacks \"should remain independent voters, and they should not become unduly tied to any party, Democrat or Republican,\" Baldwin said.", "Our ruling", "Van Cleave said at a rally that Martin Luther King Jr. was a Republican. He told us he had heard the claim many times but, after doing some research, now concludes that the evidence is cloudy and said he will stop using the line in speeches.", "Experts say King eschewed party labels and was critical of both major parties. King’s son and daughter have denied claims that their father sided with the GOP. King’s niece, who once said the civil rights leader was a Republican, retracted that statement three years ago.", "The burden is on Van Cleave to prove his statement, and he, too, backs away from it.", "We rate his claim False.", "Philip Van Cleave, president of the Virginia Citizens Defense League, Inc. comments to rally at Virginia state capitol, Jan. 18, 2016.", "Email from Philip Van Cleave, Jan. 19, 2016.", "Interview with Lewis Baldwin, professor emeritus of religous studies at Vanderbilt University, Jan. 20, 2016.", "Email from Clayborne Carson, founding director of the Martin Luther King Jr. Research and Education Institute at Stanford University, Jan. 20, 2016.", "PolitiFact Rhode Island, \"Republican Travis says Martin Luther King, Jr. was a Republican,\" Jan. 29, 2012.", "PolitiFact Texas, \"Houston group says Martin Luther King, Jr. was a Republican,\" Jan. 17, 2011.", "PolitiFact Tennessee, \"Another Republican claims that Martin Luther King Jr. was part of the GOP,\" Jan. 23, 2012.", "The Associated Press, \"Black Republican group uses MLK to promote itself,\" July 4, 2008.", "Human Events, \"Why Martin Luther King was Republican,\" Aug. 16, 2006.", "CNN, \"Debunking the biggest myths about MLK,\" Jan. 18, 2016.", "National Black Republican Association, \"Affirmed: Martin Luther King Jr. was a Republican,\" Sept. 27, 2015.", "National Black Republican Association, \"Why Dr. Martin Luther King Jr. was a Republican,\" May 12, 2015.", "Newsmax, \"Put political strife out to pasture,\" Oct. 14, 2013.", "Snopes.com \"Four things about King,\" Jan. 16, 2016.", "BlackAmericaWeb.com, \"Rev. Bernice King on her father’s legacy,\" Jan. 18, 2016.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]