["The horrific death of an elephant in Kerala’s Palakkad has turned into yet another issue to target the Indian Muslim population. After reports came pouring in that the animal died a slow death after explosives went off in her mouth, numerous social media users claimed that the persons arrested for the crime are Amzath Ali and Thamim Shaikh. Amar Prasad Reddy, media advisor to the Union Minister of State for Health and Family Welfare, was one of the earliest to tweet. He later took it down but not before it garnered thousands of likes and retweets (archive). He subsequently tweeted a clarification.", "Live Hindustan wrote an article on the purported arrests where Amar Prasad Reddy’s tweet was featured (archive).", "News Nation anchor Deepak Chaurasia made the same claim in Hindi (archive) — “हत्या के मामले में अमजद अली और तमीम शेख की गिरफ्तारी हुई है।”", "Sudarshan News penned an article on the claim (archive). Last year, Alt News had compiled a list of dangerous communal misinformation promoted by Sudarshan News.", "Alt News contacted Palakkad Superintendent of Police G Siva Vikram who termed the social media claims “fake” and informed that a man named P Wilson has been arrested in the matter. This was also reported by DD News Malayalam and Hindustan Times.", "The accused Sh.Wilson being taken to plantation premises for gathering of evidence. He was a tapping labourer and overseer in the plantation there. @DDNewslive pic.twitter.com/kQqSqHZZNL", "— DD News Malayalam (@DDNewsMalayalam) June 5, 2020", "Thiruvazhamkunnu Forest Station, Deputy Range Officer, M Sasikumar confirmed the arrest to The News Minute. Wilson works as a rubber tapper in a plantation in the district. “The Forest Department identified three people suspected to be involved in the case, but let off two persons after interrogation,” the report further states. SP Vikram told Alt News that the two people who were let off were not named Amzath Ali and Thamim Shaikh.", "Malayalam news outlets Mathrubhumi and Janmabhumi reported that the owners of the rubber plantation where Wilson works are also suspects in the case. Their names are Abdul Kareem and his son Riyazuddin. This was also confirmed to Alt News by SP Vikram who said that the duo is currently absconding.", "ഗര്‍ഭിണിയായ ആനയെ കൊന്ന കേസിലെ ഒന്നാം പ്രതി അബ്ദുള്‍ കരീം, രണ്ടാം പ്രതി മകന്‍ റിയാസുദ്ദീന്‍, ഇരുവരും ഒളിവില്‍; തേങ്ങയില്‍ പടക്കം വെച്ചത് വില്‍സണ്‍ https://t.co/mqqXKYWKVD", "— Janmabhumi (@janmabhumidaily) June 5, 2020", "Prashant Patel Umrao, whose trysts with misinformation have been documented here, also made the same claim (archive).", "Others who pushed the anti-Muslim narrative were author Ravi Rai (archive), BJP leader Varun Gandhi’s secretary Ishita Yadav (archive), VHP member Abishek Mishra (archive), BJP UP member Richa Rajpoot (archive), OpIndia sub-editor Anupam Singh (archive), columnist Rakesh Krishnan Simha (archive), Twitter user BALA @erbmjha (archive) and Twitter account of Hindu nationalist party in Kerala Indu Makkal Katchi (archive).", "In an earlier report, Alt News debunked media reports which claimed that the incident took place in Malappuram. The district’s Muslim majority population led to communal misinformation on social media. The case pertains to Palakkad.", "[Update: The names of rubber plantation owners Abdul Kareem and his son Riyazauddin who are suspects in the case were added to the article after the same was reported by the police. This is a developing story. Updates will be included as and when they come to light.]", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A purported video of a Muslim man beating a temple priest with a bat is…", "A picture depicting the Pakistani flag apparently bigger in size and apparently placed higher than…", "Amid the ongoing war between Israel and Hamas, a video of a fleet of cars…", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…"]