["About this rating", "Ample evidence exists to show that Columbus was responsible for forcing thousands of natives on the Caribbean islands into slave labor, as well as seizing, selling, distributing, and exporting many native women and children, with either foreknowledge of, or indifference to, their fate as sex slaves.", "However, the specific quotation offered as evidence in a widely shared meme, although accurate and authentic, came from a longer passage written by Columbus. In context, Columbus was neutrally describing the specific practice of buying and selling nine-year-old girls, and in that particular letter, he neither endorsed it nor condemned it, nor admitted to personally taking part in it.", "As time passes, a greater and greater number of people have been exposed to the often uncomfortable historical details of Christopher Columbus's voyages to the Americas at the turn of the 15th and 16th centuries. The murder, enslavement and mistreatment of the native peoples of the Caribbean islands which Columbus and his crews conquered, can provoke shock and even disbelief, more than 500 years on.", "In May 2018, readers asked about the veracity of a meme which claimed that Columbus had been involved in procuring and distributing women and even children as sex slaves:", "Columbus Provided Native Sex Slaves to His Men", "In addition to putting the natives to work as slaves in his gold mines, Columbus also sold sex slaves to his men — some as young as 9. Columbus and his men also raided villages for sex and sport. In the year 1500, Columbus wrote: \"A hundred castellanoes are as easily obtained for a woman as for a farm, and it is very general and there are plenty of dealers who go about looking for girls; those from nine to ten are now in demand.\"", "The quote attributed to Columbus in the meme is accurate and was taken from a letter he wrote in 1500 to Doña Juana de la Torre, a nurse in the royal court of Queen Isabella and the sister of one of Columbus' leading crew members on his second voyage to the Americas.", "At this time (just after his return from the third voyage) Columbus had been removed as Governor of the American territories after reports surfaced of horrific misgovernment and brutal treatment of natives, and he was even briefly imprisoned before he was pardoned by King Ferdinand of Aragon who — along with Isabella of Castile — was one of the \"Catholic Monarchs\" of modern-day Spain.", "In the Early Modern Spanish used by Columbus, the passage reads:", "Por una mujer tan bien se falla çient castellanos como por una labrança, y es mucho en uso, y ay fartos mercaderes que andan buscando muchachas, de nueve a diez son agora enprençio, de todas hedades ha de tener un bueno.", "The quote underlines Columbus's view of indigenous Americans as commodities. He compares the market value of a female sex slave with that of a piece of farmland, and notes that \"of late\" (\"agora\") slave dealers were particularly interested in purchasing nine- or ten-year-old girls.", "However, in the broader context of his letter to Doña Juana de la Torre, Columbus appears to have been neutrally describing the fact that girls as young as nine years old were sold as slaves. In the particular passage quoted in the meme, he was neither endorsing nor criticizing the practice, nor admitting that he personally took part in it.", "Nonetheless, it is well documented that sex slavery and forced labor were among the many brutalities that Columbus' crews inflicted on the native Taíno people on the island of Hispaniola (now the site of Haiti and the Dominican Republic.)", "Bartolomé de las Casas, a Spaniard who took part in colonial expeditions to Hispaniola led by Nicolás de Ovando, became so disenchanted with the atrocities of the European conquerors, including Columbus and Ovando, that he turned on the violence of the project. Later, he became a Dominican friar, dedicating his life to exposing and opposing the brutalities perpetrated by Columbus and others during that era, and attempting a more peaceful missionary colonization of the Caribbean islands.", "In 1542, de las Casas wrote a famous book about that era, A Brief Account of the Destruction of the Indies (\"Brevísima Relación de la Destrucción de las Indias.\") In it, he condemned the destruction caused by the Columbian voyages:", "There are two main ways in which those who have travelled to this part of the world pretending to be Christians have uprooted these pitiful peoples and wiped them from the face of the earth. First, they have waged war on them: unjust, cruel, bloody and tyrannical war. Second, they have murdered anyone and everyone who has shown the slightest sign of resistance, or even of wishing to escape the torment to which they have subjected him.", "This latter policy has been instrumental in suppressing the native leaders, and, indeed, given that the Spaniards normally spare only women and children, it has led to the annihilation of all adult males, whom they habitually subject to the harshest and most iniquitous and brutal slavery that man has ever devised for his fellow-men, treating them, in fact, worse than animals.", "On his 1493 return to Europe from the first voyage, Columbus wrote a famous letter to Ferdinand and Isabella (who had sanctioned the expedition), recounting the timidity and naivité of the Taíno people, and offering his patrons \"slaves as many as they shall order to be shipped,\" in return for the ships and resources required for a second voyage:", "They have no iron or steel, nor any weapons; nor are they fit thereunto; not because they be not a well-formed people and of fair stature, but that they are most wondrously timorous... such they are, incurably timid... They are artless and generous with what they have, to such a degree as noone would believe but him who had seen it. Of anything they have, if it be asked for, they never say no, but do rather invite the person to accept it, and show as much lovingness as though they would give their hearts...", "...Their Highnesses may see that I shall give them as much gold as they may need, with very little aid which their Highnesses will give me; spices and cotton at once, as much as their Highnesses will order to be shipped, and as much as they shall order to be shipped of mastic... and aloe-wood as much as they shall order to be shipped; and slaves as many as they shall order to be shipped.", "What followed were the infamous slave raids of 1495, during the second voyage. As the historian Howard Zinn described in A People's History of the United States, Columbus could not find as much gold on the conquered Caribbean islands as he had hoped, and so chose to round up a greater number of native slaves for export to Europe instead:", "Because of Columbus's exaggerated report and promises, his second expedition was given seventeen ships and more than twelve hundred men. The aim was clear: slaves and gold. They went from island to island in the Caribbean, taking Indians as captives. But as word spread of the Europeans' intent they found more and more empty villages. On Haiti, they found that the sailors left behind at Fort Navidad had been killed in a battle with the Indians, after they had roamed the island in gangs looking for gold, taking women and children as slaves for sex and labor.", "Now, from his base on Haiti, Columbus sent expedition after expedition into the interior. They found no gold fields, but had to fill up the ships returning to Spain with some kind of dividend. In the year 1495, they went on a great slave raid, rounded up fifteen hundred Arawak men, women and children, put them in pens guarded by Spaniards and dogs, then picked the five hundred best specimens to load on to ships. Of those five hundred, two hundred died en route.", "Evidence also exists which indicates that, as well as overseeing the mass capture, mistreatment and export of slaves, Columbus appears to have been indifferent to brutal acts of sexual assault on young girls, in keeping with the meme's claim that \"Columbus provided native sex slaves to his men.\"", "In an October 1495 letter, crew member Michele de Cuneo recounted that Columbus \"gave\" him a young girl, whom Cuneo proceeded to brutally rape. The following account contains descriptions of sexual assault that some readers might find disturbing:", "\"When I was in the boat, I took a beautiful Cannibal girl and the admiral [Columbus] gave her to me. Having her in my room and she being naked as is their custom, I began to want to amuse myself with her. Since I wanted to have my way with her and she was not willing, she worked me over so badly with her nails that I wished I had never begun. To get to the end of the story, seeing how things were going, I got a rope and tied her up so tightly that she made unheard of cries which you wouldn't have believed. At the end, we got along so well that, let me tell you, it seemed she had studied at a school for whores.\"", "Ample evidence exists to show that Columbus was responsible for forcing thousands of natives on the Caribbean islands into slave labor, as well as seizing, selling, distributing, and exporting many native women and children, with either foreknowledge of, or indifference to, their fate as sex slaves.", "However, the specific quotation featured in the meme, although accurate and authentic, came from a longer passage written by Columbus. In context, Columbus was neutrally describing the practice of buying and selling nine-year-old girls, and in that particular letter, he neither endorsed it nor condemned it, nor admitted to personally taking part in it.", "Columbus, Christopher.  \"Letter to Doña Juana de la Torre.\"\r\n  Volume 2 of \"Christopher Columbus -- His Life, His Works and His Remains\" ed. John Boyd Thatcher (1903.)  Written 1500", "Las Casas, Bartolomé.  \"A Short Account of the Destruction of the Indies.\"\r\n  Penguin UK (2004).  Written 1542.", "Columbus, Christopher.  \"Letter to Luis de Santángel.\"\r\n  Published 1893 by Bernard Quaritch.  Written 15 February 1493.", "Zinn, Howard.  \"A People's History of the United States.\"\r\n  Harper Collins.  2010.", "Updated [12 August 2020]: Rating changed from \"True\" to \"Mixture.\" Added important context around the Columbus quotation cited in the meme.", "Updated [Oct. 4, 2021]: Updated to clarify that Bartolomé de las Casas was not one of Columbus' crew members, but rather took part in colonial expeditions led by Nicolás de Ovando, during the same era.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]