["About this rating", "Ingredient lists published by P&G in 2013 and 2014 stated that peanut oil and other nut derivatives were among the compounds used in fragrancing their products.", "Febreze odor elimination spray currently contains peanut or tree nut oil derivatives.", "Whether Febreze ever contained peanut oil or other nut derivatives.", "In early 2016, the above-reproduced screenshot of an online comment began circulating online via social media, alleging that Procter & Gamble's Febreze brand odor elimination spray had triggered symptoms of a child's peanut allergy. The original author of the message, where the message was posted to, the date of the posting, and the circumstances under which the child's purported reaction occurred were unclear.", "One of the most popular iterations was published on 24 January 2016 by a Facebook user who said she spotted had it in an unspecified group:", "My son has a peanut allergy and I found out something the hard way today and I wanted to share in the hopes of helping someone else avoid a similar situation. Yesterday, I sprayed Febreeze in his room and last night he woke up covered in welts, coughing, and ashen around his eyes. I learned that P&G (Procter and Gamble) puts peanut and tree nut oil in their products without disclosing it on their packaging. It's the worst feeling realizing that you inadvertently poisoned your child while trying to clean their room after having strep throat. I hope this information is helpful to you.", "This singular account lacked any detail and provided no information how it was supposedly determined that Febreze had definitively triggered a child's peanut allergy, or how the parent came to discover that P&G purportedly adds peanut or tree nut oil to their products without declaring them (despite the clear danger presented by such a labeling oversight). Moreover, the comment stated the child in question had recently suffered strep throat at the time of the flare-up and therefore might have been susceptible to any number of things that could have caused such a reaction (aside from an allegedly nut-containing odor elimination spray). Overall, it appears that the parent observed a possible reaction to an environmental trigger affecting her recently-ill (or still-ill) child and simply attributed it to the coincidental spraying of Febreze.", "One of the only other online mentions of P&G products purportedly containing peanut oils we've found is a 2 September 2014 post on the blog Scratch & Sniff that contained some unconfirmed and conflicting information about whether fragranced P&G products were safe for individuals with peanut allergies:", "Procter & Gamble Co. brands include Swiffer, Febreze, Dawn, Ivory, Pampers, and Tide. [P&G lists all brands here.] The products themselves do not have nut or seed oils listed on the packaging. On the P&G website, no nut oils are listed under the products' respective ingredients, but \"fragrance\" is listed. P&G breaks down what \"fragrances\" means on their corporate site, and lists peanut oil, almond oil (sweet), almond oil (bitter), sesame oil, and coconut oil in the 20-page document listing their full arsenal of ingredients — not spelling out exactly which ingredients make up the particular fragrance of any given product.", "So which of their products actually contain peanut oil or tree nut oil?", "It's proving to be a question no one can answer. Scratch or Sniff has made several calls and emails to the respective brands — Ivory, Pampers, Dawn — but the results have been disconcerting.", "The post described separate efforts to determine whether individual P&G brand items were fragranced with peanut or tree nut oil derivatives: Ivory soap was deemed inconclusive, Dawn dishwashing liquid was named as a potential peanut allergen, and Febreze was also marked as an inconclusive item. Among a number of embedded images of communications with P&G brands and online comments was one that suggested Swiffer brand products contained peanut oil:", "On 8 September 2014, Scratch & Sniff published a follow up post that contained a transcript of a conversation between the blogger and a P&G representative, during which the representative maintained that P&G products didn't contain undeclared peanut or tree nut derivatives:", "Dawn called me (as a consumer, not as the owner of Scratch or Sniff) and we had this conversation:", "Dawn rep: \"We did look into your question further. We have received confirmation that none of our Dawn dishwashing liquids contain any kind of peanut oil or their derivatives. We also want to let you know that we require that all perfumes and fragrances in our products are free of peanut oil or their derivatives. If any of our products do contain nut oils it will be stated on the packaging. We do require it on the labels, that if they do have nut oil, that it is on there. So we wanted to let you know. We are also working to update the information on our website so it does have the correct information there.\"", "RC: \"When I spoke with Dawn last week, I was told there absolutely are traces of peanuts in the product. You're telling me moving forward there will no longer be, or currently there aren’t any?", "Dawn rep: \"There are not any. There has not been any. If there had been any, we would definitely have it on the label.\"", "RC: \"Do you know why I was told otherwise?\"", "Dawn rep: \"I don't know why that information was shared. In general, we do just say that unless it specifically states it on the packaging, it could possibly contain some trace amounts, because our perfumes are usually purchased through other businesses. But with this, basically, we do actually have done that additional research at this time to verify that there are no peanut oil or peanut byproducts at all.\"", "(On a separate web site, a user asserted that P&G had refused to disclose ingredients to concerned parents without a doctor's note, but we were unable to substantiate that assertion.)", "Both Scratch or Sniff posts referenced a 20-page P&G document titled \"Perfume & Scents\" [PDF] whose introductory paragraphs explained:", "The list below represents all the ingredients our perfumers select from to create consumer appealing scents, in alphabetical order. This list is regularly updated to reflect changes in the palette of ingredients.", "We were unable to find any variation of \"peanut\" or \"nut\" on the most recently published version of P&Gs scent list (\"coconut oil\" and \"nutmeg oil\" were the only hits for \"nut\"). According to the American College of Allergy, Asthma, and Immunology (ACAAI), most individuals allergic to tree nuts can consume or tolerate coconut and/or nutmeg:", "People with tree nut allergies often wonder if they must also avoid coconut and nutmeg.", "Coconut is not a botanical nut; it is classified as a fruit, even though the Food and Drug Administration recognizes coconut as a tree nut. While allergic reactions to coconut have been documented, most people who are allergic to tree nuts can safely eat coconut. If you are allergic to tree nuts, talk to your allergist before adding coconut to your diet.", "Nutmeg is a spice that is derived from seeds, not nuts. It may be safely consumed by people with a tree nut allergy.", "A separate 2014 blog post by Food Allergy Research & Education (FARE) held that non-food items containing such allergens are \"not required to be labeled,\" but many such products are nonetheless irrespective of labeling requirements. Moreover, that post featured an example of ostensible allergens having minimal effect on food allergy sufferers in a different context:", "Pharmaceutical grade lactose may contain trace milk proteins and could rarely induce reactions in inhaled or injected medications. A 2014 article in The Journal of Allergy and Clinical Immunology indicated that reactions are \"quite a rare phenomenon given the large number of children with milk allergy who use lactose-containing dry powder inhalers uneventfully.\" Any inhaler that contains milk should indicate so in the patient information insert.", "Another blog maintained by a food allergy expert and lawyer examined whether coconut typically triggered allergic reactions in individuals with peanut or tree nut allergies:", "[Allergist Dr. Wade] Watson’s answer was: “Coconut is a member of the palm family, which is not related to nuts or peanuts.  Coconuts are large seeds adapted for water-born dispersal and remain viable after having floated in the sea for six months or more.   If your son is allergic to peanuts or tree nuts, there is no reason for him to avoid coconut.”  I checked with Gwen Smith, the editor of Allergic Living magazine, to see if this answer remains correct, and she assured me Dr. Watson stands by that advice.", "Gwen further wrote \"It's really a seed not a nut, and most allergists don’t tell you to avoid it with tree nut allergy. The few reactions to coconut are allergy just to it, unrelated to tree nut allergy. But the FDA confused everyone a couple of years back by adding coconut to the list of tree nut allergens ... if you’re tree nut allergic, ask your doctor if coconut flour is ok for you. Most with tree nut allergy do have the green light to eat coconut.”", "The Food Allergy & Anaphylaxis Network (FAAN) also weighed in on this subject ... The FAAN response is \"Discuss this with your doctor. Coconut, the seed of a drupaceous fruit, has typically not been restricted in the diets of people with tree nut allergy. However, in October of 2006, the Food and Drug Association (FDA) began identifying coconut as a tree nut. The available medical literature contains documentation of a small number of allergic reactions to coconut; most occurred in people who were not allergic to other tree nuts. Ask your doctor if you need to avoid coconut.\"", "Finally, a somewhat difficult to locate page on the P&G web site definitively addressed whether Febreze specifically contained nuts or derivatives, outlining the brand's general policy on such ingredients:", "The safety of the people who use our products is our top priority.  P&G's policy requires that our labels indicate if the product contains nut oils. Additionally, we require that all perfumes and fragrances in our products are free of peanut oil or any of its derivatives.", "However, cached versions of the above-linked ingredient list captured on 18 April 2013 [PDF] and 22 December 2014 [PDF] indeed listed peanut oil, sesame oil, and two variations of almond oil among potential fragrance components; a 10 September 2015 capture [PDF] retained the almond oil and sesame oil entries but lacked peanut oil. The 2013 and 2014 ingredient lists were current at the time the original Scratch & Sniff posts were published, and the most current published list included almond and sesame oil.", "On 8 February 2016, a P&G representative responded to our initial inquiry and stated:", "Thanks for reaching out. I can confirm that Febreze products do not contain peanut oil or any of its derivatives. As you’ve already noted in your article, the safety of the people who use our products is our top priority. P&G’s policy requires that our labels indicate if the product contains nut oils. Additionally, we require that all perfumes and fragrances in our products are free of peanut oil or any of its derivatives.", "In reply to P&G's response, we asked whether Febreze or any other P&G products contained peanut or tree nut oils at any point; on 10 February 2016, a representative replied:", "P&G does not use peanut oil in any of our products or perfumes and has not for well over a decade.  We do however use other tree nut oils in some of our product perfumes.  The safety of the people who use our products is our top priority, so we use highly refined tree nut oils to address allergy concerns.  We also have fragrance-free versions of many of our products for those who may have unique sensitivities, and can answer more specific questions about a particular product as needed.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]