["In the days leading up to the final presidential debate, both presidential candidates are in the national spotlight. But in an attempt to deflect from the actual political issues at hand, a third party has been thrust into the hot seat, too: the moderator.", "Thursday’s debate will be moderated by Kristen Welker, NBC News’ White House correspondent. Although Trump and his campaign have complimented Welker in the past, he and his supporters have taken to social media to criticize her ahead of the debate.", "“She’s always been terrible & unfair, just like most of the Fake News reporters, but I’ll still play the game,” Trump tweeted Saturday.", "More recently, supporters of the president have latched onto a photo of Welker posing with President Barack Obama, Michelle Obama and another man, whom the New York Post identified as Welker’s father. On Facebook, people are using the photo to claim Welker is biased.", "“The moderator of the debate this week,” the Facebook page Crawfordology wrote in a post. “They’re not even trying to be fair anymore.”", "The page did not respond to USA TODAY’s request for comment.", "More:Fact check: Harris' statement on Lincoln's Supreme Court nomination misses key details", "The photo does depict Welker posing with the Obamas and her dad. She posted the photo on her Facebook in 2012, with the caption “Christmas at the White House.” But Welker’s attendance at the event was nothing scandalous — reporters used to attend White House holiday parties every year.", "The parties are a long-held tradition in Washington — the first was hosted by President John Adams and first lady Abigail Adams in 1800, according to White House archives — and a number of White House reporters usually get an invite.", "Accounts of the holiday press parties, like Vogue’s, describe attendees in “high spirits,” surrounded by festive decorations and decadent food, like lamp chops and sticky toffee pudding. The invite-only event got so large that it was eventually split into two parties — one for broadcast outlets and the other for print organizations, Fox News reported.", "And, it’s one of the few White House parties that includes a photo line. A picture-taking session with the sitting president and first lady typically takes up a chunk of the event.", "More:Fact check: In town hall TV ratings, Joe Biden beat Donald Trump", "The New York Times reported George W. Bush and his wife, Laura, posed for photos at all 25 of the holiday parties he hosted in 2008, while the Obamas posed for fewer. Both congressmen and news media were among the groups who waited in line. Bill Clinton even posed in pictures with reporters days after he was impeached, Fox reported.", "As Fox’s Howard Kurtz put it, the photo-ops were the parties’ “biggest fringe-benefit” — copies of the photos “invariably sent home to mom.”", "“Kristen Welker, along with entire (sic) Washington press corps, attended the annual Obama White House press party,” NBC spokesperson Richard Hudock told USA TODAY. “She also attended the Trump White House press party in 2017 until the administration did way with the tradition.”", "As Hudock alluded, Trump hosted a similar holiday party for the press in 2017, but canceled the 2018 event and has not held one since. Media figures like Rupert Murdoch and ABC News’ Ann Compton are among past attendees.", "We rate this claim as MISSING CONTEXT, based on our research. A photo shared on Facebook does show soon-to-be presidential debate moderator Kristen Welker posing with the Obamas at a White House holiday press party, but she is not the only reporter who has attended the annual event in the past and grabbed a picture with the sitting president and first lady.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more."]