["Workers produce C-Class sedans at the Mercedes plant near Tuscaloosa, Ala. The German automaker is moving its U.S. headquarters to metro Atlanta. Photo by Tamika Moore/AL.com, via Associated Press", "The 2014 governor’s race spotlighted two diametrically opposed facts about Georgia’s economy: Different groups ranked the state tops for business at the same time the state had the highest unemployment rate in the nation.", "Georgia’s  unemployment rate tumbled to 6.9 percent in December (from 7.2 percent in November), and in January, Mercedes-Benz USA announced it was moving its headquarters to metro Atlanta.", "Newly re-elected Gov. Nathan Deal touted the move in a press release as \"creating at least 800 jobs\" while repeating the state’s top-ranked business environment.", "PolitiFact Georgia wondered if that meant the move would create jobs to nudge the needle on Georgia’s unemployment rate – still stubbornly well above the national 5.6 unemployment rate. In other words, is moving jobs – in this case, from New Jersey – the same as creating them?", "First, it’s worth noting that the 800 figure comes from an incentive letter from the Georgia Department of Economic Development to Mercedes. The state is offering a package of grants, tax credits and \"cost avoidances\" worth $23.3 million.", "Mercedes-Benz USA CEO Steve Cannon has told several media outlets that the firm expects about 40 percent of its workers to relocate to Atlanta. Using the 800 figure, that means 320 people will move and the firm will need to hire for 480 jobs.", "So does that translate into \"creating\" 800 jobs?", "Absolutely, said state Economic Development Commissioner Chris Carr.", "After all, once the auto company sets up shop here this summer, there will be at least 800 jobs that today don’t exist. It’s a net increase of positions, and in an industry that has gradually shifted to the southeast for its manufacturing and office operations.", "\"This puts Georgia high on the radar for the automotive industry and also for German companies,\" Carr said. \"Whether a Georgian here or new Georgian, Georgians would not have that job except for the sake that Mercedes will move here.\"", "The qualifier of \"at least\" 800 jobs shows the state is looking at the tax credits as an investment, Carr said. \"You have to play for the long game,\" he said.", "To an economist, the claim is accurate-ish.", "Once Mercedes moves here, the U.S. Bureau of Labor statistics will show it as 800 jobs in Georgia. Those jobs will do the things economists study, like boost demand for housing and increase tax collections on the state and local level, said Bruce Seaman, an economics professor at Georgia State University.", "That said, it’s incorrect to imply the move means 800 jobs for current Georgians, Seaman said.", "\"We should be happy, not euphoric. We could be euphoric if this was creating 800 opportunities for existing Georgians,\" he said.", "The distinction between those soon-to-be Georgians and the folks who already know the pain that is rush hour on the top-end Perimeter? The folks here are the ones paying the taxes that fund those incentives and might wonder what’s in it for them.", "Georgia’s generous incentives to the film industry answer the question. There was no doubt that most of the jobs tied, say, to Jennifer Lawrence’s first days filming in Bellwood Quarry, came from California.", "But Seaman said the state’s investment has also created a growing demand for Georgians who know how to do work in that industry, not to mention private-sector investments in sound stages and studios.", "\"Over time, it is an investment that can pay off,\" Seaman said. \"I think it’s a good thing for the state.\"", "The bottom line is, claiming Mercedes’ move will create 800 jobs is generally correct but lacking in context.", "If you’re an unemployed Georgian today, you likely have a shot at 480 Mercedes job openings, not 800. But there should still be 800 jobs, once it’s all said and done. And that alone could spur more work. We rate the claim Mostly True.", "Nathan Deal, Press Release, \"Mercedes-Benz USA to create 800 jobs in Atlanta,\" Jan. 13, 2015", "Georgia Department of Economic Development, Mercedes-Benz USA incentive offer, Dec. 12, 2014", "The Atlanta Journal-Constitution, \"State incentives to Mercedes: $24K+ per job,\" Jan. 13, 2015", "The Atlanta Journal-Constitution, \"Georgia’s unemployment rate drops to 6.9 percent,\" Jan. 22, 2015", "Automotive News, \"Mercedes 'will lose talent' in move,\" Jan. 19, 2015", "Phone interview, Chris Carr, Commissioner of Georgia Department of Economic Development, Jan. 14, 2015", "Phone interview, Bruce Seaman, professor of economics, Andrew Young School of Policy Studies of at Georgia State University, Jan. 22, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]