["About this rating", "On 6 November 2015, a Facebook user shared an image of a man holding a gigantic shrimp, along with the caption identifying the image as depicting a \"102 pound shrimp from Homosassa Florida\":", "That same image had previously appeared over a month earlier on a Spanish-language web site, a rough translation of which placed the implausible catch in Spain:", "The image shows a man proudly posing with giant prawn or shrimp, at least fifteen kilos in weight. Within hours the \"news\" circulated like wildfire and generated discussion threads among those who appreciated the humorous nature of the case and those who believed it. Once again, a hoax on the Internet came to be taken as credible as if it had been proved true with rigor and professionalism.", "Google had yet another locale for the well-traveled fish, as a reverse image search automatically suggested Queensland as the site of the photograph (as discussed in an August 2015 forum thread). A separate search by image showed that the photograph was originally uploaded in 2010, and it could have been taken (or altered) far earlier. The 2010 result led to a dead link, but the picture was hosted on a web site for a fishing club in the Florida Keys (presumably, a catch of that nature would have warranted a mention by avid sport fishermen).", "On 4 September 2014, the Florida Fish and Wildlife Commission published a status update to Facebook reporting the capture of a large, shrimp-like creature measuring 18 inches long:", "Those photographs didn't match the circulating \"102 lb. shrimp\" image, and the crustacean depicted wasn't technically a shrimp. The documented catch occurred in the Indian River near Fort Pierce, Florida, for which no weight information was provided. Professor of integrative biology Roy Caldwell told LiveScience that the 2014 find was unlikely to have occurred as described, and that photography was an unreliable barometer of mantis shrimp size:", "The specimen caught in Florida belongs to a species of Lysiosquilla, according to Caldwell. Like other members of its species, the creature has three pairs of walking legs and a large, articulated abdomen, Caldwell noted.", "\"This particular group — Lysiosquillidae — are almost all banded yellow and black across their bodies,\" Caldwell said. They can live for 30 years and can grow to be 12 inches (30.5 centimeters) long, he added ... this specimen doesn't belong to the largest of stomatopod species, according to the biologist. That distinction goes to Lysiosquillina maculata, which inhabit the Pacific Ocean from Hawaii to east Africa. Caldwell said the largest known members of the species were 15 inches (38 cm) long.", "Caldwell, who said he's been studying stomatopods for 50 years, said an 18-inch catch is unlikely. Photos, he pointed out, can sometimes be deceiving. He also noted that, with its claws extended, a stomatopod tends to look much longer than it really is. The standard for measuring the creatures is from the tip of the eye to the end of the tail — claws not included.", "Marine biologists doubted that the purported 18-inch long mantis shrimp was as big as estimates claimed in 2014, and it was thrown back almost immediately (preventing further examination). Moreover, the documented newsworthy crustacean catch occurred in September 2014, whereas the viral photo of indeterminate origin existed as early as March 2010.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]