["About this rating", "On 12 December 2016, a user submitted a version of the image reproduced in the Tweet above to Reddit, in an r/pics thread titled \"Groomsman hold up paralyzed groom for his wedding.\" By the following day, the image and its purported backstory were described as \"trending,\" and Cosmopolitan covered them with using a clickbait title (\"This Photo Got Retweeted Over 1.4k Times For The Sweetest Reason\"), in an article that began as follows:", "If there weren't already enough reasons why we love Twitter, here's another: Sometimes, on a normal non-spectacular Friday, whilst casually scrolling through your TL, you stumble across the cutest stories that make you appreciate humanity a little bit more.", "This time, a tweeter shared a photo of a groom being held up by his four groomsmen as he kissed his bride.\"He's paralyzed, but his friends held him up to get married ?? Those are real friends ???,\" @EllaBandzzz tweeted, as she posted the moving photo ... posted on 11th December, is so touching that it's been retweeted nearly 1.5 thousand times, and has over 1,000 Likes.", "Cosmopolitan eventually ceded that the picture's backstory was most likely not as described, but only following multiple emoji-laden paragraphs that created the opposite impression. At best, it seemed odd to leap to the conclusion that the groom was being \"held up\" by several groomsmen in a pose that made no sense for its intended purpose; at worst, it seemed social media hucksters decided to use a random couple's wedding photographs to hawk a made-up story for pageviews.", "The Reddit thread responsible for the image's viral spread was full of impossible-to-ignore comments at the top, in which users disputed the claim because they recognized the pose in the photograph immediately:", "Although blogs and viral picture sites were quite likely sourcing the image from Reddit, none of them appeared to note the large consensus that the photograph depicted a common \"fraternity pose.\" The web site Diply responsibly covered the claims, identifying Instagram user Rita Shaw and new husband Jared as the image's subjects:", "When Rita Shaw posted this lovely moment from her wedding on Instagram three weeks ago, she probably wasn't surprised with the number of likes it received. After all, it's a stunning photo that obviously captured an extremely meaningful moment for her and her husband. However, I'm sure she didn't expect someone to then post the image on reddit with the caption: \"Groomsman hold up paralyzed groom for his wedding.\"", "Take the beautiful wedding photo of Rita and Jared Shaw as a perfect example of just how quickly and easily a fake story can come to life. All it took was a misinformed reddit post to cause this couple's special photo to go viral, but not for a reason they would have ever expected ... I set out to find the truth behind this inspiring image, and eventually, I found the original, which, as I said before, was posted on Instagram by the bride, Rita Shaw ... Along with her image was the caption: \"Happy Founders day to the good Bruhz #RQQ.\" After looking up #RQQ, I found out that it represented Omega Psi Phi, an international fraternity that was founded in 1911 by Howard University students.", "Also included were several images of Jared Shaw, standing and dancing without the assistance of his groomsmen:", "The viral image and its fabricated backstory were considered by many viewers to be harmless and inspiring, but the newly-married Shaws likely had no desire for memories of their special day to be marred by a viral lie. The false backstory was an example of the particularly unsavory practice of reducing disabled people to objects of motivational sentiment (\"inspiration porn\"), eliding the difficulties they face and reducing them to one-dimensional plot devices in syrupy yarns.", "We contacted Rita Shaw via Instagram for comment but have not yet received a response. (Her account has since been set to \"private.\")", "Soper, Katherine.   \"How to Avoid 'Inspiration Porn' When Talking About Disability.\"\r\n    The Mighty.   1 August 2016.", "Diply.   \"People Are So Wrong About This Viral Photo Showing 'Paralyzed Man' Held Up at Wedding.\"\r\n    14 December 2016.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]