["Trinamool Congress (TMC) and BJP have been campaigning ahead of the upcoming assembly elections in West Bengal. On March 19, Newslaundry reported that BJP workers in West Bengal were dissatisfied with the tickets distribution and angry party workers also vandalized the BJP office.", "In the backdrop of this, pictures of BJP workers resorting to physical alteration and vandalism inside what looks like a temporary party office has been shared. BJP flags and people sporting party scarves can be spotted. Rohan Gupta, chairman of the social media department of the Congress, tweeted the images and wrote, “BJP workers showing the trailer of Bengal’s golden future!” At the time of writing, his tweet amassed 8,000 likes and around 2,000 retweets. (Archive link)", "भाजपा के कार्यकर्ता बंगाल के सुनहरे भविष्य का ट्रेलर दिखाते हुए ! pic.twitter.com/9APwAPbbQM", "— Rohan Gupta (@rohanrgupta) March 19, 2021", "Twitter user @i_the_indian_ sarcastically remarked that BJP Bengal workers were practising making the state ‘Sonar Bangla’ from inside the party office. The tweet also carried the hashtag #NoVoteToBJP. Several people in the replies believe that the images are recent.", "Twitter user Kamesh Shivhare INC also tweeted these photos. The replies to his post too suggest that users are linking them with the upcoming polls.", "The pictures have also been posted on Facebook with Bengali messages.", "We found these photos in a tweet dated April 5, 2016, after performing a keyword search on Twitter. According to the tweet, these pictures were taken during a clash between BJP workers in Howrah, West Bengal.", "BJP workers clash in Howrah at a party workers’ convention for Rupa Ganguly,actress&BJP candidate from Howrah North. pic.twitter.com/toDFHVma6T", "— Scotchy(Team) (@scotchism) April 5, 2016", "A Firstpost report dated March 3, 2016, carries two of the viral images. According to the outlet, a clash broke out between BJP workers in Howrah at a party-wide convention for actress and BJP candidate Rupa Ganguly. The photo has been attributed to PTI. The viral photo was also published in a report in The Times of India report from April 2016.", "On April 3, 2016, India TV shared video footage of the skirmish.", "News agency ANI also reported that six people were injured.", "Howrah (West Bengal): 6 injured after two groups of BJP workers clashed in front of BJP candidate Roopa Ganguly pic.twitter.com/B4eUNVxOVK", "— ANI (@ANI) April 3, 2016", "Therefore, photos of clashes between party workers at a BJP event in Howrah, West Bengal back in April 2016 were shared ahead of the upcoming West Bengal assembly polls.", "Donate Now", "Kinjal Parmar holds a Bachelor of Science in Microbiology. However, her keen interest in journalism, drove her to pursue journalism from the Indian Institute of Mass Communication. At Alt News since 2019, she focuses on authentication of information which includes visual verification, media misreports, examining mis/disinformation across social media. She is the lead video producer at Alt News and manages social media accounts for the organization.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]