["About this rating", "Voting in the 2020 U.S. Election may be over, but the misinformation keeps on ticking. Never stop fact-checking. Follow our post-election coverage here.", "In October 2020, a piece of text supposedly written by a person who had just \"finished poll manager training\" was copied and pasted across social media. The text warned readers to be on the lookout as they cast their votes in the upcoming presidential election for poll workers who might write something on their ballots such as a star, a checkmark, a letter, etc. This, according to the viral message, would invalidate their vote.", "One popular early version of this text claimed that this recently trained poll manager was stationed in Myrtle Beach, South Carolina:", "****Myrtle Beach Pay Attention*** Just finished Poll Manager training! I passed all the classes. I want you all to know something...if you are checking in at the polls and they happen to write anything on your ballot...a letter, a checkmark, a star, any writing of any kind...please request a new ballot. Your ballot will not be counted if it is written on. Please be on the lookout for this type of behavior. I know someone in Myrtle Beach who asked me about this during the primaries and I did not understand what it might have meant. Now I know. It disqualifies your ballot. BE ON GUARD!!!", "This claim, in general, is unfounded. Poll workers have practically no reason to mark ballots, and in the rare instance where they might, this would not invalidate a person's vote.", "Angela Westmoreland, a poll training manager for Horry County, where Myrtle Beach is located, commented below this post that \"this is not correct information.\" Westmoreland wrote:", "\"Where did you train? I am the Training Coordinator for Horry County Elections and we have not even started training. Which county do you work for? This is not correct information.\"", "The fact-checking website LeadStories managed to contact officials in Horry County, who also disputed the claims in this post. Chris Whitmire, the director of public information for the South Carolina state election commission, said:", "\"There's no truth to it at all. A poll manager is not going to write anything on your ballot and if they did it's not going to result in your ballot not being counted.\"", "While the above-displayed Facebook post specifically mentioned Myrtle Beach, subsequent versions of this text were circulated without a specific location attached. These posts were often prefaced by a sentence claiming that the poster had received this information from a friend or relative. In other words, the vast majority of people sharing this post didn't seem to have any firsthand knowledge about the issue.", "States are responsible for running their own elections, so it's difficult to make a blanket statement covering all poll-worker training sessions across the country. However, we did reach out to election officials in various states for their interpretation of this post, and they, like the officials in Myrtle Beach, agreed that poll workers have little reason to write on ballots. If they did, it wouldn't invalidate the person's vote.", "Debra O’Malley, a spokesperson for the Office of the Secretary of the Commonwealth in Massachusetts, told us:", "There is no reason any poll worker would ever mark anything on a ballot, with the very rare exception of a challenged ballot. If a ballot is challenged for legal cause, the voter’s name and address, as well as the challenger’s, are written on the ballot to be reviewed only in the case of a recount or court order. Again, this is very rare.", "Ballots are not disqualified at the polling place. If a tabulator cannot read a ballot, the voter is offered a new ballot. If they do not want to spoil their ballot, it is set aside to be counted by hand at the end of the night.", "A spokesperson for the Maryland State Board of Elections provided a similar statement, explaining that poll workers in that state would have little reason to ever mark (or even be momentarily in possession of) a person's ballot, but if it did occur, it would not invalidate that person's vote. The spokesperson also explained some of the security measures that are in place to ensure a person's vote gets counted:", "A poll worker should never have possession of a voter's voted ballot. If a poll worker ever did have a voter's voted ballot and made a mark, it would not disqualify the ballot. It's possible that the mark could impact the ballot's ability to be scanned, but the voter would be present when the scanner rejected it and the voter would be issued a replacement ballot to vote.", "The only time a poll worker may write on a voted ballot is if the voter made a mistake on the ballot and needed a replacement ballot. The poll worker instructs the voter to \"overvote\" every contest on the ballot and write \"Spoiled\" on the ballot, but if the voter didn't write \"spoiled\" on the ballot, the poll worker may need to write it. This is unlikely to occur as the poll worker is with the voter and instructing the voter on each step.", "A spokesperson for Maine's Bureau of Corporations, Elections and Commissions told us: \"The State of Maine does not reject ballots because of a stray mark on the ballot.\"", "North Carolina's representative also confirmed that a poll worker writing on a person's ballot would \"absolutely not\" cause that vote to be rejected. However, it is commonplace (in fact, it's required), for a poll worker to mark a ballot. The spokesperson explained that poll workers in North Carolina must write the voter's \"one-stop\" number on their ballot, saying:", "In North Carolina, poll workers must write the voter’s one-stop (OS) number on the ballot. This is part of the process in NC that allows us to retrieve ballots if challenged, etc. They also write the voter’s precinct on the ballot so that one-stop early voting ballots can be sorted back into the proper precincts after the election for reporting and data purposes. Early voters can cast their ballot at any early voting site in their county.", "In short, this text does not appear to have originated with a person who recently completed poll-manager training, and the vast majority of people sharing this message are doing so without any firsthand knowledge of this issue. It should also be noted that poll workers have practically no reason to write on a person's ballot. In the rare circumstance where it is warranted, this would not invalidate a person's ballot.", "Perkins, Lucy.   \"Despite Surge in Volunteers, Some Swing States Still Need Poll Workers.\"\r\n    NPR.   10 October 2020.", "Eavis, Victoria.   \"Fact Check: Poll Managers in Myrtle Beach Have NO Reason to Write on Ballot and It Will NOT Be Disqualified If a Poll Manager Writes on It.\"     LeadStories.   9 October 2020.", "15 October 2020 [Updated]: Added statements from officials in Maine, North Carolina, and Maryland.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]