["About this rating", "Real estate tycoon-cum-presidential candidate Donald R. Trump is legendary for his high-octane Twitter feuds, having blasted — and been blasted in return by — a veritable pantheon of high-profile media personalities.", "He called HBO comedian Bill Maher a \"dummy,\" for example:", "Check @billmaher’s background & you will find he is not a smart guy—he just wants people to think he is--just call him dummy.", "— Donald J. Trump (@realDonaldTrump) February 12, 2013", "After singer Cher tweeted insulting remarks about him, Trump took her to task over her \"dying career\":", ".@cher should spend more time focusing on her family and dying career! — Donald J. Trump (@realDonaldTrump) November 13, 2012", "He belittled Dallas Mavericks owner Mark Cuban as a \"massive failure\":", "@mcuban is a short ball hitter who had a massive failure on television, The Benefactor. Now he is one of many on a modest ratings show, S T. — Donald J. Trump (@realDonaldTrump) May 11, 2013", "And he not only questioned President Obama's mental health but also called him a \"psycho\":", "I am starting to think that there is something seriously wrong with President Obama's mental health. Why won't he stop the flights. Psycho! — Donald J. Trump (@realDonaldTrump) October 16, 2014", "Many people weren't surprised, then, when a series of tweets surfaced appearing to show Trump going after God Himself, dismissing the creator of the universe as a \"one of the dumbest and worst jerks of all time,\" a \"dope\" and a \"clown\":", "Except that, unlike the previous examples, these tweets weren't real. They were the centerpiece of a spoof dreamed up by the folks who run a satirical web site called TheGoodLordAbove, which purports to be God's own web presence. The site's disclaimer reads as follows:", "Thou shalt remember that The First Amendment protects satire as a form of free speech and expression. TheGoodLordAbove uses invented names in all of its stories, except in cases where public figures are being satirized. Any other use of real names is accidental and coincidental. TheGoodLordAbove is not intended for readers under 18 years of age.", "Donald Trump has never, to our knowledge, actually tweeted smack about God. But stay tuned.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]