["About this rating", "On behalf of the U.S. government, Robert Mueller delivered a sample of highly enriched uranium confiscated from smugglers in Georgia to Russian authorities for forensic examination in 2009.", "There was nothing nefarious in the transfer of the ten-gram sample, which was done at the request of Russian law enforcement and with the consent of the government of Georgia, whose agents had participated in its confiscation.", "In May and June 2017, a number of hyperpartisan news and opinion web sites published articles reporting that former Federal Bureau of Investigation director Robert Mueller, who in mid-May was named special counsel in the Justice Department's investigation into alleged ties between the Trump presidential campaign and Russian officials, was himself enmeshed in \"secret dealings\" with Russia related to his 2009 delivery of a sample of highly enriched uranium (HEU) to Moscow ordered by Hillary Clinton.", "The conspiracy web site Intellihub noted that the transfer was revealed in a WikiLeaks release of a classified State Department cable:", "Former Secretary of State Hillary Clinton facilitated the transfer a highly enriched uranium (HEU) previously confiscated by the U.S. Department of Energy (DOE) during a 2006 “nuclear smuggling sting operation involving one Russian national and several Georgian accomplices,” a newly leaked classified cable shows.", "So-called “background” information was provided in the cable which gave vague details on a 2006 nuclear smuggling sting operation in which the U.S. government took possession of some HEU previously owned by the Russians.", "The secret “action request,” dated Aug. 17, 2009, was sent out by Secretary of State Clinton and was addressed to the United States Ambassador to Georgia Embassy Tbilisi, the Russian Embassy, and Ambassador John Beyrle. It proposed that FBI Director Robert Mueller be the one that personally conduct the transfer a 10-gram sample of HEU to Russian law enforcement sources during a secret “plane-side” meeting on a “tarmac” in the early fall of 2009.", "The WikiLeaks release was announced via Twitter on 18 May, the day after Mueller was appointed special counsel:", "WikiLeaks cable Robert Mueller delivering highly enriched stolen Uranium to Russia in 2009 https://t.co/X3Ea2m6kS5 h/t @apblake pic.twitter.com/yhC91B2IBK", "— WikiLeaks (@wikileaks) May 18, 2017", "Intellihub characterized the plane-side transfer of uranium \"shocking\" and \"rather reminisce [sic] of the infamous [then-Attorney General] Loretta Lynch/Bill Clinton meeting which occurred on a Phoenix, Arizona, tarmac back in June of 2016\" (which meeting was cited by former FBI Director James Comey as the reason he concluded the Department of Justice wasn't capable of an independent investigation into Hillary Clinton's e-mail issues at the State Department).", "Read in its entirety, however, the cable itself reveals nothing questionable or nefarious about the transfer of evidence between Mueller and a similarly placed Russian law enforcement official in Moscow. It merely asked the U.S. Embassy in Moscow to inform the Russian government that the transfer, which was postponed from an earlier date, would take place on 21 September 2009.", "Moreover, it provided a complete explanation of why the transfer was taking place:", "2. (S/NF) Background: Over two years ago Russia requested a ten-gram sample of highly enriched uranium (HEU) seized in early 2006 in Georgia during a nuclear smuggling sting operation involving one Russian national and several Georgian accomplices. The seized HEU was transferred to U.S. custody and is being held at a secure DOE facility. In response to the Russian request, the Georgian Government authorized the United States to share a sample of the material with the Russians for forensic analysis. Director Mueller previously planned to deliver the sample in April (Ref A), but due to a scheduling conflict the trip was canceled. Embassy Moscow LegAtt informed the FSB prior to Mueller's intended April delivery and received confirmation that the FSB would take custody of the sample after the Director's plane landed. EST Moscow also informed Rosatom of the planned transfer and that the U.S. placed a high priority on completing this transfer (Ref B). Once the LegAtt told FSB counterparts the April trip had been canceled, Ambassador Beyrle informed Igor Neverov (Ref C), who said that he understood but was disappointed the trip was postponed. The September 21 visit provides again an opportunity to deliver the requested ten-gram sample from the seized HEU in order to obtain cooperation from the GOR on this nuclear smuggling case and to eventually establish a more productive mechanism of U.S.-Russian cooperation on nuclear forensics.", "The 2006 sting operation was widely reported after the fact by U.S. newspapers, including the Washington Post:", "Republic of Georgia authorities, aided by the CIA, set up a sting operation last summer that led to the arrest of Russian man who tried to sell a small amount of nuclear-bomb grade uranium in a plastic bag in his jacket pocket, U.S. and Georgian officials said.", "The operation, which neither government has publicized, represents one of the most serious cases of smuggling of nuclear material in recent years, according to analysts and officials.", "Despite partisan attempts to make it appear conspiratorial, the transfer of the sample of confiscated uranium was simply an instance of cooperative law enforcement between three countries: the U.S., Georgia, and Russia. The Russia government requested a sample of the uranium for forensic testing, the Georgian government signed off on it, and the U.S. government carried out the delivery.", "The total amount of HEU confiscated in the sting was 3.5 ounces (about 100 grams). The amount Mueller delivered to the Russians was ten grams (the weight of four U.S. pennies).", "Ambellas, Shepard.   \"Hillary Clinton Requested FBI Dir. Mueller Deliver Highly Enriched Uranium to the Russians in 2009 in Secret 'Plane-Side Tarmac Meeting.'\"\r\n   Intellihub.   19 June 2017.", "Butler, Desmond.   \"Georgian Sting Seizes Bomb Grade Uranium.\"\r\n   Associated Press.   24 January 2007.", "Cohen, Zachary.   \"Comey Cites Lynch-Clinton Meeting for Lost Faith in Justice Investigation.\"\r\n   CNN.   3 May 2017.", "The Last Great Stand.   \"Hillary Told FBI's Mueller to Deliver Uranium to Russians in 2009 'Secret Tarmac Meeting.'\"\r\n   20 June 2017.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]