["The photo was published on Instagram here on June 16, 2020. The post has since been liked nearly 50,000 times.", "The post’s caption reads: “Brave daughter of Col Santosh Babu.”", "The photo was also shared alongside similar claims on Facebook here, here, here and here; on Twitter here and here; and on Instagram here, here and here.", "Colonel Bikumalla Santosh Babu was one of the 20 Indian soldiers who were killed in violent border clashes with Chinese troops on June 15, according to the Indian army. The confrontation marked the first deadly incident in a long-running border dispute between the two countries in decades, AFP reported here.", "However, the claim about the photo showing Babu’s daughter is false.", "A reverse image search on Google found the same photo published on Twitter here by Akhil Bharatiya Vidyarthi Parishad (ABVP), a right-wing student organisation. ABVP organised a memorial for Babu near the city of Bengaluru on June 16.", "The June 16 tweet from ABVP reads: “Lets pay our homage to Col Santosh Babu, Commanding Officer of 16 Bihar Regiment martyred today in retaliation with china. Tributes by lighting the lamp for the martyred soul by Bengaluru Rural group.”", "On June 17, ABVP posted another tweet that stated the girl is the sister of an ABVP employee.", "Sunil Bhat, ABVP’s co-convenor of social media, also denied that the girl is the daughter of the late soldier.", "“This girl is not the daughter of the martyred soldier, her name is Ms. Manashri and she is a sister of one of our organisation workers. This photo is from an event that was held in Nelamangala administrative district, near Bengaluru,” Bhat told AFP by phone on June 22, 2020.", "Babu's cremation and official funeral procession took place on June 18 in his hometown Suryapet, a city in the southern state of Telangana, according to ANI news agency.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]