["About this rating", "Committees working on behalf of President Barack Obama's 2012 re-election campaign unknowingly received approximately $1.87 million in foreign contributions as a result of an alleged criminal conspiracy to funnel illegal donations to the campaign and conceal their true source.", "The foreign contributions actually received by the campaign as a result of the scheme amounted to a small fraction of the $21.6 million figure claimed. No evidence yet produced documents that the campaign was aware of the illegal origins of the funds, which were concealed behind an elaborate network of shell bank accounts and straw donors.", "On 10 May 2019, the U.S. Department of Justice (DOJ) unsealed an indictment charging two men, American entertainer Prakazrel “Pras” Michel and Malaysian financier Low Taek Jho (aka \"Jho Low\"), with conspiring to make and conceal foreign campaign contributions in the 2012 U.S. presidential election.", "U.S. law prohibits foreign nationals from contributing to federal, state, or local election campaigns. It also prohibits donors from making campaign contributions in anyone else's name. The defendants stand accused of conspiring to do both, as well as making false statements to the Federal Election Commission (FEC).", "A DOJ press release enumerated the charges:", "According to the indictment, between June 2012 and November 2012, Low directed the transfer of approximately $21,600,000 from foreign entities and accounts to Michel for the purpose of funneling significant sums of money into the United States presidential election as purportedly legitimate contributions, all while concealing the true source of the money. To facilitate the excessive contributions and conceal their true source, Michel paid approximately $865,000 of the money received from Low to about 20 straw donors, or conduits, so that the straw donors could make donations in their names to a presidential joint fundraising committee. In addition, Michel personally directed more than $1 million of the money received from Low to an independent expenditure committee also involved in the presidential election in 2012.", "The indictment also alleges that by funneling campaign contributions through straw donors, Michel caused a presidential joint fundraising committee to submit false reports to the Federal Election Commission (FEC), including a false amended report in June 2013. The committee’s reports were false because they identified the straw donors, rather than Low or Michel, as the true source of the contributions. In addition, the indictment alleges that by contributing more than $1 million of the money he received from Low to an independent expenditure committee, Michel also caused that committee to submit false reports to the FEC, insofar as those reports identified Michel as the source of the contributions when, in fact, it was Low. The indictment further alleges that in June 2015, Michel submitted a false declaration to the FEC in which he claimed that he had no reason to conceal the true source of his contributions to the independent expenditure committee in 2012, even though Michel knew that the true source of that money was Low and that Michel had funneled the foreign money into the election.", "Although the recipient(s) of the illegal contributions weren't named in the indictment, it was clear from the context that they were campaign committees working on behalf of the re-election of President Barack Obama (referred to in the document as \"Candidate A\"). The object of the conspiracy, according to the DOJ, was \"to gain access to, and potential influence with, Candidate A and his administration.\"", "Mainstream news media coverage of the indictment focused on the alleged conspirators and the details of their plot to defraud the Obama campaign and the FEC. Despite the fact that no one in the campaign was implicated in the conspiracy or charged with crimes, a decidedly different narrative emerged on an assortment of right-leaning, pro-Trump websites and social media accounts. An 11 May 2019 article on Intellihub.com, for example, bore the headline \"How Barack Obama received $21.6M in illegally funneled foreign campaign contributions and stole the presidency.\"", "\"According to reports circulating at the highest levels in Washington,\" the article said, \"former U.S. President Barack H. Obama’s political campaign received at least $21.6 million in illegal foreign campaign contributions during the run-up to the 2012 presidential election.\"", "The sentence was subsequently quoted in an editorial published on at least a half-dozen other hyperpartisan blogs and websites with headlines falsely claiming that a \"media blackout\" was in place regarding the indictment. A significant chunk of the editorial was devoted to the text of what was described as \"the DOJ Report, in full\" — although, in point of fact, what was referenced was only the DOJ press release, which distilled the 20-page document down to just a few paragraphs. The author of the piece then posed (and presumed to answer) these rhetorical questions:", "Do you think they will be questioning Barack Obama in this matter?", "Of course not.", "Let’s not worry about Obama accepting 21.6 million in foreign contributions. Let’s just worry about those responsible for delivering the money.", "Do you think Obama’s people were so stupid that they didn’t know that this money was illegally coming from foreign interests?", "If you believe our former President is completely innocent in this matter then you must be a reality-denying, fantasy-loving, snowflake Democrat.", "The same propagandistic strategy was employed by pro-Trump social media users. This example was tweeted on 15 May:", "Tea Party PAC) – What have you heard constantly for the last two years?\nTrump colluded with a foreign government to win his election. And yet, what did Obama do during his last campaign?\nAccept millions in foreign donations to get elected.\nHmmm! pic.twitter.com/xX3u7yJBBE", "— Fightforliberty (@FightonUSA) May 15, 2019", "These claims are factually erroneous and logically invalid, on these three grounds:", "First, the Obama campaign did not receive all $21.6 million of the foreign funds the DOJ says Jho transferred to Michel for that purpose, or anywhere near that amount. Both the indictment and the DOJ's press release said the actual amount funneled to the campaign totaled approximately $1.87 million:", "\"To facilitate the excessive contributions and conceal their true source, Michel paid approximately $865,000 of the money received from Low to about 20 straw donors, or conduits, so that the straw donors could make donations in their names to a presidential joint fundraising committee. In addition, Michel personally directed more than $1 million of the money received from Low to an independent expenditure committee also involved in the presidential election in 2012.\" (DOJ press release)", "Second, as we stated before, nowhere in the indictment was Obama or any entity involved in the campaign implicated in the conspiracy or charged with a crime. The indictment stated multiple times that the defendants went to elaborate lengths to hide what they were doing, not only from the FEC but from the campaign itself. Committees connected with the campaign unknowingly accepted the foreign donations via a series of shell bank accounts and straw donors set up by Michel and Jho to disguise the true source of the funds.", "Page 2 of the indictment states:", "\"The defendants concealed the scheme from the candidate, the candidate's campaign and administration, federal regulators, and the public by secretly funneling foreign money from JHO LOW through a series of straw donors (also known as \"conduits\" or \"straw contributors\") who purported to make legal campaign contributions in their own names, rather than in the names of the true source of the funds. MICHEL concealed the conspiracy by making and causing false statements to be made to the FEC. \"", "Page 8 of the indictment states:", "\"MICHEL, Company E, and the straw donors made contributions to Political Committees A and B in their own names, rather than the name of JHO LOW, thus concealing the true source of the contributions. As a result, MICHEL caused Political Committees A and B to make false entries in multiple campaign contribution reports submitted to the FEC about the true source of the contributions. To further conceal the true source of the contributions, and to maintain his appearance as a high dollar fundraiser for Candidate A, MICHEL made false entries in a declaration he submitted to the FEC claiming that he was the source of the contributions to Political Committee B.\"", "Last, the supposition that these illegal contributions enabled Obama to win (or \"steal\") the election is absurd, considering that the campaign raised (and spent) roughly $722 million in total, of which the actual donations Jho and Michel managed to funnel to the committees amounted to about one-quarter of one percent (0.25%).", "Ambellas, Shepard.   \"How Barack Obama Received $21.6M in Illegally Funneled Foreign Campaign Contributions and Stole the Presidency.\"\r\n    Intellihub.   11 May 2019.", "Farrell, Greg.   \"1MDB's Jho Low, Rapper Pras Michel Indicted Over Obama Donation.\"\r\n    Bloomberg.   10 May 2019.", "Garrison, Dean.   \"Bombshell: Media Blackout as DOJ Announces Obama Accepted at Least $21.6 Million in Foreign Donations for 2012 Re-Election.\"\r\n    The Sons of Liberty Media.   14 May 2019.", "Stack, Liam.   \"Fugees Rapper Pras Michel and Financier Charged in Illegal Scheme to Raise Money for Obama.\"\r\n    The New York Times.   10 May 2019.", "OpenSecrets.org.   \"2012 Presidential Race: Summary.\"\r\n    Accessed 24 May 2019.", "U.S. Dept. of Justice.   \"Entertainer/Businessman and Malaysian Financier Indicted for Conspiring to Make and Conceal Foreign and Conduit Contributions During 2012 U.S. Presidential Election.\"\r\n    10 May 2019.", "U.S. Dept. of Justice.   \"Indictment: Prakazrel, Michel, Low Taek Jho.\"\r\n    10 May 2019.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]