["Social media posts claim the Pfizer-BioNTech Covid-19 vaccine is “poison” because it contains potassium chloride -- a chemical also used to stop the heart during a process of lethal injection. The claim is false; the coronavirus vaccine was tested for safety in clinical trials, and medical experts say the minimal amount of potassium chloride used in the shot will not harm recipients.", "“Pfizer’s vaccine got the same poison, that they use with USA lethal injections at the prisons. It’s called POTASSIUM CHLORIDE,” claims a December 20, 2020 tweet.", "A December 18, 2020 tweet, also calling the vaccine “poison,” includes an image of the product information for the Pfizer-BioNTech shot along with the text, “Pfizer’s Covid-19 vaccine comes with potassium chloride - the same drug used for executions of death row inmates!”", "The image can be found on Instagram, including in one post claiming, “It’s a cocktail of poison y’all!!!”", "It was also shared hundreds of times on Facebook as the United States and Canada approved the Pfizer-BioNTech Covid-19 vaccine for emergency use in December amid rising numbers of coronavirus infections.", "However, potassium chloride is a natural substance, regulated by the human body.", "Libby Richards, associate professor at the Purdue School of Nursing, told AFP by email: “Potassium chloride is found in almost all of the food we eat -- meats, fruits, cereals, chips, baby formulas.", "“If you drink bottled water, you are drinking potassium chloride which is then absorbed into your bloodstream.”", "Asked about its use in vaccines, Richards said: “The ingredients in vaccines are carefully chosen and very closely monitored for safety.", "“The amount of potassium chloride found in vaccines is very, very small and absolutely considered a safe amount.”", "According to the US Food and Drug Administration, each dose of the Pfizer-BioNTech Covid-19 vaccine contains .01 milligram of potassium chloride.", "That is “equivalent to a pinch of salt,” Scott Halperin, director of the Canadian Centre for Vaccinology, explained by phone.", "Halperin, who teaches at Canada’s Dalhousie University, said that potassium chloride is used in many vaccines because it is a salt, and “when making a viral vaccine, you need to have the proper amount of salts to keep cells alive. Because it’s a natural product that all cells need, it’s also put into cell cultures.”", "Pfizer-BioNTech was the first to complete a large-scale, phase 3 clinical trial for a Covid-19 vaccine on patients older than 16. It was found to confer 95 percent protection against the virus with no serious safety issues.", "Both the US Centers for Disease Control and Prevention and Health Canada are carefully monitoring all adverse effects to the vaccine as it is offered to larger portions of the population.", "AFP Fact Check previously reported on misleading claims about potassium chloride in vaccines here. More reporting on misinformation surrounding the Pfizer-BioNTech Covid-19 vaccine is available here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]