["City Blue Imaging Services says it does not do ballot printing.", "Another Rochester, N.Y., company, Phoenix Graphics, is the one that was contracted by New York City election officials to print and distribute ballots; thousands of those ballots were defective.", "A Facebook post falsely claims that a business building in Rochester, N.Y., that burned to the ground was known for printing ballots.", "\"You know what else happened yesterday??? City Blue Imaging Services in Rochester NY burned to the ground. They printed ballots there. If you search them you’ll see they’re the ones who had ballots misprint errors for the ballots sent to NYC,\" said a Dec. 27 Facebook post.", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.) We saw a similar claim through our partnership with TikTok.", "A building housing City Blue Imaging Services was destroyed in a Christmas Eve fire, according to a Dec. 25 report from WHAM, a TV channel in Rochester.", "But City Blue Imaging Services isn’t in the business of printing ballots. The services advertised on its website include the printing of banners, signs and posters. We found no mention of election ballot printing as one of the services offered.", "\"NO, we do not do ballot printing. We don’t have the equipment and it’s not a specialty we would be involved with. We are mainly doing blue printing and marketing,\" City Blue Imaging tweeted Dec. 27 in response to a tweet from someone asking it to \"set the record straight.\"", "In a follow-up tweet, the company also said it does not do work for Phoenix Graphics — that’s a separate company, also based in Rochester, which New York City election officials picked to print and mail absentee ballots to Brooklyn and Queens voters for the 2020 election. Nearly 100,000 voters, mostly in Brooklyn, received defective absentee ballots, and the New York City Board of Elections blamed Phoenix Graphics for that problem, the New York Times reported.", "In one of its tweets addressed to \"misinformed people\" on Twitter and Instagram, City Blue Imaging Services also said it \"was never owned by the owner of\" Phoenix Graphics.", "A Facebook post claimed that City Blue Imaging \"printed ballots there. If you search them you’ll see they’re the ones who had ballots misprint errors for the ballots sent to NYC.\"", "That’s not true. City Blue Imaging Services says it does not do ballot printing. Another company, Phoenix Graphics, is the one that was contracted by New York City election officials to print and distribute ballots; thousands of those ballots were defective.", "We rate the post False.", "Facebook post, Dec. 27, 2020", "City Blue Imaging Services website, accessed Jan. 5 2020", "City Blue Imaging Services, post on Instagram, Nov. 3, 2020", "Monroe County Democratic Committee, Facebook post, Nov. 3 2020", "Twitter, @cityblueimaging tweet, tweet, Dec. 27, 2020", "The New York Times, Nearly 100,000 Defective Absentee Ballots Sent to N.Y.C. Voters, Published Sept. 29, 2020, Updated Nov. 3, 2020", "13WHAM.com, Rochester business destroyed in Christmas Eve fire, Dec. 25, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]