["About this rating", "In January 2018, President Trump reportedly used the term \"shithole countries\" during a discussion about protections for immigrants from Haiti, El Salvador, and African nations, saying he would rather have immigrants from Norway. During the ensuing controversy, which included news anchors bluntly called him a racist, and Haiti and Botswana demanding an apology, one satire blog published an article claiming that Norway had renamed itself \"shithole\" in order to send a message to the U.S. President:", "(Oslo, Shithole) After being singled out by President Trump as a preferable source of immigration compared to ‘shithole’ nations like Haiti and many countries in Africa, Norway has taken the drastic step of renaming itself to show it does not approve of such behavior.", "[...]", "“We Norwegians are a pragmatic people who don’t much care what the country is called. If renaming it Shithole sends a progressive message of goodwill then that’s what being Norwegian is all about.”", "This, of course, is not a genuine news article. Norway did not officially change its name to Shithole.", "Breaking Burgh is a satire web site that does not publish factual stories. The web site states clearly in its header that it is a \"satirical blog serving Western Pennsylvania.\" They reiterate this point again (and then again) in their about page:", "Welcome to Breaking Burgh, a satirical blog serving Western Pennsylvania and beyond.", "In case you read that too quickly, it’s SATIRE, so put that lawyer back in your pocket.", "Although Oslo has not officially responded to Trump's alleged remarks, many outlets noted that Norwegians don't currently have much incentive to immigrate to the United States:", "Norway is the world’s happiest country (the U.S. ranks 14), the place with the most political freedom (the U.S. ranks 45), most press freedom (the U.S. ranks 43rd), and most prosperity (the U.S. ranks 18). Simply put, there’s little economic incentive for Norwegians to immigrate to the U.S.", "Leonhardt, David.   \"Donald Trump’s Racism: The Definitive List\"\r\n    The New York Times.   15 January 2018.", "BBC.   \"Donald Trump Must Apologise for Comments - African Union\"\r\n    12 January 2018.", "Calamur, Krishnadev.   \"Why Norwegians Aren't Moving to the U.S.\"\r\n    The Atlantic.   12 January 2018.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]