["A video circulating online purports to show a passenger on board the Sriwijaya Air plane that plunged into the sea off Indonesia's capital Jakarta on January 9, 2021. The claim is false; the footage was actually taken from a plane crash off the coast of Hawaii in 2013.", "The video was published here on Facebook on January 10, 2021.", "“The Indonesian pilot tried to land gently on water. The video was recorded by a passenger onboard. I give my sympathy to them,” the post’s Burmese-language caption reads.", "A Sriwijaya Air jet carrying 62 people crashed into the sea on January 9, 2021 just four minutes after setting off from Jakarta, bound for Pontianak city on Borneo island, a 90-minute flight away.", "The footage has been widely shared on Facebook alongside similar claims, including here, here and here; and on various websites around Asia, including here, here and here.", "However, the claim is false.", "A reverse image search on Google for a screenshot of the footage found this video in a report about a plane that crashed off the coast of Hawaii on December 11, 2013.", "It was published by US broadcaster ABC News on January 10, 2014.", "The report’s headline reads: “See Terrifying Video of Hawaiian Plane Crash From Inside the Cabin”.", "“Dramatic video of a plane crash that killed a woman off the coast of Hawaii last month shows the moment of impact and an orderly evacuation of the fuselage by passengers, who used plane debris to stay afloat as they waited to be rescued,” the report reads.", "“Passenger Ferdinand Puentes, 39, was on the 2002 Cessna Grand Caravan and captured the footage of passengers' bracing for impact moments before the plane crashed into the water Dec. 11.”", "The footage shows passengers putting on life jackets and making their way out the plane's emergency exits after it was forced to land on the water.", "ABC News published the same video on YouTube on January 10, 2014.", "Below is the screenshot comparison of the misleading video (L) and ABC news’ video (R):", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]