["About this rating", "Gary Johnson said during a 2011 press club luncheon that 'global warming is in our future' and 'the sun is going to actually grow and encompass the Earth.'", "Johnson criticized proposed spending on global warming as a largely ineffective waste of money, but he didn't literally say that we should do nothing about global warming because the sun will eventually envelop the Earth anyway.", "As part of the usual media probing of virtually everything a presidential candidate has ever publicly said or done, in September 2016 multiple news sources reported that Libertarian candidate Gary Johnson had once proclaimed that efforts to combat global warming were futile because the sun would eventually engulf and destroy the Earth:", "Libertarian presidential candidate Gary Johnson has waffled quite a bit on the climate change issue, finally settling on a pretty hilarious stance: there’s no real reason to spend government resources on trying to slow global warming because eventually, the earth will be enveloped by the white-hot heat of the expanding sun.", "He’s not wrong, he’s just forgetting a few billion years of possible human habitation time between then and now.", "The sun expanding as it grows into a red giant in its natural lifespan of a star is something that will eventually affect the earth and any of its unfortunate inhabitants, but scientists say that won’t happen for another five billion years. Considering that our planet is only about four and a half billion years old, and that humans have only inhabited the earth for about 200,000 years, another five billion years is a whole lot to work with.", "These reports originated with comments Johnson made back on 11 August 2011 during an appearance at a National Press Club luncheon.  When Johnson, a former two-term governor of New Mexico, was asked by moderator Mark Hamrick about how he viewed the issue of climate change and what the government's role in mitigating it should be, he responded as follows:", "Well, climate change — I think the world is getting warmer. I think that it’s man-caused. That said, should we be engaged in cap and trade taxation? No. I don’t think that we should. We should lend certainty to the energy field. We should be  building new coal-fired plants. When you look at the amount of money that we’re looking to spend on global warming, in the trillions, and look at the result, I just argue that the result is completely inconsequential to the money that we would end up\nspending, and that we could direct those monies in other ways that would be much more beneficial to mankind.", "We have a long-term view. Should we take the long-term view when it comes to global warming? I think that we should. And the long-term view is that in billions of years, the sun is going to actually grow and encompass the Earth, right. So global warming is in our future.", "There's no question that Johnson said this, but what he meant when he said it is debatable.  Although he did suggest that money currently being dedicated to address global warming was being spent ineffectively, he didn't literally say that we should do nothing about global warming because the sun will someday expand and destroy the Earth regardless.", "So what did Johnson mean? His remarks clearly indicate that he believes global warming is anthropogenic (i.e., caused by man) and that he is aware the destruction of the Earth by its sun is billions of years off, so clearly he wasn't speaking from total scientific ignorance.", "Remarks Johnson made earlier in the luncheon reinforced that he didn't actually say we should ignore global warming because it's not not a serious issue and/or because non-anthropogenic warming will kill us all eventually regardless, but rather that some current proposals would involve the expenditure of huge amounts of money to achieve disproportionately small results, and those monies would therefore be better directed elsewhere (i.e., towards different solutions to global warming or in other ways):", "I happen to believe that global warming is happening, and that it is man-caused. But, that said, what should we do about global warming? Well, I don’t think we should implement cap and trade legislation. And, for the millions of dollars, if not trillions of dollars that we’re looking to tax carbon emission, I don’t think it’s going to make a difference at all, long-term. And that those resources could be directed in many more effective ways.", "But still, why did he mention the ultimate destruction of the Earth by the sun billions of years from now? What was his point?  Perhaps his statement was, as some critics content, a flippant, ridiculous, or ignorant justification for not spending much money on global warming and assigning the issue a low priority because it's an unsolvable problem in the long term.  Or perhaps Johnson was trying to make a point by satirizing those who would defend spending trillions of dollars now on approaches that may do little to ameliorate the problem (rather than waiting for better or most cost-effective solutions), under the guise that they're taking a \"long-term view\" — that is, demonstrating  the folly of stretching a \"long-term view\" to an absurd extreme.", "Which was it?  We can't say for sure, but given that Johnson asserted the very same thing during the course of an interview about environmental issues several months later, we'd have to come down on the side of the former:", "The long-term consequence of our existence in the whole scheme of things is the sun is getting closer to the Earth and that at a point in the very distant future, the sun will actually encompass the Earth. So global warming is something that’s going to be inevitable.", "For what it's worth, the official Johnson-Weld campaign site reiterates the candidates' position that global warming is (\"probably\") a real and man-made issue, but that government-imposed regulations on the private sector are not an effective means of addressing it:", "When it comes to global climate change, Johnson and Weld believe that the politicians in Washington, D.C. are having the wrong debate.", "Is the climate changing? Probably so.", "Is man contributing to that change? Probably so.", "But the critical question is whether the politicians’ efforts to regulate, tax and manipulate the private sector are cost-effective — or effective at all. The debate should be about how we can protect our resources and environment for future generations. Governors Johnson and Weld strongly believe that the federal government should prevent future harm by focusing on regulations that protect us from real harm, rather than needlessly costing American jobs and freedom in order to pursue a political agenda.", "Bowerman, Mary.   \"Gary Johnson: Forget About Climate Change, Sun Will Someday Encompass Earth.\" \r\n    USA Today.   23 September 2016.", "Schulman, Jeremy.   \"Gary Johnson Wants to Ignore Climate Change Because the Sun Will Destroy the Earth One Day.\" \r\n    Climate Desk.   22 September 2016.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]