["About this rating", "A video uploaded to YouTube on 1 October 2017 asserted that the mighty Mississippi River was \"going dry,\" and that its diminishing water level was attributable to a crack in the ground that had opened up near the New Madrid fault:", "The video touched on a variety of topics in its eight-and-a-half minute runtime, but its overall premise was stated in the description provided by its uploader, MrMBB333: \"Has a crack formed in the bottom of the Mississippi River leaking water down into the New Madrid Fault? The Mighty Mississippi is getting very low, even bone dry in some places. No drought .... where is the water going?\"", "Despite using images of dry river beds, screenshots of a map from the United States Geological Survey (USGS), and testimonials from anonymous sources, the video maker's claim that the Mississippi River is \"going dry\" is unsupported by any hydrologic data. Such an occurrence would involve an anomalous loss of water, which would be documentable via a variety of scientifically rigorous methods.", "The obvious approach would be to look at water levels from areas near the Mississippi River and close to the New Madrid fault and see if the current levels there are lower than usual when compared with historical data, and this is the approach USGS Research Statistician David Smith took when we asked him about the \"going dry\" claim. As an example, he pulled up historical data from a well in the the town of Caruthersville, Missouri, which lies directly over the New Madrid fault and adjacent to the Mississippi River. Its levels were normal (if not higher than average) for this time of year, Smith told us:", "The Caruthersville well lies directly over the New Madrid Fault and it shows that its is normal for this time of year. In fact, it is well above its low during the 2012 drought.", "Smith also took umbrage at the video maker's claim that there has been no drought in the area that could be responsible for differing water levels. This, too, he told us, is false:", "The Bootheel, Southeast Ozarks, and the area covering the New Madrid fault have been abnormally dry despite what the creator of the video states. Water levels are somewhat low for this time of year but they are well within normal range. Farmers have pumped a lot of water for irrigation the past few months.", "John Schumacher, the supervisory hydrologist at the USGS-Missouri Water Science Center, took another approach to the problem. Schumacher compared the river's flow both upstream and downstream of the New Madrid fault and found no evidence of a \"mystery\" lost flow:", "I pulled the last 30 days flow from Mississippi River at Thebes and the Ohio River at Olmsted (both upstream of the New Madrid) and Mississippi River at Memphis (downstream New Madrid).", "The 30-day average flow of Thebes plus The Ohio is ~217,000 ft/s compared to ~249,000 at Memphis. So there is no \"mystery\" lost flow as the Mississippi River flows through the New Madrid Zone. There is the expected slight increase from smaller ungaged tributaries in between Thebes and Memphis and diffuse GW inflow.", "In the video, the narrator makes the claim that the opening of the New Madrid fault (which does not show up in hydrologic data) could perhaps be attributed to the devastating earthquakes that struck Mexico in late 2017:", "What if something triggered the New Madrid? Not to a complete quake yet because there have been no significant quakes along the New Madrid. All I’m saying is there was a lot of movement, a big thrust, especially with the 8 pointer [in Mexico], what if the water is disappearing. I’m just trying to think outside the box here. What if the water is disappearing into that fracture. Because it’s right above the New Madrid fault zone.", "Although the seismologists whom we spoke with were not comfortable using absolute terms such as \"impossible,\" they were skeptical that the Mexico quakes would have had much effect on conditions along the New Madrid fault 1,200 miles away. William Newman, a professor of seismology at UCLA, told us that \"How much stress from the Mexican event can increase the likelihood or probability of rupture near the New Madrid fault is very difficult to ascertain, but is likely very small.\"", "Regardless of seismological explanations (or lack thereof), claims that the Mississippi River is losing an anomalous amount of water through some unexplained process are false. The river's water is where scientists expect it to be, in normal quantities.", "United States Geological Survey.   \"USGS 361145089394101 Caruthersville, Well Site.\"\r\n    Accessed 10 October 2017.", "United States Drought Monitor.   \"Map for October 12, 2017.\"\r\n    Accessed 10 October 2017.", "Dan Evon is a former writer for Snopes.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]