["By Saranac Hale Spencer", "Posted on July 11, 2018 | Updated on July 11, 2018", "Q: Did The New York Times say in 1984 that Donald Trump would be “our best president”?", "A: No. That year The New York Times published a magazine story featuring Trump’s early success as a businessman, not his political potential.", "In 1984, when President Donald Trump was just a real estate developer and man-about-town in New York City, The New York Times Magazine published a feature story about him.", "It makes no mention of his suitability for public office.", "Rather, the 7,000-word story details a day in the life of Trump. That day started with a forum about sports (Trump owned the New Jersey Generals, a professional football team in a league that no longer exists) and ended with a meeting of the Vietnam Veterans Memorial Commission (which he co-chaired). His day was filled in between with meetings about various developments (including a castle-style apartment complex that was never built and a project that, more than a decade later, became Riverside South).", "Near the end of the story, there are six paragraphs that touch on politics after Trump questions the meaning of his businesses:", "The New York Times Magazine, April 8, 1984: The football thing is cute, Trump Tower and the piano and all of that, it’s all cute, but what does it mean? he says, sounding what borders on a note of uncharacteristic despair.", "Asked to explain, he adds: What does it all mean when some wacko over in Syria can end the world with nuclear weapons?", "He says that his concern for nuclear holocaust is not one that popped into his mind during any recent made-of-television movie. He says that it has been troubling him since his uncle, a nuclear physicist, began talking to him about it 15 years ago.", "His greatest dream is to personally do something about the problem and, characteristically, Donald Trump thinks he has an answer to nuclear armament: Let him negotiate arms agreements – he who can talk people into selling $100 million properties to him for $13 million. Negotiations is an art, he says and I have a gift for it.", "The idea that he would ever be allowed to got into a room alone and negotiate for the United States, let alone be successful in disarming the world, seems the naive musing of an optimistic, deluded young man who has never lost at anything he has tried. But he believes that through years of making his views known and through supporting candidates who share his views, it could someday happen.", "He is constantly asked about his interest in running for elective office. Absolutely not, he answers. All of the false smiles and the red tape. It is too difficult to really do anything.", "Two popular partisan websites, 100percentfedup.com and Right Wing News, have seized on the story and claimed that “the New York Times said Trump would be our best president,” lifting large excerpts from the magazine story – including quotes praising Trump and his business skills from his colleagues and competitors.", "But the story didn’t say “Trump would be our best president.”", "Regardless, each of those websites made that claim in their headlines, which have been repeated on other dubious websites and YouTube channels and shared on Facebook pages with a combined following of eight million users.", "Update, July 11: After we posted this story, Right Wing News contacted us to say that it changed its headline, which it agreed was “misleading.” In a note to its readers, the website said, “on 7/11/2018 our original [headline] was changed due to the nature that it was misleading.”", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk false stories shared on the social media network.", "Geist, William. “The Expanding Empire of Donald Trump.” The New York Times Magazine. 8 Apr 1984.", "“THIS IS AMAZING: In 1984, the New York Times said Trump would be our BEST president…They forgot.” 100percentfedup.com. 8 Jul 2018.", "Curry, Kara. “PRICELESS: The New York Times Said Trump Would Be Our BEST President… Guess Which Year This Was?!” Right Wing News. 8 Jul 2018.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]