["On December 17, Bharatiya Kisan Union (BKU) member Bhupender Chaudhary shared an image of a child serving chapatis to people. The image was shared with hashtags #FarmersProtest and #LangarSewa (archived link).", "❤️#FarmersProtest #LangarSewa pic.twitter.com/JIToXNZE7c", "— Bhupender Chaudhary (@bhupenderc19) December 17, 2020", "Dr Daljit Singh Cheema, former Education Minister of Punjab and member of Shiromani Akali Dal, shared the same image with Punjabi caption, “ਨਿੱਕੇ ਨਿੱਕੇ ਹੱਥਾ ਨਾਲ ਕਿਸਾਨੀ ਸੰਘਰਸ਼ ਦੇ ਯੋਧਿਆਂ ਨੂੰ ਲੰਗਰ ਛਕਾਉਂਦੀ ਪੰਜਾਬ ਦੀ ਧੀ।” (The daughter of Punjab feeding the warriors of the peasant struggle with a small hand).", "ਨਿੱਕੇ ਨਿੱਕੇ ਹੱਥਾ ਨਾਲ ਕਿਸਾਨੀ ਸੰਘਰਸ਼ ਦੇ ਯੋਧਿਆਂ ਨੂੰ ਲੰਗਰ ਛਕਾਉਂਦੀ ਪੰਜਾਬ ਦੀ ਧੀ।", "Posted by Dr Daljit Singh Cheema on Friday, December 18, 2020", "One facebook page जय जवान जय किसान upload the image with a hindi caption ““ईमान” का सौदा करता हैं, “जिन्दगी” की क़ीमत क्या जाने? जो “फसल” की क़ीमत दे न सके, वो “जान ” की क़ीमत क्या जाने?” and using #जय_किसान hashtag, which drew over 79,000 likes and 7,400 shares. (archived link)", "“ईमान” का सौदा करता हैं, “जिन्दगी” की क़ीमत क्या जाने? जो “फसल” की क़ीमत दे न सके, वो “जान ” की क़ीमत क्या जाने? 🌾🌾#जय_किसान🌾🌾", "Posted by जय जवान जय किसान on Wednesday, December 16, 2020", "This image is viral on Twitter and Facebook with the same Hindi caption.", "Alt news performed a reverse image search and came across a Facebook post by the page Guru Ka Langar. It posted the same image on July 14, 2017.", "While we were unable to find other details about the image, it was certainly not taken during farmers’ protest. It is, however, noteworthy that several children of farmers have participated in the ongoing protests.", "Donate Now", "Aqib is monitoring and researching mis/disinformation at Alt News", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "Trigger Warning: Sexual Violence A distressing video of a girl forced to take her clothes…", "A clip featuring Pakistan men’s Cricket team captain Babar Azam is viral on social media…", "A 13-second clip featuring Bollywood actor Shah Rukh Khan is being shared on social media…", "Union minister of information and broadcasting Anurag Thakur on September 26 announced Waheeda Rehman as…"]