["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "During debate on the Republican health care bill, U.S. Rep. Carolyn Maloney, D-N.Y., spoke passionately about the impact it will have on women’s health and especially on Planned Parenthood.", "\"We all know by now that the recent CBO analysis has bad news for millions of Americans, but it has some especially bad news for women,\" Maloney said on the House floor on March 16, 2017, the same day that the House Budget Committee approved the bill.", "\"The GOP plan makes Planned Parenthood ineligible for any reimbursement from Medicaid or Medicare for one entire year,\" Maloney said. \"More than half of Planned Parenthood facilities are in rural or medically underserved areas.\"", "Maloney was right that the bill restricts funds for Planned Parenthood. The American Health Care Act has a provision that won’t allow states to use direct spending of federal funds on prohibited entities.  Planned Parenthood is a prohibited entity under the bill because it is a provider that is \"primarily engaged in family planning services, reproductive health and related medical care\" or \"provides for abortion\" in any situation besides saving the life of the mother, incest or rape.", "We were intrigued, however, by the claim that half of Planned Parenthood facilities are in rural or underserved areas. It’s a tricky thing to measure, but the evidence suggests the claim is sound.", "Our research", "Maloney’s spokeswoman Jennifer Bell pointed us to data from Planned Parenthood’s website.", "Statistics there show that 54% of Planned Parenthood facilities are located in health professional shortage areas, rural or medically underserved areas.  This percentage was calculated by the Health Resources & Services Administration Shortage Area Database system.", "The HRSA is an agency of the U.S. Department of Health and Human Services. The HRSA's programs help provide health care to people who are geographically isolated, or economically or medically vulnerable. The agency identifies areas where health care is difficult to come by.  Planned Parenthood matched up their locations to the HRSA data.", "Mark Holmes, an associate professor in health policy and management at the University of North Carolina, told us the government system of identifying underserved areas is reliable.", "\"The HRSA database for shortage areas is pretty accurate.  In terms of additional context, there are multiple types of shortage areas,\" he explained.", "Holmes said some shortage areas are designated as a \"population\" shortage area.  \"This area is okay in general, but for certain kinds of populations, they may have a tough time getting the care they need,\" he said.", "He used an example of \"low-income\" populations.  \"Medicaid beneficiaries may live in an area with lots of providers, none of whom take Medicaid, so then although it looks like the area is well-served, there is actually a considerable shortage,\" Holmes said.", "\"In Planned Parenthood’s case, I don’t think that is a problem because so many of Planned Parenthood’s clients are lower income, according to their data.\"", "We ran this by two other health care experts, and they said that the claim was accurate.", "Our ruling", "Maloney said, \"More than half of Planned Parenthood facilities are in rural or medically underserved areas.\"", "That claim is supported by data from Planned Parenthood and the federal health care database.  Experts familiar with the data told us that there is enough evidence to show Maloney was on target with her claim.", "We rate this claim True.", "Twitter, Carolyn Maloney, Video of statement, March 16, 2017", "Email interview, Jennifer Bell, press secretary for Carolyn Maloney, March 22, 2017", "Email interview, Catherine Lozada, Planned Parenthood media relations, March 22, 2017", "Planned Parenthood, The Urgent Need for Planned Parenthood Health Centers, March 22, 2017", "HRSA, Find Shortage Areas by Address, March 22, 2017", "Email interview, Mark Holmes, associate professor in health policy and management at UNC, March 23, 2017", "Email interview, Ira Moscovice, professor in health policy and management at University of Minnesota, March 23, 2017", "Email interview, Keith Mueller, professor in health management and policy at University of Iowa, March 23, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]