["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "It’s Republican strategist Karl Rove versus billionaire Democratic donor Tom Steyer in Iowa.", "Rove’s group, American Crossroads, is up with a new ad that claims the Democratic Senate candidate there, Rep. Bruce Braley, is doing the bidding for Steyer by voting against the Keystone XL oil pipeline.", "\"Now, a California billionaire who stands to profit by blocking Keystone is spending big to help Braley’s campaign,\" the ad says. \"Bruce Braley, he’s on the side of billionaire special interests, not Iowa workers.\"", "Steyer is identified in the ad as the California billionaire. He has run ads helping Braley and against his opponent, Republican Joni Ernst.", "Rove’s group is a super PAC backed by millions of dollars in undisclosed donors, so American Crossroads warning voters about \"special interest\" dollars in the race sounds a little to us like, \"Pot, meet kettle.\"", "But regardless, we wanted to review American Crossroads' attack against Steyer. Would he \"stand to profit\" if Keystone is killed? We reviewed the evidence.", "For those unfamiliar with Steyer, he’s the billionaire behind NextGen Climate Change who has promised $100 million to Democrats in the midterm elections. Some have called him the Democrats’ Koch brothers of the election cycle.", "How, exactly, would an environmentalist make money by blocking Keystone XL, a pipeline that would carry oil from the Alberta tar sands through Nebraska to refineries in the Gulf of Mexico?", "American Crossroads sent us quite a few news stories that showed Steyer wasn’t always the hardcore environmentalist he now portrays himself as.", "Steyer made his fortune at Farallon Capital Management, an investment group he started in the 1980s. According to a Washington Post profile and other reports, Farallon Capital heavily invested in energy throughout Steyer’s time there, including fossil fuels. Steyer left the company in the fall of 2012.", "\"Investments included BP and mining companies in the United States and around the world,\" the Post wrote. \"Farallon's second-largest holding in September 2012, a month before Steyer announced his departure, was a $220 million investment in the oil-and-gas giant Nexen.\"", "Also included in Farallon’s investment portfolio was Kinder Morgan, a company that owned a pipeline connecting the Alberta tar sands to the Pacific coast. The pipeline is considered a rival to Keystone XL.", "So case closed, right?", "Not so fast.", "As we said, Steyer left Farallon Capital in 2012. But it wasn’t just that he left, it’s how he left.", "When he stepped down as a co-managing partner, Steyer directed Farallon Capital to divest his investments in the company from any of its holdings in tar sands and coal. That would have included the Kinder Morgan pipeline.", "Later in 2013, Steyer called for the company to divest his money from fossil fuels entirely. A spokeswoman for Steyer told the Post in June that process would conclude that month.", "Around the same time, Steyer took heat from Republicans for investing in an energy source he was simultaneously vilifying. In response, Steyer vowed to donate all the profits he made from Kinder Morgan pipeline to a charity. He announced in June he was donating $2 million to that cause.", "We don’t know if that was the full amount of the profit Steyer earned from his investment in the rival pipeline. But the ad from American Crossroads is prospective anyway, claiming that Steyer \"stands to profit\" from blocking Keystone. Steyer no longer has any way to directly earn money from the Kinder Morgan pipeline.", "And here’s the kicker: As of today, Farallon Capital Management no longer has any investment holdings in Kinder Morgan.", "Security and Exchange Commission filings for Farallon show $45 million worth of investments in Kinder Morgan through the end of 2013. But Kinder Morgan does not show up on the investment group’s portfolio for the first or second quarter of 2014.", "Our ruling", "American Crossroads said Steyer \"stands to profit by blocking Keystone\" and \"is spending big to help\" Braley’s Senate campaign.", "At one point, this might have been an accurate ad. Steyer’s former hedge fund, Farallon Capital Management, had significant holdings in a company that owned a pipeline considered a rival to Keystone XL, and under Steyer’s direction, his investment group had a large stake in fossil fuels.", "However, Steyer has since left the investment group he started, and asked his company to divest any of his holdings from fossil fuels, including tar sands. He also donated his profits from the Kinder Morgan pipeline to charity. Further, as of 2014, Farallon is no longer invested in Keystone’s competitor, according to SEC filings.", "As far as we can tell, Steyer would not directly profit from Keystone’s demise going forward. So the evidence from American Crossroads falls short. We rate the claim Mostly False.", "American Crossroads, \"Billionaire\" IA, Sept. 16, 2014", "Email interview with Paul Lindsay, spokesman for American Crossroads Sept. 17-18, 2014", "Email interview with Bobby Whithorne, spokesman for NextGen Climate Change, Sept. 17-18, 2014", "Washington Post, \"Tom Steyer’s slow, and ongoing, conversion from fossil-fuels investor to climate activist,\" June 9, 2014", "Washington Post, \"Tom Steyer’s staff answers questions about his investments and his career change,\" June 9, 2014", "Daily Caller, \"Tom Steyer: The shady billionaire with millions of reasons to kill Keystone XL,\" Oct. 8, 2013", "Huffington Post via Canadian Press, \"Tom Steyer Addresses Keystone Motives,\" Dec. 14, 2013", "Washington Times, \"Rep. Lee Terry: Billionaire Tom Steyer poised to profit from blocking Keystone XL pipeline,\" March 27, 2014", "Inside Climate News, \"Wealthy Donors in His Corner as Obama Comes Out Swinging on Climate Change,\" July 10, 2013", "San Francisco Chronicle, \"Tom Steyer, divesting in oil firm, prods GOP senator,\" July 8 2013", "Waterloo Cedar Falls Courier, \"Braley's position evolves on Keystone Pipeline,\" June 17, 2014", "CBS Sacramento, \"California Billionaire Promises To Help Victims Of Global Warming,\" June 6, 2014", "PR Newswire, \"Tom Steyer Challenges Senator Vitter To Contribute Fossil Fuel Contributions To Charity,\" July 8, 2013", "SEC filings for Farallon Capital Management, 2013 Q4, accessed Sept. 18, 2014", "SEC filings for Farallon Capital Management, 2014 Q1, accessed Sept. 18, 2014", "SEC filings for Farallon Capital Management, 2014 Q2, accessed Sept. 18, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]