["About this rating", "In February 2020, social media users posted about an infamous 164-year-old episode in the history of the U.S. Congress — the caning of Sen. Charles Sumner. The incident was highlighted in the aftermath of President Donald Trump's 2020 State of the Union address and House Speaker Nancy Pelosi's much-discussed ripping up of her copy of the president's speech.", "On Feb. 4, 2020, shortly after the State of the Union, right-leaning journalist Ian Miles Cheong posted a short clip of Pelosi tearing a copy of the speech, describing it as \"the most classless act ever conducted in Congress.\"", "Several users countered this assertion by pointing to an 1856 incident in which the pro-slavery U.S. Rep. Preston Brooks \"beat a senator nearly to death\" on the floor of the U.S. Senate:", "On Facebook, some users also highlighted the Brooks-Sumner affair as a riposte to claims that Pelosi's speech-ripping was unprecedentedly aggressive.", "The claim that in 1856 a congressman (Brooks) viciously attacked a senator (Sumner) with a cane on the floor of the U.S. Senate was accurate and is a matter of historical record.", "Here's how the website of the U.S. Senate describes the infamous attack:", "On May 22, 1856, the \"world's greatest deliberative body\" became a combat zone. In one of the most dramatic and deeply ominous moments in the Senate's entire history, a member of the House of Representatives entered the Senate Chamber and savagely beat a senator into unconsciousness.", "The inspiration for this clash came three days earlier when Senator Charles Sumner, a Massachusetts antislavery Republican, addressed the Senate on the explosive issue of whether Kansas should be admitted to the Union as a slave state or a free state. In his \"Crime Against Kansas\" speech, Sumner identified two Democratic senators as the principal culprits in this crime—Stephen Douglas of Illinois and Andrew Butler of South Carolina.", "He characterized Douglas to his face as a \"noise-some, squat, and nameless animal . . . not a proper model for an American senator.\" Andrew Butler, who was not present, received more elaborate treatment. Mocking the South Carolina senator's stance as a man of chivalry, the Massachusetts senator charged him with taking \"a mistress . . . who, though ugly to others, is always lovely to him; though polluted in the sight of the world, is chaste in his sight—I mean,\" added Sumner, \"the harlot, Slavery.\"", "Representative Preston Brooks was Butler's South Carolina kinsman. If he had believed Sumner to be a gentleman, he might have challenged him to a duel. Instead, he chose a light cane of the type used to discipline unruly dogs. Shortly after the Senate had adjourned for the day, Brooks entered the old chamber, where he found Sumner busily attaching his postal frank to copies of his \"Crime Against Kansas\" speech.", "Moving quickly, Brooks slammed his metal-topped cane onto the unsuspecting Sumner's head. As Brooks struck again and again, Sumner rose and lurched blindly about the chamber, futilely attempting to protect himself. After a very long minute, it ended.", "The attack provoked a storm of controversy, press coverage, and a Senate investigation. It was immortalized in several prints, including the one shown below, which was produced by John Henry Bufford and shows Brooks to the right brandishing his cane over the head of an unsuspecting Sumner, with Brooks' fellow South Carolina Congressman Laurence Keitt keeping would-be defenders of Sumner at bay:", "\"Arguments of the Chivalry\" by John Henry Bufford, 1856. Via the Library of Congress.", "According to the findings of that investigation, Brooks was unrepentant about his assault on Sumner, reportedly saying:", "\"Today I approached [Sumner], after the Senate adjourned, and said to him, 'Mr. Sumner, I have read your speech carefully, and with as much calmness as I could be expected to read such a speech. You have libelled my state [South Carolina] and slandered my relation [Andrew Butler], who is aged and absent, and I feel it to be my duty to punish you for it.' And with that I struck him a blow across the head with my cane, and repeated it until I was satisfied [...].\"  Sumner's \"Crime Against Kansas\" speech can be read in full here.", "The House failed to garner the necessary two-thirds vote to expel Brooks, but it successfully censured Keitt. According to the House's website, both men resigned in protest at what they perceived to be unfair treatment by their congressional colleagues, and they subsequently won back their seats in the special elections triggered by their resignations. Brooks died just months later in January 1857.", "For his part, Sumner was so badly injured in the beating that he took three years to recover, but he went on to serve in the Senate until his death in 1874.", "U.S. Senate.  \"The Caning of Senator Charles Sumner.\"\r\n    Accessed 13 February 2020.", "U.S. Senate.  \"Report — the Circumstances Attending the Assault Committed Upon the Person of the Hon. Charles Sumner.\"\r\n    28 May 1856.", "Sumner, Charles.  \"Speech -- the Crime Against Kansas.\"\r\n    U.S. Senate.  19/20 May 1856.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]