["Donald Trump's signature hair has seized the nation's collective curiosity and sparked many a rumor. In the latest of these, a Facebook post claims something on the president's head is not what it seems.", "\"Yoooooooo! WTF is that on Trump’s head???\" civil rights activist Shaun King writes in a Sept. 30 post. He draws attention to an image of Trump, side profile slightly cut off yet recognizable, sporting a patch visible in the president's parted hair. The off-white patch is dissimilar to the color and texture of Trump's own hair and is magnified in two images flanking either side of the side-profile image.", "King states that contrary to what \"some people\" believe — that the patch is \"a part of his fake hair tracks\" — the area in question \"looks like some type of neural stimulator device.\"", "Neural stimulators are used to treat a variety of medical conditions, from epilepsy and depression to spinal cord injuries and even heart pain.", "The comment section was awash with various theories, some concurring with King and others suggesting their own.", "\"If its (sic) a neural stimulator...\" one Facebook user commented, \"clearly it's defective.\"", "\"Its prolly (sic) the dang ear piece he was accusing Biden of gonna wear,\" wrote another.", "The post has received over 19,000 shares and 29,000 reactions since it was posted. USA TODAY has reached out to the King for further comment.", "Fact check:No evidence Biden wore wire at Ohio debate", "One may be inclined to believe the image is Trump at his first debate against rival Democrat Joe Biden on Sept. 29 given it was posted a day after. The image, however, appeared as early as 2016 based on USA TODAY's image crawl search; oldest hits for the image were found only on the social networking and microblogging website Tumblr. Even then, the patch did not go unnoticed, with users suggesting it was a \"track,\" or pieces of hair that are glued on or sewn into an individual's natural hair.", "The hair track and extensions speculation continued over the next four years, persisting when the image became viral again in early March 2020 thanks to a Reddit post.", "Fact check:Allegations that Joe Biden wore an earpiece at town hall, debate are false", "According to White House Deputy Press Secretary Judd Deere, Trump is not outfitted with a neural stimulation device.", "\"There is zero truth to any speculation that he receives any sort of chemical or neural stimulation,\" Deere wrote in an email to USA TODAY.", "Deere stated the image appeared doctored but did not provide any sources to verify this theory.", "Dr. Jacob Robinson, an associate professor of electrical, computer and bioengineering at Rice University, also agreed the 2016 photo likely did not depict a neural stimulator device.", "\"This does not look like any neural stimulator I've seen. It also lacks the form factor I would expect for a neural stimulator. Looks to lack a power supply,\" he said in a September interview with Lead Stories. \"I think it's very unlikely to be a neural stimulator.\"", "Neural stimulators can be both external and internal — above or covered by skin.", "Robinson stated if it were external, he would have expected to see something \"bulkier\" than what is visible in the picture.", "We rate this claim FALSE because it is not supported by our research. The image appears to be from 2016, resurfaced in March and again following the first Trump-Biden debate Tuesday, Sept. 29. By appearances, there is no evidence to conclude Trump was wearing a neural stimulator in the 2016 photo. The White House also denies Trump receiving any chemical or neural stimulation.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more."]