["The image of the purported letter was published here on Facebook on January 21, 2021. It has been shared more than 250 times.", "“This is the memo Trump left to Biden at the White House. Trump is the real winner,” the Chinese-language caption reads.", "The purported letter, dated January 20, 2021, reads: “Joe, you know I won.”", "The photo was shared online with a similar claim in multiple languages, including English, Spanish and Russian.", "Comments from some Facebook users suggested they believed posts showed a genuine letter from Trump to Biden.", "“Wise person know Dems stole the election! (sic),” one Facebook user said.", "Other responses included: “Such heartbreaking words, but sadly, justice is not in the hearts of the people!” and “Trump, my eternal hero!”", "The White House has not released a statement regarding the purported letter as of January 27, 2021.", "In fact, the letter has been doctored, an investigation by AFP has found.", "The earliest version of the photo AFP found was in a blog post published on January 20, 2021. It has been viewed more than 1,000,000 times.", "The photo was captioned: “Letter For Biden… I was sent this 5pm British time - And asked not to share for 1 hour. This Trump letter was left on the President's desk for Biden.”", "Forensic analysis of the photo by digital verification tool InVID-WeVerify reveals it has been doctored.", "The tool detects the traces left by consecutive JPEG compressions on an image, such as a higher quality image placed onto a lower quality image. The red patches in the otherwise blue image below show it has been doctored.", "The seal on the misleading letter, which reads ‘Seal of the President of the United States’ also suggests the letter is not authentic.", "A keyword search on Google has found recent official letters sent by Trump display a different seal. The seal can be seen on a letter published here by UK newspaper The Guardian on October 9, 2019 and here by Boston radio station WBUR on March 26, 2020.", "Below is a screenshot comparison of the doctored letter (L) and the letter Trump sent to Turkish President Recep Tayyip Erdogan in 2019 (R):", "A similar template has previously been used in letters falsely purported to have been written by Donald Trump, including here in 2017 and here in 2018.", "The content of Trump's real letter to Biden has not been revealed by any official channels as of January 27, 2021.", "Biden told reporters that Trump had left him a “very generous” letter in the Oval Office ahead of his inauguration as 46th president of the United States on January 20, 2021.", "“The president wrote a very generous letter,” he said. “Because it’s private, I will not talk about it until I talk to him.”", "Despite reportedly leaving a letter for his replacement, Trump skipped Biden's inauguration, as reported here by AFP.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]