["A video of a group of men brutally thrashing a man with lathis is widely circulating on social media with the claim that a mob of Thakurs beat up a man from the Jatav community in UP’s Bulandshahr. The incident is portrayed as caste-based violence. Jatavs are identified as part of scheduled castes.", "[Warning: Video depicts violence. Viewer discretion is advised.]", "Several Twitter and Facebook users have shared the video with a message in Hindi, “In Bulandshahr, a man from Jatav community was hospitalised after getting brutally beaten by some people from Thakur community. His health is in critical condition. Village Dhaturi Mirzapur Shikarpur Road Bulandshahr, UP. Share this video as much as possible.”", "[Translated from बुलन्दशहर में एक जाटव भाई पर कुछ ठाकुर जाति के लोगों ने बुरी तरह मारपीट की गई है इस वक्त सरकारी अस्पताल में भर्ती है गंभीर स्थिति में है। गांव धतूरी मिर्जापुर शिकारपुर रोड बुलन्दशहर। Up इस वीडियो को ज्यादा से ज्यादा शेयर करे]", "In order to authenticate the video, we performed a reverse image search using InVid and found that the same clip was tweeted by Haryana-based advocate Jaipal Jaglan on July 14. He tagged the state health minister, Haryana police and clarified, “This viral video is from the village Bidhwan Tahsil Siwani of Bhiwani district. The police made such a small case of the incident that the accused have received bail. Each day criminals are encouraged and their spirits are rising. In Dadum village of this district, mining mafias terrorise farmers. (@anilvijminister @police_haryana यह वायरल वीडियो भिवानी जिले के गांव विधवान तहसील शिवानी की है सुनने में आया कि पुलिस ने इतना छोटा केस बनाया है इसके कारण इनकी जमानत हो गई दिन प्रतिदिन अपराधियों के हौसले बढ़ते जा रहे हैं इसीजिले के गांवडाडम मैं भी खनन माफियाओं का किसानोंपर आतंक है.)”", "Alt News spoke with Jaglan who informed that the incident happened in the month of May and was related to bootleggers of illicit liquor.", "Alt News contacted DSP Siwani Suresh Kumar. After watching the viral video, he confirmed that this incident is from May. “We don’t have Jatav and Thakur community in Siwani, both victim and perpetrators were from the Jat community. The incident was related to a tiff between alcohol bootleggers. So far two arrests have been made,” he said.", "We also spoke with Bhiwani-based journalist Prem Saraswat who told us that the incident was reported by local newspaper Danik Bhaskar on June 1. As per the report, Sumit was beaten up in Bidhwan village while working on a farm. The police arrived after two hours later at the crime scene and hospitalised the victim. The report added that SHO Rakesh Sena informed that Bahadur, Kalia, Matru, Shakha, Sunil and 10-12 others were booked for attempt to murder, violence and criminal intimidation.", "Thus the social media claim that Thakurs were beating a Jatav man in Uttar Pradesh is false. The video is from Siwani, Haryana and dates back to May. DSP Siwani informed that both victim and perpetrators hail from the same community.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]