["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "President Joe Biden speaks during the 59th Presidential Inauguration at the U.S. Capitol in Washington, Jan. 20, 2021. (AP)", "Joe Biden is not an “illegal president.” He won more electoral votes than Donald Trump and was duly sworn into office on Jan. 20.", "There is no evidence that the military is running the country. That claim is related to the baseless QAnon conspiracy theory.", "Nearly a week after President Joe Biden was inaugurated, supporters of Donald Trump are still spreading conspiracy theories that he isn’t actually running the country.", "In a Jan. 25 interview with the conservative Patriotically Correct Radio Show, Lin Wood, a defamation lawyer, said Biden’s presidency is a sham.", "\"I believe, without having definitive proof, that the military is in charge of our country, and I believe they are in charge of our country because Joe Biden is an illegal president,\" he said. \"And I believe the military has evidence that establishes that fact.\"", "Later in the video, Wood floats the theory that Biden has been signing blank pages or executive orders \"prepared for him by the people that control him.\" The clip was published on Facebook and flagged as part of the company’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "(Screenshot from Facebook)", "Wood was banned from Twitter in early January after he promoted the Capitol insurrection and false claims about the results of the 2020 presidential election. He has also promoted the baseless QAnon conspiracy theory; Wood’s claims about \"little children being abused, molested, and sacrificed\" by \"leaders in our government\" were aired on the Patriotically Correct Radio Show before his appearance.", "We’ve previously fact-checked false statements from Wood about the 2020 election, as well as rumors about a military takeover of the federal government. So we wanted to take a look at this post, too.", "Biden is not an \"illegal president,\" and there is no evidence that the military is running the country.", "Biden’s election was legal, and followed the process spelled out in Article II of the Constitution. All 50 states and the District of Columbia have certified their election results, which Congress finalized on Jan. 7. Biden won 306 electoral votes, while Trump won 232. Since Biden got more than 270 electoral votes, he is the rightful president.", "Biden was duly sworn into office Jan. 20, after which he and first lady Jill Biden moved into the White House. Trump gave a farewell speech the same day.", "There is no credible evidence that voter fraud affected the election outcome. Here’s how we know that:", "Election officials in every state have said there was no sign of significant fraud during the voting process.", "The Cybersecurity and Infrastructure Security Agency called the election \"the most secure in American history.\"", "The Justice Department said it uncovered no evidence of widespread fraud.", "Not one of the lawsuits from Trump and his allies offered evidence that voter fraud affected the election outcome.", "Before Inauguration Day, QAnon supporters said the military would take over the federal government instead of Biden becoming president. That did not come to pass, and the U.S. is not under a military dictatorship.", "We reached out to Wood for a comment, but we haven’t heard back.", "His statement is inaccurate and ridiculous. We rate it Pants on Fire!", "RELATED: A note to our readers who think President Trump won", "Associated Press, \"Disputing Trump, Barr says no widespread election fraud,\" Dec. 1, 2020", "Associated Press, \"Inauguration Day: Biden in White House for 1st time as president,\" Jan. 20, 2021", "BuzzFeed News, \"Trump-Supporting Lawyer Lin Wood Has Been Permanently Banned From Twitter,\" Jan. 7, 2021", "Constitution of the United States", "Cybersecurity and Infrastructure Security Agency, JOINT STATEMENT FROM ELECTIONS INFRASTRUCTURE GOVERNMENT COORDINATING COUNCIL & THE ELECTION INFRASTRUCTURE SECTOR COORDINATING EXECUTIVE COMMITTEES", "Facebook video, Jan. 25, 2021", "The Guardian, \"QAnon's 'Great Awakening' failed to materialize. What's next could be worse,\" Jan. 20, 2021", "HuffPost, \"Who Is Lin Wood, The Pro-Trump Lawyer Spewing Conspiracies About Lizard Squads?\" Jan. 4, 2021", "The Inauguration of Joe Biden and Kamala Harris, Jan. 20, 2021", "National Archives, 2020 Electoral College Results", "NBC News, \"Congress finalizes Biden win, Trump pledges 'orderly transition' as Capitol reels from mob assault,\" Jan. 7, 2021", "Newsweek, \"Read the Full Text of Donald Trump's Final Farewell Speech at Joint Base Andrews,\" Jan. 20, 2021", "PolitiFact, \"Biden took a private plane to his inauguration. He’s still the legitimate president,\" Jan. 21, 2021", "PolitiFact, \"China did not orchestrate voter fraud in the 2020 election,\" Jan. 19, 2021", "PolitiFact, \"What is QAnon, the baseless conspiracy spilling into US politics?\" Aug. 27, 2020", "Telegram, accessed Jan. 26, 2021", "USA Today, \"By the numbers: President Donald Trump's failed efforts to overturn the election,\" Jan. 6, 2021", "The White House, Joe Biden", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]