["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Rep. Debbie Mucarsel-Powell, a South Florida Democrat, is being challenged in the 2020 election by Miami-Dade Mayor Carlos Gimenez, a Republican. (AP)", "Her husband, Robert Powell, was paid roughly $700,000 over two years as the general counsel for companies partly owned by Kolomoisky, including a holding company that acquired businesses in the United States.", "Comparing the Ukrainian oligarch with the leaders of two nations is a stretch.", "Robert Powell has not been accused of any wrongdoing in connection with legal actions taken against Kolomoisky.", "Claims of corruption continue to mark a competitive South Florida race for the House, where Democratic Rep. Debbie Mucarsel-Powell is being challenged by Miami-Dade Mayor Carlos Gimenez, a Republican.", "One of the latest is a guilt-by-association attack on Mucarsel-Powell. It’s over ties that her husband, lawyer Robert Powell, had with a Ukrainian oligarch, Ihor Kolomoisky.", "The attack comes in an ad shot in black and white from the Congressional Leadership Fund, a super PAC that works to elect Republicans to the House.", "\"This town is far too familiar with violent thugs,\" the narrator states, as photos of authoritarian leaders Nicolás Maduro of Venezuela and Cuba’s Fidel Castro appear on the screen.", "\"And Debbie Mucarsel-Powell is far too familiar with violent warlord Ihor Kolomoisky. Mucarsel-Powell’s family received more than $700,000 from Kolomoisky’s firm. He’s been accused of embezzlement, bribery and murder.\"", "Robert Powell was paid some $700,000 while previously working for a firm partly owned by Kolomoisky.", "But Powell has not been accused of any wrongdoing in connection with various allegations against Kolomoisky. And Kolomoisky doesn’t have the same stature as Maduro or Castro.", "Mucarsel-Powell is finishing her first term in Washington. Gimenez has served as mayor of Florida’s most populous county since 2011.", "The Cook Political Report rates the race a toss-up. It is one of 18 pivotal House and Senate races up for election on Nov. 3 that PolitiFact is tracking.", "The incumbent attacked Gimenez for extending a contract to a firm with ties to his sons; we rated it Half True. Also Half True was her claim that Gimenez boosted his own pay and pension, and kept a taxpayer-funded Mercedes-Benz.", "Kolomoisky is one of Ukraine’s richest men, controlling businesses in many sectors of the Ukrainian economy, including metals, energy and media. Widely seen as Ukraine’s most powerful figure outside of government, according to the New York Times, he spent millions of dollars to field and equip fighters and helped stop the Russian advance into the country in 2014. But his stature is not on the level of the two nation leaders invoked in the ad.", "Castro, the late Cuban leader, ruled his country for nearly half a century, until stepping aside with illness in 2006. He was \"among the world’s most repressive leaders\" who executed or jailed thousands of political opponents, according to the Washington Post’s obituary.", "In Venezuela, a UN investigation in September concluded that unlawful executions, enforced disappearances, arbitrary detentions and torture \"amounted to crimes against humanity.\" Maduro, who has been president since 2013, likely \"side-tracked the chain of command to ensure the commission of crimes,\" the report said.", "The Daily Beast reported in 2018, during Murcasel-Powell’s first run for her seat, that Robert Powell spent much of the previous 10 years as general counsel for companies owned at least in part by Kolomoisky, including Optima Acquisitions, which acquired companies in the United States, and Felman Trading, a New Jersey global supplier of manganese and ferroalloys.", "Kolomoisky has been accused of bribery and embezzlement in recent years by business partners and government authorities, the Miami Herald reported. The allegations also include involvement in contract killings.", "Robert Powell responded to the Daily Beast story at the time with a statement from his wife’s campaign, declaring: \"I have never worked for, represented, answered to, or received any payment from Mr. Kolomoisky at any time.\"", "But Powell received $695,000 in salary in 2016 and 2017 from Felman Trading, Mucarsel-Powell’s 2017 federal financial disclosure form shows.", "Mucarsel-Powell’s campaign confirmed to PolitiFact that Robert Powell was paid that much over the two years.", "Kolomoisky is in more legal trouble today — but there is no indication Powell is involved.", "In August, the U.S. Justice Department brought allegations against Kolomoisky and another Ukrainian oligarch, Gennadiy Boholiubov. As the previous primary owners of PrivatBank, one of the largest banks in Ukraine, they are accused of embezzlement and defrauding the bank of billions of dollars, from 2008 through 2016. That was during the period when Robert Powell worked as the general counsel.", "Two other associates in Miami created entities, usually under some variation of the name Optima, to launder the money and buy hundreds of millions of dollars in real estate and businesses across the United States, according to the civil forfeiture complaints filed in Miami.", "Kolomoisky and his associates bought at least 22 properties, including a skyscraper in Cleveland, a shuttered Motorola facility in Illinois and the former headquarters of Mary Kay Cosmetics in Dallas, according to a September article by the International Consortium of Investigative Journalists. They \"left a trail of empty, boarded-up buildings, unpaid property taxes, dangerous factory conditions, unemployed workers, and at least four steel mills that filed for bankruptcy,\" according to the article.", "But Powell is not named in either of the Justice Department complaints. He has not been accused of any wrongdoing in connection with what is alleged in the complaints, the Miami Herald reported.", "Making a guilt-by-association attack, the Congressional Leadership Fund says Mucarsel-Powell's family received $700,000 from the firm of \"violent warlord Ihor Kolomoisky,\" comparing him to Fidel Castro and Nicolás Maduro.", "The comparison of the Ukrainian oligarch to authoritarian leaders of two nations is a stretch. Mucarsel-Powell’s husband, Robert Powell, was paid $695,000 by a company partly owned by Kolomoisky, but he has not been accused of any wrongdoing in connection with allegations made against Kolomoisky.", "We rate the statement Half True.", "YouTube, Congressional Leadership Fund’s \"Debbie Mucarsel-Powell, Familiar\" ad, Oct. 7, 2020", "Email, Will Reinert, press secretary, Congressional Leadership Fund, Oct. 13, 2020", "Interview, Debbie Mucarsel-Powell campaign spokesman Joshua Karp, Oct. 16, 2020", "Washington Post, \"Ukrainian who made appearance in Trump impeachment saga accused by U.S. of stealing, laundering billions,\" Aug. 6, 2020", "New York Times, \"A Ukrainian Billionaire Fought Russia. Now He’s Ready to Embrace It,\" June 4, 2020", "Miami Herald, \"Miami men with Ukrainian political ties laundered money, DOJ says,\" Aug. 7, 2020", "Miami Herald, \"Congress candidate’s husband has financial ties to scandal-plagued Ukrainian oligarch,\" July 16, 2018", "Daily Beast, \"Shady Oligarch’s Firm Paid Dem Candidate’s Husband $700,000,\" July 16, 2018", "Daily Beast, \"Florida Dem Candidate’s Husband Denies Ties to Ukrainian Oligarch,\" July 17, 2018", "Daily Beast, \"The Allegedly Murderous Oligarch, the Duped CIA Chief, and the Trumpkin,\" March 27, 2018", "Evening Standard, \"Murder claims in London tycoons’ courtroom battle,\" March 13, 2015", "U.S. House clerk, Debbie Mucarsel-Powell disclosure report, Aug. 13, 2019", "U.S. House clerk, Debbie Mucarsel-Powell disclosure report, Aug. 31, 2017", "U.S. Department of Justice, news release, Aug. 6, 2020", "U.S. Department of Justice, Louisville properties complaint, Aug. 6, 2020", "U.S. Department of Justice, Dallas properties complaint, Aug. 6, 2020", "International Consortium of Investigative Journalists, \"With Deutsche Bank’s help, an oligarch’s buying spree trails ruin across the US heartland,\" Sept. 22, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]