["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Richard Cordray is the Democratic candidate for governor in Ohio in 2018. (AP)", "Republican Ohio Attorney General Mike DeWine says his Democratic opponent for governor Richard Cordray supports a tax hike.", "\"Richard Cordray wants to raise your taxes by reversing President Trump's tax reform,\" says an online video on the DeWine campaign website Can’t Trust Cordray. \"Cordray wants to revoke your middle class $2,000 tax cut.\"", "Here’s what DeWine is on point about: Cordray adamantly opposed the federal tax bill signed by President Donald Trump in December. Initially, that bill cuts taxes for all income groups.", "Here’s what DeWine omits: That tax bill did not cut everyone’s taxes, particularly in future years. And Cordray, who as governor would have no power to raise federal taxes, hasn’t said he wants to raise taxes.", "The video states that Cordray wants to reverse Trump’s tax reform, but the first thing to know is that if he won the race, a governor can’t control federal tax policy.", "And the video doesn’t tell the full story about that $2,000 tax cut.", "The tax bill doesn’t cut everyone’s taxes, especially for people in future years. At its start the tax bill does come close to providing tax relief for all income groups, and for most members within each group. The median household of a family of four gets about a $2,000 tax cut on average.", "That said, the benefits of the tax bill would flow disproportionately to wealthier taxpayers.", "Over time these broad-based tax cuts dissipate. By 2027, every income group below $75,000 sees a tax increase. Only those income ranges above $75,000 still see a cut by 2027. That’s a significantly different pattern than in 2019, when every group saves, on average.", "The DeWine campaign cited several statements by Cordray in which he criticized the federal tax bill as a benefit to the rich.", "In a speech to the City Club of Cleveland in December, Cordray said that the legislation helped corporations.", "\"There’s slabs for them, there’s crumbs for people like the middle-class people in our society,\" he said. \"I think it is wrong.\"", "In a Dec. 20 tweet, Cordray called the bill a \"shortsighted abomination.\"", "In February, Cordray tweeted that the tax bill brings \"more trickle-down economics that doesn’t trickle down.\"", "Cordray has echoed a talking point by Democrats that cherrypicks the impact of the tax bill. The tax bill gave 80 percent of its benefits to the top 1 percent by 2027 due to the expiration of several important middle-income tax cuts and a change in how inflation is calculated. However, through 2025, the share of benefits going to the top 1 percent is much smaller, at roughly 20 percent to 25 percent.", "We didn’t find any statements by Cordray weighing in on any specific proposal to replace the tax bill. We asked Cordray’s spokeswoman what he wants to see happen with federal tax policy and if he wants to raise or lower taxes for any particular group.", "\"Rich wants to see a federal tax plan in place that doesn’t hurt middle class families,\" his campaign spokeswoman Lacey Rose said.", "If Congress later changes the federal tax law, it could raise taxes on some people -- but it could also lower taxes on others. And even if such a bill were to gain traction, as a governor Cordray would have no say.", "DeWine’s video focuses on federal taxes, but we will briefly note Cordray’s position on state taxes because that is something in the power of a governor. We found that Cordray has been critical of state tax cuts and has called for certain tax incentives for businesses, but has been vague on the details.", "The clearest example we found in which he opposed tax increases was a May article by the Dayton Daily News which paraphrased Cordray saying he didn’t see a need for tax increases. Cordray said he wanted to prioritize state spending, including less for failing charter schools and more for local government to deal with the opioid crisis.", "He has criticized state tax cuts because that has trickled down to local governments facing choices about whether to raise their own taxes.", "At a gathering of union leaders and local government workers in April, Cordray slammed Republicans’ \"mania\" for cutting taxes.", "He vowed that as governor, \"if the legislature continues down its current path of tax and budget cuts, there will be vetoes.\"", "DeWine said that \"Richard Cordray wants to raise your taxes by reversing President Trump's tax reform.\"", "While Cordray has repeatedly bashed the federal tax bill, DeWine ignores that the bill didn’t cut everyone’s taxes, particularly in future years, and that repealing the bill, which could include a replacement, could end up cutting taxes for some families. While Cordray has made it clear that he criticizes the bill for helping the rich, he hasn’t laid out any specific suggestion for changing the federal tax law.", "Perhaps more importantly, if Cordray wins the governorship, he would not have a vote on federal tax policy.", "We rate this claim Mostly False.", "Mike DeWine campaign, Can’t Trust Cordray website, Accessed July 10, 2018", "Richard Cordray, Tweets about taxes, 2018 campaign", "House Ways and Means Committee, By the Numbers: Tax Cuts and Jobs Act Delivers Tax Cuts for Families in Every Congressional District", "Institute on Taxation and Economic Policy, \"Extensions of the New Tax Law’s Temporary Provisions Would Mainly Benefit the Wealthy,\" April 10, 2018", "Talking Points Memo, \"Cordray Strikes Populist Tone On Tax Day As Ohio Gov Race Heats Up,\" April 17th, 2018", "Dayton Daily News, \"Guns, minimum wage top issues in Ohio Democratic governor primary,\" May 3, 2018", "Dayton Daily News, \"Cordray: Ohio must be strategic on schools;\" Feb. 27, 2018", "Bloomberg TV, Richard Cordray interview, Feb. 2, 2018", "The Repository (Canton, Ohio), \"Cordray makes campaign stop in Canton,\" Dec. 16, 2017", "Cincinnati Enquirer, \"What would they do as governor? Front-runners share few details,\" May 6, 2018", "PolitiFact, \"What's in the final version of the tax bill?\" Dec. 18, 2017", "PolitiFact’s Trump-O-Meter, \"All income groups get cuts early on, but not 'everyone,'\" Dec. 21, 2018", "Interview, Lacey Rose, Richard Cordray spokeswoman, July 12, 2018", "Interview, Joshua Eck, Mike DeWine campaign spokesman, July 12, 2018", "Interview, Institute on Taxation and Economic Policy deputy director Meg Wiehe, July 13, 2018", "Interview, Frank Sammartino, senior fellow at the Urban-Brookings Tax Policy Center, July 16, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]