["The post, shared more than 25,000 times in the United States and more than 3,000 times in Canada in the last week, shows pictures of a COVID-19 mobile testing booth often accompanied by the question, “Why does the COVID-19 testing facility have a logo of Anubis the god of death?”", "It has also been shared in Argentina, Brazil, Columbia, France, Germany, Italy, Serbia, South Africa, the United Kingdom,", "A separate depiction of Anubis, the jackal-like Egyptian “deity of cemeteries, embalming and protector of graves,” is shared alongside it.", "A reverse image search of the testing facility photograph on Google found this tweet by a company called Aardvark Mobile Tours, which offers vehicle-based marketing solutions.", "According to their website, Aardvark, based in Conshohocken, Pennsylvania, adapted their mobile platform business in response to the coronavirus pandemic by designing two trucks as mobile testing centers.", "The trucks were featured in the Miami Herald and were photographed in Florida by AFP’s Chandan Khanna on July 24, 2020.", "“The testing trucks have a silhouette of an Aardvark because the company behind the trucks is Aardvark Mobile Health, a division of Aardvark Mobile Tours,” a spokeswoman for the company told AFP via email.", "“The logo for Aardvark Mobile Tours was created in 2007 and includes the Aardvark head – which is what you see in the COVID-19 testing logo,” she added.", "The company also says it does not attach any symbolism to the logo of the aardvark, a long-snouted nocturnal creature native to Africa.", "“Larry Borden, the founder and CEO, actually chose the name ‘Aardvark’ originally because of the double ‘A’ at the beginning, meaning the company would show up at the beginning of the phone book,” said the spokeswoman.", "AFP Fact Check has debunked more than 570 examples of false or misleading information about the novel coronavirus. You can find the complete list of our fact checks on the topic in English here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]