["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Nearly a month after a police report surfaced on his 1998 arrest for driving while intoxicated, Democratic U.S. Senate nominee Beto O’Rourke fielded a follow-up question during his Sept. 21, 2018 debate with Republican Sen. Ted Cruz.", "Gromer Jeffers of the Dallas Morning News said to O’Rourke: \"You have addressed your 1998 DWI arrest numerous times during your public career. But not this question: As the Houston Chronicle pointed out recently, a witness said in that accident that you tried to leave the scene of the accident. Did you and should voters be concerned about this incident?\"", "O’Rourke replied at the Southern Methodist University debate: \"I did not try to leave the scene of the accident--though driving drunk, which I did, is a terrible mistake for which there is no excuse or justification or defense and I will not try to provide one. I can only tell you that I was able to have a second chance in my life.\"", "O’Rourke went on to tick-tock his subsequent opening of a business with friends in his hometown of El Paso where, he said, he met his wife with whom he’s raising three children. Also, O’Rourke said, he won election to the El Paso City Council and, in 2012, to the U.S. House, which he’s leaving after this year.", "\"I made the most that I could with my second choice and my opportunity,\" O’Rourke said.", "Readers asked us if O’Rourke tried to leave the scene of his accident and arrest.", "Houston Chronicle news story cites police report", "The Chronicle, in an Aug. 30, 2018, news story, said a police report shows that the incident was a more serious threat to public safety than previously reported.", "The newspaper, citing the report, said that O’Rourke was driving drunk at what a witness called \"a high rate of speed\" in a 75 mph zone on Interstate 10 about a mile east of the New Mexico border. He lost control and hit a truck, sending his car careening across the center median. The story said that the witness, described as stopping at the scene, later told police that O’Rourke had tried to leave the scene.", "The report, the story says, refers to an unnamed \"motorist’s description of O’Rourke’s dark-colored Volvo passing him quickly about 3 a.m. on I-10.\" The story says that O'Rourke reportedly struck a truck going in the same direction and crossed a grassy median into the opposite lanes.", "The story says that according to the police report, \"O’Rourke then attempted to leave the scene but was stopped by the same motorist he had just passed. The unidentified motorist ‘then turned on his overhead lights to warn oncoming traffic and to try to get the defendant (O’Rourke) to stop,’ the report says.\"", "The story says that O'Rourke recorded a 0.136 and 0.134 on police breathalyzers, above a blood-alcohol level of 0.10, the state legal limit at the time. He was arrested at the scene, the story said, and charged with DWI, but completed a court-approved diversion program and had the charges dismissed, post-arrest developments we confirmed for a previous fact-check confirming the September 1998 arrest and a previous one, when O’Rourke was a college student, for getting past a fence to enter the University of Texas at El Paso campus in the wee hours.", "Police agency confirms report's authenticity", "By email, we asked the Anthony Police Department to review the 12-page partially-redacted police report posted next to the Chronicle story. In response, a department officer, Linda Hartt-Goggin, said the posted report \"appears to be a true redacted copy of the original report.\"", "Hartt-Goggin said by phone she couldn’t find the department’s report on the accident itself. She speculated that it was lost when a room was flooded.", "According to APD Investigator Richard Carrera’s report, filed three days after the accident, O’Rourke said after his 3 a.m. arrest that he’d been driving to Los Alamos in New Mexico. The officer’s report says that he met at the scene with a witness--called the \"reporter\" in Carrera’s report--and his partner, the driver of \"the American Medical ambulance.\" By phone, Hartt-Goggin told us the ambulance company serves private clients out of Las Cruces, NM. Our attempts to reach a Las Cruces official with American Medical Response, a Colorado-based company, didn’t draw an immediate response.", "Carrera’s report says the witness said that he initially saw a green Volvo pass his vehicle at a high rate of speed westbound on I-10. \"The vehicle then lost control moments later and struck a truck traveling the same direction,\" the report says. \"After the driver/defendant struck the truck, it sent the defendant’s vehicle across the center median and to a complete stop facing east bound,\" the report says.", "\"The defendant/driver then attempted to leave the scene,\" the report says. But the witness \"turned on his overhead lights to warn oncoming traffic and to get the defendant to stop.\"", "The report says that when the officer engaged O’Rourke in conversation, he wasn’t understandable due to slurred speech. The report says the officer asked O’Rourke to step out of the vehicle and \"upon doing so the defendant almost fell to the floor,\" the report says.", "Separately, the Austin American-Statesman asked the Texas Department of Public Safety for agency reports on file about the incident. M.L. Calcote said in a September 2018 letter sent by email that the agency didn’t have responsive records.", "O'Rourke stands by debate statement", "We asked O’Rourke’s campaign about the witness telling Carrera that O’Rourke tried to leave the accident scene. By email, Chris Evans said O’Rourke stands by what he said at the debate about not trying to leave. Evans noted that the \"police report shows he was arrested for a DWI, not for leaving or attempting to leave the scene.\"", "Our ruling", "O’Rourke said he didn’t try to leave the scene of his 1998 DWI accident and arrest.", "Records indicate O’Rourke was arrested at the scene and wasn’t charged with trying to flee. But the September 1998 Anthony Police Department report on the incident says a witness said O’Rourke tried to leave the scene before police arrived and the witness kept him from doing so.", "We rate this claim Mostly False.", "MOSTLY FALSE – The statement contains an element of truth but ignores critical facts that would give a different impression. Click here for more on the six PolitiFact ratings and how we select facts to check.", "News story, \"Police reports detail Beto O’Rourke’s 1998 DWI arrest,\" Houston Chronicle, Aug. 30, 2018", "Document, report on Beto O’Rourke’s DWI arrest by Richard Carrera, investigator, Anthony Police Department, Sept. 30, 1998 (posted by Houston Chronicle, Aug. 30, 2018)", "Fact-check, \"Beto O'Rourke arrested in 1990s for burglary and DWI,\" PolitiFact Texas, Aug. 22, 2018", "Email and phone interviews, Linda Hartt-Goggin, officer, Anthony Police Department, Sept. 24-25, 2018", "Email, Chris Evans, communications director, Beto O’Rourke campaign, Sept. 25, 2018", "Letter to Johnathan Silver, reporter, Austin American-Statesman from C.L. Calcote, assistant general counsel, Office of General Counsel, Texas Department of Public Safety, Sept. 14, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]