["“Watch this before it is taken down...VERY IMPORTANT,” reads a December 11, 2020 Facebook post that includes a video of a speech at the Pennsylvania state Capitol that has been shared more than 18,000 times.", "The video appears to have been recorded on October 20, 2020, according to captions, and copies of it which have garnered hundreds of thousands of views on YouTube. In it, biomedical researcher James Lyons-Weiler speaks about the purported dangers of Covid-19 vaccines.", "In his speech, he says that “the only single data point that we have on what percentage of human patients exposed to coronavirus vaccines have had serious adverse events is from the Moderna trial, and that number is 21 percent. Twenty-one percent of people are having serious adverse events from this vaccine in that trial. The other ones haven't published their data yet.”", "At that time, the available data was from the preliminary report Moderna had released on July 14, 2020 about the first phase of its Covid-19 vaccine trial. But this is not made clear to viewers in the Facebook posts sharing the speech after additional safety data became available.", "A press release from the company in July said: “The most notable adverse events were seen at the 250 µg dose level, with three of those 14 participants (21%) reporting one or more severe events.”", "In the group that was administered the highest dose, which is not being given to the general public, the study found two of the severe events were related to vaccination -- “syncope and lightheadedness.”", "The authors concluded that “no trial-limiting safety concerns were identified,” and the vaccine candidate proceeded onto large clinical trials.", "William Moss, Executive Director of the International Vaccine Access Center at the Bloomberg School of Public Health at John Hopkins University told AFP, “The 21 percent came from the 3 out of 14 participants with severe adverse events identified in the phase 1 trial of the Moderna vaccine...this was with the highest dose (250 ug). Because of these reactions, Moderna did not move forward with this dose. The current dose is 100 ug.”", "In November 2020, Moderna released data from the phase 3 trial.", "The Moderna Covid-19 vaccine has since received emergency authorization by the US Food and Drug Administration (FDA), the federal agency responsible for approving vaccines. The Pfizer-BioNTech vaccine, which uses the same mRNA technology, also received approval in December.", "Moss said the best data on adverse events was reported to the Vaccines and Related Biological Products Advisory Committee.", "“The reported incidence of severe adverse events from the phase 3 trial are more trustworthy as they reflect the actual dose of the Moderna vaccine being used as well as the fact that the phase 3 results are based on a much larger sample size. So, highlighting the 21 percent for the highest dose from the very small sample size in the phase 1 trial was deceptive,” Moss said.", "Moderna submitted a document to the FDA showing that only 82 people, or 0.5 percent of the 15,184 trial patients who received the vaccine, experienced a serious adverse event, with only five, or less than 0.1 percent, linked to vaccination. In the placebo group 86 people or 0.6 percent of 15,162 participants also reported serious adverse events (see the “Safety” section starting page 31 of the document).", "Moss explained that “this range in the frequency of serious adverse events is not unexpected” for a vaccine trial.", "He also published a blog post clarifying questions around the safety of the Covid-19 vaccines here.", "“For both the Pfizer and Moderna vaccines, these reactogenic side effects were mild to moderate, occurred up to two days after vaccination, and do not have any long-term consequences,” he wrote.", "“Severe adverse reactions – which include any severe disease after vaccination whether related to the vaccine or not – occurred in less than five percent of vaccine recipients,” he added.", "André Veillette, director of the Molecular Oncology Research Unit at the Montreal Clinical Research Institute (IRCM), said in an email that the number of reactions was “fairly standard, with adverse events both in vaccine and in placebo groups” including pain, redness, swelling, fever or malaise.", "“There are about 15,000 people in each group, so the frequency of adverse events is not high,” added Veillette, who joined the Government of Canada Covid-19 vaccine task force in August.", "Moderna did not reply to a request for comment.", "AFP Fact Check previously debunked many false or misleading claims about the Covid-19 vaccines here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]