["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "On Nov. 3, 2020, Americans will head to the polls to cast a ballot in the general presidential election. But U.S. Immigration and Customs Enforcement agents won’t, the federal agency says.", "A recent Facebook post claims otherwise.", "\"Spread this like wildfire,\" the Feb. 10, 2020, post says. \"I.C.E. will be at every polling station on Nov 3rd 2020.\"", "Maybe don’t spread this like wildfire. This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "In a statement, ICE told PolitiFact that \"ICE does not patrol or conduct enforcement operations at polling locations. Any flyers or advertisements claiming otherwise are false.\"", "Between fears that undocumented immigrants are illegally voting in elections — and we’ve debunked many such claims — and widespread news coverage about ICE raids, plans for the agency to be posted up at every polling location on Nov. 3 would draw media attention. But we could find no reporting on the unsubstantiated claim in the Facebook post.", "We rate it False.", "Facebook post, Feb. 10, 2020", "PolitiFact, No evidence ‘many’ illegal immigrants voted in midterm elections, as Lou Dobbs said, Nov. 16, 2018", "PolitiFact, Conservative activists promote misleading, ‘undercover’ video about voter fraud, Feb. 6, 2020", "PolitiFact, Fact-check: Did 3 million undocumented immigrants vote in this year’s election? Nov. 18, 2016", "CNN, Their first day of school turned into a nightmare after record immigration raids, August 2018", "New York Times, ICE arrests hundreds in Mississippi raids targeting immigrant workers, Aug. 7, 2019", "Washington Post, ICE agents raid Miss. work sites…, Aug. 7, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]