["“चुनाव ख़त्म होते ही अपने असली रंग में आ गये जनेऊधारी राहुल बाबा”(Janeudhari Rahul baba back to his true colours after conclusion of polls- translated). This message has been viral on Facebook and Twitter from December 17, 2018 along with a video. In the video, Rahul Gandhi can be seen offering namaz along with senior Congress leader Ghulam Nabi Azad and some members of the Muslim community. It is being claimed that this video was taken after the recent assembly elections.", "A Facebook user Ashish Mehta has posted this video, which has been viewed over 7000 times and shared over 500 times. The video has been posted with the identical narrative by multiple pages like Modinama, Social Tamasha and India272+. ModiNama and India272+ have more than 1.9 million followers, whereas Social Tamasha has over 100,000 followers. Taking these three pages together, the video has been viewed more than 5 lakh times and shared over 13000 times already.", "चुनाव ख़त्म होते ही अपने असली रंग में आ गये जनेऊधारी राहुल बाबा", "चुनाव ख़त्म होते ही अपने असली रंग में आ गये जनेऊधारी राहुल बाबा", "Posted by India272+ on Monday, December 17, 2018", "The Facebook page The India Eye which has been caught spreading misinformation in the past, has also posted this video, which has been viewed over 53,000 times.", "Generally, Facebook pages make use of their logo in their posts, and the logo seen in this video is Argumentative Indian. Using this keyword, we searched on Facebook and found another page with the same name and logo, where the video had first been shared. This page has about 10,000 followers. In the comments section of this video, one user named Rajesh Yadav had posted a link to a YouTube video and claimed that it is over two years old.", "The link given in the comments section is of a report of December 10, 2016 by the news channel Sahara Samay, in which it has been reported, “After attending a meeting at Shivbaba in Ambedkar Nagar, UP, Rahul Gandhi reached the famous Sharif Kichhocha dargah and on the tomb of Makhdoom Sahab, offered tribute” (approximate translation).", "This news was also reported on September 10, 2016 by Aaj Tak with the headline, “Rahul Gandhi pays tribute at Ambedkarnagar’s famous Kichhocha Sharif dargah” (approximate translation).", "Rahul Gandhi and Congress party have been increasingly targeted through disinformation after the recently concluded assembly elections, be it through old videos which are either taken out of context or clipped. Earlier, Alt News had reported how two separate videos were clipped and juxtaposed to make it seem as if Gandhi has reneged on his promise of farm loan waiver.", "Donate Now", "Priyanka Jha specialises in monitoring and researching mis/disinformation at Alt News. She also manages the Alt News Hindi portal.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]