["\"Breaking News: Please pray for the 22 Christian missionaries who have been sentenced to death tomorrow afternoon by the Islamist in Afghans. Can you please pass on this news as fast as possible so that a lot of people can pray for them,\" reads one post, which has been shared more than 1,000 times since it was shared in a religious Facebook group on August 4. We’ve archived the post here.", "This hoax has been in circulation since 2009 and, as reported by fact-checking site Snopes, it has also spread via emails and text messages. We’ve archived a couple more recent examples on Facebook here and here.", "As reported by AFP, 23 South Korean missionaries were kidnapped in Afghanistan by the Taliban in 2007. The captors killed two of the hostages, Presbyterian pastor Bae Hyung-Kyu and medical-services volunteer Shim Sung-Min, in the initial weeks of the standoff. The rest were released.", "What’s the situation in Afghanistan?", "Afghanistan is one of the world's most dangerous places for Christians, according to Open Doors, a non-denominational mission supporting persecuted Christians.", "Missionary work is illegal and there have been cases of the Taliban killing people accused of working as Christian missionaries, including the 2014 attack on a South African family living in Kabul.", "The situation has become even more precarious following the sudden return to power of the Taliban in August 2021.", "\"We know from the media but also from local sources that the Taliban are going door to door to weed out unwanted elements. Who are unwanted? Everybody who collaborated with the West... but also homosexuals and non-Muslims,\" Open Doors told AFP Fact Check.", "\"Anybody who is exposed will be severely punished.\"", "The hardline Islamist movement governed Afghanistan between 1996 and 2001, handing out extreme punishments including public executions and chopping off the hands of thieves.", "They were ousted by a US-led military operation in 2001 but staged a sudden comeback this summer after the US announced the withdrawal of its troops.", "AFP has been covering the Taliban's return to power, including the reported manhunts in Kabul.", "The picture was probably taken in Iraq, not Afghanistan", "A reverse image search allowed AFP Fact Check to trace the photograph to news reports about the execution in May 2015 of three men in Iraq by the Islamic State group.", "Reverse image searches on Google and Yandex led to this Daily Mail article, which reported that the photograph shows the execution of a man accused of spying for the government in Nineveh province, a northwestern area held at the time by IS.", "The same photograph was published by the Iranian news outlet ABNA a day later.", "We showed the photo to AFP’s fact-checking team in the Middle East, who said that several elements of the image indicated that it showed an IS execution in Iraq:", "1. The text at the bottom of the photo locates it in Iraq. It says the photo was taken in “Nineveh State”. Nineveh is a province in northern Iraq.", "2. The photo bears the hallmarks of IS propaganda. The yellow logo, seen partially in the bottom right-hand corner of the photo, has appeared in other IS propaganda. “Nineveh State” is also a term used by the IS group -- the Iraqi government does not refer to it as a state. The subtitle also identifies the image as showing an IS execution, reading: “Execution of the sharia judgment -- the Islamic State”.", "The logo is circled in red below:", "3. IS held this part of Iraq in 2015. When the photo first appeared online four years ago, IS was in control of a vast swathe of Iraqi land, including Nineveh. Iraqi forces took back control of the entire province in August 2017, but they periodically launch operations in the country's west and northwest border areas -- including Nineveh -- targeting IS “sleeper cells”.", "4. The clothing matches that worn by other IS executioners. Other IS propaganda material has also featured executioners wearing a long, loose black shirt, black trousers and a head covering. They have also, like in the video screenshot seen above, used a sword for the execution.", "All of these signs indicate that the photo shows an IS execution in Iraq, and not the killing of a Christian missionary in Afghanistan.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]