["United Parcel Service President of Global Healthcare Wesley Wheeler holds an example of the vial that will be used to transport the Pfizer COVID-19 vaccine as he speaks at a Senate Transportation subcommittee hearing Dec. 10, 2020. (AP)", "Despite decades of research, there is no vaccine against HIV given unique challenges the virus poses, such as rapid mutations that are difficult for the immune system to adapt to.", "There are some vaccines to prevent and even treat some cancers, but not all cancers are caused by a virus.", "There are many different rhinoviruses that can cause the common cold. That makes it difficult for researchers to create a vaccine that can address them all.", "Governments around the world have invested in companies to help speed up a COVID-19 vaccine. COVID-19 vaccines up for FDA evaluation have characteristics that allow them to be produced faster than other commonly known vaccines.", "It typically takes years to develop and approve vaccines, yet for COVID-19, first reported in late 2019, federal regulators are already reviewing vaccines that researchers say are more than 94% effective.", "The speed of the vaccines' development has some people on social media questioning their safety.", "\"So let me get this straight,\" says a Dec. 6 Facebook post. \"40 years of research, and no vaccine for HIV. At least 100 years of research and no vaccine for cancer. Ongoing research, and no vaccine for the common cold. Now in less than a year, there's a vaccine for COVID-19??? Nah I think I’ll pass on that shot!!!\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The facts show that what accounts for the disparity is not undue haste with the COVID-19 vaccine, but rather important differences between the illnesses highlighted in the post, and a new approach to vaccine development.", "For example, there are many types of cancers, and only a few are known to be caused by viruses.", "\"So a universal vaccine to prevent ‘cancer’ is not something that is possible or pursued,\" said Jan Carette, an associate professor of microbiology and immunology at Stanford University School of Medicine. \"For specific viruses that cause specific forms of cancer, vaccines have been developed.\"", "The post also ignores unique medical challenges in creating vaccines against HIV and the common cold.", "The COVID-19 vaccines from Moderna and Pfizer that are up for review by the U.S. Food and Drug Administration are a type called \"mRNA.\" Researchers have been studying this type of vaccine technology for decades.", "Most vaccines trigger an immune response by introducing weakened or inactivated versions of the disease-causing pathogen (such as a virus or bacterium) into the body. The mRNA vaccines, by contrast, use a genetic messenger to teach cells in the body how to make a protein — or even just a piece of a protein — to trigger an immune response. (The Centers for Disease Control and Prevention has more information on how COVID-19 mRNA vaccines work.)", "An mRNA vaccine has shorter manufacturing times and can be developed in labs using readily available materials. \"This means the process can be standardized and scaled up, making vaccine development faster than traditional methods,\" according to the CDC.", "Health officials have said that COVID-19 mRNA vaccines are being held to the same rigorous safety and effectiveness standards as all other types of vaccines allowed in the United States.", "The Trump administration's Operation Warp Speed, an initiative to help speed up the development, manufacturing and distribution of COVID-19 vaccines and other therapeutics, has also played a significant role in getting the vaccines to market. The federal government has made vaccine deals totaling more than $9 billion with multiple private companies. The deals vary in scope; some are only for the purchase of vaccines, other agreements provide funding for the research and manufacturing of vaccines.", "The CDC says there are seven types of coronaviruses that can infect people. One of them is the new virus that causes COVID-19, SARS-CoV-2. A study published in November by researchers at the University of North Carolina at Chapel Hill said that vaccines may be more effective on a current and common strain of SARS-CoV-2, compared with a previous strain of the virus.", "Common cold: Around 80% of common cold cases are caused by rhinoviruses — of which there are over 100 different types, many circulating at the same time, said Carette, the Stanford researcher. The common cold can also be caused by many different respiratory viruses, making it difficult for a single vaccine to target all varieties of the cold.", "The possibility of a vaccine composed of 50, 100 or more distinct human rhinovirus antigens \"has been viewed as formidable or impossible and has discouraged many vaccine makers,\" Carette said.", "HIV: A vaccine against the human immunodeficiency virus, which causes AIDS, has proved especially challenging because the immune system responds to HIV differently from other viruses. While all viruses change, HIV mutates rapidly and has unique ways of evading the immune system. \"There are no documented cases of a person living with HIV developing an immune response that cleared the infection,\" says the National Institute of Allergy and Infectious Diseases.", "In clinical trials, inactivated HIV has not been effective at eliciting immune responses and, a live form of HIV is too dangerous to use, according to the institute. Research on an HIV vaccine has been going on since the 1980s.", "Cancer: There are vaccines available to help prevent human papillomavirus infections, and some strains of HPV have been linked to some cancers. Most cervical cancers are caused by infection with HPV, according to the American Cancer Society.", "The American Cancer Society also says that people who have long-term infections with the hepatitis B virus are at higher risk for liver cancer, and getting a hepatitis B vaccine may lower some people’s risk of getting liver cancer.", "There are also vaccines to treat certain types of cancers; these vaccines are intended to work against cancer cells, not against something that causes cancer.", "\"Sometimes a patient’s own immune cells are removed and exposed to these substances in the lab to create the vaccine,\" the cancer society says. \"Once the vaccine is ready, it’s injected into the body to increase the immune response against cancer cells.\"", "A Facebook post claimed, \"40 years of research, and no vaccine for HIV. At least 100 years of research and no vaccine for cancer. Ongoing research and no vaccine for the common cold. Now in less than a year, there's a vaccine for COVID-19?\" The post questions the safety of the COVID-19 vaccines on that basis.", "Vaccines for COVID-19 were poised to be evaluated by regulators about a year after the virus was discovered. But the post goes too far in drawing conclusions about the vaccines’ safety based on how quickly they were developed compared with efforts to fight other illnesses. It ignores important differences in the development process, and characteristics of the illnesses that make them not directly comparable to COVID-19.", "Health officials have said that COVID-19 mRNA vaccines are being held to the same rigorous safety and effectiveness standards as all other types of vaccines allowed in the United States.", "The post contains elements of truth, but ignores critical facts that would give a different impression.", "We rate the post Mostly False.", "Facebook post, Dec. 6, 2020", "Email interview, Jan Carette, an associate professor of microbiology and immunology at Stanford University School of Medicine, Dec. 7, 2020", "Moderna, Moderna Announces Primary Efficacy Analysis in Phase 3 COVE Study for Its COVID-19 Vaccine Candidate and Filing Today with U.S. FDA for Emergency Use Authorization, Nov. 30, 2020", "Pfizer, Pfizer and BioNTech to Submit Emergency Use Authorization Request Today to the U.S. FDA for COVID-19 Vaccine, Nov. 20, 2020", "National Institutes of Health, What Is Cancer?, updated Feb. 9, 2015; Cancer Treatment Vaccines, posted Sept. 24, 2019", "FDA.gov, Studying how pathogens cause disease, last updated Dec. 2, 2016", "CDC.gov, mRNA vaccine; types of coronaviruses; rhinoviruses", "PolitiFact, How Pfizer's and Moderna's COVID-19 vaccines are tied to Operation Warp Speed, Nov. 19, 2020", "World Health Organization, Naming the coronavirus disease (COVID-19) and the virus that causes it", "Sciencemag.org, SARS-CoV-2 D614G variant exhibits efficient replication ex vivo and transmission in vivo, Nov. 12, 2020", "University of North Carolina, Common SARS-CoV-2 mutation may be more susceptible to vaccine, Nov. 12, 2020", "National Institute of Allergy and Infectious Diseases, Progress toward an HIV vaccine", "Cancer.org, Cancer Vaccines and Their Side Effects", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]