["This post was shared here on Facebook on September 24, 2020.", "The post’s caption begins with a sentence in Urdu language which translates to English as: “Another medal of destruction for the country…!”", "The rest of the post’s English text reads: “International Civil Aviation Authority (ICAO) has issued notice to Pakistan Civil Aviation Authority that it is no longer allowed to issue licences to pilots, crew or engineers. ICAO has also delayed its inspection to Pakistan and expressed reservations over safety.", "Regulators barred Pakistan International Airlines from the European Union for six months after the state-run carrier grounded nearly a third of its pilots for holding fake or dubious licences, AFP reported here on June 30, 2020.", "A similar claim about the ICAO was shared on Facebook here, here and here, and on Twitter here, here and here.", "The claim is false.", "In response to the misleading posts, Civil Aviation Authority Pakistan official Amir Habib said the claim was “false”.", "\"It's false news,” he said. “There is no such thing. ICAO has also tweeted and clarified it,\" he told AFP by phone on September 29.", "On September 24, 2020, the Montreal-based International Civil Aviation Organisation (ICAO) tweeted that it had not issued the purported directive cited in the misleading posts.", "The tweet reads: “Our agency is neither designed nor empowered to issue such directives. We call on @ARYNEWSOFFICIAL, @RehamKhan1, @NewsweekPak, @BaaghiTV, @raisinganchor and others to retract the statements they have promoted on twitter. https://twitter.com/ARYNEWSOFFICIAL/status/1309042705805312000”.", "In response to an email from AFP on September 28, 2020, William Raillant-Clark, spokesman for the International Civil Aviation Organization, said that UN agencies have no authority over countries.", "“It is important to understand that ICAOs auditing programmes were created at the request of states to help them meet their commitments to one another, per the standards and recommended practices they adopt together under the Chicago Convention. UN agencies have no authority over countries but rather are designed to assist them in cooperating diplomatically,” Raillant-Clark said.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]