["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "It comes at the end of a laundry list of alleged flip-flops by Sen. Barack Obama, contained in a news release from Sen. John McCain's campaign.", "Change #17: \"Barack Obama said he would debate 'anywhere, anytime' but has rejected joint town hall meetings.\"", "McCain has repeatedly proposed as many as 10 town hall meetings this summer; the Obama campaign countered with a proposal for two joint appearances this summer. Currently in stalemate, the McCain campaign claims Obama reneged on a promise to engage him \"anywhere, anytime.\" And so now, inevitably, we have a debate over debates.", "The genesis of Obama \"anywhere, anytime\" comment dates back to a May 16, 2008, speech in Watertown, S.D.", "\"I am happy to have a debate with John McCain and George Bush about foreign policy,\" Obama said. \"If John McCain wants to meet me anywhere, anytime to have a debate about our respective policies in Iraq, Iran, the Middle East or around the world, that is a conversation I'm happy to have, because I believe that there is no separation between John McCain and George Bush when it comes to our Middle East policy, and I think their policy has failed.\"", "If it was a sitcom, Obama's \"anywhere, anytime\" challenge would have been followed by an audience \"Oooooh.\"", "In a speech on June 4, McCain stepped up and proposed a series of 10 town hall meetings, one a week until the week before the Democratic National Convention (in addition to the three traditional debates after the conventions).", "\"I suggest a town hall meeting format because I believe it's the best way,\" McCain said. \"I don't think we need any big media-run productions, no process questions from reporters, no spin rooms, just two Americans running for the highest office of the greatest nation on Earth responding to the concerns of the people whose trust we must earn.\"", "Many speculated that such an intense and unprecedented schedule of town hall meetings would benefit McCain, providing national media exposure to a campaign that is likely to be vastly outspent on television advertising.", "Obama seemed warm to the idea.", "On the same day, Obama told ABC, \"Oh, we're definitely going to be doing some town hall debates.\"", "\"I look forward to, you know, having more than just the three traditional debates that we've seen in recent presidential contests,\" Obama said.", "But then the Obama campaign countered with a proposal for five joint appearances: the three traditional debates after the conventions, plus a joint town hall on the economy in July and a debate on foreign policy in August. So really just two additional appearances before the regular debates.", "The McCain campaign declined. Politico reported that the single town hall Obama agreed to would have been on the Fourth of July weekend, a guaranteed ratings loser that McCain spokesman Brian Rogers referred to as a \"total joke.\"", "McCain campaign manager Rick Davis wrote a letter to the Obama campaign stating, \"We fear that our negotiations over joint town hall meetings are turning into a debate about process. That is exactly what we have always hoped to avoid, and why we proposed a town hall format that would render many of these process issues moot.", "\"We remain committed to this idea because joint town hall meetings offer the best format for presenting both candidates' visions for our country's future in a substantive way. We have a chance to change the way presidential elections are run and elevate the political dialogue. Americans deserve this kind of opportunity, and we hope that Sen. Obama will join us at town hall meetings throughout the summer months.\"", "Obama campaign manager David Plouffe responded that Obama's proposal for five joint appearances \"would have been the most of any presidential campaign in the modern era, offering a broad range of formats and representing an historic commitment to openness and transparency.", "\"It's disappointing that Sen. McCain and his campaign decided to decline this proposal. Apparently they would rather contrive a political issue than foster a genuine discussion about the future of our country.\"", "An Obama campaign spokesman said on July 11 that nothing has changed since that stalemate.", "Clearly there is a lot of posturing going on. But did Obama backtrack? His \"anywhere, anytime\" challenge was issued specifically \"to debate about our respective policies in Iraq, Iran, the Middle East or around the world.\" The Obama campaign did offer an \"in-depth\" foreign policy debate in August.", "And he didn't reject the town hall concept, he just wasn't willing to do as many as McCain wanted.\n\nStill, after seemingly endorsing the idea, Obama's offer of just two appearances (one on a holiday weekend) beyond the traditional postconvention debates sounds like a change of heart.", "We rate McCain's claim Half True.", "YouTube,\n\n\"Video: Obama's I'll meet 'Anywhere, Anytime' to debate foreign policy,\"\n\nMay 16, 2008", "ABC News,\n\n\"Obama Open to Town Hall Debates With McCain,\"\n\nby Tahman Bradley, June 4, 2008", "ABC News,\n\n\"Video: McCain Suggests Joint Appearances with Obama,\"\n\nJune 4, 2008", "New York Times,\n\n\"About Those Town-Hall Meetings...\"\n\nby Adam Nagourney, July 14, 2008", "AP,\n\nMcCain, \"Obama fail to agree on town halls,\"\n\nby Nedra Pickler, June 13, 2008", "Salon.com,\n\n\"Debating debates: The McCain and Obama camps are now sniping at each other over John McCain's proposal to hold 10 joint town halls,\"\n\nby Alex Koppelman and Mike Madden, June 13, 2008", "Time,\n\n\"McCain Camp Statement on Reagan, LBJ Library Town Halls,\"\n\nby Mark Halperin, July 15, 2008", "USA Today,\n\n\"McCain challenges Obama to town hall-style debates,\"\n\nby David Jackson, June 4, 2008", "Politico,\n\n\"Town hall talks break down,\"\n\nby Ben Smith, June 13, 2008", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]