["The claim was published here on Facebook on November 30, 2020.", "The post features a photo of Chinese Foreign Minister Wang Yi, with Korean text that translates to English as: “Immediately after Wang Yi returns [to China].... Moon Jae-in announces ‘We have procured vaccines for 45 million people’”.", "The Korean-language post states, in part: “Please congratulate us. These vaccines are effective because they were made in China, where the coronavirus originated.", "“We have been promised [Chinese novel coronavirus vaccines] after flattering Wang Yi during his visit”.", "These posts circulated online just days after Wang made a three-day visit to South Korea from November 25, 2020. Here is a report by Chinese state media CGTN on the visit.", "Similar claims have also been shared here, here, here, here, here and here on Facebook.", "However, the claim is misleading.", "Chinese foreign minister's visit", "According to the Chinese foreign ministry, Wang held talks with South Korean President Moon, Foreign Minister Kang Kyung-hwa and several other senior officials during his three-day visit to Seoul in November 2020.", "Official statements from both South Korea’s presidential office and foreign ministry on Wang’s visit make no reference to discussions on the importation of China-made novel coronavirus vaccines, or agreements on its procurement.", "As of December 2, 2020, multiple keyword searches found no credible reports about Moon announcing South Korea had been “promised” novel coronavirus vaccines from China during talks with Wang.", "Covid-19 vaccines in South Korea", "This November 29, 2020 report by South Korea’s Yonhap News Agency says the ruling Democratic Party aims to secure sufficient coronavirus vaccines for “44 million people, or 85 percent of the country's population”.", "Citing a “key party source”, it states that the party will seek an additional 1.3 trillion won (US$1.18 billion) in next year's state budget to access the vaccines.", "The next day, the party issued this statement echoing part of the Yonhap report.", "It reads, in part: “As pharmaceutical companies worldwide continue to present their findings on the ongoing clinical trials of their coronavirus vaccines, this party will look to increase funding for securing [these vaccines], to provide more than the original aim of securing a supply for 30 million people.”", "Neither the Yonhap report or the Democratic Party statement specifies that these vaccines will be sourced from China.", "During a press conference on November 29, 2020, South Korean Prime Minister Chung Sye-kyun said talks with “US and European vaccine suppliers” are “yet to be complete”, when questioned about the aforementioned Democractic Party statement.", "At the video’s 24-minute 20-second mark, Chung says, in part: “While many domestic bio companies are working to develop the vaccines [but] it is likely that there will be a significant delay for these domestic companies to deliver. Until they can, we are working to receive the needed amount from US and European vaccine manufacturers, but as talks with these providers are yet to be complete, we expect to deliver these results at a later date.”", "South Korean news agency Yonhap reported on December 3, 2020 that the government has reached an agreement with British pharmaceutical company AstraZeneca for the acquisition of its novel coronavirus vaccines.", "The report reads, in part: \"A health ministry official [told Yonhap] on December 3, 'We have signed a contract with AstraZeneca to be supplied vaccines, and when talks with individual vaccine manufacturers are completed next week, we will be making announcements on details of the contracts and the amounts we have procured.'\"", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]