["About this rating", "In October 2018, an image purportedly showing Amy Schumer ripping apart a fetus made the social media rounds along with a quote ostensibly uttered by the actress (caution: some viewers may find the images below disturbing):", "This is not a genuine image of Amy Schumer, nor is it a genuine quote from the actress. And although this may not have to be said, it is also not a genuine photograph of fetus being ripped apart.", "The viral image was created by digitally overlaying Schumer's face onto an image from \"Stolen Innocence,\" a photography studio that specializes in \"dark and horror-themed photography.\" The original photograph was staged as part of a series called \"Baby Smash,\" which featured model Ashley Rich.", "Here's a look at the original photograph (left) and the doctored image with Schumer (right):", "We searched news articles and Schumer's social media feeds and found no record of the actress ever uttering the ungrammatical phrase \"Fetuses aren't people and have no right, if you can't get an abortion just get rid of it when is born.\" In fact, the only results we found for this quote were attached to memes critical of the actress.", "The image began circulating at the end of October 2018, just after the actress announced that she was pregnant with her first child. Schumer made the announcement on Instagram in a post which also provided several voting recommendations for the midterm elections:", "Yesterday post and cheat sheet if you want to know some of my recommendations for nov 6", "A post shared by @ amyschumer on Oct 23, 2018 at 8:56am PDT", "Gonzalez, Sandra.   \"Amy Schumer Expecting Her First Child.\"\r\n   CNN.   23 October 2018.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]