["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "ClearPath Action Fund, a conservative clean-energy and environmental PAC, cheered U.S. Sen. Rob Portman in a digital ad, calling him a \"clean energy champion.\"", "The ad said of the Republican senator, \"Rob Portman voted for the bipartisan bill to affirm climate change is real, humans significantly contribute to it and it needs to be addressed.\"", "PolitiFact previously looked into how many Republicans in Congress say they believe that climate change is real, and caused by human activity.", "The Republican lawmakers we identified who affirm climate change included Rep. Michael Grimm, N.Y.; Sen. Susan Collins, Maine; Sen. Lamar Alexander, Tenn.; Sen. Mark Kirk, Ill.; Rep. Chris Smith, N.J.; Sen. Bob Corker, Tenn.; Sen. John Thune, S.D.; and Rep. Rodney Frelinghuysen, N.J.", "Portman didn’t make PolitiFact’s list, so we wanted to clarify his climate change stance.", "We asked ClearPath Action Fund for the sources they used to champion Portman’s position, and a spokesman sent us three links.", "The first two were votes on amendments to the Keystone XL Pipeline Act in January 2015 (which was after PolitiFact did its roundup of Republicans who believe in climate change).", "The climate change amendments were only symbolic gauges of the \"sense of the Senate.\" Portman voted \"yea\" on the first, introduced by Democratic Sen. Sheldon Whitehouse, \"to express the sense of the Senate that climate change is real and not a hoax.\" That amendment passed.", "Portman also voted in support of a second amendment by Republican Sen. John Hoeven, a Keystone bill sponsor, which said that human activity affects climate change, but still supported the passage of the pipeline bill. That amendment fell short of the required 60 by one vote, and Hoeven himself voted against it.", "So far, so good for ClearPath Action Fund.", "Here's how one wrong word — \"significantly\" — pulls the PAC's praise for Portman's record into negative territory.", "A Democrat, Hawaii Sen. Brian Schatz, inched the global warming language a step further, calling for a vote on an amendment that stated \"human activity significantly contributes to climate change.\"", "The adverb represents the crux of the partisan divide over climate change.", "The word \"significantly\" was significant enough for Portman to vote against that amendment, along with almost all of his fellow Republicans. Collins, Kirk, Alexander, Lindsey Graham (S.C.) and Kelly Ayotte (N.H.) broke party lines and voted in favor.", "Portman has explained in interviews that he doesn’t want to qualify the impact that human activity has on the climate because \"scientists have different views on that.\"", "These word gymnastics are necessary for Portman because of his large constituency in Ohio coal country. Coal-burning power plants provide 44 percent of the electricity used in the U.S., but are the biggest contributor to air pollution, according to the Union of Concerned Scientists.", "\"Sense of the Senate resolutions are done for messaging reasons, either in an attempt to move the policy debate, or to provide political cover of some sort. I think you had both types in play with the Keystone vote,\" said David Jenkins, president at Conservatives for Responsible Stewardship.", "More recently, Portman voted for an amendment proposed by Graham that stated, \"Climate change is real; human activity contributes to climate change,\" and that \"the United States should be a world leader in addressing climate change…(and) Congress has a responsibility to take actions that reduce emissions and combat climate change...\"", "Absent, again, is the word \"significantly.\" But it is in the language of the ClearPath Action ad: \"Rob Portman voted for the bipartisan bill to affirm climate change is real, humans significantly contribute to it and it needs to be addressed.\"", "ClearPath Action’s communications director, Darren Goode, responded immediately to PolitiFact via email, and said the group had made an \"honest mistake\" by including the s-word.", "\"We have already pulled that video down and will fix it to reflect that,\" Goode wrote.", "While ClearPath Action confers \"clean energy champion\" status to Portman, at least two other environmental groups beg to differ. The National Resources Defense Council has regularly hammered Portman for sponsoring such measures as a budget amendment to allow states to opt out of the 1970 Clean Art Act and Clean Power Plan requirements for cutting carbon pollution.", "Likewise, the League of Conservation Voters gives Portman a low rating on their scorecard for his voting record on environmentally impactful measures.", "Our ruling", "An ad by ClearPath Action said, \"Rob Portman voted for the bipartisan bill to affirm climate change is real, humans significantly contribute to it and it needs to be addressed.\"", "While Portman did vote for a bipartisan bill recognizing climate change as a threat in need of action, that bill did not include the word \"significantly.\" Portman has voted against other amendments when they include the word \"significantly,\" and has voted for amendments that do not quantify how much human activity affects climate change.", "ClearPath Action has since discontinued the ad, admitted the mistake and pledged to release a corrected version.", "We rate the original version of the ad Mostly False.", "https://www.sharethefacts.co/share/67974c57-e2bb-4327-a497-e2db21a126f0", "Email Interview, Darren Goode, communications director, Clear Action Fund, Oct. 4, 2016", "Email interview, David Jenkins, president, Conservatives for Responsible Stewardship, Oct. 7, 2016", "Interview, Michawn Rich, campaign spokesperson, Rob Portman for Ohio, Oct. 4, 2016", "ClearPath Action Fund, \"Rob is a steward of our Great Lakes\"", "PolitiFact, \"Jerry Brown says ‘virtually no Republican’ in Washington accepts climate change science,\" May 18, 2014", "The Hill, \"Senate votes 98-1 that climate change is real,\" Jan. 21, 2015", "The Guardian, \"U.S. Senate refuses to accept humanity’s role in global climate change, again,\" Jan. 22, 2015", "Cincinnati.com, \"Portman climate change vote hinges on one word,\" Mar. 29, 2015", "Congress.gov, S.Amdt.3864 to S.Amdt.3801", "League of Conservation Voters, Rob Portman scorecard, accessed Oct. 5, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]