["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "AARP is an organization that lobbies on behalf of Americans who are 50 and older, so it would be surprising if, actually, they think some of their members should just die.", "But that’s exactly what recent Facebook posts like this one claim.", "\"AARP endorsed Biden. Biden’s virus committee doesn’t think living past 75 is worth living,\" it says. \"Will you renew your AARP membership since AARP says if you are past 75 you should just die and go away?\"", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "We previously fact-checked another post that said AARP endorsed Biden — that’s False. AARP is a nonpartisan organization that doesn’t endorse political candidates.", "Jason Young, an AARP spokesperson, told us that the other allegation in this Facebook post is wrong, too.", "\"Since the early days of the pandemic, AARP has warned policymakers on all sides that rationing care based on age or disability is discriminatory,\" Young said in an email. \"Older people are not political pawns or less worthy to receive care or a vaccine than anyone else.\"", "Press releases and news coverage in recent months support this.", "A March 31 press release from AARP titled \"AARP statement against rationing in the distribution of and access to health care\" quotes Nancy LeaMond, the organization's executive vice president.", "\"Using age or disability to categorically exclude people from accessing treatment would be discriminatory and AARP opposes it,\" she said.", "An April 9 Wall Street Journal article about state plans to possibly ration ventilators as health care facilities were overwhelmed with COVID-19 patients reported that AARP called for federal policies to protect the elderly and other vulnerable groups from rationing.", "The Washington Post reported that AARP \"decried age cutoffs for ventilator access in some plans.\"", "On April 24, AARP sent a letter to the director of the civil rights office at the Department of Health and Human Services.", "\"It is imperative that those entrusted with deciding who gets access to healthcare do not discriminate,\" the letter said. \"Using age or disability status to categorically exclude people from accessing treatment violates existing federal law and we join you in strongly opposing such discrimination.\"", "Biden, who was elected president at age 77, did form a coronavirus advisory board that includes Dr. Atul Gawande, a senior adviser in Health and Human Services during the Clinton administration, Michael Osterholm, an epidemiologist who was an adviser to the agency’s secretary and Ezekiel Emanuel, an Obama administration health policy advisor who in 2014 wrote an essay about reducing medical interventions by choice in old age. But the purpose of the board is to prevent COVID-19 spread, particularly among those most at risk, including the eldery. There is no evidence it advocates the notion that life after 75 isn’t worth living.", "Our ruling", "A post on Facebook claims that \"AARP endorsed Biden\" and \"says if you are past 75 you should just die and go away.\" AARP didn’t endorse Biden, or anyone. And the organization, which represents millions of Americans age 50 and older, has aggressively lobbied against any health care policies that would discriminate against aging populations.", "We rate these claims about AARP Pants on Fire!", "Facebook post, Nov. 13, 2020", "AARP, AARP statement against rationing in the distribution of and access to health care, March 31, 2020", "Wall Street Journal, Rationing plants in coronavirus crisis draw growing discrmination complaints, April 9, 2020", "The Washington Post, Who gets a shot at life if hospitals run short of ventilators, April 7, 2020", "AARP letter to HHS, April 24, 2020", "The Associated Press, Biden targets virus as White House transition begins, Nov. 9, 2020", "The Atlantic, Why I hope to die at 75, October 2014", "Yahoo, Biden raises eyebrows by naming doctor who ‘hopes to die at 75’ to his COVID-19 task force, Nov. 9, 2020", "PolitiFact, AARP didn’t endorse Biden, donate to Planned Parenthood, Oct. 6, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]