["The doctored image was published here in a Facebook post on April 10, 2019, by a page with more than 36,000 followers.", "It has since been shared more than 5,000 times. The caption alongside the post in English says: “Hail Lord Rama #Vote4Bjp #NamoAgain.”", "“Lord Rama” is a reference to the Hindu deity in the ancient Hindu epic Ramayana. This is an article about Rama on the Britannica Encyclopedia website.", "NaMo is an acronym of the name of India’s Prime Minister Narendra Modi. This is a website created by Modi’s supporters which is called Nation with NaMo.", "Below is a screenshot of the misleading Facebook post:", "The Hindi-language writing on the photo translates to English as: “Push the lotus icon and be a contributor in the country’s development.”", "The BJP uses the image of the lotus flower as its logo. Here is the logo on the BJP’s official website.", "India’s election started on April 11. Here is an AFP report published on April about the polls.", "The doctored image was also shared on Facebook here and on Twitter here with a similar claim.", "A reverse image search on Google found the photo has been doctored from an original image taken in Mumbai by the Press Trust of India news agency on November 30, 2018.", "This report by Indian news channel News18 carried the photo on December 3, 2018.", "Below is a screenshot of the photo in the report:", "The English caption states: “Celebrity couple Deepika Padukone and Ranbeer Singh pose for photos on their visit to Siddhivinayak Temple, in Mumbai on November 20, 2018.”", "Indian news television channel News18 Malayalam published the same photo on its website here.", "Mumbai-based photographer Viral Vayani also posted this video the couple during their visit to the temple on his official Instagram page on November 30, 2018, which shows them wearing plain orange scarfs.", "And after the puja they posed again #ranveersingh #deepikapadukone #DeepVeerKiShaadi @viralbhayani", "A post shared by  Viral Bhayani (@viralbhayani) on Nov 29, 2018 at 11:42pm PST\\", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]