["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "• A Getty Images photo of two people selling Trump sweatshirts outside the U.S. Capitol on Jan. 6 is an actual photo from the agency.", "• The accompanying caption that says the vendors are named “Nah” and “Stop asking me questions before you get your a-- kicked” is fabricated.", "• The fabricated caption is from a story labeled “fake news” that acknowledges that the caption on that image and others in the story are not real.", "Many shocking images surfaced from the U.S. Capitol riot on Jan. 6, but one viral photo of vendors selling Trump merchandise was eye-catching for its caption rather than its content.", "An Instagram post includes a photo of two people selling Trump sweatshirts, and the photo caption says, \"Vendors who would identify themselves only as ‘Nah’ and ‘Stop asking me questions before you get your a-- kicked’ sell merchandise near the Capitol. ‘I ain’t into any of this shit,’ said Nah. ‘But these stupid motherf---ers buying $100 sweatshirts are putting me through college.’\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The photo is real, but the caption is not.", "The Instagram post indicates that the photo was taken by Jon Cherry, which is accurate. Cherry is a freelance photographer who took the photo for Getty Images.", "But the caption included with the photo on Getty Images’ website does not match the Instagram post caption, and does not name the people pictured.", "The Getty Images caption reads: \"Street vendors selling President Donald Trump memorabilia are seen on the sidewalk near the U.S. Capitol Building on January 6, 2021 in Washington, DC. A pro-Trump mob stormed the Capitol, breaking windows and clashing with police officers. Trump supporters gathered in the nation's capital today to protest the ratification of President-elect Joe Biden's Electoral College victory over President Trump in the 2020 election.\"", "The fabricated caption appears to have come from a story on Medium.com that is labeled \"fake news.\" The headline says its writers \"added some details to Getty Photos.\" And the story says, \"most of the captions that come with those photos are minimally descriptive.\"", "The Medium.com story makes it clear that the captions are not real: \"Are these really their names and circumstances? Nope — but that’s not going to stop us from thinking they are!\"", "The story was written by unnamed editors from Level, a publication on the Medium platform that is aimed at Black and Brown men and \"offers the best commentary on race, identity and culture for men of color.\"", "A Getty Images photo of vendors selling merchandise outside the U.S. Capitol on Jan. 6 appeared on Instagram with a caption that says, \"Vendors who would identify themselves only as ‘Nah’ and ‘Stop asking me questions before you get your a-- kicked’ sell merchandise near the Capitol. ‘I ain’t into any of this shit,’ said Nah. ‘But these stupid motherf---ers buying $100 sweatshirts are putting me through college.’\"", "The Instagram caption is fabricated. The photo’s original caption, which does not name the people pictured, is available on Getty Images’ website. The false caption came from a story labeled \"fake news\" that said the information was not real.", "We rate this claim Pants on Fire.", "Instagram post, Jan. 13, 2021", "Getty Images photograph, Jan. 6, 2021", "Level.medium.com, \"About Level,\" accessed Jan. 18, 2021", "Medium.com, \"We Added Some Details to Getty Photos of Those Terrorists Who Stormed the U.S. Capitol,\" Jan. 8, 2021", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]