["Sanders voted in favor of sanctions against Russia in 2017 as an amendment to a larger bill. But Sanders voted against the final legislation.", "Sanders supported an expansion of the Magnitsky Act, which imposed visa bans and asset freezes on Russian officials.", "Sanders missed a vote related to sanctions on companies linked to Oleg Deripaska, a Russian billionaire with ties to Russian President Vladimir Putin.", "From honeymooning in the Soviet Union in 1988 to getting love from Russia for his presidential bids, Bernie Sanders has an uncommon connection with one of America’s chief adversaries.", "It’s subjected the Vermont senator to a number of attacks.", "On Feb. 22, 2020, the day Sanders won the Nevada caucuses and arguably established himself as the frontrunner for the Democratic presidential nomination, a post claimed:", "\"Not once in his entire career in Washington, D.C., which started way back in 1991, has Democratic Socialist Bernie Sanders ever voted yes on sanctions against Russia.\"", "Sanders has run as an independent in Vermont, was a member of the U.S. House from 1991 to 2007, and has since been a member of the Senate. He calls himself a democratic socialist.", "There aren’t many votes to look at when it comes to Russia, and Sanders’ voting history isn’t as clear-cut as the post claims.", "In recent years, the United States sanctioned Russia in response to allegations of corruption and human rights abuses. It continued sanctions after Russia’s invasion of Ukraine.", "Some of the sanctions were imposed by presidential executive order, without any vote in the Senate.", "Here are the key votes:", "Dec. 6, 2012: Sanders voted no on the Magnitsky Act, which imposed visa bans and asset freezes on Russian officials linked to the 2009 death in prison of Sergei Magnitsky, a 37-year-old Russian whistleblower.", "GQ reported on Feb. 23, 2020, that Sanders never explained his vote, but \"fellow Dems suggest that it was because a free trade provision had been tucked into the legislative package.\"", "Sanders’ campaign emphasized to us that in 2015, the Senate with unanimous consent extended the law to countries other than Russia, and said it was \"more robust\" than the original law.", "June 14 and 15, 2017: Sanders votes yes on an amendment to a bill, adding Russia to a bill that was sanctioning Iran.", "But the next day, Sanders voted no on the overall legislation, which put new sanctions on North Korea, as well as Russia and Iran.", "On Russia, the bill targeted the country’s aggression in Ukraine and Syria, citing corruption, human rights abuses and weapons sales.", "Sanders said at the time he feared the bill would endanger the 2015 nuclear deal, which was aimed at curbing Iran’s ability to develop a nuclear weapon. \"I am strongly supportive of the sanctions on Russia included in this bill. It is unacceptable for Russia to interfere in our elections here in the United States, or anywhere around the world. There must be consequences for such actions,\" he said in a statement at the time.", "Jan. 16, 2019: The Senate failed to stop the Trump administration from easing sanctions on companies linked to Oleg Deripaska, a Russian billionaire with ties to Russian President Vladimir Putin.", "Sanders missed the vote, but his absence did not affect the outcome. He was meeting with women who accused his 2016 presidential campaign of sexual misconduct.", "A post claims: \"Not once in his entire career in Washington, D.C., which started way back in 1991, has Democratic Socialist Bernie Sanders ever voted yes on sanctions against Russia.\"", "Sanders voted once, in 2017, to add Russia to a sanctions bill. But on the final version of that bill, which carried sanctions against Russia, North Korea and Iran, he voted no. Moreover, he voted no on a Russia sanctions bill in 2012.", "The statement is partially accurate. We rate it Half True.", "Twitter,  tweet, Feb. 22, 2020", "Email, Bernie Sanders campaign regional press secretary Kolby Lee, Feb. 24, 2020", "The Nation, \"Bernie Sanders Is a Russian Agent, and Other Things I Learned This Week,\" June 16, 2017", "PolitiFact, \"Was Bernie Sanders fine with Russian annexation of Crimea? No,\" July 11, 2018", "U.S. Sen. Bernie Sanders, \"Sanctions on Russia,\" March 17, 2014", "Politico, \"Senate strikes bipartisan deal to boost Russia sanctions,\" June 12, 2017", "GQ, \"Why Exactly Does Putin Love Bernie?\" Feb. 23, 2020", "Reuters, \"U.S. Congress votes to apply Magnitsky human rights act globally,\" Dec. 8, 2016", "CNBC, \"Senate Democrats fail to stop Trump administration from lifting sanctions on firms linked to Putin friend,\" Jan. 16, 2019", "Congress.gov, \"S.284 - Global Magnitsky Human Rights Accountability Act,\" accessed Feb. 23, 2020", "U.S. Senate, \"On Passage of the Bill (H. R. 6156 ),\" accessed Feb. 23, 2020", "U.S. Senate, \"On the Amendment (Crapo Amdt. No. 232 As Modified),\" June 14, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]