["About this rating", "Just days before the 2020 U.S. presidential election, Twitter users began circulating a claim that residents of Queens Village, in the New York borough of Queens, were receiving ballots that had been already filled out for Democratic presidential nominee Joe Biden and other Democratic candidates.  The rumor appears to have originated with a video shared by freelance journalist Jake Novak:", "Novak said the absentee ballot shown in his video, which was marked for every Democratic candidate, must have been marked using a stamper or a machine, because “No human being could be that perfect with filling in all the blanks”:", "But, it turned out, the ballot hadn't been \"pre-filled\" at all.  As elections officials confirmed, it had been sent to the appropriate absentee voter in California, who indeed filled it in himself.  However, that voter mistakenly used the wrong envelope when he placed his ballot in the mail, thereby sending it to his previous address in Queens rather than returning it to elections officials:", "After reviewing the ballot shown in the video, election officials contacted the voter in California who had requested the absentee ballot. The voter confirmed they had received and completed the ballot and then returned it. But the voter used the wrong envelope and rather than the ballot going to the board of elections, it was sent back to the voter’s previously listed address in Queens.", "The New York City Board of Elections (NYCBOE) confirmed in a tweet that \"Actually, it looks like [the ballot] was filled out by hand, and we have previously stated, we have have not received any reports of this happening!\":", "NYCBOE also tweeted to say that it was \"the height of irresponsibility to continue to make these false claims\":", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]