["The USDA released a proposed rule that would make it harder for states to waive work requirements for able-bodied adults without dependents.", "The rule change was set to take effect on April 1, 2020. The change was expected to cut off basic food assistance for nearly 700,000 people. However, a coalition of states filed a court case to challenge the rule change.", "A federal judge issued an injunction on March 13, 2020.", "The Trump administration has filed an appeal of that injunction.", "Congress and the Trump administration have approved about $3 trillion in coronavirus relief in four separate measures over the last two months, including extra unemployment benefits, aid to hospitals and loans aimed at small businesses.", "So, this May 15, 2020 tweet from U.S. Sen. Tammy Baldwin, D-Wisconsin, caught our attention:", "\"The Trump Administration is trying to take food assistance away from Wisconsin families when people are out of work and struggling.\"", "Is she right?", "When asked to back up the claim, a Baldwin staffer pointed PolitiFact Wisconsin to a lawsuit involving the U.S. Department of Agriculture, which administers the nation’s food assistance programs, including SNAP, the Supplemental Nutrition Assistance Program.", "The USDA released a proposed rule Feb. 1, 2019, that would make it harder for states to waive work requirements for able-bodied adults without dependents. In March of that year, 47 Republican and Democratic Senators urged the Administration to withdraw the rule. But on Dec. 4, 2019, the Administration released the final rule.", "The rule change was set to take effect April 1, 2020. Prior to the economic damage caused by the COVID-19 pandemic, the rule was expected to cut off basic food assistance for nearly 700,000 people. However, a coalition of states filed a lawsuit to challenge the rule change.", "A federal judge issued an injunction March 13, 2020, to temporarily block implementation of the rule change.", "\"As a global pandemic poses widespread health risks, guaranteeing that government officials at both the federal and state levels have flexibility to address the nutritional needs of residents and ensure their well-being through programs like SNAP, is essential,\" Chief Judge Beryl Howell of the U.S. District Court in Washington, D.C., wrote in her March 13, 2020 opinion.", "So that puts things on hold.", "And the Families First Coronavirus Response Act -- one of the measures passed by Congress amid the pandemic -- waived the work requirement for able-bodied adults without dependents for the duration of the COVID-19 public health emergency.", "So, how is Trump trying to \"take food assistance away from Wisconsin families\"?", "The view from Baldwin’s staff: \"The USDA is continuing to defend the rule change and filed a notice earlier this month that it is appealing the temporary injunction to the U.S. Court of Appeals for the D.C. Circuit.\"", "In a May 13, 2020 article from  TIME magazine, U.S. Rep. Marcia Fudge, D-Ohio, chair of the House Agriculture Subcommittee on Nutrition, Oversight and Department Operations, labeled the USDA’s effort to continue the case a \"cruel pursuit of unrealistic policy.\"", "So, while the lawsuit is on hold and work requirements are temporarily suspended, the administration is continuing to pursue the case. If ultimately successful, the change could then remove nearly 700,000 people from the SNAP program.", "The USDA pointed PolitiFact Wisconsin to an April 22, 2020 news release from the agency that noted there had been a 40% increase in monthly SNAP benefits amid the pandemic.", "\"Ensuring all households receive the maximum allowable SNAP benefit is an important part of President Trump’s whole of America response to the coronavirus,\" U.S. Secretary of Agriculture Sonny Perdue said in the statement.", "The agency cited other food assistance initiatives, including distribution of millions of pounds of food in response to the COVID-19 crisis. The agency did not address the rule change in its email to PolitiFact Wisconsin, but in a May 13, 2020 Reuters article, the agency said it has been \"extremely aggressive\" to ensure food needs are met during the pandemic.", "\"While we’re currently in a very challenging environment, we do not expect this to last forever,\" the agency said, adding \"we must prepare our workforce to rejoin the economy when our nation reopens.\"", "So, in effect, the administration is doubling down on its position as it relates to the lawsuit.", "Baldwin said \"the Trump Administration is trying to take food assistance away from Wisconsin families when people are out of work and struggling.\"", "Congress and the Trump administration have launched various assistance initiatives during the pandemic. And one measure specifically lifted a work-related requirement.", "However, at the same time, the administration doubled down on its support of a proposed SNAP rule change that would in effect cut off basic food assistance for nearly 700,000 people -- once an emergency is lifted, and if the agency successfully fends off a lawsuit.", "We rate the claim Half True.", "Twitter, Sen. Tammy Baldwin, May 15, 2020", "Email, Office of Sen. Tammy Baldwin, May 19, 2020", "Facebook group Wisconsin Unemployment Support Group", "Milwaukee Journal Sentinel \"I’m at a frustrating standstill’: Delays in unemployment claims leave some jobless Wisconsinites without money for food, bills,\" May 8, 2020", "United States Department of Agriculture, SNAP, the Supplemental Nutrition Assistance Program.", "United States Senate Committee on Agriculture, Nutrition & Forestry \"Bipartisan Group of 47 Senators Urges Trump Administration to Withdraw Proposed SNAP Rule,\" March 28, 2019", "United States Senate Committee on Agriculture, Nutrition & Forestry, \"Ranking Member Stabenow: Trump Administration’s Final SNAP Rule Targets Part-Time Workers, Ignores Bipartisan Agreement,\" Dec. 4, 2019.", "Reuters \"Trump’s USDA fights court ruling protecting food benefits during pandemic,\" May 13, 2020.", "United States Department of Agriculture, news release, \"USDA Increases Monthly SNAP Benefits by 40%\" April 22, 2020.", "Wisconsin Department of Health Services \"Over 215,000 Wisconsin households to receive additional Foodshare benefits in response to COVID-19 pandemic,\" April 10, 2020.", "TIME magazine \"With Millions Out of Work, the Trump Administration Pushes to Limit Food Stamps,\" May 13, 2020.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]