["About this rating", "Microwave ovens are a favorite bugaboo of the natural health set, and claims that they were once banned in various countries, including the Soviet Union, are repeated uncritically on numerous natural health websites espousing their purported dangers. For example, a 24 August 2016 article published on the conspiracy-obsessed website Natural News stated:", "The electromagnetic field (EMF) produced by common household microwaves is something Russia has taken seriously in the past. After conducting thorough research into the health effects of microwave EMFs, Russia determined in 1976 that microwaves were dangerous to their people. In that year, Russia banned the devices to protect their citizenry.", "Most (but not all) websites ambiguously state that the ban was lifted sometime during or before perestroika, in an effort to warm relations between the two countries. From a purely historical standpoint, this is a dubious narrative at best.", "However, there is some historical precedent for the purported relationship between microwaves and the Soviet Union. For at least fifteen years prior to 1976, the Soviets had literally been beaming microwave radiation at the American embassy in Moscow in an effort (by their own account) to prevent the United States from electronically eavesdropping — a fact made public that year, in a 28 February 1976 New York Times report:", "At least the main outlines of what might be called the Case of the Moscow Microwaves have finally emerged. For at least fifteen years the United States Embassy in Moscow has been systematically irradiated by microwaves generated in equipment installed nearby by Soviet intelligence agencies. The objectives of this bombardment presumably were to eavesdrop on conversations in the embassy and to attempt jamming of electronic monitoring equipment installed in and on the embassy. The United States State Department knew about this irradiation and protested from time to time, but the facts were kept secret from both the American public and most of the people in the embassy complex.", "This public acknowledgement spurred American research into the biological effects of low dose microwave radiation, and later led to an agreement between the Soviets and Americans to reduce the amount of microwave radiation to which the the embassy was exposed. Coverage of this event brought American concerns about microwave radiation to the forefront for the first time, spawning myriad articles and discussions at the time about a lack of research regarding its safety.", "The notion that a Russian ban on microwaves would go unreported in major United States newspapers during a time that the Soviets were downplaying the risk of their own intentionally beamed microwave radiation is unlikely, given the perceived hypocrisy it would have engendered. Further, there were in fact a number of different microwaves available in the USSR during this supposed ban. Though they were unaffordable to the average Russian at the time — the first Soviet manufactured microwaves hit the scene in the 1970s. According to an article in the 16 August 2016 issue of Russia's version of Popular Mechanics about this very myth, at least twenty-three different models were manufactured during this time period.", "This one, from 1981 (smack dab in the time period of the purported ban), is described by that article’s author as “famous”:", "The origin of this myth, however, lies over 5000 miles away from Moscow in America’s Pacific Northwest — Portland, Oregon. Every claim made regarding a Russian ban on microwaves stems from an article published in the first (and as far as we can tell, the only) issue of a mysterious publication called the “Journal of Natural Science.\"", "While the article from the “April-June 1998 issue\" lists myriad claims about the dangers of microwave radiation, it is published without a single citation. That article also incorrectly asserts that the Nazis invented the microwave oven, and both the Soviets and Americans got their hands on the details after the war for further research:", "These documents and the experimental microwave equipment was transferred to the U.S. War Department, and classified for reference and scientific investigation. The Soviet Union also retrieved some of the devices, and proceeded to undertake experimentation on a separate basis.", "The Russians have been the most diligent in their research on the biological effects of microwave ovens, and have outlawed their use, and have also issued an international warning concerning the possible biological and environmental damage that can be caused by the use of this similar-frequency electronic apparatus.", "The author of this article is listed as “William P. Kopp,\" whose biography is included at the end of the article:", "The original of this forensic research document is to be found in the Archives of the Atlantis Rising Educational Center in Portland, Oregon. The author William Kopp worked there from 1977 to 1979. Already twenty years ago Kopp gathered all documents known so far concerning the scientific proofs about microwaves' harmful effects on humans. By doing this he got in the way of a powerful lobby and was forced later on to even change his name and to disappear.", "While it is hard to verify the authenticity of an unsourced document written by someone who claims to have changed his name to disappear from the dangerous microwave lobby, it is possible to ascertain what (at least in the late 1970s) the “Atlantis Rising Educational Center” was all about. Based on a classified ad placed in a January 1979 issue of the magazine Yoga Journal, it appears that this center was an alternative health bookstore selling herbal supplements:", "The allegation of a Soviet ban on microwave ovens may well have stayed within the walls of the Atlantis Rising Educational Center if not for the misleading promotion of this remarkably questionable document. Perhaps most notably, the claim was repeated by the natural health evangelist Joseph Mercola who parroted the claim almost word for word on his web site, citing this Atlantis Rising “study”:", "The Nazis are credited with inventing the first microwave-cooking device to provide mobile food support to their troops during their invasion of the Soviet Union in World War II. These first microwave ovens were experimental. After the war, the US War Department was assigned the task of researching the safety of microwave ovens. But it was the Russians who really took the bull by the horns.", "After the war, the Russians had retrieved some of these microwave ovens and conducted thorough research on their biological effects. Alarmed by what they learned, the Russians banned microwave ovens in 1976, later lifting the ban during Perestroika.", "The text from his website (which has a significant readership) has been repeated all over the web as fact, despite the truth that no such ban ever took place, and despite the fact that the claim stems from a possibly non-existent man with no apparent scientific credentials who may or may not have worked at the Atlantis Rising Educational Center in the late 1970s.", "Devon, L.J. “Years ago Russia researched the biological effects of microwave ovens... then banned them” Naturalnews.com. 24 August 2016.", "Devon, L.J. “Years ago Russia researched the biological effects of microwave ovens... then banned them” Naturalnews.com. 24 August 2016.", "Mercola, Joseph. “Why Did the Russians Ban an Appliance Found in 90% of American Homes?” Mercola.com. 18 May 2010.", "Mercola, Joseph. “Why Did the Russians Ban an Appliance Found in 90% of American Homes?” Mercola.com. 18 May 2010.", "New York Times. “Moscow Microwaves” 28 February 1976.", "New York Times. “Moscow Microwaves” 28 February 1976.", "Steinmann, Marion. “Waves of the Future?”. New York Times. 7 November 1976.", "Steinmann, Marion. “Waves of the Future?”. New York Times. 7 November 1976.", "Gwertzman, Bernard. “Soviet Dims Beam At U.S. Embassy” New York Times. 8 July 1976.", "Gwertzman, Bernard. “Soviet Dims Beam At U.S. Embassy” New York Times. 8 July 1976.", "Popmech.ru “Made in the USSR: the microwave”. 16 August 2016.", "Popmech.ru “Made in the USSR: the microwave”. 16 August 2016.", "Osepchuk, John M. “The history of the microwave oven: A critical review” Microwave Symposium Digest, 2009. MTT '09. IEEE MTT-S International.", "Osepchuk, John M. “The history of the microwave oven: A critical review” Microwave Symposium Digest, 2009. MTT '09. IEEE MTT-S International.", "Yoga Journal. “Publications” Jan 1979.", "Yoga Journal. “Publications” Jan 1979.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]