["About this rating", "In May 2016, well-meaning tourists at Yellowstone National Park put a bison calf into their car and drove it to a ranger station because they thought that the animal was cold. A few days later, park rangers had to euthanize the calf after it was repeatedly rejected by its herd:", "While the tourists may have had good intentions, their actions ultimately led to the bison's death:", "Last week in Yellowstone National Park, visitors were cited for placing a newborn bison calf in their vehicle and transporting it to a park facility because of their misplaced concern for the animal's welfare. In terms of human safety, this was a dangerous activity because adult animals are very protective of their young and will act aggressively to defend them. In addition, interference by people can cause mothers to reject their offspring. In this case, park rangers tried repeatedly to reunite the newborn bison calf with the herd. These efforts failed. The bison calf was later euthanized because it was abandoned and causing a dangerous situation by continually approaching people and cars along the roadway.", "Yellowstone explained the decision to euthanize the bison calf on their social media account:", "In order to ship the calf out of the park, it would have had to go through months of quarantine to be monitored for brucellosis. No approved quarantine facilities exist at this time, and we don't have the capacity to care for a calf that's too young to forage on its own. Nor is it the mission of the National Park Service to rescue animals: our goal is to maintain the ecological processes of Yellowstone. Even though humans were involved in this case, it is not uncommon for bison, especially young mothers, to lose or abandon their calves. Those animals typically die of starvation or predation ...", "The management of wild animals sometimes requires decisions that may seem harsh if you focus on an individual. But when you focus on populations of animals, and the ecological processes that sustain them, things like a bison losing or abandoning a calf is part of the fabric this ecosystem. It's unfortunate that these visitors intervened: the calf may have been found by its mother, but it's also likely that the calf would have died naturally of starvation or predation.", "While the park stopped short of blaming the tourists (and didn't clarify whether the calf had already been ill or abandoned by its herd before it was placed in a car), the National Park Service also called on visitors to follow the rules in order to ensure the safety of both humans and wildlife:", "Approaching wild animals can drastically affect their well-being and, in this case, their survival. Park regulations require that you stay at least 25 yards (23 m) away from all wildlife (including bison, elk and deer) and at least 100 yards (91 m) away from bears and wolves. Disregarding these regulations can result in fines, injury, and even death. The safety of these animals, as well as human safety, depends on everyone using good judgment and following these simple rules.", "The tourist who put the calf in his SUV was later cited for violating those rules.", "Watts, Amanda.   \"Baby Bison Euthanized After 'Misguided' Rescue Attempt.\"\r\n    CNN.   17 May 2016.", "Warthin, Morgan.    \"National Park Service Calls on Visitors to Respect Wildlife and Safety Regulations.\"\r\n    National Park Service.   16 May 2016.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]