["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Residents of Paul Ryan's congressional district in southeast Wisconsin speak at a \"town hall\" meeting organized by the group Forward Kenosha. Ryan did not attend the event. (Mike De Sisti)", "One of House Speaker Paul Ryan’s 2018 challengers has risen to prominence with a flurry of media interviews, a viral campaign launch video and a quick influx of small-dollar donations.", "In one of those interviews, Democrat Randy Bryce claimed Ryan, a Republican from Janesville, doesn’t face his constituents.", "Bryce, an ironworker, appeared July 9, 2017, on WISN-TV’s \"Upfront with Mike Gousha,\" where he claimed \"Paul Ryan has not had a public town hall within the district for over 600 days.\"", "With Republicans facing feisty constituents at town hall meetings across the country, has Ryan really not held such a meeting in more than 600 days?", "What makes a town hall?", "Just what is a town hall meeting? The answer in the digital age can vary.", "A look through Ryan’s U.S. House website indicates that the last public, in-person town hall meeting he held was on Oct. 6, 2015, shortly before he was elected Speaker of the U.S. House of Representatives.", "Thus, Ryan has gone more than 650 days without holding a similar town hall meeting.", "That’s where the different definitions come in.", "David Keith, a spokesman for Bryce, cited a reference.com Q&A that defines a town hall as an informal, in-person meeting between citizens and public figures.", "\"Many modern town halls are held in locations that are accessible to the public and can accommodate large crowds,\" the site reads.", "Historically, town halls are in-person, informal events where people can ask public officials unscripted questions. The Merriam-Webster and Oxford dictionaries’ definitions and usage examples both have a physical connotation.", "In recent years, Ryan has opted for office hours, telephone town halls and employee town halls -- those done at workplaces.", "Indeed, the information cited by Bryce from reference.com relies in part on the nonpartisan Congress Management Foundation, which has been looking into the effects of in-person, online and telephone town halls. The foundation conducts research into the evolving methods to host town halls and their comparative effectiveness.", "Ryan spokesman Ian Martorana said the speaker considers telephone and employee town halls to be forms of public town hall meetings and said telephone town halls make up a significant portion of Ryan’s interactions with constituents.", "Martorana said they conduct telephone town halls by calling \"every household with a registered voter in the pertinent counties whose contact information we have and who reside in Wisconsin's First District.\"", "He added: \"The calls are not screened, and they are answered in the order they are received.\"", "Employee town halls are another matter.", "These are typically hosted by private businesses where the audience is usually pre-selected, and so are their questions. The public is largely barred from these events, and reporters are usually unable to ask questions.", "Ryan recently held two employee town halls while Congress was on break for the Fourth of July holiday, visiting businesses in Oak Creek and Racine. Audience members offered Ryan a series of friendly questions.", "\"If you had to make a decision between attending an October regular season Packers game or a Brewers World Series game, which one?\" one person asked, according to a CBS news article.", "The day after he visited those businesses, Ryan took questions from reporters at the state Capitol where he said he was looking for \"creative ways\" to interact with constituents, instead of traditional town hall meetings.", "Ryan also said he was thinking of safety, trying to avoid a \"screaming fest\" from protesters bused into his district and that having reporters at events limits the conversation.", "\"I find when you guys are there, people tend to clam up,\" Ryan told reporters on July 7, 2017.", "Ryan did hold a number of campaign events the day before his 2016 primary election that he billed as town halls -- though they did not match the framework of his last in-person listening session. Reports and a video from the event indicate that it was much more in keeping with the employee town halls meetings.", "And as campaign events, they had a different purpose than a traditional town hall.", "Past criticism", "Ryan has been criticized in the past for not being accessible to his constituents.", "In February 2017, the left-leaning group Forward Kenosha organized a mock town hall at a union hall where constituents posed questions to an empty chair. In May, U.S. Rep. Mark Pocan (D-Madison) held a town hall in Ryan’s district.", "Martorana said Ryan’s office has issued 60,000 responses this year to constituents who have contacted the office by phone, email, fax or letter. He added that recent telephone town halls reached more than 13,000 constituents in Walworth, Rock, Kenosha and Racine counties.", "In contrast, U.S. Rep. Jim Sensenbrenner ( R-Wis.), the dean of the state’s congressional delegation, has not shied away from open town halls, sometimes facing raucous crowds. Sensenbrenner has held more than 80 public town halls so far in 2017, according to the calendar on his website.", "Our rating", "Bryce said \"Paul Ryan has not had a public town hall within the district for over 600 days.\"", "Bryce’s claim is broad and doesn’t account for the emerging ways people can communicate with public officials, but he’s mostly on target in saying Ryan hasn’t held a traditional town hall in almost two years.", "We rate his claim Mostly True.", "TV news segment, \"Bryce: Campaign launch reaction surprising\", Upfront with Mike Gousha, WISN 12, July 8, 2017", "Press release archive, \"Paul Ryan’s U.S. House website\".", "Press release, \"RECAP: RYAN HEARS FROM WISCONSINITES AT EIGHT LISTENING SESSION\", Paul Ryan’s website, Oct. 6, 2015.", "Foundation website, \"21st Century Town Hall Meetings,\" Congressional Management Foundation.", "Dictionary definition, \"Town hall,\" Merriam-Webster Dictionary.", "Dictionary definition, \"Town hall,\" Oxford Dictionary.", "News article, \"Speaker Paul Ryan calls North Korea 'No. 1' foreign policy concern,\" Milwaukee Journal Sentinel, July 6, 2017.", "News article, \"Questions linger even after Paul Ryan holds town hall meeting,\" CBS Evening News, July 6, 2017.", "News article, \"House Speaker Paul Ryan met with Foxconn as Wisconsin tries to lure tech firm\" Milwaukee Journal Sentinel, July 7, 2017.", "Tweets, \"Tweets from CNN reporter Deirdre Walsh,\" CNN, Aug. 8, 2016.", "Facebook Live, \"Paul Ryan campaigns for his congressional seat,\" CNN Politics, Aug. 8, 2016.", "News article, \"Hundreds of Speaker Paul Ryan's constituents held a town hall meeting without him,\" Milwaukee Journal Sentinel, Feb. 26, 2017.", "News article, \"Democrat Mark Pocan takes debate into Republican Paul Ryan's district,\" Milwaukee Journal Sentinel, May 10, 2017.", "News article, \"Democrat and iron worker Randy Bryce challenges Paul Ryan for Congress,\" Milwaukee Journal Sentinel, June 19, 2017.", "Calendar, \"Jim Sensenbrenner’s town hall calendar,\" Jim Sensenbrenner’s website.", "News article, \"Jim Sensenbrenner holds feisty town hall,\" Milwaukee Journal Sentinel, March 4, 2017.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]