["This 16-second video has been viewed nearly two million times since it was posted to Twitter on December 10, 2019.", "The caption of the post states: \"Now I have a machine gun. Ho Ho Ho. Not sure Greta's lefty friends will be pleased though\".", "Greta Thunberg is a 16-year-old climate activist from Sweden.", "Below is a screenshot of the misleading tweet:", "The video was also shared here, here, here, here, here and here on Twitter with a similar English-language claim.", "The clip was also circulating on social media alongside similar claims written in other languages, such as here in Spanish on YouTube, and here in Portuguese on Facebook.", "Sao Paulo-based politician Leticia Aguiar also shared a similar claim on Twitter here: “Even the brat Greta Thunberg shoots.” The tweet has since been deleted.", "However, the claim is false; the woman shooting a rifle in the video is not Greta Thunberg.", "A Google reverse image search with video keyframes extracted with InVID, a digital verification tool, found a slightly longer version of the video posted here by Twitter user Emmy (@eslinge) on December 8, 2019.", "The 18-second video was captioned: \"So anyway, I started blasting\".", "A second video posted in the same Twitter thread on the same day was filmed from a different angle, showing a woman in a very similar outfit.", "Below are two screenshots of Emmy’s videos:", "In a message to Estadão, a Brazilian newspaper working in collaboration with AFP, Emmy confirmed she is the woman in the video.", "Emmy, who asked that her last name not be published, also said the videos were made during a training session and that she was amused by the misidentifications.", "\"Apparently we are similar but I am 15 years older,\" she said. “I hope people don't really think that I am her. I don't want to cause Greta any harm, I think she's great.\"", "On LinkedIn, Emmy is listed as an engineer working for a company in Stockholm, Sweden.", "In a follow-up tweet to the videos, Emmy wrote: \"People on twitter: 'You look like Greta'\n\tMe: No I do NOT!!!!\"", "She also re-tweeted fact-check reports about her videos, for instance here and here, and joked about becoming a meme in Brazil here.", "The rifle seen in the video in the misleading posts was shown in older photos tweeted by Emmy, such as here on November 16 and here on November 21.", "The November 21 tweet shows the same rifle placed between a cat and a book titled \"How to talk to your cat about gun safety\".", "The Swedish-language caption of the post, which is pinned at the top of her Twitter account, translates to English as: \"I assumed responsibility as the owner of animals and weapons\".", "Tar mitt ansvar som djur- och vapenägare pic.twitter.com/5ud4ulyhpr", "-- Greta: again the centre of attention --", "On December 11, 2019, 16-year-old Thunberg was named TIME's \"Person of the Year\".", "The magazine wrote in a corresponding report here that Thunberg has \"succeeded in creating a global attitudinal shift, transforming millions of vague, middle-of-the-night anxieties into a worldwide movement calling for urgent change.\"", "US President Donald Trump questioned TIME's decision a day later in a December 12 tweet, which states: “So ridiculous. Greta must work on her Anger Management problem, then go to a good old fashioned movie with a friend! Chill Greta, Chill!”", "So ridiculous. Greta must work on her Anger Management problem, then go to a good old fashioned movie with a friend! Chill Greta, Chill! https://t.co/M8ZtS8okzE", "In response to Trump's tweet, the teen activist updated her Twitter biography to read: “A teenager working on her anger management problem. Currently chilling and watching a good old fashioned movie with a friend,\" the BBC reported here on December 12.", "Thunberg has changed her Twitter profile several times in the past to reflect criticism from world leaders, such as in September following Trump's sarcastic comments, and in December in response to Brazilian President Jair Bolsonaro's remarks of her being a \"pirralha\" -- a brat in Portuguese.", "After Thunberg changed her Twitter bio to “Pirralha”, the term quickly began trending on Twitter in Brazil.", "Thunberg has been the target of disinformation and the subject of many false claims around the world, as seen in these AFP fact-check reports.", "AFP's reporting on the misleading shooting video was conducted in collaboration with Estadão, a Brazilian newspaper, as part of the Comprova framework, the collective reporting project. It can be seen in Portuguese here and in Spanish here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]