["The photo was published here on Facebook on August 29, 2019, by a page with nearly 300,000 followers. It has been shared more than 600 times.", "Below is a screenshot of the Facebook post:", "Translated from traditional Chinese, the caption reads: “So far in the anti-extradition campaign, the pro-democracy mob, in the name of expressing their demands, has recklessly committed lots of violent and anti-social acts, and outrages. The mob has long viewed the rule of law as nothing. But the duty of the police is to maintain social stability, and they ought to strictly enforce the law in the face of the mob's illegal and violent deeds, otherwise Hong Kong would have long been on the verge of death, which will harm normal people in the end.", "“In fact, it is actually Hong Kong police officers that have been most endangered, fatigued and aggrieved over the past two months. We support them to strictly enforce the law.\"", "A text overlay on the photo, also written in traditional Chinese, says: “Police officers are now in the most dangerous, exhausting, and aggrieved situation.", "\"Netizens feeling heart-broken: You are not lonely. Add oil!”", "\"Add oil\" is a popular Chinese expression that has been widely used in Hong Kong during the recent protests. Here is the Oxford English Dictionary definition.", "Hong Kong has seen its four months of unrest with increasingly violent confrontations between pro-democracy protesters and police officers. Here is a recent AFP report on the issue.", "A group of blue shirt uniformed police officers can be seen at the bottom side of the photo, lying down or leaning against a wall, with a large gathering of people can be seen in the distance.", "The photo was also shared with similar claims on Weibo here by pro-Beijing Hong Kong politician Junius Ho, as well as here on Instagram and here on Twitter, alongside captions that also link the photo to recent protests.", "State media in China, for example CCTV, People’s Daily and Global Times, also posted the same photo either on their Weibo accounts or in news articles here, here and here, which all mention the work of police officers during the recent Hong Kong protests.", "The claim is misleading; the photo was taken not during recent protests in Hong Kong but five years earlier.", "The photo was originally taken by photographer Xaume Olleros for AFP on September 28, 2014. It can be seen in AFP’s archives here.", "Below is a screenshot of the photo on AFP Forum:", "Hong Kong saw several weeks of protests in 2014 anchored around calls for democratic reforms to the city’s governance, in a series of sit-ins and public demonstrations dubbed the “Umbrella Movement”.", "AFP wrote a retrospective account of the Umbrella Movement protests in this 2016 article.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]