["About this rating", "On 23 April 2017, the web site The Last Line of Defense published an article appearing to report that a search warrant had just been executed at the Washington, D.C.-area residence of President Barack Obama:", "Just after dawn in the quiet Tracy Street neighborhood of Washington, DC, the FBI and NSA served a warrant at the Obama’s post-presidential rental mansion. The house, fortified with 10-foot walls and guard stations for Secret Service officers, serves as Obama’s residence in Washington and allegedly as the headquarters for the deep State Shadow government.", "The warrant, which would have had to have been issued by a federal judge for federal agents to be involved, is for the search and seizure of any and all documents, hard drives or correspondence relating to national security not officially presented to the former president during his security briefings.", "Essentially, the FBI and NSA are alleging that there are shady dealings going on inside the house that has been the center of controversy since Paul Ryan, John McCain, Lindsey Graham and Dr. Ben Carson were all seen entering the house for secret meetings, presumably to take down President Trump.", "The appended image was not taken in a Washington, D.C. neighborhood. The area code in the location mentioned is typically 202; a visible trash can bears a number with an area code of 706 (west central Georgia) or 708 (northeast Illinois). A set of matching images appeared in a May 2016 Chicago Tribune tweet:", "FBI agents wounded serving arrest warrant to reputed high-ranking gang member in Park Forest https://t.co/m8ERSqLqjR pic.twitter.com/B4bUxF29d0", "— Chicago Tribune (@chicagotribune) May 24, 2016", "No matter where the photograph was taken, there is no truth to the story, as Last Line of Defense (The Resistance) bears the following disclaimer:", "The Resistance may include information from sources that may or may not be reliable and facts that don’t necessarily exist. All articles should be considered satirical and any and all quotes attributed to actual people complete and total baloney. Pictures that represent actual people should be considered altered and not in any way real.", "The Last Line of Defense has a long track record of publishing stories that take in readers who don't see its disclaimer. Previous hoaxes include stories that three \"liberal celebrities\" were arrested for conspiring to assassinate President Donald Trump, that George Soros was killed while visiting his home country, and that Hillary Clinton was appointed to replace a disgraced New York senator.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]