["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "The photo isn’t from Florida in the spring of coronavirus. It was taken in Brazil in 2013 during a visit from Pope Francis.", "After some Florida cities re-opened their beaches during the pandemic, images of Floridians strolling on the sand flooded the internet.", "Many of the photos are legitimate, but we can safely say this one is not. The image shows a packed beach with CNN’s logo at the bottom and the words \"Jacksonville Beach reopens.\"", "This is bogus. CNN didn’t air the image or claim that it depicts Jacksonville Beach in 2020. It also wasn’t taken recently, or in Florida.", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The photo was manipulated to include the CNN logo. A reverse-image search shows that the photo was taken in 2013, not 2020.", "Where, you ask? The mountains in the background should be the first red flag. There are no mountains in Florida.", "The image also isn’t even from the United States. It was captured on Copacabana beach in Rio de Janeiro, Brazil, on July 28, 2013, for a mass held by Pope Francis during a weeklong visit to the country. About 3 million people attended, according to news reports.", "Despite what recent posts on social media might say, the photo has nothing to do with CNN, Florida or beaches currently reopening in the U.S.", "We rate it Pants on Fire!", "Facebook post, April 19, 2020", "Tin Eye, Reverse-image search, April 22, 2020", "Getty Images, BRAZIL-POPE-WYD-FINAL MASS, July 28, 2013", "Boston Globe, Pope Francis draws 3 million in Rio de Janeiro, July 29, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]