["About this rating", "On 20 March 2018, the Facebook page \"News World\" shared a video which they claim shows \"Muslim immigrants\" attacking a Catholic church during mass in France:", "This video (which can be viewed below) does document a real event that took place in France in March 2018, giving a nod to at least some semblance of accuracy in this report. However, it stops there. The post contains no evidence that backs their conclusions about the protesters' religion or whether they were new arrivals to the country. Furthermore, the protesters did not \"attack\" a Catholic church, and mass was not in session during the incident as claimed:", "What the footage actually shows is an 18 March 2018 protest at the Basilica of Saint-Denis in France against a proposed bill that would make it more difficult for people to seek asylum in the country. According to a news report from Le Parisien, about eighty people went into the church with banners to protest the bill, and the demonstration (which remained nonviolent) ended after a little more than an hour, when the group was escorted out of the church by police.", "La Croix, an independent Catholic news outlet, explained that this group likely chose the Basilica of Saint-Denis as the location for this protest as the church has historically provided aid and services to refugees and asylum-seekers.  In 2002, for instance, they took in more than 130 refugees as they awaited processing. Since then the church has become symbolically connected to the refugee crisis.", "Although this viral video (which was viewed more than 1.2 million times within a day of its initial posting) does not show \"Muslim immigrants\" attacking a Catholic church in France as described, it predictably drew responses from far-right politicians known for spreading anti-immigrant disinformation, such as failed French presidential candidate Marine Le Pen, who tweeted that the immigrants had desecrated the church:", "However, members of the church appear to agree with protesters that the new bill would make life far more difficult for immigrants and those seeking refuge in France:", "\"The proposed law will make things even harder,\" stated Father Jean-Yves Leroy, Deacon of the Diocese of Saint-Denis.", "Le Parisien.   \"Saint-Denis : 80 Personnes Manifestent Dans La Basilique Pour Les Sans-Papiers.\"\r\n    18 March 2018.", "Tresca, Malo.   \"Pro-Migrant Protest in Paris Church Causes Controversy.\"\r\n    La Croix International.   21 March 2018.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]