["“*जबरन कब्जा करा रही पुलिस व भाजपा नेता रोकने पर दलित को जिन्दा जला दिया* बेटा बिलखता रहा बेशर्म हैवान” (“Police and BJP leader forcibly acquiring land, on being resisted they set ablaze a Dalit, son kept sobbing, shameless devils”- translation).", "The above message has been posted and shared on Twitter and Facebook, along with a horrific video showing a woman and a man in flames, as those present at the spot try to douse the fire. Owing to the extremely disturbing nature of the video, Alt News is not posting it. A screenshot of the same is presented below.", "The above tweet is of September 16. The video clip is 45 seconds long. The message along with it claims that a Dalit man was set on fire by the police and a BJP leader after he resisted forcible occupation of his land. The same text accompanies another video, which has been posted on Facebook, in which the man (seen ablaze in the video) is talking about his plight. This video was taken after the incident.", "The post, by an individual user, has been shared close to 8000 times since it was posted on September 5. In this video, the male victim says that he was beaten up daily by goons, and the police refused to take action. He further claims that those who have been attacking him are forcing him to evict his house. The victim identifies himself and the woman, also seen in the video. When asked what village he is from, he says “Sureer”.", "Alt News’s fact-check has found that the narrative accompanying the video is false. In the comments section of one of the tweets, one user commented that this incident is from Mathura, where a couple had tried to commit suicide.", "Based on this clue, Alt News searched Google with specific key words, and found several reports related to this incident.", "The incident is of August 23, 2019, from Mathura, UP, where a couple tried to commit suicide at a police station through self-immolation, reportedly over harassment faced at the hands of a local strongman and subsequent police apathy. According to a Hindustan Times report, “A couple attempted self immolation outside the Sureer Kotwali police station here on Wednesday allegedly due to cops’ inaction over a complaint they had filed against a local muscleman. The duo suffered severe burn injuries and were referred to the Safdarjung Hospital in Delhi.”", "The report further states, “Jogendra Singh, 40, and his wife Chandrawati reached the police station around 10 am and poured kerosene on themselves. They set themselves on fire before anybody could respond. Within minutes, both were lying on the ground with their bodies on fire. The people around, including cops, brought blankets and rescued the couple. They both were rushed to a hospital in Mathura.” ANI had also reported about the incident.", "Mathura police had put out a tweet on August 29. SSP Mathura had briefed the media regarding the incident, stating that the accused was arrested and interrogation was on. He added that a FIR has been filed against the policemen who were complicit in the case, and that the victims were sent to a hospital for treatment. In the latest development, both the victims have tragically succumbed to their burn injuries.", "थाना सुरीर पर आत्मदाह का प्रयास करने वाले दम्पति के साथ दि0 23.08.2019 को हुई घटना मे वांछित चल रहे अभियुक्त सत्यपाल की गिरफ्तारी व दोषी पुलिसकर्मियो के विरुद्ध अभियोग पंजीकृत करने के सम्बन्ध में Ssp-Mta द्वारा दी गई बाइट। pic.twitter.com/kIyl8VR84z", "— MATHURA POLICE (@mathurapolice) August 29, 2019", "The social media claim that the victims are Dalits, and that the accused is a BJP leader, is false. Alt News contacted the office of SSP, Mathura which confirmed, “There is no truth (to these claims). The accused does not have any political connection. Both the accused and the victims belong to the Thakur community. They were neighbours, and had a quarrel regarding a drain flowing outside their house. Satyapal (accused) is already in custody and hunt is on for two other accused.”", "The video of the self-immolation has been circulated on social media with the false claim that the police, along with a BJP leader set a Dalit man on fire. The incident is a case of self-immolation. It may further be noted that the accused is not a BJP leader and the victims do not belong to the Dalit community.", "Donate Now", "Arjun Sidharth is a writer with Alt News. He has previously worked in the television news industry, where he managed news bulletins and breaking news scenarios, apart from scripting numerous prime time television stories. He has also been actively involved with various freelance projects. Sidharth has studied economics, political science, international relations and journalism. He has a keen interest in books, movies, music, sports, politics, foreign policy, history and economics. His hobbies include reading, watching movies and indoor gaming.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]