["The graphic was shared in this Facebook post dated September 26, 2020.", "It reads: \"7 Biggest brain damaging habits.", "“1. Missing breakfast / 2. Sleeping late / 3. High sugar consumption / 4. More sleeping specially at morning / 5. Eating meal while watching TV or computer / 6. Wearing Cap/scarf while sleeping / 7. Habit of blocking/Stopping Urine / Don't just ReadForward to whom you careAs I care for U\".", "The WHO logo can be seen at the bottom of the graphic.", "The same graphic was also shared here, here and here on Facebook, and here, here and here on Twitter, alongside a similar claim.", "The claim, however, is false.", "In response to the claim, a WHO representative for the Philippines told AFP in an October 12, 2020 email: “[The graphic] did not originate from the World Health Organization.”", "The representative also said that all seven “habits” listed in the misleading graphic have not been scientifically proven to cause brain damage. “Missing breakfast, sleeping late, high sugar consumption, sleeping in the morning, eating while watching TV or on the computer, wearing clothing while sleeping, holding in urine are not shown to cause brain damage.”", "AFP also found that multiple health agencies advise that brain health is not determined by social factors alone, but also genetics.", "According to this factsheet on the WHO’s website, “Numerous interconnected social and biological determinants (incl. genetics) play a role in brain development and brain health.”", "The US Centers for Disease Control and Prevention also advises in this information sheet that “besides age, other risk factors [for damaging brain health] include family history, heredity, education level, head injury, exposure to pesticides or toxins, physical inactivity, and chronic health conditions such as heart disease and stroke, diabetes, and high blood pressure.”", "The misleading claim was also debunked by other fact-checking organisations worldwide, including the India-based Factly here, Philippine’s Rappler here and Nigeria’s International Centre for Investigative Reporting here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]