["About this rating", "On 13 February 2017, the web site HeadlinenNews.com reported that Reginald VelJohnson (best known for his role as Carl Winslow on \"Family Matters\") had died of a heart attack:", "Reginald Vel Johnson, the actor best known as Family Matters‘ Carl Winslow, has died after suffering a heart attack. He was 64.", "He was loved by the world and he will be missed profoundly,” says Jenkins, 24. “Our entire family thanks you for your thoughts and prayers.”", "Rumors claim that Vel Johnson was flying from London to Los Angeles on Sunday, Feb. 12, when he went into cardiac arrest. According to the story, paramedics removed him from the flight and rushed him to a nearby hospital, where he was treated for a heart attack.", "The rumor was given traction by VelJohnson's appearance in a meme mocking the non-existent \"Bowling Green Massacre\":", "VelJohnson personally debunked the claims on Twitter:", "Twitter literally trying to kill me! ??? https://t.co/OdRTRJVi7f", "— Reginald VelJohnson (@rveljohnson) February 15, 2017", "Even when I finally pass you can still contact me thru this clock. Photo credit: some weirdo lol pic.twitter.com/ktLhkH83VF", "— Reginald VelJohnson (@rveljohnson) February 15, 2017", "Although VelJohnson's Twitter account is not verified, it was registered in 2009 and was not likely to be operating as a separate hoax. Even if it were a hoax Twitter account, however, the difficult-to-find \"About\" page on HeadlinenNews.com has the following disclaimer:", "Headlinen News is a satire site. We use real people to make real funny stories. Chill folks, its all for fun.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]