["About this rating", "Since not long after the inauguration of President Donald Trump in January 2017, the following message has been circulated via email and social media as representing a supposedly Trump-endorsed piece of legislation known as the \"Congressional Reform Act of 2017\":", "President Trump is asking everyone to forward this email. In three days, most people in the United States will have the message. This is an idea that should be passed around, regardless of political party.", "The TRUMP Rules: Congressional Reform Act of 2017", "1. No Tenure / No Pension. A Congressman/woman collects a salary while in office and receives no pay when they're out of office. And, no more perks go with them.", "2. Congress (past, present, & future) participates in Social Security. All funds in the Congressional retirement fund move to the Social Security system immediately. All future funds flow into the Social Security system, and Congress participates with the American people. It may not be used for any other purpose.", "3. Congress must purchase their own retirement plan, just as ALL Americans do.", "4. Congress will no longer vote themselves a pay raise. Congressional pay will rise by the lower of CPI or 3%.", "5. Congress loses their current health care system and participates in the same health care system as the American people.", "6. Congress must equally abide by all laws they impose on the American people (i.e. NO MORE INSIDER TRADING!!!).", "7. All contracts with past and present Congressmen/women are void. The American people did not make this contract with Congressmen/women. Congress made all these contracts by and for themselves.", "Serving in Congress is an honor and priviledge [sic] NOT a career. The Founding Fathers envisioned citizen legislators should serve their term(s), then go home and go back to work ... not get all kinds of freebies.", "NO WONDER THEY’RE FIGHTING EVERYTHING HE TRIES! Pass it on!!!! Let's help TRUMP drain the swamp!! Just hold your finger down then hit forward and send it to everyone you know. Let’s help trump get the country straightened out.", "However, this text has nothing to do with President Trump, Congress, or 2017. It's a piece of internet flotsam that's been around since 2009 and was originally identified as a \"Proposed 28th Amendment to the United States Constitution\" (although no one in Congress had actually submitted it as such) before being retitled as the \"Congressional Reform Act\" and attributed (wrongly) to business magnate Warren Buffett.", "We rate this newer variant as \"False\" because this item is a decade old, does not reflect an actual piece of legislation, and has not been championed by President Trump.", "Have you seen other variations of this claim? Let us know.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]