["About this rating", "On 22 August 2017, the Facebook page “Geology Wonders” posted an image that appears to show a massive seahorse fossil exposed on a boulder with the caption “giant fossil of a seahorse.”", "While breathtaking, the picture is fake and its premise is scientifically implausible. The image won first place in a Photoshop contest called “The Eighth Wonder of the World” hosted by the web site pxleyes.com. The artist, whose user name is loopyluv, explained the steps used to create the image:", "The notion that such a large, well-preserved seahorse fossil would be found anywhere on Earth is unlikely. In fact, seahorse fossils are remarkably rare, and have so far been found only in two locations: the Tunjice Hills in Slovenia, and in a single fossil bed in Northeastern Italy. Both of these fossil beds preserve seahorses that are similar in size and shape to the seahorses alive today, which range from .6 to 14 inches long.", "Scientists estimate that the largest seahorse fossil from Slovenia, if it had preserved the complete body, would have about 9 centimeters long — far smaller than human-sized seahorse allegedly preserved in the boulder. As such, we rank this claim as false.", "pxleyes.com.   \"A Work in Progress: The 8th wonder\"", "Teske, Peter, R,, and Beheregary, Luciano B.   \"Evolution of Seahorses' Upright Posture Was Linked to Oligocene Expansion of Seagrass Habitats.\"\r\n    Biology Letters.   18 May 2009.", "Zalohar, Jure, et al.   \"Two New Species of Seahorses (Syngnathidae, Hippocampus) from the Middle Miocene (Sarmatian) Coprolitic Horizon in Tunjice Hills, Slovenia: The Oldest Fossil Record of Seahorses.\"\r\n    Annales de Paléontologie.   June 2009.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]