["About this rating", "At the end of the day on 13 March 2018, Democratic candidate Conor Lamb apparently scored a narrow but shocking upset win in a special House election in southwestern Pennsylvania, holding a 620-vote lead over Republican candidate Rick Saccone in an area that went heavily for Donald Trump in the 2016 presidential election.", "The following day, the web site Daily World Update published an article reporting that \"multiple trucks full of illegals\" had been spotted at \"six polling locations across Pennsylvania\":", "The race for Pennsylvania’s 18th district was a close one, with Conor Lamb being declared the victor before write-in and absentee ballots had even been counted. The fact that Lamb “won” even in deep red areas that support President Trump overwhelmingly, is suspicious on its own — but reports of voter fraud make things even more peculiar (especially the trucks full of illegals).", "Not only did Fox News report that verified instances of voter fraud are already popping up in the state, but Breitbart uncovered another very serious problem:", "\"Locals captured photographs of what appears to be multiple trucks full of illegals at not one, not two, not even three, but six polling locations across Pennsylvania. All of the locations were in areas Trump dominated in the 2016 election.\"", "There was no truth to this report, which originated with Daily World Update, a site that is part of a network of fake news sites dedicated to inflammatory clickbaiting and political trolling under the guise of producing \"satire.\"", "The Fake News Codex.   \"Christopher Blair Network.\"\r\n    Accessed 11 March 2018.", "Burns, Alexander et al. \"Conor Lamb Wins Pennsylvania House Seat, Giving Democrats a Map for Trump Country.\"\r\n    The New York Times.   14 March 2018.", "Farrow, Janet.   \"Trucks Full of Illegals Casted Fake Votes in Pennsylvania Race\"\r\n    Daily World Update.   14 March 2018.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]