["The one-minute, 22-second video was posted here on Facebook on September 21, 2020. It has been viewed more than 123,000 times and shared over 5,500 times before being deleted.", "The Indonesian-language post translates to English as: “Sukabumi in Curug region hit by flash floods…”", "Flash floods struck Cicurug and Parungkuda districts in Sukabumi regency in the province of West Java on September 21, 2020, after heavy rainfalls caused the Cibuntu River to overflow, as reported by local media Liputan6.com here.", "The video has also been viewed more than 157,000 times since it was shared alongside a similar claim on Facebook here, here, here and here; on YouTube here; and on TikTok here.", "The same video was also shared with a claim that it occurred in Bogor, a city in West Java, on Facebook here, where it received 71,000 views.", "However, the claims are false.", "Reverse image and keyword searches on Google found the same video was uploaded on YouTube here on August 8, 2011.", "Translated from Japanese to English, the video’s title reads: “March 11 Tsunami seen from Yuriage Junior High School”.", "The caption reads: “This is a photo taken by a friend and I uploaded what my friend filmed with his/her permission. This is a video of the tsunami that hit Yuriage, Natori City, Miyagi prefecture. I hope various people can see the truth at that time.”", "Below is screenshot comparison between footage in the misleading post (L) and the YouTube video (R):", "Yuriage, an area in the city of Natori, suffered devastating damage after a tsunami struck Japan’s Tohoku region on March 11, 2011, as reported by Fuji News Network and BBC.", "The location of the Yuriage school building can be seen on Google Maps here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]