["About this rating", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "In April 2020, millions of Americans who lost income due to circumstances related to the COVID-19 pandemic were waiting on promised relief payments from the United States government. So when news broke that U.S. President Donald Trump was making the \"unprecedented\" move of having his name added to these stimulus checks, a decision that could potentially delay the arrival of these checks by several days, many citizens took to social media to voice their displeasure, as in the example below:", "Trump's name is truly being added to the COVID-19 stimulus checks, otherwise known as Economic Impact Payments. As of this writing, however, officials at the U.S. Treasury Department insist this will not result in any delays.", "The Washington Post first reported on Trump's decision on April 14, 2020. According to the news outlet, Trump's name is expected to appear in the memo line of the check, not as the payment's official signatory, and that this will be the \"first time that a president's name appears on an IRS disbursement\":", "The Treasury Department has ordered President Trump’s name printed on stimulus checks the Internal Revenue Service is rushing to send to tens of millions of Americans, a process that could slow their delivery by a few days, senior IRS officials said.", "The unprecedented decision, finalized late Monday, means that when recipients open the $1,200 paper checks the IRS is scheduled to begin sending to 70 million Americans in coming days, “President Donald J. Trump” will appear on the left side of the payment.", "It will be the first time a president’s name appears on an IRS disbursement, whether a routine refund or one of the handful of checks the government has issued to taxpayers in recent decades either to stimulate a down economy or share the dividends of a strong one.", "Treasury officials disputed that the checks would be delayed.", "While Trump's name will appear on these stimulus checks, we can't predict whether these payments will be delayed or go out on time. A Treasury Department official said in a statement that \"absolutely no delay whatsoever\" would occur:", "\"Economic Impact Payment checks are scheduled to go out on time and exactly as planned — there is absolutely no delay whatsoever ... In fact, we expect the first checks to be in the mail early next week which is well in advance of when the first checks went out in 2008 and well in advance of initial estimates.\"", "It should also be noted that many Americans will be receiving their stimulus payments via a direct deposit. It's unclear how many people will receive hard paper checks bearing Trump's name and how many will receive a digital payment.", "An IRS official told Fox News that the number of people who will receive paper checks was subject to a \"number of variables, including how much info the IRS obtains through the Non-Filers Enter Payment Info web portal and the Get My Payment portal launching [April 15] at IRS.gov.“", "These Economic Impact Payments were included in the $2.2 trillion stimulus package that Trump signed in late March 2020. According to the IRS, direct-deposit payments had already started going out as of the second week in April. Those waiting on a paper check, however, may not see their payments for several weeks. (If you're waiting on a payment, you can check the status of your check on a recently launched web app from the IRS.)", "To sum up: It is true that in April 2020, the U.S. government made the unprecedented move of adding the president's name to stimulus checks issued by the IRS in response to the COVID-19 pandemic. Although an IRS official said this could slow the process and delay the delivery of checks, Treasury officials insisted that the checks would still go out on schedule.", "Paine, Neil.   \"More Than 16 Million Americans Have Lost Their Jobs In The Past Three Weeks.\"\r\n    Five Thirty Eight.   9 April 2020.", "Raju, Manu; Fox, Lauren; Klein, Betsy.   \"Some Americans Could Wait 20 Weeks to Receive Stimulus Checks, IRS Tells House Democrats.\"\r\n    CNN.   2 April 2020.", "Olson, Tyler and John Roberts.   \"Trump's Name Will be Added to Stimulus Checks.\"\r\n    Fox News.   15 April 2020.", "Acosta, Jim and Caroline Kelly.   \"Trump's Name Will be Added to Stimulus Checks.\"\r\n    CNN.   15 April 2020.", "Acosta, Jim and Caroline Kelly.   \"Trump's Name Will be Added to Stimulus Checks.\"\r\n    CNN.   15 April 2020.", "Lederman, Josh Phil Helsel.   \"Trump's Name Will Appear on Coronavirus Relief Checks.\"\r\n    NBC News.   14 April 2020.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]