["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "U.S. Sen. Marco Rubio lives in a four-bedroom home in West Miami. He has put it on the market for $675,000.", "Forget for a minute about the awkward grasp for a plastic bottle of Poland Spring before millions on live TV.\n\nThere’s something else in Sen. Marco Rubio’s response to the State of the Union on Tuesday that is riling up the blogosphere. Where does Marco Rubio live?\n\nPresident Barack Obama loves to say people who don’t agree with him are rich, Rubio said on Feb. 12, 2013. Rubio went on to emphasize his own middle-class Republican cred.\n\n\"Mr. President, I still live in the same working-class neighborhood I grew up in. My neighbors aren’t millionaires. They’re retirees who depend on Social Security and Medicare. They’re workers who have to get up early tomorrow morning and go to work to pay the bills. They’re immigrants, who came here because they were stuck in poverty in countries where the government dominated the economy.\"\n\nSome bloggers jabbed Rubio for omitting details about his West Miami crib.\n\nThe headline of a post from Miami gossip columnist Jose Lambiet: \"Marco Rubio: I still live in da hood -- sorta!\" Lambiet included a slew of photos of Rubio’s home on his blog, including his living room, kitchen, and backyard pool, trampoline, wooden fort and patio surrounded by a tall green hedge. Miami New Times dinged Rubio for his \"humbleboast.\"\n\nWhat’s their beef?\n\nOne, Rubio did not mention his home is for sale. Rubio wants to sell the four-bedroom, three-and-a-half-bathroom home and buy one in D.C. so he can see his kids more often, spokesman Alex Conant told The Daily Caller in January. Rubio rents a room in a Capitol Hill apartment, Conant said.\n\n\"If he can sell his home in Miami, he would be able to afford to move his wife and kids to Washington during the school year and still own a home in Florida,\" Conant told us in an email.\n\nAnd two, at a listing price of $675,000, the two-story, 2,700-square-foot home on a cul de sac is not what some may consider \"working class.\"\n\nFrom New Times: West Miami is, in fact, a fairly blue collar town, just west of tonier Coral Gables. But it's pretty brazen to put your residence there in a nationally televised speech when 1) you are actively trying to leave that working-class neighborhood and 2) you stand to make more than a half-million bucks by doing so.\n\nRubio and wife Jeanette bought the home in 2005 for $550,000, the same year it was built. The sale garnered controversy for Rubio in 2008 when the Miami Herald reported Rubio failed to disclose a $135,000 equity line he obtained from a bank run by political supporters after taking out his mortgage.\n\nRubio’s realtor and brother-in-law, Orlando Cicilia of Centrust Realty, told us Rubio’s home is one of the nicer ones in his neighborhood.\n\n\"It’s all a working-class neighborhood,\" he said. \"You’ve got some executives, and you have a lot of regular people there.\"\n\nCicilia said he found the home for Rubio at a construction price in 2005. Cicilia, married to Rubio’s older sister, lives in Rubio’s childhood home, about half a mile away. Cicilia did not want to elaborate on that.\n\nThe neighborhood is in a central location close to pricier Coral Gables, the airport, shopping malls and other businesses. About 27,000 people live in Rubio's zip code (33144), according to the Census Bureau’s 2007-11 American Community Survey.\n\nOf those, 74 percent of the people are Cuban, and about 71 percent are foreign-born, according to Census data. The average years of education is 12, a high school diploma.\n\nThe median household income is $37,556. Less than 1 percent of households there make more than $200,000 a year.\n\nAnd while Rubio’s home is going for $675,000, the median home value of an owner-occupied home is significantly lower at $311,475, according to 2010 Census data. Zillow.com put the median home list value in West Miami at $202,600.\n\nRubio said he still lives in the \"same working-class neighborhood\" he grew up in. Yes, but he is looking to leave. We rate his claim Mostly True.", "Tampa Bay Times, \"Tour Marco Rubio's $675,000 'working class' home,\" Feb. 13, 2012\n\nThe Daily Caller, \"Rubio attempting to sell Miami home, move family to D.C.,\" Jan. 30, 2013\n\nGossip Extra, \"Marco Rubio: I Still Live in da ‘Hood — Sorta!,\" Feb. 13, 2013\n\nZillow blog, \"Marco Rubio’d Miami home listed for sale,\" Feb. 13, 2013  \n\nMiami Herald Gossip Extra, \"Marco Rubio’s West Miami home on the market,\" Jan. 30, 2013\n\nMiami New Times, \"Marco Rubio, Who Bragged About Living In \"Working Class\" West Miami, Is Selling His $675,000 House,\" Feb. 13, 2013\n\nRadar Online, \"Sen. Marco Rubio Selling His ‘Middle-Class’ Miami Home For $675K, Moving To DC,\" Feb. 13, 2013\n\nMiami-Dade Property Appraiser’s Office records\n\nThe Huffington Post, \"Marco Rubio’s personal finances don’t match his rhetoric,\" Feb. 13, 2013\n\nEmail interview with Lauren Riefflin, Zillow.com spokeswoman, Feb. 13, 2013\n\nInterview with Orlando Cicilia, Rubio’s realtor, Feb. 13, 2013\n\nMiami Herald, \"Rubio home equity loan questioned; Florida House Speaker Marco Rubio failed to disclose a $135,000 home equity loan he got from a Miami bank controlled by political supporter,\" March 29, 2008", "U.S. Census Bureau, 2007-11 American Community Survey (5 year estimates)", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]