["About this rating", "On Aug. 25, 2020 — one day after a white police officer in Kenosha, Wisconsin, was captured on cell phone video shooting Jacob Blake, a Black man, multiple times as he was trying to enter his vehicle — social media users shared a video of what they said showed the aftermath of protests decrying the shooting.", "The footage showed smoke rising from, the posts alleged, a facility run by the Wisconsin Department of Corrections (DOC) in Kenosha. Racial justice activist Shaun King, for example, shared the clip on Facebook with the caption: \"In Kenosha, protestors burned down the ENTIRE Department of Corrections compound. And spray painted the question 'Are you listening yet?' on what remains.\"", "To unpack the legitimacy of the claim, we considered it two-pronged: a facility run by the DOC in Kenosha was set on fire during the August 2020 protests against racism in policing, and the flames and smoke damage completely — not partially — destroyed the building.", "First, we considered the addresses of properties run by the DOC in Kenosha, specifically an office for processing paroles and probations, called the Community Corrections Division, at 1212 60th St., and the Kenosha Correctional Center, which is a prison that can house up to 115 male inmates, at 6353 14th Ave.", "A photograph taken by Ashlee Rezin Garcia, a Chicago Sun-Times photojournalist, showed a Kenosha building ablaze and confirmed it was the probation and parole office, not the prison, that was along the route of the protests on Aug. 24.", "Next, we considered Google Maps footage, which was captured in July 2012, to determine if the site depicted in the viral video was indeed the property on 60th Street. Several architectural elements such as the property's landscaping and building design seen on Google Maps' street view matched what was shown in the clip, eliminating any speculation that the video erroneously showed rubble and damage from a site that was not a DOC-operated facility in Kenosha.", "Courtesy of Google Maps.", "So to recap, it was true to claim a DOC-run office in Kenosha was set on fire during the protests, and the viral video indeed depicted the aftermath of that site's damage.", "After that, we sought any evidence to confirm or deny that the fire destroyed the entire building.", "Snopes presented the question to the DOC'S Office of Public Affairs, and Deputy Director of Communications Anna Neal responded to our inquiry with an email, which explained staff had indeed used the building to meet with people on probation, parole, or other types of court-mandated supervision. But since the COVID-19 outbreak in early 2020, she wrote, most staff had been working remotely, not in the office. Neal added:", "The building was burned down and unfortunately was a total loss, however we are happy to note there was no one in the building at the time of the incident and there are no staff injuries reported. [...] All essential operations are still being conducted, and public safety remains our number one priority.", "In sum, considering the accurate documentation of the fire and its aftermath, as well as confirmation from a DOC spokesperson that the building sustained irreparable fire damage, we rate this claim \"True.\"", "Groves, Stephen and Scott Bauer.   \"Somber Protests in Kenosha After Night Of Chaos, Shootings.\"\r\n    The Associated Press.  27 August 2020.", "Groves, Stephen and Scott Bauer.   \"17-year-old Arrested After 2 Killed During Unrest in Kenosha.\"\r\n    The Associated Press.  27 August 2020.", "The Associated Press.  \"Protesters March After Wisconsin Police Shoot Man in Back.\"\r\n    23 August 2020.", "Householder, Mike and Tammy Webber.   \"Kenosha Protesters, Police Clash Again After Black Man Shot.\"\r\n    The Associated Press.   25 August 2020.", "Chicago Sun-Times Editorial Board.   \"America in 2020: Buildings Burn While a Black Man Shot by the Police Lies Paralyzed.\"\r\n    25 August 2020.", "Hughes, Elliot.   \"Small Kenosha Businesses, Department of Corrections building Burned to the Ground, Countless Others Vandalized.\"\r\n   Milwaukee Journal Sentinel.   25 August 2020.", "Jessica Lee is Snopes' Senior Assignments Editor with expertise in investigative storytelling, media literacy advocacy and digital audience engagement.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]