["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "In this Wednesday, April 4, 2018 photo, a family buys hot dogs from a street vendor on Broadway in the Soho neighborhood of New York. (AP Photo/Mary Altaffer)", "First New York City came for your jumbo-sized sodas. Now does the local government have its sights set hot dogs?", "\"New York City Mayor Bill DeBlasio is now banning hot dog sales to stop climate change!\" reads an April 27 Facebook post, misspelling de Blasio’s name.", "\"You can’t make this stuff up!\" it says.", "Actually, you can. Let’s look at how the sausage is made.", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.) That’s because the city plans to phase out its purchase of processed meat, not put hot dog carts out of business.", "On Earth Day, April 22, the city unveiled its Green New Deal. Not to be confused with the federal legislation that was proposed by U.S. Rep. Alexandria Ocasio-Cortez and bears the same name, New York City’s plan aims to reduce approximately 30% of greenhouse gas emissions, which contribute to climate change. One way it seeks to accomplish that goal is by reducing \"carbon intensive consumption.\"", "\"The city will end unnecessary purchases of single-use plastic foodware, phase out the purchase of processed meat, reduce the purchase of beef by 50% and commit to a carbon neutral city fleet by 2040,\" says an outline of the plan on the city’s website.", "So, the city is instituting rules for what the city government purchases and sells. It doesn’t propose an end to New York’s famous hot dog street vending scene. In fact, the report doesn’t even mention hot dogs and the city isn’t prohibiting citizens or businesses from buying processed meat. But readers can be forgiven for thinking so after some news headlines like this one: \"NYC to ban hot dogs and processed meats to improve climate.\"", "That’s misleading, but the Facebook post goes a step further and says the city is banning the sale of hot dogs, which isn’t true. And the city’s effort to phase out its own purchases of processed meat isn’t just about the climate. It is also about health.", "According to \"A Livable Climate,\" an April report that lays out New York City’s plans to become carbon neutral, there are two mentions of processed meat. Both are in a section about adopting \"more sustainable consumption practices in city government operations.\"", "\"The city will shift away from goods that have an outsized impact on the environment and identify opportunities to reduce waste and cut (greenhouse gas) emissions throughout city government,\" the report says. \"Through updates to our Environmentally Preferable Purchasing (EPP) and executive action, we are ending the purchasing of unnecessary single-use plastic foodware, reducing the purchasing of beef, and phasing out the purchasing of processed meat.\"", "The second reference is about health: \"Processed meat consumption is linked with increased risk of cancer and is often high in saturated fat and sodium which is linked with heart disease. This policy would offer health benefits to the most vulnerable New Yorkers.\"", "In another April report—\"Healthy Lives,\" about reducing inequities in health—processed meat is mentioned again under a section called \"expand health food choices.\" The report says: \"The city will also update the NYC Food Standards to phase out purchases of processed meat, which has been linked with increased risk of cancer and is often high in saturated fat and sodium which is linked to heart disease. Processed meat will be replaced by healthier proteins, including an increase in plant-based options.\"", "The city’s 11 public hospitals have started offering such options, the report says, and starting next school year all schools will serve vegetarian meals on Mondays (aka \"Meatless Mondays\").", "Our ruling", "New York City plans to phase out its purchase of processed meat—like hot dogs—as part of its efforts to confront the climate crisis and improve health inequities among residents. But that decision is limited to the government’s purchases, which means that while you might not be able to buy a hot dog at a public hospital cafeteria, feel free to stock up at the grocery store or get a link at any other private business that sells them.", "We rate this Facebook post False.", "Facebook post, April 27, 2019", "The New York Times, \"New York’s ban on big soda is rejected by final court,\" June 26, 2014", "OneNYC 2050, visited May 3, 2019", "OneNYC 2050: A Livable Climate, April 2019", "OneNYC 2050: Healthier Lives, April 2019", "New York City website, \"Action on global warming: NYC’s Green New Deal,\" April 22, 2019", "106.7 Lite FM, \"NYC to ban hot dogs and processed meats to improve climate,\" April 23, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]