["By Eugene Kiely and Sydney Schaedel", "Posted on July 24, 2017", "President Donald Trump tweeted that “all agree the U.S. President has the complete power to pardon.” It’s true that the president has the constitutional power to issue pardons, but there are some limits to that power.", "Article II, Section 2 of the U.S. Constitution says a president cannot pardon “in cases of impeachment.” It also limits the power to “offenses against the United States,” which would exclude violations of state laws.", "The issue of whether a president could pardon himself remains an unresolved legal issue that is open to debate. Trump’s own attorney, Jay Sekulow, said on ABC’s “This Week” that the power to pardon oneself has “never been adjudicated” and would likely be decided by the Supreme Court.", "The president posted his tweet on July 22 — a day after the Washington Post reported that some of the president’s lawyers are “discussing the president’s authority to grant pardons” for his “aides, family members and even himself” in connection with the federal investigation into whether the Trump campaign cooperated with Russia’s attempts to influence the 2016 presidential election. The Post report on the issue of pardons was based on anonymous sources described as “people familiar with the effort.”", "While all agree the U. S. President has the complete power to pardon, why think of that when only crime so far is LEAKS against us.FAKE NEWS", "— Donald J. Trump (@realDonaldTrump) July 22, 2017", "We asked the White House what the president meant by “complete power,” but we have not received a response.", "Sekulow, Trump’s attorney, described the president’s tweet on “This Week” as “rather unremarkable.” He said that Trump’s tweet was merely stating that “under the Constitution, under Article Two, Section Two, the president has the authority to pardon.”", "If that’s what the president meant, Kermit Roosevelt, a University of Pennsylvania law professor and constitutional scholar, told us that Trump would be correct that the Constitution gives the president “complete power, rather than only part[ial]” power over pardons.", "“The President decides whether to pardon or not, and no one else can control that decision,” Roosevelt said in an email. “I would say everyone agrees on that.”", "But there are limits to that power, Roosevelt said.", "“If he meant the President can pardon anyone for any offense, he’s wrong,” he said in an email. “The Constitution says that he can’t use the pardon to undo or prevent an impeachment, and also that he can only pardon for offenses against the United States, which means not for state-law crimes (and state attorneys general do have criminal investigations underway). I would also say everyone agrees on that.”", "New York Attorney General Eric Schneiderman is looking into both Eric Trump’s foundation and former Trump campaign manager Paul Manafort’s real estate deals.", "Here is what the Constitution says:", "U.S. Constitution, Article II, Section 2, Clause 1: The President shall be Commander in Chief of the Army and Navy of the United States, and of the Militia of the several States, when called into the actual Service of the United States; he may require the Opinion, in writing, of the principal Officer in each of the executive Departments, upon any Subject relating to the Duties of their respective Offices, and he shall have Power to grant Reprieves and Pardons for Offenses against the United States, except in Cases of Impeachment.", "Brian Kalt, a Michigan State University law professor, told CNN that a presidential pardon “doesn’t reach state crimes (only ‘offenses against the United States’) and it can’t stop or undo a congressional impeachment, but other than that the power is pretty broad.”", "Sekulow, Trump’s attorney, disputed the Post‘s account of discussions among the president’s legal team about possible pardons. He said, “Pardons have not been discussed and pardons are not on the table.”", "Sekulow, July 23: With regard to the issue of a president pardoning himself, there’s a big academic discussion going on right now, an academic debate. You’ve got Professor Tribe arguing one point, you’ve got Professor Turley arguing another point.", "And it — while it makes for interesting academic decisions, let me tell you what the legal team is not doing. We’re not researching the issue, because the issue of pardons is not on the table, there’s nothing to pardon from.", "Sekulow is referring to Laurence H. Tribe, a Harvard University law professor, and Jonathan Turley, a George Washington University law professor. Both professors separately penned op-eds in the Washington Post on presidential pardons and the issue of whether Trump could pardon himself.", "In a July 21 op-ed, Tribe and two former White House ethics lawyers wrote that the Constitution “specifically bars the president from using the pardon power to prevent his own impeachment and removal.”", "In the op-ed, Tribe, Richard Painter, who was chief White House ethics lawyer for President George W. Bush from 2005 to 2007, and Norman Eisen, who held the same position for President Barack Obama from 2009 to 2011, cited language in the Constitution that specifically bars a president from issuing a pardon “in cases of impeachment.”", "“The Constitution specifically bars the president from using the pardon power to prevent his own impeachment and removal. It adds that any official removed through impeachment remains fully subject to criminal prosecution,” they wrote. “That provision would make no sense if the president could pardon himself.”", "The authors of the op-ed also said they agreed with an Aug. 5, 1974, memo written by Mary C. Lawton, who at the time was an acting assistant attorney general in the Department of Justice’s Office of Legal Counsel during the Watergate investigation. Lawton’s memo, which was written four days before President Richard Nixon resigned from office, said: “Under the fundamental rule that no one may be a judge in his own case, the President cannot pardon himself.”", "Tribe and his co-authors argued that the Constitution allows the president “to act essentially in the role of a judge of another person’s criminal case, and to intervene on behalf of the defendant when the president determines that would be equitable.”", "On the same day, Turley wrote that the president “clearly” has the power to pardon his family members and aides and could “probably” pardon himself, but he advised against it. “In the end, a pardon of Trump’s allies and family — let alone himself — would destroy any legacy of Trump’s and demean his office,” Turley wrote.", "Like Sekulow, Turley said the issue of a self-pardon is legally unsettled.", "“The issue of whether a president can pardon himself is one of the unanswered questions of the Constitution; it has never happened in the history of our republic,” Turley wrote. “Even Nixon did not stoop to a self-pardon, although he did research it. Neither did Andrew Johnson or Bill Clinton, both of whom were impeached by the House but not removed from office by the Senate.”", "So, while constitutional scholars agree that the president has the power to pardon others, there are some limits to that power, and the question of whether a president can pardon himself is an unresolved legal issue that remains in dispute.", "FactCheck.org Rating:", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]