["A video of a vendor licking his finger while handling fruits on his cart has been massively shared on social media in the backdrop of the coronavirus pandemic. While the unhygienic behaviour has shocked many, there has been a deliberate attempt to portray it as a willful act to spread coronavirus. Twitter user Desi Mojito posted the video with the message, “This is next level. Be safe and careful people”. The tweet has garnered more than 4,300 retweets so far.", "This is next level. Be safe and careful people pic.twitter.com/OJhONjvUR3", "— desi mojito (@desimojito) April 3, 2020", "The video was also picked up by TV9 Bharatvarsh. The channel termed the vendor “corona criminal” thus giving the impression that it is a recent clip. Towards the end of the show, the channel provided Superintendent of Police (SP) Raisen’s statement that the clip is old and a case has been registered against the fruit-seller.", "BJP member Major Surendra Poonia, Swarajya columnist Shefali Vaidya, BJP supporter Sonam Mahajan, Sankrant Sanu, and Mohammed Tawhidi (@Imamofpeace) were among the prominent social media accounts who tweeted the video with a similar narrative. Their tweets have amassed a combined retweet count of more than 13,000.", "Alt News has received several requests on its official Andriod application to debunk this video.", "Alt News found that the video is from Madhya Pradesh’s Raisen town and dates back to February 2020. With a keyword search on Google, we found a report published by Dainik Bhaskar on April 3, 2020. According to the report, the fruit-seller in the video is Sheru Khan, a resident of Raisen town. He sets up his fruit cart in the main market. An FIR was filed against the fruit-seller under sections 269 and 270 of the Indian Penal Code on April 3, 2020.", "According to the FIR, the said incident took place on February 16, 2020. The complainant Bodhraj Tipatta said that he had filmed this video while sitting at his friend Bhavishya Kumar’s pan shop when he saw this vendor “infecting” the fruits with his saliva. In a statement given to the police, Tipatta informed that he shot this video on February 16. According to him, the vendor’s actions could prove to be dangerous to spread an “epidemic”.", "However, Khan’s daughter Fiza claims that her father is mentally unstable. She informed that her father was beaten by the police after a case was filed against him. Khan’s daughter also claimed that due to his illness he constantly makes gestures of counting notes – the same way he is seen “counting” the fruits. We are not able to independently verify her claims.", "Fiza said that the video is more than six weeks old and that her father borrows cart from other people whenever he feels like selling fruits.", "While speaking to the media, Raisen SP reiterated that the video was old and assured residents that the issue was being investigated and there is “nothing to fear”. Sukhla also informed that there has not been a single case of coronavirus so far in the town. A keyword search on Twitter also bore no results for coronavirus positive cases in Raisen district.", "Therefore, the video of a Muslim vendor licking his finger and touching the fruits while placing them on his cart was shot in mid-February this year. It may be noted that the first confirmed coronavirus case in India was reported on January 30, 2020, but the government had declared the outbreak as a notified disaster only on March 14. The first coronavirus positive case in Madhya Pradesh was reported on March 20. The vendor’s act was unarguably unhygienic however the issue has been grossly twisted on social media with several individuals terming it deliberate and calling for a boycott of Muslim vendors.", "Ever since Delhi’s Nizamuddin was identified as a coronavirus hotspot, several old and unrelated videos showing the Muslim community in poor light are being circulated on social media. We have observed a deliberate pattern to delegitimize the community. Earlier this week, a video of a group practising a ritual in Sufism was falsely shared as intentional sneezing inside Nizamuddin mosque. Another old video, which was initially viral in Singapore and UAE, was shared with the claim that a Muslim man was spitting on food. All these videos have been used to call for a boycott of the community, especially the lower economic sections of the society such as vegetable and fruit vendors. This act of communalising a pandemic is disturbing as well as dangerous.", "Note: The number of positive cases of the novel coronavirus in India exceeds 5,000 and more than 150 deaths have so far been reported. The government has imposed a complete restriction on movement apart from essential services to tackle the pandemic. Globally, more than 14 lakh confirmed cases and over 80,000 deaths have been reported. There is a sense of panic among citizens, causing them to fall for a variety of online misinformation – misleading images and videos rousing fear or medical misinformation promoting pseudoscience and invalid treatments. While your intentions may be pure, misinformation, spread especially during a pandemic, can take lives. We request our readers to practice caution and not forward unverified messages on WhatsApp and other social media platforms.", "Donate Now", "A purported video of a Muslim man beating a temple priest with a bat is…", "A picture depicting the Pakistani flag apparently bigger in size and apparently placed higher than…", "Amid the ongoing war between Israel and Hamas, a video of a fleet of cars…", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…"]