["By Eugene Kiely, Robert Farley, D'Angelo Gore and Lori Robertson", "Posted on January 6, 2021 | Updated on August 1, 2023", "Prior to the violence that disrupted Congress’ counting of the electoral votes, President Donald Trump gave an indignant speech filled with falsehoods about the presidential election he lost two months ago to Democrat Joe Biden.", "“Now it is up to Congress to confront this egregious assault on our democracy,” Trump told his supporters at a “Save America” rally. “After this, we’re going to walk down [to the Capitol] and I’ll be there with you.”", "Trump wasn’t there with them. But that was the least of his false statements on a day when a pro-Trump mob stormed the Capitol and halted the constitutionally mandated counting of electoral votes in a joint session of the House and Senate.", "The president made numerous false claims of election fraud in several swing states that decided the Nov. 3 election:", "Several times at the rally and twice on Twitter on Jan. 6, Trump claimed that Pence, who has a ministerial role in the official congressional counting of the electoral votes, could “send it back to the states to recertify, and we become president.” Trump told his supporters: “He has the absolute right to do it.”", "Pence, who serves as president of the Senate, said he does not have the right to do it.", "While Trump was speaking, Pence released a letter to Congress directly contradicting Trump’s claim that somehow Pence could do “the right thing” and “we win the election.”", "Pence wrote: “It is my considered judgment that my oath to support and defend the Constitution constrains me from claiming unilateral authority to determine which electoral votes should be counted and which should not.”", "The Constitution stipulates that after state electors have certified and sent their sealed votes for president and vice president to the president of the Senate, he “shall, in the presence of the Senate and the House of Representatives, open all the certificates and the votes shall then be counted.”", "That process was supposed to play out on Jan. 6, as stipulated by U.S. law, but was derailed by violent protesters who stormed the U.S. Capitol.", "“Some believe that as Vice President, I should be able to accept or reject electoral votes unilaterally,” Pence wrote. “Others believe that electoral votes should never be challenged in a Joint Session of Congress. After a careful study of our Constitution, our laws, and our history, I believe neither view is correct.”", "Trump, for one, believed that Pence could reject electoral votes, as he said in a Jan. 5 tweet. “The Vice President has the power to reject fraudulently chosen electors,” Trump claimed.", "Pence went on to say: “Our Founders were deeply skeptical of concentrations of power and created a Republic based on separation of powers and checks and balances under the Constitution of the United States. Vesting the Vice President with unilateral authority to decide presidential contests would be entirely antithetical to that design.”", "Garrett Epps, professor of law emeritus at the University of Baltimore School of Law, told us he didn’t know of “any text anywhere” upon which Trump could base this claim of Pence being able to change or reject the electoral votes. “This just has been made up out of whole cloth,” he said.", "The Constitution doesn’t say the vice president shall count the votes, Epps said. “It says the votes shall be counted.” And the Electoral Count Act says that counting is done by tellers in Congress.", "The Electoral Count Act, which was signed into law in 1887, says that the Senate and House each shall appoint two tellers to count the votes. The president of the Senate (the vice president) is supposed to hand the tellers the state certifications after he opens them, and the tellers are then to read those documents and make a list of the votes. Once all the votes are counted in that manner, the result is given to the president of the Senate, who announces the result.", "There is a process under that law for objections by members of Congress — which Pence referred to in his letter. But that procedure “is lodged in the two Houses, not in the VP,” Epps said.", "That procedure, which began to play out on Jan. 6 with the announcement of Arizona’s certified electoral votes in a joint session of Congress, requires any objection to be made in writing, signed by one senator and one representative at least, as a Congressional Research Service report explains.", "Such an objection would then “trigger a debate in each chamber and a majority vote in each chamber as to whether or not to sustain the objection to the counting of any particular state’s electoral ballots,” Keith E. Whittington, a politics professor at Princeton University, wrote for the Lawfare blog on Jan. 5. “If even one chamber votes to overrule the objection—as the Democratic-controlled House will undoubtedly do—then the count will continue. The recognition of Biden’s electoral victory will be delayed, but it is inevitable.”", "Pence explained his limited role in this process by quoting Supreme Court Justice Joseph Bradley, who after the 1876 election wrote that “the powers of the President of the Senate are merely ministerial. … [I]f any examination at all is to be gone into, or any judgment exercised in relation to the votes received, it must be performed and exercised by the two Houses.”", "Jay Sekulow, Trump’s attorney during the impeachment trial, also said on his radio show on Jan. 5 that Pence didn’t have the power to reject some electoral votes. “Some have speculated that the vice president could simply say, ‘I’m not going to accept these electors,’ that he has the authority to do that under the Constitution,” Sekulow said. “I actually don’t think that’s what the Constitution has in mind. If that were the case, any vice president could refuse any election.”", "Trump falsely claimed that in Pennsylvania there were “205,000 more ballots then you had voters.” That figure comes from a flawed partisan analysis that was “based on incomplete and inaccurate data,” according to the Pennsylvania Department of State.", "Trump, Jan. 6: There were over 205,000 more ballots counted in Pennsylvania. Now think of this. You had 205,000 more ballots than you had voters. … Where did they come from? You know where they came from? Somebody’s imagination.", "The president first made this claim in a tweet on Dec. 28 — the same day a group of Republican legislators in Pennsylvania issued a press release that said there were “202,377 more votes cast than voters voting,” citing an “extensive analysis” of state and county election data.", "“A comparison of official county election results to the total number of voters who voted on November 3, 2020 as recorded by the Department of State shows that 6,962,607 total ballots were reported as being cast, while DoS/SURE system records indicate that only 6,760,230 total voters actually voted,” the press release said, explaining how it arrived at the 202,377 figure.", "But the Pennsylvania Department of State called the allegations “false and misleading,” because the analysis was “based on incomplete and inaccurate data” from “very different systems and data points with different timeframes.”", "The data contained in the Department of State’s Statewide Uniform Registry of Electors, or SURE, system were incomplete at the time of the GOP analysis because some counties had “not yet finished entering into the SURE system what are called voter histories,” the department said in a Dec. 29 statement.", "“Each history is tied to the record of the individual voter who cast a ballot, including regular or provisional ballots,” the statement said. “At the time of the legislators’ release, these counties included Philadelphia, Allegheny, Butler and Cambria, which would account for a significant number of voters, and other provisional voter histories in a number of other counties are also not yet complete.”", "In a series of tweets, Pennsylvania Gov. Tom Wolf urged the Pennsylvania congressional delegation and Trump to drop their baseless claims of fraud and accept Pennsylvania’s Electoral College votes for Biden.", "“Pennsylvania had a free, fair, and secure election,” Wolf said. “There was no fraud or illegal activity.”", "The president falsely claimed that “more than 10,000 votes in Pennsylvania were illegally counted, even though they were received after Election Day.”", "But those 10,000 votes have not been counted, contrary to Trump’s claim, and they would not change the outcome even if they were counted.", "Trump is referring to about 10,000 ballots that were postmarked by Election Day on Nov. 3, but were received between 8 p.m. on Nov. 3 and 5 p.m. on Nov. 6. The Trump campaign sought to block Pennsylvania from counting those late-arriving ballots in a case that went all the way to the U.S. Supreme Court.", "On Oct. 28, Supreme Court Justice Samuel Alito ordered county election officials to comply with a Pennsylvania Department of State directive to keep those late-arriving ballots segregated from the rest of the ballots, pending the high court’s review of the case.", "There were 10,097 late-arriving ballots, but they were not counted, according to a Dec. 20 Philadelphia Inquirer story.", "“SCOTUS ordered counties to strictly segregate these ballots, and it was determined that they would be most clearly segregated by not adding them to the totals until further action by the court,” Department of State spokesperson Wanda Murren told the Inquirer.", "Biden won Pennsylvania by more than 80,000 votes.", "Trump reprised a familiar false claim about “thousands” of dead people voting in Pennsylvania.", "Trump, Jan. 6: Over 8,000 ballots in Pennsylvania were cast by people whose names and dates of birth match individuals who died in 2020 and prior to the election. Think of that. Dead people! Lots of dead people, thousands.", "Previously, the president claimed that as many as 20,000 “dead people” voted in Pennsylvania. Now, he is saying “thousands,” possibly 8,000. He’s still wrong.", "As of Dec. 20, there has been only one verified case of a vote being cast in the name of a deceased person, according to Newsweek. The man arrested was a Trump supporter, Bruce Bartman, who admitted that he cast a ballot in his dead mother’s name. In October, Robert Lynn, a registered Republican, was charged with applying for a ballot application in his dead mother’s name, but no vote was cast in that case.", "In another case cited by Trump supporters, Denise Ondick of Allegheny County, Pennsylvania, died on Oct. 22, but election officials received her application for a mail-in ballot on Oct. 23, according to online records from the Pennsylvania Department of State. Those records also show that her ballot was then received back by the county on Nov. 2, and that her vote was recorded.", "Trump also raised the bogus issue of thousands of alleged votes from “dead” people in Georgia. According to Trump, “Over 10,300 ballots in Georgia were cast by individuals whose names and dates of birth match Georgia residents who died in 2020 and prior to the election.”", "When Trump raised the issue in a Jan. 2 phone call with Georgia’s Republican Secretary of State Brad Raffensperger — during which Trump pressured him to recalculate the state’s vote in his favor — Raffensperger told the president his data was wrong.", "“The actual number were two, two,” Raffensperger told Trump. “Two people that were dead that voted and so that’s wrong.”", "As we have written, claims of dead people voting are common, and often overblown. Most often, claims about large numbers of votes from deceased people turn out to be due to list-matching or clerical problems, such as confusing two people with identical or similar names, Charles Stewart III, a political science professor at the Massachusetts Institute of Technology, who specializes in elections, told us via email back in November.", "As we have written before, votes cast illegally in the name of a dead person are exceedingly rare. Such few illegal votes would not affect the outcome in a state that Biden won by more than 80,000 votes (Pennsylvania) or more than 11,000 (Georgia).", "As he has in the past, Trump wrongly claimed that Georgia Republicans and “Democrat party operatives entered into an illegal and unconstitutional settlement agreement that drastically weakened signature verification and other election security procedures.”", "“Let’s address this disinformation about signature match,” Raffensperger wrote on Facebook on Nov. 15. “We strengthened signature match. We helped train election officials on [Georgia Bureau of Investigation] signature match — which is confirmed twice before a ballot is ever cast.”", "Georgia election officials check signatures when a voter requests a mail-in ballot, and then again when the ballot is returned.", "According to a state law passed last year, election officials must “promptly notify” voters about a ballot rejection due to an issue with the signature, allowing them to “cure” their ballot by casting a provisional ballot — along with supplying identification information — within three days of the polls closing on Election Day.", "As for the consent decree Trump mentioned, that refers to a settlement agreement in federal court reached in March that was crafted by Raffensperger to settle a lawsuit brought by Democrats over absentee ballots rejected in the 2018 general election. According to the consent decree, voters must be contacted the next business day — by phone or email — if their absentee ballot is rejected due to a signature issue.", "“The State of Georgia entered a consent decree that essentially did one thing and one thing only … instead of giving three days to inform a voter there was an issue with their ballot, [it] is down to 24 hours when you’re within 11 days of the election,” Gabriel Sterling, the state’s voting system implementation manager, said in his Nov. 17 press conference. “That is the one and only thing that that consent order addressed in any real way.”", "Raffensperger contends that agreement had little impact on the presidential election.", "“Takeaway is that rejection rate from 2018 to 2020 is exact same even after ballots with signature [issues] were cured,” Raffensperger wrote on Facebook on Nov. 16. “So, the idea that some settlement agreement that we entered into changed how counties were doing this is basically nonsense.”", "Trump falsely claimed that “Georgia’s absentee ballot rejection rate was more than 10 times lower than previous levels” and that “if Georgia had merely rejected the same number of unlawful ballots, as in other years” he would have won the state.", "As he has in the past, Trump is comparing the rate of ballots rejected for signature issues in this election to the number of ballots rejected in past elections for all reasons, usually for being received too late.", "Georgia hasn’t released data on the total number of mail-in ballots rejected; it has only released the number of mail-in ballots rejected because of signature issues (missing or mismatched signatures). And it is about the same percentage as in the 2018 midterm and only slightly lower than in the 2016 presidential election.", "When considered as a percentage of mail-in ballots cast, the rejection rate for signature issues was nearly identical in 2020 (0.15%) to what it was in 2018 (0.16%), according to figures from the Georgia secretary of state’s office.", "In a Nov. 17 press conference, Sterling said the rejection percentage for signature issues was about the same in the 2016 election as well — with about 580 ballots with missing or mismatched signatures out of 246,000 mail-in ballots cast that year. That comes to a rejection rate of about 0.24%.", "“So this is pretty consistent on this,” said Sterling, a Republican.", "According to the U.S. Election Assistance Commission, a total of about 3.1% mail-in ballots were rejected in Georgia in 2018 (see Table 2), and about 6.4% were rejected in 2016 (see Table 2). Most ballots are rejected because they arrive late, and rejections for signature issues are just a fraction of the overall rejection totals.", "Trump falsely claimed that Republican poll watchers in Fulton County were told to leave “under the false pretense of a pipe burst … which we now know was a total lie. Then election officials pull boxes, Democrats and suitcases of ballots out from under a table. You all saw it on television, totally fraudulent. And illegally scanned them for nearly two hours totally unsupervised.”", "As the Atlanta Journal-Constitution reported on Nov. 3, a water leak at State Farm Arena in Atlanta, which served as a ballot processing site, caused a several hours delay in vote-counting on Election Day. The leak occurred at 6:07 a.m., according to the arena, and it was fixed within two hours.", "Later that night, election workers thought they’d be knocking off for the night, and began putting uncounted ballots in storage boxes with numbered seals, per policy, Sterling explained in a Jan. 4 press conference. At that point, poll watchers left, though no one told them to, Frances Watson, chief investigator for the Georgia secretary of state, later said. Affidavits from two Republican field organizers who were in the room did not claim they were instructed or forced to leave because of the leak, as Trump said; they instead said they were under the impression counting had ceased.", "But Raffensperger directed election officials to continue working through the night.", "As for the “suitcases” of “fraudulent” ballots pulled from under a table, the secretary of state’s office publicly posted video of the entire thing. According to Sterling, it shows nothing more than the legitimate counting of votes that had been boxed up only an hour before.", "“And this is what is really frustrating: The president’s legal team had the entire tape, they watched the entire tape, and then, from our point of view, intentionally misled the state Senate, voters, and the people of the United States about this,” Sterling said on Jan. 4. “It was intentional, it was obvious, and anybody watching this knows that.”", "Update, Aug. 1, 2023: On June 20, the Georgia secretary of state’s office released an investigative report concluding that there was “no evidence” of any fraud regarding the claim that “suitcases” of illegal ballots were counted on election night. Investigators from the FBI, Georgia Bureau of Investigation and the secretary of state’s office interviewed Fulton County election workers and reviewed “the entire unedited security video footage of the events in question” in response to a complaint referred by a state senator and specifically naming two election night workers in the video, Ruby Freeman and her daughter, Wandrea “Shaye” Moss.", "“There was no evidence of any type of fraud as alleged. … All allegations made against Freeman and Moss were unsubstantiated and found to have no merit,” the report, dated March 7, concluded.", "In congressional testimony, the two women described how they had been harassed and received death threats after members of the Trump campaign and others pushed false claims that they had engaged in voter fraud. Freeman and Moss filed a defamation suit against One America News Network and Trump lawyer Rudy Giuliani.", "OANN settled the suit in May. A July 25 court filing by Giuliani said he “does not contest” that statements he made about the women were false, but he argues the statements were “constitutionally protected” speech. A political adviser to Giuliani told news organizations that Giuliani “did not acknowledge that the statements were false but did not contest it in order to move on to the portion of the case that will permit a motion to dismiss.”", "Trump falsely claimed that “66,000 votes in Georgia were cast by individuals under the legal voting age.”", "“The actual number is zero,” Sterling explained at a press conference on Jan. 4. “And the reason we know that is because the dates are on the voter registration. There are four cases, four, where people requested their absentee ballot before they turned 18 but they turned 18 by the Election Day. That means that is a legally cast ballot.”", "In a tweet sent just hours before his speech, Trump wrongly claimed Georgia “just happened to find 50,000 ballots late last night” in the Georgia Senate run-off election, but Sterling said they were just routine absentee ballots being counted as a matter of course.", "Trump claimed the ballots were evidence that “Our Election Process is worse than that of third world countries!”", "They just happened to find 50,000 ballots late last night. The USA is embarrassed by fools. Our Election Process is worse than that of third world countries!", "— Donald J. Trump (@realDonaldTrump) January 6, 2021", "Less than an hour after Trump posted his tweet, Sterling responded on Twitter, explaining that there were no “found” ballots, only absentee ballots received the day of the election.", "No Mr. President, there weren’t “found” ballots. We have known the number of advanced votes since this weekend. We saw record Election Day turnout. As of Monday 970,000 absentees had been accepted. 31k more were added in yesterday’s totals. That leaves 60k that came in yesterday. https://t.co/vMVMEooZUQ", "— Gabriel Sterling (@GabrielSterling) January 6, 2021", "In a press conference later in the morning, Sterling said there was “no evidence of any irregularities. The biggest thing we’ve seen is from the president’s fertile mind of finding fraud where none exists.”", "Sterling said election officials have known since last week that there were going to be over 2 million votes in “the advanced bucket” — votes via absentee ballots and early voting.", "“The president continues to say, ‘Oh, they’re finding ballots. These were advanced, came out of nowhere.’ No, we have known that DeKalb County had 171,000 ballots since Friday evening, Saturday morning,” Sterling said. “So the statements he keeps on putting out there are incorrect and they undermine people’s faith in the election process.”", "Trump claimed, “In the state of Arizona, over 36,000 ballots were illegally cast by noncitizens.” There’s no evidence that happened.", "C. Murphy Hebert, a spokeswoman for the Arizona secretary of state, told us the president’s claim is false. “You must be a citizen to vote in an election in Arizona, so that number appears to be completely fabricated,” she wrote in an email.", "According to the Arizona secretary of state’s website, an applicant who provides valid proof of citizenship with his or her voter registration form “is entitled to vote in all federal, state, county and local elections in which he or she is eligible.” While it is not required that individuals submit proof of citizenship with their applications, those who don’t “will only be eligible to vote in federal elections (known as being a ‘federal only’ voter.)”", "In a late November meeting with Trump campaign attorney Rudy Giuliani and other state lawmakers, Arizona state Rep. Kelly Townsend, a Republican, said (starting at the 2:00 mark) there were about 36,000 people in Arizona who haven’t verified their citizenship and “could potentially vote.”", "So Trump may have been distorting what Townsend told Giuliani. But Hebert told us it is wrong to assume that “federal only” voters are not U.S. citizens.", "“These voters are registered to vote in accordance with federal voting rights laws, attesting to their eligibility, including their citizenship, under penalty of perjury,” she said. “It is flat out wrong to say that they are not legal voters.”", "Hebert said there are actually about 23,000 voters in Arizona who qualify for a federal-only ballot.", "Trump claimed in Arizona “11,600 more ballots and votes were counted … than there were actual voters.” That’s false.", "For the 2020 general election, Arizona’s state certified election results show 3,420,565 ballots cast and 4,281,301 voter registrations. That’s an eligible voter turnout of almost 80%.", "Trump claimed that “150,000 people” registered in Maricopa County, Arizona, “after the registration deadline.” That’s wrong.", "Because of a lawsuit filed by progressive advocacy groups, the deadline to register to vote in Arizona’s general election was extended from Oct. 5 until Oct. 15. During that period, however, fewer than 20,000 additional voters were registered in Maricopa County.", "The public information officer for the Maricopa County Recorder’s Office, Diana Solorio, told us 17,407 people registered to vote in the county between Oct. 6 and Oct. 15. Of those people, 5,191 were registered Republicans, 4,245 were registered Democrats, 263 were registered Libertarians and 7,708 were not registered with a party.", "Solorio said she had no idea where the president got the 150,000 figure.", "In fact, in mid-October, the Arizona Republic, based on estimates from the state’s secretary of state’s office, reported that “more than 35,000 people” all across the state “signed up to vote during a 10-day extension of Arizona’s voter registration deadline.” Again, more registered Republicans (10,922) than registered Democrats (8,292) signed up to vote in that time.", "Editor’s note: FactCheck.org does not accept advertising. We rely on grants and individual donations from people like you. Please consider a donation. Credit card donations may be made through our “Donate” page. If you prefer to give by check, send to: FactCheck.org, Annenberg Public Policy Center, 202 S. 36th St., Philadelphia, PA 19104.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here for more.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]