["The article, which we've archived here but has since been taken offline, claimed that the Kenyan government planned to spend 10 million Kenyan shillings (equivalent to nearly 90,000 euros) to transport the bird’s carcass back to Finland.", "It has received more than 5,000 interactions in total on social media, according to the monitoring platform Crowdtangle. It was shared on multiple Facebook pages, some of which have hundreds of thousands of followers.", "In an official statement released on January 23, 2020, the Kenya Wildlife Service confirmed that it had rescued an Osprey bird that had migrated from Helsinki, Finland to Siaya County, located in southwestern Kenya. A reference ring on the bird’s leg indicated its provenance.", "Rare migratory bird lands in Kenya from Finland. pic.twitter.com/9TxjcnQiL8", "After it died a few days later, the state wildlife organisation released another statement on January 27, 2020. The Kenya Wildlife Service described the bird’s cause of death as “long term starvation which precipitated systemic organs failure”.", "pic.twitter.com/jOaz3SQOwn", "The misleading article about the bird’s burial was also shared multiple times on Twitter here, here and here.", "In the comments, some online users expressed disbelief that the government could allocate a huge amount of money for such a purpose, while others wondered why the carcass could not be disposed of in Kenya. But some dismissed the claim as false.", "Paul Udoto, a communication official at the Kenya Wildlife Service, told AFP that the claims were inaccurate, explaining that the carcass was disposed of in Nairobi on January 26, 2020, and that the Finnish authorities had been informed.", "“Fake news. Carcass already disposed of. Information shared with the Finnish authorities. It was disposed of on Sunday in Nairobi by the KWS veterinarians and the Raptor Rehabilitation Centre experts,” Udoto told AFP via a Twitter message.", "Udoto was among the online users who shared the misleading article. When asked why he did so, he replied: “for fun to show how creative Kenyans are [at] creating false narratives”.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]