["About this rating", "On Dec. 17, 2020, a message circulated on social media supposedly announcing an event hosted by U.S. President Donald Trump in Palm Beach, Florida, on Jan. 20, 2021 — the day of President-elect Joe Biden's swearing-in ceremony — and continuing Trump's misinformation campaign around election results.", "The statement, which included a mass heading like that of official messages from the Trump campaign and was allegedly authored by Bill Stepien, Trump's campaign manager, alleged that Trump was not only preparing to bypass Biden's presidential inauguration in Washington D.C., but that he was planning to host an alternative inaugural event with supporters at his Mar-a-Lago resort on the same day.", "The viral message read:", "[Winner] of the 2020 U.S. Presidential Election, Donald J. Trump, and his Administration look forward to the January 20th Inauguration of their continuation of power and Second Term! [...]", "We look forward to celebrating this occasion with all Americans! Regardless of the intentions of so-called President Elect Joe Biden, President Donald Trump will not be conceding the 2020 election, nor does he plan on leaving the White house at point prior to January 20th. Any attempt to remove the Trump administration will require force. We will not back down from this fight. Americans deserve better.", "Despite the fact that Trump indeed had not conceded loss to Biden, the message announcing the Florida event was fake.", "If the sitting president was indeed planning any kind of celebration at the resort, the campaign would have advertised it in messages to supporters, given its history of communicating similar announcements. But as of the original publication of this report, a Dec. 15 news release titled, \"Trump campaign statement on Joe Biden visit to Georgia\" was the most recent official message from the political operation, and nothing on the campaign's website announced an event on Inauguration Day.", "Additionally, no Trump campaign fundraising emails obtained by Snopes included the above-transcribed message, and no one within the president's inner circle — nor the president himself — had advertised the alleged celebration in public remarks or on social media.", "In fact, White House Press Secretary Kayleigh McEnany on several occasions declined to discuss Trump's plans for Inauguration Day, eliminating any possibility that she at one point promoted a Jan. 20 event described in the social media posts.", "“He knows what his decision is, and he’ll make his decision at the right time,” she said at Dec. 2 press conference, a comment that neither confirmed nor denied rumors in news reports holding that Trump would skip Biden's inauguration for a Florida event.", "Snopes reached out to the White House and Trump campaign directly, asking for its response to the rumor about Trump hosting a so-called inauguration event on the day that typically serves to signal a peaceful transfer of power between outgoing and incoming presidents. We have not heard back, and we will update this post when or if we do.", "In sum, given there's no official record of the above-displayed message from the Trump campaign, as well as the fact that no White House source has confirmed the message or its contents as authentic, we rate this claim \"False.\"", "Jessica Lee is Snopes' Senior Assignments Editor with expertise in investigative storytelling, media literacy advocacy and digital audience engagement.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]