["By Jessica McDonald", "Posted on July 24, 2020", "In promoting the reopening of schools this fall, Trump administration officials have, at times, inaccurately described the evidence on how COVID-19 affects children:", "For weeks, President Donald Trump has pushed for schools to return to in-person instruction, even threatening to withhold funding if schools choose to stay closed.", "“In Germany, Denmark, Norway, Sweden and many other countries, SCHOOLS ARE OPEN WITH NO PROBLEMS,” Trump wrote in a July 8 tweet. “The Dems think it would be bad for them politically if U.S. schools open before the November Election, but is important for the children & families. May cut off funding if not open!”", "But experts say questions remain about how frequently kids transmit the coronavirus to others. And the countries where children have returned to classrooms did so with much less ongoing community transmission than many places in the U.S. now have.", "“We have some evidence that children, especially younger children, may spread the virus less than adults,” Jennifer Nuzzo, a senior scholar at the Johns Hopkins Center for Health Security, told us, noting that this makes COVID-19 quite different from influenza, which kids are notorious for spreading.", "But, she added, many of the transmission studies include children who were more sheltered than usual. “So there are lingering questions about how much reconvening schools would increase transmission within the community and, perhaps more worryingly, to school teachers and staff who may be more inclined to develop severe disease,” she said.", "We’ll review the existing evidence on how often children pick up the infection, get seriously ill and spread the virus, and share examples from other countries that may or may not be a preview of what’s to come.", "While less is known about infection and transmission, the evidence is very consistent that children are at extremely low risk of becoming seriously ill or dying from COVID-19.", "Between Jan. 22 and May 30, the Centers for Disease Control and Prevention recorded only 13 deaths in children ages 0 to 9, out of more than 20,000 confirmed cases, and 33 deaths among those ages 10 to 19, out of more than 49,000 cases (see Table 3). That works out to a case fatality rate of around 0.06% to 0.07%, much lower than the case fatality rate for all ages of 5.4%.", "According to the same data, kids were also significantly less likely to be hospitalized or admitted to intensive care units compared with adults. Only 848, or 4.1%, of children age 9 or younger were hospitalized, and 141, or 0.7%, were admitted to the ICU, with even lower figures for older kids between the ages of 10 and 19. In comparison, more than a fifth of patients between the ages of 60 and 69 were hospitalized, and 4.1% were admitted to the ICU.", "These figures likely overstate the true percentage of children who are infected who go on to become hospitalized or die, since many mild or asymptomatic infections in children may have been missed.", "As of July 22, provisional CDC data list 11 deaths for babies below the age of 1 involving COVID-19, nine deaths between the ages of 1 and 4, and 16 between the ages of 5 and 14.", "State data available from the American Academy of Pediatrics also shows that for New York City and the 20 states with hospitalization data, between 0.6% and 9.1% of all pediatric cases resulted in hospitalization, as of July 9. And for New York City and the 43 states with mortality data, between 0% and 0.2% of kids with COVID-19 died, with 24 states reporting no deaths in children.", "It’s nevertheless important to acknowledge that the risk of COVID-19 to children is not zero.", "“It is not nil, but it is low,” said William Hanage, an epidemiologist at the Harvard T.H. Chan School of Public Health, of the risk of death to kids and teens in a press call. “No age group gets out of this without risk.”", "Hanage added that as with adults, some children might experience long-term or chronic effects of COVID-19 infection. “We can expect to see some of those consequences in the health of children going forward,” he said, even if the overall risk of death to children is “extremely low.”", "One worrisome but rare manifestation linked to COVID-19 is a condition called multisystem inflammatory syndrome in children, or MIS-C, which involves dangerous inflammation of various organs and typically develops two to four weeks after a child is infected with the coronavirus.", "MIS-C patients frequently have a fever and other symptoms, such as gut pain, vomiting, diarrhea, a skin rash and fatigue. In a study published in the New England Journal of Medicine, of 186 children with MIS-C, 80% were admitted to the ICU and 2% died.", "As of July 15, the CDC is aware of 342 MIS-C cases and six deaths in the U.S., with most cases occurring in kids between the ages of 1 and 14 and in Black or Latino children.", "It’s good that the risk of COVID-19 to children themselves is low, but schools employ adult staff and teachers, around a quarter of whom are older or have health conditions that put them at greater risk of COVID-19, according to an estimate by the Kaiser Family Foundation. And some children live in households with grandparents or other higher-risk relatives as well.", "Thus, two key questions are: How susceptible are children to becoming infected with the coronavirus? And how likely are they to transmit the virus on to others? The answers are still uncertain.", "According to a July report by the National Academies of the Sciences, there is “insufficient evidence with which to determine how easily children and youth contract the virus and how contagious they are once they do.”", "Still, there are hints that children may do better than adults on both fronts.", "“Almost all the studies that we have about the role of children in transmission suffer from biases of one kind or another,” said Hanage. “However, it is plausible to think, taking a read of all of them together, that younger children are somewhat less likely to become infected. And maybe a little less likely to transmit. Older children behave much more like adults.”", "As noted in a May report from Johns Hopkins University, several studies have found that children, particularly younger kids, were less likely to test positive for COVID-19. A survey in Iceland, for example, found that 6.7% of kids ages 0 to 9 who were at higher risk of infection tested positive, compared with 13.7% of people 10 years of age and older. And in a population-wide sampling, zero of 848 children ages 0 to 9 turned up positive, versus 0.8% of those 10 years of age or older.", "Other studies looking at what happens within households have largely found kids are less likely to catch the coronavirus, but they have not always been consistent. In one analysis of household contacts of COVID-19 patients near Wuhan, China, only 4% of pediatric contacts tested positive for COVID-19, while 17.1% of adult contacts did. In another study of nearly 1,300 contacts in Shenzhen, China, children were equally likely as adults to become infected.", "On transmission, there are signs that kids might be less efficient spreaders of SARS-CoV-2, although that conclusion is still tentative.", "A study in the Netherlands found no instances of a child under the age of 12 serving as the source of infection among 54 households, and a survey of familial clusters in Switzerland identified only three cases, out of 39, in which the child developed symptoms first and may have been the source of the virus.", "Schoolchildren infected with COVID-19 in the early days of the pandemic also appear to have only rarely spread the virus to others. In France, scientists identified no secondary cases as a result of three probable infections in students before schools closed, and a nine-year-old boy in the French Alps who went skiing and visited three schools while infected also failed to pass the virus on. In Australia, officials found only two possible secondary infections after tracing nearly 900 contacts of 18 infected students and staff members.", "“Household studies have typically found that children are rarely infected and rarely transmit,” said Hanage. But, he cautioned, “those household studies all suffer from bias, which is that they start by identifying a person who was infected. And then, testing the people around them.”", "Because kids are much less likely to have severe disease, or even noticeable symptoms at all, he said, that means adults are more likely to be identified as the first, or index, case.", "On top of that, Hanage said, in many cases schools are closed and parents have been sequestering children, “so we’re not seeing the types of interactions that we might expect if schools are opened.”", "One large contact tracing study out of South Korea, published on July 16, found that kids 9 years old and younger were less likely to transmit the virus within households than older children, but were similar to adults ages 20-39. Older children, surprisingly, had the highest percentage of household contacts test positive for COVID-19 out of all the age groups.", "For contacts outside the home, younger and older children appeared to transmit the disease about as frequently as adults ages 20-39, but less frequently than adults above 40.", "But as with other studies, the scientists could not say for certain whom the index patients were, and the study took place when schools were largely shuttered. The researchers also only traced contacts of children who fell ill, leaving open the question of how frequently asymptomatic children transmit the virus.", "A. Marm Kilpatrick, a professor at the University of California, Santa Cruz who studies infectious disease dynamics, said in a Twitter thread that he didn’t think it was “safe” to conclude that children don’t transmit the same as adults, given the low number of cases and the wide confidence intervals in the study.", "Interestingly, when the amount of virus is measured in infected children, it comes back just as high in kids as in adults, suggesting that children could in theory be equally contagious. A person’s viral load, however, may not necessarily track with how well they transmit the virus.", "If it is the case that kids do transmit the virus less than adults, there are several theories for why that might be. One hypothesis is that children, by virtue of being less symptomatic or by being smaller, might spew fewer infectious particles into the air.", "Scientists have also suggested that children may not contract the virus as easily because they don’t make as much ACE2, the protein receptor that SARS-CoV-2 uses to enter cells. One investigation of nasal tissue found that young children have less of the receptor than older children, who in turn have less than adults.", "Encouragingly, numerous other countries, including Japan, South Korea, Germany, Finland, France, Denmark, Austria and Norway, have successfully reopened their schools using a variety of mitigation tactics, and have not observed subsequent outbreaks.", "Experts, however, caution that those results may not apply to the U.S.", "“Those are also regions that had much lower community transmission on the date that they reopened,” said Anita Cicero, deputy director of the Johns Hopkins Center for Health Security, in a July 16 press call dedicated to the subject of school reopenings.", "“So for instance, in Japan, South Korea and Finland and France, each of those countries had about 1 or fewer cases per 100,000 people when they reopened,” she said. “In contrast, there are U.S. counties now reporting 60 cases per 100,000; others have 80 cases or more.”", "“In communities where the case numbers are rapidly increasing, it may not be possible to safely reopen schools until disease transmission has lowered,” said Johns Hopkins’ Nuzzo in the same briefing. “But in communities where disease rates are declining or stable, it may be possible to think about reopening schools, provided schools are able to put in place measures to reduce the likelihood of transmission.”", "While there is little data on the most effective strategies, experts recommend physical distancing, mask wearing, hand hygiene and keeping kids in smaller group “bubbles” to reduce the number of contacts children and teachers have.", "A counter example comes from a high school in Israel, which experienced a large outbreak of COVID-19 after reopening. While it is impossible to know for sure that the outbreak was due to the school — as Nuzzo noted, restrictions were also lifted on the broader community — the timing is suspicious. Researchers also suspect a heat wave may have played a role, triggering the school to use continuous air conditioning and exempt students from wearing face masks.", "“Increasing transmission in the surrounding community because of large public gatherings and then lifting precautions in the schools have ultimately contributed to numbers of infections within schools and led Israel to close schools again,” said Nuzzo.", "The issue of community transmission is one that other groups and experts have highlighted.", "“The fact remains that when community transmission exists and when community transmission is intense, children will be exposed to that virus and children will be part of the transmission cycle,” said Dr. Mike Ryan, executive director of the World Health Organization’s health emergencies programme, in a July 13 press briefing. “They will be exposed; some will be infected and they may infect others. What we don’t fully understand is the impact on those children in the long term. We know in the short term they tend to have milder infections. We don’t know the impact in the long term and we don’t know to what extent they pass that infection on and infect others, but we do know that that can happen.”", "The American Academy of Pediatrics has emphasized the need for children to return to school, arguing that the benefits outweigh the risks, while also acknowledging that local transmission should be considered when making decisions on reopening schools.", "According to Nuzzo, there isn’t necessarily a specific cutoff number school administrators should use to know whether they should reopen, but a stable or downward trend in cases is a good place to start, as well as consideration of a community’s ability to respond to an outbreak.", "“If there’s sufficient capacity to test and to isolate anybody who’s sick and to conduct contact tracing,” she said in the school press briefing, “that’s obviously a much more reassuring situation than in communities where those resources are constrained.”", "The University of Minnesota’s Michael Osterholm, who directs the school’s Center for Infectious Disease Research and Policy, suggested in a July 23 podcast that schools aim for 5 cases or fewer per 100,000 people, along with decreasing numbers of new cases for the past 14 days and area hospitals maintaining at least a quarter of their capacity to handle COVID-19 patients.", "More research, experts say, is urgently needed to better understand the risks so those can be balanced against the benefits to children and parents.", "As Cicero noted, if it becomes more clear that children very rarely transmit COVID-19 to adult school staff and family members, “then schools would have a very different set of policies and less extensive mitigation measures that they would need to put in place.”", "For now, however, she said schools need additional funding to follow CDC guidance and should consider postponing reopening in areas with high community transmission. Schools, too, may find that hybrid in-person and online programs work best to keep class sizes low and higher-risk individuals at home.", "“We really need to be doing all we can to drive those numbers down so that we can return children to school buildings,” she said. “This should be a national priority, and it’s measurably more important than reopening bars and restaurants.”", "— with reporting from Lori Robertson", "Editor’s note: FactCheck.org does not accept advertising. We rely on grants and individual donations from people like you. Please consider a donation. Credit card donations may be made through our “Donate” page. If you prefer to give by check, send to: FactCheck.org, Annenberg Public Policy Center, 202 S. 36th St., Philadelphia, PA 19104.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]