["A video of a gathering where people can be heard reciting Islamic verses is being shared on social media. Facebook user Imtiyaz Khan posted the video with the claim, “China Me ( 20 ) Lakh Se Zyada Log Islam Qubool Kiya Yeh Dekh Kar Ke > Corona Virus Ek Bhi Musalman Ko Effect Nahi Kiya Yeh Samajhne Ke Baad Wahan Logon Me ibrath Haasil Huwa = ALLAHU AKBAR”. According to the claim, more than 20 lakh people have accepted Islam after they realised that no Muslim has been infected with novel coronavirus so far.", "China Me ( 20 ) Lakh Se Zyada Log Islam Qubool Kiya Yeh Dekh Kar Ke > Corona Virus Ek Bhi Musalman Ko Effect Nahi Kiya Yeh Samajhne Ke Baad Wahan Logon Me ibrath Haasil Huwa = ALLAHU AKBAR", "Posted by Imtiyaz Khan on Monday, 9 March 2020", "Several other people on Facebook and Twitter shared the video with the same narrative.", "We have received several requests on our official app to fact-check this video.", "Alt News found that the video is close to one year old and unrelated to the coronavirus epidemic. It was posted by a Facebook page on June 3, 2019. “Welcome to our brothers in faith”, said the caption posted along with the video. At 5 seconds in the video, the people can be heard reciting the Shahadah, a statement of faith that affirms, “I witness that there is no god but God and Mohammed is his messenger”. These people are reciting the verse in Arabic.", "ALHAMDULILLAH WELCOME TO OUR BROTHERS IN FAITH", "Posted by സലീം പോത്തനൂർ on Monday, 3 June 2019", "Moreover, AFP found a Facebook post by one Ahmad Eradino who posted the pictures of the same event on June 11, 2019.", "The Arabic text inscribed on the banner in the photos reads, “Iftar project in the industrial city of Jeddah (KSA)”. Jeddah is a city located in Saudia Arabia. KSA stands for Kingdom of Saudia Arabia. Iftar is the scared sunset meal Muslims take to break the daily fast of Ramadan. We found several tweets with keywords Jeddah and Iftar on the same day in June 2019. This further corroborated that Iftar was celebrated in Jeddah, KSA on June 3, 2019.", "Thus, a 2019 video of Iftar in Saudi Arabia was shared by social media users to claim that more than 20 lakh people converted to Islam after it was found that no Muslims are infected with the coronavirus. Moreover, we found no reports in the media of a mass religious conversion programme to Islam as claimed on social media.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]