["About this rating", "A gunman shot and wounded two Los Angeles County sheriff's deputies on Sept. 12, 2020. After the shooting, a handful of protesters engaged law enforcement officers standing guard outside the hospital where the injured deputies were receiving medical help.", "No evidence connected the shooting — or the suspected gunman — to the BLM movement. Also, the founder of an L.A.-based Black rights group took credit for the hospital protest in a Facebook post that explicitly said the group \"is not BLM.\"", "While the sheriff's department said protesters at one point blocked entrances and exits at the hospital, no videos or photos confirmed that was the case.", "During America's growing political divide over policing, a video surfaced online in September 2020 showing a gunman shooting two Los Angeles County sheriff's deputies in the head as they sat in a squad car.", "Numerous viewers of the seven-second clip believed the apparent ambush — which sent the deputies to the hospital in critical condition — was a result of the momentum among civil rights activists to eliminate unjust killings of Black Americans by authorities, also known as the Black Lives Matter (BLM) movement, as well as supporters of it. Sharing the video with her roughly 2.6 million followers, for example, conservative provocateur Candace Owens wrote on Twitter:", "\"Why else does this [shooting of deputies] happen? ... BLACK LIVES MATTER AND THE COMPLICIT MEDIA ORGANIZATIONS, ATHLETES, AND ENTERTAINERS ARE TO BLAME.\"", "Below, we unpack that claim — which is ultimately a product of an expansive fear-mongering campaign by deceptive media sources to paint the BLM movement as a social force that doesn't match reality.", "Additionally, hours after the Compton shooting, another layer to the controversy emerged: Reports on social media alleged BLM protesters taunted law enforcement officers standing guard outside the hospital where the deputies were receiving medical treatment, and blocked emergency access to the facility:", "The Epoch Times, a media outlet laden with misinformation that has effectively served to help U.S. President Donald Trump's political agenda since 2016, claimed:", "\"Black Lives Matter protesters blocked a hospital entrance in Los Angeles on Saturday night and yelled, 'we hope they die,' hours after a man shot two county deputies in an ambush.\"", "Based on our analysis of videos of the shooting and protests, as well as first-person accounts and news reports, these assertions were a blend of fact and distortions of reality — presented in memes such as the one displayed below that aimed to dissuade people against supporting the NFL because of its alleged support for protesters who gathered outside the hospital:", "While some football players were indeed supporters or leaders of the BLM movement, no evidence linked them or the league with the events in Los Angeles. Any social media post that claimed \"the NFL will honor and praise the organization that stood out outside [the] hospital chanting\" was at best a misleading attempting to connect dots that didn't exist. At worst, it was a purposeful attempt to discredit an initiative by the NFL to recognize systemic racism by erroneously linking it to the gathering outside the California medical facility.", "This information is undeniably true: Two deputies, a 31-year-old female and 24-year-old male, were shot at close range while sitting in a patrol car near the Compton sheriff's station south of downtown Los Angeles on Sept. 12 around 7 p.m.", "Los Angeles County Sheriff Alex Villanueva told reporters the female deputy was a mother of a 6-year-old boy — like the meme about the NFL suggested — and that both deputies graduated law enforcement training in the same class, just 14 months prior to the shooting.", "The department released the above-mentioned footage that went viral and apparently depicted the incident. The video showed a gunman wearing dark clothing casually approaching the passenger side of the squad car, raising his gun inches from the window, firing several rounds and then running away.", "\"The gunman walked up on the deputies and opened fire without warning or provocation,\" the department tweeted.", "An extended version of the surveillance video obtained by The Los Angeles Times showed the shooter fleeing in the direction from which he came and running past someone nearby on a sidewalk, although it was unclear if, or to what extent, that person was involved in the surprise attack.", "Meanwhile, an Instagram video by an apparent witness to the shooting showed the squad car from the front, several people walking on a nearby sidewalk with their phones out, and emergency vehicles arriving to help the wounded deputies. The narrator in that video said:", "Two sheriffs shot in the face, they tripping. It's going up in Compton. [Expletive] just bust on the police. [...] Somebody ran up on the car and busted on their ass, right through the window, in their face and all.", "Many who shared the footage assumed the narrator was an \"activist\" and took him to be wrongfully celebrating the shooting. \"These 'activists' are celebrating the attempted executions of two police officers in Compton,\" one person tweeted:", "The Instagram account on which that video originated was deleted after conservatives circulated it widely — leveraging it for their political message — so we have no evidence to verify its legitimacy. We also have no evidence to confirm or disprove the claim that the narrator is an \"activist\" or in any way associated with the BLM movement.", "Moments after the gunfire, medics took the deputies — whom the department had not identified as of this writing — to the St. Francis Medical Center, where they underwent surgery. The following day, the hospital listed them in stable condition, and they were expected to recover from multiple gunshot wounds.", "Both Trump and the Democratic presidential nominee Joe Biden were quick to condemn the shooting of law enforcement, though their messages varied. Biden said:", "Trump, meanwhile, retweeted the sheriff's department's video of the shooting, with the comment: \"Animals that must be hit hard!\" Later, he added:", "Critical to the rumors aiming to spear the BLM movement was this: The intentions of the gunman were unknown, as of this report. No one had come forward to explain the shooter's motivations behind the attack, nor his whereabouts.", "On Sept. 14, the sheriff's department announced a $175,000 reward for information to answer such questions leading to an arrest. In regards to the deputies' relationship with the suspect — whom the department described as a Black man between the ages of 28 and 30 years old — the sheriff told reporters: \"To my knowledge, they had no knowledge of this individual. No provocation. No conflict. Nothing. It was just cold blooded ambush.\"", "In other words, very few details were known about the suspect, and the shooting appeared to be random, per Villanueva.", "That meant any assumption about the gunman's social or political affiliations would breach verified fact, as well as any assertion that those alleged beliefs drove the gunman to open fire on the deputies.", "That is all to say, no evidence connected the shooting — or the suspected gunman — to any organization or cause, including the BLM movement like some viral posts claimed.", "In fact, leaders within the movement sought to distance themselves from the spontaneous violence. For example, civil rights attorney Ben Crump, who is representing several high-profile cases alleging wrongful use of force by police against Black Americans that have sparked BLM protests across the country — including the family of a man fatally shot by the LA sheriff's department — tweeted:", "\"We WILL hold [the sheriff's department] accountable for systemic brutality. But violence — including the shooting of two deputies in LA — is NOT the answer. I urge anyone with info about this incident should come forward.\"", "In the hours after the shooting, roughly five protesters gathered outside the hospital where the deputies were being treated, and law enforcement officers created a barricade there to supposedly keep the protesters from entering the facility.", "We uncovered these facts about the scene, primarily based on video evidence:", "During the ordeal, the sheriff's office said on Twitter protesters were \"blocking the entrance & exit of the hospital emergency room,\" and one witness told a local news station that some protesters tried to get inside the facility, though no visual evidence confirmed that was indeed the case.", "Rather, video footage showed a handful of deputies standing in a driveway (apparently an entrance to the hospital's emergency room), while the small group of protesters paced up and down a sidewalk feet away from them.", "At one point, deputies detained a journalist with LA's NPR station, KPCC, who was reporting on the small protest, as well as a male protester who \"refused to comply\" with deputies' demands to leave the area.", "The sheriff's department said the reporter, Josie Huang, ignored deputies' repeated commands and did not present \"proper\" press credentials. But she said and videos of her arrest show she didn't have time or space to react to deputies orders before they shoved her and forcefully took her into custody. In one video, she can be heard shouting “I’m a reporter... I’m with KPCC” as officers push her to the ground. They cited her with obstructing justice, though KPCC is urging authorities to drop the charge.", "In a Facebook video posted Sept. 13, Kevin Wharton Price, a founder of an LA-based Black rights group called the Africa Town Coalition, identified himself as the protester whom deputies arrested — as well as an organizer of the small gathering outside the hospital.", "He said he and three other people went to the facility to call attention to an alleged gang of deputies within the sheriff's department that control aspects of the agency, as well as the series of senseless killings of Black people by authorities over the years. And while BLM and Africa Town Coalition share some similar goals, such as empowering Black Americans, he said they have separate ideologies, and the latter group should not be conflated with the former. Price said:", "\"Africa Town came with four people that night. Four people. That was it. ...We are not Black Lives Matter. [...] We have our own political agenda.\"", "In addition, he said the rumor that protesters were trying to break into the hospital was false. He said:", "In the news and some white supremacists are saying that there were Black Lives Matter protesters out there, trying to block the driveway of the hospital, the emergency hospital area, and allegedly trying to force their way in to the emergency room. [...] We did not go to force our way in to anywhere. We went out there to deliver a message to these gang-banging sheriff's department that we're not going to shed a tear because two of your gang-banging sheriffs got shot in the head.", "In sum, a group that is not BLM organized the small protest outside the hospital where two deputies received treatment for gunshot wounds, and tried to provoke law enforcement officers standing guard there. No visual evidence confirmed those protesters blocked an emergency access to the facility, though the sheriff's department reported that was the case. Also, no evidence linked the suspect in the supposed ambush of deputies to the BLM movement, as of this writing. For those reasons, we rate this claim as \"Mostly false.\"", "Waller, Allyson, and Fazio, Marie.   \"California Deputies Shot in Ambush Are Expected to Recover, Authorities Say.\"\r\n   The New York Times.   14 September 2020.", "Rector, Kevin.   \"Shooting of L.A. Deputies New Flashpoint in a 'Tinderbox Moment.'\r\n   Los Angeles Times.   14 September 2020.", "Granda, Carlos, and Bartley, Lisa.   \"LASD 'Executioners': Compton Mayer Says Deputies Have 'Terrorized the Community for Decades.'\r\n   ABC7.   5 August 2020.", "Yan, Holly.   \"$100,000 Reward Offered in Search for Gunman Who Ambushed and Shot LA County Deputies in Compton.\"\r\n   CNN.   14 September 2020.", "Rantz, Jason.   \"Before Compton Ambush, Mobs Spent Summer Trying To Murder Cops | Opinion.\"\r\n   Newsweek.   14 September 2020.", "Black Lives Matter.   \"About.\"\r\n   Accessed 14 September 2020.", "Pagones, Stephanie.   \"Compton Ambush: $100G Reward Offered for Information on Gunman as Manhunt for Suspect Continues.\"\r\n   FoxNews.   14 September 2020.", "Tchekmedyian, Alene, et. al.   \"Two L.A. County sheriff's Deputies Expected To Survive Attack Amid Intense Manhunt For Shooter.\"\r\n   Los Angeles Times.   13 September 2020.", "ABC6.   \"Protesters Outside Hospital Shouted 'We Home They Die' About Deputies Shot, Sheriff's Department Says.\"\r\n   14 September 2020.", "Weber, Christopher.   \"Gunman South After California Deputies Shot in Patrol Car.\"\r\n   The Associated Press.   14 September 2020.", "Webster Jr., Ken.   \"BLM Activists Show Up At LA Hospital To Protest Police Who Were Just Shot.\"\r\n   KPRC.   14 September 2020.", "Green, Miranda, et. al.   \"Trump and Biden Condemn Shooting of Los Angeles County Sheriff's Deputies.\"\r\n   The Washington Post.   13 September 2020.", "Nelson, Joshua.   \"Protesters Blocking Ambushed LA Deputies' Hospital Is 'New Low,' Shows 'Lack of Humanity': Police Chiefs.\"\r\n   FoxNews.   14 September 2020.", "Staff and wire reports.   \"Reward Offered in Search For Gunman Who Shot LA Deputies Climbs To $175.\"\r\n   NBC4.   14 September 2020.", "Schwartz, Matthew.   \"KPCC Journalist Tackled, Arrested While Trying To Cover L.A. Protest.\"\r\n   NPR.  13 September 2020.", "Jessica Lee is Snopes' Senior Assignments Editor with expertise in investigative storytelling, media literacy advocacy and digital audience engagement.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]