["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Sen. Lindsey Graham didn’t say that President Trump probably knows more about medicine and viruses than medical professionals.", "The quote was fabricated by a Twitter account that has posted fake statements in the past.", "A popular tweet alleges that Republican Sen. Lindsey Graham suggested President Donald Trump \"probably\" knows more about medicine and viruses than the NIH and the CDC.", "The tweet, which has been deleted, is circulating on other social media platforms and reads:", "\"CAPITOL HILL: @LindseyGrahamSC says @realDonaldTrump \"probably knows more about medicine and specifically viruses than any of the so-called scientists at the NIH and CDC. If anyone is going to eradicate this plague it'll be the president.\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "This is not a genuine quote by Graham. No credible news reports have published the statement, and we couldn’t find it on any of the senator’ s social media pages.", "Graham released a statement on Feb. 26 praising Trump’s response to the current coronavirus outbreak, but he doesn’t suggest in that statement that he believes Trump knows more about the virus than medical professionals.", "We reached out to Graham’s office for comment but did not hear back in time of publication.", "The person who tweeted the made-up quote, Dan Lyons, describes himself on his Twitter account as an \"inventor of fake news.\" But this context is lost on people who viewed the tweet on other platforms and those who didn’t visit his profile.", "Pants on Fire!", "Facebook post, March 2, 2020", "Archive.is, tweet, Feb. 26, 2020", "Senate.gov, Graham on Coronavirus Response, Feb. 26, 2020", "Sen. Lindsey Graham, Twitter, Facebook, Accessed March 4, 2020", "Reuters, False claim: Sen. Lindsey Graham said Donald Trump probably knows more about medicine and viruses than any scientist at the NIH and CDC, March 4, 2020", "Snopes, Did US Sen. Graham Say Trump Knows More Than CDC About Medicine?, March 2, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]