["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "President Donald Trump walks to speak with reporters after voting at the Palm Beach County Main Library, Saturday, Oct. 24, 2020, in West Palm Beach, Fla. (AP)", "Trump voted in person at a library in Palm Beach County Oct. 24. The Supervisor of Elections said he did not vote twice in the general election.", "Trump voted by mail for the presidential preference primary in March and the state primary in August.", "For the primaries, Trump had a representative pick up the ballot for him, which is allowed under Florida law.", "President Donald Trump, who has bashed voting by mail, showed up in person at an early voting site in Palm Beach County to vote Oct. 24.", "But some posts on social media suggest he voted twice — once by mail, and once in person.", "\"Did this slip by anyone else because not me. He voted twice. He is committing voter fraud. Oh Irony! How he mocks thee!\" stated an Oct. 24 Facebook post.", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The Facebook post includes a link to an Aug. 19 NPR story about how Trump voted by mail in Florida’s primary. The post also includes a link to a TV news report about Trump voting in person.", "Wendy Sartory Link, the Palm Beach County Supervisor of Elections, was at the library early voting site when Trump cast a ballot in person.", "\"I can absolutely confirm that he did not vote twice in November,\" she told PolitiFact the next morning.", "While Trump has repeatedly attacked voting by mail, he used it himself twice earlier this year. A representative picked up ballots for Trump from the elections office, which is allowed under Florida law. Link confirmed that Trump voted using that method for the presidential preference primary in March and the state primary in August. Trump is registered to vote using his Mar-A-Lago address.", "Leading up to the Nov. 3 election, reporters were eager to report if he planned to vote in person. At PolitiFact, we regularly checked the Palm Beach County website to look up Trump and saw no request for a mail ballot. The Miami Herald reported Oct. 19 that Trump had not yet requested a mail ballot, although he still had time. A couple days later reporters from the Wall Street Journal and Politico tweeted that Trump planned to vote in person at an early voting site.", "Election officials have procedures to prevent a voter from casting a ballot by mail and then voting in person.", "In Palm Beach County, workers check in voters at polling sites using an electronic poll book. If a voter has already voted by mail, the voter won’t be allowed to vote a second time.", "If a voter casts a ballot by mail, and then goes to vote in person before that completed mail in ballot has been received by the county, the mail-in ballot will eventually be rejected, Ashley Houlihan, general counsel for the Palm Beach Supervisor of Elections, previously told PolitiFact.", "RELATED: How to make sure your ballot is counted this fall", "We rate this claim Pants on Fire.", "Facebook post, Oct. 24, 2020", "NPR, Trump, While Attacking Mail Voting, Casts Mail Ballot Again, Aug. 19, 2020", "23ABC News Bakersfield, President Donald Trump casts his ballot early and in-person in Florida, Oct. 24, 2020", "Sun Sentinel, ‘I voted for a guy named Trump,’ the president says after voting in person in West Palm Beach, Oct. 24, 2020", "Miami Herald, Trump voted by mail in Florida’s primary. Will he do it again in November? Oct. 19, 2020", "PolitiFact, Trump’s bad advice on going to polls to verify if your mail ballot was counted, Sept. 23, 2020", "PolitiFact, Donald Trump’s dubious claim that 'thousands' are conspiring on mail-ballot fraud, April 9, 2020", "Politico’s Marc Caputo, Tweet, Oct. 21, 2020", "Wall Street Journal’s Alex Leary, Tweet, Oct. 21, 2020", "Email interview, Wendy Sartory Link, Oct. 25, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]