["By Jessica McDonald", "Posted on June 7, 2019", "During a trip to the United Kingdom, President Donald Trump once again expressed skepticism about climate change, making several false or misleading statements in a television interview on “Good Morning Britain” with host Piers Morgan.", "Trump went on to give examples of extreme weather, including tornadoes and hurricanes, that he says were worse in the past. The science isn’t clear on whether tornadoes are changing because of climate change, but there is evidence to suggest hurricanes are likely to get worse in the future because of greenhouse emissions. In any case, the examples don’t refute the overwhelming evidence that climate change is happening.", "In an interview that aired June 5, Morgan asked the president what Prince Charles, a known environmentalist, had told Trump about climate change. The meeting, Trump said, was originally supposed to be only 15 minutes, but lasted an hour and a half.", "Trump: [Charles] wants to make sure future generations have climate that is good climate, as opposed to a disaster, and I agree. I did mention a couple of things. I did say well, the United States right now has among the cleanest climates there are based on all statistics, and it’s even getting better. Because I agree with that, I want the best water, the cleanest water. Crystal clean … air.", "Later that day in a press conference in Ireland, Trump echoed that statement, again responding to a question about his stance on climate change by referencing water and air. “But, you know,” Trump said, “we have the cleanest air in the world, in the United States, and it’s gotten better since I’m president. We have the cleanest water; it’s crystal clean.”", "As we have written before, the United States does not have the cleanest air in the world. According to the 2018 Environmental Performance Index, which is put out by Yale and Columbia universities in collaboration with the World Economic Forum, the U.S. comes in 10th. With respect to water, the same index places the U.S. in a 10-way tie for first for drinking water, and 29th in the larger category of water and sanitation.", "It’s not clear whether air quality has gotten better, as Trump claims. Some Environmental Protection Agency metrics, such as the average national air pollutant concentrations for sulfur dioxide and ozone, improved slightly from 2016 to 2017. Others, however, showed the opposite pattern, including increases in two types of particulate matter. And the number of days with unhealthy levels of air pollutants for sensitive groups, such as children and older adults, rose from 701 days in 2016 to 729 days in 2017. There isn’t data yet for 2018. Given some of the conflicting trends and limited data, it’s hard to make concrete conclusions about how air quality has changed under a Trump presidency.", "More importantly, by bringing up air and water quality when asked about climate change, and saying the U.S. has among the “cleanest climates,” the president is mistaking traditional pollutants with greenhouse gas emissions, including carbon dioxide.", "The latter are responsible for driving climate change, and as we’ve detailed before, the U.S. is one of the largest sources of greenhouse gases in the world. In 2016, the International Energy Agency listed the U.S. as the second-biggest emitter of CO2, behind China, and the 10th highest for CO2 emissions per person.", "Estimates also indicate that U.S. emissions rose in 2018 after three years of declines. According to the Energy Information Administration, energy-related CO2 emissions increased by 2.8 percent in 2018 — the largest increase since 2010. The Rhodium Group, an economics analytics firm, also calculated a 3.4 percent increase in emissions across all sectors.", "Although increases in CO2 emissions are not expected in 2019 and 2020, the EIA projects that CO2 emissions will still be higher in both years than they were in 2017.", "Trump’s most direct comments on climate change came in response to Morgan’s question about whether the president personally believes in climate change.", "Trump: I believe that there’s a change in weather, and I think it changes both ways. Don’t forget it used to be called global warming. That wasn’t working. Then it was called climate change. Now it’s actually called extreme weather, because with extreme weather, you can’t miss.", "It’s not entirely clear what the president meant when he said there is “a change in weather.” We contacted the White House for clarification, but did not receive a reply.", "If Trump is referring to a change in weather over many decades, then he’s describing climate. If not, he’s simply stating that weather — which is inherently variable — changes. That would be correct, but it also isn’t saying much. And it’s not commenting on climate change. Either way, his response is potentially misleading, and touches on a common failure to understand the difference between climate and weather.", "As NASA explains on its website, weather refers to atmospheric conditions over short periods of time, such as minutes, days or months. Climate, in contrast, is concerned with average weather conditions over a much longer period of time, such as 30 years.", "Or, as the National Oceanic and Atmospheric Administration puts it, “Climate is what you expect, weather is what you get.” Another way of thinking about it is that weather is one or two plays in a football game, whereas climate is the entire football season.", "This difference in perspective matters because weather will always fluctuate. Even in a warming world, there will still be colder days and months. NASA notes that climate change “is not proven nor disproven by individual warming or cooling spells. It’s the longer-term trends, of a decade or more, which place less emphasis on single-year variability, that count.”", "In the case of climate change, the global average temperature trend is going in one direction, contrary to Trump’s suggestion that “it changes both ways.” This doesn’t mean, however, that all places on Earth are experiencing warming or are doing so at the same rate.", "Again, it’s not clear what the president means by “it changes both ways.” Where Trump could have a point about the climate changing “both ways” is that not all of the effects of climate change will be in the same direction for all locations. Rainfall, as we’ve discussed, could increase in some places and decrease in others. But the fact that the impacts of climate change can differ depending on locale doesn’t undermine the idea that these changes are happening.", "Trump also contends that the terminology surrounding climate change has purposely shifted over the years, starting first as “global warming,” morphing into “climate change” and finally becoming “extreme weather.” This misrepresents the history of the terms.", "As we explained in 2016, when Ted Cruz made the same argument about “climate change” and “global warming,” the two terms both go back decades in the scientific literature, and technically refer to slightly different concepts, although they are often used interchangeably.", "Global warming, according to NASA, specifically means the warming of the Earth over the last century or so, because of the burning of fossil fuels.", "Climate change is a broader concept, in that it includes higher temperatures as a result of global warming, but also other changes that result from that warming, such as sea level rise, shifting precipitation patterns and yes, some extreme weather.", "Pennsylvania State University climatologist Michael Mann told us in 2016 that many scientists prefer to use climate change because of its broader meaning. But both terms are still commonly used, and their dual existence is not because the term “global warming” wasn’t “working.”", "If anything, some of the increased use of “climate change,” at least among politicians, was due to a Republican strategist who pushed the Bush administration to use it because it sounded less “frightening” than global warming.", "Extreme weather has become a more commonly talked-about feature or example of climate change, but it is not used by scientists in place of “climate change” or “global warming.” In 2014, for example, the National Climate Assessment stated, “Changes in extreme weather and climate events, such as heat waves and droughts, are the primary way that most people experience climate change.”", "“Extreme weather” on its own simply means highly unusual weather. Extreme weather can include heat waves, drought, heavy downpours, floods or other storms. Not all types of extreme weather have been linked to climate change, and it’s difficult to say any particular event was affected by climate change.", "Nevertheless, scientists have made progress in what’s called attribution science, and are increasingly more confident about linking individual storms or events to climate change. In these cases, scientists are not saying that climate change caused the event, but that climate change made conditions more likely or more severe.", "In the next section, we’ll discuss some examples, including two that Trump mentioned.", "Immediately after Trump’s statement about terminology, he pointed to two examples of extreme weather that he claims were worse in the past.", "Trump: Look, we have a thing now with tornadoes, I don’t remember tornadoes in the U.S. to the extent. But then when you look back, 40 years ago, we had the worst tornado binge that we’ve ever had. In the 1890s, we had our worst hurricanes. And I would say we’ve had some very bad hurricanes.", "Trump’s tornado example is likely a reference to a so-called tornado “outbreak,” or cluster of tornadoes coming from the same weather system, that occurred over April 3 and 4, 1974.", "The 1974 event was certainly one of the worst, but there was another outbreak in 2011 that included more tornadoes and was deadlier.", "An FAQ document from NOAA’s Storm Prediction Center explains that the 2011 outbreak killed 316 people, or six more than the 1974 event. Using the storm center’s usual way of counting the number of tornadoes in a single “convective day,” the 2011 event included 175 tornadoes, or 28 more than in 1974. The 2011 event also comes out on top when counting by calendar day. The 1974 outbreak, however, had more of the most intense tornadoes, rated as F5.", "The latest string of tornadoes in May didn’t produce a single day with tornado tallies topping these earlier outbreaks, but there were an unusually high number of tornadoes over a 30-day period.", "Trump’s other example of the 1890 hurricane season is more befuddling. That year was one of the least active for hurricanes, and included just four tropical cyclones. Only two reached hurricane status, and just one reached the category 3 rating to be classified as “major.”", "Although there was a reduced ability to identify storms before 1944, by any objective measure, 1890 was not a year with “our worst” hurricanes.", "NOAA, for example, describes 2005’s Hurricane Katrina as “one of the most devastating hurricanes in the history of the United States,” and the deadliest since 1928.", "A much better choice for Trump would have been the 1900 Galveston Hurricane, which NOAA describes as the “deadliest weather disaster” in American history. The fact that bad hurricanes happened more than a century ago, however, doesn’t disprove climate change, and it also doesn’t establish whether or not climate change is making or will make hurricanes more frequent or worse.", "As before with our discussion of weather, the important thing is to look at the long-term record. Knowledge about the physical processes driving a particular weather event and modeling can also be used to study whether climate change is influencing or is likely to influence the severity or frequency of events.", "For hurricanes, as we’ve detailed before, there is some evidence to suggest a climate change connection, although there is uncertainty about how much humans have contributed to hurricane activity thus far.", "Scientists are more confident that in the future hurricanes will be more intense with continued warming. “With future warming, hurricane rainfall rates are likely to increase, as will the number of very intense hurricanes, according to both theory and numerical models,” explains an FAQ to the 2018 National Climate Assessment.", "In the case of tornadoes, outbreaks have become more common over the last several decades, but the number of days with a tornado has decreased. Some evidence suggests tornadoes are also shifting eastward. But whether these changes are related to climate isn’t clear.", "In 2016, the National Academies released a report on the attribution of extreme events, and noted that tornadoes, which are a type of severe convective storm, “are arguably the most difficult events to attribute, and accordingly, no studies have been performed.” The report continues, “These events are poorly observed, cannot be simulated in climate models at present, and have a complex and subtle relation to climate change, with competing factors tending to drive the response in opposite directions.”", "Similarly, the 2018 National Climate Assessment concluded that tornadoes are “exhibiting changes that may be related to climate change, but scientific understanding is not yet detailed enough to confidently project the direction and magnitude of future change.”", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]