["By Lori Robertson", "Posted on May 4, 2020", "President Donald Trump has claimed Joe Biden, the presumptive Democratic presidential nominee, wrote him a “letter of apology” regarding the administration’s travel restrictions on China. But there’s no evidence of such a letter, and Biden’s campaign says it “never happened.”", "We asked the White House about the president’s claim, and we haven’t received a response.", "It’s possible Trump has added an extra layer of exaggeration on a prior claim that Biden had “apologized” for criticizing the travel restrictions, a claim Trump made on April 28. But Biden didn’t “apologize” for any criticism. His campaign on April 3 said Biden supported the administration’s travel restrictions on China, and it argued that Biden’s earlier comments about Trump’s “record of hysteria and xenophobia” weren’t a reference to the restrictions, though they were made the same day those travel prohibitions were announced.", "On Jan. 31, a day after the World Health Organization declared the novel coronavirus a public health emergency of international concern, Health and Human Services Secretary Alex Azar declared a public health emergency for the U.S. and announced travel restrictions to and from China, effective Feb. 2. The policy prohibited non-U.S. citizens who have traveled to China within the previous two weeks from entering the U.S. It didn’t apply to U.S. citizens, permanent residents and their immediate family.", "Also on Jan. 31, Biden, speaking at a campaign event in Iowa about the coronavirus outbreak, said that Americans “need to have a president who they can trust what he says about it, that he is going to act rationally about it.” He added, “This is no time for Donald Trump’s record of hysteria and xenophobia – hysterical xenophobia – and fearmongering to lead the way instead of science.”", "He reiterated those comments the next day on Twitter, saying: “We are in the midst of a crisis with the coronavirus. We need to lead the way with science — not Donald Trump’s record of hysteria, xenophobia, and fear-mongering. He is the worst possible person to lead our country through a global health emergency.”", "Trump has repeatedly claimed that Biden called him “xenophobic” and “racist” because of the travel restrictions on China. But Biden didn’t say he was talking about those restrictions.", "On April 3, the former vice president’s campaign said Biden supported the Trump administration’s travel restrictions on China, and it said Biden’s “reference to xenophobia” wasn’t about the travel restrictions but rather “Trump’s long record of scapegoating others at a time when the virus was emerging from China.”", "“Joe Biden supports travel bans that are guided by medical experts, advocated by public health officials, and backed by a full strategy,” Kate Bedingfield, Biden’s deputy campaign manager, told CNN. “Science supported this ban, therefore he did too.”", "The next day, on April 4, Trump said there had been “breaking news last night” that Biden “agreed that [Trump] was correct when I stopped people from China very early — very, very early — from coming into our country.”", "But Biden the following day criticized Trump for a “slow” response to the crisis, saying on ABC’s “This Week”: “You got to go faster than slower. And we started off awfully slow. He indicated that I complimented him on — on dealing with China. Well, you know, 45 nations had already moved to keep — block China’s personnel from being able to come to the United States before the president moved. So, it’s just — it’s about pace. It’s about — it’s about the urgency. And I don’t think there’s been enough of it, urgency.”", "As we’ve explained before, both politicians have spun the facts on whether Trump’s travel restrictions were “very, very early,” as Trump claims, or after “45 nations had already moved,” as Biden said. Data from Think Global Health, a project by the Council on Foreign Relations tracking countries’ travel restrictions, show “that the United States was neither behind nor ahead of the curve in terms of imposing travel restrictions against China,” a co-author of the tracker, Samantha Kiernan, a research associate on global health, economics, and development, told us.", "In late April, Trump claimed that Biden had “apologized,” and in a May 3 Fox News virtual town hall, the president twice said Biden made that apology in a letter.", "Trump, Fox News virtual town hall, May 3: They called me a racist. They said “xenophobic.” Biden said, “He was xenophobic.” Biden has now written a letter of apology because I did the right thing. I saved hundreds of thousands of lives. …", "And he actually apologized with a letter on a Friday night saying, “He made the right move.” It wasn’t well played by the press, but he said I made the right move.", "We found no evidence of an apology letter. Biden campaign spokesman Andrew Bates told us in an email: “Never happened.”", "As for Trump’s claim about saving “hundreds of thousands of lives,” we found no support for such a figure, either. As we’ve written, the few studies that have been done on travel restrictions the United States and other countries enacted on China estimate those measures had modest impacts, slowing the initial spread outside of China but not containing the coronavirus pandemic.", "Trump also referred to “a letter of apology” a few weeks prior, in an April 13 coronavirus task force briefing, during a back-and-forth with a reporter over what the administration had done regarding the coronavirus pandemic in February. Trump cited his travel restrictions on China and said of Biden, “Why did he write a letter of apology?” The reporter, CBS News’ Paula Reid, replied, “I don’t think the unemployed people right now care about why Joe Biden didn’t apologize to you, sir.”", "In fact, Biden didn’t apologize — his campaign instead said he supported the president’s China travel restrictions.", "FactCheck.org does not accept advertising. We rely on grants and individual donations from people like you. Please consider a donation. Credit card donations may be made through our “Donate” page. If you prefer to give by check, send to: FactCheck.org, Annenberg Public Policy Center, 202 S. 36th St., Philadelphia, PA 19104.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]