["This Facebook post shared the misleading photos, which are also circulating on WhatsApp.", "Several Twitter users also shared the same images but deleted them when people pointed out the error.", "The misleading images were also circulating on WhatsApp groups. AFP’s fact-checking reporter in Nairobi was among those who received them via the messaging app.", "But a reverse image search shows that the pictures were taken on May 19, 2015, during a security drill conducted at the airport by the Recce squad, a special force unit in the paramilitary arm of the Kenya Police Service.", "You can see them in a tweet by the Kenya Airports Authority on that date, thanking the officers who performed the drill.", "Special thanks to the GSU Recce team & the Police for supporting today's #JKIADrill pic.twitter.com/gzLtXJEBdG", "As AFP reported here, hundreds of travellers found themselves stranded for hours at the Nairobi airport on Wednesday due to a strike by staff, who faced off with riot police at what is East Africa’s busiest air traffic hub.", "Riot police fired tear gas at the workers, who were angry about a planned takeover of the airport by national carrier Kenya Airways.", "Soldiers were also deployed to help screen the passengers as Kenya Airways staff and security personnel took over the duties of the striking workers.", "By late afternoon, Kenya Airways said most of its affected departing flights had been rescheduled and should leave before midnight.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]