["About this rating", "On Jan. 3, 2020, Taters Gonna Tate published an article positing that thousands of young supporters of U.S. President Donald Trump had enlisted in the military following the U.S.-ordered killing of Iran Gen. Qassem Soleimani:", "Thousands of Young Trump Supporters Show Up At Local Recruiters To Volunteer For Duty", "While liberals cry over a dead Iranian general, young Trump supporters are stepping up by the thousands to help the cause and serve their country. Recruiters from coast to coast are reporting that they have lines out the door and around the block full of young men and women, proudly wearing their Make America Great Again hats, ready to enlist to go to war against Iran.", "This item was not a factual recounting of real-life events. The article originated with a website that describes its output as being humorous or satirical in nature, as follows:", "Everything on this website is fiction. It is not a lie and it is not fake news because it is not real. If you believe that it is real, you should have your head examined. Any similarities between this site’s pure fantasy and actual people, places, and events are purely coincidental and all images should be considered altered and satirical. See above if you’re still having an issue with that satire thing.", "While thousands of Trump supporters did not enlist in the military following Soleimani's death, the killing of this Iran general did result in an increase of web searches about the possibility of a military draft. The U.S. Selective Service System even posted a statement on Twitter saying that Congress and the president would have to pass legislation to authorize a military draft:", "For background, here is why we sometimes write about satire/humor.", "Tatersgonnatate.com.   \"Thousands of Young Trump Supporters Show Up at Local Recruiters to Volunteer for Duty.\"\r\n    3 January 2020.", "Weinberg, Abigail.   \"The Selective Service’s Website Crashed and Not Because People Are Rushing to Enlist.\"\r\n    Mother Jones.   3 January 2020.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]