["Social media has been abuzz recently with many users claiming that the Supreme Court changed its motto ‘Satyamev Jayate’ to ‘Yato Dharmastato Jai’. On August 21, 2020, Sunil Astay of the Bhim Army posted two images in a tweet, writing, “The Supreme Court released a list on August 17, which issued the names of six advocates who had been appointed as judges to the Delhi High Court. But the big news here is that the words inscribed under the Ashoka Pillar have changed.” (archived link to the tweet)", "सत्यमेव जयते’ की जगह ।। यतो धर्मस्ततो जय: ।।", "हो गया है। ये देश कहाँ जा रहा है??? सुप्रीम कोर्ट ने 17 अगस्त को एक लिस्ट जारी किया है, जिसमें दिल्ली हाई कोर्ट के लिए 6 जजों के नामों की सूची जारी की गई है। लेकिन यहां बड़ी खबर यह है कि अशोक स्तंभ के नीचे लिखा शब्द बदल गया है। pic.twitter.com/1MKAcx311m", "— बहुजन शेर सुनिल अस्तेय ‘सत्यमेव जयते’ 🇮🇳 (@SunilAstay) August 21, 2020", "Journalist Punya Prasun Bajpai had also tweeted these photos with the same claim, later deleting his post. We managed to take a screenshot of the tweet, which is below.", "Many people made posts on Facebook stating that “the Supreme Court is more concerned with victory than justice since its motto is no longer ‘Satyamev Jayate’ (the truth alone triumphs), but ‘Yato Dharmastato Jai’ (where there is dharma, there is victory). Another user had tagged Alt News on Twitter, requesting our team to verify this information. Meanwhile, other users wrote about how everyone should be speaking out about it along with the need for wide reportage on this change.", "This slideshow requires JavaScript.", "We could not find any sources or literature that pointed to the Supreme Court changing its motto from ‘Satyamev Jayate’ to ‘Yato Dharmastato Jai’. We checked the official website of the Supreme Court and did not find any press release that mentioned the change or said that its motto was ‘Satyamev Jayate’ at any point in time. On the home page of the site, ‘Yato Dharmastato Jai’ appears under the words ‘The Supreme Court of India’. We will now check whether this has been changed recently. We looked up the website of the Supreme Court on Wayback Machine, a webpage archive which keeps automatic records of web pages at different times.", "If you take a look at the archives of the official Supreme Court website on web.archive.org, you will find a total of 130 snapshots taken in the period between November 12, 2019 and August 18, 2020. On the snapshot taken on November 12, 2019, the phrase ‘Yato Dharmastato Jai’ can be seen written below the heading, ‘The Supreme Court of India’. Thus, the slogan cannot be a recent change.", "Now, let’s take a look at what the website of the Supreme Court used to look like. The web address of the top court used to be supremecourtofindia.nic.in earlier. We found around 1,580 snapshots on web.archive.org of this site taken from July 6, 2000 to August 20. 2020.", "We looked through a number of snapshots on Wayback Machine and found one dated November 10, 2010. On this version, the words ‘Yato Dharastato Jai’ appeared on the page. However, these words were absent in the screenshot taken before November 10, 2010. Therefore, the phrase ‘Yato Dharmastato Jai’ appeared on the website for the first time somewhere between November 10. 2010 and November 20, 2010. This can be seen in the video below.", "It is worth noting here that the Supreme Court did not change ‘Satyamev Jayate’ to ‘Yato Dharmastato Jai’. We did not see ‘Satyamev Jayate’ written anywhere on the home page of the website in the first place. As a result, the claims being made online about the Supreme Court’s recent change of its motto are false. Punya Prasun Bajpai later issued a regretful tweet, admitting he had been confused and accidentally circulated the information.", "In reality, the logo of the Supreme Court contains the Ashok Chakra. Below the symbol are the words ‘Yato Dharmastato Jai’ inscribed in Sanskrit. On the other hand, ‘Satyamev Jayate’ is the motto of the Government of India, and is written underneath the Ashok Pillar.", "Donate Now", "Priyanka Jha specialises in monitoring and researching mis/disinformation at Alt News. She also manages the Alt News Hindi portal.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]