["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Georgia Republican Brian Kemp is trying to win over Trump voters in his race for governor by saying he successfully fought the Obama administration to keep immigrants in the country illegally from voting in the state.", "Kemp, Georgia’s secretary of state since 2010, posted a campaign video on his Facebook page March 5 that invoked the deaths of Kate Steinle, Edwin Jackson and a Georgia family killed by a drunk driver in the country illegally, saying \"we must secure the border and end sanctuary cities.\"", "Over black and white photos of Kemp and former President Barack Obama, a narrator then says: \"As Secretary of State, Brian Kemp fought Obama twice and won to stop illegal immigrants from voting.\"", "Text under Obama’s photo said: \"Fought Obama. Citizenship check. Photo ID.\"", "Is that true?", "Kemp’s video stretched the facts. Courts dismissed lawsuits filed by Kemp to change voting procedures in Georgia — after the Obama administration allowed the voting changes. Also, there’s no indication that Obama wanted immigrants in the country illegally voting.", "Kemp’s campaign pointed to preclearance lawsuits filed on Georgia’s behalf in June and November of 2010 against then-U.S. Attorney General Eric Holder.", "Because of its history of voter discrimination, Georgia was one of several states whose voting changes were required to be precleared by either a federal court or the U.S. Justice Department.", "Per Section 5 of the Voting Rights Act, in judicial reviews, jurisdictions must establish that proposed voting changes do not deny or abridge the right to vote on account of race, color, or membership in a language minority group. If jurisdictions seek administrative preclearance from the Justice Department, they can implement voting changes if the Attorney General affirmatively indicates no objection, or if at the expiration of 60 days, no objection to the submitted change has been interposed by the Attorney General.", "Both of Georgia’s lawsuits dealt with new rules to prevent people in the country illegally from casting votes.", "The first lawsuit concerned a voter verification process that required information on voter registration applications to match data kept by Georgia’s Department of Drivers Services and the Social Security Administration.", "The other lawsuit stemmed from a Georgia law requiring proof of citizenship from individuals registering to vote.", "In the end, both lawsuits were dismissed because the Justice Department approved the changes through the administrative process.", "The Justice Department did oppose one of the changes Georgia sought, but later found no objection after the state revised it. So, Kemp and the Justice Department eventually were on the same side.", "\"As secretary of state, Brian Kemp sued the Obama Justice Department twice — and won — to implement Georgia's common sense citizenship check and Photo ID laws,\" said Ryan Mahoney, Kemp's campaign spokesman.", "New voter verification procedures were initially sought by former Secretary of State Karen Handel, who attempted to implement them before the 2008 general election. (She resigned in 2009 and is now in the U.S. House.)", "The Justice Department in 2008, under Republican President George W. Bush, \"first questioned\" the voter verification process, saying federal law requires states to verify a voter's identity, but not citizenship, the Atlanta Journal-Constitution reported.", "\"The state largely acted as it was required to by the Voting Rights Act, as has been necessary since the law was signed into law in 1965,\" said Barry C. Burden, a political science professor and director of the Elections Research Center at the University of Wisconsin-Madison. \"In both of the Georgia cases, the Department of Justice precleared the changes after reviewing them.\"", "Michael S. Kang, a law professor at Emory University School of Law, said \"it’s odd\" to claim that Kemp \"fought Obama twice\" on the basis of the 2010 lawsuits, since the Justice Department ultimately chose to preclear both voting changes.", "\"In fact, many election law experts were surprised that the Justice Department under President Obama didn’t maintain an objection to these laws,\" Kang said.", "Finally, the ad creates the wrong impression that Obama wanted people in the country illegally to vote.", "But \"there is zero evidence to support the implication that the Obama administration wanted to see illegal immigrants voting,\" Burden said.", "Kang said he is unaware of any serious evidence that \"illegal immigrants\" were voting in Georgia at the time.", "\"I also do not believe that President Obama has supported voting by ‘illegal immigrants,’ \" he said.", "Kemp said he \"fought Obama twice and won to stop illegal immigrants from voting.\"", "The facts don't suppport Kemp's assertion. The Obama administration allowed Georgia’s changes to stop noncitizens from voting to happen.", "As secretary of state, Kemp was required to seek approval for the changes from the Justice Department or a federal court. He got it from the Justice Department, so the lawsuits were dismissed. Experts described the process as routine under the law.", "The ad is flat-wrong to suggest that the Obama administration wanted immigrants in the country illegally to cast votes in elections.", "We rate this claim False.", "Facebook, Post on Brian Kemp’s page, March 5, 2018", "Email exchange, Brian Kemp’s press office, March 16, 2018", "U.S. Justice Department, Section 4 of the Voting Rights Act, Updated Dec. 21, 2017", "U.S. Justice Department, About Section 5 of the Voting Rights Act, Updated Dec. 4, 2017", "U.S. Justice Department, Jurisdictions previously covered by Section 5, Aug. 6, 2015", "U.S. Justice Department, Voting Determination Letter sent to Georgia Attorney General Thurbert E. Baker, May 29, 2009", "ACLU, Letter from U.S. Justice Department to Georgia Attorney General Thurbert E. Baker, May 29, 2009", "Email interview, Michael S. Kang, law professor at Emory University School of Law, March 19, 2018", "Email interview, Barry C. Burden, political science professor and director of the Elections Research Center at the University of Wisconsin-Madison, March 20, 2018", "Email interview, Justin Levitt, law professor at Loyola Law School, March 19, 2018", "Phone interview, Andra Gillespie, political scientist at Emory University, March 20, 2018", "Rome News-Tribune, Secretary of State: Georgia's voter ID requirement cleared by feds, April 4, 2011", "Tom Crawford’s Georgia Report, DOJ gives clearance for voter verification procedures, Aug. 23, 2010", "The Atlanta Journal-Constitution, Justice Department approves Georgia voter verification system, Aug. 23, 2010", "OnlineAthens.com, Immigrant sentenced to 40 years in prison for drunken driving crash that killed family, Oct. 13, 2015", "Facingsouth.org, VOTING RIGHTS: DOJ finds Georgia voter screening inaccurate and discriminatory, June 4, 2009", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]