["About this rating", "The piece quoted above (\"Allah or Jesus?\") is an editorial penned by Rick Mathes, Executive Director of the Mission Gate Prison Ministry.", "We asked Mr. Mathes if he could provide some information about the origins of the piece, and he responded:", "This article is an exact recording of a real event that I participated in. My only commentary was, \"the truth will prevail.\" I think this meeting was in May 2003 and I will not give out more details for fear of retribution. The purpose of the class was to increase \"religious sensitivity\", that is, tolerance for each others beliefs and I really blew that. The director was purple with rage however the Imam and I exchanged signs and said \"Salaam\" which means \"peace\" in Arabic (I hope). I questioned him (Imam) really to get a clear refutation of what is commonly thought of this Jihad nonsense. But apparently he wasn't educated enough to rebut my remarks or by his silence on this matter (I think) concurred with my implied conclusions. In either case I was surprised. And when I said I found it hard to be his friend, everyone laughed out loud. So the mood was an amazing mix of those who were interested like me and others that were just amused by the whole thing. I left the matter open on purpose (the truth will prevail) so that either side could speak up and claim the truth as their own.", "Reporter Greg Kearney, writing for the Lee News Service, traced the story to a correctional facility in Fulton, Missouri, and came away with a decidedly different version of events from Missouri state officials.", "According to Tim Kniest, Public Information Officer for the Missouri Department of Corrections, the event described was a training program for prison volunteers, for which ministers from several faiths were invited to give presentations in order to acquaint prison volunteers with the varied religious beliefs of the inmate population. The man who gave the presentation about Islam was not a Muslim minister; he was an inmate pressed into service to present a short film on Islam and answer some questions when the prison's Volunteer Coordinator was \"unable to find an Imam to speak.\"", "Moreover, reported Mr. Kniest, the prison's Volunteer Coordinator said that \"The inmate did a good job,\" adding, \"He was asked a few questions that were beyond his ability to answer. But he was not asked anything like that question [in the editorial]\":", ". . . the Volunteer Coordinator at the prison said that no such exchange as the editorial reported ever took place. \"He certainly did not 'Hang his head in shame',\" according to Kniest. In fact, the inmate was thanked by the assembly before being escorted back to his quarters. Furthermore, the coordinator does not recall any questions dealing with jihad [Holy war] against the infidels of the world as reported in the editorial.", "In the editorial the inmate is presented as an Imam, or Islamic minister, which he clearly was not.", "Regardless of whatever may have transpired at the prison training session referred to above, the larger point the writer is attempting to make in this piece is a grossly inaccurate one. Islam is not a monolithic religion in which unanimity of belief and action is coordinated from a central authority; it has well over a billion adherents in countries all over the world who belong to any one of a number of different sects with varying beliefs, traditions, and interpretations of scripture. (As well, some religious groups identify themselves as Islamic but are not recognized as such by the vast majority of Muslims.) No one Muslim (especially one who wasn't even a cleric) could speak to what all of Islam believes, any more than a single member of a Methodist congregation could speak for every denomination and follower of Christianity.", "As National Geographic reporter Frank Viviano found during extensive travels through the region, even in Saudi Arabia, the heart of Islam, Muslims were far from holding the idea that \"All followers of Allah have been commanded to kill everyone who is not\" Muslim — even the notion that other religions should be barred from the home of Islam was disputed:", "At one majlis, I asked a noted Muslim scholar, an imam, how Islam's venerable assertion of religious tolerance could be reconciled with Saudi Arabia's ban on Christian churches in the kingdom.", "\"It was the command of God, conveyed to us through the Prophet Muhammad, that no other religion be permitted in the land where Islam was born,\" the imam replied.", "To my surprise, another guest picked a point-for-point argument with him. \"I've heard that allusion a hundred times, and nobody has ever convinced me that this is what the Prophet's words really meant,\" he said.", "If one is willing to ignore history, context, and actual practice when quoting scripture and other religious texts, followers of just about any religion can be painted as uniformly fanatic and intolerant. By presenting misinterpretations and fringe activities as the norm, one could claim that mainstream Christianity tolerates or promotes child molestation and stoning and could recast the piece quoted above as follows:", "The minister gave a great presentation of the basics of Christianity, complete with a video. After the presentations time was provided for questions and answers. When it was my turn I directed my question to the minister and asked: \"Please, correct me if I'm wrong, but I understand that in Exodus 35:2, the Bible instructs Christians to kill everyone who works on the sabbath: 'Six days shall work be done, but on the seventh day there shall be to you an holy day, a sabbath of rest to the Lord: whosoever doeth work therein shall be put to death.'\"", "There was no disagreement with my statement.", "I responded, \"So, let me make sure I have this straight. God has commanded Christians to kill everyone who works on Sunday, even Muslims and other non-Christians?\"", "The expression on his face changed from one of authority and command to that of a little boy who had just gotten caught with his hand in the cookie jar. He sheepishly replied, \"Yes.\"", "I then said, \"Well, sir, I have a real problem trying to imagine the Prophet Muhammad commanding all Muslims to kill those of your faith for not observing the Muslim sabbath.\"", "The minister was speechless.", "I continued, \"I also have problem with your Bible commanding all Christians to stone to death anyone who criticizes your God, as detailed in Leviticus 24:16. Let me ask you a question ... would you rather have your God who tell[s] you to kill me in order to go to heaven or my Allah who tells me to love you because I am going to heaven and wants you to be with me?\"", "You could have heard a pin drop as the minister hung his head in shame.", "Sources", "Kearney, Greg.   \"No Good Deed Goes Unpunished.\"\nLee News Service.   13 January 2004.", "Viviano, Frank.   \"Saudi Arabia on Edge.\"\nNational Geographic.   October 2003   (pp. 22-23).", "25 January 2005 -- updated", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]