["In an interview with CBS Austin, U.S. Rep. Lloyd Doggett made a Mostly False claim about universities and federal law (screenshot, CBS Austin, Dec. 15, 2016).", "A Democrat said Texas universities rightly don’t check on whether students are living in the country with legal authorization--in accord with federal law.", "U.S. Rep. Lloyd Doggett of Austin, whose district stretches south into San Antonio, was asked in a December 2016 interview with Austin's CBS Austin to talk about whether certain college students should be worried amid threats to take away federal funding from so-called \"sanctuary campuses,\" presumably a reference to colleges and universities whose leaders indicate no desire to help immigration authorities pursue students who lack legal U.S. residency.", "Doggett replied by initially calling \"sanctuary campuses\" a misnomer.", "The former Texas Supreme Court justice went on: \"Our university campuses by federal law do not check the immigration status of their students, just as our public schools don’t. And that’s the right thing to do. There is a Supreme Court decision about the right to public education.\" Doggett added that if there’s a dangerous person on campus, law enforcement should honor any arrest warrant from immigration authorities to assure safety.", "A 1982 Supreme Court ruling held U.S. children to be entitled to kindergarten through grade 12 public schooling regardless of legal residency status.", "Yet that decision wasn't reflecting on university access. So Doggett’s statement made us wonder how federal law keeps state universities from checking the immigration status of students.", "There isn’t such a law, it appears. And when we asked which law Doggett was thinking of, Doggett’s House chief of staff, Michael Mucchetti, said by email: \"His point is that current federal law doesn’t even require universities to check.\"", "Mucchetti earlier noted that on Dec. 7, 2016, Denise Trauth, president of Texas State University, told faculty, staff and students in a Twitter post: \"The university, following current law, does not and will not report undocumented immigrants to authorities.\"", "We didn't read Trauth's statement as her saying the university doesn’t check the immigration statuses of students. Beyond that, our requests that a university spokesman, Matt Flores, specify the law Trauth was talking about didn’t immediately draw a reply.", "Board that oversees Texas colleges, universities", "Next, we asked the Texas Higher Education Coordinating Board, which oversees colleges and universities statewide, about whether Texas universities check the citizenship status of students.", "In reply, Kelly Carper Polden emailed us a November 2016 agency overview of state laws that enable Texas residents lacking legal U.S. residency--either through citizenship or permanent resident/\"green card\" status--to attend public colleges at in-state tuition rates rather than more costly nonresident rates, provided the students have lived in Texas with a parent, guardian or conservator for 36 months up to high school graduation.", "‘Affidavit’ students in Texas", "The overview gives the impression that Texas universities routinely tally students who lack legal U.S. residency.", "That is, the publication says that each benefiting student must complete an affidavit stating his or her intent to apply for permanent resident status in the U.S. as soon as he/she meets federal eligibility requirements. Also, the publication states, each \"public institution of higher education is responsible for acquiring and maintaining, indefinitely or until the student becomes a Permanent Resident of the U.S., signed affidavits completed by non-U.S. citizens seeking Texas resident status for in-state tuition purposes.", "\"In addition, Coordinating Board rules require institutions to remind affidavit students each year of their obligation to apply for Permanent Resident status as soon as they are eligible to do so,\" the overview states. \"The same rules require the institutions to refer students to the appropriate federal agency for instructions on how to achieve Permanent Resident status,\" the overview says.", "We’ve reported several times before on Texas \"affidavit\" students. Then-Gov. Rick Perry’s approval of the 2001 legislation authorizing such college admissions drew fire when he ran for president in 2012.", "The 2016 overview states that in fiscal 2015, through August 2015, the state’s 24,982 \"affidavit students\" included 17,384 students in public community, technical and state colleges; 7,580 students in public universities; and 18 students in public health-related institutions, costing an estimated $23.42 million in state appropriations while the affidavit students paid $58.3 million in tuition and fees, the overview states.", "Subsequently, web searches led us to a sample universal application for students seeking to enroll at Texas A&M University in fall 2017 that asks if the applicant is a U.S. citizen or permanent resident or if the applicant fulfills state residency requirements related to fulfilling \"affidavit\" status. Also, to our inquiry, Polder pointed us to the state’s Core Residency Questions form last updated by the coordinating board in 2011; the form asks an applicant to attest to her or his U.S. citizenship or other residency status and includes this provision: \"I authorize the college/university to verify the information I have provided.\"", "National perspective", "Nationally in November 2016, more than 500 college and university presidents called for preserving and even expanding Deferred Action for Childhood Arrivals, a 2012 initiative by President Barack Obama that enabled young immigrants brought to the U.S. as children to go to college and seek work despite lacking legal authorization to live in the country.", "After spotting that call on the Pomona College website, we asked the college’s dean of students, Miriam Feldblum, who’s also an immigration scholar, if Doggett was right about federal law and universities not checking the immigration status of students.", "By phone, Feldblum said that’s certainly not so for international students, who must have visas to live and study in the U.S., and, she said, no federal law prohibits institutions from checking the immigration status of students. Regardless, she said, public colleges and universities focus for tuition purposes on whether applicants are state residents.", "Feldblum also stressed that federal privacy laws bar colleges and universities from unilaterally sharing the immigration status of a student absent the student’s consent or a compelling factor such as a subpoena. \"Right now, campuses are not sharing this information with anybody,\" Feldblum said. \"We have no obligation to do so.\"", "Doggett aide: Claim mischaracterized", "We filled in Mucchetti on our finding no federal law forbidding universities from checking a student’s residency status. We also shared the state-published overview for Texas \"affidavit\" students.", "By email, Mucchetti suggested we were mischaracterizing the congressman’s statement. Doggett \"did not say that any federal law prohibits or bars universities from checking status. He was saying that educational institutions are not required by federal law to check status—that like our public schools, public universities, in accord with federal law, do not check,\" Mucchetti wrote.", "Our ruling", "Doggett said: \"Our university campuses by federal law do not check the immigration status of their students.\"", "We see an element of truth here in that colleges and universities, like public schools, don’t act as immigration enforcement agents.", "But we didn't spot nor did Doggett identify a federal law that bars or excuses universities from checking the immigration statuses of students. Meantime, a state law leads public Texas institutions to tally \"affidavit\" students, each of whom has declared a lack of legal U.S. residency. Also, each student-applicant to those colleges and universities must answer questions about citizenship and legal residency and agree to have information verified.", "All told, we rate this statement Mostly False.", "MOSTLY FALSE – The statement contains an element of truth but ignores critical facts that would give a different impression. Click here for more on the six PolitiFact ratings and how we select facts to check.", "Truth-O-Meter article, \"1982 Supreme Court decision in Texas case said public schools must educate non-citizen children,\" PolitiFact Texas, Sept. 25, 2013", "Truth-O-Meter articles on \"affidavit\" students, PolitiFact Texas, \"Perry says the TEA checks whether undocumented students are applying for permanent residency,\" Feb. 14, 2010; \"Rick Santorum says Rick Perry provided in-state college tuition for illegal immigrants,\" Sept. 22, 2011;  \"Juan Hernández says Texas was first to pass a state ‘Dream Act,'\" Dec. 12, 2012; \"Rick Perry says immigrant tuition law made sense in 2001 but he's got no position on repeal in 2015,\" April 15, 2015", "Emails, Michael Mucchetti, chief of staff, U.S. Rep. Lloyd Doggett, Dec. 20-27, 2016", "Publication, \"OVERVIEW: ELIGIBILITY FOR IN-STATE  TUITION AND STATE FINANCIAL  PROGRAMS,\" Texas Higher Education Coordinating Board, November 2016 (received by email from Kelly Carper Polden, assistant director, Communications, External Relations, THECB, Dec. 20, 2016)", "News release, \"College & University Presidents Call for U.S. to Uphold and Continue DACA,\" Pomona College, Nov. 21, 2016", "Email and telephone interview, Miriam Feldblum, vice president for student affairs, dean of students, professor of politics, Pomona College, Dec. 20-21, 2016", "Document, \"Sample Application,\" Texas A&M University, fall 2017, Apply Texas website created through a collaborative effort between the Texas Higher Education Coordinating Board and colleges and universities represented on the site, undated (accessed Dec. 27, 2016)", "Document, \"Core Residency Questions,\" THECB, February 2011 (web link provided by email by Polden, Dec. 27, 2016)", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]