["A video of a girl being brutally thrashed by a man is viral on social media. Several people have merely shared the video without giving any context – “इस वीडीओ को पूरे हिन्दूसतान और दुनिया के कोने कोने तक किसी भी जरीये से पहुचाने मे अपना हक अदा करें।। मैंने कर दिया। और आप सोच भी नही सकते जी के आप कितना बड़ा काम कर रहे हो।पता नही किसके बच्चे हे ओर इतनी बेरहमी से किउ मार रहे हे। (This video needs to reach every corner of India and the world. I have already shared it and you cannot even imagine the great deed you’ll do. Don’t know whose child this is and why is he beating her.)“", "इस वीडीओ को पूरे हिन्दूसतान और दुनिया के कोने कोने तक किसी भी जरीये से पहुचाने मे अपना हक अदा करें।। मैंने कर दिया। और आप सोच भी नही सकते जी के आप कितना बड़ा काम कर रहे हो।पता नही किसके बच्चे हे ओर इतनी बेरहमी से किउ मार रहे हे। 👇👇👇 pic.twitter.com/Hnz8TP0TUX", "— Rupendra solanki (@MRupendra11) August 22, 2019", "The same video is viral with a claim which suggests that a Bengali man beat up a Malayali woman who had eloped with him – “ഇത് ഒരു ബങ്കാളിടെ കൂടെ പോയ ഒരു മലയാളി പെണ്ണിന്റ അവസ്ഥ അമ്മേനു വിളിച്ചു കരഞ്ഞു”", "Another claim has been propagated in Urdu. Twitter handle @if__tr asserts that the incident took place in Kashmir. “دیکھ لوں امت مسلمہ ہماری کشمیری بہن بیٹیوں کی عزتیں بھی اب درندوں کے ہاتھ میں ہیں پلیز ریٹویٹ.”", "دیکھ لوں امت مسلمہ ہماری کشمیری بہن بیٹیوں کی عزتیں بھی اب درندوں کے ہاتھ میں ہیں پلیز ریٹویٹ #Kashmir pic.twitter.com/jWs8BP9Wbl", "— Syed Ali Geelani (@if__tr) August 23, 2019", "The video is neither shot in the Southern part of the country nor in Kashmir. It took place in Assam where a father beat up his minor daughter who refused to be forced into prostitution. Journalist Dhanya Rajendra tweeted about the case.", "It happened in Nagaon in Assam. @Karma_Paljor asked and was told that ‘the people around can be heard speaking in East Bengal’s bengali dialect commonly spoken in rural Assam, especially Muslim community. The man has been attested.", "— Dhanya Rajendran (@dhanyarajendran) August 27, 2019", "According to an August 3 report by Northeast Now, a man named Jamaluddin, a resident of Mowamari village under Samaguri police station in central Assam’s Nagaon district, mercilessly thrashed his 15-year-old daughter. The teenager told reporters that her father beat her up because she refused prostitution. “Police officials said Jamaluddin, a hawker by profession, allegedly had links with the flesh trade racketeers,” per Northeast Now.", "Alt News contacted Samaguri police who watched the video and confirmed that it depicts the same incident. We also corroborated the set of events with Mowamari police who informed, “The girl had run away to her uncle’s house to flee from her father who wanted her to get into prostitution. The man has been arrested and is in our custody.”", "A video where a father brutally thrashed his minor daughter for refusing prostitution is being circulated on social media with varied false claims. The incident took place in Assam and is unrelated to either Southern India or Kashmir.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]