["About this rating", "Trump told people that if they vote by mail, they should also go to polling places to check whether their mailed-in ballot had been tabulated (advice that election officials do not agree with), and if it hadn't: Vote in person.", "Although Trump's advice would functionally result in some people attempting to cast two ballots, the stated goal was to ensure people's ballots get counted, not to elicit double voting.", "On Sept. 2, 2020, U.S. President Donald Trump made a statement about the upcoming general election that sowed confusion. Trump urged voters who cast mail-in ballots to also go to polling places and attempt to vote again on Election Day to \"make sure\" that their ballot was counted.", "The president's comments resulted in not just confusion, but widespread speculation that the President of the United States had just urged voters to commit a crime. Although Trump did suggest that people who vote by mail may need to again vote in person, his stated purpose was to ensure their ballot is counted, not elicit from them a double vote.", "Trump's statements were both incorrect and potentially harmful to voters, as we will explain below. But first let's review his exact statement.", "Speaking while visiting North Carolina, Trump stated the following.", "On your ballots, if you get the unsolicited ballots, send it in and then go make sure it counted, and then if it doesn't tabulate, you vote. You just vote. And then if they tabulate it very late, which they shouldn't be doing, they'll see you voted and so it won't count. So, send it in early, and then go and vote. And if it's not tabulated, you vote, and the vote is gonna count. You can't let them take your vote away. These people are playing dirty politics. Dirty politics.", "So if you have an absentee ballot, or as I call it a solicited ballot, you send it in. But I would check it in any event. I would go and follow it and go vote. And everybody here wants to vote. We vote the old fashioned way. You know, we voted in World War I, we voted in World War II, we're gonna see some great World War II heroes right now. But we voted in World War II. And today they want to give everybody ballots. And every place where they've done it, it's been a mess. It's been a mess. They don't know where they are. They don't know who they're sending them to, it's a terrible thing. Follow your ballot and vote. That's very important, I think everybody understands.", "The president's remarks are captured in this video clip:", "After making this statement, Trump followed up with tweets that urged voters to do the same thing on a national scale, prompting Twitter to slap the tweets with warning labels indicating that they violated the platform's election integrity policy.", "Voting by mail will play a significant role in the Nov. 3, 2020, general election due to safety precautions amid the ongoing COVID-19 pandemic. Trump has been making comments suggesting mail-in ballots make elections less secure by causing widespread fraud — doubts that are not grounded in fact.", "The North Carolina State Board of Elections issued a statement on Sept. 3, 2020, warning voters that voting twice \"with intent to commit a fraud to register or vote at more than one precinct or more than one time\" is a felony, and that going to a polling place after already casting a mail-in ballot will only increase risk of COVID-19 transmission.", "\"Attempting to vote twice in an election or soliciting someone to do so also is a violation of North Carolina law,\" reads the statement issued by Karen Brinson Bell, executive director of the North Carolina State Board of Elections.", "Brinson Bell stated that North Carolina has numerous safeguards in place to prevent double voting and urged people to sign up for BallotTrax, set to launch soon, which will allow voters to track their vote through the mail and confirm that it was received by their county's election officials.", "\"The State Board office strongly discourages people from showing up at the polls on Election Day to check whether their absentee ballot was counted,\" Brinson Bell said in the statement. \"That is not necessary, and it would lead to longer lines and the possibility of spreading COVID-19.\"", "We asked the state board of elections about Trump's distinction between \"solicited\" and \"unsolicited\" mail-in ballots and were told that none of the state's voters are receiving \"unsolicited\" mail-in ballots.", "While some advocacy groups and political parties have sent absentee ballot request forms to voters, North Carolina State Board of Elections spokesman Patrick Gannon told us in an email, \"No one is receiving an absentee by-mail ballot who did not request one through the proper process.\"", "Trump's mention of \"unsolicited ballots\" is likely a reference to universal mail-in voting, in which states automatically send registered voters mail-in ballots. This system is only in place in nine states and the District of Columbia. North Carolina is not one of them.", "NCSBE.gov.   \"A Message from Karen Brinson Bell to NC Voters.\"\r\n    3 September 2020.", "Lee, Jessica.   \"Do Mail-In Ballots Increase Risk of Voter Fraud?\"\r\n    Snopes.   26 May 2020.", "Higgins, Tucker.   \"Twitter Slaps Warning Labels on Trump Tweets That Suggest Voting Twice.\"\r\n    CNBC.   3 September 2020.", "Love, Juliette, et al.   \"Where Americans Can Vote by Mail in the 2020 Elections.\"\r\n    The New York Times.   14 August 2020.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]