["BJP media panellist Yashveer Raghav shared a poster of a protest rally against the Citizenship Amendment Act (2019) which allegedly mentions that the dress code for women attendees is ‘Hijab or Burqa’. He wrote, “If you want to take part in protests against CAA and NRC (provisions for which are yet to be implemented), you have to wear burqa or hijab. These people want to push the country toward Sharia law.”", "[Translated from गजब ! अगर आप #CAA2019 और #NRC (जिसको लाने का अभी तक कोई विचार तक नहीं हुआ है) के विरुद्ध आयोजित प्रदर्शन में भाग लेना चाहते है तो आपके लिए बुर्का और हिजाब पहनना अनिवार्य है। ये लोग देश को शरिया कानून की तरफ बढ़ाने की चाहत में अग्रसर है।]", "Prashant Patel Umarao, an infamous name in the misinformation ecosystem, also circulated the claim on both Twitter and Facebook. He wrote, “Protest is against CAA but the dress code is hijab and burqa. They’ll get freedom from patriarchy and manuvad by wearing burqa and hijab. In simple words, this isn’t an all-India protest but a show of strength. Hindu’s patience is being tested.”", "[Translated from प्रोटेस्ट CAA के विरुद्ध है लेकिन ड्रेस कोड हिजाब और बुरका है। पितृसत्ता और मनुवाद से आजादी हिजाब और बुरका पहनकर मिलेगी। सीधे शब्दों में, यह देश भर में आंदोलन नहीं हो रहा, बल्कि शक्ति प्रदर्शन है और देश के हिंदुओं के धैर्य की परीक्षा ली जा रही है।]", "A keyword search on Twitter leads one to the original poster.", "1. The sentence ‘Dress code for women: Hijab or Burqa’ has been added and a morphed poster has been presented on social media. Amir Edresy, who identifies himself as ‘Founder President, Association of Muslim Professionals’ on Twitter shared the poster on January 15, 2020. It informs about a women’s protest organised by Mumbai Citizens Forum against CAA, NRC and NPR to held at YMCA Ground, Agripada in Mumbai on January 17 at 6 pm.", "Massive Women’s Protest Against #CAA #NRC & #NPR At YMCA Ground, Agripada, Mumbai", "At 6PM On Friday, 17th January", "Let’s join in Large numbers!!!", "Organized By: Mumbai Citizens Forum pic.twitter.com/4wqxF6XxOu", "— Aamir Edresy (@aamiredresy) January 15, 2020", "Alt News contacted Aamir Edresy from Mumbai Citizens Forum, who is a part of the organising committee of the protest. “This is mischevious. The protest is open to every person irrespective of faith. There is no dress code,” he said.", "The original poster was also tweeted by the handle ‘CAA / NRC Protest info.’ on January 16.", "#Mumbai Massive Women’s Protest against CAA / NRC / NPR", "17th January @ 6 pm pic.twitter.com/ofL9pt2M2h", "— CAA / NRC Protest Info. (@NrcProtest) January 16, 2020", "2. Another giveaway that the poster has been morphed is the use of lower case alphabet. All words are written in capital letters on the original poster.", "3. The sentence ‘Dress code for women: Hijab or Burqa’ is not aligned with the rest of the text on the poster, as indicated by the red margin on the image below.", "A Twitter handle #IndiaFirst (@savitha_rao) was among those who shared the morphed poster. “So women of all faiths have to dress in burkha or hijab? In addition to Rs 500 and biryani will there be a clothing Allowance too?” reads the tweet. The handle is followed by prime minister Narendra Modi.", "Another user Saurabh Singh, who is followed the PM in addition to union minister Piyush Goyal and BJP spokesperson Tajinder Bagga, also tweeted the edited poster.", "Several other users followed by PM Modi have propagated the misinformation.", "For a women’s protest on CAA, the dress code is Burqa/Hijab", "Is this how they will fight patriarchy? pic.twitter.com/UlYJKWwXdB", "— Vasudha (@WordsSlay) January 17, 2020", "An anti-CAA poster was morphed to falsely depict that the rally demands all women adorn a hijab or a burqa.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]