["The various images in this archived Facebook post here show the inside of a ramshackle building, which appears to house an illegal bottling operation of soft drink brands.", "The claim, in full, reads: “Fake coke manufactured in Matero makes its way into Zambian market. The product has been under manufacturing in Matero for the past 1 year 8 months. This is according to a suspect who was apprehended by a mob in Garden area where he was mistaken for a gasser (sic).”", "Large barrels, makeshift manufacturing tools and ingredients are also pictured with what looks like packaged stock ready for shipping.", "Other similar claims locating the site in Zambia were posted here and here.", "However, reverse image searches of the pictures show their widespread use in several pages of articles, some going back as much as five years.", "According to our searches, one of the earliest online sightings of the images appeared on a chat forum here on September 17, 2015.", "It describes a raid in a Pakistani village called Gujranwala where hazardous chemicals, food colouring, and flavourings were used to make black market soft drinks. Four people were reportedly arrested.", "Multiple pictures were published and a basic internet search of the terms “food authority Gujranwala fake coke” returned a similar article by Mangobaaz. The Pakistani social news website credits the images to City District Government Gujranwala.", "This led to a Facebook page of the same name with a more detailed version of the raid in this September 16, 2015, post.", "One of the pictures shows two uniformed policemen wearing branded golf shirts. In the same photo, one of the officers is wearing a cap with the Pakistani flag on the side.", "The Zambian posts try to link the claim to reported “gas” attacks in the country and corresponding incidents of vigilante violence -- read a detailed report on these issues by AFP Fact Check here.", "The same images have been used in other false contexts, for instance to discourage South Africans from buying soft drinks from “Indian and Somali shops”, as described in this debunk by verification website Africa Check", "Other claims about counterfeit soft drinks in Nigeria and Kenya have also relied on the images.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]