["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "U.S. Sen. Rob Portman, R-Ohio, debated Democratic challenger Ted Strickland at the City Club in Cleveland on Oct. 20, 2016.", "Former Ohio Gov. Ted Strickland tied Sen. Rob Portman to the notorious former president of Haiti, Jean-Claude \"Baby Doc\" Duvalier, during the final Ohio Senate debate.", "\"There's only one of the two of us standing before this audience that's ever been a registered lobbyist, and that's you, senator,\" Strickland said. \"Your first job as a lobbyist was with the Chinese-based firm. You were a registered foreign agent, and your client was Haiti, at a time when the Baby Doc, Duvalier, who was a despot, was killing people.\"", "Strickland’s charge is a mixed bag of accuracy.", "After losing his re-election bid to Republican Gov. John Kasich, Strickland oversaw the lobbying and activism arm of the Center for American Progress, a liberal think tank, but he was not a lobbyist himself.", "There’s no doubt that Portman, however, was a registered foreign agent, a title that can involve lobbying.", "As PolitiFact Ohio has previously reported, Portman started working with the law firm Patton, Boggs & Blow after graduating from University of Michigan's law school in 1984.", "The Strickland campaign sent us a Buzzfeed article showing Portman’s 1985 foreign agent registration form. He was listed as a foreign agent on behalf of the Republic of Haiti, which was ruled by Duvalier at the time.", "Duvalier, who inherited the \"president for life\" post from his father, \"Papa Doc,\" headed what human rights workers called one of the most oppressive governments in the Western Hemisphere, according to the New York Times. His regime, known for the murder and torture of of tens of thousands, was toppled in 1986.", "But it’s not entirely fair to imply that Portman was Duvalier’s lackey. He never lobbied on behalf of Haiti or any other foreign government.", "In 2005, Portman was named by President George W. Bush as his U.S. Trade Representative, a position that can’t be held by anyone who’s ever lobbied for foreign governments.", "Being tapped for the position prompted an affidavit from Stuart Pape, a former managing partner of Portman's law firm dated April 12, 2005. Pape said Portman filed the foreign agent registration form because he was working for the Hong Kong-based Duty Free Shoppers, Ltd., the \"Chinese-based firm\" Strickland referred to.", "But Pape said he reviewed the records and confirmed that Portman did no work for Haiti or any foreign government.", "On Portman’s campaign website, the Haiti registration is explained as \"standard procedure\" at the lobbying firm, and required of all of its attorneys. The firm, the record shows, did travel to Haiti to meet with Baby Doc.", "Our ruling", "Strickland said of Portman, \"You were a registered foreign agent, and your client was Haiti, at a time when the Baby Doc, Duvalier, who was a despot, was killing people.\"", "Portman was a registered foreign agent who worked on behalf of a company based in Hong Kong. His firm’s clients included \"Baby Doc\" Duvalier’s government. But Portman himself did no work for the Haitian regime, according to a sworn statement by the firm’s managing partner.", "We rate Strickland's statement Mostly False.", "Correction: The original version of this fact-check incorrectly called Rob Portman a registered lobbyist. He was a registered foreign agent, a classification that included lobbying under the law at that time.", "Email interview with David Bergstein, spokesman for Ted Strickland, Oct. 20, 2016", "Interview with Michawn Rich, spokeswoman for Rob Portman, Oct. 20, 2016", "PolitiFact, \"Ohio Democrats' ad ties Sen. Rob Portman to Haitian dictator,\" Aug. 23, 2016", "PolitiFact, \"Portman, Strickland duel over who's richer,\" Oct. 20, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]