["“These are the animals that killed a lot of people in toll gate,” claims one post that has been shared more than 10,000 times and is archived here.", "The image shows a number of individuals, most wearing some form of army fatigues, standing in a line in front of a wall.", "The “toll gate” mentioned in the post refers to the Lekki Toll in Lagos.", "Protests erupted in Nigeria in early October after a video of a man allegedly being killed by police went viral the month before. The rallies continued despite the dismantling of the controversial Special Anti-Robbery Squad (SARS) police unit and promises of government reform.", "The unrest worsened after soldiers opened fire on a large crowd at the Lekki Toll on October 20, 2020. The shooting has drawn international condemnation and boosted the global spread of the #EndSARS hashtag on Twitter. You can read AFP’s report about the unrest here.", "Since the Lekki incident, numerous posts have been making the rounds claiming to show the bodies of protesters killed at the rally. AFP Fact Check looked into some of the viral images and found them to have been unrelated to the protests. You can read our fact checks here and here.", "Likewise, the image of men dressed in Nigerian army uniforms does not show soldiers involved in the Lekki shooting and is unrelated to the protests.", "We ran multiple reverse image searches and found that the picture had been on the internet since May 2020.", "Reports in local media said the people in the picture were arrested in southwest Nigeria in May for impersonating Nigerian soldiers. These arrests, and others in April, formed part of the army’s “Operation Checkmate”, set up to investigate criminal activities within the force.", "Amnesty International says “at least 12 peaceful protesters” were killed in central Lagos on October 20, 2020, and 56 people have died overall since the demonstrations started.", "Lagos governor Babajide Sanwo-Olu said a special commission has been set up to investigate the Lekki shooting, including CCTV footage of the attack.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]