["The first video, posted by a Facebook group named “Kwarans”, has been shared more than 8,600 times and viewed by at least 109,000 people since it was uploaded on March 11 with the caption “Jail Bukola Saraki Buses Appear on London streets”. You can find an archived version here.", "We’ve been tracking the page, and it’s gained more than 1,500 new followers in the four days since the video was posted.", "The Facebook page followed its first video with a second (here's an archive link) a day later on March 12, showing a different London bus also supposedly displaying banner advertising which calls for Sakari to be jailed.", "The second video posted by Kwarans has also been shared on Instagram by Goldmyne TV, a verified Instagram account with more than 900,000 followers.", "The first video has also been shared by numerous YouTube accounts and on Twitter.", "The idea that anyone would be able to pay for such adverts to run on London buses seemed highly unlikely given that Transport for London (TfL), the city authority which operates the bus network, does not allow advertising which is overtly political -- you can read its advertising policy here.", "So, we asked TfL if it had any record of such adverts being placed on its buses. In a statement, the transport authority told AFP: “This is not a genuine advert running in London.”", "Often with cases of digital alteration like this one, it’s possible to track down the original footage to show that it’s been altered -- like we did with this fake video which purports to show US President Donald Trump endorsing Nigerian presidential candidate Atiku Abubakar.", "But in this case, video verification tools such as InVID did not throw up any older videos. All matches were uploaded to YouTube after March 11, when the video was uploaded to Facebook. It’s possible that the person who made the Saraki videos used their own footage of London buses.", "Nonetheless, a close look at the footage does yield immediate signs that these videos have been digitally altered. In both, the white banner of the advertising itself appears to be significantly brighter than the rest of the image. The text is also sharper.", "On the second video in particular, the surface of the advertisement appears unnaturally flat and shadowless.", "We’re helped here by the fact that in both cases the signage on the buses appears to be the only computer-generated part of the video, which makes the digitally altered parts stand out.", "The first video appears to be genuine footage filmed on Kilburn High Road in northwest London; you can see the location here on Google Maps.", "It is indeed a spot that lies on London’s 328 and 31 bus routes, the numbers seen on the two buses. The second video was filmed at Trafalgar Square looking down Whitehall towards Big Ben -- you can see the monument in the footage. As Big Ben is clearly visible, this video must have been filmed before the monument was covered in scaffolding in mid-2018 for renovation work. Similarly to the first video, London’s 91 bus route does indeed pass through this location.", "So how could someone have edited genuine video footage to add the text? As this video shows, it’s possible to stick text onto moving objects in a video using editing software:", "Saraki was a two-term governor of the north central state of Kwara from 2003 to 2011, representing the Peoples Democratic Party.", "He was elected into the Senate in 2011 and won a second term in 2015 after switching sides to join the All Progressives Congress (APC) of presidential candidate Muhammadu Buhari, who would go on to win office.", "Saraki immediately came into conflict with Buhari and the APC after he successfully lobbied to become leader of the upper chamber against their wishes and allegedly in breach of parliamentary rules.", "But after being cleared of corruption charges which he said were politically motivated, he returned to the PDP in 2018 to seek a third term in this year’s recent elections.", "In another twist, however, Saraki suffered a heavy defeat in the February 23 elections, and will not be returning to the Senate once his current mandate ends on May 29.", "Some APC supporters have been calling for Saraki to be prosecuted for corruption after he steps down, without giving more specific allegations of wrongdoing.", "The dual British-Nigerian citizen has long been seen as having presidential ambitions but he was dogged by accusations of corruption even before his political career took off.", "His father Abubakar Olusola Saraki was a leading figure in post-independence politics who served as Senate majority leader in the late 1970s and was considered a \"kingmaker\" in his home state of Kwara.", "The younger Saraki was also chairman of the Societe Generale Bank of Nigeria, which collapsed in 2006 amid allegations of financial mismanagement that the family denies.", "The failed corruption case against him, from 2015 to 2018, saw him charged with failing to disclose all his assets during his time as governor of Kwara.", "Prosecutors alleged he had acquired wealth beyond his legitimate earnings.", "Documents submitted to the hearing showed properties in the wealthiest areas of Lagos and London, luxury cars, shares and bank accounts in his wife and children's names.", "Dozens of senators and politicians attended the court hearings to offer support for the powerful politician.", "As the case rumbled on, leaked documents in the \"Panama Papers\" saw him accused of failing to declare offshore assets in his wife Toyin's name.", "In both the court case and the Panama Papers scandal, Saraki maintained he had done nothing illegal.", "Further accusations have followed, including that he was linked to a gang that carried out a brutal armed robbery in Kwara state last April that saw 33 people shot dead.  Saraki called the claim \"baseless\".", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]