["About this rating", "Motivational quotes are rife online, but unfortunately inspirational words are often fabricated, misattributed, or attached to photographs of unrelated public figures. So when an image of Lady Gaga started to circulate on social media in February 2019 shortly after the singer won an Academy Award for \"Best Song,\" along with a bit of text supposedly spoken by her about an ex-boyfriend, some viewers were skeptical that the quote was authentic:", "The purported statement from Lady Gaga read: \"I had a boyfriend who told me I'd never succeed, never be nominated for a grammy, never have a hit & hoped I'd fail. I said to him someday, when we're not together, you won't be able to order a cup of coffee at the fucking deli without hearing or seeing me.\"", "These words were indeed spoken by Lady Gaga, although not during her acceptance speech at the 2019 Academy Awards or at any other time related to the February 2019 awards season.", "This quote was nearly a decade old at the time it was popularized, as it came from a 2010 cover story interview with Lady Gaga published by Cosmopolitan magazine:", "The full interview is not available online, but other web outlets such as Huffington Post and MTV published excerpts from it (emphasis ours):", "While Lady Gaga might seem like an overnight success, she's faced roadblocks along the way. The pop star has had quite a few people, including an ex-boyfriend who probably regrets letting her go, tell her that she couldn't make it. In the April issue of Cosmopolitan, Gaga talks about beating the odds.", "\"I had a boyfriend who told me I'd never succeed, never be nominated for a Grammy, never have a hit song and that he hoped I'd fail,\" said Gaga, whose issue hits newsstands March 9. \"I said to him, 'Someday, when we're not together, you won't be able to order a cup of coffee at the f---ing deli without hearing or seeing me.\"", "It wasn't just ex-lovers who didn't think that Gaga could go all the way, but Gaga didn't let the criticism get to her. \"I ate sh-- for so long,\" she explained. \"Being told I didn't fit the mold and that I was 'too pop' or 'too theater' ... I've always been delusionally ambitious to the point where people don't understand me.\"", "Lady Gaga was nominated for her first Grammy Award in 2008. By the time this interview was published in April 2010, her figurative trophy shelf was lined with five Grammy Awards.", "Lady Gaga's acceptance speech at the 2019 Academy Awards also centered on fighting for one's dreams, although it included no mention of any ex-boyfriends:", "\"All I have to say is that this is hard work. I've worked hard for a long time and it's not about winning, but what it's about is not giving up. If you have a dream fight for it ... and it's not about how many times you get rejected ... it's about how many times you stand up and are brave and you keep on going. Thank you,\" she said.", "Of course, we can merely verify that Lady Gaga quoted these words. Whether they constitute something a former boyfriend truly said to her, only she knows.", "Velez, Jennifer.   \"Lady Gaga's 2019 Oscars Acceptance Speech: 'If You Have a Dream, Fight for It.'\"\r\n    Grammy.com.   25 February 2019.", "Huffington Post.   \"Lady Gaga in Cosmo: My Ex Said I’d Fail.\"\r\n    27 April 2010.", "Vena, Jocelyn.   \"Lady Gaga Says Her Ex-Boyfriend 'Hoped I'd Fail.'\"\r\n    MTV.   25 February 2010.", "Spines, Christine.   \"Lady Gaga Wants You.\"\r\n    Cosmopolitan.   27 February 2010.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]