["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "President Joe Biden speaks during a news conference in the East Room of the White House, March 25, 2021, in Washington. (AP)", "The number of children arriving at the border grew 63% from January to February 2021, more than double the rate Biden cited. The increase was about 33% in 2019, roughly in line with his claim.", "Migration usually increases month-to-month from January to March.", "This year’s numbers of Border Patrol encounters are projected to be the highest in 20 years.", "President Joe Biden sought to downplay the current surge of migrants arriving at the southern border, saying it’s due not to his policy but is the result of a normal seasonal pattern and driven by difficult circumstances in their home countries.", "\"Truth of the matter is, nothing has changed. As many people came, a 28% increase in children to the border in my administration, 31% in the last year, in 2019, before the pandemic in the Trump administration,\" Biden said during a press conference March 25. \"It happens every single solitary year. There is a significant increase in the number of people coming to the border in the winter months of January, February, March. It happens every year.\"", "The early months of the year, he said, are when \"they can travel with the least likelihood of dying on the way because of the heat and the desert.\"", "PolitiFact decided to fact-check Biden’s claims that the increase in children arriving during his time in office is similar to what happened in 2019, and that the increased arrivals at the border are part of a seasonal pattern.", "For this analysis, we looked specifically at encounters with Border Patrol agents, who apprehend people suspected of illegally entering the United States. And we looked at data from January and February 2021, the latest months for which data are available, compared with the same months in 2019.", "Here’s what the numbers showed for Border Patrol encounters with children who arrive alone:", "January 2021: 5,694\nFebruary 2021: 9,297\nMonth-to-month increase: About 63%", "January 2019: 5,105\nFebruary 2019: 6,817\nMonth-to-month increase: About 33%", "So while Biden’s number for 2019 was close to the mark, he understated the rate of increase of children arriving in 2021 by more than half.", "Counting all migrants — children, families and single adults — there was a 28% increase from January to February 2021, but Biden’s claim was about just children. In 2019, the increase for that period was 39%.", "Biden also said that every year, \"there is a significant increase in the number of people coming to the border in the winter months of January, February, March.\"", "Typically, southern border apprehensions start picking up in those months: February numbers exceed January’s, and March’s numbers top February’s. The one exception over the past two decades was fiscal year 2017, during Donald Trump’s first months in office.", "Even with the seasonal trend, Alejandro Mayorkas, secretary of homeland security, said earlier this month that the U.S. is \"on pace to encounter more individuals on the southwest border than we have in the last 20 years.\"", "Biden said there was a \"28% increase in children to the border in my administration\" and \"31% … in 2019.\" The increase in migration in January, February and March \"happens every year.\"", "Biden is wrong about the increase in children’s arrivals during his administration — it’s 63%, more than twice what he said. His figure for 2019 was roughly accurate.", "Biden is correct that rising border apprehensions in February and March are part of a seasonal pattern, but his claim ignores that the total number of encounters this year is likely to be the highest in 20 years.", "The statement contains an element of truth but ignores critical facts that would give a different impression. We rate it Mostly False.", "Rev.com, President Joe Biden First White House Press Conference Transcript March 25, 2021", "Email interview, White House press office, March 26, 2021", "CBP.gov, U.S. Border Patrol southern historical data on apprehensions; Southwest Border Migration FY2017; Southwest Land Border Encounters", "DHS.gov, Statement by Homeland Security Secretary Alejandro N. Mayorkas Regarding the Situation at the Southwest Border, March 16, 2021", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]