["About this rating", "On 29 January 2017, a community member at the Daily Kos posted in a string of tweets by \"The Resisterhood\" account, which claimed that because President Donald Trump had filed early for re-election, it means that nonprofit organizations cannot oppose him without risking their nonprofit status. The story, which was widely shared, was created in a portion of the site that allows Daily Kos community members to create their own posts:", "Under the Internal Revenue Code, all section 501(c)(3) organizations are absolutely prohibited from directly or indirectly participating in, or intervening in, any political campaign on behalf of (or in opposition to) any candidate for elective public office. Contributions to political campaign funds or public statements of position (verbal or written) made on behalf of the organization in favor of or in opposition to any candidate for public office clearly violate the prohibition against political campaign activity. Violating this prohibition may result in denial or revocation of tax-exempt status and the imposition of certain excise taxes.", "It is true that President Trump filed a letter on Inauguration Day, 20 January 2017, notifying the Federal Elections Commission that he has met the legal threshold for filing for reelection in 2020 (though the letter says that it is not a formal candidate announcement).", "The move appears to be geared toward getting a fundraising head start, as legal experts agree that Trump becoming a de facto candidate for 2020 on his first day in office will have no effect on the activities of charities. In the era of perpetual campaigning, tax laws have been interpreted by the Internal Revenue Service to mean that charities are free to criticize or praise public office holders so long as they avoid electioneering — which they are prohibited from doing anyway, said Marc Owens, a Washington, D.C.-based attorney who represents nonprofit organizations:", "Even though Trump is a candidate for the 2020 election now that he's registered, that really should not stop any charity from commenting on how he’s doing as president of the United States now as long as they don't put in in the context of the 2020 election... The reality is that as long as they don't mention the election, which they shouldn't be doing anyway as charities, they're going to be fine.", "He added the caveat: \"That’s assuming Trump obeys the law.\"", "The Lawyers Alliance for New York later sent out a notice addressing the rumor:", "False Rumor: Nonprofit organizations cannot criticize President Trump because he filed a “Statement of Candidacy” form with the Federal Election Commission regarding the 2020 election.", "True: Organizations with 501(c)(3) status cannot take a position on who should win an election, such as the 2020 Presidential election. But all public charities can:\n• criticize or praise sitting public officials, including the President, for actions that they take while in office.\n• take a position on issues, such as environment, refugees, or school reform.\n• take a position on specific government actions, including Executive Orders, and proposed laws and regulations.", "Taking such a position may count towards a public charity’s limit on lobbying activity, and if the charity spends more than a minimal amount of money on this activity it may be required to register as a lobbyist, but only if it asks a public official to act or asks members of the public to contact a public official.", "Notre Dame law professor Lloyd Hitoshi Mayer agreed, saying in the modern era, most politicians are in a constant state of campaigning, whether they are formally declared as candidates or not:", "Charities can praise or criticize [for example] representatives as long as they do it in a way that’s about them being in the House. The views [of the IRS] has always been obviously you can praise or criticize someone because they're a public official, as a public official, even if they're running.", "Loyola law professor Ellen Aprill concurred, noting that Trump himself had advocated for lifting the prohibition on charities and campaigning:", "It seems inconsistent with the intent behind the campaign intervention prohibition for a president to prevent 501(c)(3)'s from criticizing his policies and actions by declaring a candidacy so far in advance.  Moreover, Trump is on record as wanting to eliminate the campaign intervention prohibition, although we have not seen anything on that since he became President.", "Nonprofits can address current topics like the environment, President Trump's proposal to build a new U.S.-Mexico border wall, or his recent executive order restricting refugee entry into the United States. They are also free to litigate on causes, as the American Civil Liberties Union and Citizens for Responsibility and Ethics in Washington have done in recent high-profile cases. The fact that he has filed campaign paperwork with the FEC early does not mean any of these organizations are suddenly muzzled.", "Mayer also pointed out that pro-President Trump nonprofits are under the same laws as all the others, which casts further doubt on his early re-election filing being about anything other than getting a fundraising advantage.", "Pollwatcher. \"Trump Filed For Reelection In 2020 On Jan 20 2017.  Why It Matters.\"\r\nDaily Kos (community post). 29 January 2017.", "The Restriction of Political Campaign Intervention by Section 501(c)(3) Tax-Exempt Organizations\r\nInternal Revenue Service.", "Lawyers Alliance for New York. \"Nonprofit Organizations Can Speak Out About Controversial Government Actions.\"\r\n31 January 2017.", "Gold, Matea, and Narayanswamy, Anu. \"Trump already has socked away more than $7 million for his 2020 reelection.\"\r\nThe Washington Post. 31 January 2017.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]