["“Biden Fakes Interview, Green Screen Fails,” says the title of a YouTube video uploaded on March 17, 2021 and viewed more than 500,000 times.", "The video shows the president walking toward reporters on the White House lawn, until one of his hands appears to go through a microphone, which some viewers interpreted as proof that reporters were not actually present.", "“Biden is the most transparent president is history, he’s so transparent that he can move through physical objects,” one of them commented.", "The YouTube user who uploaded the video wrote in his description that the footage “proves the reporters were not there.”", "Speculation that the interaction between Biden and reporters was faked seems to have begun on Twitter on March 17, 2021 after users said that footage published by ABC News and The Hill appeared suspicious.", "“Joe Biden is 100% standing in front of a green screen,” one Twitter user wrote. Instagram and Facebook users have also shared the claim.", "However, the interpretation of the video is wrong.", "The interaction between Biden and reporters took place on the White House lawn on March 16, just before he boarded Marine One for a flight to Pennsylvania to promote his Covid-19 relief plan.", "Steve Herman, the White House correspondent for Voice of America, was the one holding the large fuzzy gray microphone that Biden’s hand appears to go through. On Twitter, he shut down the claims as “nonsense.”", "I was the one holding the lighter-colored fuzzy microphone and thus literally in front of @POTUS on the South Lawn. It's all real. Who actually believes this 'faked moon landing' type nonsense and more importantly who is spreading it? https://t.co/9V3t0oqDz6", "Eric Baradat, AFP’s photo editor for North America, was among the media alongside Sebastian Smith, an AFP White House correspondent.", "“He walked out of the Oval Office and walked towards the small group of reporters,” Baradat told AFP by phone.", "After answering a couple of questions, “he walked towards Marine One, did a military salute to the Marine standing at the bottom of the stairs, and boarded the helicopter. Nothing extraordinary.”", "Baradat took several pictures of the president at the time, including the two below.", "Another photo, by Getty Images, shows the president and the microphones in the same frame.", "Other media organizations reported on the brief exchange, in which the president said he did not currently plan on going to the US southern border where migrant arrivals have surged, and that he would soon reveal which countries would receive surplus US Covid-19 vaccines.", "A video of the exchange published on C-SPAN shows that the president’s hand is likely to have been between the microphone and the camera. The impression that Biden’s hand went through a microphone may be an optical illusion linked to image distortion, as this Twitter user suggested.", "In a break with precedent, Biden is not scheduled to hold his first formal news conference until March 25, more than two months after he took office. This absence has led to criticism from various media outlets as well as some conservatives, and prompted online conspiracy theories.", "He does take a small number of questions at daily events, and his Press Secretary Jen Psaki gives a lengthy briefing to the press each day.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]