["A Facebook post wrongly claims U.S. Rep. Beto O'Rourke dismissed both veterans and elderly Americans.", "As rumblings of former U.S. Rep. Beto O’Rourke running for president gain traction, so do some questionable claims about the maybe-candidate’s platform.", "\"If I could throw two kinds of people in the garbage it would be the elderly and wounded veterans,\" reads the text under a photo of O’Rourke that was published on Facebook on Feb. 13. \"When a tool breaks you don’t fix it, you throw it in the damn trash.\"", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.) Is it true?", "\"Of course not,\" O’Rourke spokesman Chris Evans told PolitiFact. \"Beto has never said that, and it’s a fabricated quote.\"", "He pointed to O’Rourke’s position as a member of the House Veteran Affairs Committee and his work as \"the congressional representative for the large military community of El Paso,\" where the congressman is from.", "\"His leading bipartisan initiative to expand access to mental health care for veterans was passed in the House, passed in the Senate, and signed into law by the president,\" Evans continued. \"He held regular veteran town halls in El Paso to hear directly from those who wore our country’s uniform and ensure they had access to their representative in Congress.\"", "Trump vs. O'Rourke on immigration messaging in El Paso", "After searching online, we couldn’t find any sources to corroborate the claim that O’Rourke said vets and seniors should trashed.", "According to ProPublica’s list of the legislation O’Rourke sponsored during 2017-2018, he backed six bills related to veterans, including the Get Veterans a Better Doctor Now Act and the Enhanced Veteran Healthcare Act of 2017.", "During O’Rourke’s failed bid to oust Ted Cruz from the U.S. Senate, the Texas Tribune asked both lawmakers what three legislative accomplishments they were most proud of.", "\"The O’Rourke campaign passed along three measures that the El Paso Democrat saw signed into law by Trump,\" the Tribune reported, including two bills related to veterans and service members. \"O’Rourke was the primary sponsor of the Honor our Commitment Act, which expanded mental health care through the VA to veterans with ‘other-than-honorable’ discharges from the military. The measure was included in an omnibus spending bill in March.\"", "The Tribune notes a blog post O’Rourke wrote earlier on March 2017 describing veteran suicides.", "\"This figure shows an unacceptable gap in health care coverage for our nation’s most vulnerable veterans,\" O’Rourke said in the blog post on Medium.", "We rate the made-up Facebook post Pants on Fire!", "Facebook post, Feb. 13, 2019", "Email interview with Chris Evans, communications director for Beto O’Rourke, Feb. 13, 2019", "ProPublica, Bills sponsored by Beto O’Rourke, visited Feb. 14, 2019", "The Texas Tribune, \"Ted Cruz and Beto O’Rourke entered Congress at the same time. Here’s what they have accomplished,\" Nov. 2, 2018", "Medium, \"Honor our Commitment Act of 2017,\" March 22, 2017", "Beto for Senate campaign website, Veterans page, visited Feb. 14, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]