["A headline on an article posted on several websites falsely declares that President Donald Trump has made English the language of the land.", "\"Breaking! President Trump makes English the official language of the United States!\" the headline reads.", "It’s obvious in the story that follows, which discusses changes on the White House website, that something was lost in translation.", "We first saw the headline on DonaldTrumpPOTUS45.com on Jan. 26, 2017, but it has appeared on other sites in subsequent days. Facebook flagged the story as part of its efforts to combat fake news in user feeds.", "First off, English may be the de facto language of the United States, but the country has no designated official language. A majority of states do have laws making English their official language, albeit to varying degrees.", "Trump also did not elevate English in any official capacity, although he has certainly made it clear he would prefer citizens (including fluent Spanish speaker and former Florida Gov. Jeb Bush) speak it.", "\"Well, I think that when you get right down to it, we're a nation that speaks English,\" Trump said at a 2015 news conference. \"I think that, while we're in this nation, we should be speaking English.\"", "This is a prime example of a certain type of fake news story that spins news of a real event, then slaps a provocative and largely unrelated headline on it in an attempt to draw eyeballs.", "In this case, the body of the story clearly advocates for adopting English as an official language, and says Trump should do so. But the only news event alluded to is about the official White House website losing its Spanish translation after Trump was inaugurated.", "The post cites an article from the Los Angeles Times, which points out the translation option had been removed from WhiteHouse.gov on Jan. 20. As of Feb. 9, the Spanish translation of the White House website was still gone.", "The story making the rounds on the Internet, meanwhile, says Trump purposely directed his administration to remove the translation.", "Even if that were true — and there’s no solid evidence that’s the case — it’s far from making English the nation’s official language. That would require legislation through Congress, which has been proposed in the past but never became law.", "This incendiary headline woefully misrepresents the actual event to which it is tied. We rate it Pants On Fire!", "DonaldTrumpPOTUS45.com, \"Breaking! President Trump makes English the official language of the United States!,\" Jan. 26, 2017", "Washington Post, \"States where English is the official language,\" Aug. 12, 2014", "The Hill, \"GOP bill would make English official language of US,\" Feb. 13, 2015", "Breitbart.com, \"Exclusive — Donald Trump Fires Back at Jeb Bush: He Should Lead by ‘Speaking English’ While in the United States,\" Sept. 2, 2015", "Hollywood Reporter, \"Donald Trump: ‘While We're in This Nation, We Should Be Speaking English’,\" Sept. 3, 2015", "McClatchy DC Bureau, \"Trump fires up English-only debate with missing WhiteHouse.gov Spanish page,\" Jan. 23, 2017", "Los Angeles Times, \"No habla espanol? The White House website no longer speaks Spanish,\" Jan. 23, 2017", "Los Angeles Times, \"White House promises website will restore Spanish content: 'We're just building up',\" Jan. 24, 2017", "WhiteHouse.gov, Spanish page, accessed Feb. 9, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]