["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A sign supporting QAnon is hoisted at a May 14, 2020, protest rally in Olympia, Wash. (AP)", "• This conspiracy theory rests on a flawed interpretation of an 1871 bill that consolidated the different neighborhoods of Washington, D.C. into a single entity. The bill did not dissolve the government of the United States and turn the country into a corporation as some QAnon adherents claim.", "• The 20th Amendment changed the inauguration date from March 4 to Jan. 20.", "After President Joe Biden was inaugurated on Jan. 20, defying the predictions of QAnon supporters, some adherents of the conspiracy theory began to claim that his predecessor, Donald Trump, would actually be re-inaugurated as president on March 4, 2021.", "In recent weeks, social media posts have echoed this theory in posts.", "\"The Constitution of the United States had established March 4 as Inauguration Day. Trump will be our 19th president soon,\" reads one from Feb. 23 on Facebook.", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The advent of that date and mounting concerns about potential violence have led Washington, D.C. law enforcement to beef up security around the Capitol. During a hearing with defense officials, Rep. Adam Smith, D-Wash., announced that 5,000 National Guard officers would remain in D.C. through March 12 out of fear that the online chatter around the date would translate into real-world violence.", "\"Some of these people have figured out that apparently 75 years ago, the president used to be inaugurated on March 4. Okay, now why that's relevant, God knows,\" Smith said.", "Why does this date have relevance for some QAnon supporters? And how do their claims stack up against the evidence?", "U.S. presidential inaugurations were originally held on March 4. Although not specified in the original text of the Constitution, the precursor body to the U.S. Congress picked March 4 as the date that it handed off power to the new government. The 12th Amendment officially set the date as March 4. And in 1933, the 20th Amendment to the Constitution changed the inauguration date to Jan. 20 in order to shorten the presidential transition.", "But some QAnon adherents maintain that the 20th Amendment was never adopted and that any president sworn in on Jan. 20 is not a legitimate president, said Travis View, a disinformation researcher and host of the QAnonAnonymous podcast.", "Their reasons for believing this are complex, but the general idea rests on a misreading of the District of Columbia Organic Act of 1871, also titled \"An act to provide a government for the District of Columbia.\"", "According to Chris Edelson, an assistant professor of government at American University, the act consolidated the different neighborhoods of Washington into a single governing entity called a municipal corporation. However, some QAnon adherents believe that the statute effectively dissolved the U.S. government and turned the entire country into a business. Adherents of this theory believe all laws passed after 1871 are illegitimate, including the 20th Amendment, and all presidents since Ulysses S. Grant have held office illegally.", "As a result, some adherents maintain that Trump will return on March 4, the original inauguration date, and be sworn in as the 19th president of the restored United States.", "There’s no validity to the theory. The Organic Act of 1871 didn’t incorporate the entire United States.", "\"None of (the Organic Act) has anything to do with the rest of the United States, or the validity of any constitutional amendments or laws enacted after 1871,\" said Michael Morley, a law professor at Florida State University.", "The belief that Trump will be re-inaugurated on March 4 is controversial within the broader QAnon community, View noted, saying that all of the high-profile QAnon influencers he is aware of have pushed back on the March 4 date.", "\"They’re calling it a false flag operation,\" View said.", "A Facebook post says Donald Trump will be re-inaugurated as president on March 4, 2021.", "This conspiracy theory rests on a flawed interpretation of an 1871 bill that consolidated the different neighborhoods of Washington, D.C., into a single entity.", "The 20th Amendment to the Constitution changed the inauguration date from March 4 to Jan. 20. And on Jan. 20, 2021, Joe Biden was sworn in as the 46th president for a term of four years.", "This claim is inaccurate and ridiculous. We rate it Pants on Fire! ​", "A Facebook post, Feb. 23, 2021", "Interview with Chris Edelson, Assistant Professor of Government at American University, Mar. 3, 2021", "Interview with Michael Morley, Associate Professor of Law at Florida State University, Mar. 3, 2021", "Constitution Center, On this day, government begins under the Constitution, Mar. 4, 2020", "CNN, Nearly 5,000 National Guard troops to remain in Washington through mid-March due to concerns about QAnon chatter, Feb. 17, 2021", "An act to provide a government to the District of Columbia, Feb. 21, 1871", "Right Wing Watch, ‘Hold the line’: QAnon adherents claim Trump will become president again on March 4, Feb. 10, 2021", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]