["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Sen. Tina Smith, D-Minn., took to Twitter recently to tout her support for a $15 minimum wage.", "In the tweet, Smith wrote that \"one of the proudest things I did\" as lieutenant governor serving under Democratic Gov. Mark Dayton was helping to raise Minnesota’s state minimum wage to $9.50 an hour.", "\"Now, I’m proud to back a bill to raise the minimum wage to $15 per hour by 2024,\" she wrote, referring to a measure introduced by Sens. Bernie Sanders, I-Vt., and Patty Murray, D-Wash.", "Currently, the federal minimum wage is $7.25, though states can set higher levels if they wish — and a majority do, from a small amount more than the federal level to $11.50 in Washington state.", "In a threaded tweet, Smith gave some historical perspective on the minimum wage:", "\"The federal minimum wage hasn’t been raised in a nearly a decade. Taking into account inflation, the federal minimum wage is actually worth less than what it was worth 50 years ago. And prices for everything from milk to prescriptions has skyrocketed.\"", "The federal minimum wage hasn’t been raised in a nearly a decade. Taking into account inflation, the federal minimum wage is actually worth less than what it was worth 50 years ago. And prices for everything from milk to prescriptions has skyrocketed.", "We wondered if Smith was correct, so we looked at the data.", "Back in 1968, the minimum wage was set at $1.60. That is equivalent to $11.76 in today’s dollars, which is well above today’s minimum wage level and an all-time high when adjusted for inflation. (We used the Bureau of Labor Statistics’ inflation calculator for this purpose.)", "Over the last 50 years, the situation in 1968 — greater purchasing power for the minimum wage than today — has been common, though not universal.", "By contrast, we only found seven years in which today’s minimum wage is able to buy more than a previous minimum wage could. (Those years were 1989, 1995, 2003, 2004, 2005, 2006 and 2007.)", "Here’s the full chart, with the inflation-adjusted value of the minimum wage shown in red:", "All told, then, the minimum wage has been worth more than it is today for 86 percent of the time over the past 50 years, and less than today’s during 14 percent of that time.", "Smith said, \"Taking into account inflation, the federal minimum wage is actually worth less than what it was worth 50 years ago.\"", "Smith’s strict comparison with 50 years ago is accurate, and her comparison even holds for most years out of the past 50, suggesting that the year she picked is not an unreasonable choice.", "We rate the statement True.", "Tina Smith, threaded tweet, May 21, 2018", "Federal Reserve Bank of St. Louis, \"Federal Minimum Hourly Wage for Nonfarm Workers for the United States,\" accessed May 22, 2018", "Bureau of Labor Statistics, inflation calculator, accessed May 22, 2018", "Congressional Research Service, \"Inflation and the Real Minimum Wage: A Fact Sheet,\" Jan. 8, 2014", "Bernie Sanders, \"Sanders, Murray Announce $15 Minimum Wage Bill,\" April 26, 2017", "National Conference of State Legislatures, state minimum wage index page, accessed May 22, 2018", "PolitiFact, \"Fact-checking a $15 minimum wage,\" May 9, 2016", "Email interview with Gary Burtless, economist at the Brookings Institution, May 22, 2018", "Email interview with Ed Shelleby, deputy chief of staff for Tina Smith, May 22, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]