["The Facebook post, which we’ve archived here, says, 'Due to high rate of teenage pregnancy, condoms will be part of stationery in 2020'.", "More posts surfaced days later on another fake Facebook account here, shared more than 300 times. South African tabloid The Daily Sun also published an article on November 5, debunking the Facebook post, adding some of the reactions it provoked from social media users.", "However, a cropped image of the newspaper version of The Daily Sun’s article was taken out of context and shared online. These misleading posts have been shared thousands of times here and here.", "A spokesman for the Department of Basic Education (DBE) condemned the post as ‘fake news’, expressing his frustration that ‘we need to spend time distancing ourselves from the fake news’.", "“Fake NEWS!! It keeps happening and some people fall for these images. Be careful because it will make you angry for no reason because it is just trash,” said DBE spokesman Elijah Mhlanga.", "“People have time to manufacture nonsense that creates panic, anger and shock. We should also stop spreading it because we give them joy when it receives so much attention. WhatsApp groups are full of these things.”", "“It’s annoying that we need to spend time distancing ourselves from the fake news,” Mhlanga added in his Facebook post, along with two pieces of misleading content.", "A search on Facebook shows multiple accounts for the department, for example here, here and here. However, poor spelling and humorous content suggests many of them are fake.", "The real accounts to follow are DBE SA on Facebook, which links back to the official website and DBE_SA on Twitter, a verified account.", "The DBE policy on HIV, STIs and TB approved in 2017 allows pupils aged 12 and older access to male and female condoms, as well as information on how to use them -- see local news here.", "Last week, the South African education department launched a campaign aimed at 'streamlining efforts by governments across the regions to reduce the alarming rates of early and unintended pregnancies among adolescents and young people'.", "Minister Motshekga with the learners of Mamelodi High School singing the \"Let's Talk\" Early and Unintended Pregnancies Pledge which aims to ensure learners delay sexual debut and focus on school activities. @ElijahMhlanga pic.twitter.com/7rDrXeupuJ", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]