["By Robert Farley", "Posted on November 8, 2017", "President Donald Trump has once again misused the example of Chicago to make a case against gun regulations.", "Despite what the president claims, Chicago does not have “the strongest gun laws in our nation.” It once did, but the laws that gave it that distinction have since been rescinded. And a spike in homicides occurred after those laws were changed.", "Trump also called Chicago “a disaster.” That’s an opinion, but it’s worth noting that other cities – some with less stringent gun laws – have higher rates of gun violence.", "Experts also warn against cherry-picking cities to score political points, as examples can be found to fit arguments on either side. They also note that Chicago, which has stricter laws than most cities, is bordered by states that have relatively lax gun laws. And there is some evidence that most of the guns confiscated from crimes in Chicago come from out of state.", "Finally, as we have written before, there is no evidence that gun control laws result in higher murder rates. In fact, studies suggest the opposite: States with a higher number of firearm restrictions have lower firearm deaths. But there is only an association between gun control laws and firearm deaths, not a causal relationship, studies show.", "Trump’s latest comment about Chicago gun crime came when he was asked if he would consider any gun control policies in the wake of the mass shooting at a Texas church on Nov. 5.", "“I mean, you look at the city with the strongest gun laws in our nation, is Chicago, and Chicago is a disaster,” Trump said during a press conference in Korea on Nov. 7. “It’s a total disaster.”", "This is a longstanding talking point for Trump, who tweeted in July 2014:", "The most stringent gun laws in the U.S. happen to be in Chicago – and look what is happening there!", "— Donald J. Trump (@realDonaldTrump) July 10, 2014", "Trump made the same point during the third presidential debate, saying: “In Chicago, which has the toughest gun laws in the United States, probably you could say by far, they have more gun violence than any other city. ”", "White House Press Secretary Sarah Huckabee Sanders made a similar claim during a press briefing on Oct. 2 after the Las Vegas mass shooting. “I think if you look to Chicago, where you had over 4,000 victims of gun-related crimes last year, they have the strictest gun laws in the country,” Sanders said. “That certainly hasn’t helped there.”", "Here are some facts about gun violence in Chicago and what they say, and don’t say, about the role of gun control.", "Chicago used to have what some considered to be the toughest gun laws in the country. But not anymore.", "In 2010, the U.S. Supreme Court struck down Chicago’s handgun ban. In the year before the court’s ruling, Chicago’s murder rate in 2009 was 16.1. The city with the highest murder rate that year was New Orleans at 51.7 murders for every 100,000 people.", "And in 2013, Chicago also abolished its requirement that gun owners register their weapons. The move was made to come into compliance with the state’s court-mandated concealed carry law.", "“Chicago does have strong municipal laws, but we wouldn’t say it has the strongest gun laws in the country, because the strongest regulations in Chicago have been largely implemented by entire states, including New York and California,” Hannah Shearer, a staff attorney and Second Amendment litigation director at the Giffords Law Center to Prevent Gun Violence, told us via email. “In contrast, the state of Illinois has significantly weaker laws than New York and California, including a shall-issue concealed carry permit system.”", "The Law Center to Prevent Gun Violence gave a B+ grade to Illinois in its latest “Gun Law State Scorecard.” Seven states had a higher grade.", "It’s true that the total number of murders in Chicago spiked in 2016. The number of murders recorded that year — 764 — was nearly 58 percent higher than in 2015. In raw numbers, that was higher than any other major city in the U.S., according to data from the Major Cities Chiefs Association.", "But the murder rate in Chicago wasn’t the highest.", "The per-capita murder rate in Chicago – the number of homicides per 100,000 residents – was 27.9 in 2016. That’s half the rate recorded by St. Louis, at 59.3, which saw 188 murders in 2016. Among major cities, Chicago’s rate was eighth highest in 2016. (Ninety-three percent of the murders in the city that year involved firearms.)", "And again, those high tallies in 2016 came after Chicago did away with its gun registry and ban on handguns.", "It should also be noted that the number of homicides in Chicago is trending down so far this year. According to the Sun-Times, there were 580 homicides in the first 10 months of 2017, down 10 percent from the 644 homicides recorded during the same period in 2016.", "Shootings and homicides in Chicago “are still high by urban American standards right now, but the trend appears to be downward,” John Pfaff, a professor of law at Fordham Law School, told us via email. “There’s still two months in the year, but that pushes back against the ‘disaster’ story.”", "Shearer also notes that “Chicago is vulnerable to guns coming in from neighboring states. A few states bordering Chicago, such as Indiana, have extremely weak gun laws.”", "A 2017 gun trace report from the Chicago Police Department found that since 2013 the “overwhelming majority” of recovered “crime guns” that were traceable “were originally purchased outside of the city limits and brought into Chicago.” And the majority were from other states.", "Pfaff added the caveat that police could only trace 12,500 of the 28,000 guns seized during the study period, so the origin of most guns could not be determined.", "Still, the report suggests that many of the guns used in Chicago crimes come from outside the city — watering down the effectiveness that any local gun laws might have. And so experts warn it would be unwise to draw definitive conclusions, as the president did, about the effectiveness of gun control efforts in Chicago.", "“That is a silly argument,” David Hemenway, director of the Harvard Injury Control Research Center, told us via email. “That would be similar to someone arguing that pest control doesn’t work with an example where only one kitchen is treated in an apartment complex filled with cockroaches. Chicago is surrounded by easy places for criminals to get guns. … There are lots of places where gun control (and pest control) has a much better chance to work and does work.”", "As for the president’s implication that stricter gun laws either don’t work or lead to higher rates of homicide, studies suggest that’s not the case. In fact, they show an association, but not a proven causal relationship, between strict gun laws and lower rates of gun violence.", "According to the Law Center to Prevent Gun Violence scorecard, seven states graded as having the strongest gun laws also were among those with the lowest gun death rates.", "And as we have written before (on several occasions), several studies have shown that states with a higher number of firearm restrictions have lower firearm deaths. But there is only an association between gun control laws and firearm deaths, not a causal relationship, studies show. In other words, the studies do not prove that the stricter laws are responsible for lower homicide rates.", "It’s misleading for Trump to cite Chicago as evidence that gun control laws don’t reduce gun violence. Chicago no longer has “the strongest gun laws in our nation,” and it doesn’t have nearly the highest homicide rate among major cities. Most traceable guns recovered from crimes also come from outside the city limits.", "FactCheck.org Rating:", "Read More", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]