["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "President Barack Obama spoke to fellows of the Young Southeast Asian Leaders Initiative at the White House on June 1, 2015.", "President Barack Obama expressed pride in how the global image of the United States has improved on his watch during a White House event with fellows of the Young Southeast Asian Leaders Initiative.", "\"People don’t remember -- when I came into office, the United States in world opinion ranked below China and just barely above Russia,\" Obama said. \"And today, once again, the United States is the most respected country on Earth.\"", "We wondered whether it was true that the United States today is \"the most respected\" country on Earth, so we took a closer look. The evidence we found is something of a mixed bag.", "When we asked the White House for supporting evidence, they pointed us to a periodic survey by Gallup. The most recent Gallup poll, covering 2014 and released April 21, 2015, is based on face-to-face and telephone interviews with approximately 1,000 adults, age 15 and older, in each of more than 130 countries.", "The Gallup poll asks respondents whether they approve of the leadership of the United States, Germany, the European Union, China and Russia.", "In 2014, the United States finished first among this group. The median approval rating for the United States was 45 percent. That contrasts with 2008, President George W. Bush’s last year in office, when the U.S. scored 34 percent, trailing Germany, the European Union and China. That year, Russia was a bit lower at 30 percent.", "The White House added that the Pew Research Center backs up the notion that the country’s image has improved under Obama.", "\"America’s image began to rally in some nations and to soar by the end of the decade following the election of Barack Obama, at least in Europe and parts of Asia and Latin America,\" Pew wrote in 2014. \"After slipping a bit again in the first years of this decade, brand U.S. has stabilized and even recovered in a few nations in 2014.\"", "But a different survey we found showed that the United States trailed other countries.", "Every year, the BBC publishes a survey that asks people for their opinions about a variety of countries’ \"influence on the world.\" The most recent survey was conducted between December 2013 and April 2014. A total of 24,542 people were asked to rate 16 countries and the European Union on whether their influence in the world was \"mostly positive\" or \"mostly negative.\"", "The results of the BBC poll placed the United States in the middle of the pack, with a slightly larger number of respondents answering \"mostly positive\" than \"mostly negative.\"", "This result ranked the United States behind Germany, Canada, the United Kingdom, France, Japan, the European Union and Brazil in positivity, and ahead of China, South Africa, South Korea, India, Russia, Israel, North Korea, Pakistan and Iran.", "Our ruling", "Obama said that today, \"the United States is the most respected country on Earth.\"", "International polling by Gallup has found that, in a reversal from the Bush era, the United States now finishes first compared to a limited group of countries -- Germany, China, Russia and the European Union. But a BBC poll that tested a broader group found the United States finishing in the middle of the pack, behind Germany, Canada, the United Kingdom, France, Japan, the European Union and Brazil.", "We rate Obama’s claim Half True.", "Barack Obama, remarks to fellows of the Young Southeast Asian Leaders Initiative, June 1, 2015", "Gallup, \"Russia Receives Lowest Approval in World; U.S. Highest,\" April 21, 2015", "Pew Research Center, \"Global Opposition to U.S. Surveillance and Drones, but Limited Harm to America’s Image,\" July 14, 2014", "BBC, \"Russian image has deteriorated -- BBC World Service poll,\" June 4, 2014", "Email interview with Bruce Stokes, director of global economic attitudes in the Pew Research Center's Global Attitudes Project, June 2, 2015", "Email interview with Eric Schultz, White House spokesman, June 2, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]