["About this rating", "Voting in the 2020 U.S. Election may be over, but the misinformation keeps on ticking. Never stop fact-checking. Follow our post-election coverage here.", "On the evening of Nov. 4, 2020, as election totals showed U.S. President Donald Trump trailing his opponent, Democratic candidate Joe Biden, two converging theories emerged to explain the turn of events: Too many votes were being counted (an argument that appeared to be based on unfounded accusations of voter fraud), or not enough votes were being counted (an argument apparently based on a debunked conspiracy theory about ballots being unfairly thrown out).", "On social media, a video went viral that showed Trump supporters chanting \"count that vote\" in one instance and contradictory \"stop the vote\" in another.", "Both of these videos are real.", "The video on the left was taken outside of Maricopa, County, Arizona, and shows a group of Trump supporters chanting \"count the vote.\" The Washington Post reported that more than 100 protesters wearing MAGA hats and draped in Trump 2020 banners congregated outside a  ballot-processing center\" to protest the election. The crowd appeared to be driven by the debunked claim that ballots marked with Sharpies were being discounted and chanted \"count the votes\" while demanding to be let into the facility:", "They chanted in unison, “Count the votes!” and “Let us in!” as police kept the group away from a building where officials labored for the second straight night to process ballots in Arizona’s most populous county, which could sway a tight race between President Trump and former vice president Joe Biden.", "Many of the protesters were galvanized by an unfounded claim that swaths of pro-Trump ballots had been disqualified because voters used Sharpies to mark their choices, a rumor some dubbed “SharpieGate.” ... Rep. Paul A. Gosar (R-Ariz.) tweeted about the rumor Wednesday morning and later showed up to speak at the protest.", "As we reported earlier, ballots marked with Sharpies are being counted.", "The video on the right shows a similar protest in Detroit, Michigan. At that protest, people were upset that too many votes were being counted. Early vote totals showed Trump securing the lead in Michigan, but the results started to swing in Biden's favor as mail-in ballots started being counted, a trend that was common across many states. This led to unfounded accusations of fraud, and chants of \"stop the vote\" and \"stop the count.\"", "PBS reported:", "The Detroit protests started shortly before The Associated Press declared that former Vice President Joe Biden had won Michigan.", "Video shot by local media showed angry people gathered outside the TCF Center and inside the lobby, with police officers lined up to keep them from entering the counting area. They chanted “Stop the count!” and “Stop the vote!”", "Earlier, the Republican campaign filed suit in a bid to halt the count, demanding Michigan’s Democratic secretary of state allow in more inspectors. Trump has repeatedly insisted without evidence that there are major problems with the voting and the counting.", "Michigan Attorney General Dana Nessel, a Democrat, insisted both parties and the public had been given access to the tallying “using a robust system of checks and balances to ensure that all ballots are counted fairly and accurately.”", "The 2020 presidential election has been bombarded with misinformation. You can keep up with the latest rumors here on our live blog.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]