["Protesters gather at Chicago's O'Hare International Airport on Nov. 29, 2016, as part of a nationwide protest for a $15 per hour minimum wage. (AP/Kiichiro Sato)", "Democrats have countered President Donald Trump’s message of positive economic growth by trying to highlight parts of the economy that haven’t been so strong on his watch.", "Recently, Democrats found a potent example: wage stagnation.", "House Minority Leader Nancy Pelosi, D-Calif., was among a number of Democrats and liberal groups that shared this assertion about wages following the passage of Trump’s tax cut. On July 26, she tweeted a link to a Vox.com article, adding:", "Paul Ryan on June 24th: \"Wages are rising.\"\n\nReality: \"Between the first and second quarters of 2018 — after the tax cuts were enacted — real wages fell by 1.8 percent.\"", "Paul Ryan on June 24th: \"Wages are rising.\"Reality: \"Between the first and second quarters of 2018 — after the tax cuts were enacted — real wages fell by 1.8 percent.\" 👇https://t.co/ltygIwhFGv", "Others who tweeted the same talking point included the Democratic Governors Association and the Fight for 15 coalition, which pushes for a higher minimum wage.", "The talking point about plummeting wages is at best outdated, given the release of new information. In addition, the data cited is not one of several official measurements, and it appears to be a statistical outlier.", "The statistic reached its widest audience after Vox published an article citing it July 23. The finding was previously noted in a Bloomberg column July 18 and, even earlier, in a CBS News article July 11.", "The first thing to know is that the wage data in question did not come from longstanding government statistical series. Rather, it came from the PayScale Index, a calculation made by a private group. That doesn’t necessarily mean it’s a problematic source, but it does mean that it needs to be weighed against the wage statistics compiled by the federal government, which are considered the gold standard.", "When the 1.8 percent decline first hit the media, official statistics from the Bureau of Labor Statistics were not available for that same quarter — the second quarter of 2018. However, by the time Democrats and their allies began tweeting about the PayScale data, the second-quarter BLS data had become publicly available.", "When we looked at a standard BLS measurement for wages — median usual weekly inflation-adjusted earnings for full-time wage and salary workers — we found that this measurement actually rose slightly between the first and second quarter of 2018, from $350 a week to $351 a week.", "That's an increase of less than three tenths of 1 percent, rather than down by 1.8 percent.", "Gary Burtless, a Brookings Institution economist, suggested three additional BLS statistics to consult: average hourly earnings for all private employees; hourly earnings for manufacturing; and the employment cost index for private industry workers.", "Burtless adjusted each of these statistics for inflation and created an index showing how much each of the four wage measures had increased since the end of 2007. (In his system, the final data point of 2007 is pegged at 100, with any subsequent number above 100 showing how much it rose compared to the 2007 reference point.)", "Here’s his final graph.", "Key: Blue = average real hourly earnings of all private employers; red = hourly earnings for manufacturing; green = median usual weekly real earnings for full-time wage and salary workers; purple = employment cost index: wages and salaries for private industry.", "Generally speaking, the four BLS statistics have moved in tandem, showing wage increases above inflation since 2014, with a bit of a slowdown since 2016. At worst, wages are going sideways or moving slightly higher in the most recent quarter — not suddenly crashing, as the PayScale data indicated.", "\"I don’t think there’s any evidence I would trust that inflation-adjusted wages have declined noticeably, either over the entire Trump administration or in the period since Congress passed the new tax law,\" Burtless said.", "Dean Baker, an economist with the liberal Center for Economic and Policy Research, concurred.", "\"It’s certainly fair to say real wages are not rising rapidly, and depending on the index chosen and the exact time period, they could even be falling slightly, but there is no plausible story where they fell 1.8 percent between the first and second quarter,\" Baker said.", "A spokesman for Pelosi said the tweet -- which was written by staff, not Pelosi -- \"quotes word for word\" from the Vox article and attached the link \"for full context and openness.\"", "PayScale, for its part, acknowledges that comparing the PayScale Index to other BLS statistics \"is comparing apples to pears.\" In a blog post, the company’s chief economist and vice president of data analytics, Katie Bardaro, wrote that the PayScale Index is designed to capture how workers’ wages change as they switch companies, while a BLS measure like the Employment Cost Index does not.", "She concluded, \"Be careful of spurious comparisons of distinct measures and be sure to understand the underlying methodology of any metric you bring into your data arsenal.\"", "Pelosi tweeted, \"Between the first and second quarters of 2018 — after the tax cuts were enacted — real wages fell by 1.8 percent.\"", "There's a grain of truth, in that one unofficial measurement did produce that finding. But it is an outlier. Official statistics contradicted that, showing stable or modestly rising wages. Those were available before the recent social media traffic. We rate the statement Mostly False.", "Nancy Pelosi, tweet, July 26, 2018", "Federal Reserve Bank of St. Louis, \"Employed full time: Median usual weekly real earnings: Wage and salary workers: 16 years and over ,\" accessed July 31, 2018", "PayScale, PayScale Index, July 10, 2018", "CBS News, \"Worker wages drop while companies spend billions to boost stocks,\" July 11, 2018", "Bloomberg, \"Trump’s Tax Cut Hasn’t Done Anything for Workers,\" July 18, 2018", "Vox.com, \"How the Republican tax cuts are failing workers, in one chart,\" July 23, 2018", "Gary Burtless, custom graph using Bureau of Labor Statistics wage data, July 31, 2018", "PayScale, \"How the PayScale Index Differs from Other Economic Indicators,\" July 26, 2018", "Email interview with Dean Baker, economist with the Center for Economic and Policy Research, July 31, 2018", "Email interview with Gary Burtless, senior fellow at the Brookings Institution, July 31, 2018", "Email interview with Phyllis McNeice, spokeswoman for PayScale, July 31, 2018", "Email interview with Henry V. Connelly, deputy communications director for Nancy Pelosi, July 31, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]