["White House counselor Kellyanne Conway offered several possibilities for how President Donald Trump will build a wall across the southern border, including a tax on goods crossing from Mexico to the United States.", "Conway went on to decry the United States’ trade deficit with Mexico during an interview with CBS’ Charlie Rose, calling \"repatriation of funds\" a \"very big piece of President Trump’s vision for this country.\"", "\"Here's the fact,\" Conway said on Jan. 27, 2017. \"The No. 1 source of income into Mexico are Mexicans working here and sending the money back.\"", "This would be more appropriately considered an alternative fact. Conway does have a point that \"remittances\" (as they are officially called) from individuals in the United States constitute a significant boost to the Mexican economy, and they may be of enormous importance to the individual families on the receiving end.", "However, they are far from the country’s No. 1 source of income. (The White House did not respond to an inquiry for this article.)", "BBVA Bancomer, a Mexican economic forecaster, has projected that once all the data for 2016 is tallied, Mexicans will have sent $27 billion in remittances into Mexico in 2016 -- a one-year record, and an increase of more than $2 billion over 2015. (Part of the reason for the uptick, the group says, was a surge in remittances in November with Trump’s election, driven by widespread concerns that he may cut off remittances in the future.)", "These totals are in line with U.S. government data.", "However, we found at least two different types of money flows from the United States to Mexico that are bigger than remittances.", "Ranking first is the money spent by United States consumers and companies on good old-fashioned Mexican exports -- everything from manufactured goods to oil to agricultural products.", "According to federal data, the United States in 2015 imported Mexican goods totaling $295 billion. That pot of money is more than 10 times bigger than the amount of remittances.", "The biggest category of Mexican exports to the United States -- auto vehicles and parts -- was by itself north of $100 billion in 2015, according to the Census Bureau.", "In addition, foreign direct investment by the United States totaled $28 billion in 2015 -- a bit higher than the projected remittances for 2016 and clearly higher than the total of remittances for 2015, which was $24.8 billion. Foreign direct investment is defined as \"investment from one country into another, normally by companies rather than governments, that involves establishing operations or acquiring tangible assets, including stakes in other businesses.\"", "Three experts in U.S.-Mexico economic ties -- Jeffrey J. Schott, a senior fellow at the Peterson Institute for International Economics; Mary C. King, a Portland State University economist; and Robert A. Blecker, an American University economist -- concurred with our analysis of the data.", "\"Remittances are important -- just far from No. 1,\" Blecker said. \"And from a Mexican point of view, it’s a huge disappointment that remittances are so high relative to foreign direct investment and tourism, which would be much more positive sources of income. Nevertheless, they are not the biggest -- not nearly.\"", "Our ruling", "Conway said, \"Here's the fact. The No. 1 source of income into Mexico are Mexicans working here and sending the money back.\"", "A projected $27 billion influx of cash from the United States into Mexico is nothing to sneeze at, and this money makes a real difference in the lives of many Mexicans who have relatives living and working in the United States, whether legally or illegally.", "However, contrary to what Conway said, remittances do not rank No. 1 on the U.S.-Mexico income flow list. Rather, U.S. purchases of Mexican goods -- to say nothing of services -- are more than 10 times the size of remittances. And remittances also trail foreign direct investment as a source of income in Mexico. We rate the statement False.", "Kellyanne Conway, interview with CBS This Morning, Jan. 27, 2017", "U.S. Census Bureau, \"U.S. Imports from Mexico by 5-digit End-Use Code, 2006-2015,\" accessed Jan. 30, 2017", "Office of the U.S. Trade representative, Mexico main page, accessed Jan. 30, 2017", "Woodrow Wilson International Center for Scholars Mexico Institute, \"Foreign Direct Investment in Mexico,\" Apr 4, 2016", "Government Accountability Office, \"International Remittances: Actions Needed to Address Unreliable Official U.S. Estimate,\" February 2016", "Observatory of Economic Complexity, Mexico main page, accessed Jan. 30, 2017", "BBVA Research, \"Faced with possible restrictions, remittances grew by 24.7% in November,\" Jan 6, 2017", "Reuters, \"Remittances to Mexico jump by most in 10 years after Trump win,\" Jan. 2, 2017", "J.W. Mason (John Jay College economist), \"What Exactly Does Mexico Export to the US?\" (blog post), Jan. 27, 2017", "Financial Times, definition of foreign direct investment, accessed Jan. 30, 2017", "Email interview with  Jeffrey J. Schott, senior fellow at the the Peterson Institute for International Economics, Jan. 30, 2017", "Email interview with Mary C. King, Portland State University economist, Jan. 30, 2017", "Email interview with Robert A. Blecker, American University economist, Jan. 30, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]