["About this rating", "On Oct. 26, 2020, a social media post alleged English actress Kate Winslet said she held her breath for \"seven minutes and 14 seconds\" underwater while filming \"Avatar.\"", "The tweet, displayed below, included a photo of Winslet fully submerged underwater in a wetsuit, and was from the official account of the sci-fi movie franchise by James Cameron.", "The claim was true. While shooting Avatar 2 — which was scheduled to open in theaters in December 2021, as of this writing — Winslet trained to do \"underwater performance capture\" that required her to hold her breath for several minutes underwater while videographers recorded her movements.", "While speaking at an IMAX event to promote a different project in February 2019 (video here), \"Avatar 2\" producer Jon Landau said:", "We built a water tank that was 500,000 gallons of water, and we are doing performance-capture under the water, on the surface of the water, and above the water. We trained our cast to free-breath-hold, because in the sequences they have to just be swimming, they can’t be on scuba, and they have to be able to do long takes. [...]", "Kate Winslet had to train in this and she got up to a static breath hold of just about seven minutes. [...] You see Kate going underwater and she just felt so comfortable. There was one day, we have a tank where she was just rehearsing and testing and we have some windows into it, and I go in there and she’s just walking on the bottom [of the tank] left and right, left and right, left and right, then she sees me in the window and she just waves. I couldn’t believe it!", "Then, more than year later, on Aug. 26, 2020, The Hollywood Reporter published a profile story about Winslet, in which she told the writer: \"I had to learn how to free-dive to play that role in 'Avatar', and that was just incredible. My longest breath hold was seven minutes and 14 seconds, like crazy, crazy stuff.”", "It was unclear why the Avatar Twitter account advertised the stunt more than two months later with the photo and alleged quote by Winslet, which went viral. Media outlets ranging from Business Insider to Fox News to People covered the tweet, and Winslet did another round of interviews about the stunt. She told Entertainment Tonight for a story that published Nov. 10:", "It was brilliant and I was very proud of myself and I'll probably never be able to do it again. [...] That came at the end of four weeks worth of quite intense training and it was in the dive tank, it was in the training tank. But I loved it.", "According to Guinness World Records, 24 minutes and roughly three seconds is the global record for someone holding their breath underwater.", "In sum, considering the visual evidence of the underwater film, which was released from the verified Twitter account of the Avatar franchise, as well as the interviews by Winslet in which she described holding her breath for \"seven minutes and 14 seconds,\" we rate this claim \"True.\"", "Jessica Lee is Snopes' Senior Assignments Editor with expertise in investigative storytelling, media literacy advocacy and digital audience engagement.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]