["The photo was published in this Facebook post on August 7, 2020. It has been shared 51,000 times.", "The Thai-language caption translates to English as: “A woman went shopping in a shopping mall, and was assaulted. Her wrist was slashed and her gold bracelet was stolen. So scary and the wound was really deep! Gold is expensive these days, don’t wear gold in the mall or market, etc. It attracts the thief’s attention. This happened in the middle of the mall.”", "The photo was published alongside similar claims here, here and here.", "A similar photo and claim was also shared on Line, the messaging app.", "It translates to English as: “Central Ladprao, a woman went shopping and was assaulted -- her wrist slashed and gold necklace stolen. So scary right now and the wound is very deep.”", "Central Ladprao is a branch of the Central Department Store located in the northeast of Bangkok.", "The misleading claim comes amid the surge in gold prices worldwide, AFP reported here that gold prices hit US$2,000 an ounce as investors see gold as a refuge in the economic uncertainty.", "The photo, however, is being used in a misleading context.  The thief was armed with a knife but did not slash the victim’s wrist to take her gold bracelet, Royal Thai Police said.", "During a phone conversation with AFP on August 11, Pol.Lt.Gen. Anantajak Kanoknopwa, Deputy Commander of the Patrol and Special Operation Division under the Royal Thai Police said: “The thief used a knife to threaten the lady as he attempted to take her purse. The lady panicked and was accidentally cut -- it was a minor injury.”", "“The thief was apprehended at the scene and will be prosecuted.”", "Viritsamalar Aroonlert, a spokesperson of Central Pattana, the retail property development and investment company that founded Central department store denied the misleading claim and said the robbery took place in Central Pinklao, another branch of Central Department store.", "“The thief was caught with the help of citizens and the department store’s security guards,” she told AFP on August 10, 2020, on the phone.", "Central Pattana clarified the robbery incident in the statement issued on August 8, 2020.", "Sent by Aroonlert to AFP via Line, the statement reads: “Central Department Store didn’t neglect the incident that happened on July 31, 2020. Central Department at Pinklao branch was able to identify the thief within five minutes and collaborate with the police to prosecute the culprit. As for the victim, her finger was lightly injured, but she wasn’t robbed for gold or slashed on the wrist as the news claimed.”", "Amarin TV, Thailand’s digital TV channel, also published this report on August 8, 2020 about the department store robbery.", "Part of the report translates to English as: “There are additional reports that a  police officer from Bangyikhan Metropolitan Police Station said that this incident was not a gold robbery, but the culprit aimed to take the victim’s iPhone. The victim was lightly injured on her left hand. The department store sent her to Chao Phraya hospital and she is in good condition.”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]