["By Eugene Kiely", "Posted on March 24, 2021", "Arizona Gov. Doug Ducey exaggerated the rise in people trying to cross the southern border illegally under President Joe Biden, when he said there has been a “460% spike in illegal apprehensions.”", "As we recently wrote, border apprehensions started to rise prior to the election under then-President Donald Trump and have continued to go up under the Biden administration. The increase under Biden, however, has not been nearly as great as Ducey claimed.", "Ducey made his remarks in an interview with Martha Raddatz, host of ABC News’ “This Week,” who toured the southern border with the governor. Ducey, a Republican, said there has been a “460% spike in illegal apprehensions, over 100,000 people in custody,” and blamed “the reverse of the Biden administration of the Trump policies, and it needs attention.”", "The 460% figure caught our attention, so we asked the governor’s office for Ducey’s source. A spokesperson for the governor referred us to U.S. Customs and Border Protection data for “border encounters.”", "“The Governor based his comments on total apprehensions from April 2020 (17,106) to February 2021 (100,441),” Bobby Charette told us in an email.", "That’s actually a 487% increase, but it’s misleading. The governor’s office is using the wrong data and cherry-picking dates.", "CBP data for “border encounters” includes “inadmissibles,” who are “individuals encountered at ports of entry who are seeking lawful admission into the United States but are determined to be inadmissible.”", "Ducey referred to “illegal apprehensions” — and his office referred to “total apprehensions” — so we looked at data for “border apprehensions.” There were 96,974 apprehensions in February, not quite the 100,000 that the governor said.", "But, more importantly, Ducey compares the February data with April 2020, when both the U.S. and Mexico responded to the coronavirus pandemic with economic shutdowns.", "Apprehensions dropped to 16,182 in April 2020. But then, they started to rise again, increasing noticeably in late summer and fall. By October, 69,022 people were apprehended on the southwest border — a 327% rise from April.", "So, apprehensions were rising while Trump’s policies were in place and before the Nov. 3 election that would ultimately result in Biden’s victory. That trend continued after Biden took office, as the chart below shows.", "Ducey blamed Biden’s policies for the rise, but the Democratic president didn’t take office until Jan. 20.", "Comparing Trump’s last full month in office in December (71,047) to Biden’s first full month in office in February (96,974), apprehensions have risen 36% — not 460%.", "For more about the increase in apprehensions and its causes, see our March 23 article “The Facts on the Increase in Illegal Immigration.”", "Editor’s note: FactCheck.org does not accept advertising. We rely on grants and individual donations from people like you. Please consider a donation. Credit card donations may be made through our “Donate” page. If you prefer to give by check, send to: FactCheck.org, Annenberg Public Policy Center, 202 S. 36th St., Philadelphia, PA 19104.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]