["A purported screenshot of the website of Pakistani daily Dawn shows a headline dated June 10, 2020, which reads, “Pilot caught pissing in the cockpit of PAF F-16, said urine increases efficiancy of Jets told by Allah in his dream.” Facebook page ‘We Support Arnab Goswami’ posted this picture on January 1, 2021, where it was shared more than 180 times at the time of writing (Archive link)", "This image is also getting a lot of traction on Facebook.", "Alt News did not find any media reports corroborating the ‘news’ of a pilot urinating in a fighter plane in Pakistan. Neither could we locate any such news story on Dawn’s website.", "Furthermore, we noticed that the headline shown in the picture contains several mistakes which are as follows:", "1. The word ‘efficiency’ is misspelt here as ‘efficiancy’.", "2. A few words in the sentence start with a capital letter.", "3. The headline contains the word ‘pissing’, whereas media outlets generally use the more formal term ‘urinating’.", "4. There is a full stop at the end. However, this is not the standard practice as headlines do not contain any punctuation at the end.", "These errors make it clear that this screenshot is fake. To confirm this, we also looked through Dawn’s website. There is a lot of difference between the viral screenshot and what the stories on the website look like. The font of the headline on the site looks extremely different from the one in the viral picture. The difference is apparent in a side by side comparison of the two images below.", "A similar screenshot of an alleged Dawn story regarding the disappearance of an F-16 jet had gone viral earlier. The daily itself published a fact-check report on the claim. We discovered that the same screenshot has been used this time as well, just with an edited headline. The two also share a common date, June 10, 2020.", "To sum it up, a variety of fake claims was made on social media with an edited screenshot from the website of the Pakistani newspaper Dawn. This alleged story about a pilot urinating in a fighter plane is completely false.", "Donate Now", "Kinjal Parmar holds a Bachelor of Science in Microbiology. However, her keen interest in journalism, drove her to pursue journalism from the Indian Institute of Mass Communication. At Alt News since 2019, she focuses on authentication of information which includes visual verification, media misreports, examining mis/disinformation across social media. She is the lead video producer at Alt News and manages social media accounts for the organization.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]