["“America will never be destroyed from the outside. If we falter and lose our freedoms, it will be because we destroyed ourselves,” says text accompanying an image of Lincoln -- president during the Civil War -- in a June 7, 2020 Facebook post.", "The post implies that the protests, which were sparked by 46-year-old black man George Floyd’s May 25 death at the hands of a white Minneapolis police officer, are aimed at discrediting US President Donald Trump.", "“The Democrats and their allies in the media have been devastated by their lack of success in taking down America’s most resilient President. The recent violence and unrest in America is not an accident,” the post says of the White House incumbent.", "Other posts attributing the quote to Lincoln appear here and here on Facebook, here and here on Instagram, and here and here on Twitter.", "But it is not a real quote from Lincoln, who was assassinated in April 1865, just days after the surrender of Confederate general Robert E. Lee.", "“It’s a corruption of a quote Lincoln actually said in his Lyceum speech, which is… one of the first major speeches Lincoln gave,” Christian McWhirter, Lincoln Historian at the Abraham Lincoln Presidential Library and Museum, told AFP by phone.", "Lincoln expert Harold Holzer agreed, saying by email that the US leader “never said this,” though “it’s been widely attributed to him by everyone from the AOC group to Donald Trump.”", "The real quote from Lincoln’s 1838 speech to the Young Men’s Lyceum in Springfield, Illinois is thematically similar to the one attributed to him in the Facebook posts, but the wording is entirely different.", "“At what point then is the approach of danger to be expected? I answer, if it ever reach us, it must spring up amongst us. It cannot come from abroad. If destruction be our lot, we must ourselves be its author and finisher. As a nation of freemen, we must live through all time, or die by suicide,” Lincoln said in the speech.", "Michael Burlingame, who holds the Chancellor Naomi B. Lynn Distinguished Chair in Lincoln Studies at the University of Illinois Springfield, said the current popularity of citing Lincoln may be due to the fact that he was America’s leader during the worst crisis in the country’s history.", "“In an exceptionally stormy time, people may be drawn to a leader who steered the ship of state successfully through the nation's greatest storm,” Burlingame told AFP by email.", "McWhirter, meanwhile, said people write to inquire about Lincoln quotes several times a month, and that “more often than not, they’re not true.”", "“Lincoln’s an authority, so people love to... credit things to him cause it gives it more weight,” he said.", "AFP Fact Check previously debunked a series of quotes falsely attributed to George Washington, the first US president.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]