["About this rating", "Did actor Drew Carey appear on a Fox News in a \"Make America Great Again\" (MAGA) hat and an \"Off the Wall\" suit? That question was on the minds of many social media users when a still image from a Fox & Friends segment was circulated on social media in May 2019:", "? He’s a brick... house.\nHe’s whitey whitey\nAnd racist without a doubt ? pic.twitter.com/88exO0BVOq", "— The Volatile Mermaid (@OhNoSheTwitnt) May 22, 2019", "While the pictured person may qualify as a Drew Carey doppelganger, that person isn't actually the host of The Price Is Right game show appearing on Fox News wearing a hat with bearing President Donald Trump's campaign slogan.", "The Fox News guest seen above is actually Blake Marnell, a supporter of President Trump. Marnell received a bit of viral attention in May 2019 when Trump noticed him standing in the crowd at a rally  in Pennsylvania garbed in an \"Off The Wall\" brick-print costume suit and decided to bring him up on stage:", "President Trump had some fun during his rally in Montoursville, Pennsylvania, where he spotted a man wearing suit with a brick wall pattern.", "As Trump was boasting the 500 miles of wall that will be built by the end of next year, which prompted the signature \"Build the wall\" chant. He then pointed to the unique MAGA hat-wearing supporter.", "\"Can we get him up here?\" Trump asked. \"Get him up here! Look at this guy!\"", "After being invited up on stage, Marnell was invited onto Fox & Friends. On 22 May 2019, Marnell, dressed in a MAGA hat and his brick-print suit, appeared on the popular morning show.", "The Price Is Right host Drew Carey did not appear on a Fox News show in a MAGA hat. In fact, that outfit would be a bit out of character for Carey, because he doesn't appear to be much of a fan of President Trump:", "Sorry. I can’t take it anymore. Trump can’t tell lies like that and expect people to be quiet. I love this country too much for that.", "— ???? ????? (@DrewFromTV) January 24, 2017", "Wulfsohn, Joseph.   \"Trump Invites Supporter Wearing Wall Suit to Pennsylvania Rally Stage.\"\r\n    Fox News.   21 May 2019.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]