["Mask-wearing causes people to contract bacterial pneumonia.", "There is no evidence for this.", "Covid-19 is no longer classified as a high consequence infectious disease.", "Correct. That doesn’t mean it’s not dangerous.", "A post on Facebook suggests that wearing a mask causes people to contract bacterial pneumonia and that the government manipulated Covid-19 statistics to create fear when Covid-19 is no longer classified as a high consequence infectious disease (HCID).", "There’s no evidence that mask-wearing causes bacterial pneumonia. It’s unclear what is meant by Covid-19 statistics being manipulated. It’s correct that Covid-19 is no longer classified as an HCID, but that doesn’t mean it’s not dangerous.", "Honesty in public debate matters", "You can help us take action – and get our regular free email", "I’m in", "There is no evidence that mask-wearing increases the risk of contracting bacterial pneumonia. Claiming a link between masks and pneumonia is not new, and it has been debunked by various fact checkers.", "The Associated Press looked into this claim in June, and were told by infectious disease specialist and professor of global health and medicine at Boston University, Davidson Harmer that there is “no evidence of masks leading to fungal or bacterial infections of the upper airway or the lower airway as in pneumonia”. He said theoretically bacterial growth could occur if someone wore a mask that was contaminated with moisture and became mouldy, but that was highly unlikely with normal mask use.", "The UK government recommends people wash their face covering regularly.", "The Facebook post explicitly refers to someone wearing a mask to work, so it’s worth noting a 2014 study in the Journal of Preventive Medicine found that wearing a respirator mask significantly reduced the risk of bacterial infections, such as pneumonia, in healthcare workers. It also found that wearing a surgical face mask reduced the risk, though not significantly.", "It’s unclear from the post what is meant when it is claimed the government has “manipulated Covid-19” statistics but it may refer to death statistics which have been a constant bone of contention during the pandemic.", "There are various statistics on Covid-19 deaths, each with their own benefits and drawbacks.", "The figures produced daily record the number of people who have died within 28 days of a positive Covid-19 test (there is also data on deaths within 60 days of a positive test for England specifically). One benefit of these figures is that they can be produced very quickly and so give an almost instant insight into the situation.", "But these figures are imperfect. They may capture people who died of something unrelated to Covid-19 following a positive test. Conversely, they may exclude people who died of Covid-19, but more than 28 days (or 60 days) after they tested positive.", "Also, because this data only records deaths following a positive test, they exclude anyone who died of Covid-19 but was not tested. This is likely not that much of an issue when looking at the latest figures, but is when looking at the total death toll, given that testing was scarce at the beginning of the pandemic.", "Other statistics relate to death certificates. When someone dies, a medical professional fills out a death certificate listing their causes of death. One of these is determined to be the “underlying cause”, the condition “that initiated the train of events directly leading to death.”", "Most people with Covid-19 on their death certificate have Covid-19 listed as the underlying cause. In the latest week in England and Wales 88.5% of them did.", "These statistics give a better read of who has actually died of Covid-19. But, because they rely on deaths being officially registered, which can take some time, the figures aren’t as up to date.", "Ultimately though, the statistics are all pretty similar.", "To date 120,757 people in the UK have died within 28 days of a positive Covid-19 test. 129,498 deaths have listed Covid-19 on the death certificate.", "Not all UK nations regularly publish data on the number of deaths where Covid-19 was recorded specifically as the underlying cause. But if we assume that 88.5% of death certificates mentioning Covid-19 listed it as the underlying cause would give a figure of around 115,000 deaths.", "Finally the post claims that Covid-19 is no longer classified as a “high consequence infectious disease”. This is correct but it’s worth unpacking what that actually means.", "Covid-19 was first classified as an HCID in the UK on 16 January 2020, when it was still known as the “Wuhan novel coronavirus”. HCIDs are serious diseases that sometimes arrive in the UK from other countries, and have the potential to spread domestically.", "According to the UK government’s definition, an HCID has several features, such as having a high case-fatality rate. There are currently 16 diseases listed as HCIDs, including Ebola, SARS, MERS, monkeypox, plague and four severe strains of bird flu.", "The case fatality rate for these diseases—meaning the proportion of confirmed cases who then die—is high. For Ebola it is about 50% and SARS about 15%. Even a small outbreak of these diseases could potentially kill many people.", "Explaining why Covid-19 is no longer an HCID, the UK government said in March: “Now that more is known about COVID-19, the public health bodies in the UK have reviewed the most up to date information about COVID-19 against the UK HCID criteria. They have determined that several features have now changed; in particular, more information is available about mortality rates (low overall), and there is now greater clinical awareness and a specific and sensitive laboratory test, the availability of which continues to increase.”", "The note says that the Advisory Committee on Dangerous Pathogens, a group of independent experts that advises the government, also believed that “COVID-19 should no longer be classified as an HCID”.", "This does not mean the current Covid-19 outbreak is not a serious public health emergency, however. Even though the risk of dying from the disease is low for most people, it has been shown that the disease can spread quickly to a large number of people, and therefore cause a large number of deaths in total.", "This article is part of our work fact checking potentially false pictures, videos and stories on Facebook. You can read more about this—and find out how to report Facebook content—here.\n\n        For the purposes of that scheme, we’ve rated this claim as partly false\n            because there is no evidence that mask wearing increases the risk of bacterial pneumonia and although Covid-19 is no longer listed as an HCID, it is still dangerous.", "Full Fact fights for good, reliable information in the media, online, and in politics.", "Bad information ruins lives. It promotes hate, damages people’s health, and hurts democracy. You deserve better.", "Full Fact, 17 Oval Way, London, SE11 5RR", "Full Fact is a registered charity (no. 1158683) and a non-profit company (no. 06975984) limited by guarantee and registered in England and Wales. © Copyright 2010-2023 Full Fact. Thanks to Bytemark for donating our web hosting.\n                        \n                        Privacy, terms and conditions."]