["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Controversy over Hillary Clinton's practice of using a private email server while she was secretary of state is continuing to have repercussions in her presidential campaign. The latest is a Milwaukee Journal Sentinel editorial criticizing the Democrat's rationale, saying that \"the only believable reason for the private server in her basement was to keep her emails out of the public eye by willfully avoiding Freedom of Information laws.\"", "NBC's Chuck Todd asked her about the accusation that she's too secretive during a taped April 2 interview for Meet the Press.", "Clinton repeated her acknowledgment that her use of a private email server was a mistake, along with her assertion that all of her work-related correspondence was sent using government-operated email servers, which would mean that all of those emails should be sitting in government files somewhere.", "In any event, she said, all of her emails have been released.", "\"I think that anybody who's actually looked at this has concluded that I have now put out all of my emails,\" she said. \"Go and ask others for their emails. Ask everybody else who's in public office. I'm the one who's done it, and I did it because I thought it was the right thing to do.\"", "So are all the emails out?", "Literally, no.", "Clinton says she had about 60,000 emails on her private server during the four years she was secretary of state.", "She and her staff deleted more than 31,000 without any government review in December 2014 on the basis that they were personal correspondence and had nothing to do with her government job.", "The remaining 30,940 were turned over to the State Department, in paper form, for review and archiving.", "In March 2015, a House committee demanded that Clinton hand over her server to see if sensitive material had been deleted. In August, Clinton authorized the transfer.", "She then asked the State Department to publicly release the work-related correspondence, which it began to do in May 2015. The last batch, consisting of about 3,800 pages, was released Feb. 29.", "Clinton has consistently insisted that the emails did not include any information that was classified at the time she sent or received the correspondence.", "She turned out to be correct. (Editor's note, July 11, 2016: Based on the information publicly available at the time, she appeared to be correct. The FBI's report from July 2016 subsequently revealed she was not correct. Although that does not affect our ruling on this statement, we have downgraded another statement that she never sent or received classified material and rated that False.)", "But ultimately, 2,093 emails were given some form of classification, including 22 now marked \"top secret,\" which have been fully withheld from the public. The rest have been redacted. The 22 \"top secret\" emails were part of seven email chains covering 37 pages. They were not classified at the time they were sent.", "But a few additional emails have also not been released, even though they were not considered classified.", "Nineteen were exchanges between Clinton and President Barack Obama that covered eight different chains. They were withheld under the law governing the release of presidential documents, designed to encourage candid exchanges of opinion between the president and his staff.", "There was also one email withheld at the request of an unspecified law enforcement agency.", "As for the correspondence that Clinton considered to be personal and private, it’s unclear if any of those emails have been recovered.", "Bloomberg reported in September that the FBI had obtained the server from a company called Platte River Networks in Colorado and had recovered those deleted emails. McClatchy reported in October that some emails were synched with a cloud storage system run by Datto Inc. of Connecticut and Clinton agreed to have that data released to the FBI.", "However, McClatchy reported \"conflicting accounts as to whether the developments could lead to retrieval of any of Clinton’s more than 31,000 personal emails, which she said she deleted from her private server upon turning over her work-related emails to the State Department, at its request, in December 2014.\"", "That’s a fairly critical point, as congressional Republicans have questioned whether any of those \"personal\" emails contained government business.", "State Department spokeswoman Lauren Hickey said the released documents only included the work-related emails that Clinton turned over. Any additional material that might have been recovered by the FBI have not been released.", "Our ruling", "Clinton said, \"I have now put out all of my emails.\"", "In reality, only about half of the emails sent or received by Clinton on her private email server have been released.", "Clinton’s comments focus on emails that she and her staff deemed work-related.", "Clinton says the half that aren’t available are personal and private. The problem is, it was Clinton and her staff who made that determination. Those emails -- more than 30,000 -- haven’t been available for public review, and it’s not entirely clear they can be retrieved.", "Clinton’s statement is partially accurate but takes things out of context. We rate it Half True.", "https://www.sharethefacts.co/share/f53c15fc-28b4-4025-8158-433cdc006cc4", "NBC News, \"Meet the Press - April 3, 2016,\" \"After 10 Months, Thousands of Pages, Final Clinton Emails to be Released,\" Feb. 29, 2016, \"Clinton Emails Held Indirect References to Undercover CIA Officers,\" Feb. 29, 2016, \"State Department Declares Some Hillary Clinton Emails 'Top Secret,'\" Jan. 29, 2016, \"State Department Releases Final Batch of Hillary Clinton's Emails,\" March 1, 2016", "NPR, \"FBI Investigators Recover Clinton Emails Thought To Have Been Lost,\" Sept. 23, 2015", "The Hill, \"Final batch of Clinton emails released,\" Feb. 29, 2016", "McClatchyDC.com, \"Unbeknownst to Clinton, IT firm had emails stored on cloud; now in FBI's hands,\" Oct. 6, 2015", "Interview, Lauren Hickey, spokeswoman, U.S. State Department, April 3, 2016", "PolitiFact, \"Hillary Clinton's email: Did she follow all the rules?\" March 12, 2015", "Email, Josh Schwerin, spokesman, Hillary for America, April 3, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]