["About this rating", "Photographs show an attempted robbery that ended with three assailants shot by their intended victim.", "The incident took place in the United States and was perpetrated by men who crossed the border from Mexico.", "Since at least November 2009, photographs purporting to show the gruesome aftermath of an attempted robbery in El Paso, Texas, have been circulated online. According to the text that typically accompanies these images, the pictures depict three armed Mexicans (variously described a \"gang members,\" \"thugs,\" or \"illegals\") who crossed the U.S. border into Texas and attempted to rob a random person they encountered on the streets of El Paso. Unfortunately for them, their intended victim was an off-duty El Paso police officer who pulled out his weapon and shot his three assailants dead, thereby saving U.S. taxpayers thousands upon of dollars in incarceration and trial fees.", "These photographs, however, don't depict an incident that took place in El Paso, or in Texas, or anywhere else in United States. They originated with a violent crime that occurred in Brazil in 2008, which was indeed reported by that country's news media as an attempted robbery which ended with two of the three would-be assailants shot dead.", "Contextual clues in the images suggest a locale other than the United States. For example, a building in the background of one photograph displays a logo for \"Gravia,\" a Brazilian manufacturing company. Likewise, a nearby phone booth displays the common green, rounded design of public phones in that country.", "A current Google street view of the address of Gravia yields a scene that is very similar to the one shown in the pictures above:", "A search for news about a shootout in Brazil reveals published accounts dating from September 2008 about an attempted robbery in that country which ended with two of three suspects shot and killed by police in Brasilia's Federal District:", "According to police and witnesses, a civilian police officer got out of the car to make a payment in the agency's Savings Bank in Industry and Supply Sector (SIA) in Brasilia when he was surprised by two men at the entrance who announced the assault.", "The thieves took the backpack with $2,000 reals and ran toward a motorcycle driven by a third person. The officer ran up behind them and fired.", "Two robbers died on the spot, and the third was hit in the arms and hospitalized. The weapons and the backpack will be investigated.", "A blog entry posted the next day mentioned the crime:", "Three fewer doing shit in the city ... Yesterday afternoon (15/09/2008) they decided to assault someone from Civil Police DOE (Department of Special Operations) without knowing who he was and took his money that was in a backpack and fled on a motorcycle. Two were killed on the spot and the one who lived took a .40 bullet  in both arms, but unfortunately he has already gone through surgery. Excellent work from a prepared police officer with the cold blood to act at the right time.", "Violence and crime — especially opportunistic street crime similar to this particular attempted robbery — has been a major problem in Brazil's large cities for many years. While crime rates in that country may have been dropping overall, violence and robberies remain a concern, particularly in areas where socioeconomic disparities are endemic and highly visible, such as Brasilia's Distrito Federal.", "By contrast with the claims of Facebook commentators, American cities along the border that divide the United States and Mexico (such as El Paso, Texas) have crime rates that are traditionally well below state or national averages.  A bloody shootout on a busy street in the middle of the day next to an international border would not just make headlines in America, it would likely dominate them.", "Brooke Binkowski is a former editor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]