["New Hampshire Gov. Maggie Hassan delivers her budget address to lawmakers, Thursday, Feb. 12, 2015, at the Statehouse in Concord, N.H. Photo by Jim Cole/AP", "For all its troubles, New Hampshire is actually pretty lucky — or so report, after report, after report, would say.", "Just ask Gov. Maggie Hassan. In her second inaugural speech in January and in her budget address Thursday, Feb. 12, Hassan, a Democrat, made a point of drawing attention to New Hampshire’s rosy reputation.", "\"Our country’s economy continues to strengthen – and in many respects, New Hampshire remains ahead of the curve,\" Hassan said, ticking off a number of economic statistics. One was that \"our median household income in 2013 was the highest in the nation,.\"", "In both speeches, Hassan pointed out that statistics don’t always tell the whole story, saying that some working class families in the state continue to struggle.", "Still, was New Hampshire really at the top of the nation in 2013 in terms of household income? PolitiFact New Hampshire decided to check it out.", "The statistic Hassan cited came from data collected and compiled by the U.S. Census Bureau. Specifically, her staff pointed to a set of data released in September 2014 that summed up the latest findings from the Current Population Survey’s Annual Social and Economic Supplement.", "While the census conducts a population count every 10 years, it also compiles other types of data — on income, for example — through other surveys that occur more frequently.", "In this case, the data was collected over a period of three months in 2013 — February, March and April.", "According to the census data, New Hampshire’s median household income was $71,322 in 2013 — which was not only higher than the national median, but also higher than any other state.", "As with any survey, there are some limitations to consider.", "One factor concerns how the data was calculated. To determine income, the census asks people to report the money they received during the previous year from multiple sources, including: earnings, unemployment compensation, workers’ compensation, public assistance and more.", "The census also notes that \"money income does not reflect the fact that some families receive part of their income in the form of noncash benefits,\" such as food stamps.", "As noted by Drew Desilver for Pew Research Center, \"some economists say that income data have too many flaws to be the primary measure of inequality.\"", "\"For one thing,\" Desilver said, \"most income-inequality measures use income before taxes and transfer payments (such as Social Security, food stamps and unemployment benefits), which act to reduce inequality.\"", "Some researchers, Desilver notes, have instead suggested that other measures — someone’s consumption, for example — would be a better way to measure someone’s \"economic well-being.\"", "Another factor to consider is the timing of the data. Using other census data that looks beyond just 2013, the year Hassan cited, shows that New Hampshire loses its top spot to Virginia when 2012 and 2014 information is considered.", "Our ruling", "Gov. Maggie Hassan said New Hampshire’s \"median household income in 2013 was the highest in the nation.\"", "Looking at U.S. Census data only for that year, Hassan is correct. For other recent periods, however, New Hampshire ranks just below the top. In the meantime, census data is widely trusted, but other calculation methods may have produced different results. However, Hassan was correct in qualifying that statement by suggesting that the survey might not tell the whole story.", "The claim is accurate but needs clarification or additional information, so we rate the claim Mostly True.", "Gov. Maggie Hassan budget address, Feb. 12, 2015", "Gov. Maggie Hassan second inaugural speech, Jan. 8, 2015", "U.S. Census Historical Income Tables, Table H-8. Median Household Income by State", "U.S. Census website: \"What We Do\"", "U.S. Census website: \"Current Population Survey (CPS) - Definitions\"", "U.S. Census report: \"Income and Poverty in the United States: 2013\"", "U.S. Census website: Frequently Asked Questions", "U.S. Census website: State Median Income", "Pew Research Center: \"The many ways to measure economic inequality\"", "Email interview with Gov. Maggie Hassan spokesman William Hinkle", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]