["A tiny progressive advocacy PAC with less than $500 on hand bought an ad on Facebook as a media stunt. The Really Online Lefty League’s ad falsely showed Sen. Lindsey Graham, R-S.C., endorsing the broad climate change policy known as the Green New Deal.", "The Green New Deal calls for pretty much the entire country to mobilize and bring the United States to net-zero emissions by 2050 –– the point where it adds no more carbon to the atmosphere than is captured. Government action would be massive.", "Graham, a firm conservative, has railed against the idea.", "But in the ad, he says, \"We believe in the Green New Deal.\"", "The man behind the ad, Adriel Hampton, a communications strategist in San Francisco, said he got the idea from a House hearing when Rep. Alexandria Ocasio-Cortez, D-N.Y., pressed Facebook CEO Mark Zuckerberg.", "\"Could I run ads targeting Republicans in primaries saying that they voted for the Green New Deal?\" Ocasio-Cortez asked.", "Zuckerberg said, \"Probably.\"", "Here’s what viewers of the ad see and hear, and then, we provide what Graham actually said.", "The ad’s headline is \"Conservatives for a Green New Deal,\" and it displays in a corner throughout the minute-and-a-half long ad. It begins with video of Republican Presidents Ronald Reagan and Richard Nixon talking about the need to protect the environment. Nixon oversaw the creation of the Environmental Protection Agency and major amendments to both the Clean Air and Clean Water Acts, two pillars of American environmental legislation.", "The ad then shifts to a news conference with Graham at the podium.", "\"I’m Sen. Graham of South Carolina,\" Graham says. \"I’m here to announce with my colleagues that we care about conservation.\"", "Graham’s voice continues as images of wind turbines and pine branches gently swaying in the breeze fill the screen.", "\"We care about the environment,\" Graham continues. \"From a Republican point of view, I think we need to look at the science, admit that climate change is real. Simply put, we believe in the Green New Deal.\"", "For good measure, the ad shows a picture with Graham and Alexandria Ocasio-Cortez, a prime author of the Green New Deal, shoulder to shoulder at a rally, arms raised in victory.", "The photo of Graham and Ocasio-Cortez is faked, as is his stated support for the Green New Deal", "The original photo was of Democratic presidential candidate Bernie Sanders and Ocasio-Cortez, taken in 2018. Graham’s head replaced Sanders’.", "The audio editing of Graham’s news conference was masked by cutting away from the video of the event to add new images.", "Here are key excerpts from Graham’s event.", "\"From a Republican point of view I think we need to showcase that we care about conservation –– we care about the environment,\" Graham said.", "And then he went on:", "\"We have innovative solutions that are not top-down regulatory solutions,\" he said. \"We believe that you cannot have a healthy environment and destroy the economy and we believe that our friends on the other side care about the environment, but they care so much, they're going to destroy the economy.\"", "Graham did say, \"When nine out of ten scientists say that CO2 admissions are creating a greenhouse gas effect, that the planet is warming up, I believe the nine not the tenth.\"", "He did say \"look at the science, admit that climate change is real,\" but here’s what he said about the Green New Deal.", "\"There's not one Republican going to vote for anything coming out of the Green New Deal ‘cause it’s  crazy.\"", "An ad from the group The Really Online Lefty League says that Graham supports the Green New Deal. It edited his words to change their meaning, and added to the effect with a doctored photograph.", "We rate this ad’s claim Pants on Fire.", "The Really Online Lefty League, Conservatives for Green New Deal, Oct. 24, 2019", "CNBC, Alexandria Ocasio-Cortez shares the best piece of advice she got from Bernie Sanders, Feb. 28, 2019", "Office of U.S. Sen. Lindsey Graham, Press Conference to Announce Roosevelt Conservation Caucus, July 10, 2019", "Democracy Now, AOC Grills Facebook’s Zuckerberg on Lies in Political Ads, Oct. 25, 2019", "Reuters, Facebook takes down false ad from PAC on Republican Graham, Oct. 26, 2019", "Lead Stories, Lindsey Graham Did NOT Endorse The Green New Deal In Ad, Oct. 26, 2019", "U.S. Congress, H.Res.109 - Recognizing the duty of the Federal Government to create a Green New Deal, Feb. 7, 2019", "Washington Post, Text of Facebook CEO Mark Zuckerberg’s speech at Georgetown University, Oct. 17, 2019", "Email exchange, Adriel Hampton, creative director, Adriel Hampton Group, Oct. 28, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]