["One in four Nigerians are suffering from some sort of mental illness.", "There are only eight neuropsychiatric hospitals in Nigeria.", "Nigeria has Africa's highest rate of depression.", "Nigeria ranks fifth in the world in the frequency of suicide.", "There are less than 150 psychiatrists in this country of 200 million.", "WHO estimates that fewer than 10% of mentally ill Nigerians have access to the care they need.", "Yaba Psychiatric Hospital had a 2018 budget of N133 million (US$372,000) – but only N13 million ($36,000), or less than 10% of that amount, was released by the federal government.", "By 2018, Nigeria had allocated just 3.95% of its budget to funding its ministry of health.", "Every week, at least 12 doctors leave Nigeria to seek employment in the UK.", "Nigeria has an estimated physician-patient ratio of one doctor to every 4,000 to 5,000 patients.", "...[This is] six times smaller than the physician-patient ratio (one physician to every 600 doctors) recommended by WHO.", "Please complete this form to receive the HTML sharing code.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "For democracy to function, public figures need to be held to account for what they say. The claims they make need to be checked, openly and impartially. Africa Check is an independent, non-partisan organisation which assesses claims made in the public arena using journalistic skills and evidence drawn from the latest online tools, readers, public sources and experts, sorting fact from fiction and publishing the results.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "© 2023 - Africa Check - All rights reserved.", "We will never charge you for verified, reliable information. Help us keep it that way by supporting our work.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "Support independent fact-checking in Africa."]