["The claim was shared in this Facebook post on December 15, 2020.", "The lengthy Thai-language caption translates to English in part as:", "“Today, Bangkok has become a dangerous city where there are haze mixes with Covid-19. Research found out that “PM 2.5 is the carrier of the virus”", "“Researchers said that the density of small particle air pollutants will make the infection become more severe, resulting in the higher death rate of COVID-19 by 8-16.6%.", "“Assist. Prof. Rujikan Nasanit, a professor at Silapakorn University’s Department of BioTechnology, explained that there are correlations between COVID-19 death rate and PM 2.5. In some countries like the US, The Netherlands also reported higher death rates, which is related to the higher amount of PM 2.5.”", "Particulate Matter (PM) 2.5 refers to the air pollutants that have a diameter of 2.5 microns or less.", "The post circulated shortly after the level of PM 2.5 dust particles exceeded safety standards at seven air-quality monitoring stations in Bangkok, the Bangkok Post reported here on December 10, 2020.", "Thailand's capital Bangkok has long suffered from poor air quality, as reported here by AFP.", "It was not clear whether the misleading post was referring to the case fatality rate of Covid-19 in Thailand or the crude mortality rate, which measures the probability that any individual in the population will die from the disease.", "As of December 17, 2020, Thailand had recorded 4,261 cases of Covid-19 and 60 deaths. This indicates a case fatality rate of 1.4 percent.", "As of the same date, the crude mortality rate for Covid-19 in Thailand is 0.9 deaths per 100,000 population.", "A similar claim was shared here on Facebook, here on Twitter and here on a website.", "The claim is misleading; health experts said there is no evidence that PM 2.5 increases the mortality rate for Covid-19.", "In response to the misleading posts, Dr. Rujikan Nasanit, an assistant professor of biotechnology at Silapakorn University, told AFP by phone on December 17 , 2020, that her comments had been “misrepresented”.", "\"It's a misunderstanding, people have been misrepresenting my explanations,” she said. “I actually got that information from an article written by a professor from the University of Birmingham that mentioned the studies of the correlation between the PM2.5 concentration and the COVID-19.", "“In fact, these numbers could be varied. It depends on various factors in the particular areas. For example, the number of Covid-19 cases, air pollution, also human activities and the disease control regulation, etc. Therefore the correlation rate in Thailand can be different from those countries”.", "Dr. Pokrath Hansasuta, an assistant professor of virology at Thailand’s Chulalongkorn University, said there was “no academic evidence” to support the claim in the misleading posts.", "“There is no academic evidence to support that PM 2.5 will make the Covid-19 infection become more severe, resulting in a higher death rate, '' he told AFP by Line messaging app on December 17, 2020.", "According to Dr. Thira Woratanarat, an associate professor at the Department of Preventive and Social Medicine at Chulalongkorn University, there is no academic evidence that can support the “correlations between PM 2.5 and Covid-19 death rate”.", "“Although PM 2.5 can cause lung problems, there is no evidence that it will make you become infected with COVID-19 easier,” he told AFP during a phone conversation on December 17, 2020.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]