["About this rating", "In March 2019, a photograph supposedly showing a sign reading \"no longer serving military personnel & their guest(s)\" started circulating on social media, along with the claim that it had been displayed at a DoubleTree Hotel in Colorado Springs. The original post has since been deleted; but a viral version of this message was shared by Justin Vames:", "Vames posted: \"So last night we took over 600 people to the #doubletreecoloradoSprings and paid over $50 a person. They came in and shut down our traditions. Treated us like crap, refused to leave food for guests in the bathroom or chatting. They said when they are seated they will be served. They charged us over $12 a drink which we all paid. And then left this sign on the bar! This event was a post deployment ceremony! These men and women where being honored for serving our county, but I guess serving them at the double tree is too much! Just so you know, we did not damage the building and there was no reason to treat us this way!\"", "This photograph is genuine, and the accompanying narrative appears to be accurate. However, a number of social media users encountered this image in social media posts containing incomplete or inaccurate information. For example, some users shared this image as if it were taken at a hotel in Texas, not Colorado. After this image went viral, we also received a number of queries from readers who seemed unsure if the military had been banned from all DoubleTree properties (as well as those of their parent company, Hilton Hotels).", "This sign was reportedly put on display by two of the hotel's employees after an event involving military members. The sign was later removed and the two employees were fired by the hotel.", "Aimee Osborne, the woman who originally posted the image, talked to Colorado Springs station KOAA about the chain of events that led to the sign's being displayed:", "Osbourne, a disabled veteran whose husband is currently serving, says the group was in the process of an army grog. That’s a ceremony in which a unit honors those who have served, POWs/MIAs status, and those lost.", "Based on unit tradition some odds and ends are added to the alcoholic and non-alcoholic mixes. The chain of command can also call for someone to drink from the grog if they violate etiquette.", "According to Osbourne, there was no bad behavior on the part of the roughly 600 people in attendance. She says the hotel staff started blocking access to the grog, an incident that the attendees tried to handle in a professional manner, but soon the bars were closed and the signs posted at 9 p.m.", "Daniel Kammerer, General Manager of the DoubleTree by Hilton Colorado Springs, posted a statement to the establishment's Facebook page apologizing for the sign:", "I wanted to take this opportunity to provide again my sincerest apologies for the situation that took place last week during a Military Ball held at our property. I take this matter very seriously and personally as I have a brother who is a Navy Veteran.", "Two Supervisor-level employees, who have since been terminated, made poor decisions including displaying a sign that they created, which we find very offensive. Their actions were in no way associated with the values of the hotel management. Their actions do not reflect our principles or beliefs, and this is not how we train our employees. We deeply regret any offense to the service members and their guests, and have implemented a retraining of our employees to ensure this does not happen again.", "We are honored and proud to support our Military community and their families, and look forward to continuing to serve those who serve us. Again, we are very sorry for the situation that occurred at our property and welcome all Military service members, their families and community to our hotel.", "March 15: Statement from Daniel Kammerer, General Manager of the DoubleTree by Hilton Colorado Springs:", "“Our property has a proud history of hiring veterans and welcoming the military as our guests. Last night two of our team members acted without the proper authority to close and exclude military guests from our hotel’s bar. This action is inconsistent with our values and we humbly apologize. The two team members are no longer employed at the property. We have attempted to contact the leaders of the group to apologize and confirm that our property is one that welcomes all, especially the men and women who serve our country.”", "Osbourne told KOAA that she had accepted the hotel's apology.", "Yasharoff, Hannah.   \"DoubleTree Sorry for Sign Declaring: 'No Longer Serving Military Personnel & Their Guests.'\"\r\n    USA Today.   21 March 2019.", "Kackley, Tom.   \"Colorado Springs Hotel Apologizes After Employees Refuse to Serve Military.\"\r\n    KOAA-TV.   15 March 2019.", "Update [28 July 2020]: Rating updated from \"Mostly True\" to \"Outdated.\"", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]