["About this rating", "On 20 October 2016, the website Morning News USA published a story (now with an editor's note that the claims have been debunked) reporting that a popular children’s television character named Peppa Pig caused children to develop autism by inspiring them to replicate her irreverent attitude toward authority. This transparent piece of clickbait, which was picked up by a number of other websites and social media accounts, cited a 2012 “University of Harvard” study:", "Experts claimed that Peppa suffers from superiority complex, shows inappropriate behavior, is impolite, intolerant, disrespectful, envious, arrogant and proud. These are not the traits that children should emulate!", "They claimed that Peppa Pig is breeding disrespectful behavior among children. Besides, researchers from the University of Harvard published the result of an experiment that they conducted in 2012. It said that watching Peppa Pig was one of the main causes of autism among children.", "Marc Wildemberg, an epidemiologist who was the lead researcher said: “children exposed to at least 30 minutes a day of the show have a 56% higher probability of developing autism.”", "Outside of the clear misrepresentations of both autism and science, there are a number of equally obvious hints that this “research” is entirely fabricated.", "First of all, the “University of Harvard” is not a real place (Harvard University is, though). Second, Harvard University has not mentioned the study on any of their webpages and a brief search of Google Scholar reveals that this is because the study itself does not exist. Third, Marc Wildemberg, who probably doesn’t exist either, has never been associated with Harvard and has no web presence to speak of.", "The connection between autism and television was controversially suggested by an economist based solely on correlations between rain, cable television subscriptions, and autism rates in three states. The study, published as a non-peer reviewed National Bureau of Economic Research working paper, has since been widely criticized:", "[Lead author] Prof. Waldman's findings do nothing to explain the mechanism by which television would influence autism, a gap that instrumental variables are inherently unable to fill. That's one reason many autism researchers think he shouldn't have publicized his results or made recommendations to parents. \"I think this is irresponsible,\" says [autism specialist] Dr. Klin of Yale. \"We should not provide clinical advice unless there is scientific evidence to substantiate it.\"", "Further, the assertion that autism is a learned behavior is not rooted any science. While the cause is unknown, many scientists believe it is the result of a combination of hereditary and environmental factors.", "Finally, to characterize autism as simply “rude” behavior offensively suggests that the behavior of an autistic person is necessarily bothersome, and intentionally at that. In reality, autism is composed of a broad spectrum of conditions related to an individual's ability to interact and behave socially. As defined by the CDC:", "Autism spectrum disorder (ASD) is a developmental disability that can cause significant social, communication and behavioral challenges. There is often nothing about how people with ASD look that sets them apart from other people, but people with ASD may communicate, interact, behave, and learn in ways that are different from most other people. The learning, thinking, and problem-solving abilities of people with ASD can range from gifted to severely challenged. Some people with ASD need a lot of help in their daily lives; others need less.", "This blatant piece of viral pseudoscience fear-mongering, however, is not the kind of help people with ASD or their parents and caregivers need.", "Morning News USA has since cast their own (muted) doubt on the story, updating their post with the caveat that University of Harvard epidemiologist Marc Wildemberg “does not seem [to be] a credible person to claim that watching Peppa Pig can lead to autism”.", "Sinha, Barnali Pal.   \"Peppa Pig Cancelled: Show Causes Autism, Psychologists Warn — Facts To Know.\"\r\n    morningnewsusa.com.   20 October 2016.", "Conejo, Luis.   \"Read and Confirm Before You Hit Share.\"\r\n    Medium.   5 May 2016.", "Whitehouse, Mark.   “Is an Economist Qualified To Solve Puzzle of Autism?\"\r\n    The Wall Street Journal.   27 February 2007.", "Chaste, Pauline, and Leboyer, Marion.   “Autism Risk Factors: Genes, Environment, and Gene-Environment Interactions?\"\r\n    Dialogues in Clinical Neuroscience.   27 February 2007.", "cdc.gov.   \"Autism Spectrum Disorder.\"", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]