["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Republican Dan Patrick, vowing to make border security his priority, says his Democratic opponent for lieutenant governor has been hiding her \"failed record on illegal immigration.\"", "In a TV ad shared by the Houston state senator on Facebook Oct. 8, 2014, the narrator says: \"Leticia Van de Putte,\" a San Antonio state senator, \"opposed putting National Guard troops on the border, would send millions to Central American governments instead and wrote the law giving in-state tuition to illegal immigrants.\"", "A note: Patrick’s ad opened with his declaration that Islamic State group \"terrorists threaten to cross our border and kill Americans.\" In September 2014, PolitiFact looked into a similar claim, concluding it’s highly unlikely that ISIS would operate in Mexico and stage an attack that involves crossing the border.", "But for this article, we focused on Patrick’s three charges about his opponent, finding two of them solid and the third a bit of a twist. Let’s take them one by one.", "Troops on the border", "As the ad says in type displayed on screen, Van de Putte said in a July 21, 2014, campaign press release that Texas Gov. Rick Perry’s decision to dispatch up to 1,000 National Guard troops to the border was the \"wrong way to go.\" In her release, she said a better approach would be to provide local and state law enforcement agencies with resources they request and need.", "Van de Putte, referring to the uptick in unaccompanied children crossing the Rio Grande, conceded National Guard members are prepared for many missions. \"But to strictly militarize the border won’t help us meet this unique humanitarian challenge,\" she said.", "So, the Democrat opposed the troop deployment.", "In-state tuition for undocumented immigrants", "Van de Putte also played a major role in presenting the 2001 legislation affording in-state college tuition rates to some immigrants unauthorized to live in the U.S., though contrary to Patrick’s ad, Van de Putte wasn’t the proposal’s author -- as in original sponsor. The lead author was then-Rep. Ric Noriega, D-Houston.", "She was darned close, however, by serving as the Senate sponsor of the House-approved proposal that came to the Senate before later making it to Perry to be signed into law, legislative records show; indeed, no other senators co-sponsored the act. Under the law, which Perry has long defended, children of Texas residents who entered the country without legal permission may qualify for in-state tuition at public colleges and universities. In the 2001 legislative session, Perry has accurately said, very few legislators opposed the action.", "Millions to Central America", "And what of Patrick’s third dart -- that Van de Putte favors sending government aid to countries in Central America instead of putting Texas troops on the border?", "Patrick’s ad lists a June 14, 2014, news report by KGBT-TV, Channel 4 in Harlingen, as his basis for the government-aid claim. We watched the report and read a story posted with the station’s news video and didn’t notice Van de Putte directly saying she would prefer to send millions of dollars to such countries.", "According to the news report, Van de Putte told a station reporter after visiting a U.S. Border Patrol facility in Brownsville holding thousands of mothers and children that it’s time for Congress to embark on immigration reform. According to the station’s online write-up, Van de Putte also asked Congress to strongly consider accepting President Barack Obama’s $3.7 billion request to deal with the border crisis (though this described message for Congress wasn’t part of KGBT-TV’s video report).", "With a nudge from Alejandro Garcia, Patrick’s campaign spokesman, we spotted references to Obama’s proposal touching on money for border security and other needs in countries in Central America. When Obama unsuccessfully sought the $3.7 billion in July 2014, he said the government needed the spending to pay for new detention facilities to house the additional border-crossers coming from Central America and to conduct more aerial surveillance and hire immigration judges and Border Patrol agents.", "The Central America angle: Garcia pointed out a July 2014 breakdown of Obama’s $3.7 billion request by USA Today stating $295 million of his requested aid would go to the State Department and other international programs to \"support efforts to repatriate and reintegrate migrants to Central America, to help regional governments better control their borders and to address the underlying root causes driving migration, i.e. creating the economic, social, governance and citizen security conditions. Beyond initial assistance, continued funding for repatriation and reintegration activities will be contingent on sustained progress and cooperation by the Central American countries,\" the paper said. We saw the same dollar figure and explanation in a July 8, 2014, White House \"fact sheet.\"", "Then again, Patrick’s camp didn’t provide nor did we spot evidence Van de Putte said that instead of Texas paying to station troops near the Texas-Mexico border, state dollars should go to countries in Central America. It’s worth noting, too, that she talked up Obama’s $3.7 billion request about five weeks before Perry revealed he was considering dispatching troops to the border. Perry issued the deployment order July 21, 2014.", "Our ruling", "Patrick said Van de Putte \"opposed putting National Guard troops on the border, would send millions to Central American governments instead and wrote the law giving in-state tuition to illegal immigrants.\"", "Van de Putte was the Senate sponsor of the House-originated 2001 proposal authorizing in-state tuition for immigrants not living here with legal permission.", "She also opposed this summer's National Guard deployment. However, she didn’t say that instead of placing  troops near the border, the state should aid countries in Central America. Rather, Van de Putte earlier and separately urged congressional approval of an Obama request that included federal aid to such countries. Suggesting she conflated spending on the Texas troops with the sought federal funding amounts to a misleading stretch.", "On balance, we rate Patrick's statement Half True.", "HALF TRUE – The statement is partially accurate but leaves out important details or takes things out of context.", "Click here for more on the six PolitiFact ratings and how we select facts to check.", "Truth-O-Meter article, \"Is ISIS in Mexico and planning to cross the border?,\" PolitiFact, Sept. 17, 2014", "Document, \"'Washington Has Failed Us' White Paper,\" Dan Patrick campaign (received by email, Alejandro Garcia, communications director, Dan Patrick campaign, Oct. 8, 2014)", "Document, \"Fact Check: Dan Patrick TV Ad, 'Washington Has Failed Us,'\" Leticia Van de Putte campaign (received from Manny Garcia, communications director, Texas Democratic Party, on behalf of Van de Putte campaign, Oct. 8, 2014)", "Press release, \"Leticia Van de Putte Responds to Call for National Guard on Border,\" Leticia Van de Putte campaign, July 21, 2014 (received by email from Emmanuel Garcia, communications director, Texas Democratic Party, action on behalf of the Van de Putte campaign, Oct. 8, 2014)", "News story, \"Leticia Van de Putte tours Border Patrol facilities in the Valley,\" KGBT-TV, Channel 4, Harlingen, June 14, 2014 (accessed Oct. 8, 2014)", "Truth-O-Meter article, \"Rick Perry says only four Texas lawmakers opposed in-state tuition law for illegal immigrants,\" PolitiFact Texas, Sept. 28, 2011", "Web page, House Bill 1403, \"Actions,\" 2001 Texas Legislature, Texas Legislative Council (accessed Oct. 8, 2014)", "News story, \"Obama Asks for $3.7 Billion to Aid Border,\" The New York Times, July 8, 2014 (accessed Oct. 8, 2014)", "News illustrations, \"Obama seeks $3.7B to stem tide of kids crossing border.\"  USA Today, July 8, 2014", "Web post, \"FACT SHEET: Emergency Supplemental Request to Address the Increase in Child and Adult Migration from Central America in the Rio Grande Valley Areas of the Southwest Border,\" the White House, July 8, 2014 (accessed Oct. 8, 2014)", "Email (excerpted), Emmanuel Garcia, communications director, Texas Democratic Party, on behalf of Leticia Van de Putte campaign, Oct. 8, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]