["On August 19, Republic TV Consulting Editor Major Gaurav Arya (Retd) quote-tweeted a tweet by a user who claims to be Pakistani Lieutenant Colonel Adnan Gulmirza (@AdnanGMpk). Arya’s tweet said, “In Pakistan, anyone who is not Sunni Punjabi is Wajib-ul-Qatl. The story of this Lt Col is not surprising. According to Pakistan’s Constitution, an Ahmadi can be jailed for simply calling his place of worship a masjid. Ahmadis in Pakistan are treated worse than animals.”", "In Pakistan, anyone who is not Sunni Punjabi is Wajib-ul-Qatl. The story of this Lt Col is not surprising. According to Pakistan’s Constitution an Ahmadi can be jailed for simply calling his place of worship a masjid. Ahmadis in Pakistan are treated worse than animals. https://t.co/zW1ukI419p", "— Major Gaurav Arya (Retd) (@majorgauravarya) August 19, 2019", "Arya’s commentary was based on a supposed thread by a Pakistani army officer who talked about his voluntary retirement and that of 17 other army personnel who belonged to the Ahmadiyya sect of Islam. In the thread, it was claimed that Ahmadiyyas in the army are facing discrimination on religious grounds. “This is utterly shameful. Our Country is doomed”, reads the concluding line of the thread.", "Swarajya has published an article on the tweets allegedly put out by ‘Pakistani Ahmadiyya soldier’.", "Alt News found that the account which claims to be handled by Lt Col Adnan Gulmirza is fake. This account was recently created in August 2019 and the man in the profile picture is not Lieutenant Colonel Adnan. In fact, Lt Col Adnan Gulmirza does not even exist.", "The original photo finds a place in two news articles published on April 23, 2019, when former Lt General Syed Mohammad Adnan was appointed as the Commander of Bahawalpur Corps. This was reported by Pakistani newspaper Dawn. Imran Mir, a Pakistani journalist, had posted another photograph of Commander Adnan on April 19, saying, “New postings in top Army hierarchy. Lt Gen Syed Mohammad Adnan is posted as Commander 31 corps Bahawalpur.”", "In the comparison posted below, the image of the fictional Lt Col Adnan Gulmirza is juxtaposed with the original photograph of Commander Syed Mohammad Adnan. The manipulations are clearly visible – red emblem removed from the collar, beard added to the face, and a slight change in eye colour.", "Analysing a screenshot of the profile, taken earlier, we found that it first carried the original image of Commander Syed Mohammad Adnan but later changed it with the photoshopped image.", "Major Gaurav Arya, who had ironically called out an account impersonating him on Twitter, has now quote-tweeted a fake account posing as a Pakistani army man.", "Hello @TwitterSupport @Twitter here is another fake account impersonating me. @FollowHelp100k8 is a fake account and he has managed to get 3000 followers too. Please block this account. pic.twitter.com/k1LTQynzWg", "— Major Gaurav Arya (Retd) (@majorgauravarya) August 19, 2019", "Several Twitter accounts impersonating army personnel and public figures have sprung-up after the central government’s move to revoke provisions of Article 370 of the Indian constitution. Here are two more instances of fake accounts impersonating as Indian and Pakistani army personnel:", "On August 16, a fake profile of Colonel Vijay Acharya was created on Twitter. A tweet put out by the handle claimed that he is resigning from the Indian Army due to the ‘killings in Kashmir’.", "According to a Zee News broadcast, ex-army personnel Vijay Acharya took retirement in March this year. He informed the media outlet that a fake handle is impersonating him. The colonel said, “After the abrogation of Article 370, their aspirations are so high, they have made social media a platform for information warfare. I am a victim of this. On August 16, my account was cloned/replicated.”", "Twitter handle @LtAsimZamal had shared a message which targeted the Pakistani government for violating human rights in Pakistan Occupied Kashmir. This profile was created recently in June 2019 and has used a photograph General Asim Bajwa.", "Social media users are advised to self-verify accounts before sharing tweets. One method to confirm a profile’s authenticity is to check for a blue-tick. In case this is absent, users can check the date of creation of the account and the nature of tweets by the person.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]