["On January 26, tractor rally by farmers protesting against the centre’s three farm laws turned violent after a mob entered the Red Fort and other groups clashed with the police at ITO and other parts of Delhi.", "Zee News aired a broadcast that showed a man remove a flag from one of the domes of the Red Fort. The said bulletin is available on YouTube. In the opening seconds of the video, as the man threw a flag towards the protestors, the anchor claimed, “Look at the visuals from the Red Fort where the tricolour was removed and replaced with Khalsa flag. Look how the tricolour flag was disrespected. The flag was tossed on the ground. These visuals send shivers down the spine in a democracy and are saddening, especially on Republic Day. The nation’s pride was brought down and replaced with their flag.”", "The same clip was shared by Pakistan-based propaganda Twitter account @ZaidZamanHamid. This handle is withheld in India hence a screenshot has been provided below. The account has been featured in multiple fact-check stories by Alt News, including false news related to Kashmir after the abrogation of Article 370.", "Alt News watched the video aired by Zee News and noticed that the flag isn’t India’s national flag. The flag in question appears to have white and green colours.", "This slideshow requires JavaScript.", "A keyword search on Reuters threw up an image of the same scene where the flag that was tossed can be clearly spotted. It is not the Indian national flag.", "The photograph was clicked by Adnan Abidi on January 26. The image is captioned as, “A farmer puts a flag on top of the historic Red Fort, during a protest against farm laws introduced by the government, in Delhi, India.”", "Another keyword search on Getty Images shows a different photo with the same flag.", "The green and white flag that was tossed toward the protestors is the flag of the Bhartiya Kisan Union (BKU).", "Despite even a cursory look establishing that the flag is not the Indian national flag, Zee News aired misinformation to thousands of viewers. Alt News had earlier debunked the false claim that the flag hoisted on the ramparts of the Red Fort was the Khalistan flag. Protestors had unfurled Sikh religious flags on an empty flagstaff.", "Donate Now", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]