["About this rating", "In September 2017, a post resembling a news item appeared to report that soda and candy are being removed from Iowa's food assistance program, and recipients would no longer be able to use their electronic benefit transfer card to purchase them:", "Des Monies, Iowa", "On Oct. 1st, 2017 Iowa Residents will no longer be able to buy Soda Pop or Candy with their Benefits, Sources say the number one product bought with the EBT Cards was Mt. Dew.. with other studies in place officials are wanting to make Iowa a more Healthy State!", "A disclaimer at the bottom of the site reads:", "This website is an entertainment website, news are created by users. These are humourous news, fantasy, fictional, that should not be seriously taken or as a source of information.", "The Iowa Department of Human Services explained that benefit cards in Iowa can be used to purchase \"all types of foods that are sold to be eaten at home,\" which includes soft drinks and candy:", "You can use food assistance to buy all types of foods that are sold to be eaten at home — including snack foods, candy, ice, nonalcoholic beverages, soft drinks and their bottle deposits. You also can buy plants and seeds to grow food.", "Policing what people buy with government benefits is a popular pastime in some circles; stories of people buying food perceived to be high-end, such as steak, lobster, and sodas often go viral alongside commentary that impoverished people are somehow working the system (often with a soupçon of racial animus, and evidently without considering that such foods offer nourishment, not luxury, and sometimes go on sale).", "This particular site has been responsible for several internet hoaxes, including the false rumors that Disneyland was permanently closing Fort Wilderness, and that a giant python was discovered in an Indiana creek.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]