["A fake news story about Whoopi Goldberg allegedly condemning the widow of a slain Navy SEAL elicited such vitriol, the author says it led him to decide to stop posting on his website.", "A March 1, 2017, post on UndergroundNewsReport.com said Goldberg excoriated Carryn Owens, the wife of William \"Ryan\" Owens, a SEAL killed during a Jan. 29 raid in Yemen. President Donald Trump pointed out Carryn Owens in the gallery during his speech before Congress on Feb. 28.", "The UndergroundNewsReport.com article doesn’t mention the Owens family by name, but it does use a fabricated quote from Goldberg.", "\"She was just looking for attention. These military widows love their 15 minutes in the spotlight,\" Goldberg is quoted as saying. \"If it were me I wouldn’t be able to leave the house. How can someone who is truly grieving go out there and be on TV. It just doesn’t make sense to me\"", "As part of its efforts to eliminate fake news in users’ news feeds, Facebook alerted us that the story might be made up — and it is.", "The author of the story told PunditFact that every story on UndergroundNewsReport.com is bogus. James McDaniel, who told us that he is an American who lives in Costa Rica, said he made them up first as a joke, then used them to try and rile Trump supporters who believed the articles without verifying them.", "The site contains a disclaimer that says all articles \"are fiction, and presumably fake news.\" There currently is a link at the end of the story that redirects readers to an explanation that the website is trying to fool its readers.", "As of this writing, the Goldberg story had 348 comments, and had been shared on Facebook well over 56,000 times. The same story has popped up on other sites that have copied it, with no indication that it is fake.", "The entire experiment was never meant to be serious, McDaniel said, but he decided to quit posting new articles once he saw how far-reaching his fabrications had become online.", "\"I might have carried on a bit longer because I was having fun, but people took the Whoopi Goldberg story so seriously and it had gotten so big I thought I had better pull the plug,\" McDaniel wrote via email.", "We rate this claim Pants On Fire!", "UndergroundNewsReport.com, \"Whoopi Goldberg: Navy SEAL Widow was ‘Looking for Attention’,\" March 1, 2017", "Washington Post, \"The White House says a deadly raid in Yemen was long planned in Washington. Not true, say officials who served Obama.,\" Feb. 2, 2017", "PolitiFact, \"Reports falsely accuse Democrats of refusing to stand for Gold Star widow,\" March 1, 2017", "Interview with James McDaniel, UndergroundNewsReport.com administrator, March 6, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]