["By Eugene Kiely", "Posted on January 19, 2017", "In his final press conference, President Obama falsely claimed that a treaty he signed with Russia in 2011 “has substantially reduced our nuclear stockpiles, both Russia and the United States.” The U.S. has decreased its deployed strategic nuclear warheads since the treaty took effect, but Russia has not.", "Also, the nuclear arms treaty does not require either country to destroy nuclear weapons or reduce their nuclear stockpiles. Instead, it limits the number of warheads that can be deployed on strategic (or long-range) launchers and bombers.", "Former Secretary of State Hillary Clinton made a similar claim during the 2016 presidential campaign. In a TV ad, Clinton boasted that, as secretary of state, she was responsible for “securing a massive reduction in nuclear weapons.” That was in April last year. It wasn’t true then, and, since that time, Russia has increased its deployed warheads.", "At his final press conference as president, Obama was asked about President-elect Donald Trump’s statement that Trump would consider lifting the sanctions against Russia if the country agrees to reduce its nuclear weapons. In response, Obama boasted that the New START Treaty has “substantially reduced” Russia’s nuclear weapons. (In his remarks, Obama referred to New START as START II, because it followed START, which took effect in 1994 and ended in 2009.)", "Obama, Jan. 18: On nuclear issues, in my first term we negotiated the START II Treaty and that has substantially reduced our nuclear stockpiles, both Russia and the United States.", "Obama signed the New START Treaty on Feb. 2, 2011. The treaty limits the number of deployed strategic nuclear warheads to 1,550 each for Russia and the United States, and limits their “deployed and non-deployed strategic launchers and heavy bombers” to 800, as explained in a State Department fact sheet.", "In the initial exchange of data on Feb. 5, 2011, Russia reported having 1,537 nuclear warheads on 521 deployed intercontinental ballistic missiles (ICBMs), submarine-launched ballistic missiles (SLBMs) and heavy bombers. In an Oct. 11, 2016, report, the nonpartisan Congressional Research Service said that “analysts expressed surprise that Russian forces were already below the treaty limits in New START when the treaty entered into force.”", "In the most recent exchange of data, Russia reported that it had 1,796 nuclear warheads on 508 deployed ICBMs, SLBMs and heavy bombers, as of Sept. 1, 2016. That’s an increase of 259 deployed nuclear warheads, or 17 percent, for Russia, even as its number of deployed launchers have declined slightly.", "So, Obama is wrong to say that the treaty “has substantially reduced” Russia’s “nuclear stockpiles.” Not only has Russia increased its deployed nuclear warheads, but the treaty does not require the U.S. or Russia to destroy any nuclear warheads, as Hans Kristensen, director of the Nuclear Information Project at the Federation of American Scientists, told us in an email when we wrote about this in April 2016.", "“The treaty itself does not require destruction of a single nuclear warhead,” Kristensen wrote. “Nor does it have any direct impact on how many nuclear warheads Russia and the United States may have in their total stockpiles.”", "The U.S., on the other hand, has reduced its deployed nuclear warheads from 1,800 in February 2011 to 1,367 in September 2016 — a 24 percent decrease.", "We asked the White House to explain how the treaty has “substantially reduced” Russia’s nuclear stockpile. In response, we were referred to a written statement that Admiral Mike Mullen gave to the Senate Foreign Relations Committee during hearings on the treaty in 2010 and before the treaty took effect. Mullen was the chairman of the Joint Chiefs of Staff when the treaty was ratified by the Senate on Dec. 22, 2010.", "But Mullen’s statement does not support Obama’s claim.", "The committee asked Mullen, “What did the United States get in return from Russia for agreeing to these limits in view of the fact that all of the reductions appear to be on the U.S. side?” His response was that the treaty “sets equal, but lower, aggregate limits on the number of deployed strategic delivery vehicles and associated warheads” and “will provide predictability, transparency, and stability in the United States-Russian strategic relationship.”", "We don’t take issue with the benefits of the New START Treaty. And Russia could reduce its deployed nuclear weapons before the treaty expires in February 2018. But Russia has not “substantially reduced” its nuclear stockpile.", "Politifact Rating:", "Read More", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]