["By Rem Rieder", "Posted on September 22, 2020", "At a rally in Fayetteville, North Carolina, President Donald Trump falsely claimed that a Pennsylvania court had permitted election officials “to take as long as they want” to count mail-in ballots.", "In fact, the Pennsylvania Supreme Court had ruled that the ballots mailed by Election Day (or presumed to have been mailed by Election Day) could be counted if they arrived by 5 p.m. on Nov. 6, three days after Election Day.", "The case focused on the deadline for accepting ballots, not how long the count would take. In fact, the court said in its decision, “We observe that this extension provides more time for the delivery of ballots while also not requiring alteration of the subsequent canvassing and reporting dates necessary for the Secretary’s final reporting of the election results.”", "Trump, Sept. 19: You saw what happened in Pennsylvania. Some state Supreme Court justice just ruled that they can take as long as they want to count the ballots. That means I’ll be leading and winning Pennsylvania like we did last time. Yeah, yeah. We’ll be leading, we’ll be winning Pennsylvania. We’re going to win it easy.", "Here’s the background:", "On Oct. 31, 2019, Gov. Tom Wolf signed legislation allowing Pennsylvanians for the first time to vote by mail without a specific reason. The law specified that the ballots must be received by 8 p.m. on Election Day in order to be counted, regardless of when they were postmarked. (See “Voting by Mail in the Swing States.”)", "In August, expressing concerns that the U.S. Postal Service wouldn’t be able to deliver the ballots on time, the Wolf administration asked the state Supreme Court to extend the time for accepting the ballots by three days as long as they were postmarked by 8 p.m. Nov. 3, Election Day. The administration cited a letter from U.S. Postal Service General Counsel Thomas Moore warning that the state’s deadlines were too tight to guarantee delivery of all the ballots.", "In the state’s June primary, tens of thousands of mail-in ballots arrived after the deadline. Wolf extended the deadline in some counties so that ballots there could be counted.", "Mail-in voting in the general election is expected to be high in Pennsylvania and across the country in light of the COVID-19 pandemic. Pennsylvania Secretary of the Commonwealth Kathy Boockvar said she expects as many as half of the state’s voters to vote by mail in November.", "Republicans opposed extending the deadline.", "On Sept. 17, the state Supreme Court extended the deadline for accepting ballots with the proper postmark until Nov. 6 at 5 p.m. The justices also said that ballots “received within this period that lack a postmark or other proof of mailing, or for which the postmark or other proof of mailing is illegible, will be presumed to have been mailed by Election Day unless a preponderance of the evidence demonstrates that it was mailed after Election Day.”", "The opinion pointed out that Pennsylvania would be accepting military and overseas ballots for seven days after the election. (It will finishing counting them Nov. 11.) The court said, “We conclude that this extension of the received-by deadline protects voters’ rights while being least at variance with Pennsylvania’s permanent election calendar, which we respect and do not alter lightly, even temporarily.”", "Counting the ballots begins at 7 a.m. on Election Day.", "Trump was also wrong when he attributed the decision to “some state Supreme Court justice.” The extension was granted in a 4-3 ruling by the entire court.", "Pennsylvania is an important swing state. Trump narrowly won the Keystone State in 2016, and its 20 electoral votes were crucial for his victory. It was the first time since 1988 that a Republican presidential nominee won the state.", "Thus far in the campaign Democrat Joe Biden is leading in the state, according to the polls. But the race is fairly close. The most recent average of polls from Real Clear Politics shows Biden ahead by four points, 48.7% to 44.7%.", "The state Supreme Court made a couple of other decisions on Sept. 17 also considered helpful to the Democrats. The court ruled that the Green Party hadn’t followed proper procedures and so its presidential candidate, Howie Hawkins, could not appear on the ballot. And it rejected the Trump campaign’s effort to prohibit the use of ballot drop boxes.", "Trump has made his opposition to mail-in voting a major theme in his campaign. About a quarter of ballots cast in the 2018 general election nationwide were by mail, according to the Election Assistance Commission. And mail-in voting soared during this year’s primaries as the nation struggled with the COVID-19 pandemic.", "Trump has complained that because of mail-in voting, results may not be known on election night. “You won’t know the election result for weeks, months, maybe years after,” he said at the White House on July 31. “Maybe you’ll never know the election result, and that’s what I’m concerned with.”", "The president has drawn a distinction between absentee voting, which he says is “good,” and mail-in voting. But as we have reported, it’s a distinction without a difference. Voting experts have told us verification is the same for both, and many states consider them the same thing.", "As we have written, there is no evidence to support the claim that “mailed ballots are corrupt.” Voting experts say the president is exaggerating when he says mail ballots are “fraudulent in many cases.” While the instances of voter fraud via mail-in or absentee ballots are more common than in-person voting fraud, the number of known cases is relatively rare.", "That said, mail-in ballots are not without problems. Ballots have been rejected because they arrive late, because voters forget to sign them or other errors. Because of a massive increase of mail-in voting, two congressional races in New York City remained undecided nearly six weeks after voters went to the polls.", "Editor’s note: Swing State Watch is an occasional series about false and misleading political messages in key states that will help decide the 2020 presidential election.", "Editor’s Note: Please consider a donation to FactCheck.org. We do not accept advertising. We rely on grants and individual donations from people like you. Credit card donations may be made through our “Donate” page. If you prefer to give by check, send to: FactCheck.org, Annenberg Public Policy Center, 202 S. 36th St., Philadelphia, PA 19104.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here for more.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]