["India Today news director Rahul Kanwal tweeted an infographic created by his channel which claimed that India has the lowest vaccine price in the world. The chart lists prices of vaccines in China, US, EU, Russia, Saudi Arabia, South Africa, Brazil and India. It claims these are the prices at which the vaccines are available to citizens.", "pic.twitter.com/vfXCIFFKja", "— Rahul Kanwal (@rahulkanwal) March 2, 2021", "Soon after, BJP also claimed quoting media reports that made-in-India COVID vaccines have the lowest prices in the world if any eligible citizen chooses to pay.", "Made-in-India COVID vaccines have the lowest prices in the world if any eligible citizen chooses to pay for the inoculation. It’s free at all the government centres.#LargestVaccinationDrive #Vaccine4All pic.twitter.com/aHeqmwJZ3r", "— BJP (@BJP4India) March 3, 2021", "A similar infographic was shared by BJP Karnataka.", "ಯಾವುದೇ ಅರ್ಹ ನಾಗರಿಕರು ಪಾವತಿಸಿ ಲಸಿಕೆ ಪಡೆಯಲು ಇಚ್ಛಿಸಿದರೆ #MadeInIndia ಕೋವಿಡ್‌ ಲಸಿಕೆಗಳು ವಿಶ್ವದಲ್ಲೇ ಅತ್ಯಂತ ಕಡಿಮೆ ಬೆಲೆಗೆ‌ ಲಭ್ಯವಿದೆ. ಲಸಿಕೆ ಎಲ್ಲಾ ಸರ್ಕಾರಿ ಆರೋಗ್ಯ ಕೇಂದ್ರಗಳಲ್ಲಿ ಉಚಿತವಾಗಿದೆ.#LargestVaccinationDrive#Vaccine4All pic.twitter.com/9zKpLLaDDu", "— BJP Karnataka (@BJP4Karnataka) March 4, 2021", "India Today’s infographic is based on the prices of different vaccines across the world compiled by UNICEF. However, the data states the cost at which vaccines are being procured by the respective countries NOT the prices at which they are available to citizens, except for India.", "India is the only country for which UNICEF lists separate vaccine price for private players and the cost at which the government is procuring them.", "India Today wrongly compared the cost of vaccine procurement for other countries with the price at which vaccines are made available to the public in India.", "India", "Ministry of Health and Family Welfare’s Guidance document COWIN 2.0 states that vaccination will be provided free of charge at government health facilities and will be on a payment basis in private health facilities, at a rate as may be decided by the Government of India from time to time.", "On February 27, the centre announced that private hospitals vaccinating people will be allowed to charge up to Rs 250 per dose. This is the price mentioned in the India Today graphic and does not match the cost of vaccines for Indian private markets in UNICEF’s data. UNICEF refers to SII’s earlier statement that the vaccine will be sold to the government at Rs 219-292 per shot and will be priced at double that rate in the private market. UNICEF has also listed the price of Bharat Biotech’s Covaxin. The central government had asked Bharat Biotech to supply around 55 lakh doses for Rs 295 per shot.", "The government has recently fixed the Rs 250 per dose cap in private facilities and those above 60 and those above 45 with chronic illnesses are eligible for vaccination. The price ceiling and rules will be changed by the government from time to time.", "China", "The Chinese health ministry website states that the COVID-19 vaccine will be provided free of charge to all Chinese people.", "India Today’s graphic implies that citizens in China are procuring vaccines for Rs 2200. However, this is the price at which the Chinese government is procuring the vaccine.", "US", "The Centre for Disease Control and Prevention (CDC) under the US Department of Health and Human Service (HHS) states that the vaccines will be provided at no cost.", "The website of HHS also states the same – “The vaccine is available at no cost”.", "It is also noteworthy India Today has cited the price of Pfizer and BioNTech’s BNT162b2 in the US (Rs 1400 or $19.17 per dose) when AstraZeneca is priced cheaper at Rs 292.10 or $4 per dose.", "European Union", "The official website of the European Commission states that a large majority of member states are offering the vaccine for free.", "Below is the price list of what the EU is paying for different vaccines. The list was published by The Guardian in December 2020.", "In the case of the EU too, India Today has considered the cost of Moderna vaccine which is priced the highest at $18 (Rs 1300) when the UNICEF mentions AstraZeneca vaccine’s much lower cost of $2.19.", "Russia", "The Russian government website shared a news report from January 2021 that states the vaccination drive in the country is free and voluntary.", "Saudi Arabia", "The website of the Saudi Arabian Ministry of Health states that the vaccine is free for all citizens and residents.", "South Africa", "The website of South African Government News Agency quotes Health Department Technical Advisor Dr Qauina Thulare stating that COVID-19 vaccines will be free at the point of service.", "Brazil", "On December 8, 2020, Reuters reported that the Brazilian President said that the vaccine will be free.", "India Today and the BJP falsely claimed that India is providing COVID vaccines for the lowest cost to its citizens. However, in reality, India is the only country in the chart that has not pledged to provide free vaccination. Moreover, India Today wrongly compared the cost of vaccine procurement for other countries with the price at which citizens can get the shot in India.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]