["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "In this Jan. 28, 2020 file photo, people wearing face masks walk down a deserted street in Wuhan in central China's Hubei Province. (AP)", "The photo shows sulfur dioxide projections. It is not a real-time satellite image.", "While it can be produced by burning organic matter, sulfur dioxide mostly comes from burning coal and oil.", "A popular Facebook post is taking an image out of context to promote a hoax about the cremation of coronavirus victims.", "The post, which was published Feb. 15, includes an image that claims to show a \"spike in sulfur dioxide emissions just outside Wuhan.\" The image cites Instagram user @conspiracyplots, who published it the same day.", "\"Sulfur dioxide is a gas that is released when organic matter, such as human bodies, are burned,\" reads text underneath the image. \"This alarmingly high level of the gas may be a sign of mass cremations of victims of the coronavirus.\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "(Screenshot from Facebook)", "According to the World Health Organization, the 2019 coronavirus has infected more than 81,000 people in 37 countries. The vast majority of the 2,761 deaths have occurred in China.", "The Chinese government has ordered for the swift cremation of patients who die after contracting the coronavirus. But the Facebook post does not show sulfur dioxide resulting from cremation.", "Twitter user @inteldotwav first connected cremations in China with heightened levels of sulfur dioxide near Wuhan. In a Feb. 8 thread, the user posted a screenshot of a map from Windy.com, a website that tracks global wind and weather patterns. It has more than 12,200 retweets.", "One of the possible reasons for the influx of sulfur dioxide, @inteldotwav said, is that \"dead bodies are being burned on the outskirts of the city.\" Several tabloids uncritically reported the false claim and later retracted their stories after fact-checkers debunked them.", "RELATED: Hoaxes about the coronavirus are now trying to prove human extermination", "There are a few things wrong with the sulfur dioxide conspiracy theory.", "First, Windy.com provides air quality projections — not real-time atmospheric conditions.", "Second, China’s National Environmental Monitoring Center has addressed the image in the Facebook post. The state-run Xinhua News Agency reported that environmental officials had recorded sulfur dioxide levels several times lower than what Windy.com showed.", "Third, while the gas can be produced by burning organic matter, sulfur dioxide mostly comes from burning coal and oil. And there are several coal power plants and oil refineries near Wuhan.", "The Facebook post is inaccurate and ridiculous. We rate it Pants on Fire.", "Carbon Brief, Global coal power, accessed Feb. 26, 2020", "Facebook post, Feb. 15, 2020", "Full Fact, \"These aren’t satellite images and they don’t show evidence of mass cremations in Wuhan,\" Feb. 13, 2020", "Instagram post, Feb. 15, 2020", "Rice University’s Baker Institute, Open-source mapping of China’s oil infrastructure, accessed Feb. 26, 2020", "Snopes, \"Do Sulfur Emissions from Wuhan, China, Point to Mass Cremation of Coronavirus Victims?\" Feb. 24, 2020", "Tweet, Feb. 8, 2020", "United States National Library of Medicine, What is Sulfur Dioxide? accessed Feb. 26, 2020", "Windy.com, About page, accessed Feb. 26, 2020", "Xinhua News Agency, \"China debunks ‘distorted’ sulfur dioxide reading at epidemic epicenter,\" Feb. 12, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]