["About this rating", "Eagle-eyed viewers thought they spotted an insult to U.K. Prime Minister Boris Johnson in the background of an interview from August 2020, as screenshots of his televised appearance at a Leicestershire school spread across the internet. Johnson visited the school and spoke to news media about changes to face mask guidelines in schools around the country as a result of the coronavirus pandemic.", "In September 2020, images of the interview went viral, and appeared to show an arrangement of letters on a school wall behind Johnson as he spoke to cameras. The letters, visible above his left shoulder under the \"Periodic Table of Maths,\" spelled out the words, “Fuck Boris.”", "Snopes readers asked us if the image was photoshopped. We learned that it was. To determine this, we found the original interview from numerous media outlets, and compared the visible backgrounds to the above image.", "U.K.-based newspaper The Independent shared a version of the interview from a slightly wider angle as the photoshopped image. Above Johnson’s left shoulder, the mathematical elements read out “Se,” “Rf,” “Pe,” and “Dp.” British television outlet Sky News also tweeted a version of the interview shot at a similar angle:", "From this angle, “Si,” “Ta,” “r,” and “Se” were visible above Johnson’s shoulder. None of these angles showed any letters that spelled out “Fuck Boris.”", "But internet users still found things to poke fun at in the unedited video. Some users circled a section of the background that spelled out “arse” by removing the “T” in the “Ta” element:", "During the interview, Johnson said that wearing face masks inside a classroom was “nonsensical,” and that in keeping with World Health Organization (WHO) guidelines, they should be worn in schools that were COVID-19 “hotspots,” but only in “confined areas outside the classroom,” like corridors. He added that teachers can’t teach with face coverings, and one couldn’t expect students to learn with their faces covered either.", "(We should note that the same school Johnson visited in August had a staff member test positive for COVID-19 in early September).", "Beginning on Sept. 1, 2020, the U.K. government mandated that face coverings be required in communal areas and corridors of secondary schools in parts of England that are under lockdown. Teachers in all other secondary schools could make the decision themselves on whether to enforce face masks.", "Based on original footage from news outlets that confirmed the background was indeed photoshopped, we rate this claim as “False.”", "Coughlan, Sean.   \"Coronavirus: Face Coverings U-Turn for England’s Secondary Schools.\"\r\n   BBC News.   26 August 2020.", "Devlin, Kate.   \"Boris Johnson Calls Face Masks in Classrooms ‘Nonsensical’ Hours After Latest U-Turn.\"\r\n   The Independent.   26 August 2020.", "Heffer, Greg.  \"Boris Johnson Makes U-turn and Abandons Face Masks Advice For Secondary Schools.\"\r\n   Sky News.   26 August 2020.", "McGuinness, Alan.   \"Coronavirus: Staff Member at School Recently Visited by Boris Johnson Tests Positive for COVID-19.\"\r\n   Sky News.   7 September 2020.", "Nur Nasreen Ibrahim is a reporter with experience working in television, international news coverage, fact checking, and creative writing.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]