["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Update Feb. 13, 2020: The Free Thought Project, in a quick response, disagreed with our Mostly False ruling but also changed its post to reflect our findings. Shortly after we published our fact-check, the site changed its headline to make it clear the state requires a permit for only certain parks. In a note to its readers, the site explained the change, said it never intended to mislead them, and apologized for any confusion. The site acknowledged how its original wording -- that New York \"forces\" citizens to purchase a stargazing permit – could be interpreted differently by its readers, so it revised its headline.", "A story about how New York state requires a permit to look at the stars in state parks at night appears to have started on Twitter. It spread among conservative and libertarian media outlets, whose writers pointed out what they called  the high cost of living in a state where Democrats control state government.", "\"State Forces Citizens to Pay for ‘Stargazing Permit’ to View Night Sky in Public Parks,\" according to The Free Thought Project. \"With New York City’s bright lights making stars over the metropolis nearly invisible, many New Yorkers head to state parks to get a glimpse of the night sky, but now they’ll need permission from the state to do so,\" according to InfoWars. \"That’s right, citizens are being forced to pay fees to the state to enjoy taxpayer-funded parks.\"", "Red State put it this way: \"Here is a story that shows progressive policies to be not only destructive, but also depressingly stupid.\"", "Even astrophysicist Neil deGrasse Tyson tweeted about it, saying, \"back in the day, you didn’t need permission to look up at the sky.\"", "A reader asked us to look into this claim, and given its coverage on the internet, we agreed.", "We reached out to The Free Thought Project. Matt Savoy, who writes under the name Matt Agorist, said his post specifically cited state parks for night-time stargazing.", "\"We are not claiming at all that people need to buy a stargazing permit to look up at the stars … only for after-hours access to the state parks,\" Savoy said.", "Indeed, New York state requires a permit for stargazing in certain parks on Long Island. These parks include Hither Hills, Jones Beach, Montauk Point, Robert Moses, Sunken Meadow and Wildwood.", "But the permit is not new, as some blog posts, such as Red State, indicated, and it’s unclear why it is getting attention now. The permit has been in place since the 1970s for select parks on Long Island, said Brian Nearing, deputy public information officer in the state Office of Parks, Recreation and Historic Preservation. The permit, valid for a calendar year, costs $35 for state residents and $60 for non-residents. Permit-holders can park their vehicles in certain areas of the parks after dark for stargazing only.", "The permit allows people interested in stargazing into areas of the parks that would typically be closed. The fee helps cover administrative, staffing and security costs at the parks, he said.", "\"Access by permit helps prevent vandalism and criminal mischief as well as reduce the potential of the public putting themselves into a dangerous situation such as entering the water at our ocean beaches,\" he said.", "For special astronomical events, such as meteor showers, the state often waives the fee, he said. The state maintains a list of scheduled stargazing activities in parks all over the state, like night-time nature walks and full moon parties.", "\"No one is ‘forced’ to apply for a permit that allows entry to these facilities beyond normal operating hours,\" Nearing said.", "State parks users pay fees for other activities, too, like fishing and taking a four-wheel-drive vehicle on the beach.", "Permits are handled on a regional level, Nearing said. The Long Island region began issuing stargazing permits decades ago as a benefit for residents of the heavily populated and developed New York City region, where the demand is high for after-hours access, he said.", "The demand is much less upstate, he said.", "Stargazing without an express stargazing permit happens in other state parks, though other park fees may apply. Each state park has its own operating hours. Niagara Falls State Park, for example, stays open 24 hours a day, and the park charges for parking at all times.", "The Free Thought Project said that New York State \"forces\" citizens to pay for a permit to look at the night sky in public parks.", "The statement contains an element of truth. Indeed, there are annual stargazing permits issued in certain parks on Long Island to cover staffing and security costs for the stargazing areas of the parks that would otherwise be closed at night. But it ignores critical facts that would give a different impression. The state doesn't issue such permits at other state parks, including Niagara Falls State Park, which remains open 24 hours a day. And for special astronomical events, such as meteor showers, the state often waives the fee.", "We rate this claim Mostly False.", "Twitter, @SallyMayweather, tweet, Jan. 22, 2020. Accessed Feb. 4, 2020.", "The Free Thought Project, blog post, \"State Forces Citizens to Pay for ‘Stargazing Permit’ to View Night Sky in Public Parks,\" Jan. 24, 2020. Accessed Feb. 3, 2020.", "InfoWars, blog post, \"New Yorkers Forced to Apply for ‘Stargazing Permit’ to View Night Sky,\" Jan. 29, 2020. Accessed Feb. 3, 2020.", "RedState, blog post, \"New York Requires Citizens to Obtain ‘Stargazing Permit’ to Admire the Stars in Public Parks,\" Jan. 27, 2020. Accessed Feb. 3, 2020.", "Email interview, Brian Nearing, deputy public information officer, New York State Office of Parks, Recreation and Historic Preservation, Feb. 4, 2020.", "New York State Office of Parks, Recreation and Historic Preservation document, \"Long Island State Parks Dashboard Permit Guide 2020.\" Accessed Feb. 4, 2020.", "New York State Office of Parks, Recreation and Historic Preservation news release, \"Upcoming Long Island State Permits for 2020 Season,\" Dec. 13, 2019. Accessed Feb. 3, 2020.", "Snopes, article, \"Does New York Require a Permit to Stargaze in State Parks?\" Jan. 31, 2020. Accessed Feb. 3, 2020.", "Patch, Smithtown, New York, article, \"Four Long Island Parks to Stay Open for Meteor Shower,\" Aug. 8, 2019. Accessed Feb. 4, 2020.", "The New York Times, article, \"Stargazers are Losing Sites at State Parks,\" July 12, 1987. Accessed Feb. 4, 2020.", "Email conversation, Matt Savoy, The Free Thought Project, Feb. 5, 2020.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]