["About this rating", "A Minnesota woman reported that she incurred a couple of additional overcharges by the Clinton campaign after making a one-time donation of $25.", "Whether campaign donation overcharges are deliberate and widespread, rather than the rare product of isolated glitches or user error.", "On 15 September 2016, the New York Observer — based on a single, three-month old complaint — published an article reporting that Hillary Clinton's campaign was systematically \"stealing\" money from low-income supporters by using stored credit card information provided by one-time donors to make multiple unauthorized charges:", "Hillary Clinton's campaign is stealing from her poorest supporters by purposefully and repeatedly overcharging them after they make what's supposed to be a one-time small donation through her official campaign website, multiple sources tell the Observer.", "The overcharges are occurring so often that the fraud department at one of the nation's biggest banks receives up to 100 phone calls a day from Clinton's small donors asking for refunds for unauthorized charges to their bankcards made by Clinton’s campaign. One elderly Clinton donor, who has been a victim of this fraud scheme, has filed a complaint with her state's attorney general and a representative from the office told her that they had forwarded her case to the Federal Election Commission.", "\"We get up to a hundred calls a day from Hillary's low-income supporters complaining about multiple unauthorized charges,\" a source, who asked to remain anonymous for fear of job security, from the Wells Fargo fraud department told the Observer. The source claims that the Clinton campaign has been pulling this stunt since Spring of this year. The Hillary for America campaign will overcharge small donors by repeatedly charging small amounts such as $20 to the bankcards of donors who made a one-time donation. However, the Clinton campaign strategically doesn't overcharge these donors $100 or more because the bank would then be obligated to investigate the fraud.", "The Observer talked to Carol Mahre, a Minnesota woman who said back in June 2016 that she made a $25 one-time donation to Clinton in March 2016 but was subsequently charged, in apparent random fashion, $25 twice more on one day in March and another $19 a few weeks later:", "Carol Mahre, an 81-year-old grandmother of seven from Minnesota, is one of the victims of Clinton's campaign donor fraud scandal. In March, Mahre said she made a one-time $25 donation via Clinton's official campaign website. However, when she received her U.S. Bank card statement, she noticed multiple $25 charges were made. Mahre, who said in an interview she only contributed $25 because she's \"not rich\" and that's all she could afford, contacted her son, Roger Mahre, to help her dispute the unauthorized charges.", "Roger, who is an attorney, told the Observer that he called the Clinton campaign dozens of times in April and early May in an attempt to resolve the issue. \"It took me at least 40 to 50 phone calls to the campaign office before I finally got ahold of someone,\" Roger said. \"After I got a campaign worker on the phone, she said they would stop making the charges.\"", "The Observer article stated an anonymous source had told them that about 100 people per day were complaining about spurious Clinton campaign charges to Wells Fargo alone, a figure which spread across all financial institutions would suggest that thousand and thousands of Clinton donors were reporting similar fraud issues every month.  But — even though this \"fraud\" has supposedly been taking place since Spring 2016,  we weren't able to find instances of more such complaints on Facebook, Twitter, or any other social media platform or forum, outside of two January 2016 Twitter pleas from someone seeking assistance in canceling a recurring donation:", "@cenkuygur hillary campaign wont let me cancel recurring donations! 6+ emails and no response HELP!!", "— CW (@genesntees) January 7, 2016", "@AnaKasparian @cenkuygur hillary campaign wont let me cancel recurring donations! 6+ emails and no response HELP!!", "— CW (@genesntees) January 9, 2016", "It's possible that the single complainant (on whom the entire Observer article was based) inadvertently signed up for a recurring donation, accidentally triggered multiple charges by clicking \"submit\" more than once, and/or was simply the victim of an isolated glitch that caused the duplicate charges. Without additional documentation, it's difficult to verify that the issue demonstrates (as the Observer suggested) a deliberate and pervasive form of fraud.", "We contacted Wells Fargo's fraud department in an attempt to verify the breadth of fraudulent charge issue, and after placing us on hold, a representative ambiguously stated that the rumor \"had nothing to do\" specifically with the campaign of Hillary Clinton (which could mean anything from \"the rumor is baseless\" to \"it's a merchant/processor issue\").  We also contacted Wells Fargo's media relations division, who said nothing beyond \"We have no comment at this time.\"", "Crokin, Liz.   \"Exclusive: Hillary Clinton Campaign Systematically Overcharging Poorest Donors.\"\r\n    Observer.   15 September 2016.", "Lagoe, Aaron J. and Steven Eckert.   \"KARE 11 Investigates: Unauthorized Charges by Clinton Campaign?\"\r\n    KARE-TV.   4 June 2016.", "Singal, Jesse.   \"Clinton’s ‘Deplorables’ Remark Misunderstands Racism — and Might Make It Worse.\"\r\n    Science Of Us.   14 September 2015.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]