["About this rating", "As U.S. President Donald Trump accelerated unsubstantiated attacks on the legitimacy of mail-in voting during the summer of 2020, numerous Snopes readers asked us to investigate whether the leader of the U.S. Postal Service was carrying out a nefarious scheme to help Trump win another presidential term.", "In late July and early August, various rumors surfaced regarding Louis DeJoy, a North Carolina businessman whom the Postal Service's governing board selected to run the agency in May 2020. For example, a viral tweet thread alleged:", "My mailman just confirmed they have all officially been told to \"SLOW THE MAIL DOWN,\" per trump's Postmaster General. ...He says that there is backed up mail ALL OVER THE FLOOR. He's never seen anything like it. It has ALREADY begun. But as long as we keep each other informed, we can beat their dirty tricks with INFORMATION.", "The claim's underlying notions were these: DeJoy was a political ally to the Republican president, and the new postmaster general had used his new authority to order Postal Service carriers and clerks to slow deliveries to help Trump win the 2020 November election. A backlog of ballots in the weeks or days before Election Day, critics of the president worried, could lead to votes going uncounted or deemed invalid due to state laws governing mail-in election deadlines.", "What follows is an examination of federal documents obtained by Snopes — including letters by members of Congress, campaign finance reports, and internal memos to Postal Service employees — as well as interviews with postal union representatives and a Postal Service spokesperson, to determine the legitimacy of those questions. DeJoy could not be reached for an interview for this report.", "Note: Snopes not only investigated DeJoy's relationship to Trump, but his financial stake in companies that compete with the Postal Service to evaluate if, or to what extent, his past investments provided any evidence of a plan to undermine the Postal Service's longstanding mission: to provide mail service to every American, no matter their address or income.", "Yes. DeJoy, who lives in Greensboro, donated more than $1.2 million to the Trump campaign between August 2016 and February 2020, according to campaign finance reports compiled by the Federal Elections Commission (FEC).", "It's unclear when or how DeJoy developed a relationship with Trump, and why he decided to support the billionaire's political pursuits. In a 2005 interview with Greensboro's local newspaper, DeJoy — then-CEO of New Breed Logistics, a distribution and warehousing company — appeared less supportive of Trump, saying his self-important attitude on the reality-TV show \"The Apprentice\" was destructive.", "\"I'd be fired,\" DeJoy said, if he was a contestant.", "Nonetheless, by early 2017, DeJoy was among his state's top donors to Trump (see below for The Charlotte Observer's list that ranks DeJoy at No. 3 with a total contribution of $111,000). And by October of that year, DeJoy had become close enough to the president to host him and other donors for fundraiser at his Greensboro house.", "Also, by that time, DeJoy's wife, Aldona Wos, had been appointed by the president to serve as vice chair of a White House commission that oversees paid fellowships in federal offices, according to the couple's foundation website.", "In addition to his contributions to Trump's political campaigns specifically, DeJoy has given hundreds of thousands of dollars to Republican causes or campaigns over decades, the FEC records show.", "The Postal Service's governing board, a group appointed by the president with confirmation from the Senate, selected DeJoy as Postmaster General on May 6, 2020, after what it described as an extensive nationwide search for qualified candidates. At the time of that decision, Trump had appointed all six board members — Chairman Robert Duncan, John Barger, Ron Bloom, Roman Martinez IV, Donald Moak, and William Zollars — since the early days of his presidency.", "DeJoy, who was in charge of fundraising for the Republican National Convention (RNC) in Charlotte when the board made its announcement, made the following donations since the start of 2020, according to filings from the FEC:", "In sum, considering DeJoy's record of donations, as well as evidence of him hosting a Trump fundraiser at his Greensboro home in fall 2017, it is accurate to claim that the new postmaster general is a political ally to the Republican president.", "The answer to this question is less clear.", "In summer 2020, the viral claim about DeJoy — that he had directed carriers to delay mail to benefit Trump's reelection campaign (which we unpack below) — took on another layer: that DeJoy had also allegedly invested $70 million of his own money in delivery companies that compete with the Postal Service.", "That allegation, which we deemed mostly true (see the explanation below), was particularly worrisome for critics of Trump and DeJoy, who believed the alleged holdings were more proof of the two leaders conspiring together — this time in an attempt to privatize the Postal Service.", "Here's some context before we dive into DeJoy's personal assets: Conservative Republicans have long pushed to remove government from mail services that they believe should be left to the private commercial market. Since Trump took office, he has called the Postal Service \"a joke\" or Amazon's \"delivery boy,\" considering its package rates, and has floated the idea of eventually privatizing the agency.", "Meanwhile, others fear dismantling the federally-mandated mail service would disproportionately affect people who live in rural areas, where private companies such as FedEx and UPS either charge higher rates or do no shipments at all.", "At the same time, the Postal Service — which does not receive tax dollars for its operating expenses — faces a worsening financial situation due to a 2006 congressional mandate that required the agency to prepay health care benefits of retirees, as well as a decline in first-class mail customers. The coronavirus pandemic exacerbated those long-standing problems, forcing several post offices nationwide to completely close or scale back hours.", "For instance, on April 9, 2020, roughly one month before DeJoy was selected to lead the Postal Service, then-Postmaster General Megan Brennan said the agency was preparing for a $13 billion revenue shortfall due “directly to COVID-19” and an additional $54.3 billion in losses over 10 years. Considering those projections, she said the agency could “run out of cash this fiscal year” — or the end of September — without federal intervention. (Brennan announced her retirement in October 2019, after more than 30 years with the agency.)", "The former Postal Service leader made those comments shortly after federal leaders negotiated a $2.2 trillion COVID-19 economic relief package, called the Coronavirus Aid, Relief, and Economic Security (CARES) Act, which, initially, included a $13 billion one-time boost for the mail service. But, purportedly at the urging of Treasury Secretary Steven Mnuchin and aides to Trump, congressional leaders removed that provision from the stimulus package, and instead included a $10 billion loan that the Trump administration could leverage in its favor. Then, on July 29, 2020, The Washington Post reported that under DeJoy's leadership, the postal agency gave Mnuchin's office's proprietary information about the Postal Service's most lucrative private-sector contracts, such as Amazon, FedEx and UPS, in exchange for the loan money.", "By that time, Congressional leaders and Trump were battling yet again over another emergency relief package; Democrats proposed a $25 billion boost for the Postal Service but then lowered that amount to $10 billion during talks with Republicans.", "On Aug. 13, 2020, during an interview on Fox Business Network, the president said frankly the tug-and-pull over Postal Service funding was part of his administration's plan to try to make it harder for the agency to handle the expected surge in mail-in ballots in the November election. “If we don’t make a deal, that means they don’t get the money,” Trump told host Maria Bartiromo, referring to the false claim that Democrats are are proposing a universal mail-in voting system. “That means they can’t have universal mail-in voting; they just can’t have it.”", "Which brings us to DeJoy's assets, and the above-mentioned claim that he had \"$70 million invested in companies that compete with USPS.\" For the basis of this analysis, we considered private companies that provide shipping or distribution services, such as DHL, the FedEx Corporation, and United Parcel Service, Inc. (UPS), business competitors with the post office.", "For more than 30 years, DeJoy was the CEO of New Breed Logistics, a supply chain business that contracted with a variety of public and private companies, including the Postal Service. In 2014, XPO Logistics acquired DeJoy's company, and he served on the company's executive team or board of directors until May 2018. According to internal documents, which we obtained using the U.S. Securities and Exchange Commission's (SEC) database of company filings, XPO Logistics considered its competitors to include DHL, FedEx, UPS, and J.B. Hunt Transport Services.", "Aside from that evidence, which proved DeJoy's former company competed for business with organizations that also competed with the Postal Service, Snopes uncovered a letter from his wife, Wos, to a White House legal advisor on January 3, 2020, that listed her family's financial assets, known as \"Attachment A.\" According to that list, the family had stock in companies including UPS, J.B. Hunt Transport Services, Inc., and XPO Logistics, Inc.", "She wrote the letter in response to a nomination by the Trump administration to serve as U.S. ambassador to Canada, and she said she would divest from all holdings in the document within 90 days of her confirmation. However, as of this writing, Wos had not been sworn into the position. The letter, which was available via the Office of Government Ethics, read:", "As of June 15, 2020, the day DeJoy assumed his role as postmaster general, The Washington Post reported the couple had between $30.1 million and $75.3 million in assets in Postal Service competitors or contractors. XPO Logistics represented the vast majority of those investments, and the couple's combined stake in UPS and trucking company J.B. Hunt, for examples, was roughly $265,000.", "On DeJoy's first day, the Senate's top Democrat, Charles Schumer of New York, said in letter to the Postal Service's board of governors' chairman: \"[DeJoy's] financial interests in companies that have business ties with the Postal Services, as well as his extensive campaign fundraising efforts, raise questions\" over his ethical conflicts of interest and partisan interests.", "By that point, a spokeswoman for DeJoy told journalists he had resigned as finance chair for the Republican National Convention, and would \"comply with any financial divestitures that are required\" for the new leadership position.", "In sum, reports proved the DeJoy family at one point had millions of dollars in assets in companies that compete or contract with the Postal Service, which lend credibility to the viral assertion.", "But the exact amount of such investments was unclear, and as of this writing, it was unknown if or to what extent the couple had divested any of the financial holdings.", "Not exactly — but there is some truth to the claim.", "Upon our analysis, the rumor seems to have stemmed from a series of directives DeJoy gave Postal Service employees since he took over the agency. On his first day, for example, he addressed the agency in a video that alluded to impending changes under his leadership that aimed to create a \"viable operating model,\" though he did not go into specifics.", "Then, in mid-July, he issued several memos to employees, including a \"New [Postmaster General's] expectations and plan.\" Those messages to all managers, clerks, and carriers nationwide appeared to be the source of the claim, and detailed changes to how and when the Postal Agency would deliver mail.", "A July 10, 2020, internal document to managers, which Snopes received from the American Postal Workers Union and refers to an \"operational pivot\" for the agency, said the following, for example:", "The initial step in our pivot is targeted on transportation and the soaring costs we incur due to late trips and extra trips, which costs the organization somewhere around $200 million in added expenses.", "The shifts are simple, but they will be challenging, as we seek to change our culture and move away from past practices previously used.", "But perhaps most relevant to the claim, the DeJoy-sponsored directives included instructions for employees to leave letters or packages at distribution centers if they delayed carriers from their routes — contradicting previous rules for deliveries — and said the Postal Service would no longer pay employees overtime to complete all mail deliveries. The July 10, 2020 memo said:", "One aspect of these changes that may be difficult for employees is that — temporarily — we may see mail left behind or mail on the workroom floor or docks [in Processing and Distribution Centers], which is not typical.", "We will address root causes of these delays and adjust the very next day.", "Any mail left behind must be properly reported, and employees should ensure this action is taken with integrity and accuracy.", "As we adjust to the ongoing pivot, which will have a number of phases, we know that operations will begin to run more efficiently and that delayed mail volumes will soon shrink significantly.", "We also considered a separate message to employees in July 2020 that said, under a new initiative, carriers in certain regions would not sort any mail during the morning and instead clock in, retrieve sorted mail from the previous day and limit time in the office as much as possible. Then, when they returned from the streets, they would sort all available mail for the next day.", "The agency said the extra spending on employees' overtime or delivery trips had not improved \"our performance scores,\" without going into detail on what that meant, and framed the changes as necessary steps to improve its financial position. A July 27, 2020, public statement from DeJoy said:", "Given our current situation, it is critical that the Postal Service take a fresh look at our operations and make necessary adjustments. We are highly focused on our public service mission to provide prompt, reliable, and efficient service to every person and business in this country, and to remain a part of the nation’s critical infrastructure.", "David Partenheimer, manager of media relations for the Postal Service, told Snopes that the postmaster general was not doing any media interviews regarding the initiatives, nor about the underlying claims of this report. In a roughly 760-word email to us, however, Partenheimer reemphasized what the agency viewed as the need for the adjustments, and said:", "\"We acknowledge that temporary service impacts can occur as we redouble our efforts to conform to the current operating plans, but any such impacts will be monitored and temporary ... and corrected as appropriate.\"", "Soon after the directives, American Postal Workers Union President Mark Dimondstein told us in a phone interview that employees and customers across the country were noticing mail delays. In the Philadelphia region, for instance, the Philadelphia Inquirer reported situations where residents were going upwards of three weeks without receiving packages and letters, and postal union leaders and carriers said mail was piling up at offices, unscanned and unsorted.", "\"When you ... say this is what you have to do as workers, then that's what we have to do — [the change] runs counter to everything that the Postal Service is about, which is we treat the mail as our own; we get it to the customer as quickly as we can,\" Dimondstein said. \"They've never seen mail backed up like this — it's not being moved.\"", "That meant, while DeJoy had not told carriers to \"slow the mail down\" verbatim, he initiated changes to how and when carriers go about doing their job that the Postal Agency said would cause temporary mail delays.", "However, it would be inaccurate to assume all slow deliveries under DeJoy's leadership were a result of the July 2020 directives specifically, when they could also be linked to reduced hours for some post offices or other circumstances.", "Roughly three months before the 2020 presidential election, voting rights groups and outspoken critics to the president believed the new directives by DeJoy occurred at a convenient time for Trump: when a record number of Americans were preparing to vote by mail and avoid potential exposure to the COVID-19 coronavirus by casting ballots at in-person polling places.", "Specifically, they worried the new requirements for post office carriers and clerks would lead to backlogs of mail-in ballots and thus create challenges for elections officials who, in the majority of states, must invalidate ballots that reach them after Election Day — even if they were postmarked before that date. Rep. Carolyn Maloney, a Democrat from New York, for example, led colleagues in writing a letter to DeJoy on July 20, 2020, that said:", "\"While these changes [to mail service] in a normal year would be drastic, in a presidential election year when many states are relying heavily on absentee mail-in ballots, increases in mail delivery timing would impair the ability of ballots to be received and counted in a timely manner — an unacceptable outcome for a free and fair election.\"", "We asked Dimondstein, APWU president, whether he believed the July directives by Postal Service leadership were somehow linked to a plan to cause mail service chaos before the November election and help Trump win reelection. He said:", "What we do know for truth is this administration is, in written record, proposing and planning to sell the post office to private corporations, i.e. privatizing. ...That was June 2018. We also know as a fact that ...that [there are] calls for reduced service, increased prices, and less workers' rights and benefits. So if you take those two things together, certainly if they're implemented, then they're going to cause delays in mail; they're going to cause service being undermined. ...", "This is a fact: [DeJoy is] what's considered a mega-donor of the Trump administration and the Republican party. ...", "Anything that undermines the Postal Service' [service to customers] ... has us concerned that it could be linked back to those who have an agenda to eliminate [the Postal Service]. But I can't sit here and tell you that that's a fact.", "Partenheimer said any notion that DeJoy made decisions for the Postal Service under directions from Trump (which include claims that he issued the July 2020 changes that resulted in delays to help Trump's re-election campaign) were \"wholly misplaced and off-base.\"", "He said the Postal Service, typically an apolitical agency, remains committed to \"fulfilling our role in the electoral process\" in places where politicians allow voters to cast ballots by mail and \"to delivering Election Mail in a timely manner consistent with our operational standards.\" He elaborated:", "\"[Despite] any assertions to the contrary, we are not slowing down Election Mail or any other mail. Instead, we continue to employ a robust and proven process to ensure proper handling of all Election Mail consistent with our standards.\"", "Days later, he said in a statement to news media that “certain deadlines concerning mail-in ballots, may be incompatible with the Postal Service’s delivery standards,” especially if election officials don’t pay more for first-class postage. “To the extent that states choose to use the mail as part of their elections, they should do so in a manner that realistically reflects how the mail works,” he said.", "Then, on Aug. 18, 2020, DeJoy issued a statement in which he said he would temporarily suspend initiatives \"that have been raised as areas of concern as the nation prepares to hold an election in the midst of a devastating pandemic,\" including the controversial July 2020 directives that eliminated overtime and some delivery trips. The statement read:", "To avoid even the appearance of any impact on election mail, I am suspending these initiatives until after the election is concluded.", "I want to assure all Americans of the following:", "In addition, effective Oct. 1, we will engage standby resources in all areas of our operations, including transportation, to satisfy any unforeseen demand.", "In sum, it was accurate to state that DeJoy, a political ally to Trump, ordered Postal Service workers to leave late-arriving mail at distribution centers for delivery the following day and eliminate extra trips in July 2020 — a change the Postal Service was expecting to cause temporary mail delays — although no verifiable evidence proved those directives were part of a deliberate scheme to disenfranchise voters in the November 2020 election. Additionally, there was no proof to show the changes aimed to help Trump win reelection.", "For those reasons, we rate this claim \"Unproven.\"", "Ye Hee Lee, Michelle and Bogage, Jacob.   \"Postal Service Backlog Sparks Worries That Ballot Delivery Could Be Delayed In November\".\r\n   The Washington Post.   30 July 2020.", "Naylor, Brian.   \"Pending Postal Service Changes Could Delay Mail And Deliveries, Advocates War\".\r\n   NPR.   29 July 2020.", "Naylor, Brian.   \"Pending Postal Service Changes Could Delay Mail And Deliveries, Advocates War\".\r\n   NPR.   29 July 2020.", "USPS Contributor.   \"What Is The History Behind The Unofficial USPS Motto?\"\r\n   Postal Posts.   11 September 2015.", "USPS.   \"Postmaster General Statement On Operational Excellence And Financial Stability\".\r\n   27 July 2020.", "Office of Inspector General.   \"U.S. Postal Service's Processing Network Optimization And Service Impacts\".\r\n   USPS.   16 June 2020.", "Dawsey, Josh, et. al.   \"Top Republican Fundraiser And Trump Ally Named Postmaster General, Giving President New Influence Over Postal Service\".\r\n   The Washington Post.   6 May 2020.", "Bogage, Jacob.   \"Postal Service Memos Detail 'Difficult' Changes, Including Slower Mail Delivery\".\r\n   The Washington Post.   14 July 2020.", "Naylor, Brian.   \"New Postmaster General Is Top GOP Fundraiser\".\r\n   NPR.   7 May 2020.", "Hummel, Marta.   \"New Breed CEO No One's 'Apprentice' Louis DeJoy Is A Big Supporter Of George W. Bush But Says The Clinton Era Was His Most Profitable\".\r\n   News & Record.   7 January 2005.", "Heckman, Jory.   \"USPS Board Names Logistics Executive As New Postmaster General\".\r\n   Federal News Network.   6 May 2020.", "Gordon, Aaron.   \"USPS Plans To Slash Hours At Many Post Offices, Hoping To Save A Buck\".\r\n   Vice.   29 July 2020.", "Cohen, Rachel.   \"USPS Workers Concerned New Policies Will Pave The Way To Privatization\".\r\n   The Intercept.   29 July 2020.", "Derysh, Igor.   \"With Trump Donor In Charge, Postal Service May Shut Locations And Cut Service Before Election Day\".\r\n   Salon.   31 July 2020.", "Rushing, Ellie.   \"Mail Delays Are Frustrating Philly Residents, And A Short-Staffed Postal Service Is Struggling To Keep Up\".\r\n   The Philadelphia Inquirer.   2 August 2020.", "Rep. Carolyn B. Maloney.   \"Maloney, King Lead Bipartisan NY Delegation Call For Immediate Help For The Postal Service\".\r\n   28 April 2020.", "House Committee On Oversight And Reform.   \"Senior Democrats Request Information On Postal Service's Operational Changes\".\r\n   20 July 2020.", "Bogage, Jacob.   \"Trump Ally Takes Over Crisis-Ridden Postal Service As Top Senate Democrat Demands Inquiry On Hiring\".\r\n   The Washington Post.   15 June 2020.", "Murphy, Brian.   \"NC Businessman, A Big-Time GOP Donor, Is Tapped To Lead US Postal Service\".\r\n   The News & Observer.   7 May 2020.", "Shear, Michael.   \"Mail Delays Fuel Concern Trump Is Undercutting Postal Service Ahead Of Voting\".\r\n   The New York Times.   1 August 2020.", "Sargent, Greg.   \"Trump Just Told Us How Mail Delays Could Help Him Corrupt The Election\".\r\n   The Washington Post.   31 July 2020.", "Reichmann, Deb, and Izaguirre, Anthony.   \"Trump Admits He's Blocking Postal Cash To Stop Mail-In Votes.\"\r\n   Associated Press.   14 August 2020.", "USPS.   \"Postmaster General Louis DeJoy Statement.\"\r\n   18 August 2020.", "This report was updated to include an interview by Trump with Fox Business Network on Aug. 13, 2020, where he acknowledged that he was intentionally blocking Postal Service funding in an attempt to make it harder for the agency to process mail-in ballots in the November presidential election.", "This report was updated to include a statement by DeJoy on Aug. 18, 2020, in which he announced the suspension of certain initiatives \"to avoid even the appearance of any impact on election mail.\"", "Jessica Lee is Snopes' Senior Assignments Editor with expertise in investigative storytelling, media literacy advocacy and digital audience engagement.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]