["About this rating", "The U.S. has a love-hate relationship with its rigid, longstanding two-party political system, as evidenced by the every-four-years refrain, \"I'm voting for the lesser of two evils.\" Voters often feel they're being asked to choose between two unpalatable options, one even worse than the other, yet voting for a third-party candidate — not one of which, historically, has ever come close to winning a U.S. presidential election — is tantamount to not voting at all. By voting for the lesser of two evils, the dictum goes, one at least makes one's vote count.", "Not everyone agrees with that. Some argue that it's better not to vote at all, in effect casting a vote against the system itself. Others argue that it's better, always, to vote one's conscience regardless of the immediate consequences. For some it's purely a matter of principle (\"Always vote for principle, though you may vote alone, and you may cherish the sweetest reflection that your vote is never lost,\" said John Quincy Adams), while others make the case that it's preferable to vote one's conscience (or not vote at all) because it amounts to a public statement that may help effect change over the long haul (\"If you always vote for the lesser of two evils, you will always have evil, and you will always have less,\" said consumer advocate and sometime third-party presidential candidate Ralph Nader).", "There's also a theological argument, namely that God will reward those who vote for what's right instead of succumbing to the temptation to choose between evils. A variant of it circulating online for the past few election cycles has been attributed to former secretary of agriculture (and LDS Church luminary) Ezra Taft Benson:", "At this point we'll leave philosophy behind and address the question we're most often asked about this quote, which is: Did Ezra Taft Benson really say that?", "First, it's worth pointing out that the initial thought expressed in the passage above — that choosing the lesser of two evils is still choosing evil — isn't original to this quote. For example, syndicated columnist Max Lerner observed in 1949: \"When you choose the lesser of two evils, always remember that it is still an evil.\"", "As to the quote in its entirety, we have not found a match attributed to any source other than Ezra Taft Benson, nor have we found a match in any of Benson's numerous writings and speeches. Its earliest appearance anywhere, so far as we can ascertain, was in an online Latter Day Saints discussion group in a message posted by user Mike Thompson on 27 December 2008:", "Pres. Benson, when we were sitting in his office in the Church Office Building many years ago told me this after discussing many issues:  \"Mike, if you vote for the lesser of two evils you are still voting for evil and you will be judged for it.  You should always vote for the best possible candidate, whether they have a chance of winning or not.  Then, even if the worst possible candidate wins, the Lord will bless our nation more because more people were willing to stand up for what is right.\"", "Based on the fact that Benson addressed Thompson personally in his account, and that we don't find the passage quoted anywhere prior to 2008 (when Thompson posted it), this was, in fact, its original appearance in print. Indeed, Mike Thompson confirmed this eight years later in a Facebook post dated 10 October 2016:", "However, while we are confident in sourcing the quote to Mr. Thompson, and we take his word for it that the 1972 conversation with Benson took place, in the absence of further corroboration we're ruling the status of its authenticity unproven.", "According to a KUTV television news report dated 12 October 2016, the LDS Church issued a statement saying they \"cannot confirm the quote's source or accuracy\" because it was uttered in a private conversation.", "Hatch, Heidi.   \"Viral Quote on Not Voting 'Lesser of Evils' Can't Be Officially Attributed to LDS Prophet.\"\r\n   KUTV News.   12 October 2016.", "LDS Church Manual.   \"Ezra Taft Benson — 13th President of the Church.\"", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]