["On December 4, the official Twitter account of Indian National Congress tweeted an infographic that includes an image of a child labourer with the following Hindi text, “Seven crore children have been engulfed in poverty due to coronavirus pandemic. Children’s education has suffered due to not attending schools and families are facing a financial burden. The government needs to urgently take steps for the children’s future.”", "कोरोना संकट और बीजेपी संकट के कारण देश की अर्थव्यवस्था से लेकर जनता तक प्रभावित होने लगी है। कोरोना संकट से 7 करोड़ बच्चों पर गरीबी का संकट छा गया है। मोदी सरकार देश को गरीबी के संकट से निकालने के लिये जल्द कदम उठाये। pic.twitter.com/F6AkyGEJeq", "— Congress (@INCIndia) December 4, 2020", "This has been posted by several Twitter and Facebook users including more than 10 official Congress accounts on Facebook.", "This slideshow requires JavaScript.", "Alt News cropped the image used on the poster and was led to multiple links that carried the original picture. A second reverse image search on TinEye led us to the website Felix Features, a Norway-based picture agency.", "The image in question was uploaded in 2008. Its caption says, “Children at a brick factory in Fatullah”, which is a town in Bangladesh. The copyright on the image mentions — ‘Panos Pictures/ Felix Features’.", "A subsequent search on the website of London-based photo agency Panos Pictures confirms that the image was shot in Bangladesh.", "Thus, Congress used a 2008 image of a child labourer in Bangladesh to attack the BJP government.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]