["About this rating", "September 2018 saw the recirculation of a five-year-old, missing-person alert for a young woman named Allisyn Nicole. Facebook users shared a photograph purportedly showing the young woman playing a piano along with a caption saying she was missing \"since yesterday.\" It also contained a telephone number with a New Hampshire area code supposedly belonging to the girl's mother:", "We found virtually identical posts on Twitter, Google Plus, Facebook, and Pinterest (some with photographs, some without) dating back to 1 September 2013. Here are some examples from Twitter (please note that the outbound links point to Facebook posts that no longer exist):", "Allisyn Nicole missing still since yesterday at 11:30am........I thought more people would repost and share... https://t.co/yFkZZPKNDN", "— Gina (@Lvethelife) September 2, 2013", "Allisyn Nicole missing still since yesterday at 11:30am...Franklin NH..603-455-8353 https://t.co/bIv72z3ZiE", "— Nicola Andrews (@NicAndrews) September 2, 2013", "We also found posts on Twitter and elsewhere indicating that the missing girl's mother had posted a Facebook message within two days of the original alert saying her daughter had been found:", "Allisyn Nicole has been found ... no further info is available this is the Mothers' Page https://t.co/1HCIM2Rvgx", "— Lynnette Zulli (@HWHAE) September 3, 2013", "This Facebook post purports to quote a 3 September 2013 message written by Allisyn Nicole's mother:", "Unfortunately, we've had no success verifying any of these claims. The name \"Allisyn Nicole\" doesn't match any entries in the U.S. Department of Justice's Amber Alerts database, nor were we able to locate press reports of a missing girl by that name between 2013 and the present.", "Apart from iterations of the original missing-person alert, reverse image searches yielded no matches for the photograph, so we have not been able to confirm the identity of the pictured young woman. Similarly, we found no listings for a New Hampshire resident named Allisyn Nicole when we plugged the name into BeenVerified.com, a people-search engine.", "Nor did a 5 September 2013 discussion on the Facebook page of WCAX, a Burlington, Vermont, television station, yield any useful clues, despite the fact that several social media posts about the missing girl linked to that page. A representative of the broadcaster said they were unaware of any such report, while various commenters posted news stories allegedly connected to the case that were in fact about other missing persons and offered no information about Allisyn Nicole.", "A Facebook profile exists for an Allisyn Nicole who lists her hometown as Franklin, New Hampshire (which would match the area code in the 2013 posts), but her friends list is empty, and she hasn't posted since 2016. Our efforts to contact her via Facebook were unsuccessful.", "In sum, we're left with way more questions than answers about Allisyn Nicole's alleged disappearance and reappearance in 2013. What we can say with certainty is that any alerts currently circulating about the case are recycled and outdated, whether they were ever true in the first place.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]