["On June 16, the ongoing border dispute between India and China took a critically violent turn as the Indian side reported the death of 20 soldiers in Ladakh’s Galwan Valley.", "Indian Army says a total of 20 Indian soldiers have died in Ladakh’s Galwan Valley", "— Press Trust of India (@PTI_News) June 16, 2020", "Soon after, the news of “43 Chinese troops killed” in the face-off began doing the rounds. This was tweeted by DD News which credited the information to “agency reports”.", "Hindi media outlets Navjivan, India TV and ABP News claimed the same.", "Several others – Major Gaurav Arya, India TV anchors Rajat Sharma and Sushant Sinha, ABP News journalist Sumit Awasthi, NewsX anchor Shehzad Poonawalla – also jumped on the bandwagon.", "A Twitter handle News Line IFE cited Gaurav Arya as the source and put out a tweet with the same claim. In an earlier Alt News Fact Check, News Line IFE was found to be the source of the unverified claim that five Chinese soldiers were killed in the clashes.", "OpIndia, its editor Nupur Sharma and Twitter user The Skin Doctor also promoted the ‘news’ of 43 Chinese soldiers killed.", "India Today anchor Rajdeep Sardesai wrote that ANI claimed based on “Chinese intercepts” that “43 Chinese soldiers [were] killed in the clashes”. He further wrote that there hasn’t been any confirmation from the Chinese side.", "National Spokesperson of VHP Vijay Shankar Tiwari wrote, “43 चीनी सैनिक भी मारे गए (43 Chinese soldiers were also killed).”", "The claim was based on news agency ANI’s tweet which quoted “sources” and claimed that the Chinese have suffered 43 casualties, including the dead and injured.", "Indian intercepts reveal that Chinese side suffered 43 casualties including dead and seriously injured in face-off in the Galwan valley: Sources confirm to ANI pic.twitter.com/xgUVYSpTzs", "— ANI (@ANI) June 16, 2020", "Editor of ANI live services Ishaan Prakash quoted tweeted ANI and wrote, “First confirmation of numbers of injured/dead in the Chinese side”, which is the meaning of the word ‘casualties’.", "First confirmation of numbers of injured/dead in the Chinese side https://t.co/z5Lvaql7Jp", "— ishaan prakash (@ishaan_ANI) June 16, 2020", "It is to be noted that ANI did not give an exact figure on the number of Chinese soldiers who died but wrote that the number “43” includes both killed and wounded.", "The Chinese government has not revealed the number of casualties on their side. The Editor-in-Chief of China-based Global Times tweeted this earlier today. Furthermore, no official figures on the Chinese casualties have been put out by the Indian army as well.", "Chinese side didn’t release number of PLA casualties in clash with Indian soldiers. My understanding is the Chinese side doesn’t want people of the two countries to compare the casualties number so to avoid stoking public mood. This is goodwill from Beijing.", "— Hu Xijin 胡锡进 (@HuXijin_GT) June 16, 2020", "Defence journalist Shiv Aroor tweeted, “NO official word on Chinese casualty figures, all leaks/source stuff doing rounds.”", "*NO official word on Chinese casualty figures, all leaks/source stuff doing rounds*", "— Shiv Aroor (@ShivAroor) June 16, 2020", "Deputy Editor at The Indian Express Sushant Singh similarly tweeted that there has been no official army statement on the number of Chinese casualties, “43 or 430 or whatever”.", "There is not a word about any Chinese casualties, fatal or non fatal, in the official army statement. 43 or 430 or whatever!", "— Sushant Singh (@SushantSin) June 16, 2020", "Therefore, ANI’s tweet on alleged casualties on the Chinese side, both dead and injured, was misrepresented by many as “43 Chinese soldiers killed” in the skirmish. It is also noteworthy that neither the Chinese side nor any prominent Indian defence journalist has confirmed the number of casualties in the People’s Liberation Army (PLA).", "[Update: The copy earlier claimed that Rajdeep Sardesai claimed that 43 Indian soldiers were killed. The error has been corrected.]", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]