["Democrats may have won a majority of seats in the U.S. House, but some bloggers don’t think the party has much to brag about.", "\"Democrats just elected… a woman whose IQ is lower than a salamander, a man who preys on underage prostitutes, an anti-semitic, America-hater who married her brother, and an anti-semitic who beats women,\" reads a Facebook post that appeared online Nov. 7. \"Y’all must be so proud.\"", "The text flanks the pictures of four victors in Tuesday’s election: Alexandria Ocasio-Cortez, a representative- elect from New York; Bob Menendez, an incumbent senator from New Jersey; Ilhan Omar, a representative-elect from Minnesota; and Keith Ellison, a congressman from Minnesota elected as the state’s attorney general.", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.) It has been shared nearly 17,000 times.", "We feel that the allegation about Ocasio-Cortez’s IQ is hyperbole, and after looking into other claims about Omar’s marital history, we don’t have enough information to make a ruling, though the Associated Press has done a lot of reporting on the subject in response to the allegations.", "Instead, we’ll check whether Menendez \"preys on underage prostitutes\" and if Ellison is \"an anti-semitic racist who beats women.\"", "First, let’s look at Menendez. An Oct. 15 political ad from his Republican opponent, Bob Hugin, accuses Menendez of being a hypocrite.", "\"What about the underage prostitutes who accused you, according to the FBI?\" the narrator says. The charge is an old one from Menendez’s last re-election campaign in 2012. It stems from an anonymous tip that Menendez and his friend, Salomon Melgen, hired underage prostitutes in the Dominican Republic.", "Menendez has denied the allegations and, the New York Times reported on Oct. 17, \"it has never been proven.\"", "The FBI investigated the claims. \"The government took responsible steps to investigate these serious criminal allegations, which were not so ‘easily disprovable,’ as the defendants suggest,\" according to court documents.", "But Washington Post reporter Salvador Rizzo, who traveled to the Dominican Republic in 2013 in part to investigate the underage-prostitution allegations, recalls that the FBI \"and a platoon of reporters from national and New Jersey news organizations spent months investigating whether the senator was committing sexual crimes with minors outside the country. The accusations were never substantiated.\"", "Rizzo also talked to Melanie Sloan, a former Democratic congressional aide and a former federal prosecutor: \"I can tell you definitively that there was no evidence ever to support the underage-prostitution allegations,\" she said.", "In a comprehensive fact-check of the Hugin’s ad, Rizzo finds that \"to accuse a rival candidate of maybe sleeping with underage prostitutes, solid evidence is an absolute must. The evidence for Hugin’s ad fails the test.\"", "This Facebook post fails the test, too.", "But what about Ellison? An old tie to Louis Farrakhan, the Nation of Islam leader with a history of making anti-semitic remarks, dogged the congressman during his campaign. As a law student at the University of Minnesota, Ellison wrote an article for the school newspaper that \"defended Farrakhan against accusations of anti-semitism,\" according to a Washington Post story from 2006. He renounced the Nation of Islam that year, when he first ran for Congress. In 2016, a spokesperson for Ellison told CNN that he \"rejects all forms of anti-semitism.\"", "The congressman also wrote an opinion piece for the Post declaring that he \"neglected to scrutinize the words\" of Farrakhan, \"who mixed a message of African American empowerment with scapegoating of other communities.\"", "\"These men organize by sowing hatred and division, including anti-semitism, homophobia and a chauvinistic model of manhood,\" Ellison wrote. \"I disavowed them long ago, condemned their views and apologized.\"", "Others maintain that Ellison made anti-semitic statements himself. In a 2017 opinion piece for The Hill, Alan Dershowitz, an emeritus law professor at Harvard University, wrote: \"A prominent lawyer, with significant credibility, told me that while he was a law student, Ellison approached her and said he could not respect her, because she was a Jew and because she was a woman who should not be at a law school.\"", "Ellison has denied that he’s anti-semitic. He’s also denied more recent allegations that he abused his ex-girlfriend, Karen Monahan. She’s accused the congressman of physical and emotional abuse. Once, she said, he shouted profanities at her while trying to drag her off the bed, the New York Times reported in August.", "Minnesota’s Democratic-Farmer Labor Party hired a law firm to investigate and \"found the allegations unsubstantiated,\" according to Politico.", "There’s a lot to unpack here. The allegations in this Facebook post range from the absurd—comparing Ocasio-Cortez to an amphibian—to the incendiary. But all of the claims, including the ones we didn’t check, are misleading because they’re presented as if they are uncontested facts, and that’s not the case.", "The burden of proof is high in claiming someone paid a minor for sex, and in the case of Menendez, that proof is missing.", "The allegations against Ellison are murkier. We know that, while in law school, Ellison wrote an  article defending Louis Farrakhan against claims that Farrakhan was anti-semitic. Ellison then went on to renounce the Nation of Islam while also addressing those criticisms head-on in an opinion piece for the Washington Post. It seems clear that while this claim contains an element of truth, it ignores critical facts that would give a different impression.", "As to the claim that Ellison \"beats women,\" we know that Ellison has not been convicted of assault in a court of law. However, his former partner hasn’t backed down from claims that he harmed her in what was clearly a volatile relationship. Without more evidence, it is hard to rule on this matter. Still, the claim does not come out of nowhere. While it contains an element of truth, this claim ignores critical facts that would give a different impression.", "Together, the charges in this post are problematic and, in the end, range from incindiary to largely unsubstantiated. We rate this viral Facebook post Mostly False.", "Facebook post, Nov. 7, 2018", "The Associated Press, \"Minnesota House hopeful calls marriage fraud claims ‘lies,’\" Oct. 17, 2008", "The New York Times, \"Fact Check: Did Senator Menendez hire underage prostitutes?\" Oct. 27, 2018", "\"Hypocrisy\" ad, Oct. 15, 2018", "The Washington Post, \"There’s still no evidence Menendez slept with underage prostitutes. A new attack ad says it anyway,\" Oct. 17, 2018", "The Washington Post, \"Escort says Menendez prostitution claims were made up,\" March 4, 2013", "United States’ consolidated opposition to defendants’ motions to dismiss alleging misconduct, Aug. 24, 2015", "Sealed amended affidavit, Aug. 24, 2015", "The Washington Post, \"DNC vice chair Keith Ellison and Louis Farrakhan: ‘No relationship’?\" March 9, 2018", "The Washington Post, \"Rep. Keith Ellison: I should have listened more and talked less,\" Dec. 2, 2016", "CNN, \"Nation of Island leader Farrakhan delivers anti-semitic speech,\" Feb. 28, 2018", "The Washington Post, \"Muslim candidate plays defense,\" Sept. 11, 2006", "Star Tribune, \"Keith Ellison faces and navigates controversy, again,\" Sept. 8, 2018", "Politico, \"Keith Ellison reeling after abuse allegations,\" Oct. 27, 2018", "The New York Times, \"A broken relationship and accusations of emotional abuse: The case of Keith Ellison,\" Aug. 30, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]