["Mitt Romney faced off against President Barack Obama in the first presidential debate of 2012 in Denver. We checked several claims from the debate.", "During the first presidential debate in Denver, Mitt Romney criticized President Barack Obama’s health care law by saying, \"Right now, the (Congressional Budget Office) says up to 20 million people will lose their insurance as Obamacare goes into effect next year.\"\n\nWhile PolitiFact does not put predictions to the Truth-O-Meter, we do fact-check whether politicians or pundits accurately portray the predictions made by others.\n\nWe did so in June, when Romney made a similar claim in a speech -- that \"Obamacare … means that for up to 20 million Americans, they will lose the insurance they currently have, the insurance that they like and they want to keep.\" We rated that claim False.\n\nWe’ll take another look at the claim here.\n   \nCherry-picking the CBO report\n\nWhen we checked with the Romney campaign last June, a spokesman said the source of Romney’s claim was a March 2012 study by the Congressional Budget Office, the nonpartisan number-crunching arm of Congress. The Romney campaign re-confirmed that source after the debate.\n   \nThe CBO study was undertaken to estimate the impact of the health care law on the number of people obtaining health care coverage from their employer. CBO came up with a \"baseline\" estimate -- its best guess. CBO settled on a range of 3 million to 5 million fewer non-elderly people obtaining coverage through their employer each year from 2019 through 2022 than would have been the case before the law was passed. Including those with individually purchased policies means a decline of an additional 1 million to 3 million Americans.\n   \nThat’s nothing to sneeze at, but it’s quite a bit lower than 20 million. So where did 20 million come from?\n       \nCBO supplemented its \"baseline\" estimate with four alternative, and wildly divergent, estimates. One resulted in a net gain of 3 million people with employer-sponsored insurance. The other scenarios resulted in a decline of 10 million, a decline of 12 million, and -- here it is -- a decline of 20 million.\n       \nA number of other estimates by groups other than CBO have tracked with CBO’s baseline estimate, rather than with Romney’s figure. A study by the Urban Institute projected a decline of about 500,000 people. The Lewin Group predicted a decline of about 3 million people. The Centers for Medicare and Medicaid Services actuary pegged the number at about 1 million fewer people. And the RAND Corp. projected that about 4 million more individuals would be covered by employment-based coverage by 2016.\n   \nSo the 20 million number Romney cited does come from CBO, and he hedged by saying \"up to.\" But it’s the most extreme outcome of the five presented, and it’s not the primary estimate.\n       \nSome who \"lose\" coverage will do so because they find better options\n       \nEven beyond the cherry-picking, Romney is wrong to say that 20 million Americans will \"lose\" their insurance.\n   \nAccording to CBO’s \"baseline\" estimates, 3 million people will spurn their employer’s offer of insurance and turn instead to another source, such as the health insurance \"exchanges\" created under the Obama health care law. In many cases, they will do this because they consider the employer’s offering to be unaffordable or lacking too many features they need.\n   \nRomney also ignores 9 million people who wouldn’t have had an employer plan before the Obama law, but who will get employer coverage after passage of the law, perhaps because of the law’s mix of subsidies and penalties for employers.\n   \nIt’s also important to remember the big picture. CBO projects that, overall, the number of uninsured Americans will drop by 29 million to 31 million due to the law.\n\nIt’s not as if no one ever loses coverage today\n   \nAs we have previously noted, many Americans lose their current health plan for reasons that have nothing to do with the new law, though figuring out exactly how many is surprisingly tricky.\n   \nBureau of Labor Statistics figures show that, on average, slightly more than 3 percent of employees leave their jobs in any given month. But you don’t have to change jobs to see your plan change. Your employer may change insurance carriers, or the insurance carrier may unilaterally modify the terms of your plan.\n       \nHow common is this? The Medical Expenditure Panel Survey, sponsored by the U.S. Department of Health and Human Services, found that in 2007, just over 14 percent of the entire U.S. population \"switched\" health insurance.\n   \nAll told, this churn -- which, to reiterate, is happening because of forces beyond the Obama health care law -- almost certainly dwarfs the scale of the changes Romney is talking about.\n   \nEven Romney’s cherry-picked number of 20 million amounts to 7 percent of the 270 million non-elderly people in the U.S. CBO’s preferred figure represents an even smaller share -- 1 percent to 2 percent.\n   \nOur ruling\n   \nRomney said, \"Right now, the (Congressional Budget Office) says up to 20 million people will lose their insurance as Obamacare goes into effect next year.\"\n\nThat number is cherry-picked, and many of those 20 million will be leaving employer coverage voluntarily for better options. Romney also ignores that under the status quo, many more people today \"lose\" coverage than even the highest, cherry-picked CBO estimate. We rate his statement False.", "Mitt Romney, transcript from the presidential debate in Denver, Oct. 3, 2012\n\nPolitiFact, \"Mitt Romney says 'Obamacare' means up to 20 million Americans will lose insurance they like and want,\" June 29, 2012\n\nMitt Romney, remarks after Supreme Court decision on the Obama health care law, June 28, 2012\n   \nCongressional Budget Office, \"CBO and JCT’s Estimates of the Effects of the Affordable Care Act on the Number of People Obtaining Employment-Based Health Insurance,\" March 2012\n   \nReince Priebus, \"After 2 years, Obamacare's costs outweighing benefits\" (op-ed in the Orlando Sentinel), March 23, 2012\n       \nCenter for Medicare and Medicaid Services Office of the Actuary, \"Estimated Financial Effects of the Patient Protection and Affordable Care Act, as Amended,\" April 22, 2010\n       \nUrban Institute, \"America Under the Affordable Care Act,\" December 2010\n       \nRAND, \"The Effect of the Affordable Care Act on Enrollment and Premiums, With and Without the Individual Mandate,\" 2012\n       \nLewin Group, \"Patient Protection and Affordable Care Act (PPACA): Long Term Costs for Governments, Employers, Families and Providers,\" June 8, 2010\n   \nU.S. Census Bureau Survey of Income and Program Participation, \"Dynamics of Economic Well-Being: Health Insurance 1996-1999,\" August 2003\n       \nBureau of Labor Statistics, \"Job Openings and Labor Turnover Survey\" (main search page), accessed Feb. 2, 2011\n       \nPolitiFact, \"Reince Priebus says health care law could mean 'as many as 20 million Americans could lose their employer-based insurance,'\" March 23, 2012\n   \nPolitiFact, \"Rep. Blake Farenthold says health care law will force 70 percent of workers to lose their current plan,\" Feb. 2, 2011\n   \nEmail interview with Jonathan Oberlander, professor of social medicine and health policy and management at the University of North Carolina-Chapel Hill, June 29, 2012", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]