["About this rating", "During a debate between presidential candidates on 16 October 2012, President Barack Obama mentioned Planned Parenthood several times, on one occasion stating women \"rely on Planned Parenthood for ... mammograms, for cervical cancer screenings.\"  That statement drew criticism asserting that President Obama had falsely implied that Planned Parenthood health centers themselves conduct mammogram procedures:", "THURSDAY, OCTOBER 18, 2012: Schedule your imaginary mammogram at Planned Parenthood! We all know Planned Parenthood DOES NOT PERFORM MAMMOGRAMS. However, President Obama, Planned Parenthood CEO Cecile Richards, celebrities in Hollywood and countless Planned Parenthood supporters claim over and over that they do. They absolutely refuse to admit that the largest abortion organization in the country does NOT PERFORM MAMMOGRAMS.", "It is true in a literal sense that Planned Parenthood health centers do not themselves conduct mammograms (a procedure which requires specialized equipment and the expertise to use it).  Planned Parenthood offers comprehensive breast health care management, which includes manual breast exams as well as patient education on breast health, but not mammograms.", "That care management program includes providing women with information about mammograms, referring them to health centers where they can obtain mammograms, and assisting them in covering the costs of the procedure by referring them to government programs that provide free mammograms or by using grant funds to reimburse the medical providers who perform the mammograms. (Referrals for mammograms often require the patient have undergone a breast exam within the previous year.)", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]