["“Facts,” a February 21, 2021 Facebook post reads, sharing a screenshot of a Parler post that says, “interesting find. Joe and Jill. she was 15 and he was in his 30’s she used to be the biden family babysitter. fact-checker can’t lie about this one because it’s the truth. you already know the rest. Pedophile.”", "The US election campaign of 2020 saw Biden subjected to a flood of social media posts branding him a pedophile. The unsubstantiated allegations were and remain part of the QAnon conspiracy theory that claims a “deep state” is pursuing a vendetta against now former president Donald Trump, who Biden defeated in the November 3 election last year.", "Other examples of the claim about Biden and his wife can be found here or here.", "This is inaccurate on several counts.", "Jill Biden, formerly Jill Tracy Jacobs, was born on June 3, 1951. Joe Biden was born on November 20, 1942. The US president is therefore eight-and-a-half years older than his wife, making the age difference mentioned in the claim impossible.", "According to media reports -- including a Vogue interview published in 2016 and a post from Jill Biden’s official Twitter account, here -- Jill and Joe went on their first date in 1975. A New York Times article even specifies their love story started in March of that year. She was therefore almost 24 years old, Joe Biden was 32. The two married on June 17, 1977.", "“Senator Joseph R. Biden Jr has said he first saw pictures of Jill Jacobs in March 1975 in an advertisement for a local park in Wilmington, Del,” the Times’ article says.", "In an interview with CNN in 2012, the now-First Lady said she had previously briefly met her future husband at a social event “but we were in a crowd and it was at a fundraiser. So, then, I guess he saw my picture somewhere and he said ‘oh, now that’s the kind of girl I’d like to date,’ and I knew his brother, so his brother said ‘oh I know her,’” then giving Jill’s phone number to Joe.", "Jill Biden’s ex-husband, Bill Stevenson, made allegations in 2020 that Jill and Joe had an affair while Stevenson and she were still married. \"I introduced Joe to Jill in 1972. Right before the election, in ’72,” he claimed, and he first suspected an affair in 1974. Jill Biden denied the allegations.", "Regardless of the veracity of the claim, Jill would not have been 15 in 1972 or 1974, but 21 and 23 respectively.", "Neilia Hunter, the US president’s first wife, and their infant daughter Naomi died in a car accident in 1972, leaving the newly-elected US Senator a single father to two young sons, Beau and Hunter.", "The image used in the posts to describe how “she was 15 and he was in his 30’s” is a genuine photo.", "Jill Biden, herself, shared the picture on her Twitter account in August 2020, here.", "But it dates from 1976, according to the caption of the photo credited to the Biden campaign. In the image, Jill Biden must have been 24 to 25 years old, and Joe Biden 33 to 34 years old. A photo from that same year used in a 2020 Philadelphia Inquirer article shows Jill Biden posing with Beau and Hunter, born in 1969 and 1970 respectively.", "There is also no mention of Jill Biden babysitting for the Biden family, as claimed in the social media posts, in her White House biography.", "While several women have accused Joe Biden of inappropriate behavior in the past, including one sexual assault, which Biden’s campaign team denied, there has never been any credible allegation of child abuse.", "Public interest in baseless conspirational claims accusing Biden of sexual abuse on children surged as the election contest between him and Trump intensified in 2020. Trump -- who has refused to condemn QAnon -- himself reposted a tweet accusing Biden of pedophilia.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]