["On May 16, Congress’s Priyanka Gandhi Vadra wrote a letter to BJP-ruled Uttar Pradesh government seeking permission to send 1,000 buses from Rajasthan for labourers from UP to travel back to their respective native states. Since then, politics has taken over the humanitarian crisis. On May 17, Outlook reported that 500 buses were stuck at the state border waiting for UP government’s approval. On May 19, The Print reported that UP government asked for fitness certificates, insurance documents of buses and drivers.", "In the backdrop of the controversy, BJP national spokesperson Sambit Patra tweeted, “While bringing students from Kota to UP, some buses by UP [government] needed diesel… forget aid… Priyanka Vadra’s Rajasthan government made UP government pay Rs 19,76,286 at midnight and then allowed the buses to leave. Wow, what help. #TwoFaced_Congress.” The tweet included an image of a cheque, dated May 5, for a sum of approximately Rs 19 lakhs. The cheque was placed on an official document. Patra’s tweet has been retweeted over 18,000 times and liked more than 48,000 times. (archive link)", "[Translated from कोटा से उत्तर प्रदेश के students को वापिस लाते समय UP के कुछ बसों को डीज़ल की आवश्यकता पड़ गयी ..दया छोड़िए ..आधि रात को दफ़्तर खुलवा कर प्रियंका वाड्रा की राजस्थान सरकार ने UP सरकार से पहले 19 लाख रुपए लिए और उसके बाद बसों को रवाना होने दिया वाह रे मदद। #दोगली_कांग्रेस.]", "Atul Kumar national vice president at Bharatiya Janata Yuva Morcha (BJYM) also tweeted the image posted by Patra along with identical Hindi text. His tweet was retweeted 300 times (archive link).", "Sambit Patra alleged that Rajasthan government made UP government pay Rs 19 lakhs at midnight before allowing buses filled with students from Kota to leave.", "In April, several media outlets reported the plight of students stranded in Kota, Rajasthan’s education hub. As per Rajasthan State Road Transport Corporation (RSRTC) documents, between April 1 and May 14, 16 trains carried over 18,196 students to Jharkhand and Bihar and 1,057 buses carried over 28,761 students from to Kota to other states including districts in Rajasthan. (View PDF)In order to understand the logistics involved in sending students from Kota to their respective states, Alt News spoke with Om Kasera, district collector of Kota and Naveen Jain, chairman and managing director of RSRTC, Jaipur. According to them, over 12,000 students travelled in buses from Kota to UP on April 17, 18, 19. The bus service was a collaborative effort by both the state governments.", "The RTGS/ NEFT cheque of Rs 19,76,286 from Uttar Pradesh State Road Transport Corporation (UPSRTC) posted by Patra was drafted on May 5 — 16 days after buses from Kota left on April 19. Thus, his claim that the Rajasthan government made the UP government pay Rs 19 lakhs at midnight before allowing buses filled with students to depart is false.", "Jain shared a bank statement of RSRTC that confirmed RTGS transaction of Rs 19,76, 286 by UPSRTC on May 6.", "A day after Patra’s tweet, Uttar Pradesh deputy chief minister Dinesh Sharma held a press conference and clarified that UPSRTC initiated the payment of Rs 19 lakhs to RSRTC on May 5 for buses sent in April, which clarifies further that the buses weren’t stopped for the Rs 19 lakh dues.", "Rajasthan govt raised a bill of Rs 19 lakhs for diesel provided by them for UP buses that were run for bringing back students from Kota, we paid the bill on 5th May: Uttar Pradesh Deputy Chief Minister Dinesh Sharma pic.twitter.com/Kxksoxdp8r", "— ANI UP (@ANINewsUP) May 22, 2020", "On May 22, Alt News tried contacting Patra for a statement. Despite multiple calls, a WhatsApp text and an SMS, he is yet to respond. We also tried to speak with Raj Shekar, MD UPSTRC. He too is yet to respond. However, we managed to speak with an official from UPSTRC who visited Kota for a period two days between April 17 and 19. The USRTC official said, “RSRTC offered full cooperation and met the demand by UPSRTC to refuel the buses promptly.”", "Kasera shared a state-wise summary on the number of buses that took over 28,000 students from Kota to their respective states between April 17 and May 14. As per the second page in the document (screenshot attached below), over 12,000 students were from UP and 411 buses were required in total to ensure they reached their native states.", "“A majority of state governments sent their buses to pick the students. While some states also opted to hire private buses possibly because there were smaller groups of students from those states. Since there was a disproportionately large share of students from UP, there were some logistical hurdles which were subsequently tackled effectively through prompt decision making by both the governments,” said Kasera who also made it explicitly clear that Rajasthan government didn’t charge any student for the bus service.", "Jain received three letters from his counterpart Raj Shekar, managing director UPSRTC. In a letter on April 17, UPSRTC requested RSRTC to refuel (diesel) 120 litres/bus in 150 buses travelling from Agra to Kota.", "Next day two letters by the UPSRTC requested the RSRTC for three points of action — refuel 60 litres/bus for 100 buses arriving from Jhansi; additional buses arriving from Agra (50) and Jhansi (20) needed to be refuelled 120 litres/bus and requested 75 buses from Rajasthan government to ensure remaining students from Kota reach UP. The letter requested RSRTC to inform about the cost of diesel so that funds can be transferred via RTGS (real-time gross settlement) as soon as possible.", "Both the governments expedited the process of sending the students from Kota to UP on April 17, April 18 and April 19. Other than the buses arranged as part of the bilateral state government initiative, certain students hired a private bus service and travelled on May 14.", "“Only the buses that operated from April 17 to 19 were provided by the state governments. Out of this, 309 buses were from UPSRTC and the remaining 94 were from the RSRTC. And the buses were refuelled as per the need of the hour,” said Kasera after referring to the records available with him.", "On April 27, UPSRTC requested RSRTC to share the details of their total expenses.", "Subsequently, RSRTC sent two invoices to UPSRTC — the cost of fuel for the buses which was around Rs 19 lakhs and the operation cost involved in running 94 buses from Kota to UP which was Rs 36 lakhs. The cost of hiring RSRTC buses was in accordance with the tariff fixed in 2017. (View PDF)", "Jain shared another bank statement of RSRTC which showed that UPSRTC paid Rs 36 lakhs on May 20.", "That same day, Press Trust of India also tweeted, “UP govt clears Rs 36 lakh bill sent by Rajasthan govt for return of students from Kota: Official.”", "UP govt clears Rs 36 lakh bill sent by Rajasthan govt for return of students from Kota: Official", "— Press Trust of India (@PTI_News) May 22, 2020", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]