["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "When former state Rep. Raul Torres announced his run for comptroller, he claimed a historic advantage:", "\"I’m a certified public accountant and would be the very first CPA to serve in this office,\" he said in an Aug. 27, 2013, online campaign video.", "Torres, a Republican elected in 2010 who served one term representing Corpus Christi’s District 33, has been a certified public accountant since 1993. Later in the video, he said, \"Can you believe that this office, which manages your tax dollars, has never had an accountant as its head officer?\"", "Well, can we believe it?", "Torres told us by phone that he and his campaign staff checked Wikipedia and other online sources for biographical information on Texas comptrollers back to 1896, when the first CPA certificate was handed out in New York.", "\"I drew my own conclusion that there was no other person with the designation of CPA,\" Torres said.", "We started our research with current officeholder Susan Combs, who left the comptroller’s race wide open when she announced in May 2013 that she would retire. Combs spokesman R.J. DeSilva told us by email that she holds a law degree and directed us to her official biography online, but said the office had no biographical information on previous comptrollers.", "A word on the word, which some pronounce \"controller\" or \"comtroller\": The \"p\" snuck in there during the 15th century, an Oxford English Dictionary editor told the New York Times in 2010. It appears that Middle English \"counteroller,\" a person who checks two scrolls against each other, crashed into French \"compte,\" count.", "Texas’ comptroller of public accounts collects state taxes and predicts how much the state will be able to spend, among other duties, and checks to make sure the budget adopted by the Legislature every two years is balanced.", "Torres said the knowledge of professional standards and skills required to become a CPA, which include performing audits and making reliable estimates, would be of use in the job. Becoming comptroller doesn't require special qualifications, though. DeSilva said the eligibility standards are the usual ones for a Texas candidate: U.S. citizen, 18 or older, not a felon, etc.", "For information on comptrollers past, DeSilva suggested we consult the Texas State Library. There, reference and documents librarian Sue Troyan emailed us the Texas Almanac’s list of comptrollers since 1835, when the provisional government of the Republic of Texas created the office.", "The Republic’s first comptroller is listed as John H. Money, but that surname might be too good to be true; we found him identified as John H. Morey in older editions.", "For this fact-check we restricted ourselves, as Torres did, to comptrollers after 1896.", "At the Texas State Board of Public Accountancy, general counsel Jerry Hill told us by email that none of the folks on our list popped up in the database of certificates issued since 1915, when the agency began administering CPA examinations.", "That helps considerably, but doesn’t cover our whole timespan, and it’s limited to CPAs who were certified in Texas. So we set to gathering descriptions from sources including the Austin American-Statesman archives, the Texas State Historical Association, the state cemetery and materials sent to us by Troyan and reference librarian Kay Schlueter at the Legislative Reference Library of Texas. Our full list of sources is at right.", "Here are the jobs we found Texas’ chief financial officers held before they became comptrollers:", "Richard Watson Finley", "In office 1895-1901", "Justice of the peace, businessman, cotton warehouse owner, financial agent for Texas penitentiaries.", "Robert Marshall Love", "1901-1903", "Teacher, Confederate soldier, farmer, sheriff, U.S. marshal. Assassinated at his desk in the comptroller’s office by an ex-employee whom he had fired. Said to haunt the Capitol.", "John W. Stephens", "1903-1910", "Farmer, merchandiser, stockman, county district clerk, chief deputy U.S. marshal to Love and then chief bookkeeper under Love in the comptroller’s office.", "W.P. Lane", "1911-1915", "Businessman -- likely including a stint as manager of the carpet department at a dry goods store -- then a state representative.", "Henry Berryman Terrell", "1915-1920", "Farmer, merchant, newspaper owner, state representative, state senator.", "Mark L. Wiginton", "1920-1921", "A state representative in 1919; possibly an anti-Prohibition activist before that, based on a Dec. 9, 1904, report in the Itasca Item, and a speaker for a fraternal group offering life insurance, according to the Feb. 19, 1917, Bartlett Tribune and News.", "Lon A. Smith", "1921-1925", "Teacher, county clerk, state representative, state senator.", "Sam Houston Terrell", "1925-1931", "Second lieutenant in the Army during World War I, according to the U.S. Department of Veterans’ Affairs gravesite locator. Alleged fiscal misdeeds as comptroller led to an impeachment trial, during which he resigned.", "George Hartfield Sheppard", "1931-1949", "Teacher, county tax assessor, city official, insurance businessman.", "Robert S. Calvert", "1949-1975", "Army Air Forces; worked for a railway and an electric company and was a bank teller before becoming a statistician in comptroller’s office and chief clerk in comptroller’s office. The longest-serving comptroller was among the most controversial; in 1973, aged 81, he drew notoriety by using a racial slur to describe Eddie Bernice Johnson (then a state representative from Dallas, now a U.S. representative), who sought to have him impeached for racial discrimination.", "Robert (Bob) Douglas Bullock", "1975-1991", "Air Force, lawyer, state representative, assistant attorney general, secretary of state. Credited with modernizing the office and, eventually, most of Texas’ government as well.", "John Sharp", "1991-1999", "Army Reserve, Legislative Budget Board staff, state representative, state senator, state railroad commissioner.", "Carole Keeton Strayhorn", "1999-2007", "Teacher, Austin school board president, Austin mayor, state insurance board member, railroad commissioner.", "Susan Combs", "2007-present", "Lawyer, Dallas County assistant district attorney, state agriculture commissioner.", "Only a few of the jobs seem related to accountancy: Stephens’ post as chief bookkeeper and Calvert’s stints as a statistician and then chief clerk, all within the comptroller’s office itself. But neither man, as far as we could tell, worked as a professional accountant outside the comptroller’s office. We figured that it was unlikely they would have sought certification.", "Our ruling", "Torres said he’d be \"the very first CPA to serve\" as state comptroller.", "We’re not judging here whether the comptroller needs to be a CPA. But we found nobody with that certification in the checkered past of the comptroller’s office, so we’ll rate Torres’ claim as True.", "------------------------------------------------------------------------------------------", "TRUE – The statement is accurate and there’s nothing significant missing.", "Click here for more on the six PolitiFact ratings and how we select facts to check.", "Raul Torres campaign video, official release Aug. 27, 2013", "Email interview, excerpted, with Nelda Carrizales, media relations director, Raul Torres campaign, Aug. 28-29, 2013", "Telephone interview with Raul Torres, Aug. 30, 2013", "Business and Economic History journal article, \"Profiling the New Industrial Professionals: The First CPAs of 1896-97,\" Vol. 25 No. 1, fall 1996", "Email interview, excerpted, with R.J. DeSilva, spokesman, Texas Comptroller of Public Accounts, Aug. 28, 2013", "The New York Times news story, \"A Job Title That Adds Confusion,\" Sept. 28, 2010", "Texas Almanac, 1928, 1984 and 2012-13", "Email and telephone interviews with Sue Troyan, reference and documents librarian, Texas State Library,  Aug. 29, 2013", "Handbook of Texas Online, Texas State Historical Association", "Portal to Texas History website, University of North Texas Libraries' Digital Projects Unit", "Email interview, excerpted, with Kay Schlueter, reference librarian, Legislative Reference Library of Texas, Aug. 29, 2013", "Telephone and email interviews with Jerry Hill, general counsel, Texas State Board of Public Accountancy, Sept. 5-6, 2013", "Texas State Board of Public Accountancy online database of CPAs licensed in Texas, accessed Sept. 6, 2013", "Briscoe Center for American History website, University of Texas", "Telephone interview with Will Erwin, senior historian, Texas State Cemetery, Sept. 5, 2013", "Telephone interview with Tim Hamblin, video archivist, Austin History Center, Sept. 4, 2013", "Groesbeck Journal history column, \"This Week in Texas History: Fired employee goes postal in state capitol,\" June 8, 2010", "The New York Times news story, \"Texas Official Murdered,\" June 30, 1903", "\"Year Book of Texas,\" Cadwell Walton Raines (state librarian), 1903", "\"Unsolved Texas Mysteries,\" Wallace O. Chariton, Kevin Young and Charlie Eckhardt, 2008", "Telephone interview with Miranda Garcia, administrative assistant, City of Austin cemeteries, Sept. 4, 2013", "Telephone interview with Patricia Newsome, administrative officer, Fort Sam Houston National Cemetery, San Antonio, Sept. 6, 2013", "Bartlett Tribune and News, obituary for W.P. Lane, March 10, 1916", "Sunday (Denison) Gazeteer, carpet advertisement, Nov. 13, 1892", "Journal of the House of Representatives, regular session, 30th Session of the Texas Legislature, 1907", "Itasca Item news report, Dec. 9, 1904", "Bartlett Tribune and News news report, Feb. 19, 1917", "U.S. Department of Veterans’ Affairs gravesite locator", "Texas State Library and Archives Commission inventory web page, accessed Sept. 6, 2013", "Howard Payne College Yellowjacket news story, \"Calvert Will be Feted at Banquet,\" Nov. 15, 1957", "\"Bob Bullock,\" biography by Dave McNeely, 2008", "Mexia Weekly Herald news story, \"No School Tax Levy Needed Is Seen In Report,\" July 9, 1937", "United Press International news story in Baltimore Afro-American, \"Bias charge spurs impeachment try,\" Sept. 25, 1973", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]