["About this rating", "The post is based off a 2013 story claiming that a Gap senior official announced the policy to the American Family Association.", "On 15 November 2016, Your Nation News published a story reporting that the Gap, Inc. retail chain planned to \"ditch political correctness\" and put signs inside their stores saying, \"Merry Christmas\" instead of the more inclusive \"Happy `holidays.\" The \"story\" was copied-and-pasted by another site, Yolodonkey, which claims that it has been shared thousands of times on social media.", "We contacted Gap, Inc. for an official statement, but the three-paragraph unsourced post appears to be based off of a 2013 post by BizPacReview concerning an alleged letter sent by Bill Chandler, who was at the time vice-president for global corporate affairs, to the conservative American Family Association (AFA) announcing the change:", "As we near the holiday season I want to update you on how Gap, Inc.’s family of brands will celebrate the Christmas season. As a global retailer, we embrace the diversity of our customers and respect a variety of traditions and faith during the holidays, including Christmas.", "Starting today, every Gap Outlet window will have signs that say “Merry Christmas” along with Christmas trees and wreaths throughout their stores.", "However, there is no mention of either Chandler or the alleged letter on the AFA's web site. In fact, as of this writing Gap Inc. is still on the group's \"naughty list\" for \"not recognizing\" Christmas. Also, the company released a winter-themed commercial on 1 November 2016 with no mention of Christmas. And the banner for its online gift guide reads, \"Holiday 2016\":", "Arturo Garcia is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]