["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "With New Hampshire students perennially saddled with one of the highest tuition rates in the country, Republicans are using higher education to attack Gov. Maggie Hassan, a Democrat who is challenging Republican U.S. Sen. Kelly Ayotte for her Senate seat this November.", "An ad put out by the National Republican Senatorial Committee reminds viewers that Granite State students attending New Hampshire’s public colleges will pay more than in-state students in basically every other state in the country.", "\"Hassan raised college tuition making New Hampshire the highest in America,\" the narrator says, \"Today, New Hampshire students are leaving to find affordable education, taking jobs with them.\"", "The ad suggests that Hassan has been oblivious as the situation reaches a crisis point.", "\"Hassan missed nearly every University system board meeting. Maggie Hassan failed our students. She just hasn’t done her job,\" the ad concludes.", "The line was repeated again by New Hampshire Republican Party chairman Jennifer Horn on Sept. 16, after Hassan publicly criticized the University of New Hampshire for spending $1 million that a former librarian donated to the school to fund a video scoreboard for their football stadium.", "\"Just like a typical Washington politician, Hassan issues indignant statements when it's politically convenient, but doesn't bother to show up when it actually matters,\" Horn said in a statement which blasted Hassan for her \"excessive absences.\"", "PolitiFact New Hampshire decided to check out Hassan’s attendance record for the university system board meetings.", "As governor, Hassan is an ex-officio member of the 27-member board of trustees that oversees the University System of New Hampshire. She can make motions and vote at meetings. The USNH oversees the University of New Hampshire, Plymouth State University, Granite State College and Keene State College.", "The board of trustees is responsible for strategic planning, setting policies, and ensuring the system’s financial health. It usually meets about four times a year, excepting special meetings.", "Looking back at the minutes, the Republicans are correct: Hassan has missed every single USNH board meeting since she took office, except one on June 28, 2013, when she briefly called in and made a motion to freeze tuition, according to meeting minutes provided by a USNH official.", "On the other hand, skipping trustee meetings isn’t unusual for a New Hampshire governor.", "Hassan’s predecessor, former Gov. John Lynch, a fellow Democrat, also made it to a single meeting -- on February 16, 2006 -- during his eight-year tenure as governor. Former Gov. Craig Benson, a Republican who served a single two-year term before Lynch, doesn’t appear to have attended a meeting at all, although meeting minutes for 2004, his second year in office, appear to be partially missing.", "None of these governors were necessarily shirking their responsibilities. Former USNH Chancellor Edward MacKay said he recalled governors going back to Hugh Gallen -- a Democrat who served from 1979 to 1982 -- attending \"at least one\" meeting during their tenure, but added that they \"focused their time on broader issues facing the state and the associated management duties.\"", "The governor’s job is a big one, MacKay said, adding that it’s commonly believed that the day-to-day running of the USNH is better left to those with the time to focus on it.", "\"In New Hampshire, the governor has very limited staff and has many more operational responsibilities than is the case in many states,\" said MacKay, who is currently the Higher Education Division Director at the New Hampshire Department of Education. \"There is an expectation the governor will need to focus on those duties and the chair of the USNH and/or the chancellor will inform the governor of critical policy issues.\"", "Our ruling", "The National Republican Senatorial Committee says Maggie Hassan \"missed nearly every university system board meeting.\"", "The governor is a sitting member of the University System of New Hampshire’s board of trustees, which gives her the power to make motions and vote. Hassan missed all but one meeting during her tenure as governor, and even the meeting she participated in came via phone call.", "That said, Hassan’s behavior is not out of place -- previous governors’ attendance has been similarly sparse, producing little expectation that the state’s chief executive will attend the meetings as a rule.", "The statement is accurate but needs clarification, so we rate the claim Mostly True.", "Archived Board of Trustees meeting minutes from the University System of New Hampshire", "Current Board of Trustees meeting minutes from the University System of New Hampshire.", "Email interview with Edward MacKay, former USNH Chancellor (‘09-2013) and current New Hampshire Higher Education Division Director, Sept. 23-26, 2016", "Email interview with Tiffany Eddy, USNH spokeswoman, Sept. 23, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]