["The photo was published in this Facebook post on October 10, 2019, where it has been shared more than 24,000 times.", "It shows Sajith Premadasa, the candidate fielded by Sri Lanka’s ruling party-led coalition in the country's upcoming presidential poll, delivering his speech at the inaugural rally at the Galle Face Green in Colombo on October 10, 2019.", "Another man’s face in the image has been circled in red.", "Below is a screenshot of the misleading Facebook post:", "The Sinhala text superimposed on the image translates to English as:", "“Doctor Shafi who performed sterilization surgeries, is behind men who don’t have children”.", "The post’s Sinhala caption translates to English as: “Dr. Shafi who massacred thousands of wombs of Sinhala mothers is now on Sajith’s stage. Are you happy now?”", "The same photo was shared here on Facebook with a similar claim, and text posts making the same claim without the photo were published on Facebook here and here.", "Dr. Shafi is a reference to Seigu Shihabdeen Mohamed Shafi, a doctor from the Kurunegala hospital who was arrested on May 24, 2019 on suspicion of amassing wealth through links to an Islamic extremist terror group. He subsequently faced false allegations that he performed non-consensual sterilisation procedures on Sinhala women during C-section surgeries.", "The case accusing him of mass sterilisation was brought before the Kurunegala Magistrate’s Court on June 27, 2019 and, in a 210-page report submitted to the court, the Criminal Investigation Department of Sri Lanka said no evidence was found to link Shafi to non-consensual sterilisation procedures. He was also cleared of any terror links. The court ruling was translated in this AFP fact check report.", "The claim made in the misleading posts is false; the individual from the image circled in red is not Dr. Shafi.", "The man circled is actually Ishak Rahuman, a ruling party Parliamentarian representing the Anuradhapura electoral district.", "Below is a screenshot of his profile on the Sri Lanka Parliament website:", "Rahuman told AFP by phone on October 11, 2019 that he attended his party’s rally to support presidential candidate Sajith Premadasa.", "“I attended the inaugural rally yesterday in Colombo as I wished to pledge my support to our party’s Presidential poll candidate in person. The entire country knows who I am and which electorate I represent. I condemn this type of actions aimed at tainting political opponents,” Rahuman told AFP.", "Below is an image comparison between Dr. Shafi (L) and MP Rahuman (R):", "AFP also contacted the office of State Minister of Transport and Civil Aviation, Ashok Abeysinghe, who was pictured standing next to MP Rahuman at the rally.", "Below is a screenshot of the misleading post with Abeysinghe circled in yellow:", "Minister Abeysinghe’s Private Secretary Chakila Abeysinghe told AFP by phone on October 11, 2019 that Abeysinghe stood next to MP Rahuman at the rally.", "“These claims are absurd, the individual standing between Minister Premadasa and Minister Abeysinghe is UNP MP Ishak Rahuman,” he told AFP.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]