["A video of a massive crowd trying to board a train has been shared on social media with the claim that it’s a recent incident. One Gopi Shah shared the video criticising irresponsible behaviour in the middle of coronavirus pandemic.", "कोरोना की ऐसी की तैसी .. #coronaviruspic.twitter.com/sCMlCZdot8", "— Gopi Shah (@gops33) November 13, 2020", "A few others have also shared the identical clip.", "Go #Corona go. We are #spartacus pic.twitter.com/ojGUV4J7JW", "— Suman Kalyan Ghosh (@SumanKalyanGho6) November 13, 2020", "The same video was viral two years ago with the false claim that it depicts migrants fleeing Gujarat. Alt News did a Google reverse search of the video’s keyframes with the help of Invid, a browser extension and found a YouTube video posted on September 23, 2018 captioned, “Krishnanagar Bongaon Local Train- Ranaghat Station”. In the video, people can be heard speaking Bengali.", "Furthermore, we did a Facebook search with a similar keyword, “Ranaghat station” and found a video by an individual credited to a Facebook user named Sumanta Kumar Nathm which was posted on September 23, 2018.", "Alt News spoke to Sumanta Kumar who claims to have shot the video. He said, “I had shot the video around 8:30 am when I saw this crowd of students at the station. There was an examination for (the post of) constable that day.” Kumar sent us a video shot on October 10, 2018 from the same railway station to verify the location.", "As claimed by Kumar, there was a preliminary written test for the recruitment to the post of constable in West Bengal police on September 23, 2018. We found a notice issued by the West Bengal police which stated the same. While Alt News could independently verify the claim that the video was shot by Sumanta Kumar, it is clear that the video was taken in West Bengal. More importantly, the fact that it is two years old proves it cannot be related to the coronavirus pandemic. It is noteworthy that passenger trains have not started running in the country. Currently, 230 special trains were made operational and the government is in talks with the Railways to start more special trains in high demand areas.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "Trigger Warning: Sexual Violence A distressing video of a girl forced to take her clothes…", "A clip featuring Pakistan men’s Cricket team captain Babar Azam is viral on social media…", "A 13-second clip featuring Bollywood actor Shah Rukh Khan is being shared on social media…", "Union minister of information and broadcasting Anurag Thakur on September 26 announced Waheeda Rehman as…"]