["About this rating", "The rumor of a man locking his head in a cage he designed to help him quit smoking came from a genuine news report.", "The man was from Turkey, not Russia.", "A series of photographs purportedly showing a Russian man's desperate attempt to kick his smoking addiction were shared on social media in April 2018:", "Russian guy locks his head in a cage in an attempt to give up smoking. His wife has the only key and only opens it for meals.", "These images may seem a bit strange, but they come from a genuine news story. This meme does get the man's nationality wrong, however, as this man is from Turkey, not Russia.", "Turkey English-language news outlet, the Hürriyet Daily News, published a story on 1 July 2013 about 42-year-old İbrahim Yücel's desperate attempt to quit smoking. According to the article, Yücel designed his own cage after smoking two packs of cigarettes a day for more than two decades:", "In an unusual bid to quit smoking, a 42-year-old man in the western province of Kütahya has begun wearing a helmet-like wire cage on his head, locked on two sides.", "İbrahim Yücel, who is trying to kick a 26-year habit of smoking two packets of cigarettes per day, gives the keys of his head cage to his wife and daughter when he leaves home every day. In this way, he is unable to open the cage to smoke during the day, even if he craves a smoke.", "It's unclear how long Yücel ended up wearing the device or if he was ultimately successful in kicking his smoking habit. The Hürriyet Daily News report was published just two days after Yücel started wearing the anti-smoking cage. And although the cage — according to the story — successfully prevented him from smoking during this time, we have not been able to find any updates since on Yücel's smoking habits.", "Hurriyet Daily News.   \"Turkish Man Wears Helmet-Like Head Cage to Quit Smoking.\"\r\n    1 July 2013.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]