["The post was published here on Facebook on February 28, 2020.", "It has been shared more than 400 times.", "Below is a screenshot of the misleading Facebook post:", "The post reads, in part: “SERIOUS EXCELLENT ADVICE by Japanese doctors treating COVID-19 cases. Everyone should ensure your mouth & throat is moist, never DRY. Take a few sips of water every 15 mins at least. WHY? Even if the virus gets into your mouth...drinking water or other liquids will WASH them down through your oesophagus and into the stomach. Once there in tummy...your stomach ACID will kill all the virus. If you don't drink enough water more regularly...the virus can enter your windpipes and into the LUNGS. That's very dangerous.”", "A similar claim was also shared here and here on Twitter.", "The claim is misleading.", "This tweet on the WHO's official Twitter account states in part: “While staying hydrated by drinking water is important for overall health, it does not prevent coronavirus infection.”", "Below is a screenshot of the WHO's tweet:", "This video produced by the WHO gives advice on how to prevent coronavirus infection.", "The Japanese Ministry of Health, Labour and Welfare, which oversees the country’s response to the novel coronavirus, has also not issued an advisory recommending frequent water intake.", "In the “About Coronavirus Disease 2019 (COVID-19)” section of its website, the ministry lists washing hands frequently and covering mouth and nose when coughing or sneezing as “everyday preventive actions” to take.", "Below is a screenshot of the relevant section of the website:", "There is no mention of frequent water intake in any of the advisories it has issued. The advisories were published here, here, here and here on the ministry website.", "AFP Fact Check has previously debunked a similar misleading claim that keeping your throat moist can prevent coronavirus infections.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]