["About this rating", "In June 2020, NASCAR announced that it was opening an investigation to find out who was responsible for placing a noose in the garage of Bubba Wallace, the sport's only full-time Black driver. Shortly thereafter, a social media post started to circulate that claimed the investigation was over because NASCAR discovered Wallace had actually mistook a serpentine belt for a noose.  This is not a genuine news story — Wallace did not mistake a serpentine belt for a noose, and the included statement in this post from NASCAR is completely fabricated. This statement does not appear on NASCAR's website nor any of its social media profiles. In a June 21 statement, NASCAR said that it was \"outraged\" by the incident and that whoever was found responsible would be expelled from the sport:  Wallace also released a statement:  This incident occurred a few weeks after NASCAR announced that it was banning the display of the Confederate flag at all of its official events. In the wake of this decision, we've seen several junk news stories and hoaxes about NASCAR. For instance, the sport is not banning the national anthem, prayer, military flyovers, or MAGA apparel.", "Update 6/23/20 3:34 p.m. PT: After this story was published a joint statement from federal authorities announced that their investigation found the noose had been hanging in the Talladega Superspeedway garage since as early as October 2019 (long before it was assigned to Wallace) and no federal charges would be pursued.", "Garrand, Danielle.   \"NASCAR Drivers Rally Around Bubba Wallace at Talladega: \"We Want to Stand With Our Friend.\"     23 June 2020.", "Garrand, Danielle.   \"NASCAR Drivers Rally Around Bubba Wallace at Talladega: \"We Want to Stand With Our Friend.\"     23 June 2020.", "Updated to include new information about investigation.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]