["About this rating", "In October 2020, as U.S. Supreme Court nominee Amy Coney Barrett's confirmation hearing was underway in front of the Senate Judiciary Committee, an image supposedly showing a fly on her shoulder started circulating on social media.", "This image seemed especially amusing to some viewers as it appeared a few days after a fly landed on the head of U.S. Vice President Mike Pence during the vice presidential debate. While a fly truly landed on Pence's head (where it remained for a full two minutes), the image showing a fly on Barrett's shoulder is fake.", "A larger version of the image supposedly showing a fly on Barrett's shoulder included some additional information about where and when this incidental incident took place. The larger image includes a chyron reading \"Day 1\" of Barrett's confirmation hearing, and a timestamp.", "We reviewed video of this section of Barrett's hearing, and it simply does not show a fly on her shoulder.", "The fake image of a fly on Barrett's shoulder was supposedly taken at 2:08 p.m. EST on Day One of her confirmation hearing. This is when Patricia O’Hara, retired dean at the University of Notre Dame Law School, was delivering remarks about the Supreme Court nominee. A video of this moment from C-SPAN shows that there was no fly on Barrett's shoulder:", "https://youtu.be/BrkD9mfvrB8?t=18863\n\nWhile the C-SPAN footage momentarily cuts away from Barrett, videos from other outlets keep Barrett in frame during O'Hara's full remarks, and show that a fly never landed on her.", "It should be noted that as far as we can tell, the housefly is an apolitical creature. While much ado was made about the fly that landed on Pence's head during the vice presidential debate, flies have also proven bothersome for former U.S. President Barack Obama, current President Donald Trump, and former Secretary of State Hillary Clinton.", "Epstein, Reid.   \"A Fly Sat Atop Mike Pence’s Head for Two Minutes During the V.P. Debate.'\"\r\n    The New York Times.   7 October 2020.", "Cassens Weis, Debra.   \"In Delayed Remarks, Retired Notre Dame Law Dean Praises Barrett as 'Brilliant but Humble.'\"\r\n    ABA Journal.   12 October 2020.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]