["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A drone picture shows the scene of an explosion that hit the seaport of Beirut, Lebanon, on Aug. 5, 2020. (AP)", "More than 100 people were killed and thousands injured in a large explosion at the port of Beirut on Aug. 4.", "Lebanese officials have attributed the tragedy to the detonation of ammonium nitrate, a chemical commonly used in fertilizer. There is no evidence that it was a nuclear explosion.", "Israeli officials have denied any involvement. The Lebanese government and President Donald Trump have not “confirmed” that Israel is to blame for the destruction.", "More than 100 people were killed and thousands injured in a large explosion at the port of Beirut on Aug. 4. Lebanese officials have attributed the tragedy to the detonation of more than 2,700 tons of a chemical commonly used in fertilizer.", "But some have an alternative explanation for the explosion, which could be felt up to 150 miles away.", "\"Israel Hits Beirut with Nuclear Missile, Trump and Lebanese Govt. Confirm,\" reads the headline on an Aug. 5 article from Veterans Today, a website with a history of publishing anti-Semitic conspiracy theories and Russian propaganda.", "The article itself has not been shared much on social media, according to CrowdTangle, a social media insights tool owned by Facebook. But screenshots of the headline, images embedded in the story and similar claims have been shared widely across social media platforms.", "(Screenshots from Facebook)", "Some of the posts were flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Lebanese officials are still investigating what sparked the fire that caused the explosion, which severely damaged buildings throughout the capital and covered the city in debris. But is there any evidence that Israel was involved?", "In a word: no.", "Initial investigation indicates no evidence the explosion in Beirut was caused by a nuclear weapon.", "Israeli officials have denied any involvement in the tragedy.", "The Lebanese government and President Donald Trump have not \"confirmed\" that Israel is to blame for the destruction.", "While it’s still unclear how exactly the explosion unfolded, available evidence points to a combination of fireworks and ammonium nitrate.", "Lebanese authorities have said the blast occurred at a warehouse along the Beirut waterfront. The explosion is thought to have been caused by the ignition of ammonium nitrate that had been stored at the site for six years, according to Prime Minister Hassan Diab.", "Ammonium nitrate is an explosive compound that’s commonly used in fertilizer and bombs. It was used in the 1995 Oklahoma City bombing, which left 168 people dead.", "Officials are still investigating what started the fire at the warehouse. However, the fire appears to have spread with the help of fireworks also stored at the port.", "Eyewitness video from Beirut shows what looks like fireworks igniting at the site of the fire at the port. The same footage does not show an incoming missile before the explosion.", "Stunning video shows explosions just minutes ago at Beirut port pic.twitter.com/ZjltF0VcTr", "A clearer view of the explosion also does not show any aircraft or missiles above the city.", "A more clear view of the explosion. #beirut pic.twitter.com/74NgZWvRL0", "The explosion in the videos looks like a mushroom cloud. But contrary to the Veterans Today article, there is no evidence that the explosion was caused by a nuclear weapon.", "Atomic explosions create a blinding light, searing heat and nuclear fallout — none of which have been detected in Beirut. Meanwhile, reddish smoke, a telltale sign of ignited ammonium, can be seen in several bystander videos. The Associated Press reported the blast appeared to create a \"condensation cloud, often common in massive explosions in humid conditions that can follow the shock waves of an explosion.\"", "Other fact-checkers have debunked claims that the blast was caused by a nuclear bomb.", "So the explosion in Beirut was not caused by a nuclear weapon. But what about the alleged involvement of Israel?", "Israel is still technically at war with Hezbollah, a Lebanese political party that has been designated as a terrorist group by several countries — including the U.S. But Israeli intelligence officials have denied involvement in the Beirut explosion to several news outlets. In fact, Israel has offered humanitarian aid to Lebanon through the United Nations.", "\"On behalf of the government of Israel, I send my condolences to the people of Lebanon,\" tweeted the office of Israel Prime Minister Benjamin Netanyahu on Aug. 5. \"Yesterday Lebanon suffered a major catastrophe. We are ready to offer humanitarian assistance, as human being to human beings.\"", "The Lebanese government, which has accused Israel of provoking a recent escalation along the border, has not blamed its neighbor for the blast.", "Meanwhile, Trump said during an Aug. 4 press briefing that the Beirut explosion \"looks like a terrible attack.\" When a reporter questioned his use of the word \"attack,\" the president doubled down.", "\"Well, it would seem like it, based on the explosion,\" Trump said. \"I've met with some of our great generals, and they just seem to feel that it was. This was not some kind of a manufacturing explosion-type of event.\"", "But CNN reported that Trump’s comments contradicted the view of several Defense Department officials.", "In its article, Veterans Today cites \"a general in the Lebanese Army,\" someone else who writes for the website (and another site linked to pro-Russian disinformation), and an image of what appears to be a bird near the fire at the port of Beirut.", "We reached out to the author of the Veterans Today article, but he did not comment.", "Veterans Today claimed Israel dropped a nuclear weapon on the port of Beirut on Aug. 4.", "There is no evidence to support that.", "Lebanese officials believe a combination of fireworks and ammonium nitrate caused the explosion in Beirut, a hypothesis that experts and eyewitness videos back up. The characteristics of a nuclear blast have not been detected in the city. And Israel has denied any involvement in the explosion.", "The article is inaccurate. We rate it False.", "Associated Press, \"Fireworks, ammonium nitrate likely fueled Beirut explosion,\" Aug. 5, 2020", "Business Insider, \"The Beirut explosion created a huge mushroom cloud and visible blast wave, but nuclear-weapons experts say it wasn't an atomic bomb. Here's why.\" Aug. 4, 2020", "CBS News, \"Substance that reportedly sparked Beirut explosions was used in the 1995 Oklahoma City bombing,\" Aug. 5, 2020", "CNN, \"Beirut explosion rocks Lebanon's capital city,\" Aug. 5, 2020", "CNN, \"US defense officials contradict Trump: No indication yet of attack in Beirut,\" Aug. 5, 2020", "Council on Foreign Relations, \"What Is Hezbollah?\" Aug. 3, 2020", "CrowdTangle, accessed Aug. 5, 2020", "C-SPAN, President Trump Coronavirus News Conference, Aug. 4, 2020", "Deutsche Welle, \"Beirut blast: Condolences and aid pour in for Lebanon after deadly explosion\"", "Facebook post, Aug. 4, 2020", "Facebook post, Aug. 4, 2020", "Facebook post, Aug. 4, 2020", "The Globe and Mail, \"NATO research centre sets sights on Canadian website over pro-Russia disinformation,\" Nov. 17, 2017", "Haaretz, \"'We Share Your Pain': Israel Offers Aid to Lebanon After Beirut Port Blast\"", "Lead Stories, \"Fact Check: Blast in Beirut Was NOT A Nuclear Explosion,\" Aug. 4, 2020", "NewsMeter.in, \"Fact Check: Is the massive blast in Beirut a nuclear explosion?\" Aug. 5, 2020", "New York Post, \"Israel uses UN channels to offer aid to Lebanon after deadly Beirut blast,\" Aug. 4, 2020", "The New York Times, \"As Death Toll Rises After Blast, a Search for Answers and Survivors: Live Updates,\" Aug. 5, 2020", "The New York Times, \"Deadly Explosions Shatter Beirut, Lebanon,\" Aug. 4, 2020", "Politico Magazine, \"How Russia Targets the U.S. Military,\" June 12, 2017", "Southern Poverty Law Center, \"Buyer Beware: Veterans Today and its Anti-Israel Agenda,\" Jan. 6, 2011", "The Times of Israel, \"Israel not behind Beirut blast, sources on both sides say; at least 10 killed,\" Aug. 4, 2020", "Tweet from PM of Israel, Aug. 5, 2020", "Veterans Today, \"Israel Hits Beirut with Nuclear Missile, Trump and Lebanese Govt. Confirm (continually updating),\" Aug. 5, 2020", "The Washington Post, \"What the videos of the Beirut blast tell us about the explosion,\" Aug. 5, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]