["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "One of the newest claims roaming the internet involves a freshman Democratic U.S. Representative and her supposed link to an unindicted terrorist.", "According to a recent article published by conservative news website the Columbian Post, U.S. Rep. Rashida Tlaib, D-Mich., has links to Siraj Wahhaj, a prominent but controversial New York Imam who has attracted the attention of authorities in the past.", "The story’s headline reads: \"Democrat Congresswoman linked to UNINDICTED Terrorist!\" It was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "So, let’s just get this part out of the way: We checked this claim and found that while Tlaib and Wahhaj were both featured speakers at a November event in California, that appears to be the extent of any so-called \"link.\"", "Is that a \"link?\" In its weakest form, perhaps.", "Regarding Wahhaj: His name was included on a list of people with a possible connection to the 1993 World Trade Center bombing, though he was never charged.", "While the headline acknowledges Wahhaj has never been indicted, it still makes him out  to be a terrorist. The headline also inflates any Tlaib association.", "Let’s take a closer look.", "Siraj Wahhaj, 68, born Jeffrey Kearse, is an African-American imam of the Masjid At-Taqwa mosque in Brooklyn, NY, and the leader of the Muslim Alliance in North America.", "Wahhaj does have a checkered past. As we mentioned earlier, his name was included on a list of people that prosecutors said \"may be alleged as co-conspirators\" in the 1993 World Trade Center bombing. He was never charged and denies any involvement with the bombing.", "Wahhaj also testified as a character witness for Sheikh Omar Abdel Rahman, the notorious \"blind sheikh\" who was convicted in 1995 of plotting terror attacks in the U.S.", "In August 2018, Wahhaj’s son (also named Siraj Wahhaj), along with his two daughters, a daughter-in-law and a son-in-law, was arrested on 11 felony counts of child abuse at a New Mexico compound.", "It is also important to note that the elder Wahhaj was one of the people who led authorities to the compound after he received a plea from his daughter saying that they were starving, he has claimed.", "While incredibly controversial, Wahhaj is still a prominent cleric in the Muslim community who books speaking engagements around the country and has held executive roles in influential Islamic organizations over the years.", "Starting with the Colombian Post story, we eventually tracked down an article on FMshooter.com, a conservative blog originally founded to focus on promoting \"free market economies and responsible gun ownership.\"", "That story’s headline takes it a bit further: \"Trump-Ranting Democrat Rashida Tlaib Linked To Imam Who Sees Homosexuality As A ‘Disease,’\" it reads, before spending the first four paragraphs of the story referencing Tlaib’s use of an expletive while vowing at a reception following her swearing-in to impeach President Donald Trump.", "\"Delving deeper,\" the story goes on, \"we find that Tlaib – no more than two months ago – was a featured speaker at a CAIR event with Siraj Wahhaj.\"", "It then displays a screenshot of a CAIR promotional flyer for the event.", "That claim checks out.", "The Council on American–Islamic Relations, or CAIR, is a Muslim civil rights and advocacy group that often sponsors events like the one referenced in the article.", "On Nov. 10, Tlaib and Wahhaj were both featured speakers at the organization’s 16th Annual Banquet at California State University’s Sacramento campus.", "\"My appearance at an event does not indicate that I support the views of another person who just so happened to speak there as well,\" Tlaib said in a statement to PolitiFact. Tlaib is the first Palestinian-American woman elected to Congress and she is one of the first two Muslim women.", "\"I have always been and remain committed to fighting for the acceptance of every individual no matter who they are or who they love. Throughout my life, I have spoken up for LGBTQ rights and I will continue to do so,\" she added, in regards to the second story’s headline.", "Besides that speaking engagement, we could find no other connection between the two and the congresswoman said she may have seen Wahhaj at other events, but doesn’t recall any other link to him.", "A story with the headline, \"Democrat Congresswoman linked to UNINDICTED Terrorist!\" is being spread online about new U.S. Rep. Rashida Tlaib.", "Siraj Wahhaj has certainly been a controversial figure and, according to documents, was considered by authorities to be someone who may have had a connection to the 1993 World Trade Center bombing. But he was never charged and remains a significant figure in the Muslim community.", "The only connection we could find between Wahhaj and Tlaib is that they were both featured speakers at a November 2018 CAIR banquet in California.", "While the Columbian Post story contains some truth regarding Wahhaj’s past, the clickbait headlines -- especially regarding a supposed ‘link’ between Wahhaj and Tlaib -- are exaggerated and make it appear more sinister.", "The statement contains an element of truth but ignores critical facts that would give a different impression, so we rate it Mostly False.", "The Columbian Post, \"Democrat Congresswoman Linked To UNINDICTED Terrorist!\" Jan. 8, 2019", "Free Market Shooter,  \"Trump-Ranting Democrat Rashida Tlaib Linked To Imam Who Sees Homosexuality As A ‘Disease’\" Jan. 7, 2019", "Associated Press, \"NYPD monitored Muslim students all over Northeast,\" Feb. 18, 2012", "Reuters, \"Brooklyn imam dismayed by family's tragedy at New Mexico compound,\" Aug. 9, 2018", "CBS, \"Man arrested at New Mexico compound is son of imam with possible link to 1993 World Trade Center bombing,\" Aug. 10, 2018", "InvestigativeProject.org, List of unindicted persons of interest, Feb. 2, 1995; Accessed Jan. 10, 2019", "Investigativeproject.org, Siraj Wahhaj testimony, July 13, 1005; Accessed Jan. 11, 2019", "CAIR California, Sacremento Valley 16th Annual Banquet, Accessed Jan. 10, 2019", "Email interview, Denzel McCampbell, spokesperson for Rep. Rashida Tlaib, Jan. 10-11, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]