["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "White House senior adviser Valerie Jarrett tweeted that \"nothing in Obamacare forces people out of their health plans.\" We checked to see if that's right.", "The White House has been on the defensive recently over its claim, repeated numerous times over the years, that under President Barack Obama’s health care law, if you like your health plan, you can keep it.", "His claim hasn’t worn well amid the letters to hundreds of thousands of Americans with individually purchased insurance plans notifying them that their plans are being canceled. Typically, these policies no longer meet the requirements in Obama’s law, such as the need to cover emergency care, maternity care, mental health or prescription drugs.", "In August 2012, we gave a Half True to Obama’s claim that \"if you're one of the more than 250 million Americans who already have health insurance, you will keep your health insurance.\" A more careful phrasing -- former Obama adviser David Axelrod’s claim that \"the vast majority of people in this country are keeping their (health insurance) plan\" -- recently earned a Mostly True rating.", "But critics of the law have been on the attack about what they call Obama’s broken promise. Defending the law, White House senior adviser Valerie Jarrett sent out this message via Twitter on Oct. 28, 2013:", "\"FACT: Nothing in #Obamacare forces people out of their health plans. No change is required unless insurance companies change existing plans.\"", "Is it really a \"fact\" that \"nothing in Obamacare forces people out of their health plans\"?", "The White House appears to think so. Asked about Jarrett’s tweet at a White House press briefing the following day, Press Secretary Jay Carney backed up her view that it’s the insurers’ fault -- not the administration’s -- if plans are being canceled.", "It’s insurers who are choosing to close plans, Carney said, noting that \"the administration doesn’t step in\" to force cancellations. Instead, he said, \"the insurer is making a decision to basically cancel the plan and reissue or offer the individual a new plan with different benefits or different costs.\"", "While it’s technically true that the insurer makes the final decision, their choices are, to a great degree, limited by the law and the way it’s been implemented by the administration.", "Much of this process has to do with the arcane process of \"grandfathering\" plans that existed prior to the law’s enactment in March 2010.", "Under the law, insurance plans -- either those purchased through an employer or on the individual market -- may be \"grandfathered\" if they have operated continuously since before the law’s enactment and have made no significant changes. This means the insurer can keep the insurance plan essentially as is, without having to implement many (though not all) of the new law’s requirements, such as mandatory coverage for emergency and maternity care.", "But experts say the regulations defining what constitutes a significant change are pretty tight. As our colleagues at the Washington Post Fact Checker pointed out, one of the regulations says that grandfathered status must end if copayments increase by more than $5.00 plus the cost of medical inflation.", "And once a plan is poised to lose its grandfathered status, it’s on the road to oblivion. The Health Insurance Portability and Accountability Act of 1996, known as HIPAA, says that if an insurer wants to end a policy, it needs to give policy holders 90 days notice as well as information about alternative coverage plans that insurer is offering. That’s essentially the message that many individual-market policyholders are receiving in the mail these days, and that is attracting so much attention.", "Health policy experts told us that, in a technical sense, insurers are pulling the plug on these old, grandfathered policies. Echoing what Jarrett tweeted, Timothy Jost, a Washington and Lee University law professor, said that \"if a grandfathered plan is being terminated, it is the insurer’s decision -- nothing in the law requires it.\"", "But other experts said that while this is technically true, it gives a distorted view of what’s going on.", "The law places grandfathered plans in such a straitjacket -- unable to attract new individual policyholders and unable to adjust terms to market conditions -- that it’s only a matter of time before companies are driven to pull the plug. To ignore the government’s role in establishing the parameters for this highly regulated, and highly competitive, industry is substantially misleading.", "Gail Wilensky, the former head of Medicare and Medicaid under President George H.W. Bush, called Jarrett’s message \"word games.\"", "\"Insurance companies cannot continue to sell individual policies that don’t meet the requirements of the essential benefit package, either to individuals or to small businesses, as of Jan. 1,\" Wilensky said. \"But since the insurance companies are not allowed to continue to sell these plans that the person previously had bought and may have liked, they are effectively being forced to change their plan.\"", "Austin Frakt, a health care economist at Boston University who generally supports Obamacare, agreed that \"Jarrett's statement misses an important point.\"", "By all accounts, even the employers who are offering grandfathered plans to their employees are dwindling over time. The annual study of health insurance by the Kaiser Family Foundation and the Health Research & Educational Trust found that the percentage of workers enrolled in grandfathered plans has decreased from 56 percent in 2011 to 36 percent in 2013.", "Another study, by the International Foundation of Employee Benefit Plans, found that of the one-quarter of organizations that still have a grandfathered plan, less than half expect to keep their grandfathered status beyond the next two years. In other words, the grandfathered plan is slowly but steadily becoming a dinosaur.", "Beyond the question of grandfathering, Frakt sees another element of the law that could strongly encourage -- though again perhaps falling short of requiring -- changes in health insurance plans. A 40 percent excise tax on high-benefit plans is set to take effect on Jan. 1, 2018. While that’s several years away, the provision \"will change plans, either by making them more costly or incentivizing redesigns to get below the premium cap,\" Frakt said.", "The irony here, both Wilensky and Frakt said, is that there are ways to describe what’s going on that are both more broadly accurate and more flattering to the policy changes being undertaken.", "The administration’s \"better argument is that we are making sure people have ‘real’ insurance that will be guaranteed to cover them when they need it,\" Wilensky said.", "Frakt concurred. \"The right view of this is that the law does motivate or force change, and that's a virtue,\" he said.", "Our ruling", "Jarrett said it was a \"fact\" that \"nothing in Obamacare forces people out of their health plans.\"", "Saying there’s \"nothing\" in the law that forces people out of their health plans is a pretty extreme claim -- one that implies that insurers who pull the plug on non-Obamacare-compliant plans are acting in some sort of government-free vacuum. Even if it’s technically true that the insurer pulls the plug on a plan, the insurer will only be doing this because the law itself and its implementing regulations have created a context in which, sooner or later, old-fashioned plans will inevitably pass into oblivion -- as the law always intended. We rate the statement False.", "Valerie Jarrett, tweet, Oct. 28, 2012", "Kaiser Family Foundation/Health Research & Educational Trust, \"2013 Employer Health Benefits Survey,\" Aug 20, 2013", "International Foundation of Employee Benefit Plans, \"2013 Employer-Sponsored Health Care: ACA’s Impact,\" 2013", "Federal Register, June 17, 2010", "White House, press briefing by Jay Carney, Oct. 29, 2013", "Kaiser Health News, \"FAQ: Grandfathered Health Plans,\" Aug. 28, 2013", "Washington Post, \"This is why Obamacare is canceling some people’s insurance plans,\" Oct. 29, 2013", "Washington Post Fact Checker, \"Obama’s pledge that ‘no one will take away’ your health plan,\" Oct. 30, 2013", "Email interview with Gail Wilensky, former head of Medicare and Medicaid under President George H.W. Bush, Oct. 30, 2013", "Email interview with Timothy Jost, Washington and Lee University law professor, Oct. 30, 2013", "Email interview with Austin Frakt, health economist at Boston University, Oct. 30, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]