["About this rating", "On July 4, 2019, U.S. President Donald Trump posted a photograph purportedly showing a \"great crowd of tremendous Patriots\" who assembled on the National Mall before his speech at the \"Salute to America\" event:", "This picture garnered thousands of retweets and more than a hundred thousand likes, and it also sparked a number of comments from viewers who accused President Trump of sharing a photograph that had been digitally altered in order to make the crowd size appear larger.", "Twitter user Culpable Crimes, for instance, claimed that Trump's staff had superimposed a picture of a crowd from a 2008 concert at the National Mall over a picture of the crowd at \"Salute to America,\" then shared it as if it were real. That Twitter account also claimed that all of the live feeds of the event were shut down so viewers wouldn't be able to form an accurate view of the crowd size.", "Several other Twitter users also spread this rumor on social media:", "Trump staff takes a photo from a 2008 concert on the mall, super imposes it, creates a fake image, shuts down all the Cams running in the mall, and proclaims to have largest 4th of July celebration crowd in history. This is what Nazis do.", "Desperate, serial lying con-man Trump floods his Twitter feed with the same bogus photoshopped image of his crowd size, which includes an old photo of a concert on the Mall that was from 2008.", "Trump desperately tries to CONvince people including himself the 4th of Juy crowd was much larger than it really was by PHOTOSHOPPING in the 2008 Concert On The Mall crowd into his rally.", "This is the picture from the 2008 Concert On The Mall", "You liar. Only the front half of the photo is your rally. The back part with the crowd is the 2008 concert at the mall.", "Not only is this dishonest Photoshop, it's bad dishonest Photoshop.", "The concert pic is attached.", "But the picture that President Trump shared of the July 4th crowd was real. Photographer Susan Walsh took a very similar photograph available via Getty Images with the caption: “US President Donald Trump speaks during the ‘Salute to America’ Fourth of July event at the Lincoln Memorial in Washington, DC, July 4, 2019”:", "Here's an alternate view of the crowd at \"Salute to America\":", "A live feed from C-SPAN also captured plenty of people on the National Mall for \"Salute to America\":", "Social media users claiming that Trump's staff doctored the photograph with a crowd shot from a 2008 concert weren't actually sharing an image from 2008, but rather a still from the White House's live video feed of \"Salute to America.\"", "The White House's live stream is no longer available, but Politico reporter Blake Hounshell attributed the \"Salute\" crowd picture to that live feed when he shared it on Twitter:", "Here’s what the White House livestream is showing, which is presumably similar to why Trump will see. From this perspective, it looks crowded. pic.twitter.com/9oVOdS5S5a", "— Blake News (@blakehounshell) July 4, 2019", "One reason social media users may have been thought President Trump's picture was doctored was because other photographs taken earlier in the day showed a sparsely packed National Mall, likely because Washington experienced some inclement weather on the July 4th holiday:", "When it rains, it pours. #TrumpParade pic.twitter.com/PMpY2Z2mnX", "— Ksenija Pavlovic McAteer (@ksenijapavlovic) July 4, 2019", "The National Park Service has not released an official estimate of the crowd size at \"Salute to America.\" However, Trump's claim of a \"great crowd\" on the National Mall is supported by genuine photographs from the event.", "Zak, Dan.   \"Evening in America: What It Felt Like on Trump’s 4th of July.\"\r\n    The Washington Post.   5 July 2019.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]