["The claim was posted here on Instagram by an Australian-based user on December 1, 2020.", "The post reads: “I was an embalmer for 18 years. The most common cancer contracted by embalmers is leukemia due to formaldehyde exposure. Children are now injected with dozens more vaccines than we received as children and one of their ingredients is formaldehyde (used as a vaccine preservative). The number one childhood cancer is leukemia.”", "Formaldehyde is an organic compound that is used in a litany of household products and found in trace amounts in vaccines as preservatives.", "A similar claim has also been shared by several Facebook users worldwide, including here, here and here.", "The claim circulated online as dozens of companies, from biotech start-ups to Big Pharma, were racing to develop a safe and effective coronavirus vaccine, as AFP reported here.", "The claim, however, is false.", "In response to the misleading social media posts, a spokesperson for the Australian Cancer Council (CC) told AFP there is “no evidence” of a connection between childhood leukemia and formaldehyde found in vaccines.", "“Some immunisation programs help prevent cancer by reducing the prevalence of infections that can be precursors to cancer,” the spokesperson said in an email on December 3.", "Dr Seong Lin Khaw, a senior research officer at the Walter and Elizabeth Hall Research Institute, said the level of formaldehyde present in some vaccines is safe for humans.", "“The trace level of formaldehyde present in some vaccines is far lower than natural levels of formaldehyde produced physiologically as part of normal metabolism or present in foods such as fruits,\" Dr Lin Khaw said in a December 10 email.", "“In the same way exposure to sunlight is safe to a certain level and associated with increased skin cancer risk at the point when it causes sunburn, the cancer risk associated with formaldehyde correlates with the level of exposure. The level of exposure via vaccines is well below the safe threshold, being within physiological levels, unlike the much higher levels associated with long-term occupational exposure.\"", "The University of Oxford’s Vaccine Knowledge Project website also states: “The amount of natural formaldehyde in a two-month-old infant’s blood (around 1.1 milligrams in total) is 10 times greater than the amount found in any vaccine (less than 0.1 milligrams).”", "Embalming risk", "Studies have found “embalmers and medical professionals that use formaldehyde have an increased risk of leukemia”, the American Cancer Society states here.", "However, Dr Natasha Crowcroft, Director of the Centre for Vaccine Preventable Diseases at the University of Toronto told AFP that the dosages found in vaccines and embalming are not comparable. “To embalm a body you need something like 6-10 liter of formaldehyde – it’s nothing at all like the tiny amounts in vaccines,” she said in an email in May 2020.", "The risk factors for children who develop leukemia are largely unknown, said Kathryn Huntley, general manager of the Leukaemia Foundation. “However, two types of leukaemia commonly occur in children, Acute Lymphoblastic Leukaemia (ALL) and Acute Myeloid Leukaemia (AML), and we also know that some children may be at increased risk of developing leukaemia, such as children who have a congenital disorder or a pre-existing blood disorder, or who have a sibling who has been diagnosed with leukaemia,” she said.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]