["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Former president Barack Obama at a climate change summit on Dec. 5, 2017 in Chicago, Illinois. (AP)", "Throughout Barack Obama’s presidency, critics questioned his Christian beliefs. The suspicion among some conservative Facebook groups has continued a year and a half after his exit from the White House.", "One group, called Yes I’m Right, shared a link to an article titled \"Shocking Video Emerges of Obama Mocking God and the Bible.\" Hundreds of users reacted and shared the link, which led to a Conservative Post write-up and video.", "Facebook flagged this story as part of its efforts to combat false news and misinformation on Facebook’s News Feed. (Read more about our partnership with Facebook.)", "We looked at the video. It has been around since 2006 and is clipped from a larger 40-minute speech about separating religious beliefs from policymaking.", "The Conservative Post article is just a few sentences long, accusing Obama of an \"open universalist attitude toward faith\" and say that his faith is \"100% phony.\"", "According to his biographies, Obama became a practicing Christian in early adulthood when he began working with religious community groups in Chicago. According to reports during his time in office, he prayed daily and would regularly consult with pastors for spiritual guidance.", "In the attached 3-and-a-half minute video, Obama does not denigrate Christianity. He is shown arguing for political compromise across religions. \"We are no longer a Christian nation, or at least not just,\" he says, \"We are also a Jewish nation, a Muslim nation, and a Buddhist nation, and a Hindu nation, and a nation of non-believers.\"", "Because of this, Obama argues, making political policy based solely on religious beliefs is unsustainable. He gives the example of a Christian who objects to abortion on religious grounds: Though they may feel strongly that is wrong because of their religion, he says, they cannot use the Bible as their evidence.", "Obama also notes that, if the government was led by religion, many books of the Bible would not be applicable for making policy. As the audience laughs, he says that Leviticus, which condones slavery but forbids shellfish, or Deuteronomy, which allows for the stoning of wayward children, would not be suitable for modern laws.", "This might be interpreted as disrespect or mocking by some viewers. However, the video is cut from a much larger speech: Obama’s keynote at the \"Building a Covenant for a New America\" conference in 2006. The conference was sponsored by Sojourners, a progressive Christian magazine.", "In Obama’s 40-minute address, he urges Democrats to embrace religion, rather than shy away from it or decry it. Even if religious arguments are not sufficient for making policy, the moral lessons that religions teach can be essential for guiding decisions and reaching out to others.", "So when viewed as a whole, the point of the speech is not to mock Christianity.", "Here’s where things get interesting: the video wasn’t edited together by conservative groups seeking to discredit Obama’s religious views. It was edited and posted originally by an online spiritual group in favor of Obama.", "Founded in the mid 1990s, Yoism is an \"open-source religion\" in which participants can continually propose new tenets and beliefs. The group votes on the proposals, and then adds them to the Book of Yo. Though the book has not been updated since 2004, it appears the website remained active and politically vocal throughout the Obama presidency, frequently defending his policies.", "The Yoism site attached the video underneath a Doonesbury cartoon about Christmas decorations and short article praising Obama for his commitment to the separation of church and state.", "Using the same video that was shared by Conservative Post, the Yoans applauded Obama’s Christian values.", "Obama gave a speech in 2006 that encouraged Christians to take a compromising approach to their religious values when creating policy. He spoke extensively about his own experience as a Christian and encouraged the crowd of Democrats to use their religion to guide them on moral issues.", "He does emphasize the extremity of many of the Bible stories, perhaps in a way that some Christians would feel is disrespectful. However, the few snippets of Obama’s longer speech do not accurately reflect his views on Christianity overall, and it is an overstatement to say that he is mocking God.", "We rate this claim False.", "PolitiFact, \"Obama sworn in on his Bible,\" December 20, 2007.", "Politifact, \"Obama attended an Indonesian public school,\" December 20, 2007.", "New York Times, \"Obama's 2006 Speech on Faith and Politics,\" June 28, 2006.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]