["Gov. Chris Christie identified three ingredients for brewing corruption in state government: districts drawn to favor incumbents, no term limits and entitlement that grows with time.\n\nThose are some of the reasons why the Republican governor favors capping the time members of the New Jersey Assembly and Senate can serve, he said Wednesday at a town hall meeting in Piscataway.\n\nWithout such restraints, corruption may run as rampant in Trenton as Christie claims it was while he was the U.S. Attorney for New Jersey.\n\n\"I think that we should do it for a few reasons, corruption is certainly one of them. As you know when I was U.S. Attorney we wound up putting 10 percent of the state Legislature in jail during my seven years,\" Christie said, eliciting a round of applause from the audience.\n\nLater, he said, \"I think the longer people are there the more entitled they become. The more entitled they feel.\"\n\nNew Jersey can’t shake its connection with corrupt officials, a link that has been well established over time. But did Christie really put away 10 percent of the state Legislature?\n\nBy Christie’s count, his office won more than 130 convictions or guilty pleas from both Republicans and Democrats. Many of those came from local officials.\n\nChristie nabbed a handful of state senators and assemblymen while he was U.S. Attorney, from 2002 to the end of 2008. But 10 percent of the state Legislature is an overreach.\n\nIn total, 120 legislators comprise the state Legislature, with 40 in the Senate and 80 in the Assembly. During Christie’s nearly seven years as U.S. Attorney, PolitiFact New Jersey found more than 185 people who served in either chamber.\n\nChristie’s office charged five legislators -- all Democrats -- while they were in office: state Sens. Wayne Bryant, Joseph Coniglio and Sharpe James and Assemblymen Mims Hackett and Alfred Steele. All five served jail time.  \n\nThat’s less than 3 percent of all the people who served.\n\nThe federal investigation of two other state legislators who were jailed, Republican Assemblyman Daniel Van Pelt and Democratic Assemblyman Joseph Vas, began while Christie was U.S. Attorney. However, they were not charged until after Christie left the U.S. Attorney’s Office.\n\nDemocrat John Lynch, a former state Senate president, was charged and jailed while Christie was U.S. Attorney. But Lynch was no longer in office when he was charged.\n\nEven if those individuals are included, the fact remains that Christie didn’t jail 10 percent of the state Legislature during his time as U.S. Attorney.\n\n\"Really?\" Christie spokesman Michael Drewniak said in an e-mail.  \"Every other person in the audience understood the Governor was making a rhetorical point about his extensive record in combating political corruption as U.S. Attorney and not, as you seem to be suggesting, citing, with great exactitude, some baseball statistic.\"\n\n\"The Governor was emphasizing, conversationally, the gravity of the corruption which in those years reached into the highest levels of the legislature as well as high-ranking party bosses and operatives, and former legislators across this state – an extensive and politically powerful rogues gallery.  Honestly, if you were actually in attendance at the town hall, heard his tone and inflection when he made this remark -- and were around in those years in New Jersey -- you would know that,\" Drewniak said.\n\nStill, the governor can make a point about his record on corruption without saying he put 10 percent of the state Legislature in jail. That’s just not true.\n\nOur ruling\n\nChristie said when he was U.S. Attorney \"we wound up putting 10 percent of the state Legislature in jail during my seven years.\"\n\nAs the state’s chief federal law enforcement officer, the governor charged scores of public officials with corruption.\n\nFive of those officials were sitting state legislators at the time they were charged. All five were later jailed. That’s not a trivial figure, but it’s not 10 percent of the state Legislature.\n\nWe rate this claim False.\n\nTo comment on this ruling, go to NJ.com.", "Audio recording of Gov. Chris Christie town hall meeting, June 6, 2012\n\nE-mail interview with Michael Drewniak, spokesman for Gov. Chris Christie, June 7, 2012\n\nGov. Chris Christie, Biography, accessed June 6, 2012\n\nRecord, CHRISTIE'S ALL-OUT WAR; Corruption is on the run in New Jersey, Sept. 23, 2007, accessed via Nexis on June 6, 2012\n\nThe Associated Press via NJ.com, Former state Sen. Joseph Coniglio is freed from prison, March 25, 2011\n\nThe Star-Ledger, As Chris Christie considers presidential run, past contests provide clues into governor's thinking, Oct. 3, 2011\n\nFitzgerald’s Legislative Manual: State of New Jersey, 2008, pgs. 200-204\n\nFitzgerald’s Legislative Manual: State of New Jersey, 2006, pgs. 200-204\n\nFitzgerald’s Legislative Manual: State of New Jersey, 2004, pgs. 193-197\n\nFitzgerald’s Legislative Manual: State of New Jersey, 2002, pgs. 191-195\n\nThe Star-Ledger, Braun: Former N.J. Assembly Speaker Joseph Doria survives the 'slings and arrows', Oct. 19, 2011\n\nThe Star-Ledger, Christie proved himself a man of convictions: In fighting corruption, he defied his critics' expectations, Nov. 23, 2008, accessed via Nexis on June 6, 2012\n\nThe Star-Ledger, Bryant latest N.J. politician headed to courtroom, Sept. 7, 2008, accessed via Nexis on June 6, 2012\n\nThe New York Times, Assemblyman Pleads Guilty To Misusing Campaign Money, Nov. 20, 2004\n\nThe Star-Ledger, Orange's Hackett heeds Democrats' call to resign after bribery arrest, Sept. 8, 2007, accessed via Nexis on June 6, 2012\n\nThe Star-Ledger, James pleads not guilty to graft charges, July 24, 2007, accessed via Nexis on June 6, 2012\n\nThe Star-Ledger, Dirty Rotten Scoundrels: Why Jersey Keeps Churning Out Corrupt Politicians, Nov. 1, 2009, accessed via Nexis on June 6, 2012\n\nThe Star-Ledger, Van Pelt convicted of bribery, extortion: Ex-Ocean official faces 30 years, May 20, 2010, accessed via Nexis on June 6, 2012\n\nThe U.S. Attorney’s Office: New Jersey, Former assemblyman and perth amboy, new jersey mayor joseph vas and aide melvin ramos sentenced to prison for mail and federal election fraud, April 12, 2011\n\nThe U.S. Attorney’s Office: New Jersey, Assemblyman and Former Perth Amboy Mayor Joseph Vas Indicted for His Participation in Corrupt Schemes, May 20, 2009\n\nThe Star-Ledger, Authorities probe legacy of ex-mayor: City employees interviewed as Vas defends actions of his administration, Oct. 24, 2008, accessed via Nexis on June 6, 2012\n\nThe Star-Ledger, Ex-senator and Democratic Party kingpin admits taking kickbacks, Sept. 16, 2006\n\nThe Associated Press via NJ.com, Ex-N.J. Assemblyman Van Pelt begins 41-month prison sentence for $10K bribe conviction, Jan. 6, 2011\n\nThe Star-Ledger, Former Assemblyman Joseph Vas is sentenced to 6 1/2 years in prison, April 12, 2011", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]