["Drug-resistant malaria could be a concern for Africa, an online report said, due to its outsized toll on children.", "In an article on a new drug-resistant strain of malaria, a Nigerian website says the disease kills more children under the age of five than any other age group.", "This is supported by the world malaria report, which says 67% of all malaria deaths in 2019 were kids under the age of five. In 2000, it was 84%.", "The underdeveloped immune system in young children is one reason for this high toll. Malaria is the third leading cause of death among under-fives, after pneumonia and diarrhoea.", "The discovery in Africa of a drug-resistant strain of the parasite that causes malaria is a new threat, as the region continues to battle Covid-19.", "This is according to a January 2020 article on the Nigeria-based website NPOReports.", "“Now that resistant parasites have been documented in Rwanda, they may be carried by travelers across borders or may already be in other African countries,” the article reads.", "While malaria deaths fell from 2010 to 2019, “more than 90%” were in sub-Saharan Africa.", "A drug to take on the new strain is reportedly in clinical trial, and would treat “children as young as six months, as malaria kills more children under five than any other age group”, the article says.", "Is this statistic accurate?", "NPOReports attributes its article to Scientific American, a US publication that covers advances in research and scientific discoveries.", "In 2020 scientists in Rwanda reported on a new strain of the parasite that causes malaria. It was resistant to artemisinin, a major drug used to fight the disease in Africa.", "To check malaria’s toll on children, Dr Audu Mohammed, the national coordinator of Nigeria’s national malaria elimination programme, recommended that we look at the 2020 world malaria report.", "This shows that 409,000 people died from malaria in 2019, with nine in 10 deaths in Africa.", "Mohammed told Africa Check that the death of children younger than five from other diseases could be wrongly attributed to malaria.", "“A lot of times once a child has a fever, it is attributed to malaria, whereas it could be as a result of a different disease,” he said. “Also, malaria death often occurs with other complications. For example, a child that has malaria could eventually die of anaemia. Loss of appetite, which is a symptom of malaria, could result in malnutrition in a child. So it can be complicated sometimes.”", "But potential reporting errors were considered in the estimates published by the world malaria report, Mohammed said.", "Of the deaths in 2019, two thirds or 67% were children younger than five. This means that of every 10 people who died from malaria that year, roughly seven were children in this age group. This share has been even higher, reaching 84% in 2000.", "The claim is therefore accurate.", "But why the high toll in children of this age group? “People develop immunity to malaria over time. The older a person gets the more prepared his or her immune system is to resist the parasite that causes malaria,” Mohammed told Africa Check.", "“And so children under five are more likely to die of malaria because their immunity against disease such as malaria is still too weak.”", "The report shows that, globally, malaria is the third leading cause of death among under-five children, accounting for 5%. Pneumonia leads, at 12%, followed by diarrhoea.", "A snapshot of malaria in Nigeria", "Nigeria, Africa’s most populous country, accounted for 23% of malaria deaths – the highest in the world.", "The claim about under-five children was also true of the country, Alice Nte, a professor of paediatrics at the University of Port-Harcourt in southern Nigeria, told Africa Check.", "“Though due to interventions malaria deaths among under five children has reduced over the years, it is still the number one cause of death among this age group in Nigeria,” she said.", "Nte was part of the technical committee for the 2019 Verbal and Social Autopsy Study that researched the causes of neonatal and child mortality in Nigeria.", "The study found that malaria was the single largest cause of death among children under five in Nigeria, followed by diarrhoea and pneumonia.", "Nte said they found that insecticide-treated bed nets were not as widely distributed as they should be, given malaria was endemic in Nigeria. “And we noticed that in many cases the bed nets were abused or not used regularly.”", "Adegoke Falade, a professor of paediatrics at the college of medicine at the University of Ibadan in southwest Nigeria, said it was also about the odds.", "“Though malaria is easy to diagnose, for instance with the use of rapid diagnostic testing, the fact that mosquitoes are in abundance across the country means that many under-fives are exposed to the risk of coming down with malaria at some point.”", "An article on a Nigerian website claims that malaria kills more children under five than any other age group.", "The 2020 world malaria report says that children younger than five accounted for 67% of the total malaria deaths in 2019. In 2000, this share was 84%.", "Experts said the available data supported the claim. They highlighted underdeveloped immune systems and the endemic nature of malaria as some reasons for the high malaria toll on under-fives.", "Photo: Sia KAMBOU / AFP", "Please complete this form to receive the HTML sharing code.", "We examine three claims in a Cape Talk interview with the National Sea Rescue Institute on world drowning prevention day.", "Covid has trained a spotlight on causes of death and how deaths are recorded across the world. We disentangle what paperwork has to be filed...", "In a widely listened-to podcast, the BBC made the startling claim that more than a million Africans die each year on the continent’s roads. ...", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "For democracy to function, public figures need to be held to account for what they say. The claims they make need to be checked, openly and impartially. Africa Check is an independent, non-partisan organisation which assesses claims made in the public arena using journalistic skills and evidence drawn from the latest online tools, readers, public sources and experts, sorting fact from fiction and publishing the results.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "© 2023 - Africa Check - All rights reserved.", "We will never charge you for verified, reliable information. Help us keep it that way by supporting our work.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "Support independent fact-checking in Africa."]