["About this rating", "Hopkins did make the comment in an interview in 2015.", "The comments were not made in 2017, when the story was being shared on disreputable web sites; Hopkins is considered a right-wing commentator, not a \"liberal feminist\".", "On 29 August 2017, click bait web site WorldPoliticus.com, which regularly posts heavily sensationalized stories, reported that British media personality Katie Hopkins (who has made a name for herself by making outrageous comments) advocated for driving a van around with the purpose of euthanizing elderly people:", "Many people would gladly have Katie Hopkins removed from TV shows. The liberal British TV personality was part of The Apprentice, and made a shocking statement. Hopkins doesn’t really know how things work, and she better stop acting like an expert. The liberal supports the euthanasia of old people, and her excuse is the lamest thing you will ever hear.", "According to Hopkins, old people are nothing but a burden to society, and euthanasia is the only solution to her problem. She even suggested that communities should have “euthanasia vans” that would roll across the country and collect elderly people. Yes, this is the most disgusting thing I’ve ever heard.", "Hopkins, a tabloid columnist, did make the comments — but she did so two years ago, in an interview published on 6 August 2015 by the British program \"Radio Times\". On the topic of elderly people and dementia, Hopkins had the following exchange with interviewer Michael Buerk:", "We’d been getting on terribly well, I thought. She’s smart, funny; attractive, too, in a beaky sort of way. She’d been rattling on, saying out loud the kind of things the rest of us feel guilty even thinking. She giggled a lot. I did a fair bit of sniggering myself, looking around furtively to make sure nobody was noticing. Then I made the mistake of asking the obvious question about her latest television venture, If Katie Hopkins Ruled the World… I couldn’t not ask her: well, OK, what would she do if she did?", "“Right,” she said, saucer blue eyes looking me up and down, evidently seeing a problem to be solved. “We just have far too many old people.” Did I know that one in three NHS beds was being blocked by the elderly and demented? A third of our hospitals filled up by people who don’t even know they’re there? She’d soon put a stop to that. “It’s ridiculous to be living in a country where we can put dogs to sleep but not people.” Her solution? “Easy. Euthanasia vans – just like ice-cream vans – that would come to your home.” After they’d finished in the hospitals, presumably. “It would all be perfectly charming. They might even have a nice little tune they’d play. I mean this genuinely. I’m super-keen on euthanasia vans. We need to accept that just because medical advances mean we can live longer, it’s not necessarily the right thing to do.”", "I stuttered something about not being entirely with her on this. “Not with me on that? Is it because you’re old?” I told you she was smart. Smart enough to be making a fair old living being rude about people, quite often to their faces. It’s a strange career for a conformist convent schoolgirl, whose first ambition was to join the Diplomatic Corps.", "Other than the perennial need for outrage-driven clicks, it's unclear why the 2015 comments have been resurrected in 2017, but as of 5 September 2017, the story had been posted on several junk sites with no citation to the original interview. Hopkins is generally considered a right-wing commentator, per RationalWiki. Although it's unclear what her true personally held views are, Hopkins has made a name for herself by \"punching down\":", "Katie Hopkins is a writer-broadcaster, former British reality TV contestant and singularity of awfulness. She is known for her right-wing views expressed on television, newspapers, and on Twitter. She has been rude about migrants, Scots, Muslims, people with dementia, the lower classes, and many other individuals and groups. In fairness, it's unclear how much of her output is designed to wind up the idiots who'll complain about anything, how much is genuine hatred for those more needy than herself and how much is both.", "Hopkins now writes columns for a British tabloid, where she regularly rails against immigrants; Hopkins made headlines in mid-2017 when she was dragged by the rest of the UK press for traveling to Sicily and taking selfies with \"Defend Europe\", a group of white supremacists who chartered a boat in an unsuccessful attempt to hamper non-governmental organizations like Doctors Without Borders from rescuing stranded migrants in danger of drowning in the Mediterranean Sea.", "Moore, Rachel. \"Liberal Feminist Wants to See Elderly People and Dementia Patients Euthanized.\"\r\n  WorldPoliticus.com. 29 August 2017.", "Delgado, Kasia. \"When Michael Buerk Met Katie Hopkins.\"\r\n  Radio Times. 6 August 2015.", "RationalWiki. \"Katie Hopkins.\"", "Hopkins, Katie. \"The Swedish Town Where Migrant Gangs Have Killed Multiculturalism Stone Dead and Laugh at Laws They Despise and Defy.\"\r\n  The Daily Mail. 2 March 2017.", "Gray, Jasmin. \"Katie Hopkins Tells the Cambridge Union She’s a ‘True Version of a Feminist.'\"\r\n  Huffington Post UK. 5 February 2017.", "Oppenheim, Maya. \"Katie Hopkins Branded 'PR Machine for Extremists' After Meeting Group Aiming to Hamper Refugee Rescues in Med.\"\r\n  The Independent. 24 July 2017.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]