["About this rating", "Creating and circulating glurge (sometimes true, sometimes fabricated) is one of our cathartic ways of dealing with tragedy.  For example:", "Music to My Ears", "At the prodding of my friends, I am writing this story. My name is Mildred Hondorf. I am a former elementary school music teacher from DeMoines, Iowa.", "I've always supplemented my income by teaching piano lessons — something I've done for over 30 years. Over the years I found that children have many levels of musical ability. I've never had the pleasure of having a protégé though I have taught some talented students.", "However I've also had my share of what I call \"musically challenged\" pupils. One such student was Robby. Robby was 11 years old when his mother (a single mom) dropped him off for his first piano lesson. I prefer that students (especially boys!) begin at an earlier age, which I explained to Robby. But Robby said that it had always been his mother's dream to hear him play the piano. So I took him as a student.", "Well, Robby began with his piano lessons and from the beginning I thought it was a hopeless endeavor. As much as Robby tried, he lacked the sense of tone and basic rhythm needed to excel. But he dutifully reviewed his scales and some elementary pieces that I require all my students to learn.", "Over the months he tried and tried while I listened and cringed and tried to encourage him. At the end of each weekly lesson he'd always say, \"My mom's going to hear me play some day.\" But it seemed hopeless.", "He just did not have any inborn ability. I only knew his mother from a distance as she dropped Robby off or waited in her aged car to pick him up. She always waved and smiled but never stopped in. Then one day Robby stopped coming to our lessons.", "I thought about calling him but assumed, because of his lack of ability, that he had decided to pursue something else. I also was glad that he stopped coming. He was a bad advertisement for my teaching!", "Several weeks later I mailed to the student's homes a flyer on the upcoming recital. To my surprise Robby (who received a flyer) asked me if he could be in the recital. I told him that the recital was for current pupils and because he had dropped out he really did not qualify. He said that his mom had been sick and unable to take him to piano lessons but he was still practicing.", "\"Miss Hondorf ... I've just got to play!\" he insisted. I don't know what led me to allow him to play in the recital. Maybe it was his persistence or maybe it was something inside of me saying that it would be alright.", "The night for the recital came. The high school gymnasium was packed with parents, friends and relatives. I put Robby up last in the program before I was to come up and thank all the students and play a finishing piece. I thought that any damage he would do would come at the end of the program and I could always salvage his poor performance through my \"curtain closer.\"", "Well the recital went off without a hitch. The students had been practicing and it showed. Then Robby came up on stage. His clothes were wrinkled and his hair looked like he'd run an egg-beater through it. \"Why didn't he dress up like the other students?\" I thought. \"Why didn't his mother at least make him comb his hair for this special night?\"", "Robby pulled out the piano bench and he began. I was surprised when he announced that he had chosen Mozart's Concerto #21 in C Major. I was not prepared for what I heard next. His fingers were light on the keys, they even danced nimbly on the ivories.", "He went from pianissimo to fortissimo; from allegro to virtuoso. His suspended chords that Mozart demands were magnificent! Never had I heard Mozart played so well by people his age. After six and a half minutes he ended in a grand crescendo and everyone was on their feet in wild applause.", "Overcome and in tears I ran up on stage and put my arms around Robby in joy. \"I've never heard you play like that Robby! How'd you do it?\" Through the microphone Robby explained:", "\"Well, Miss Hondorf ... remember I told you my mom was sick? Well actually she had cancer and passed away this morning. And well ... she was born deaf so tonight was the first time she ever heard me play. I wanted to make it special.\"", "There wasn't a dry eye in the house that evening. As the people from Social Services led Robby from the stage to be placed into foster care, I noticed that even their eyes were red and puffy and I thought to myself how much richer my life had been for taking Robby as my pupil.", "No, I've never had a protégé but that night I became a protégé ... of Robby's. He was the teacher and I was the pupil. For it was he that taught me the meaning of perseverance and love and believing in yourself and maybe even taking a chance on someone and you don't know why.", "This is especially meaningful to me since after serving in Desert Storm Robby was killed in the senseless bombing of the Alfred P. Murrah Federal Building in Oklahoma City in April of 1995, where he was reportedly ... playing the piano.", "The 1995 bombing that destroyed the Alfred P. Murrah Federal Building in Oklahoma City and killed 168 people was a tragedy with which America struggled to try to come to grips, especially in the wake of the 2001 execution of the man responsible for it, Timothy McVeigh.", "In this case it appears someone has simply dusted off and refurbished an old glurge to suit the circumstances. We don't yet know the original source for the piece reproduced below (it is often prefaced as being a story told by Bob Richards, the former pole-vault champion), but it's been circulating on the Internet since at least 1998, and in lyric form it was a sappy 1975 hit for David Geddes (infamous for the teenage gun tragedy song \"Run Joey Run\") under the title \"The Last Game of the Season (A Blind Man in the Bleachers)\":", "THE LAST GAME OF THE SEASON\n(A BLIND MAN IN THE BLEACHERS)\nDavid Geddes", "He's just the blind man in the bleachers\nTo the local home town fans\nAnd he sits beneath the speakers\nWay back in the stands\nAnd he listens to the play by play\nHe's just waiting for one name\nHe wants to hear his son get in the game", "But the boy's not just a hero\nHe's strictly second team\nThough he runs each night for touchdowns\nIn his father's sweetest dreams\nHe's gonna be a star some day\nThough you might never tell\nBut the blind man in the bleachers knows he will", "And the last game of the season is a Friday night at home\nAnd no one knows the reason but the blind man didn't come\nAnd his boy looks kinda nervous\nSometimes turns around and stares\nJust as though he sees the old man sittin' there", "The local boys are tryin' but they slowly lose their will\nAnother player's down and now\nHe's carried from the field\nAt halftime in the locker room\nThe kid goes off alone\nAnd no one sees him talkin' on the phone", "The game's already started\nWhen he gets back to the team\nAnd half the crowd can hear his coach yell\n\"Where the hell you been?\"\n\"Just gettin' ready for the second half,\"\nIs all he'll say\n\"Cause now you're gonna let me in to play.\"", "Without another word, he turns and runs into the game\nAnd through the silence on the field\nLoudspeakers call his name\nIt'll make the local papers\nHow the team came from behind\nWhen they saw him playin' his heart to win", "And when the game was over\nThe coach asked him to tell\nWhat was it he was thinkin' of\nThat made him play so well\n\"You knew my dad was blind,\" he said\n\"Tonight he passed away\"\n\"It's the first time that my father's seen me play\"", "Notice the similarities between the following (also anonymous) piece and the \"Mildred Hondorf\" version quoted above: Both involve boys with single parents, both boys are not very good at the recreation they've chosen to pursue yet work hard at it, neither parent can appreciate his or her boy's efforts due to a handicap (blindness or deafness), and both boys beg for a chance to perform in public over their teachers' objections so that their recently-deceased parents can experience their sons' artistry and skill \"for the first time\":", "Father's Eyes", "A teenager lived alone with his father, and the two of them had a very special relationship. Even though the son was always on the bench, his Father was always in the stands cheering. He never missed a game.", "This young boy was still the smallest of his class when he entered high school. But his father continued to encourage him but also made it very clear that he did not have to play football if he didn't want to. But the young man loved football and decided to hang in there. He was determined to try his best at every practice, and perhaps he'd get to play when he became a senior.", "All through high school he never missed a practice nor a game, but remained a bench warmer all four years. His faithful father was always in the stands, always with words of encouragement for him. When the young man went to college, he decided to try out for the football team as a \"walk-on.\" Everyone was sure he could never make the cut, but he did. The coach admitted that he kept him on the roster because he always puts his heart and soul into every practice and, at the same time, provided the other members with the spirit and hustle they badly needed.", "The news that he had survived the cut thrilled him so much that he rushed to the nearest phone and called his father. His father shared his excitement and was sent season tickets for all the college games. This persistent young athlete never missed practice during his four years at college, but he never got to play in the game.", "It was the end of his senior football season, and as he trotted onto the practice field shortly before the big playoff game, the coach met him with a telegram. The young man read the telegram and became deathly silent. Swallowing hard, he mumbled to the coach, \"My father died this morning. Will it be all right if I miss practice today?\" The coach put his arm gently around his shoulder and said, \"Take the rest of the week off, son. And don't even plan to come to the game on Saturday.\"", "Saturday arrived, and the game was not going well. In the third quarter, when the team was ten points behind, a silent young man quietly slipped into the empty locker room and put on his football gear. As he ran onto the sidelines, the coach and his players were astounded to see their faithful teammate.", "\"Coach, please let me play. I've just got to play today,\" said the young man.", "The coach pretended not to hear him. There was no way he wanted his worst player in this close playoff game. But the young man persisted, and finally, feeling sorry for the kid, the coach gave in. \"All right,\" he said. \"You can go in.\" Before long, the coach, the players and everyone in the stands could not believe their eyes. This little unknown, who had never played before was doing everything right.", "The opposing team could not stop him. He ran, he passed, blocked and tackled like a star. His team began to triumph. The score was soon tied.", "In the closing seconds of the game, the kid intercepted a pass and ran all the way for the winning touchdown. The fans broke loose. His teammates hoisted him onto their shoulders. Such cheering you've never heard!", "Finally, after the stands had emptied and the team had showered and left the locker room, the coach noticed that the young man was sitting quietly in the corner all alone. The coach came to him and said,", "\"Kid, I can't believe it. You were fantastic! Tell me what got into you? How did you do it?\"", "He looked at the coach, with tears in his eyes, and said. \"Well, you knew my dad died, but did you know that my dad was blind?\" The young man swallowed hard and forced a smile, \"Dad came to all my games, but today was the first time he could see me play, and I wanted to show him I could do it!\"", "It's the same story, just told in a different way. For yet another version, see Michael Aun's \"The Coach Lou Little Story.\" In it, another aspiring football player spending his time as a benchwarmer (this time a tackle at Georgetown University rather than a fellow playing an unspecified position on a high school team) gets pulled aside by the coach four days before the championship game and told that a telegram has come that announces the death of the young man's father. On the day of the big game, the lad gets the coach to agree to put him in for one play. The young man performs extremely well on that one play, prompting the coach to leave him in, with said decision amply rewarded by continued stellar performances by the bereaved boy. However, a different spin is placed on the yarn in this recounting via one small change in the story: the coach always knew the boy's father was blind, therefore the tale's usual ending (which calls upon that being a revelation) gives way to a new ending and a new moral: \"It does make a difference when those unseen eyes are watching.\"", "We don't know why Mildred Hondorf can't spell \"Des Moines,\" why a music teacher would use the word \"virtuoso\" as if it were a tempo, or why someone would be playing the piano in a federal building, but we do know that Robby's piano teacher should indeed have been \"surprised when he announced he had chosen Mozart's Concerto #21 in C Major\" for his recital piece: It's one of the most technically demanding of all Mozart's concerti, it's a half-hour long, and it requires an orchestral accompaniment — yet young Robby, the diffident piano student, so well mastered this challenging piece in only several weeks' time (without the benefit of a teacher) that he was able to perform it at a recital, sans orchestra, in a mere six and a half minutes. Quite a prodigy, that Robby.", "No Desert Storm veteran named Robbie (or Robby, Bob, Bobby, Robert, or any other form of the name) was killed in the Oklahoma City bombing, says the Communications Director for the Oklahoma City National Memorial and Museum, who has often been asked about this particular urban legend. Also, in her discussions with the family members of the adult victims, none of them has ever identified their loved one as \"Robby.\"", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]