["This Facebook post has been shared at least 107 times since it was published on January 31, 2020.", "The post’s caption reads: “Good News! Wuhan's CORONA VIRUS can be cured By one bowl of freshly boiled GARLIC water.", "\"Old chinese doctor has proven its efficacy. Many patients has also proven this to be effective . 8 cloves of chopped GARLICs and add 7cups of water then bring to boil.", "\"Eat and drink the boiled GARLIC water, overnight improvement and healing. Glad to share this? ctto", "\"Please like or Follow this page for MORE HELPFULL post? Thank u!?.”", "The post also carries a text image that reads: “Tracking the Wuhan Coronavirus. Everything you need to read about the deadly pandemic; what it is. How it’s spreading, and how to stop it.”", "Below is a screenshot of the misleading post:", "The novel coronavirus has killed at least 490 and infected more than 24,000 people in China since its outbreak in Wuhan in early December 2019, AFP reported on February 5, 2020.", "Posts with a similar claim were also published on Facebook here, here, here and here; on YouTube here, here, here, here, here and here; and on Twitter here, here, here, here and here.", "The claim is false.", "“There is no scientific evidence to substantiate the claim that garlic boiled water cures the novel coronavirus nor is there any proper medical research available on the subject,” Dr. Wasim Khawaja of the Pakistani Institute of Medical Sciences told AFP by phone on February 4, 2020.", "“Such claims on social media that this vegetable or that herb cures the novel coronavirus are misleading and they may be harmful for people as they indulge in these homemade remedies and do not visit a hospital for testing and this may lead to the spread of the virus if anyone is actually infected by it,” he warned.", "Khawaja urged all people with flu symptoms to get tested at a medical facility.", "The World Health Organisation (WHO) and the US Centers for Disease Control and Prevention (CDC) have said they do not recommend any such cure or remedy to treat the novel coronavirus.", "The WHO specifically stated here that measures like drinking traditional herbal teas are not effective and can even be harmful. The CDC also noted here that there is “no specific antiviral treatment recommended” for the coronavirus infection.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]