["A photo of an article reporting that the US Centers for Disease Control and Prevention (CDC) “admits there is no Covid-19” has been shared in multiple Facebook posts. The report cites an agency document which explains how a virus test works as its source. The claim is false: a US pathology expert said the CDC document was misinterpreted, stating that “there is no question” Covid-19 exists.", "The photo of the article was posted on Facebook here on October 22, 2020.", "The article was published in “The Light”, a self-proclaimed “truthpaper” published monthly in the UK. Digital versions of the article can be seen here and on the writer’s personal website here.", "The piece is headlined: “CDC admits there is no Covid-19”", "The article cites page 39 of this CDC document published in July 2020 which details a set of instructions for a diagnostic test used to identify SARS-CoV-2, the virus that causes Covid-19.", "The article claims that “no one has isolated the Covid-19 virus” and “therefore, no one has proved that it exists,” because of a passage in the CDC document that reads: “Since no quantified virus isolates of the 2019-nCoV are currently available, assays designed for detection of the 2019-nCoV RNA were tested with characterized stocks of in vitro transcribed full length RNA.”", "The Facebook user that published the image captioned the post: “Do you believe it now or do you need to see it on TV first?”", "The image of the article also appears on Facebook here, here, here, here, here, here, here, here, here, here and on Instagram here.", "The article’s claim, however, is false.", "Heba Mostafa, an assistant professor of pathology at Johns Hopkins Medicine, told AFP that the CDC document cited in the inaccurate article describes how the test was first developed -- not the “initial virus isolation from patients or the confirmation of the existence of SARS-CoV-2.\"", "“There is no question that SARS-CoV-2 exists and it was isolated in China early in January and was fully characterized and its full genome was deposited to the databases on January 10th,” Mostafa said in an email on November 4, 2020.", "The CDC developed the viral test in early-2020, and on February 4, 2020 the US Food and Drug Administration issued an emergency authorisation for use of the test. The approval came two weeks after the US confirmed its first case of Covid-19 on January 21, 2020.", "“At that time, the US didn’t have an actual virus available to develop diagnostics because we didn’t have cases diagnosed in the US yet (of course because of the lack of the available diagnostics). So to characterize and develop assays, controls were developed by using the available sequence of the whole genome to develop synthesized transcripts, just for the sake of assay development and evaluation,” Mostafa explained.", "“Shortly after we started diagnosis in the US, we started to isolate the virus and develop stocks to use as controls. Thousands of cases are diagnosed daily and many labs have a lot of isolates that match or very close to the initial Chinese isolate.”", "John Hopkins, a leading institution tracking Covid-19 in the US, and the CDC have recorded over 9.9 million confirmed cases of the virus in the US as of November 10, 2020.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]