["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Joe Biden is sworn in as the 46th president of the United States by Chief Justice John Roberts as Jill Biden holds the Bible during the 59th Presidential Inauguration at the U.S. Capitol in Washington, Jan. 20, 2021. (AP)", "President Joe Biden has used a family Bible dating to 1893 throughout his career in public office. There is no credible evidence that it’s related to a secret society.", "President Joe Biden’s family Bible is the latest fodder for Illuminati conspiracy theorists.", "On Jan. 21, a Facebook user posted a photo of Biden’s hand on the Bible. First lady Jill Biden is pictured in the lower right-hand corner.", "\"Sooo has anyone else realized this yet or???? Masonic/Illuminati Bible that Biden swore on yesterday,\" the photo’s caption says.", "The post has more than 16,000 shares. It was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "(Screenshot from Facebook)", "The term \"Illuminati,\" translated from Latin to mean \"revealed\" or \"enlightened,\" refers to a secret society called the Bavarian Illuminati that sought to infiltrate powerful institutions, such as monarchies, to promote Enlightenment ideals. \"Masonic\" refers to freemasonry, the practices of the world’s oldest and largest fraternal organization. The Bavarian Illuminati infiltrated Masonic lodges before dissolving in the 18th century.", "The Bible that Biden was sworn in on is not related to either organization, which have been the subjects of numerous conspiracy theories. Other fact-checkers have debunked similar claims.", "Biden has used this hefty Bible, featuring a Celtic cross, throughout his career in public office. He told Stephen Colbert in December that it’s been a family heirloom since 1893.", "\"Every important date is in there,\" he said. \"For example, every time I’ve been sworn in for anything, the date has been on that and is inscribed in the Bible.\"", "The book is pictured in photos from when Biden was first sworn in as a senator in 1973. He also used it when he was inaugurated as vice president.", "(AP)", "As evidence that the Bible is linked to the Illuminati, the Facebook post includes two screenshots.", "The first screenshot shows a listing for a Haydock Douay-Rheims Bible, a 19th century translation with commentary from Christian scholar George Leo Haydock, on a third-party auction house website. The second screenshot shows text from a website that claims the Haydock Douay-Rheims book contains information about how the Illuminati \"changed the name of God the Son of the Catholic Trinity\" — a \"Masonic trick\" that the website calls \"the Da Vinci Code.\"", "Biden’s family Bible is indeed a Haydock Douay-Rheims edition, which was common among English-speaking Catholics in the U.S. until the 1940s. But claims about this edition of the Bible being linked to Illuminati are related to a long line of conspiracy theories about the Illuminati, which only operated for a decade in the 1700s and sought to replace Christianity with a \"religion of reason.\"", "\"Beginning in 1792, several conspiracy authors began to combine the Masons, the Illuminati, the Templars, and the Jews in varying combinations to create a worldwide conspiracy of universal control,\" wrote Christopher Hodapp and Alice Von Kannon in \"Conspiracy Theories and Secret Societies For Dummies.\"", "\"The Da Vinci Code\" is a book about an elaborate conspiracy to suppress information that Jesus possibly had a child with Mary Magdalene. It is a work of historical fiction that has been discredited by churches, clergy members and Bible scholars.", "We could find no credible evidence that Biden’s Bible is linked to the Illuminati. While many former presidents were Freemasons, we did not find evidence that Biden is a member of the fraternity.", "The Facebook post is inaccurate and ridiculous. We rate it Pants on Fire!", "RELATED: Kamala Harris was sworn in on a stack of Bibles — not a clutch purse", "CBS, \"Inside the secret world of the Freemasons,\" Dec. 8, 2013", "Christopher Hodapp and Alice Von Kannon, \"Conspiracy Theories and Secret Societies For Dummies\"", "Dan Brown, \"The Da Vinci Code\"", "Encyclopædia Britannica, Freemasonry", "Encyclopædia Britannica, Illuminati", "Facebook post, Jan. 21, 2021", "History.com, \"Five Secret Societies That Have Remained Shrouded in Mystery,\" Dec. 12, 2019", "Lead Stories, \"Fact Check: Joe Biden Did NOT Swear His Oath On The Masonic Illuminati Bible - Personal Bible Has Been In His Family For Hundreds Of Years,\" Jan. 22, 2021", "Minnesota Freemasons, \"Presidents of the United States Who Were Freemasons\"", "The New York Times, \"Defenders of Christianity Rebut 'The Da Vinci Code,’\" April 27, 2004", "The New York Times, \"Joe Biden’s Family Bible Has a Long History,\" Jan. 20, 2021", "Vox, \"9 questions about the Illuminati you were too afraid to ask,\" Jan. 19, 2016", "The Week, \"Why Biden's bible is so big,\" Jan. 20, 2021", "YouTube video from \"The Late Show with Stephen Colbert,\" Dec. 18, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]