["About this rating", "Under federal law it is illegal for a marijuana user to buy or possess a firearm, even if that user lives in a state which has legalized marijuana use.", "It is not the case that states have been legalizing cannabis use and subsequently legislating to bar cannabis users from owning guns. Rather, a pre-existing and unchanging federal prohibition on controlled substances, including marijuana, prohibits the possession or purchase of firearms by anyone who uses those controlled substances, including marijuana.", "Several states legalized either recreational or medical marijuana use in 2018, including Vermont, Michigan, Utah, and Missouri. Those measures brought to 10 the number of states where cannabis use has been made legal for recreational purposes (along with the District of Columbia), and 33 states now have full medicinal marijuana programs, according to the National Conference of State Legislatures.", "In January 2019, however, one viral social media meme sounded the alarm over the wave of cannabis liberalization seen in the United States in recent years, suggesting that those laws were being used a \"backdoor\" to stricter gun control:", "Before you celebrate legalization of marijuana, just know: Nearly every state that has legalized it has also legislated that you lose your right to own a gun if you are prescribed it, or buy it recreationally. Pot legalization is turning out to be a back-door way for the government to get you to voluntarily give up your gun rights. Word to the wise...", "It is true that individuals who buy or possess marijuana, even for medical purposes, and even in states where it is legal, could be prevented from legally buying or owning firearms. However, the circumstance is the result of a longstanding federal ban on marijuana, one which long predates state-by-state efforts to liberalize marijuana laws rather than being part of a conspiracy to use looser drug laws as a \"backdoor\" for firearm confiscation.", "It is not the case most states that have legalized marijuana use have subsequently \"legislated that you lose your right to own a gun\" if you buy cannabis or have a prescription for it. Rather, would-be gun-buyers are required, on penalty of felony prosecution, to disclose their marijuana use in forms they must submit to licensed gun sellers.", "Even if that drug use is legal in the state in question, licensed gun sellers are legally prohibited from selling firearms to a would-be buyer who also admits to using cannabis.", "Three pieces of federal law govern these issues.", "First, under the Controlled Substances Act of 1970, marijuana and tetrahydrocannabinol (THC, the psychoactive component in cannabis) are Schedule I controlled substances, which means that federal law regards them as having a \"high potential for abuse\" and \"no currently accepted medical use.\"  As a result, federal law prohibits the cultivation, sale, possession, purchase and use of such plants and products, regardless of what the laws of various states have to say on the matter.", "(In December 2018, President Donald Trump signed the Agriculture Improvement Act, which made it legal for license holders to grow and sell the cannabis plant hemp, but only when it has a THC content of 0.3 percent or less -- that is, only for use as food or in the making of textiles, clothing, and so on.)", "Second, federal law also dictates that it is illegal for anyone who uses any controlled substance (including marijuana and THC) to buy or possess a firearm. Title 18, Section 922 of the United States Code states:", "\"(g) It shall be unlawful for any person...(3) who is an unlawful user of or addicted to any controlled substance (as defined in section 102 of the Controlled Substances Act)...to ship or transport in interstate or foreign commerce, or possess in or affecting commerce, any firearm or ammunition; or to receive any firearm or ammunition which has been shipped or transported in interstate or foreign commerce.\"", "Third, the same federal law also makes it illegal to sell or give a gun to anyone known or suspected to be a cannabis user. Title 18, Section 922 of the U.S. Code states:", "\"(d) It shall be unlawful for any person to sell or otherwise dispose of any firearm or ammunition to any person knowing or having reasonable cause to believe that such person...(3) is an unlawful user of or addicted to any controlled substance (as defined in section 102 of the Controlled Substances Act) ...\"", "Title 18 Section 922 also sets out legal requirements designed to enforce the ban on drug users possessing or buying guns, requiring licensed firearms dealers to perform background checks on would-be purchasers, and requiring would-be purchasers to submit a sworn statement of their legal eligibility to buy firearms.", "The federal Bureau of Alcohol, Tobacco, Firearms and Explosives (ATF) has implemented the latter requirement as Form 4473, the \"Firearms Transaction Record.\" As part of that federally mandated process, anyone attempting buy a gun from a licensed seller must truthfully answer a series of Yes/No questions, including:", "\"11.e. Are you an unlawful user of, or addicted to, marijuana or any depressant, stimulant, narcotic drug, or any other controlled substance?\"", "The form includes two pieces of guidance about that question, making its potential legal ramifications clear. First, the question about drug use is accompanied by a disclaimer: \"Warning: The use or possession of marijuana remains unlawful under Federal law regardless of whether it has been legalized or decriminalized for medicinal or recreational purposes in the state where you reside.\"", "Second, the applicant is required to affirm in writing: \"I understand that a person who answers 'yes' to any of the questions 11.b. through 11.i. ... is prohibited from purchasing or receiving a firearm.\"", "A marijuana user could, in theory, answer \"No\" to question 11.e., but that respondent would be violating federal law by doing so, as Form 4473 warns: \"I also understand that making any false oral or written statement, or exhibiting any false or misrepresented identification with respect to this transaction, is a crime punishable as a felony under Federal law, and may also violate State and/or local law.\"", "In 2011, the ATF issued guidelines for licensed firearms dealers, clarifying that they were forbidden by law from selling a gun to anyone who used marijuana, even if such use was legal in their state. Furthermore, the ATF& guidelines instructed licensed sellers that they could not sell to anyone with a medicinal marijuana card, even if that person answered \"No\" to question 11.e., and regardless of whether the would-be buyer was actually a marijuana user or had yet been prescribed marijuana for medicinal purposes.", "\"... If you are aware that the potential transferee is in possession of a card authorizing the possession and use of marijuana under State law, then you have 'reasonable cause to believe' that the person is an unlawful user of a controlled substance. As such, you may not transfer firearms or ammunition to the person, even if the person answered 'no' to question 11.e. on ATF Form 4473.\"", "In 2012, a Nevada woman named S. Rowan Wilson challenged those guidelines in federal court after a licensed gun dealer in the town of Moundhouse refused to sell her a gun when she left question 11.e. blank on her Form 4473 due to her possession of a medicinal marijuana card.", "The case made its way to the U.S. Court of Appeals for the Ninth Circuit, which in 2016 definitively ruled in favor of a U.S. District Court that had dismissed Wilson's challenge, thereby upholding the federal ban on selling firearms even to medicinal marijuana users in states where medicinal marijuana use was legal.", "It's true that in recent years many states have legalized or decriminalized the use of marijuana for recreational or medicinal purposes. It's also true that federal law, supported by administrative orders and court rulings, prohibits marijuana users from owning, possessing, or buying firearms, and prohibits anyone from selling or giving firearms to a person they know or suspect to be a drug user or even the owner of a medicinal marijuana card.", "However, these two sets of facts came about separately. It is not the case that states have been legalizing cannabis use and subsequently legislating to bar cannabis users from owning guns as part of a \"backdoor\" plot to crack down on firearms possession, as a January 2019 meme claimed.", "Rather, individual states have been legalizing cannabis use against the background of a pre-existing and unchanging federal prohibition on controlled substances, including marijuana, and several federal laws which prohibit the possession or purchase of firearms by anyone who uses those controlled substances, including marijuana.", "Whitham, Clover.   \"Vermont's Legal Marijuana Era Dawns.\"\r\n    The Burlington Free Press.   1 July 2018.", "Gray, Kathleen.   \"Marijuana Will Be Legal in Michigan on Dec. 6: What to Know.\"\r\n    The Detroit Free Press.   26 November 2018.", "Hauser, Christine.   \"Marijuana Embraced in Michigan, Utah and Missouri, But Rejected in North Dakota.\"\r\n    The New York Times.   7 November 2018.", "The National Conference of State Legislatures.   \"Marijuana Overview.\"\r\n    14 December 2018.", "Legal Information Institute, Cornell Law School.   \"U.S. Code, Title 21, Chapter 13, Section 812 -- Schedules of Controlled Substances.\"\r\n    Accessed 22 January 2019.", "U.S. House of Representatives.   \"H.R. 2 -- Agriculture Improvement Act of 2018.\"\r\n    20 December 2018.", "Hudak, John.   \"The Farm Bill, Hemp Legalization and the Status of CBD: An Explainer.\"\r\n    The Brookings Institute.   14 December 2018.", "Legal Information Institute, Cornell Law School.   \"U.S. Code, Title 18, Chapter 44, Section 922 -- Unlawful Acts.\"\r\n    Accessed 22 January 2019.", "Herbert, Arthur.   \"Open Letter to All Federal Firearms Licensees.\"\r\n    Bureau of Alcohol Tobacco, Firearms, and Explosives.   21 September 2011.", "U.S. Court of Appeals for the Ninth Circuit.   \"Wilson vs. Lynch et al -- Opinion.\"\r\n    21 July 2016.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]