["By Angelo Fichera", "Posted on September 9, 2020", "A viral meme falsely claims to show President Donald Trump touching the face of a “veteran wounded so badly that he had no arms.” The man shown in the meme was born without arms and is not a veteran. Trump himself amplified the incorrect, debunked claim on Twitter.", "President Donald Trump can be seen in a viral image touching the face of a supporter with prosthetic arms — a moment that occurred during a campaign rally in early 2016.", "A purported story attached to that image, however, is incorrect.", "Radio personality Mark Simone, a Trump supporter, tweeted the photo on Sept. 4, claiming, “I remember when President Trump met a veteran wounded so badly that he had no arms. The President reached out and touched his face so he would feel the human contact.”", "That story is wrong — and while Simone has shared it since 2017, fact checkers at Snopes debunked it a year ago.", "Simone’s recent tweet was then retweeted by Trump, who thanked Simone, and has been turned into a meme condemning “the media” that has been widely viewed on Instagram accounts such as “republicansmovement” and “donaldtrump_2020.”", "The claim is being shared anew in the aftermath of a story in The Atlantic that quoted unnamed sources alleging that Trump made disparaging comments about wounded veterans and fallen soldiers. Other outlets have also reported corroborating parts of The Atlantic’s story, but Trump has denied the claims.", "Simone in a Facebook post, sharing the photo of Trump greeting the supporter, urged his followers not to “fall for the Atlantic Magazine hoax.”", "A reverse image search of the photo in question brought us to 2016 stories referring to a Trump campaign video about veterans that used the image.", "It was actually taken at a rally at Winthrop University in Rock Hill, South Carolina — and it shows Trump interacting with a supporter, Henry “Bubba” Stevenson Jr.", "The Chester News & Reporter published photos and an account of the meeting — during which Trump signed one of Stevenson’s prosthetic arms.", "Chester News & Reporter, Jan. 19, 2016: Stevenson said Trump came over to him after his speech, asked how he was doing and how he got injured. He told Trump that he was born without arms.", "Trump signed Stevenson’s arm, a sign and his hat.", "“It is my first tattoo on my arm,” Stevenson joked.", "Local news reports in 2014 had covered an online fundraising campaign by Stevenson’s family to collect donations in order to buy a bionic arm. He and his mother relayed then, too, that he was born in 1991 without arms.", "None of the stories reported on military service.", "We reached out to Stevenson, but didn’t hear back.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "Evon, Dan. “Did President Trump Touch the Face of a Veteran Who Lost Both Arms?” Snopes. 18 Sep 2019.", "Moody, Chris. “Trump video mistakes Soviet veterans for Americans.” CNN. 22 Jan 2016.", "“Remarks by President Trump in Press Briefing.” White House. 4 Sep 2020.", "Styles, Jasmine. “Blackstock Man Raising Money For Bionic Arm.” WLTX. 15 Jun 2014.", "Parsons, Nancy. “Not quite the $6 million man.” Chester News & Reporter. 3 Jun 2014.", "Parsons, Nancy. “A bionic arm with a billion dollar ‘tat.’” Chester News & Reporter. 19 Jan 2016.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]