["Against the backdrop of the violence in Haryana, a video is viral on social media platforms as well as WhatsApp where a handful of men can be seen beating up a man with stones and sticks in the middle of a road even as others stand around them a little distance away watching the assault.", "Several users have shared the video with a warning message that says, “If you don’t wake up on Mewat, then one day your end is also going to be like this.” User Gopal Goswami shared the video with the same message. (archive)", "मेवात पर नहीं जागे तो एक दिन तुम्हारा भी अंत ऐसा ही होने वाला है। pic.twitter.com/lFWvpWzeob", "— Gopal Goswami (@igopalgoswami) August 2, 2023", "The video was also shared on Twitter by a user named Narendra Singh on August 2 with a similar warning. (archive)", "यह देखो सेक्यूलर कीटाणुओं यही हाल होगा जब इनकी तादाद और संख्या बढ़ जाएगी इनको किसी सरकार सिस्टम प्रशासन कोर्ट वकील किसी की जरूरत नहीं होती है जो इनको करना है वह यह करते हैं इसलिए सोचो और समझो कि तुम्हारे लिए क्या है और तुम अपनी आने वाली पीढ़ी को क्या दे कर जाओगे pic.twitter.com/60nExCyXdD", "— N҈A҈R҈E҈N҈D҈R҈A҈ 𝙎𝙄𝙉𝙂𝙃 🚩 (@TheNarendra___) August 2, 2023", "Alt News has received several requests on its WhatsApp helpline to fact-check the video. Some of them asked if the incident was from Mewat.", "This slideshow requires JavaScript.", "The video was shared by several social media users in 2019 with the claim that it depicted the lynching of a Hindu man by members of the Muslim community.”मरने वाला हिन्दू और मारने वाला मुसलमान है… शायद इसलिए बुद्धिजीवियों की नजर में ये लिंचिंग नहीं है (The one who died is Hindu and the one who killed him is Muslim. Perhaps this is why intellectuals did not see this lynching.)” – tweeted Pushpendra Kulshrestha (@Nationalist_Om).", "क्या ये लिंचिंग नहीं है???", "मरने वाला हिन्दू और मारने वाला मुसलमान है…", "शायद इसलिए बुद्धिजीवियों की नजर में ये लिंचिंग नहीं है😡 pic.twitter.com/jGUlkPpbpA", "— Pushpendra Kulshrestha (@Nationalist_Om) June 25, 2019", "Kulshrestha has been found circulating several cases of misinformation recently – video of a man offering Namaz on Malaysian road was falsely portrayed to be from India; a photo of a young girl from a 2017 BBC footage on Rohingyas was shared with a false and communal claim.", "Several other users have shared the same video tweeted by Kulshrestha.", "मरने वाला हिन्दू और मारने वाला मुसलमान है.", "तो इसे बुद्धिजीवी गैंग, लिंचिंग नही कहेगी देखिए pic.twitter.com/6lGLUo0p2m", "— नैना 100%fb (@Bharati0162) June 25, 2019", "It was also circulated by many on Facebook.", "A keyword search led us to several reports about the incident. The video actually depicts a 2017 incident from Bangladesh. On April 1, 2017, assailants killed Abu Syed and seriously injured Md Ali. The two men were accused in the murder of Jubo League leader Monir Hossain Sarkar and were absconding. This incident occurred in Titas subdivision of Comilla district in Bangladesh and was also covered by local news website called Comilla-r-Kagoj (Comilla’s Newspaper).", "Another Bangladeshi news portal Jagonews24.com talks about the incident in a March 2018 article about political murders in Titas. The report says that Sarkar was shot dead on November 8, 2016, in Gouripur Bazar. Six months later, his supporters sought revenge for the murder and hacked to death Abu Syed and Md Ali.", "Alt News contacted Bangladeshi journalists from Comilla district who corroborated the events and confirmed that the video pertained to the lynching of Md Ali and Abu Syed. The attack was sparked by internal conflicts between different factions of Jubo League, the youth wing of the ruling Awami League. Monir Hussain Sarkar was the then Ziarkandi Union Parishad chairman under Titas Upazila and Upazila Jubo League secretary. Md Ali and Abu Syed, who were killed for his murder, were also Jubo League members.", "Alt News has debunked this video several times in the past when it was viral as Hindu killed by Muslims in West Bengal and Bihar. In May 2017, it was also viral as Kashmiri students killing a CRPF jawan. Recently, several videos from around the world – Sri Lanka. Malaysia, Guatemala – were shared on Indian social media with a false and communal narrative.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]