["About this rating", "In September 2018, a viral video spread on Facebook with a description reading “woman records sunflowers in her garden.” The video shows a woman who has placed two electrode stickers on the leaf of a sunflower plant, which in turn connect to her phone, and is overlaid with an ambient sounding but pleasant noise purported to be created by the plant:", "Despite the fact that the sounds were generated by computer software and that the electrodes did not record noise but rather electrical conductivity, dubious websites have taken the suggestion of plant sounds a step further and suggested that the audio signal represents some form of plant communication. A representative example of this line of thinking comes from the content mill “Good Times”:", "It might be hard to believe but plants not only respond to sound but they also produce their own sound. While it is easy to assume that plants like trees and flowers are the stoic living decorations in your garden, it turns out that they pretty much communicate with each other through their own voice.", "While they may not be able to produce sounds like humans and animals, plants use vibration and sound around them to communicate and to inform them about any imminent danger from nearby. In an impressive video, a woman shows how she records the sound of the sunflowers that she has been growing in her backyard and it sounds totally out of the world ...", "Apparently, this has been confirmed by a study done by The University of Western Australia in which researchers discovered clicking sounds coming from the roots of corn saplings.", "For this line of thinking to be in any way scientifically valid, three things would need to be true. First, the device used to generate the recording must actually be recording “noise” created by the plant. Second, the “noise” presented in the viral video needs to be tied to an actual “communication” mechanism found in the sunflower. Third, sunflowers (or plants in general) need to be capable of both generating and receiving auditory cues. The first statement is categorically false. The latter two statements delve into extremely theoretical and unverified areas of science.", "The woman in the video appears to be using a product known as the MIDI Sprout. Developed by musicians and artists interested in the intersection of technology and nature, the device uses software to take a messy electrical signal generated by the plant and translate it into audible, tuned noise played by computerized instruments:", "Paired with the MIDI Sprout App for iOS, the MIDI Sprout allows you to listen to your plants play harmonious sounds designed by our team of artists. … Each MIDI Sprout comes with two probes that are used to measure changes in electrical currents across the surface of a plant’s leaf. Our technology converts these fluctuations into note and control messages that can be read by synthesizers and computers to generate music and even video.", "The creators of the device make no scientific claims about what this process represents from a plant science standpoint, although they assert that they have noticed the sound changes correlate with a variety of physical or even emotional changes. “As artists more than scientists, we feel we can best serve in fostering understanding of plant consciousness through sharing this experience with people. We’ll leave the explaining to the scientists, or maybe you, if you’re so inspired!” their website states.", "In effect, their device records minute changes in electrical conductivity (since all organisms generate some level of electrical current) and transposes that signal into a command for a digital synthesizer. “Sound,” however, is defined as “acoustic energy in the form of an oscillatory concussive pressure wave transmitted through gases, liquids, and solids.” The “sounds” of this sunflower were produced by iOS software programmed specifically to make a nice harmony and were transmitted through the air by a speaker, not produced by the plant itself.", "Putting the electrodes on a human body would also produce melodious noise with a MIDI Sprout, as human bodies (like sunflowers) exhibit minute changes in electrical conductivity. To say that such a process records the communicative noises of a human would be just as absurd as saying the same of the “sunflower sounds.”", "Plants do communicate with each other, in ways science understands and also, at least likely, in ways it does not. For example, many plants release volatile organic chemicals when damage to their leaves occurs. That release can serve as a signal to other nearby plants to increase defensive mechanisms. Plants can also release signals meant to repel or attract various insects or other organisms, which could be considered a form of communication as well.", "Other research has suggested that similar to the synapses in an animal’s brain, electric (or action) potentials between cells could serve to transmit or even store information within an organism or between two different organisms -- something that could perhaps be picked up by a device measuring changes in electric conductivity. This science is in its infancy, however, and the connection to the sounds that would be produced by the MIDI Sprout are entirely theoretical.", "Although the noise in the video was not the amplification of the actual vibrational waves of a plant, some scientists have speculated about the possible role (actual) sound could play in the life of plants. Some research (and countless schoolroom experimentation) suggests that plants may respond in various ways to noise. Some research also demonstrates that plants do generate small amounts of ultrasonic sound themselves.", "The “Good Times” article suggests that “a study done by The University of Western Australia in which researchers discovered clicking sounds coming from the roots of corn saplings,” provides support for the notion that plants may communicate between each other with auditory signals. This suggestion is a bit of a stretch.", "The paper they refer to is an intentionally speculative paper meant to generate discussion and did not involve any new research. Instead, the authors cited an unpublished doctoral dissertation which they said “illustrates that the young roots of corn generate structured, spike-like, acoustic emissions.” What is the possible significance of those spikes? “To date, the production mechanisms and adaptive value of such acoustic emissions remain elusive,” the authors reported.", "Whether or not one wants to interpret the computer-generated translation of a plant’s electrical conductivity shifts into intentionally harmonic music as the communication of a plant is more of a philosophical question. From a factual standpoint, however, the noises “recorded” in the video were not sounds produced by that plant.", "Najihah, Aina.   \"Woman Records Unique Voice of Sunflower -- It Sounds Like Music from Other Dimension.\"\r\n    Good Times.   21 September 2018.", "midisprout.com.   \"Our Story.\"\r\n    Accessed 24 October 2018.", "Telewski, Frank W.   \"A Unified Hypothesis of Mechanoperception in Plants.\"\r\n    American Journal of Botany.   1 October 2006.", "Baldwin, I.T., and J.C. Schultz.   \"Rapid Changes in Tree Leaf Chemistry Induced by Damage: Evidence for Communication Between Plants.\"\r\n    Science.   July 1983.", "Matsui, Kenji, and Takao Koeduka.   \"Green Leaf Volatiles in Plant Signaling and Response.\"\r\n    Lipids in Plant and Algae Development.   30 March 2016.", "Baluska, F., et al.   \"Plant Synapses: Actin-Based Domains for Cell-to-Cell Communication.\"\r\n    Trends in Plant Science.   March 2005.", "Gagliano, Monica, et al.   \"Towards Understanding Plant Bioacoustics.\"\r\n    Trends in Plant Science.   June 2012.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]