["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "As a major hurricane heads toward the Carolinas, Democratic U.S. Sen. Jeff Merkley berated the Trump administration for diverting nearly $10 million from emergency funding to immigration enforcement.", "\"As #HurricaneFlorence bears down, I discovered today that the Trump Administration is taking money away from @FEMA so that they can pay to put more asylum seekers in detention centers. This is a scandal,\" Merkley of Oregon tweeted on Sept. 11. (FEMA is an acronym for the Federal Emergency Management Agency.)", "Merkley appeared on MSNBC’s The Rachel Maddow Show on Sept. 11 and said he obtained documents about the transfer due to his work in \"trying to stop the child separations.\"", "Merkley has been a vocal opponent of the government’s \"zero-tolerance\" immigration policy that led to the separation of more than 2,000 children from their parents as they entered the United States illegally or at ports of entries. Many of them came seeking asylum. Parents separated from their children were sent to U.S. Immigration and Customs Enforcement (ICE) detention centers, and their children were sent to the care of another federal agency.", "\"Just as hurricane season is starting, it generally starts June 1st, the administration is working hard to find funds for additional detention camps. … In fact, $10 million comes out of FEMA,\" Merkley told Maddow.", "Is Merkley right that the Trump administration transferred $10 million from FEMA to ICE? The transfer did happen. But the administration contends that appropriations limitations prevented the money from being used for hurricane response. One budget watchdog described the administration’s argument as \"disingenuous at best.\"", "Merkley’s claim stems from a fiscal year 2018 \"transfer and reprogramming notifications\" document from the the Department of Homeland Security, or DHS. That department oversees both FEMA and ICE.", "The document shows that more than $200 million went to ICE from other DHS agencies, and that the money would be used to pay for detention beds and for flights for deported immigrants.", "ICE got $9.8 million from FEMA’s Operations and Support account. (The transfer was less than 1 percent of that account’s budget).", "Some of the funds transferred had been labeled for \"Response and Recovery - Recovery\"; \"Mitigation\"; \"Response and Recovery - Response\"; and \"Preparedness and Protection.\"", "Due to the transfer, FEMA would curtail training, travel, public engagement sessions, IT security support and infrastructure maintenance, and investments related to a program to streamline grants’ management, the DHS document said.", "DHS press secretary Tyler Q. Houlton pushed back on Merkley’s assessment that the administration was using emergency money for immigration purposes.", "\"Under no circumstances was any disaster relief funding transferred from @fema to immigration enforcement efforts. This is a sorry attempt to push a false agenda at a time when the administration is focused on assisting millions on the East Coast facing a catastrophic disaster,\" Houlton tweeted on Sept. 11.", "Under no circumstances was any disaster relief funding transferred from @fema to immigration enforcement efforts. This is a sorry attempt to push a false agenda at a time when the administration is focused on assisting millions on the East Coast facing a catastrophic disaster.", "The transferred money \"is not coming out of the disaster relief fund, it has no impact on our efforts to be prepared for Hurricane Florence,\" FEMA’s administrator Brock Long told MSNBC’s Andrea Mitchell on Sept. 12.", "Merkley did not say in his tweet or MSNBC interview that the funds came from the disaster relief fund, he broadly said FEMA.", "Under law, a series of steps typically take place before the federal government taps into FEMA’s disaster relief fund. (Check out our story on how the United States funds disaster recovery.)", "The administration’s claim that the funds \"couldn’t be used for disaster-related activities is disingenuous at best,\" said Steve Ellis, executive vice president at Taxpayers for Common Sense.", "Ellis pointed to FEMA’s budget request for fiscal year 2019. That request described FEMA’s Mitigation program (some of its 2018 funds were transferred to ICE) as one whose efforts \"help create safer communities, enable people to recover more rapidly from disasters while relieving financial impacts.\"", "Under the Response and Recovery program (funds from here were also transferred to ICE), the mission of the Response unit is to \"conduct emergency operations to save lives and property by: positioning emergency equipment, personnel and supplies; evacuating survivors; providing food, water, shelter, and medical care to those in need; and restoring critical public services,\" the budget request said.", "Some transferred funds also came from \"Mission Support\" — which funds FEMA headquarters activities.", "Merkley said the Trump administration transferred $10 million from FEMA to ICE.", "DHS, which oversees FEMA and ICE, did transfer nearly $10 million from FEMA to ICE. The immigration agency got the funds to pay for detention beds and for the transportation of immigrants ordered deported.", "A transfer document shows that some of the FEMA money had been marked for response and recovery, mitigation, preparedness and protection. Officials argued that the money didn’t come from the disaster relief fund, but Merkley didn’t say it did, he only said it came from FEMA.", "We rate Merkley’s claim True.", "Twitter, @SenJeffMerkley tweet, Sept. 11, 2018", "Email interview, Sen. Jeff Merkley press office, Sept. 12, 2018", "Email interview, DHS press office, Sept. 12, 2018", "Email interview, Steve Ellis, executive vice president at Taxpayers for Common Sense, Sept. 12, 2018", "Department of Homeland Security, Federal Emergency Management Agency Budget Overview, FY 2019 Congressional Justification", "Department of Homeland Security FY 2018 Transfer and Reprogramming Notifications", "Fema.gov, The Grants Management Modernization Program, accessed Sept. 12, 2018", "Twitter, @dhsgov tweet, Sept. 11, 2018", "NBC, FEMA head defends $10 million transfer to ICE, accuses Democrat of 'playing politics', Sept. 12, 2018", "PolitiFact, How the U.S. funds disaster recovery, Sept. 14, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]