["“A Journalist asked a Syrian girl to smile for a click...and she smiled with all the pain in her eyes.” This poignant account of the context for a portrait of a young girl smiling at a camera with watery eyes was retweeted 2,400 times. Similar versions of the story shared on Facebook in English, French, Spanish and Portuguese led to more than 100,000 shares.", "Another version circulating on Facebook claims that the girl is Palestinian.", "However, neither of these stories is true.", "A Google reverse image search reveals a January 2019 post on Reddit using the photo, for which one online user cites Reuters as the source. A search of the news agency’s website finds a series of photos entitled “Exodus from Mosul” featuring the same photo.", "Another reverse image search on the Russian search engine Yandex leads to reports naming Ali Al-Fahdawi as the author of the image.", "AFP contacted Al-Fahdawi via Instagram, who confirmed that the photo was taken on March 16, 2017.", "“I was in the battle with the army on the front line, and this girl with her family was running away from the bombing and bombs, heading towards us, and her picture was crying. When she saw me, I smiled a little and (she) had a smile on her face and a sadness. It was the decisive moment to take the photo,” Al-Fahdawi told AFP.", "At that point, more than 150,000 people had fled the fighting in the west and surroundings of Mosul, a city in northern Iraq, following an offensive by the Iraqi forces to wrest the city from the Islamic State group. More than 98,000 people found refuge in camps established near Mosul.", "A Facebook page called “Women of Mosul,” also posted the photo, and corroborated Al-Fahdawi’s account of its context in the caption. “Mosul girl or Mona Lisa of Mosul is a photographic picture which was shot by the Iraqi war photographer Ali Fahdawi.”", "The post’s caption also provides more details on the story of the girl and her family’s journey, their escape from Islamic State group forces, walking 40 kilometers over two days in bad weather on muddy roads. “When the photographer pointed the camera towards her, her face displayed two mixed emotions of sadness and fear still imbued of IS and the bombing, and a smile to watch the first camera aimed toward her.\"", "Al-Fahdawi told AFP that he looked for the girl for three years after photographing her. On his Facebook page, he described on September 4, 2019, how he found her again after she returned to her house in Mosul, which had been partly demolished by shelling.", "According to a March 2019 study by the Syrian Observatory for Human Rights, more than 370,000 people died since the beginning of the war in Syria in 2011, and 13 million people have left their homes.", "According to the photo’s author Al-Fahdawi, the Syrian girl who smiled at the photographer is in fact Iraqi and was not asked to smile for the camera, although a conversation did take place between her and the photographer.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]