["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "The Daily Caller published this \"bombshell\" claim about Sen. Jeanne Shaheen the night before Election Day. But how convincing is it?", "By the time the sun came up on Election Day, a charge against Sen. Jeanne Shaheen -- the New Hampshire Democrat in a nip-and-tuck race for another term -- had begun making the rounds on social media.", "The Daily Caller, a web-based publication aligned with conservatives, ran a story headlined, \"BOMBSHELL MEMO: Jeanne Shaheen Conspired With White House Insider On IRS Targeting Scandal.\"", "The story was posted at 9:36 p.m. the night before the election. The story accuses Shaheen of being \"principally involved in a plot with Lois Lerner and President Barack Obama’s political appointee at the IRS to lead a program of harassment against conservative nonprofit groups during the 2012 election.\"", "The night before Election Day is an unusually late moment for a \"bombshell\" to emerge in a Senate contest. But readers asked PolitiFact to take a look, even if our analysis would be published well into Election Day. So we did.", "Early in the election cycle, New Hampshire Republican Party Chairwoman Jennifer Horn said that Shaheen \"got behind the idea of using the IRS to target American citizens for their political views.\"", "In our fact-check published Oct. 23, 2013, we concluded that what Shaheen actually \"got behind\" was the DISCLOSE Act, which requires nonprofit groups to share information about their campaign contributions. We determined that it was a stretch to suggest that Shaheen favored going after citizens \"for their political views,\" so we rated Horn’s statement Mostly False.", "Tuesday’s story is a little different because it accuses Shaheen of being part of  a \"plot\" of harassment against conservative groups.", "As evidence the story cited \"letters exclusively obtained by the Daily Caller.\"", "Those letters were the result of a Freedom of Information request that was fulfilled on Oct. 9, 2014, according to documents provided to PolitiFact New Hampshire.", "Of the nine pages of documents provided, five of them reprint letters from Shaheen and six other Democratic Senators to Douglas Shulman, Commissioner of the IRS, asking the IRS to investigate any nonprofits that are avoiding being taxed while they \"are focused on federal election activities.\" The remaining four pages are responses to that request.", "The IRS was noncommittal in its responses to making any changes.", "\"To ensure that section 501(c)(4) organizations meet the requirements for tax exemption under the Internal Revenue Code, the IRS has ongoing programs that review the activities of organizations seeking IRS recognition of tax exemption,\" wrote Steve T. Miller, Deputy Commissioner for Services and Enforcement in his response dated April 26, 2012.", "He later added, \"The IRS is aware of the public interest in this issue. These regulations have been effect since 1959. We will consider proposed changes in this area as we work with the IRS Office of Chief Counsel and the Treasury Department’s Office of Tax Policy.\"", "The letters themselves are not secretive. The first, dated Feb. 16, 2012, was signed by Sens. Chuck Schumer (D-N.Y.), Al Franken (D-Minn.), Jeff Merkley (D-Ore.), Jeanne Shaheen (D-N.H.), Tom Udall (D-N.M.), Michael Bennet (D-Colo.), and Sheldon Whitehouse (D-R.I.). It has been publicly available for more than a year; Shaheen’s signature comes on the third page.", "The second letter, signed by the same seven senators and dated March 9, 2012, was even the subject of a press release by Schumer.", "What the letters say", "The letter dated Feb. 16, 2012, asks the IRS to review its oversight of 501(c)(4) organizations that get involved in politics. (The name refers to a section of the tax code.)", "The Internal Revenue Code grants tax-exempt status for nonprofit organizations that promote \"social welfare.\" But Shaheen’s letter said some groups abuse tax-exempt privileges by calling themselves social welfare organizations while spending a majority of their money on influencing politics.", "The letter says the code specifies that social welfare \"does not include direct or indirect participation or intervention in political campaigns on behalf of or in opposition to any candidate for political office.\"", "The letter first came to prominence in 2013 after publication of a report from the Treasury Inspector General for Tax Administration that concluded that the IRS had improperly targeted conservative groups. Some Republicans cited the letter as evidence that Democrats were responsible for such actions.", "Meanwhile, the letter to the IRS commissioner dated March 9, 2012, did encourage the IRS to change the way it handles nonprofit organizations that spend money on politics, suggesting three changes, including that the organizations document the exact percentage of their money that goes toward social welfare.", "We don’t see how these letters support the linchpins of the claim -- that Shaheen was \"involved in a plot,\" that this plot involved Lerner and other Obama appointees, or that the issue concerned a \"program of harassment against conservative nonprofit groups.\"", "Webster’s Ninth New Collegiate Dictionary defines this type of \"plot\" as \"a secret plan for accomplishing a usually evil or unlawful end.\" The letters were not secret, and, while we won’t take a position on whether their effort was \"evil,\" they were clear that they wanted the IRS to adhere to the law, not break it.", "In addition, there is no mention of Lois Lerner -- the central figure in the controversy -- and no obvious connection to any Obama political appointee other than Schulman, who was actually appointed by President George W. Bush in 2008.", "As for a \"program of harassment against conservative nonprofit groups,\" the letters do not urge a partisan or ideological focus to the effort. They point to 501(c)(4) nonprofits generally, not conservative groups alone.", "The Daily Caller did not return our request for comment.", "Our ruling", "The Daily Caller charged that Shaheen \"was principally involved in a plot with Lois Lerner and President Barack Obama’s political appointee at the IRS to lead a program of harassment against conservative nonprofit groups during the 2012 election.\"", "Shaheen and six other Democratic Senators did send letters broadly connected to the issue of scrutinizing the activities of nonprofit groups. Their concern was that some groups abuse tax-exempt privileges by calling themselves social welfare organizations while spending a majority of their money on influencing politics.", "The Daily Caller article amps up the innuendo beyond the evidence. The letters weren’t secret, they didn’t cite Lerner or other Obama appointees, and they didn’t single out conservative groups. We rate the claim False.", "The Daily Caller, BOMBSHELL MEMO: Jeanne Shaheen Conspired With White House Insider On IRS Targeting Scandal, Nov. 3, 2014", "Letters between Sens. Jeanne Shaheen and six other Democratic Senators and the IRS, dated between Feb. 16, 2012 and April 25, 2012.", "PolitiFactNH, N.H. GOP chairwoman Horn says Jeanne Shaheen \"got behind the idea of using the IRS to target American citizens for their political views\", Oct. 16, 2013", "Breitbart.com, Report: Election-eve Bombshell Memo Embroils Jeanne Shaheen In IRS Targeting Scandal, Nov. 3, 2014", "Politico, Karl Rove: IRS did what Democrats wanted, May 15, 2013", "ABC News, IRS Guilty of 'Thuggish Abuse of Power,' McConnell Says, May 14, 2013", "New Hampshire Union Leader, \"Shaheen Under Fire for 2012 letter sent to the IRS,\" May 16, 2013", "Jim Rubens, campaign speech, Sept. 18, 2013", "Email interview with Jennifer Horn, NHGOP Chairman, Sept. 24, 2013", "Letter to former IRS Commissioner Douglas Shulman, Feb. 16, 2012", "Press release from U.S. Sen. Charles Schumer’s office, copy of letter to IRS Commissioner Douglas Shulman, March 12, 2012", "Report from Treasury Inspector General for Tax Administration, \"Inappropriate Criteria Were Used to Identify Tax-Exempt Applications for Review\" May 14, 2013", "Jeanne Shaheen, prepared speech on DISCLOSE Act for the U.S. Senate floor, July 17, 2012", "Jeanne Shaheen, Speech on DISCLOSE Act delivered on the U.S. Senate floor, July 17, 2012", "Jeanne Shaheen, Speech on DISCLOSE Act delivered on the U.S. Senate floor, Sept. 22, 2010:", "Jeanne Shaheen, Speech on DISCLOSE Act delivered on the U.S. Senate floor, May 23, 2012", "Speech on campaign finance reform delivered on the U.S. Senate floor, Sen. Jeanne Shaheen, Jan. 26, 2012", "Fox News, television interview with Karl Rove, May 14, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]