["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A laboratory technician prepares COVID-19 patient samples for semi-automatic testing at Northwell Health Labs, Wednesday, March 11, 2020 (AP photo/John Minchillo)", "A University of Wisconsin-Milwaukee Foundation employee is being tested for coronavirus after having contact with someone traveling to an affected country. But we don't yet know the test result.", "But Larson is jumping the gun to claim the pandemic “has officially reached Milwaukee County.”", "Larson later reissued the press release to refer to a \"potential coronavirus case.\"", "On the day coronavirus was officially declared a pandemic and the University of Wisconsin-Madison moved all classes online, state Sen. Chris Larson issued a news release responding to the \"first coronavirus case in Milwaukee County.\"", "Just one problem.", "The county has no confirmed cases.", "An employee at the University of Wisconsin-Milwaukee Foundation was tested for the disease Monday, March 9, 2020, after falling ill following contact with a person who traveled to a country with a Level 3 warning. The school released that information a day later, noting test results were expected at the end of the week.", "But Larson, D-Milwaukee, skipped the waiting-for-results part.", "He sent out a release March 11, 2020, announcing, \"The coronavirus has officially reached Milwaukee County.\" Larson is running for county executive, a role in which he would oversee — among many other things — many people and agencies with key roles combatting the virus.", "The Milwaukee Journal Sentinel reported officials with the Milwaukee County Jail, House of Correction, the county Behavior Health Division facility, the airport, and the zoo are among those on a weekly conference call discussing the local coronavirus response.", "While health officials around the country have said the virus is a great concern, they have also warned about overreaction and misinformation", "Live coronavirus updates: Milwaukee Journal Sentinel blog", "When asked about the wording of the news release, Larson campaign manager Sonja Chojnacki said it was a reference to \"the possible case that’s being reported on.\" She said she was not aware of any positive tests.", "Larson’s campaign sent out an amended news release referencing the \"potential coronavirus case at UWM\" after being questioned by the Journal Sentinel.", "A positive test is hardly a foregone conclusion. The Wisconsin Department of Health Services is no longer releasing data on the number of people tested, but it reported only two of the first 46 tests came back positive.", "At the time Larson’s original news release went out, Wisconsin had three confirmed coronavirus cases. Two of those — in Dane County and Pierce County — were reported in the days before Larson’s release. The state notes one of those has already recovered.", "Larson, a state senator running for Milwaukee County executive, sent out a news release calling for action because coronavirus had \"officially reached Milwaukee County.\"", "But that’s sloppy at best.", "To this point, no coronavirus cases have been confirmed in the county. Larson’s staff confirmed they were referencing a UWM Foundation employee who at that point had only been tested.", "The number of tests and cases are growing, so the situation in Milwaukee County will certainly change. But we rate statements based on what is known at the time they were made.", "And we rate Larson’s claim False.", "Chris Larson, news release, March 11, 2020", "Email exchange with Sonja Chojnacki, campaign manager for Chris Larson, March 11, 2020", "Milwaukee Journal Sentinel, UWM extends spring break after employee tested for coronavirus, plans to move classes online, March 10, 2020", "Milwaukee Journal Sentinel, Wisconsin announces third confirmed case of coronavirus, and second in Dane County, March 10, 2020", "Milwaukee Journal Sentinel, Health officials describe sweeping efforts to prepare for the arrival of coronavirus in Milwaukee, March 5, 2020", "Wisconsin Department of Health Services, Outbreaks in Wisconsin, updated March 10, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]