["About this rating", "The original \"Hocus Pocus\" movie was released by Walt Disney Pictures in 1993. Since that time, there have been quite a few rumors about the possibility of a sequel to the Halloween-themed film. However, none of the fake posters or other hoaxes panned out.", "However, on Dec. 11, 2020, Entertainment Tonight reported that a sequel had finally been announced on Dec. 10 during a Disney's Investor Day event. The announcement said that a sequel to the 1993 film \"Hocus Pocus\" would premiere on the Disney+ streaming video platform.", "It was also announced that Adam Shankman (\"Hairspray,\" \"Rock of Ages,\" \"A Walk to Remember\") would direct \"Hocus Pocus 2.\"", "\"Coming exclusively to @DisneyPlus is Hocus Pocus 2, the spooky sequel to the 1993 Halloween classic! @AdamMShankman is set to direct,\" Disney tweeted. No casting news has been confirmed at this time.", "ET had previously confirmed that Jen D’Angelo had been tapped to write the script. In October, Bette Midler revealed that she, along with Sarah Jessica Parker and Kathy Najimy, would reprise their roles for the sequel.", "\"They want to make a movie, they’ve asked us if we were interested and of course all of us said yes,\" Midler told Fox5 at the time. \"I’m game, I’m totally game.\"", "The Disney Wiki on Fandom.com laid out the plot to the first \"Hocus Pocus\" movie, calling the original a \"cult film\":", "It tells the story of a Halloween-hating teenager named Max Dennison, who inadvertently resurrects three witches from their temporary death and must risk his life to protect his sister, Dani, and defeat them with the help of a classmate crush, a friendly zombie, and an immortal black cat.", "The film was meant to be a made-for-TV Disney Channel Original Movie but producers felt it could stand as a major theatrical one. The film received mostly negative reviews from critics during its theatrical release but has since become a cult film.", "The \"Hocus Pocus\" sequel was set to land on Disney+ in the future, but a release date had not yet been announced at the time of this writing.", "Jordan Liles is a Senior Reporter who has been with Snopes since 2016.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]