["The one-minute 13-second video was published on Facebook here on November 5, 2020. It has been viewed 9,300 times.", "The post's caption reads: “The fate of U.S. postal ballots. I am sure Nicaragua and Senegal could do a better job at compromising the people’s trust in the electoral system. RIP USA.”", "A woman, who is filming the video, can be heard talking to the two men collecting the ballots.", "Part of the conversation is heard as follows:", "Woman: “I thought they collected them all; I just want to document.”\n\tOfficial: “No, we are still collecting”.\n\tWoman: “Wait, but how come they’ve already called the state?”\n\tOfficial: “Because these are mail-in ballots.”\n\tWoman: “Are there a tonne in there?”\n\tOfficial: “Yeah.”\n\tWoman: “Alright, are you collecting from a lot of places? Okay, I will just document.\"", "At the video's 47-second mark, one of the men can be heard saying he works for “LA County”, referring to Los Angeles County in the US state of California.", "The video has also been shared here, here, here and here on Facebook, and here, here, here and here on Twitter alongside an identical claim.", "The video was also tweeted by US President Donald Trump here on November 12, 2020 alongside a similar claim.", "The claim, however, is false.", "A reverse image on Google of keyframes extracted from the video found a slightly longer version of the clip published here on Twitter on November 4, 2020.", "In response to the video, the Los Angeles County Registrar-Recorder/County Clerk denied any foul play in a tweet here on November 4, 2020, saying the clip shows LA County staff collecting postal ballots for counting.", "“No missed collection. The Drop Boxes are closed and locked at 8PM on Election Night and then collected the following day. These are valid ballots that will be processed and counted during the post election canvass just as ballots received with a valid, timely post mark,” reads the tweet.", "A spokesperson for the Los Angeles County Registrar-Recorder/County Clerk’s office also identified the two men seen in the video as members of their staff. This report by NBC News published on November 6, 2020 includes the clarification.", "The office of the California Secretary of State, Alex Padilla, clarified on Twitter that the deadline for counting ballots was December 3, 2020.", "It states: “Votes are still being counted! California Elections officials have until December 3 to process all ballots received. CA election results will be finalized no later than December 11. View result updates here: http://ElectionResults.sos.ca.gov #VoteSafeCA #VoteCalifornia.”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]