["“Our Beloved PM Shri @narendramodi’s Mother is still travelling in Auto, While @RahulGandhi’s Mother is the World’s 4th Wealthiest Politician!” An old photograph of Prime Minister Modi’s mother, Hiraben Modi started circulating on social media after it was tweeted by Vijay Sampla, Minister of State for Social Justice & Empowerment. The image shows an old and frail Hiraben being supported to board an auto rickshaw. Soon after the picture was tweeted, reactions started to pour in. While some were dismayed that the Prime Minister’s aged mother being used for a photo-op, others insisted that the photograph was photo-shopped.", "Our Beloved PM Shri @narendramodi ‘s Mother is still travelling in Auto, While @RahulGandhi ‘s Mother is the World’s 4th Wealthiest Politician!#NarendraModi pic.twitter.com/HsLuTBYUaI", "— Vijay Sampla MoS (@vijay_sampla) May 4, 2018", "Twitter users are claiming that the photograph is photo-shopped on the basis of the hand supporting her right arm.", "The person to who the hand belongs is not visible and that led to speculation about the image being photo-shopped.", "Dear Mr Sampla you are tweeting a photoshopped pic of @PMOIndia mother. Unclear whether you are are doing it deliberately, just to score political brown points have fallen for a fake? https://t.co/coj7BkjYYY", "— Swati Chaturvedi (@bainjal) May 6, 2018", "Actually I was wrong. I apologise. Turns out this photo is not photoshopped. https://t.co/agZclf8Z2a", "— Faye DSouza (@fayedsouza) May 6, 2018", "Ummmm.. there is a hand holding the lady attached to some invisible person! Just saying.. Biggish #PhotoshopFail 🤣🤣🤣🤣🤣🤣 https://t.co/5rAF0i8oKs", "— Swara Bhasker (@ReallySwara) May 6, 2018", "National Herald even wrote a story on this issue titled “BJP minister Sampla tweets fake image of Prime Minister Modi’s mother“.", "Even though Vijay Sampla has tweeted the image now for reasons best known to him, it is not a recent image. The image in question is a photograph by Press Trust of India (PTI) of Hiraben arriving by an auto-rickshaw to cast her vote for Lok Sabha polls in Gandhinagar on 30th April 2014. When the image was originally published in April 2014 it was not subjected to so much scrutiny perhaps due to the sheer volume of news during the election time.", "So how do we confirm that the image is not photoshopped? Alt News looked at several images that were available of Hiraben Modi being assisted to cast her vote. Her arrival at the polling booth is well recorded with photographers present. There are several pictures available that confirm that she indeed went to cast her vote in an auto-rickshaw. Here are other pictures of her at the time.", "There is also a video that confirms that Hiraben Modi went to cast her vote and was assisted out of the auto-rickshaw by several people. The most likely explanation of the seemingly floating hand in the PTI photograph is the angle from which the photograph was taken.", "Perhaps,the heat of the Karnataka election made Vijay Sampla dig out this image of PM Modi’s mother to take a dig at Rahul Gandhi’s mother. Whatever may be his motivation, it has backfired with heavy criticism on social media for Prime Minister not affording better comfort for his mother. Whether this was a well-choreographed photo opportunity or not, there is no denying that nonagenarian Hiraben Modi went to cast her vote. The PTI image picked by Sampla is one of the many pictures available of the day. Hiraben had to be assisted by many people and with the number of hands helping her, the angle of the photograph may make it appear photo-shopped.", "Donate Now", "Follow @free_thinker", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]