["Nigeria’s Guardian newspaper claimed there had not been more than 15 female vice-chancellors in the country’s higher education history.", "In an article on the lack of female leaders in universities, Nigeria’s Guardian newspaper said there had not been more than 15 vice-chancellors in the country’s higher education history.", "From available data, media reports and other sources, Africa Check was able to come up with a list of more than 20 past and present vice-chancellors.", "But experts say gender discrimination at Nigerian universities remains a barrier to women’s progress – although this was slowly changing.", "The recent appointment of Prof Lilian Salami as the vice-chancellor of the University of Benin in Edo state was widely praised.", "Salami becomes the institution’s 10th head - and only its second female one. Its vice-chancellor from 1985 to 1991, Prof Grace Alele-Williams, was Nigeria’s first female vice-chancellor.", "In a November 2019 story, headlined “In search of female vice chancellors in Nigerian varsities”, national daily the Guardian criticised the lack of women in top positions at universities.", "Since the start of university education in Nigeria, the newspaper said, “the system cannot boast of producing up to 15 substantive female vice-chancellors, either from the public, faith-based or private institutions”.", "Nigeria’s oldest university, the University of Ibadan, was founded in 1948. Have 15 or fewer women been vice-chancellors since?", "The journalist who wrote the article told Africa Check they came to the number using online research and help from academics.", "They found 11 past and present female vice-chancellors, but as there could be more, the article had gone with “not up to 15”. The article itself listed nine serving and former vice chancellors.", "Oluwayemisi Obilade is professor of adult education and women studies at the Obafemi Awolowo University. She pointed Africa Check to the National Universities Commission (NUC) as a potential source of data to check the claim.", "But she warned: “Whatever the number of female vice-chancellors you find will be very small compared to the number of male vice-chancellors.”", "The NUC is the state agency that develops university education. Its Nigerian University System Statistical Digest 2018, published in April 2019, shows the country had 170 universities at the end of 2018.", "The federal government managed 43, 48 were run by state governments, and 79 were privately owned. The report said only 17% of the principal officers at these universities are female. The principal offices were given as pro-chancellor, vice-chancellor, registrar, bursar and librarian.", "The digest identified 11 female vice-chancellors, and two acting ones. (Note: For the full list, click here.)", "But from university websites, media reports and academic meetings, Africa Check found at least seven more women who have been vice-chancellors of Nigerian universities. One is Prof Ekanem Braide who served at both Cross River University of Technology, Calabar and the Federal University, Lafia. Another is Prof Charity Angya, the vice-chancellor of Benue State University from 2010 to 2015.", "You can find some more former female university heads on our list. Our search, which considered the names in the Guardian article, shows that over 20 women have been vice-chancellors in Nigeria – more than the minimum of 15 claimed by the newspaper.", "Prof Lai Olurode specialises in political sociology, development and gender studies at the University of Lagos. He told Africa Check he was surprised that there have even been that many female vice-chancellors in the history of university education in Nigeria.", "He said the barriers women faced in society were “formidable”. And it wasn’t just a Nigerian problem, he said.", "“It is difficult for women to rise to positions of authority in the Nigerian university system due to stereotypes and prejudices.” Olurode said he believed “marriage and motherhood” were “considered more important goals for the woman than advancement in career”.", "Obafemi Awolowo University’s Obilade, who has done much research on gender inequality in Nigerian higher education, said the deep-rooted  patriarchy in universities made it difficult for women to become principal officers. She spoke of her own experience.", "“Having been a vice-chancellor, I can tell you that there are very few women in leadership in Nigerian universities. The sociocultural environment subordinates women,” she told Africa Check.", "This was in both subtle and obvious ways, such as pregnancy being used against women or some roles being considered “too tough” for a woman.", "The obstacles continued in professional development, Obilade said. “Mentoring is key in academia, but a female lecturer is less likely to get mentoring because a man mentoring a woman is often frowned at. The female lecturer in Nigeria is gender disadvantaged in many ways.”", "Both Olurode and Obilade said things were changing, but slowly.", "In an article on the low number of female leaders at universities, Nigeria’s Guardian newspaper said there had not been more than 15 female vice chancellors in the country’s higher education history.", "Available data and research shows there have been more than 20. The paper’s claim is inaccurate.", "But experts said the obstacles women faced at universities were considerable – although this was changing slowly.", "CORRECTION (06/12/2019): We updated the article to accurately reflect the gender of Prof Lai Olurode of the University of Lagos. The error is regretted.", "Further reading:", "https://africacheck.org/reports/coca-cola-is-right-50-of-young-women-in-northern-nigeria-have-no-formal-education/", "Please complete this form to receive the HTML sharing code.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "For democracy to function, public figures need to be held to account for what they say. The claims they make need to be checked, openly and impartially. Africa Check is an independent, non-partisan organisation which assesses claims made in the public arena using journalistic skills and evidence drawn from the latest online tools, readers, public sources and experts, sorting fact from fiction and publishing the results.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "© 2023 - Africa Check - All rights reserved.", "We will never charge you for verified, reliable information. Help us keep it that way by supporting our work.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "Support independent fact-checking in Africa."]