["Antifa has become a bogeyman in the demonstrations since George Floyd died after a police officer pressed his knee into Floyd’s neck on May 25. We’ve already debunked claims that an \"antifa murderer\" kicked and stomped someone during a demonstration in Portland and that antifa warned they were \"moving out of the cities and into residential areas to ‘take what’s ours.’\"", "A June 14 Facebook post offers something new to worry about: \"Antifa now banging on residents’ doors in Seattle, demanding food & supplies. If they don’t get it, the house gets vandalized.\"", "But we found no evidence to support that statement.", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Antifa describes a loose network of far-left anti-fascist groups that rally against white supremacy and other causes. It’s a movement that goes back decades and its supporters have at times used violence.", "We reached out to the Seattle Police Department about the Facebook post and did not hear back. But several neighborhood groups we contacted about the claim responded, and no one could corroborate it.", "Gina Hicks, president of Sustainable Capitol Hill, which describes itself as a network of neighbors, businesses and community groups trying to make the neighborhood sustainable, told PolitiFact there have been no such disturbances in the area. The neighborhood is the site of the Capital Hill Occupied Protest.", "\"Wow, that’s quite a claim!\" said Tom Heuser, president of the Capitol Hill Historical Society. \"I am not aware of any reports like this and I live in an apartment building that is one block north of the northern border of the zone.\"", "\"Ridiculous,\" said Gordon Padelford, executive director of Seattle Neighborhood Greenways. \"Haven’t heard anything like that in Seattle.\"", "Phillip Tavel, vice president of the Morgan Junction Association, told us he thought he could \"safely say that antifa is not going door to door in Seattle threatening to vandalize houses that don’t provide food and supplies.\" He said it hasn’t happened in West Seattle, where the neighborhood association is located, nor has anyone he spoken to in other neighborhoods reported that kind of intimidation by antifa supporters.", "\"Considering the network I have across the city, I would have heard if something like that was actually widespread,\" he added.", "Representatives of four other neighborhood groups in northeast Seattle echoed these sentiments.", "According to news reports, some Seattle residents are certainly frustrated living near the Capitol Hill Organized Protest and have \"expressed concerns about their safety and security in an area that demonstrators want to be police-free,\" KING 5 News reported. But we didn’t find any media coverage that lent credence to the Facebook post.", "We rate it False.", "Facebook post, June 14, 2020", "Email interview with Gina Hicks, president, Sustainable Capitol Hill, June 18, 2020", "Email interview with Tom Heuser, president, Capitol Hill Society, June 18, 2020", "Email interview with Gordon Padelford, executive director, June 16, 2020", "Email interview with Phillip Tavel, vice president, Morgan Junction Association, June 16, 2020", "Email interview with Gabrielle Gerhard, June 16, 2020", "Email interview with Ann Forrest, president, Victory Heights Community Council, June 16, 2020", "Email interview with Diana Kincaid, June 16, 2020", "Email interview with Nancy Bolin, June 16, 2020", "Email interview with Pam Xander, June 16, 2020", "KING 5, Frustrated residents near Seattle’s ‘CHOP’ zone want their neighborhood back, June 17, 2020", "PolitiFact, Trump wants to designate antifa as a terrorist organization but lacks legal authority for it, June 1, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]