["About this rating", "In May 2016, a message reporting that actor Mr. T (the stage name of Laurence Tureaud), best known for his portrayal of B.A. Baracus on the 1980s television series The A-Team, had passed away was widely circulated on Facebook:", "Wow.. I was shocked...\nR. I. P. Mr. T You were an inspiration to everyone. Show respect and share to let people know. Like if you liked Mr. T ??", "However, no news outlets have reported on the action star's alleged passing, and reports of his death are belied by the fact that Mr. T is still active on his social media accounts and recently made an appearance at a Fairfield Hotel event.", "Fake Facebook obituaries for non-dead celebrities are an example of \"like farming,\" a popular social media scheme aimed at getting more likes, shares, and comments:", "Facebook's algorithms in particular emphasize popular content, and therefore gathering \"likes\" and \"shares\" receives a high premium. Sometimes, it's just an annoyance — maybe that kid really does want a hundred thousand \"likes\" so that a Victoria's Secret model will go to a school dance with him, so he's inundating people with appeals (although that's doubtful at best) — but more often, the intent is scammy. Like-farmers will gather clicks, which denote popularity, then scrub the original content and replace it with something else (usually a scammy ad of some sort) to bypass Facebook constraints. Facebook has moved to quash this behavior by adjusting their algorithms, but of course, some scammers' efforts always get by the online gatekeepers.", "Although Mr. T did not pass away in May 2016, one factor that may have contributed to the spread of this death hoax is that the actor celebrated his 64th birthday on 21 May 2016.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]