["Participation in the Supplemental Nutrition Assistance Program, also known as SNAP or food stamps, has been declining for the past several years largely due to an improving economy.", "President Donald Trump referred to the decline in a July 9 tweet, mentioning a right-wing media outlet that published an article about the 10-year low hours before.", "\"Food Stamp participation hits 10 year low. Wow! @OANN,\" Trump wrote.", "The White House and Trump campaign did not provide a comment.", "SNAP benefits are food vouchers issued by the government to eligible participants and families with no or low income. While the federal government oversees the program, benefits are administered monthly on the state level.", "When it comes to comparing SNAP participation over the past 10 years, the best way to do so is to examine the percentage of the U.S. population that is participating in the program, said Lauren Bauer, fellow in economic studies at the Brookings Institution. It’s preferable to take the percentage of the population instead of a regular count because the U.S. population is growing.", "She pointed us to data from the U.S. Department of Agriculture and the U.S. Bureau of Economic Analysis. Since April 2009, the only month that had a lower participation percentage was February 2019. As we’ll see, there were unusual circumstances — a government shutdown — that affected the February numbers.", "The general decline in SNAP benefits is likely due to \"the consequences of the very low level of unemployment and gradually rising wages,\" said Michael Wiseman, professor of public policy at George Washington University.", "Due to a government shutdown, February 2019 had the lowest participation percentage — only 2.22% of people received SNAP benefits. As the record-breaking shutdown lasted from Dec. 22, 2018, to Jan. 25, 2019, most February benefits were distributed in January \"to ensure SNAP recipients would receive their February 2019 benefits in a timely manner,\" according to the USDA.", "The number of SNAP participants largely depends on the economy, said Brynne Keith-Jennings, senior research analyst of the left-leaning Center on Budget and Policy Priorities. And experts noted that policy changes haven’t had significant long-term effects on the decline in participation — that’s how strongly tied SNAP is to the economy.", "Because of the Great Recession, SNAP benefits were expanded at the beginning of the Obama administration in 2009 as a counter-recession effort, Wiseman said. The expansion was eliminated in 2013, so the 2009 Recovery Act had short-term if any effects, Keith-Jennings added.", "Another part of the 2009 stimulus was suspending a three-month limit to SNAP participation for Able-Bodied Adults without Dependents. States with high unemployment rates have the ability to waive the limit, at least for now.", "\"The Trump administration has proposed tightening standards for permitting relief from time limits,\" Wiseman said. \"In my judgment, time limits on (Able-Bodied Adults without Dependents), while questionable policy, are not the driving factor behind slowdown of SNAP enrollment.\"", "A proposal by the U.S. Department of Agriculture would make it more difficult for states to waive the three-month limit.", "If the USDA rule is approved, an estimated 755,000 people would no longer be eligible for SNAP benefits, according to a USDA estimate that’s part of the proposed rule. However, even if it’s approved, the economy would still have a larger effect on overall trends in SNAP participation due to the relatively small size of this population among SNAP participants, Keith-Jennings said.", "Our ruling", "Trump tweeted, \"Food Stamp participation hits 10 year low.\"", "He’s correct. The abnormally low SNAP participation in February 2019 was due to benefits for that month being distributed in January 2019 because of a government shutdown.", "We rate this True.", "Donald Trump tweet, July 9, 2019", "One America News Network, Food Stamp Participation Hits 10-Year Low, July 9, 2019", "U.S. Department of Agriculture, SNAP Data Tables, June 7, 2019", "FRED Economic Data via U.S. Bureau of Economic Analysis, Population, June 28, 2019", "Email interview with Lauren Bauer, fellow in economic studies at the Brookings Institution, July 11, 2019", "Phone interview with Brynne Keith-Jennings, analyst on food assistance policy for the Center on Budget and Policy Priorities, July 11, 2019", "Email interview with Brynne Keith-Jennings, analyst on food assistance policy for the Center on Budget and Policy Priorities, July 11, 12, 2019", "Email interview with Michael Wiseman, professor of public policy at George Washington University, July 11, 12, 2019", "Straight Talker tweet, July 9, 2019", "Federal Register, Supplemental Nutrition Assistance Program: Requirements for Able- Bodied Adults Without Dependents, February 1, 2019", "Federal Register, Supplemental Nutrition Assistance Program (SNAP): Eligibility, Certification, and Employment and Training Provisions of the Food, Conservation and Energy Act of 2008, January 6, 2017", "Center on Budget and Policy Priorities, SNAP Caseload and Spending Declines Have Accelerated in Recent Years, June 6, 2019", "Center on Budget and Policy Priorities, Interactive Map: SNAP Rose In States to Meet Needs but Participation Has Fallen as Economy Recovered, June 26, 2019", "Center on Budget and Policy Priorities, SNAP Benefit Boost in 2009 Recovery Act Provided Economic Stimulus and Reduced Hardship, March 31, 2015", "NPR, More Than 750,000 Could Lose Food Stamps Under Trump Administration Proposal, April 1, 2019", "The New York Times, The Government Shutdown Was the Longest Ever. Here’s the History, January 25, 2019", "History.com, Great Recession Timeline, December 4, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]