["The video was first broadcast live here on the Facebook page of Rajratna Ambedkar, the president of the Buddhist Society of India, on February 22.", "It has been viewed more than five million times and shared over 140,000 times.", "Below is a screenshot of the misleading Facebook post:", "Translated from Hindi to English, the caption of the video states: \"Cow is the mother of India, see who eats it in Australia?\"", "From the three-minute and 32-second mark of the video, Ambedkar says in Hindi: “See the logo, it shows the cow's head and they sell Brahman Pies. So I want to tell the people in India who consider the cow as mother and have been killing Muslims and in the name of cow protection that the Brahmins here [in Australia] do not consider the cow as mother. This is what I wanted to tell.”", "The video was filmed outside Brahman Pies in Pinkenba, Queensland, as seen on Google Street View.", "Brahman, also spelled Brahmin, is the highest ranking caste of Hindus in India.", "Cows are considered sacred in Hinduism; the 2014 election manifesto released by India's ruling Bharatiya Janata Party listed “protection and promotion of cow and its progeny” as a priority in protecting cultural heritage.", "According to this 2019 report by Human Rights Watch, between May 2015 and December 2018, at least 44 people were killed in cow-related violence, mostly as part of a vigilante campaign against beef consumption.", "The video was also shared here, here, here and here on Facebook and here, here, here and here on Twitter, alongside a similar claim.", "The claim is misleading; Brahman Pies issued a statement on Facebook denying relations with the Hindu caste and explained that its name was taken from the cattle breed Brahman cattle.", "In this Facebook post published on February 22, the company describes itself as a “100% Australian owned company” and that they “named our pie shops after the Brahman Cattle”.", "The post states in part: \"It has come to our attention that there is a video doing the rounds on Facebook in India about our stores and name ‘Brahman Pies’. While we don’t speak Hindi, enough people have contacted us to give a brief overview of the video in question.", "\"We at Brahman Pies would like to set the record straight for the people asking questions.", "\"-We are a 100% Australian owned company (not Indian)", "\"-We have nothing to do with Brahmin (an Indian Caste that is spelt differently)\".", "The Brahman Pies website also states: \"Brahman Pies is a premium pie brand and is a 100% privately owned Australian company.”", "Brahman cattle are a traditionally American breed that have developed into a major beef breed in Australia since the 1930s.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]