["The claim was published in this Facebook post on April 23, 2020.", "The post has been shared more than 150 times.", "The post states, in part: “Information from the National Taiwan University Hospital (NTUH) doctor team: Body surgery shows: 1. Covid-19 as a combination of SARS + AIDS. Many doctors assume, patients who have been discharged from the hospital, the nucleic acid test returned positive, this is not a recurrence, but has not fully recovered. This has to do with the characteristics of Covid-19. / 2. The immune system is almost completely damaged. SARS only attacks the lungs, does not attack the body's immunity. AIDS attacks the body's immunity. While the damage to the organs of Covid-19 patients is like SARS + AIDS… Interesting to share some info from Taiwan. They work really hard in regards to Covid.”", "SARS, or severe acute respiratory syndrome, is a disease caused by a strain of coronavirus that spread globally in 2003, causing 774 deaths in 26 countries, according to the World Health Organization (WHO).", "AIDS, or acquired immunodeficiency syndrome, is the most advanced infection stage of the human immunodeficiency virus (HIV), a pathogen that targets the immune system. The disease has killed 32 million people, as of November 15, 2019, according to the WHO.", "COVID-19 is caused by a virus genetically similar to one that causes SARS. According to WHO data, it has killed more than 367,000 people worldwide as of June 1, 2020.", "A similar claim was also shared here, here, here, here and here on Facebook.", "However, the claim is false.", "“These are absolutely not comments from doctors at National Taiwan University Hospital (NTUH),” the hospital said in this Chinese-language statement posted to Facebook on April 13, 2020. “Please don't believe in or share the rumour!\"", "NTUH’s statement included an image showing the Chinese-language version of the hoax, stamped with text that reads: “These comments did not come from a NTUH doctor”.", "The hospital’s statement also provided a link to this April 13, 2020 report debunking the hoax, published by the Taiwanese fact-check organisation MyGoPen.", "\"At the moment there are still many unknowns about the novel coronavirus, so the public is advised to obtain the latest information from the Taiwan Center for Disease Control website,\" the MyGoPen report states.", "As of May 31, 2020, this information page on the website of the Taiwan Centers for Disease Control contains no reference to COVID-19 as a combination of AIDS and SARS.", "Multiple keyword searches on the WHO’s website also did not yield any such statement or information.", "The hoax claim was also debunked here by the Taiwan FactCheck Center.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]