["By Saranac Hale Spencer", "Posted on October 31, 2019 | Updated on November 12, 2019", "Various memes circulating online falsely claim that Abu Bakr al-Baghdadi, the Islamic State leader who recently died during a U.S. raid, had been released from U.S. military custody under President Barack Obama. He was actually released in 2004, under President George W. Bush.", "Misinformation quickly followed the death of the Islamic State leader known as Abu Bakr al-Baghdadi, who killed himself after being cornered by U.S. forces at a compound in northern Syria.", "On the same day President Donald Trump announced al-Baghdadi’s death, memes flooded Facebook with the claim that the terrorist leader had been freed from U.S. military custody in 2009 by former President Barack Obama. Another popular meme also claimed that al-Baghdadi had been held at the Guantanamo Bay military prison.", "Neither of those things is true.", "According to detention records from the U.S. Army, al-Baghdadi, who was detained in Iraq under the name Ibrahim Awad Ibrahim al-Badry, was held for about 10 months in U.S. custody. The records show he was captured on Feb. 4, 2004, and released on Dec. 8, 2004, which was during the presidency of George W. Bush.", "According to those records, al-Baghdadi was held at Camp Bucca, which was one of three primary prisons operated by the U.S. military in Iraq at the time. Those prisons held thousands of detainees, mixing together religious extremists and moderates. Maj. Gen. Douglas Stone, who took command of the prisons in 2007, feared that they had become “hotbeds for ‘jihadists,'” according to a RAND corporation study of U.S. detainee operations since World War II.", "Bucca, in particular, developed a reputation for fostering extremist recruitment.", "“What had ended up happening was you had a witch’s brew, a toxic brew, of hardcore Jihadis [and] people who hadn’t done anything, but they were there nonetheless, and were, thus, radicalized,” Ali Khedery, a special assistant to five American ambassadors in Iraq and a senior advisor to three U.S. generals, said in a documentary about the rise of the Islamic State. “It became the perfect incubator for transnational Jihad,” he said.", "One Iraqi prisoner who met al-Baghdadi at Camp Bucca, and later talked extensively to the Guardian newspaper, said, “If there was no American prison in Iraq, there would be no IS now. Bucca was a factory. It made us all. It built our ideology.”", "Camp Bucca closed in September 2009, five years after al-Baghdadi was released.", "In the decade between leaving Bucca and declaring himself the leader of the Islamic State in 2014, al-Baghdadi finished his Ph.D. in Quranic sciences in Iraq in 2007 and climbed in the ranks of the terrorist organization that would later form ISIS, according to a timeline of his life compiled by the Wilson Center.", "Contrary to the false narrative spread by the memes, the Obama administration designated al-Baghdadi a global terrorist in 2011 in a notice signed by then-Secretary of State Hillary Rodham Clinton. The Department of State offered a $10 million reward for information leading to his capture, which it later increased to $25 million.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "Update, Nov. 12: As a result of our story, Dailypoliticalnewswire.com changed its headline and added a correction that says, “We earlier stated that Baghdadi was released during the President Obama administration. He was released during the President Bush administration.”", "Benard, Cheryl, et. al. “The Battle Behind the Wire: U.S. Prisoner and Detainee Operations from World War II to Iraq.” RAND Corporation, National Defense Research Institute. 2011.", "Johal, Sanjiev. “Enemy of Enemies: The Rise of ISIL.” Al Jazeera. Accessed 30 Oct 2019.", "Chulov, Martin. “Isis: the inside story.” The Guardian. 11 Dec 2014.", "“Camp Bucca Detention Center Closes in Iraq.” Press release. U.S. Department of Defense. 17 Sep 2009.", "“Timeline: The Life and Death of Abu Bakr al Baghdadi.” Woodrow Wilson International Center for Scholars. 28 Oct 2019.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]