["During the first presidential debate at Hofstra University, Hillary Clinton decried gun violence, especially as it impacts young African-Americans.", "\"The gun epidemic is the leading cause of death of young African-American men, more than the next nine causes put together,\" she said.", "This is a claim Clinton has made before, and it’s accurate.", "We found the relevant data on the Centers for Disease Control and Prevention website. Using this search form, we collected data on the 10 most common causes of death for African-American men and boys between the ages of 15 and 24, for 2014:", "There were 2,256 gun-related homicides in 2014, compared to 2,119 deaths in the next nine categories combined. This makes Clinton’s statement correct.", "If you add in the accidents and suicides related to guns, the gap between gun-related deaths and other types of deaths expands even further.", "There were 2,533 gun-related deaths in all 10 categories combined, compared to 2,002 deaths in the top 10 categories that had nothing to do with guns.", "We should note that this statement is dependent on the age range chosen. For instance, the statement is not correct for African-American boys between age 10 and 14. There were 38 gun-related homicides in that age and racial group in 2014, plus 10 gun suicides and three unintentional injuries caused by guns, for a total of 51. By contrast, the top 10 causes of death for that age and racial group included 271 deaths that had nothing to do with guns, such as diseases.", "That said, we think using the definition of \"young\" as 15-24 is a reasonable one.", "Our ruling", "Clinton said, \"The gun epidemic is the leading cause of death of young African-American men, more than the next nine causes put together.\"", "As long as you define \"young\" as being between the ages of 15 and 24, Clinton’s statement is accurate, according to CDC data. We rate the statement True.", "PolitiFact, \"Hillary Clinton says guns exceed next nine categories as leading cause of death for young black men,\" March 15th, 2016", "Hillary Clinton, \"Breaking down barriers for African Americans\" (Medium post), Feb. 17, 2016", "Centers for Disease Control and Prevention, \"Leading Causes of Death Reports, National and Regional, 1999-2014\" (main search form), accessed March 15, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]