["About this rating", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "In December 2020, Snopes readers asked us to verify an extraordinary claim made in several news articles around that time — namely that the coronavirus pandemic had hit North Dakota so hard that one in 800 residents of the state had died from COVID-19.", "On Dec. 1, Forbes reported that:", "Just two weeks after joining the growing list of states where at least one in every 1,000 residents has died from coronavirus-linked causes, North Dakota’s grim statistic has escalated: as of Tuesday [Dec. 1], one in every 800 North Dakotans has been claimed by COVID-19.", "The North Dakota Department of Health confirmed 409 new cases and 27 additional deaths in the state on Monday [Nov. 30], bringing the total death toll to 954 out of a population of roughly 762,000, or 0.97 in every 800 residents.", "The Grand Forks Herald published a similar claim in its report on Dec. 1, and Bloomberg reporter Steven Dennis posted a widely shared tweet to the same effect.", "On Dec. 3, Daily Mail published slightly different figures, reporting that:", "North Dakota has become the eighth deadliest state in the coronavirus pandemic per capita... On Tuesday, cumulative virus deaths since March in North Dakota hit 966, out of a population of 762,000, meaning that roughly one in 788 state residents has succumbed to the pandemic. That still trails far behind the deadliest state, New Jersey, where roughly one in 580 residents has died because of the virus, according to state data.", "All of the figures stated above were accurate at the time they were published.", "For example, on Dec. 1 the North Dakota Department of Health stated that the cumulative total number of deaths from COVID-19 in the state through Nov. 30 was 954, with 27 new deaths reported on Nov. 30 itself. Population estimates are not yet available for 2020, but the most recent official figure from the U.S. Census Bureau's American Communities Survey estimated North Dakota's population as 762,062 as of July 1, 2019.", "Based on that population estimate, 0.125 % of North Dakotans had died from COVID-19 through Nov. 30, 2020 — one out of every 799 residents, vindicating the headline claim made by Forbes, the Herald, and Dennis.", "One obvious note of caution here is that the population estimate used in arriving at that conclusion is 17 months old. If North Dakota's population rose in that intervening period, then the proportion of North Dakotans who died from COVID-19 would have been slightly lower than one in 800 as of Nov. 30. Equally, if the population decreased since July 2019, then the one-in-800 milestone would have been reached even earlier in the year.", "On Dec. 2, the North Dakota Department of Health stated that the cumulative total number of deaths from COVID-19 through Dec. 1 had reached 966, just as Daily Mail reported. Using the same 2019 population estimate as a base, this would mean one in every 789 North Dakotans had died from COVID-19 by that time.", "On Dec. 4, when this fact check was originally published, the state posted the official figures for Dec. 3, providing an updated death count from the virus of 989 people — meaning one out of every 771 North Dakotans had died from COVID-19 by that time.", "As Forbes and Daily Mail both noted, North Dakota's COVID-19 death rate, although high, is not the highest in the country. Using Dec. 4 data from the New Jersey Department of Health and the July 2019 population estimate for the state, one out of every 576 New Jerseyans had died from COVID-19 by Dec. 4, 2020 — the highest death rate in the country at that time.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]