["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "While Miami Republican Rep. Carlos Curbelo portrays himself as an environmentalist, the Democratic Party says he is no treehugger and is aligned with Donald Trump.", "\"Republican Carlos Curbelo and Donald Trump's ideas about the environment are more alike than you think. Curbelo talks about protecting the environment,\" says a TV ad by the Democratic Congressional Campaign Committee.", "The ad then shows a clip of Curbelo talking about protecting the environment and then pivots to a clip of him on an oil rig.", "The narrator continues: \"Curbelo supports drilling offshore just like Trump, and Curbelo repeatedly voted against President Obama's ability to fight pollution and combat climate change.\"", "Curbelo represents a Democratic-leaning Westchester-to-Key West district. He faces a rematch Nov. 8 with former U.S. Rep. Joe Garcia, D-Miami. (Curbelo does not support Trump but said he won’t vote for Hillary Clinton, either.)", "We found that Curbelo supports current drilling but opposes an expansion near Florida’s coasts. And while Curbelo has taken some votes related to pollution and climate change that Democrats criticize, he has been one of the more outspoken Republicans about combating climate change.", "Trump on drilling", "Trump has generally spoken in favor of offshore oil drilling in recent months, although his position hasn’t always been clear.", "He sounded skeptical about expanding offshore drilling in an interview with the Tampa Bay Times in February.", "\"They've already got plenty in the Gulf,\" Trump said. \"It would be a little bit of a shame (to expand drilling closer to Florida), because there's so much fracking, and there's so much oil that we have now that we never thought possible. That's an issue I'd absolutely study and do the right thing.\"", "But Trump has been more forceful about his support for drilling since that time.", "\"We’re going to revoke policies that impose unwarranted restrictions on new drilling technologies,\" he said in North Dakota in May.", "In September, Trump said in a fact sheet that he will \"open up vast areas of our offshore energy resources for safe production\" and will eliminate \"unnecessary restrictions\" on offshore oil and gas.", "‘Curbelo supports drilling offshore’", "While Curbelo defended current offshore oil drilling in 2015, he has fought against efforts to expand it closer to Florida than the current 125-mile restriction.", "Curbelo made a video of himself standing on an oil rig in the Gulf of Mexico in 2015:", "\"The offshore oil industry in the United States fuels about 20 percent of our economy and assets like this are an important part of an all-of-the-above energy strategy that will grow the American economy and make our country more secure,\" he said.", "But Curbelo has voted three times in favor of Democratic amendments to protect coasts from drilling by banning funds, research or testing. He also got the House to pass a bill to force companies that spill oil in foreign waters to clean up any damage to Florida coasts.", "‘Repeatedly voted against President Obama's ability to fight pollution and combat climate change’", "The Democrats point to a handful of votes that Curbelo took that were contrary to Democratic efforts to fight pollution and climate change. In all four cases, Curbelo sided with Republicans in party line votes on legislation or a resolution. But the votes are cherry-picking Curbelo’s record, which also reflects his efforts to combat climate change and pollution.", "• In January Curbelo took a stand along with virtually all Republicans against a controversial proposal by the federal government to define which bodies of water fall under its jurisdiction. Curbelo thought the \"Waters of the United States\" rule was too vague and it was later stayed by the courts.", "• In 2015, Curbelo voted in favor of a bill Republicans said would prevent the EPA from using \"secret science\" and require transparency. The EPA argued it already is transparent and uses sound science.", "• The only vote directly about climate change was minor. The House, along with Curbelo, barred funds for a government climate model program in 2015. Curbelo opposed it because he said it was duplicative, National Republican Congressional Committee spokesman Chris Pack said.", "• Curbelo also voted in favor of a bill to limit environmental reviews to move projects along in 2015.", "Importantly, the ad omits that Curbelo has been one of the leading Republican voices in Congress to come up with solutions to combat climate change.", "In September 2015, Curbelo signed onto a congressional resolution acknowledging climate change’s existence and later, along with U.S. Rep. Ted Deutch, D-Fla., formed the bipartisan Climate Solutions Caucus.", "\"It is vital for Congress to acknowledge the reality of climate change as a legitimate issue requiring feasible solutions, and we need leaders on both sides of the aisle to pursue policies that will make a difference,\" Curbelo wrote in an op-ed in the Miami Herald Oct. 24, 2015.", "We found other actions that Curbelo took in an effort to fight pollution.", "In December 2015, Curbelo was one of 10 Republicans to vote against a resolution to nullify the EPA’s rules to regulate carbon emissions from new power plants.", "In July 2016, Curbelo opposed a vote by a Florida commission to increase allowed levels of toxins for over two dozen known chemicals in waterways.", "Our ruling", "The DCCC said,\"Curbelo supports drilling offshore just like Trump and Curbelo repeatedly voted against President Obama's ability to fight pollution and combat climate change.\"", "Curbelo supports current drilling, but the ad omits that he has repeatedly voted against expanding drilling off Florida’s coasts. Trump, though not always consistent, has sounded more favorable to drilling than Curbelo.", "Curbelo has taken votes against Democratic efforts to curb pollution and to model climate change, but that is cherry-picking his record. The ad omits that Curbelo has been a leader among Republicans speaking out about the need to combat climate change.", "We rate this claim Mostly False.", "Political TV ad archive, Ad, Sept. 27, 2016", "U.S. Rep. Carlos Curbelo, Video, Sept. 3, 2016", "U.S. Rep. Carlos Curbelo, Press release, April 19, 2016", "Donald Trump, \"An America first energy plan,\" May 26, 2016", "Donald Trump, Fact sheet, Sept. 15, 2016", "Congress.gov amendments to H.R. 5538, U.S. Rep. Donald Beyer amendment, U.S. Rep. Gwen Graham amendment and U.S. Rep. Patrick Murphy amendment, July 13, 2016", "Congress.gov, S.J. Res 22, Jan. 13, 2016", "Congress.gov, HR 1030, March 18, 2015", "Congress.gov, U.S. Rep. Paul Gosar amendment to H.R. 2028, May 1, 2015", "Congress.gov, HR 348, Sept. 25, 2015", "Congress.gov, H. Res. 424, Sept. 18, 2015", "Congress.gov, S.J. Res. 23, Dec. 1, 2015", "Congress.gov, \"H.R.1684 - Foreign Spill Protection Act of 2016,\" Dec. 1, 2015", "U.S. Rep. Carlos Curbelo, Press release, April 9, 2016", "U.S. Rep. Carlos Curbelo, Press release, July 27, 2016", "The Hill, \"House likely to vote on EPA ‘secret science’ bill,\" Feb. 27, 2015", "Miami New Times, \"Clean Energy Advocate\" Carlos Curbelo Supports More Oil Drilling,\" Oct. 8, 2015", "Miami Herald/Tampa Bay Times, \"They live at ground zero, but Jeb Bush and Marco Rubio say climate change is a distant threat,\" Jan. 15, 2016", "Miami Herald, \"Can Carlos Curbelo survive in Donald Trump’s GOP?\" May 13, 2016", "Miami Herald Naked Politics blog, \"Does Miami U.S. Rep. Carlos Curbelo -- a GOPer -- plan to vote for Hillary Clinton?\" March 25, 2016", "Miami Herald op-ed by Carlos Curbelo, \"Climate change cannot be a partisan issue,\" Oct. 25, 2015", "Miami Herald, \"More toxic chemicals allowed in Florida waterways,\" July 26, 2016", "Tampa Bay Times, \"Exclusive interview: Donald Trump talks Cuba, oil drilling and 'badly hurt' Marco Rubio,\" Feb. 13, 2016", "PolitiFact Florida, \"Marco Rubio says EPA rule covers 'water barely bigger than a puddle,'\" Oct. 22, 2015", "MIT Technology Review, \"Donald Trump’s \"America-First Energy Plan\" Shows He Knows Virtually Nothing About the Issue,\" May 26, 2016", "Associated Press, \"Trump offers economic plan in Detroit: Simplified tax code, tax-free child care,\" Aug. 9, 2016", "Interview, Javier Gamboa, Democratic Congressional Campaign Committee spokesman, Sept. 28, 2016", "Interview, Chris Pack, National Republican Congressional Committee spokesman, Sept. 28, 2016", "Interview, Julie Hill-Gabriel, deputy director Audubon Florida, Sept. 29, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]