["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "In this Nov. 10, 2016, photo, President-elect Donald Trump, accompanied by his wife Melania, and Senate Majority Leader Mitch McConnell of Ky., gestures while walking on Capitol Hill in Washington. (AP Photo/Molly Riley)", "A YouTube headline claimed that Elaine Chao, President Donald Trump’s transportation secretary, was caught improperly using her office to help re-elect her husband, Senate Majority Leader Mitch McConnell.", "McConnell, who is seeking a seventh term to his Kentucky seat in 2020, is the top-ranking Republican in Congress. But, according to Morning Consult polling for the third quarter of 2019, he is also the most unpopular senator in the country among voters in his state.", "\"Elaine Chao BUSTED Sending $97 Million Contract To Help Mitch McConnell Win Reelection,\" says the headline, which also appeared on other websites and social media.", "The headline linked to a video from The Ring of Fire show on YouTube, which elaborated on the claim, primarily by referring to a Dec. 17 Politico expose.", "What we found:", "Chao did get busted in the conversational sense of the word — her actions providing unusual help to Kentucky were exposed and they also drew criticism from a federal watchdog agency.", "But the claim significantly overstates the amount of the grant (not a contract). And even though it certainly gave McConnell something to crow about in his campaign, the grant occurred more than two years before voters will go to the polls in November 2020.", "In June 2018, the U.S. Department of Transportation gave a $67 million interstate highway improvement grant — not a $97 million contract — to Boone County.", "The county, Politico reported, is \"a rapidly growing suburban district of political importance\" to McConnell.", "The county was one of 26 grant winners out of 258 initial applicants.", "In June 2019, the Government Accountability Office, a top federal watchdog, faulted DOT in a report for failing to document why Boone County and 41 other grant applicants that had initially submitted incomplete applications were allowed to revise them, while 55 other applicants were not.", "\"It really invites skepticism, and it raises questions about the integrity of the process and ultimately the decisions that are made,\" Susan Fleming, director of GAO's physical infrastructure team, told Politico. \"Are these decisions driven by merit? Or are they driven by other factors?\"", "Boone County officials were in contact with Chao’s aide, Todd Inman, during the grant application process.", "Inman is a former McConnell campaign staffer.", "\"Chao’s alleged favoritism toward Kentucky has become a focus of scrutiny following revelations that she had designated Inman as a special point-of-contact for Kentucky officials,\" the Politico article says.", "The DOT said the Inman communication was coincidental and that Boone County’s application was among those \"best aligned\" with the grant criteria. In a later Fox News Radio interview, Chao dismissed the claims of favoritism as mere politics.", "An earlier Politico article, in June 2019, revealed that Chao had designated Inman to help with grant applications and other priorities from Kentucky, \"paving the way for grants totaling at least $78 million for favored projects as McConnell prepared to campaign for reelection.\" Inman had stated in an email to McConnell’s Senate office that Chao had personally asked him to serve as an intermediary \"on grants with special significance for McConnell.\"", "McConnell dismissed that report at the time, suggesting at a news conference that he had discussed federal projects with Chao and that she hadn’t steered enough funds to his state. \"You know, I was complaining to her just last night: 169 projects, and Kentucky got only five. I hope we’ll do a lot better next year,\" McConnell said.", "It’s worth noting that McConnell announced his re-election bid in August 2018 — two months after the grant was announced, but more than two years ahead of the 2020 election.", "A social media post claimed: \"Elaine Chao BUSTED Sending $97 Million Contract To Help Mitch McConnell Win Reelection.\"", "Chao’s agency gave a Kentucky county a $67 million grant, not a $97 million contract, so the amount claimed is overstated by nearly half.", "Chao was \"busted,\" in the colloquial sense of the word, in that it was revealed that the county had initially submitted an incomplete grant application, but eventually won the funds after consulting with an aide to Chao — who formerly worked on McConnell’s campaign. The process also drew criticism from the Government Accountability Office.", "The grant helped McConnell’s re-election bid in that it is the largest transportation grant received in Kentucky during the Trump administration. Voters could view that favorably come Election Day.", "The statement is partially accurate, our definition of Half True.", "YouTube, The Ring of Fire video, Dec. 29, 2019", "Politico, \"Chao’s team helped McConnell’s state win its largest DOT grant,\" Dec. 17, 2019", "Roll Call, \"Mitch McConnell Is Already Running for Re-Election — In 2020,\" Aug. 6, 2018", "Fox News Radio, Elaine Chao interview, Dec. 18, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]