["The list of purported IDH preventive measures was published in an article here on an Sri Lankan news website on July 14, 2020. The headline of the Sinhala-language report translates to English as: “IDH issues instructions to follow in order to avoid Covid-19 infections”.", "The purported guidelines state: “Take a VitC-1000 / Take a Vit E", "\"Expose yourself to sunlight between 1000-1100 for about 15-20 minutes", "“Have an egg daily / Take rest every 7-8 hours /", "“Consume 1.5 liters of water daily. Meals should be consumed while they are warm.”", "The purported list also includes a recommendation to eat high alkaline fruits to help neutralize the Ph level of the coronavirus.", "The claim circulated just days after a new cluster of COVID-19 infections were detected at a rehabilitation center in north central Sri Lanka.", "The purported recommendations also circulated in early April 2020 after Sri Lanka recorded its first confirmed COVID-19 cases; including on Facebook here, here, here, here, here and here alongside a similar claim.", "The claim, however, is false.", "In a Facebook statement on July 15, 2020, Sri Lanka’s Health Promotion Bureau (HPB) labelled the purported guidelines as “Fake News”.", "The HPB said that IDH Director Dr. Hasitha Tissera confirmed the hospital did not issue the guidelines.", "An HPB official warned the public against following unapproved COVID-19 guidelines.", "“The instructions are healthy practices in one’s daily life. However they will not offer any protection against Covid-19 infection,” the official told AFP by phone on July 14, 2020. “The national health agencies including the Health Ministry, HPB and the Epidemiology Unit have issued a set of national guidelines to be followed in order to minimise Covid-19 infection risk and we urge the public to strictly adhere to them instead of resorting to follow misinformed sources.”", "The list of unsubstantiated COVID-19 prevention guidelines circulated in the Philippines in June 2020. It was debunked by AFP here. The claim that eating alkaline foods helps prevent COVID-19 was also debunked by AFP here.", "Here is a complete list of AFP fact checks about COVID-19.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]