["About this rating", "The U.S. State Department under President Donald Trump has denied citizenship to some children born on foreign soil to same-sex, U.S. citizen parents based on a written policy for determining whether children born via assisted reproductive technology (egg donors, surrogacy, etc.) are biologically related to the parents.", "The long-standing policy didn't originate with the Trump administration, nor were they the first to enforce it.", "In May 2019, mainstream press outlets reported that the Trump administration was denying citizenship to children born abroad to same-sex couples who are U.S. citizens.", "Generally speaking, offspring born of U.S. citizens on foreign soil automatically acquire citizenship as long as residency and other requirements are met (in accordance with the 14th Amendment and the Immigration and Nationality Act). Since President Donald Trump was elected, however, same-sex couples have come forward with accounts of the difficulties they encountered when trying to obtain citizenship for their foreign-born children thanks to a U.S. State Department policy on the use of assisted reproductive technology (i.e., egg donors, gestational surrogates, and the like).", "A 15 May 2019 article in The Daily Beast cited two cases detailing the effects the policy has had on LGBT families. Roee and Adiel Kiviti, a gay couple who were legally married and U.S. citizens, were told by officials that their daughter, who was born in Canada via an egg donor and surrogate mother, was ineligible for acquired citizenship because she was born \"out of wedlock\" (as defined by the State Department). A similar rationale was used to deny a passport to the child of a lesbian couple — again legally married, though one partner was a U.S. citizen and the other was not — whose sons were both born in England. Because one of their sons wasn't genetically related to his U.S. citizen mother (his birth mother was Italian), he was officially deemed born \"out of wedlock\" and not a U.S. citizen. Their other son, born to the mother who was a U.S. citizen, acquired citizenship without difficulty.", "The relevant policy, versions of which have been in place since at least the mid-2000s, can be found in the current edition of the State Department's Foreign Affairs Manual. It revised existing Immigration and Nationality Act (INA) guidelines for assessing whether a child is biologically related to a parent, and whether the child was born in or out of wedlock, in cases where assisted reproductive technology (ART) was used. The practical effect of the policy has been to throw up extra roadblocks to U.S. citizenship for the children conceived and born via ART.", "Even though the INA provides that some children born out of wedlock on foreign soil can acquire citizenship through their citizen parent(s), these families face stiffer residency requirements, more paperwork, and closer scrutiny by authorities, up to and including DNA tests to prove biological parenthood. And although the ART guidelines don't explicitly target same-sex parents (they apply to heterosexual couples as well), LGBT families have a greater chance of running afoul of them.", "\"The rule disproportionately affects mixed-citizenship, same-sex couples,\" immigration law expert William A. Stock told us via email, \"as they are more likely to have to use ART and [to] have no genetic connection between the citizen spouse and the child.\"", "In addition to that circumstance (and for obvious reasons), same-sex couples are more likely than heterosexual couples to be asked to prove that they're biologically related to their children. \"In general, absent other evidence,\" the U.S. Citizenship and Immigration Services Policy Manual said, \"USCIS considers a child’s birth certificate as recorded by a proper authority as sufficient evidence to determine a child’s genetic relationship to the parent (or parents).\" Clearly, no such presumption of genetic parentage was applied in the cases of the same-sex couples discussed above, despite their names being listed on the birth certificates.", "The ART policy has been decried as unfair, not only by LGBT rights organizations but also by Democratic lawmakers, some 100 of whom signed letters to Secretary of State Mike Pompeo urging him to reverse it. Speaker of the House Nancy Pelosi issued a statement calling the policy \"an unconscionable attack on American families.\"", "\"Once again,\" Pelosi wrote, \"the Trump Administration is demonstrating just how far they are willing to go to undermine our core values and advance their hateful agenda by denying citizenship to children born abroad to same-sex American couples, as well as those who seek medical treatment overseas in order to conceive.\"", "But while it's true that the Trump administration is responsible for enforcing it, any blame laid on the current administration for the policy's existence is misplaced. As noted above, the ART rules have been in place since at least the mid-2000s, and requirements pertaining to biological parentage have existed since the 1990s. The policy was liberalized somewhat during the Obama administration (in 2014) to confer birthright citizenship on children born to U.S. citizen mothers using in vitro fertilization with donor eggs (an archived copy of the policy as it appeared in 2015 is available here). News articles have noted that the policy was revised again in 2018, two years after Trump was elected, but a State Department official told us that that update was \"non-substantive\" and that the relevant regulations have remained unchanged for several years.", "Nor was the Trump administration the first to enforce the policy. Prior to its 2014 reinterpretation of the rule pertaining to conception via donor eggs, for example, the Obama administration denied citizenship to the children of their gestational mother, U.S. citizen Ellie Lavi, on precisely that basis.", "In an interview with Public Radio International, Allison Blixt, one of the lesbian mothers mentioned above who were told that their children were technically born \"out of wedlock\" (even though she and her wife are married), said that their troubles with the State Department began during the Obama administration:", "\"It was already affecting us before Trump,\" she said. \"As much as we want to point to his administration, in fact it was happening already. And when we filed our lawsuit, we hoped that the government would see the error of its ways at least at that point ... and that they would change the policy. In conversations it seemed like they were going to try and change the policy. But I have a feeling it got up higher in the chain and they decided not to.\"", "In summary, it's accurate to say that the Trump administration is denying citizenship to some children born abroad to same-sex parents who are U.S. citizens, but inaccurate to say or imply that the policy originated with the Trump administration, or that they were the first to try to enforce it.", "Bixby, Scott.   \"Trump Administration to LGBT Couples: Your 'Out of Wedlock' Kids Aren't Citizens.\"\r\n   The Daily Beast.   15 May 2019.", "Chabin, Michele.   \"In Vitro Babies Denied U.S. Citizenship.\"\r\n  USA Today.   19 March 2012.", "Hansler, Jennifer.   \"Trump Admin Is Denying Citizenship to Some Children of Same-Sex Couples.\"\r\n    CNN.   18 May 2019.", "Mervosh, Sarah.   \"Both Parents Are American. The U.S. Says Their Baby Isn't.\"\r\n    The New York Times.   21 May 2019.", "Mervosh, Sarah.   \"Democrats Urge Pompeo to End Policy Used to Deny Citizenship to Children of Gay Couples.\"\r\n    The New York Times.   6 June 2019.", "Pelosi, Nancy.   \"Pelosi Statement on State Department Denying Citizenship to Children of Americans.\"\r\n    Speaker.gov.   17 May 2019.", "Public Radio International.   \"How a U.S. Policy Is Tearing Apart This Same-Sex Couple and Their Children.\"\r\n    22 May 2019.", "Titshaw, Scott.   \"Sorry, Ma'am, Your Baby is an Alien: Outdated Immigration Rules and Assisted Reproductive Technology.\"\r\n   Florida Coastal Law Review.   Fall 2010.", "U.S. Citizenship and Immigration Services.   \"Citizenship Through Parents.\"\r\n    Accessed 13 June 2019.", "U.S. Citizenship and Immigration Services.   Policy Manual (Chapter 2: Definition of Child for Citizenship and Naturalization).\r\n    6 June 2019.", "U.S. Dept. of State.   Foreign Affairs Manual (8 FAM 304.3: Acquisition of U.S. Citizenship at Birth - Assisted Reproductive Technology).\r\n    27 June 2018.", "CORRECTION [19 June 2019]: A previous version of this article inaccurately stated that the U.S. State Department policy regarding assisted reproductive technology and birthright citizenship originated under the Obama administration.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]