["By Sean Carlin", "Posted on May 11, 2020", "Social media posts falsely suggest that meatpacking workers have suffered more COVID-19 cases than health care workers. According to the Centers for Disease Control and Prevention, there’s an increased risk for workers in both professions, but there have been significantly more cases reported among health care employees.", "Health care personnel have been on the front lines of the battle to curb the spread of COVID-19, the disease caused by the novel coronavirus. Each day they have direct or indirect exposure to infected patients or infectious materials.", "Despite their best efforts to protect themselves during the pandemic — made difficult due to widespread shortages in personal protective equipment — more than 9,200 health care workers had been infected with the disease in the U.S., as of April 17, according to the Centers for Disease Control and Prevention.", "But viral memes on Facebook have spread misinformation about the impact the novel coronavirus has had on health care workers. In one post, a Facebook user shared a meme that read, “DON’T YOU FIND IT QUITE INTERESTING, THAT 5,000 MEAT PACKERS TESTED POSITIVE! HOWEVER, NOT 5,000 NURSES & DOCTORS!”", "A similar post was shared with the caption, “Ready for the food shortage?” — implying that a meat shortage is being intentionally planned.", "The meatpacking industry has been hit particularly hard by the disease. More than 4,900 workers at 115 meat and poultry processing facilities have been infected with the virus and 20 have died, according to a May 8 report released by the CDC. Several factors have played into the spike in infections in the food industry, according to the CDC, including “difficulties with workplace physical distancing and hygiene and crowded living and transportation conditions.”", "COVID-19’s prevalence among food processing workers has caused a disruption to the industry. At least 30 meatpacking plants have closed at some point during the last two months, and the pandemic has caused a 40 percent reduction in pork slaughter capacity and a 25 percent reduction in beef slaughter capacity, according to the United Food and Commercial Workers International Union.", "In an effort to maintain the food supply chain, President Donald Trump issued an executive order on April 28 that resulted in the reopening of 14 meatpacking facilities.", "But UFCW International President Marc Perrone opposed the measure without safety improvements, saying meatpacking workers are “putting their lives on the line every day to make sure our families have the food they need,” and he called for more protection for employees of the plants.", "Still, the memes’ statement that more meatpackers have been infected than doctors, nurses and other health care workers is incorrect, as we’ve noted.", "More than 9,200 health care workers have been infected in the U.S., including 27 workers who have died, according to an April 17 report from the CDC. Those numbers are likely an undercount, the agency said, since only 16% of COVID-19 cases reported to the CDC included information on whether or not the patients were health care workers. The report also noted that health care personnel with mild or asymptomatic infections may have been “less likely to be tested, thus less likely to be reported.”", "A CDC spokesperson told us that the agency did not have updated information on the number of health care workers infected.", "But the CDC has reported that the number of COVID-19 cases among health care workers “is expected to rise as more U.S. communities experience widespread transmission.”", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "“Characteristics of Health Care Personnel with COVID-19 — United States, February 12–April 9, 2020.” Centers for Disease Control and Prevention COVID-19 Response Team. 17 April 2020.", "“COVID-19 Among Workers in Meat and Poultry Processing Facilities ― 19 States, April 2020.” Centers for Disease Control and Prevention . 8 May 2020.", "Nordlund, Kristen. Public affairs spokesperson, Centers for Disease Control and Prevention. Email to FactCheck.org. 8 May 2020.", "Schlanger, Zoe. “Begging for Thermometers, Body Bags, and Gowns: U.S. Health Care Workers Are Dangerously Ill-Equipped to Fight COVID-19.” Time. 20 April 2020", "“UFCW Calls on All U.S. Governors to Enforce CDC Guidelines to Protect Food Supply and Meatpacking Workers From Coronavirus Outbreak.” United Food and Commercial Workers International Union. 29 April 2020.", "“Trump Order to Re-Open 14 Meatpacking Plants Fails to Increase Coronavirus Testing and Safety Measures Needed to Protect Food Supply & Workers.” United Food and Commercial Workers International Union. 8 May 2020.", "“America’s Meatpacking Facilities Practicing Safe Reopening to Ensure a Stable Food Supply.” U.S. Department of Agriculture. 8 May 2020.", "“Executive Order on Delegating Authority Under the DPA with Respect to Food Supply Chain Resources During the National Emergency Caused by the Outbreak of COVID-19.” The White House. 28 April 2020.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]