["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "The rising sun silhouettes the U.S. Capitol dome at daybreak on Oct. 26, 2018. (AP/Alex Brandon)", "How low is public approval of the media today? West Virginia University President Gordon Gee raised the topic during a Sept. 17 meeting with the staff of the West Virginia University student newspaper, The Daily Athenaeum.", "Gee was expanding upon a statement he had made on Aug. 27, 2018, during Gov. Jim Justice’s Blue Ribbon Commission on Four-Year Higher Education. At the commission meeting, Gee discussed some unflattering news reports about actions he had taken within the organization. \"You’ve learned the common truth of public life, which is don’t believe what you read in the newspaper,\" he said.", "Three days later, the Athenaeum published a front-page editorial pushing back on Gee’s remark. \"Such a comment feeds into a narrative that diminishes truth, dubbing accurate news as ‘fake news’ and honest journalists as ‘enemies of the American people,’\" the editors wrote.", "When Gee held a meeting with the newspaper staff about a month later, he said that his original statement was taken out of context and sought to affirm his faith in the press. Encouraging the student paper to pursue greater diligence in their reporting, Gee said that \"the press is rated right now below that of Congress, and that is very low; it’s in the single digits.\"", "Neither the press nor Congress is held in particularly high regard today, but we wondered: Is public trust in the press really lower than that of Congress? PolitiFact checked a similar statement by President Donald Trump in February 2017. We reviewed the data we found then and updated it with data that’s been produced since.", "As we noted in early 2017, Gallup has been asking people how much confidence they have in various institutions since 1973. Here’s a look at the run of historical data.", "In a Gallup poll conducted in September 2018, 19 percent of respondents reported that they approved of the work Congress is doing in Washington, while 76 percent said that they disapproved. The remaining 5 percent reported that they had no opinion.", "As for the media, Gallup has asked the question a few different ways.", "In September 2018, the most recent poll specifically regarding media trust that Gallup published, asked the question, \"In general, how much trust and confidence do you have in the mass media such as newspapers, TV and radio -- when it comes to reporting the news fully, accurately and fairly? A great deal, a fair amount, not very much or none at all?\"", "The survey found that 54 percent of individuals had \"not very much\" in the mass media or \"none at all.\" But 45 percent responded that they had either a \"great deal\" or a \"fair amount\" of trust.", "In what may be Gallup’s most direct recent comparison of the press and Congress, a survey conducted in June 2018 asked about trust in various major institutions. In this survey, 58 percent of respondents said they had either a \"great deal/quite a lot\" of trust or \"some\" trust in newspapers, while 54 percent reported the same for television news. In the same poll, 50 percent of respondents said they had a \"great deal/quite a lot\" or \"some\" confidence in Congress, while 48 percent to say they had \"very little\" or \"none.\"", "Looking just at the numbers for \"great deal/quite a lot,\" Congress was the lowest at 11 percent, with both types of news media in the low 20s.", "John Bolt, WVU’s senior executive director for the office of communications, responded to an email inquiry about the claim by citing several polls from NPR and Gallup. However, none of these polls supported Gee’s statement, either.", "The joint poll from NPR, PBS Newshour and Marist found that 25 percent of respondents had either \"a great deal\" or \"quite a lot\" of confidence in Congress, while 71 percent had \"not very much\" or none. In the same poll, 30 percent reported they had either \"a great deal\" or \"quite a lot\" of confidence in the media, while 68 percent reported they had \"not very much\" or none.", "A poll from Gallup asked respondents how they \"would rate the honesty and ethical standards of people in these different fields -- very high, high, average, low, or very low?\" 11 percent rated members of Congress very high or high, while 60 percent rated them very low or low. In the same poll, 25 percent rated the media very high or high, while 35 percent rated them very low or low.", "Gee would have been closer to the mark if he had referred to Republican views of the media.", "For instance, a survey by the Pew Research Center in February and March of 2018 measured partisan differences in attitudes towards the media. The lowest number is the 11 percent of Republicans who said that the \"national news media do very well at keeping them informed.\" Meanwhile, 27 percent of Democrats responded said they believed that same statement.", "Bottom line: The levels of trust in the media are higher than Gee had indicated, and trust in the media are higher than they are for Congress.", "Gee said that in public approval, \"the press is rated right now below that of Congress, and that is very low; it’s in the single digits.\"", "Levels of trust for both institutions are low, but Gee’s claims are wrong on two counts. First, trust in Congress is consistently lower than trust in the media. And second, we couldn’t find a poll in which the press’s approval ratings were in the single digits.", "We rate the statement False.", "The Daily Athenaeum, \"Gee speaks to the DA on Greeks, abortion, Sodexo,\" Sep. 20, 2018", "The Daily Athenaeum, \"Editorial: The DA’s response to Gee’s recent comments about newspapers,\" Aug. 28, 2018", "Charleston Gazette-Mail, \"Panel discusses replacing HEPC; WVU president disputes articles,\" Aug. 27, 2018", "Politifact, \"Is news media less trusted than Congress?\", Feb. 16, 2017", "Gallup, \"Snapshot: Congressional Approval at 19% in September\", Sep. 20, 2018", "Gallup, \"Media Use and Evaluation\", Accessed Oct. 15, 2018", "Gallup, \"Americans’ Confidence in U.S. Institutions, 2018\", Accessed Oct. 15, 2018", "Pew Research Center, \"Partisans Remain Sharply Divided in Their Attitudes About the News Media\", Sept. 25, 2018", "NPR, \"Here’s Just How Little Confidence Americans Have In Political Institutions\", Jan. 7, 2018", "Gallup, \"Nurses Keep Healthy Lead as Most Honest, Ethical Profession\", Dec. 26, 2017", "Email interview with John A. Bolt, senior executive director in the Office of Communications at West Virginia University, Oct. 29, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]