["About this rating", "In mid-May 2018, the hashtag #PitbullDropOff began to gain traction on social media. A typical post involves a picture of cute pit bull terrier-type puppies, and a message that the person who took the picture adopted them for the express purpose of euthanizing them to get them off the streets. This post from \"muffs-o-matic\" is representative of most:", "These posts are fabricated; they are part of a juvenile attempt to provoke anger and outrage on the internet, and are specifically directed at \"naive pitmommies and various other low IQ individuals.\" They have their origins not in reality, but in the callow minds of the festering racist, misogynistic, and nihilistic world that is 4chan — an anonymous message board that unites trolls, \"incels,\" and neo-Nazis together in their shared contempt for human decency.", "A 13 May 2018 anonymous post found in that website's most infamous board (/pol/) presents an update on their campaign, and also how you — assuming, of course, that you are a troll — can get involved in the game:", "#PitbullDropOff has been simmering on twitter for two days now, naive pitmommies and various other low IQ individuals are falling for the bait. This will be a major news story by Monday so it's best to escalate the hysteria before the national news breaks for max effect.", "All you have to do is post a photo of a pitbull you say you picked up and dropped off at a kill shelter under #pitbulldropoff.", "Rinse and repeat for maximum pitmommie hysteria. Be aware it's best to use burner accounts as pitmommies are mobilizing on facebook to bring down posts.", "Indeed, as many have pointed out on Reddit, most of the photos shared on Twitter and Facebook with the #PitBullDropOff hashtag include images that can easily be found on reverse image search as having nothing to do with #PitbullDropOff, and which predate the hashtag by years. The image that appears in the post by \"muffs-o-matic,\" for example, can be found in a February 2017 list of cute puppies on The Chive.", "This tweet, from a burner account clearly created solely for the #PitbullDropOff troll, contains a picture of a sad dog that is at least as old as December 2011:", "Outside the smug satisfaction of feeling smarter than the people they have trolled, the underlying motivations for the hashtag fall clearly into the political ideology of the /pol/ message board, which has coagulated over time into a simple philosophy: Women, liberals, and minorities are destroying America. Here’s a sampling of some of the comments in the thread:", "those pit momies [sic] are annoying but maybe its [sic] for the greater good if they [sic] offspring dies / gets pit redpilled.", "pit mommies are so stupid lmao [...]", "Most of them are women. How can you not understand how they can be gullible and only make decisions with their emotions? That's almost always what they do. [...]", "The anonymous trolls also suggest that pit bull-type dogs are almost always owned by ethnic minorities, and are thus aggressive and unfriendly — a racial stereotype that has long motivated anti-pit bull movements:", "Why do the things defending pitbulls look like the same things that defend blacks? [...]", "That's because most pitbull owners are n*****s. [...]", "Pitbulls are fine unless they are raised by n*****s. [...]", "Kill kill kill all n****r dogs and preferably all n*****s. [...]", "While we cannot speak to the broader claim that some terrible human beings have adopted dogs for the purpose of putting them down, we can say with confidence that the current viral #PitbullDropOff trend on social media is a hoax orchestrated by anonymous hoaxsters using unrelated photographs, fake context, and a characteristic reliance on racism and misogyny. Don't feed the trolls.", "4chan.org.   \"Operation #PitbullDropoff Anonymous (ID: HObStxln) FC 05/13/18(Sun)19:04:12 No.171486373.\"\r\n    Accessed 14 May 2018.", "The Chive.   \"Puppies Make Me Happy (64 Photos).\"\r\n    6 February 2017.", "Mann, Jason.   “Top 10 Reasons Why You Can’t Trust Pit Bulls.”\r\n    Stubbydog.com.   2 December 2011.", "Romano, Aja.   “Meme Culture Allowed the Alt-Right’s White Supremacy to Spread Online.”\r\n    Vox.com.   11 January 2017.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]