["About this rating", "In November 2018, Reynoldsville, Pennsylvania, middle-schooler Maddox Hyde, who had been coping with cancer for eight years, learned from doctors he had only weeks or months to live.", "A report in the Centre Daily Times said Maddox was diagnosed with neuroblastoma, a type of tumor that starts in the central nervous system and spreads. The tumor doctors found on the back of his head was only the latest development in a saga that began in 2010, when he was in first grade. According to his mother, Kristi Potter, the first mass they found was on Maddox's right adrenal gland. Eighteen months after that went into remission, another was found on his right hip. Unfortunately, it was not to be the last:", "Potter said her son went into remission again on March 29, 2016, but that good news only lasted three days. He was paralyzed and diagnosed with Guillain-Barre syndrome and was in a pediatric intensive care unit on a ventilator for two weeks.", "He spent two months in the hospital’s rehab center, where he re-learned to walk, eat and write. With the exception of lingering weakness in his left foot, all of his abilities and feeling returned.", "That milieu lasted for 10 months before doctors found a small tumor on his spine. His treatments were working and the tumor was shrinking, but then it “exploded” after six weeks and grew drastically.", "Instead of subjecting him to further treatment, Maddox's family decided to bring him home to live out the time he has left in more comfort. Local television station WJAC reported on 25 November that the community had rallied behind Maddox and his family, holding fundraisers to help pay their medical bills, throwing a surprise Christmas party in Maddox's honor, and showering him with Christmas cards:", "\"It's just amazing. I could not ask for a better community to live in,\" Potter said.", "Most recently, his mother says it’s been a trend of Christmas cards: hundreds and hundreds of cards from people everywhere.", "\"It is really cool to see how many people are sending them,\" Maddox said.", "He says the cards feature pictures, stories and long messages. One retired officer gave him his prized possession, his patch he wore for over 20 years. Another card came with a bottle of sand from the beach. Each one of the hundreds of cards had something special. So many people sent cards that he got the same ones more than once.", "Maddox's friends and family launched a social-media campaign soliciting cards from everywhere:", "A young boy from my hometown has recently been told he has only weeks to live after battling cancer for about 8 years. His only wish is to receive Christmas cards from all over the world so please help show Maddox some love and let’s overwhelm him with wishes. #maddoxstrong ???? pic.twitter.com/i66soZ5L9X", "— Paul Butler (@_Paul_Butler_) November 27, 2018", "Maddox hoped to receive cards from people everywhere in the world. According to a family member, the response was \"overwhelming.\"", "Sadly, the same family member informed us that Maddox died in 2019 and that receiving cards is \"heartwarming but painful for the family.\" For this reason, we updated the rating to Outdated.", "Pallotto, Bret.   \"A Central Pa. 14-Year-Old Is Terminally Ill. Her's How You Can Help Brighten His Days.\"\r\n   Centre Daily Times.   23 November 2018.", "Wainwright, Alexis.   \"Dubois Student Battles Cancer, Receives Hundreds of Cards to Support Him.\"\r\n   WJAC-TV.   25 November 2018.", "The American Cancer Society.   \"What Is Neuroblastoma?\"\r\n    19 March 2018.", "Changed rating from True to Outdated and updated with information about Maddox Hyde's death.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]