["About this rating", "Cosmopolitan Magazine announced a new Snapchat channel called \"Cosmo After Dark\" that will feature stories about sex.", "This content will not be available to Snapchat users under the age of 18.", "This content will be sexual in nature, but labeling it \"pornography\" is inaccurate.", "In May 2018, the arrival of the a Snapchat channel called \"Cosmo After Dark\" from the classic women's magazine Cosmopolitan was a cause for concern among some parents who were worried that their children would unwittingly be exposed to adult content.", "The web site Protect Young Eyes published an article labeling the channel as \"porn,\" and claimed that this content would be available to Snapchat users as young as 13:", "SNAPCHAT INTRODUCES COSMO AFTER DARK (IT’S P*RN)", "[Warning – this blog post is R-rated but it’s necessary. The Discover section of Snapchat is easily accessible by kids with a new channel: Cosmo After Dark. Parents must know the truth.]", "On May 18, 2018, Snapchat introduced a new channel in its Discover section called, “Cosmo After Dark.” Using its own language, the channel “is an X-rated weekly edition that goes live every Friday at 6 p.m. and is exclusively dedicated to all things hot and h*rny.” And, there’s nothing parents can do to turn it off.", "[...]", "Maybe you’re a parent who thinks that the Cosmo articles above are appropriate for 13-year-olds. If that’s the case, then we will just have to disagree and this blog post isn’t for you.", "\"Cosmo After Dark\" is a real Snapchat channel, and the magazine does describe its content as \"X-rated.\" However, labeling this content as porn is not accurate.", "Cosmopolitan has been publishing stories about sex since the mid 1960s, and although one could argue (and some do argue) that the magazine's content has become more explicit over the years, there is a big difference between a frankly-written article about sex positions and a video demonstrating said positions.", "We perused the first issue of \"Cosmo After Dark\" and found that even their \"explicit\" content — the magazine, for instance, published an article called \"The 19 Best Sites to Binge-Watch Porn On\" — is (somewhat) censored:", "Furthermore, the \"Cosmo After Dark\" channel will only be available to users above the age of 18, not 13.", "Publishers on Snapchat are in control of their own content, but the social media service does have some content guidelines. Snapchat rolled out new age-gating tools in January 2017, which made it possible for outlets to restrict their content so that it is only viewable to Snapchatters of a certain age. The social network requires outlets publishing nudity or other obscene content to restrict their content so that those under 18 cannot view it at all.", "A representative for Snapchat told us that \"Cosmo After Dark\" is restricted to readers and viewers over 18. (Parents with young social media users can read more about how to set a user's birthday in Snapchat here.) There may be ways for enterprising young people to get around the restrictions — after all, there always are — but the channel does not show pornography, and it is not readily available or marketed to anyone under 18.", "Benjamin, Jennifer.   \"How Cosmo Changed the World.\"\r\n    Cosmo.   3 May 2007.", "Tullo, Danielle.   \"Introducing Cosmo After Dark, Our Sexy New Snapchat Channel.\"\r\n    Cosmo.   18 May 2018.", "McKenna, Chris.   \"Snapchat Introduces Cosmo After Dark (It's Porn).\"\r\n    Protect Young Eyes.   20 May 2018.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]