["By Saranac Hale Spencer", "Posted on February 26, 2020", "A meme circulating on Facebook claims without evidence that Hillary Clinton has made $95.5 million since she ran for president in 2016, and falsely implies that she and former President Barack Obama enriched themselves by “steal[ing] your money.”", "A meme circulating on Facebook compares what it claims to be the net worth of President Donald Trump, former President Barack Obama, and former presidential candidate Hillary Clinton before and after they ran for president.", "But it uses unsubstantiated numbers for Trump and Obama, and gets them wrong for Clinton.", "Here’s how the meme assesses their wealth:", "It concludes, “But Trump is the guy trying to steal your money?”", "These claims have been around, in some version, since at least 2017.", "The oldest version we could find was posted in November 2017 on a Facebook page called President Trump Fans. That post used almost the same numbers; the only difference is that it pegged Trump at $3.5 billion after the election. It said that the numbers represented the fortunes of the “Trumps,” the “Obamas,” and the “Clintons.”", "In October 2018, conservative activist Charlie Kirk tweeted the same numbers used in the current meme, attributing them to the “Trump family,” “Obama,” and “Clinton.” He didn’t specify which Clinton he meant, Hillary or former President Bill Clinton. Then, in June 2019, the Facebook page for TrendingPolitics.com — which describes itself as “pro-Trump” — shared the version of the claim that’s currently circulating on Facebook. It paired the numbers with a picture of each politician and used a photo of Hillary Clinton.", "The latest version of the claim makes it appear as if Clinton has earned more than $95.5 million since she was the Democratic nominee for president in 2016. Actually, she and the former president had an adjusted gross income of $10.6 million in 2015, according to the tax return that she made public during the campaign. The financial disclosure she filed — which requires public officials and presidential candidates estimate the value of their assets in wide ranges — showed that the Clintons had between $10 million and $50 million in the bank or invested in an index fund in 2015.", "The claim that she was worth $480,000 is likely a product of confusion from the original claim, which may have been referring to Bill Clinton’s net worth before he ran for president in 1992. Reports at the time put the couple’s net worth below $1 million.", "When he left office in 2001, however, Bill and Hillary Clinton were saddled with legal debt amassed during the scandal investigations and impeachment proceedings. They grew their wealth, largely, through lucrative speaking engagements and book deals over the last two decades.", "It’s hard to tell how much money they have now, since neither Clinton is in public office and they don’t have to disclose their assets. But it’s likely that they have more than they did in 2016, given the release of Hillary Clinton’s 2017 book, “What Happened,” which broke sales records at the time.", "That speaks to the larger implication of this meme. By asking, “But Trump is the guy trying to steal your money?” the meme suggests that Obama and Clinton enriched themselves at taxpayer expense. But in both cases the bulk of the money came from their work in the private sector.", "For Barack and Michelle Obama, $15.6 million of the $20.5 million that they earned between 2005 and 2016 came from books written by the former president, according to a 2017 Forbes analysis. Two of the books, “The Audacity of Hope” and “Dreams from My Father,” were published before he became president, and a third book for children was published in 2010. Just over $3 million came from the presidential salary for eight years.", "Since leaving the White House, Barack and Michelle Obama have signed onto high-profile deals, including one reportedly worth $60 million for a pair of memoirs. The first, written by Michelle Obama, was released in November 2018 and became the best-selling book that year. The couple also signed a television series and movie production deal with Netflix, but the amount they’ll make from it isn’t clear. One early report described it as a “high 8-figure deal.”", "Like the Clintons, the Obamas’ net worth is difficult to calculate since they are no longer required to file financial disclosures.", "As for Trump’s net worth, the meme is generally on target.", "Analyses from Forbes and Bloomberg in 2019 estimated his net worth at about $3 billion, and a Forbes investigation from 2016 put Trump’s net worth at about $4.5 billion in 2015.", "The president has faced criticism, though, for breaking with the long-standing tradition that presidential candidates release their tax returns. Trump refused to do so during the 2016 election and has continued to keep them private since then. He does file annual financial disclosure reports, as required by law. But the Center for Responsive Politics has reported that the president’s disclosure “doesn’t give a full picture of Trump’s income, as it lists assets and debts — along with some income amounts — in wide ranges.”", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "Overby, Peter. “The Clintons Wrote The Book On How Politicians Climb Out Of Middle Class.” NPR. 17 Aug 2016.", "Alexander, Dan. “How Barack Obama Has Made $20 Million Since Arriving In Washington.” Forbes. 20 Jan 2017.", "Evers-Hillstrom, Karl. “Trump has reported earning an estimated $2.3 billion since announcing presidential run.” OpenSecrets.org. 16 May 2019.", "Forbes. “The Definitive Net Worth of Donald Trump.” Sep 2019.", "Nasiripour, Shahien and Caleb Melby. “Trump’s Net Worth Rises to $3 Billion Despite Business Setbacks.” Bloomberg. 12 Jun 2019.", "Robertson, Lori. “The President’s Tax Returns.” FactCheck.org. 9 Nov 2018.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]