["About this rating", "Consider this: In the 1940s, the average price of a gallon of gasoline was around $0.17, Chuck Yeager became the first person to break the sound barrier, and only 55 percent of households reported that they had indoor plumbing. While the 1940s might seem like quite a long time ago, and not the most technologically advanced, one scene in the 1946 holiday classic \"It's a Wonderful Life\" involving a swimming pool and a basketball court perhaps still stands out today.", "An early scene in the Frank Capra-directed film depicts a school dance at Bedford Falls High School in 1928. George Bailey (Jimmy Stewart) and Mary Hatch (Donna Reed) dance together as the retractable basketball court slowly opens above a hidden swimming pool. (The character who opened the floor, Freddie Othello, was portrayed by Carl Switzer. Switzer was best known as the character Alfalfa in \"Our Gang,\" also known as \"The Little Rascals.\") The dancing pair don't notice that the floor is opening, and believe that the crowd is cheering them on as they dance. As they take a few steps back, they fall in.", "The scene ends with George and Mary continuing to dance in the swimming pool, followed by many others jumping in as well. We were unable to find an exact date when the scene was filmed.", "In late 2020, nearly 75 years later, that same high school gymnasium was still around.", "This YouTube video was published by the Los Angeles Times in 2014:", "In 2014, Eric Sondheimer reported on the 1939-built marvel for the Times:", "Late Friday night, I got to see unfold one of Southern California’s technological marvels: the Beverly Hills gym/pool.", "Built in 1939, there’s a 25-yard pool under the gym floor. You put in a key, turn it and the gym floor parts in the middle, unveiling the pool. It served as a location for a scene from the 1946 movie “It’s a Wonderful Life.”", "The fact it still works and looks so cool slowly parting 75 years later is amazing.", "In recent years, Twitter users have posted about the retractable swimming pool during NBC's annual Christmas Eve airing of \"It's a Wonderful Life.\"", "California's Beverly Hills High School was the location where the scene was shot. The \"Swim Gym,\" as it's known today, was briefly shown in a local news report in the 1980s. It was also featured as a local landmark in another video from the Beverly Hills Historical Society:", "In 2016, Robbins Sports Surfaces posted a YouTube video that said \"a new Robbins floor was recently installed at the Beverly Hills High School Swim Gym by Pacific Floor Co.\" The video showed one side of the basketball court floor closing:", "We reached out to find out more regarding how the whole retractable court works in terms of where the basketball court goes when the swimming pool is being used. If we hear back, we will update our story.", "For further reading about the 1940s, we recommend our previously reporting on an interesting detail in the 1947 children's classic book, \"Goodnight Moon.\"", "Update: On Dec. 29, after receiving reader emails we updated this story to remove a reference of filming dates. We also added that the character who opened the retractable floor was portrayed by Carl Switzer, the same actor who played Alfalfa on \"Our Gang,\" also known as \"The Little Rascals.\"", "Jordan Liles is a Senior Reporter who has been with Snopes since 2016.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]