["The photo has been shared more than 200 times since being published here on Facebook on March 24, 2020.", "The post’s caption reads: “Over 200 doctor's and nurse's dead in Italy / God protect the world from this virus / #letsprayforitaly”.", "Below is a screenshot of the misleading post:", "The same photo was shared with similar claims on Facebook here, here, here, here and here.", "Italy, one of the countries hardest hit by COVID-19, has lost more than 19,000 lives to the disease as of April 13, 2020, according to the World Health Organization.", "However, the claim about the photo showing dead healthcare workers is false; the image is in fact a still from a TV series.", "Reverse image and keyword searches found the same photo published on Getty Images here on December 5, 2006. The image was titled \"Grey's Anatomy\", an American medical drama series.", "Below is a screenshot of the Getty Images photo:", "The caption of the photo states: “UNITED STATES - DECEMBER 05: GREY'S ANATOMY - ‘Wishin' and Hopin' - The race for the Chief's position is on, as the doctors compete for Richard's affections, a surgical patient endangers the lives of those around her, and Meredith's Alzheimer's-stricken mother, Ellis, experiences a change in her medical condition, on ‘Grey's Anatomy,’ THURSDAY, FEBRUARY 1 (9:00-10:01 p.m., ET) on the Walt Disney Television via Getty Images Television Network. (Photo by Michael Desmond/Walt Disney Television via Getty Images)”.", "Below is a screenshot comparison of the photo in the misleading posts (L) and the Getty Images photo (R):", "The photo was also published alongside an accurate description in this 2015 report by entertainment news site Hollywood.com, which lists the “most insane medical cases” portrayed on the TV show.", "The misleading claim was also debunked by Africa Check.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]