["“In the 8 years prior to President Trump’s inauguration, prescription drug prices increased by an average of 3.6% per year,” claims one such post, versions of which have been shared more than 2.8 million times since October 16, 2020.", "“Fast forward to today, and prescription drug prices have seen year-over-year declines in nine of the last 10 months, with a 1.1% drop as of the most recent month. In June 2019, the United States saw the largest single-year drop (2.0% year-over-year decline) in prescription drug prices since 1967,” the post concludes.", "The post cites “@REDPILLFAIRY” as the source of this information. The Red Pill Fairy website describes itself as a “go-to resource for right-wing content the mainstream liberal media refuses to publish”, and the graphic in the post appears on this list of “amazing things our President has done for our country”.", "A Google search of the prescription drug prices post shows it is a word for word copy of this statement on the White House website, credited to President Trump’s Council of Economic Advisers (CEA).", "The statement points to this October 2019 paper by the CEA which reviewed the strengths and limitations of “different measures of prescription drug price changes”, concluding that the “Bureau of Labor Statistics’ Consumer Price Index’s Prescription Drug Index (CPI-Rx) is the best available summary measure of the price changes of prescription drugs.”", "But the CPI-Rx used by the US president’s advisors is only one measure of prescription drug prices and “is a poor indicator of the cost of prescription drugs to patients, especially the large majority who have insurance, because it reflects only list prices at pharmacies, not the prices that insurers negotiate for their enrollees,” Paul Ginsburg, director of the University of Southern California and Brookings Institute Schaeffer Initiative for Health Policy, told AFP by email.", "Stacie Dusetzina, associate professor of health policy at Vanderbilt University's School of Medicine, agreed. “One key problem with these measures is that they often exclude specialty drugs, whose prices are set higher and higher at the time they come on to the market. Some also combine spending on brands and generics, which also doesn’t provide a full picture of where prices are increasing,” she said.", "“Drug prices are not declining, but drug price increases are slowing (prices are still rising, but not as fast),” Dusetzina added.", "Price changes", "Using the limited scope of the CPI-Rx data, Trump has made similar claims to those in the post, stating that drug prices had gone down “for the first time in over 50 years” on July 17, 2019 and “first time in 53 years” on July 22, 2019. As recently as November 20, 2020, when discussing an executive order about healthcare, he claimed that it was the “first time in 51 years.”", "Juliette Cubanski, deputy director of the Program on Medicare Policy at the Kaiser Family Foundation (KFF) said by email: “For a short period of time, prices did drop somewhat based on this measure (CPI-Rx), but more recently they have actually increased.”", "The claim that drug prices went down under Trump is supported by the CPI-Rx but not by other data sources. The claim that drug prices have gone down for the first time in over 50 years, or since 1967, is false.", "The American Society of Health-System Pharmacists publishes an annual report of prescription drug expenditure across all sectors. The report has recorded an increase in prescription drug prices since the start of Trump’s presidency.", "In 2017, Trump’s first year in office, it found a “3.2 percent increase in prices of existing agents”. In 2018 there was a “2.9 percent growth in spending due to increased drug prices” and 2019, the latest available data, shows that “price change increased expenditure by 1.6 percent,” Glen Schumock, Dean of the University of Illinois Chicago’s College of Pharmacy, and the report’s author, told AFP by email.", "According to data from the government’s Centers for Medicare and Medicaid Services (CMS), which includes information on more drug spending than the CPI-Rx, it is broadly accurate to say that prescription drug expenditure has increased since 1960.", "“Out of pocket” expenditure, not covered by insurance, on prescription drugs increased from 1960 to 1993, dropped from 1993 to 1995, and increased again until 2007. From 2008 to 2016, the “eight years” referred to in the post, out of pocket expenditures went down by 4.3 percent on average.", "The CMS data also shows that from start of 2017 to the end of 2018, the “out of pocket” expenditures in prescription drugs increased by 0.6 percent, contrary to the president’s claim.", "Individuals will have hugely varied experiences of drug prices depending on which ones they use “because drug prices are dominated by the setting of a very high price when the drug is first introduced and the producer has an effective monopoly, and a sharp price reduction when the patent expires and generic versions are introduced,” Barry Bosworth, senior fellow of the Brookings Institute’s Economic Studies Program, told AFP by email.", "Americans also pay different amounts for prescriptions as they are covered by a patchwork of insurance programs including private plans, employer sponsored plans, Medicare, a federal health insurance program for people over 65, and Medicaid, the single largest source of health coverage, serving 76.5 million Americans.", "The Affordable Care Act (ACA), which came into force in 2010, created the opportunity for states to expand Medicaid to cover nearly all low-income Americans under age 65.", "But the Trump administration argued before the Supreme Court that the ACA, also known as Obamacare, should be struck down as unconstitutional.", "“We can expect that drug prices would go up, rather than down if the Affordable Care Act were struck down in court, and the Trump administration has not yet released a plan for what they would do in the event of that occurrence,” Rachel Sachs, Associate Professor at Washington University School of Law, said by phone.", "And according to the Brookings Institute’s Ginsburg, “while President Trump had talked a lot about lowering drug prices, he has not succeeded in getting legislation passed.”", "“So whatever trends we see, likely reflect developments other than Trump policies. For example, if a patent expires and generic versions of the drug are introduced with lower prices, the CPI appropriately reflects that as a price decrease. But a President has no business claiming credit for the price decrease,” Ginsburg said.", "AFP Fact Check also examined Trump’s misleading claims about the impact of his executive orders on insulin prices.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]