["Gov. Andrew M. Cuomo wants to give $10 million to Buffalo’s Say Yes to Education program as part of his proposed state budget.", "The money would come from a proposed $500 million second phase of the Buffalo Billion program.", "The Say Yes program provides college scholarships to public and charter school graduates in Buffalo. The program has helped boost graduation rates in the city’s school district, Buffalo Mayor Byron Brown said at a budget hearing in Albany.", "\"Since the program has been in place in our community, high school graduation rates, which sadly were abysmally low in Buffalo hovering around 48 percent are now up to 64 percent,\" Brown said at the hearing.", "Is Brown right about the district’s graduation rates?", "Say Yes to Education", "The Say Yes program was launched in Buffalo in December 2011. Buffalo became the second city with the program, following Syracuse. The first graduates eligible for the program graduated in 2013.", "The program opened with $15 million in funding and has since raised $25 million from private donors.", "Graduation rates", "The city school district recorded a 46.8 percent four-year graduation rate through June of the 2011-2012 school year, according to the New York state Education Department. The rate increased to 53.4 percent in 2013, the first year graduates were eligible for the program.", "The graduation rate then dropped to 52.8 percent in 2014, but climbed to 58.4 percent in 2015.", "The district had a 61.7 percent graduation rate through June 2016, the state Education Department said Friday. The rate is 64 percent when August graduates are included. That information was not publicly available when Brown made his claim.", "Our ruling", "Buffalo Mayor Byron Brown said graduation rates, once \"around 48 percent are now up to 64 percent\" in Buffalo’s school district since the Say Yes program began in Buffalo.", "Brown is right that graduation rates have improved since the program was first offered to graduates in 2013. Close to 47 percent graduated the year before the Say Yes program was first offered, and the graduation rate through August 2016 is 64 percent according to data released today.", "We rate his claim as True.", "https://www.sharethefacts.co/share/ad3583b7-e18a-4a1b-8d6d-9b1bf51f69a9", "Phone conversation with Michael DeGeorge from Mayor Byron Brown’s office", "Phone conversation with Dr. Genelle Morris, Chief Information Officer for the Buffalo City School District", "Phone and email conversation with Jonathan Burman from the New York state Education Department", "Local Governments State Budget Hearing in Albany, Jan. 30, 2017", "Data on the Buffalo City School District from the New York state Education Department, Accessed Feb. 3, 2017", "Say Yes to Education Buffalo Information from its website, Accessed Feb. 2, 2017", "\"What's in the Buffalo Billion, Part 2?\", The Buffalo News, Jan. 9, 2017, Accessed Feb. 3, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]