["This Facebook post, published on August 15, 2019, and shared more than 900 times, suggests that politicians who are sworn into federal office on the Koran are ineligible to sit in parliament.", "The meme reads: “6 MUSLIMS ALL IN AUSTRALIAN FEDERAL POLITICS WHO HAVE ALL SWORN ON THE QUARAN (sic) ON ENTERING PARLIAMENT. LET THAT SINK IN. THIS GOES AGAINST SECTION 44 OF THE CONSTITUTION. NOT TO MENTION ALL THE MUSLIMS IN THE COUNCIL SEATS AROUND AUSTRALIA.”", "Below is a screenshot of the post:", "The Australian Constitution requires those elected to the Senate and the House of Representatives to make an oath or affirmation of their allegiance before the governor-general, or some person authorised by the governor-general.", "A research paper by the Parliament of Australia notes here that the oath or affirmation are both equally legally binding. The oath ends in the phrase “So help me God!”, while the affirmation does not.", "The Australian Attorney-General’s Department has advised here that while it has been “common practice” for the oath of allegiance to be made on the Bible, it is not required.", "The advice reads: “The oath of allegiance need not necessarily be made on the authorised version of the Bible, although this has been the common practice. A Member may recite the oath while holding another form of Christian holy book, or, in respect of a non-Christian faith, a book or work of such a nature. The essential requirement is that every Member taking an oath should take it in a manner which affects his or her conscience regardless of whether a holy book is used or not.”", "Labor politician Ed Husic was the first MP in Australia to be sworn in with the Koran in 2010, as reported by The Australian newspaper here.", "Section 44 of the constitution states that any person who “is under any acknowledgement of allegiance, obedience, or adherence to a foreign power, or is a subject or a citizen or entitled to the rights or privileges of a subject or citizen of a foreign power ... shall be incapable of being chosen or of sitting as a senator or a member of the House of Representatives.”", "In an earlier AFP Fact Check here, the Attorney-General’s Department said that Section 44 of the constitution does not prohibit members of a religion from holding political office.", "The department also directed AFP to Section 116 of the Australian Constitution, which states: “The Commonwealth shall not make any law for establishing any religion, or for imposing any religious observance, or for prohibiting the free exercise of any religion, and no religious test shall be required as a qualification for any office or public trust under the Commonwealth.”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]