["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "MSNBC host Ed Schultz and conservative talk show host Dana Loesch debated the merits of the Affordable Care Act.", "Conservative talk show host Dana Loesch gamely agreed to debate Obamacare last week with liberal pundit Ed Schultz on Schultz’s program on MSNBC. Unfortunately, what emerged was the verbal equivalent of mixed martial arts as one would interrupt the other, and the preferred rhetorical device seemed to be talking louder and louder. (We also checked Schultz's claim about 10.3 million people benefiting from Obamacare.)", "In the course of the melee, Loesch delivered a salient criticism about the Affordable Care Act.", "\"4.7 million people have lost their insurance in 32 states,\" Loesch said.", "We reached out to Loesch to find the source of that claim and did not hear back. However, it matches a list compiled by the Associated Press in December 2013. It represents a tally from AP staffers and calculates a low-end figure of how many Americans received insurance cancellation notifications. (Not every state was able to provide a figure, hence Loesch isolating on 32 states.)", "You likely remember stories about the cancellation notices, which were the result of individual insurance plans not meeting the minimum standards of the new health care law. PolitiFact’s 2013 Lie of the Year was a claim by President Barack Obama that \"If you like your health care plan, you can keep it.\"", "Since that chaotic time, however, some clearer data has emerged. While the AP said that millions of people had received cancellation letters, there are reasons to doubt the numbers in certain states. For example, the list said 333,000 notices went out to Blue Cross/Blue Shield customers in Florida. But as reported by PolitiFact Florida, a company spokesman said it mailed only 44,000 cancellations letters.", "The AP said 290,000 cancellations letters were sent in Washington state. A few weeks later, the state’s insurance commissioner called that \"inaccurate.\"", "Analysts at the Urban Institute explored the discrepancies in a survey conducted the same month as the AP published its list. When they asked people with individual insurance, they found that about 20 percent said the plan they had in 2013 would no longer be offered.", "Based on this survey, the analysts estimated that about 2.6 million people had lost their existing plans due to the minimum standards set by Obamacare.", "But the institute analysts also noted that a great deal of churning always takes place in the individual market. They found that less than 20 percent of the customers ever kept a plan for more than two years. This fits with the experience of another health care researcher, Christine Eibner with the RAND Corporation.", "\"It appears that the number of people that lost coverage from 2013 to 2014 is similar or less than the number of people who lost coverage in previous years,\" Eibner told PunditFact.", "So, while the Affordable Care Act’s standards played a role, some people would have changed, dropped or altered coverage anyway.", "Moreover, the AP figure fails to factor in that due to the outcry in November 2013, Obama gave states the option to allow people to keep their existing plans, if insurers agreed.", "In Florida, the 44,000 people who did get a cancellation letter later received a second one that said they could keep those policies for another year, if they wanted.", "In fact, the key problem with Loesch’s statement is that she said these people \"have lost their insurance,\" as if none of them replaced one plan with another.", "A study published by RAND in April 2014 painted a very different picture. Of an estimated 9.4 million people with individual insurance, fewer than 1 million ended up without any coverage at all. Over half of the original group bought another policy in the individual market. About 2 million took coverage offered through an employer, and a bit under a million found a plan through one of the government’s online insurance marketplaces.", "Finally, we should note that while some people have lost insurance since most of the main elements of Obamacare took effect, the net impact has been a boost in the ranks of the insured. An estimated 10.3 million more people have insurance today than did right before October 2013.", "Our ruling", "Loesch said that 4.7 million people have lost their health insurance due to Obamacare. That number matches one cited by the Associated Press based on preliminary estimates and incomplete data. The best estimate from independent researchers is that perhaps 2.6 million people received notices that their health care insurance policies were being canceled.", "However, Loesch spoke as if these people, whatever their number, did not find replacement coverage. In reality, fewer than 1 million people who had been part of the individual insurance market ended up with no coverage at all. Given the constant churn in that market, it is unlikely that the Affordable Care Act caused all of them to be without health insurance.", "Loesch’s number is off, both in terms of the cancellations and what people did afterward. Still, the new law did hurt some people.", "We rate the claim Mostly False.", "MSNBC, Radical right eye health care repeal, Nov. 13, 2014", "Associated Press, Policy notifications and current status, by state, Dec. 26, 2013", "PolitiFact, Rick Scott's political committee says Obamacare has led to 300,000 health plans canceled, March 25, 2014", "Health Affairs, How Many Nongroup Policies Were Canceled? Estimates From December 2013, March 3, 2014", "Washington State Office of the Insurance Commissioner, Individual health market projected to top 300,000 by March 31, Feb. 13, 2014", "RAND Corp., Changes in Health Insurance  Enrollment Since 2013, April 7, 2014", "Kaiser Family Foundation, Health Tracking Poll, December 2013", "Factcheck.org, ‘Millions’ Lost Insurance, April 11, 2014", "RAND Corp., Changes in Health Insurance  Enrollment Since 2013, April 7, 2014", "Email interview, Christine Eibner, senior economist, RAND Corp., Nov. 17, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]