["About this rating", "A disturbing video of a young woman being burned alive is frequently shared online attached to the claim that the victim was killed for attending a Christian prayer service.", "We don't link to this decidedly gruesome footage here, but a screenshot of one of the social media posts promulgating this claim looks like this:", "Hindu girl burnt alive in Madhya Pradesh because she attended a Prayer meeting in a Christian Church. Please send this around So that the whole world may see India; The real Hell on the planet Earth Just see the ugliest Face Of \"Incredible India”", "Please Please Please Please Share this video as much as you Can Don't Stop Sending Let The whole World Know What's happening around the World*", "This video does document a young woman's horrific death, but the back story attached is a work of fiction.", "The event depicted in the video took place in Guatemala in May 2015 and can be  viewed via the official YouTube channel of the .Al Jazeera news channel.", "The exact details of what was captured in the video are unclear, but local news outlets reported at the time that the 16-year-old woman was killed for her alleged involvement in the death of a taxi driver. It's still uncertain if she had a hand in the death of 68-year-old Carlos Enrique González Noriega, or if she just happened to be at the wrong place at the wrong time.", "Two other people suspected of killing the taxi driver escaped, but this young woman was caught by an angry mob, as desccribed in CNN report about the incident:", "A large crowd stands by as a teenage girl -- beaten and bloodied -- writhes on the ground, her body engulfed in flames.", "\"Add gasoline,\" someone shouts.", "The shocking scene from a Guatemalan village went viral online and has spurred a debate over what some describe as vigilante justice in the Central American country.", "Citing witnesses in the village of Rio Bravo, local media reported that the girl was beaten and burned to death for her alleged involvement in the killing of a taxi driver there earlier this month.", "Police told CNN they haven't verified the authenticity of the video. But they said they are investigating the circumstances leading up to the death of a 16-year-old girl who was set on fire in Rio Bravo, a small village two hours west of Guatemala's capital in the state of Suchitepequez.", "La Gaceta.   \"Quemaron Viva a una Adolescente en Guatemala.\"\r\n    23 May 2015.", "Bolton, Doug.   \"16-Year-Old Girl Beaten and Burned Alive by Lynch Mob in Rio Bravo, Guatemala.\"\r\n    The Independent.   23 May 2015.", "Ramos, Annie Rose.   \"Video of Mob Burning Teen Alive in Guatemala Spurs Outrage.\"\r\n    CNN.   29 May 2015.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]