["About this rating", "A woman set her husband on fire in 2014 for molesting their daughter.", "The photographs typically associated with this story depict neither the incident nor the persons involved in it.", "In July 2014, a woman named Tatanysha Hedman set her husband on fire after she allegedly discovered that he had been molesting their 7-year-old daughter:", "The man who was badly burned when his wife allegedly set him on fire is now facing sex crime charges.", "Renton police earlier said Vincent Phillips, 52, had been doused in gasoline July 17 while he slept in bed by his wife, Tatanysha Hedman. Investigators said Hedman then set her husband on fire.", "Phillips then fled their apartment and drove to a Skyway convenience store screaming \"I'm on fire!\" Customers looked on as Vincent Phillips dropped to his knees, clearly in agony and begging, \"Help me!\"", "While the above-quoted story was real, it is frequently circulated on social media along with unrelated images. For instance, when the disreputable web site TMZ Uncut (no affiliation to the gossip site TMZ) rehashed this story in July 2016, they included an unrelated mugshot and photograph of a man ablaze:", "We have not been able to identify the woman pictured in the image above, but she is not Tatanysha Hedman. That picture has been circulating online since at least 2008 and is frequently included in \"crazy mugshot\" galleries. The real Tatanysha Hedman looks like this:", "The photograph of the man on fire also came from an unrelated event. That image was taken in 2009 and depicts a Romanian man who set himself on fire in some form of protest.", "So it's true that a woman set her husband on fire after she supposedly discovered that he had been molesting their daughter. However, the images frequently associated with this story come from two different and unrelated events.", "https://komonews.com/news/local/police-man-set-on-fire-by-wife-now-faces-sex-crime-charges-11-21-2015", "KOMO-TV.   \"Police: Man Set on Fire by Wife Now Faces Sex Crime Charges.\"\r\n    31 July 2014.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]