["About this rating", "During the wave of demonstrations that swept the U.S. after the May 2020 police-custody death of George Floyd in Minneapolis, critics -- including President Trump -- contended that some of the protesters were actually \"professional anarchists, or agents in the employ of Antifa, or were otherwise paid provocateurs engaged to stir up trouble.", "One of the related tropes that went along with such claims was the notion that anti-fascists, collectively known as \"antifa,\" were not loose, local autonomous collections of individuals, but a centrally organized and well funded \"terrorist organization.\"  In that vein, many social media users reposted supposed proof of Antifa's status as such in the form of a picture of an alleged Antifa-issued credit/debit card:", "This ANTIFAmily card was just a spoof, however -- a prop sold on the German-language website HoGeSatzbau.de (Hooligans Gegen Satzbau):", "The \"About\" section for the Facebook page of Hooligans Gegen Satzbau warns readers that \"This page may contain traces of satire and irony\" and states that:", "\"Hooligans Gegen Satzbau ™\" is a site that employs the stylistic means irony and satire. We present right-wing clichés that have been exaggerated in style and tone. The satirical character of our material is often only evident from reading the text (which can be misleading for non-German-speaking readers -- such as the Facebook team) and from the overall context of our site, which is a generally human-friendly environment. We believe that satire and humor are one good way (out of many) to tackle the subject of (everyday) racism ...", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]