["About this rating", "In late July 2020, readers shared a 2016 blog post with the headline, \"Did Adolf Hitler Really Invent the Sex Doll?\" The post prompted many curious readers to inquire as to whether the leader of Germany's Nazi Party did in fact invent inflatable sex dolls, even though the article itself didn't actually say that.", "The article was posted to a website called The 13th Floor, a horror-genre blog which focuses on stories that are creepy and macabre in nature. The 13th Floor post declared that \"The Borghild Project was (supposedly) a super-secret attempt to stop the spread of syphilis by providing Nazi soldiers with inflatable sex dolls. That's right: Hitler invented the blow-up doll!\"", "However, the writer also acknowledged that the Borghild Project was a hoax: \"Sadly, the evidence in support of this having actually happened is sketchy, so it probably isn't a true story. But 'Hitler invented the sex doll' is such an awesome idea, we should pretend it happened anyway. I mean, what's Hitler gonna do about it now, right?\"", "The hoax appears to have originated with an undated post by an alleged journalist named Norbert Lenz, who hasn't published anything else. That article, entitled \"The Borghild-project -- a discreet matter of the III. Reich,\" alleged that the German Hygiene Museum in Dresden, Germany, created the dolls, which were destroyed in the Allied bombing of that city in 1945.", "We sent an email the museum, which chronicles the history of medicine, asking about the hoax but have yet to receive a response. We'll update this article if we do.", "Laurie Marhoefer, an associate professor of history at the University of Washington, told us in an email that the hoax is built around \"very real concerns [Heinrich] Himmler expressed about German men, particularly soldiers and SS men, being able to express their heterosexual sex drives, and also the syphilis prevention measures that the Nazi State took, such as regulated brothels. A lot of governments at the time did something similar. Sex dolls, however, is a hoax.\"", "Elizabeth Heineman, a professor of history at the University of Iowa and author of the book \"Before Porn Was Legal,\" told us there's no evidence inflatable sex dolls were even available during the World War II era.", "\"The [erotica] customers were overwhelmingly veterans, and the industry had an astonishingly wide array of products on offer,\" Heineman told us by email. Catalogs for such items, she pointed out, \"were sometimes over 150 pages long by the mid-1950s,\" but the items listed among those pages did not include inflatable sex dolls.", "\"It's hard to imagine that if sex dolls had existed — if men had memories of them, or if they'd even heard rumors and now wanted to see one since they'd returned to civilian life — they wouldn't have shown up in the erotica catalogs of the 1950s,\" Heineman continued. But, she added, \"that's not proof they hadn't existed during the war. It's just to say that they're not showing up in a place where one would have expected to see them.\"", "Nonetheless, there is no evidence that Hitler invented the inflatable sex doll, and claims that he did appear to be an urban legend. We therefore rate this claim \"False.\"", "Johnson, Stephen. \"Did Adolf Hitler Really Invent the Sex Doll?\"   The 13th Floor. 6 December 2016.", "Lenz, Norbert.   \"The Borghild-Project – A Discreet Matter of the Third Reich.\"     Borghild.de.   Accessed 22 July 2020.", "Beck, Julie. \"A (Straight, Male) History of Sex Dolls.\"   The Atlantic. 6 August 2014.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]