["The photo was shared this a Facebook post here on November 7, 2019.", "The post has been shared more than 19,000 times.", "Below is a screenshot of the misleading post:", "The post’s caption states: “This is the face of an ant under an electron microscope.”", "The same photo was published with a similar claim on Facebook here and here and on Twitter here and here.", "The claim is misleading; the photographer told AFP that he did not use an electron microscope to take the photo.", "A reverse image search on Google for the image in the misleading posts found the original photo published here on January 22, 2018 on the Instagram account for Indonesia-based photographer Abdul Latif.", "\"black ant\". #ant #macroart #macro_art_ind #macro_art #macro #macro_x #macrophotography #macronusantara #macroindonesia #top_macro #macroworld #macro_mood #macro_freaks #igmw_macro #macro_dimension #macroclique #macrobrilliance #macroeverywhere #macroeverything #macroshot #galerimakro #macro_art_syndicate #macroholic #macromerahputih #show_us_macro #kings_insects #macro_captures #macro_spotlight #macro_highlight #canonpamer", "A post shared by  Abdul Latif (@nanangptk) on Jan 22, 2018 at 6:29am PST", "Below is a screenshot of Latif’s post:", "Latif told AFP he did not use an electron microscope to take the photo, which he called “black ant” in January 2018.", "“The photo was not taken under an electron microscope but with a mirrorless camera and an additional lens so that it gets the desired magnification,” he said via email on January 1, 2020.", "“I took the photo using a Canon EOS M3 camera with EF-M 55-200 MM lens, and the addition of Raynox DCR-250 lens at the tip to get the maximum focus distance to the subject.", "\"The ants are about 10-15mm in length and about 2-3mm in size for the head.\"", "Latif added that this stacking of lenses was a technique typical to macrophotography.", "“I used the stacking technique to get a wide enough depth of field… so that the details are more visible. This photo is macrophotography.\"", "The Merriam-Webster dictionary defines macrophotography as “the making of photographs in which the object is either unmagnified or slightly magnified up to a limit often of about 10 diameters”.", "Below is a screenshot comparison of the image in the misleading Facebook post (L) and Latif’s Instagram post (R):", "Latif also shared a side view macro photo he took of the same ant here.", "\"Black Ant\". #ant #macroart #macro_art_ind #macro_art #macro #macro_x #macrophotography #macronusantara #macroindonesia #top_macro #macroworld #macro_mood #macro_freaks #igmw_macro #macro_dimension #macroclique #macrobrilliance #macroeverywhere #macroeverything #macroshot #galerimakro #macro_art_syndicate #macroholic #macromerahputih #show_us_macro #kings_insects #macro_captures #macro_spotlight #macro_highlight #canonpamer", "A post shared by  Abdul Latif (@nanangptk) on Jan 25, 2018 at 4:50am PST", "The same misleading claim was also debunked here by fact check Twitter account HoaxEye on November 12, 2019. The tweet states: \"That’s not an electron microscope image. Macro photo of ant by Abdul Latif. Instagram source: https://instagram.com/p/BeQVDqjgQ2s/\".", "That’s not an electron microscope image. Macro photo of ant by Abdul Latif. Instagram source: https://t.co/BMUbuPKVJC https://t.co/NlFuIf2DVl", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]