["About this rating", "In 1979, a group of Iranian students stormed the U.S. embassy in Tehran, taking dozens of hostages and holding 52 Americans in a 444-day standoff in what became widely known as the Iranian hostage crisis. The incident came amid the Iranian revolution and overthrow of the U.S.-backed Shah of Iran.", "That standoff bears a relationship with yet another international crisis, this one in the year 2020: On Jan. 3, 2020, an American drone killed Qassem Soleimani, major general of the Iranian Revolutionary Guard Corps, described as the Iranian government's second-in-command. When Iran threatened to retaliate, U.S. President Donald Trump took to Twitter and lashed out, stating the U.S. was prepared to target 52 Iranian cultural sites.", "Trump later walked back this threat, acknowledging that doing so would be a war crime. But the 1979 hostage crisis was again raised in a viral meme circulating on social media that linked Soleimani to the event.\n\nWe found no evidence to support the claim that Soleimani is pictured. The image used in the meme was taken by an Associated Press photographer, though the caption names no one in the picture. It states, \"In this Nov. 8, 1979 file photo, one of the hostages held at the U.S. Embassy in Tehran, Iran is shown to the crowd by Iranian students. Forty years ago on Nov. 4, 1979, Iranian students overran guards to take over the U.S. Embassy in Tehran, starting a 444-day hostage crisis that transfixed America.\"", "Considering the intense coverage and lasting tensions between the U.S. and Iran over the hostage crisis, and Soleimani's high rank in the Iranian government, it seems unlikely that his purported involvement would have gone unnoticed. And we found no documentation, at least in English, that he was.", "The American embassy was taken by a group called the Muslim Student Followers of the Imam's Line, made up primarily of university students. Profiles of Soleimani's life, on the other hand, state that he did not attend college, instead working for the municipal water department in his native city of Kerman, before joining the Revolutionary Guard in 1979.", "A 2013 profile on Soleimani published by the New Yorker, for example, reports:", "In 1979, when Suleimani was twenty-two, the Shah fell to a popular uprising led by Ayatollah Ruhollah Khomeini in the name of Islam. Swept up in the fervor, Suleimani joined the Revolutionary Guard, a force established by Iran’s new clerical leadership to prevent the military from mounting a coup. Though he received little training—perhaps only a forty-five-day course—he advanced rapidly. As a young guardsman, Suleimani was dispatched to northwestern Iran, where he helped crush an uprising by ethnic Kurds.", "When the revolution was eighteen months old, Saddam Hussein sent the Iraqi Army sweeping across the border, hoping to take advantage of the internal chaos. Instead, the invasion solidified Khomeini’s leadership and unified the country in resistance, starting a brutal, entrenched war. Suleimani was sent to the front with a simple task, to supply water to the soldiers there, and he never left. “I entered the war on a fifteen-day mission, and ended up staying until the end,” he has said. A photograph from that time shows the young Suleimani dressed in green fatigues, with no insignia of rank, his black eyes focussed on a far horizon. “We were all young and wanted to serve the revolution,” he told an interviewer in 2005.", "A timeline published by public policy think tank American Enterprise Institute similarly puts Soleimani's work experience with the water utility immediately before his joining the military in 1979.", "In short, no evidence exists that Soleimani was the man pictured in the 1979 meme image, and it seems highly unlikely that Soleimani, who joined the military in 1979, was present during the Tehran embassy student take-over. We therefore rate this claim \"False.\"", "Filkins, Dexter. \"The Shadow Commander.\"\r\n  The New Yorker. 23 September 2013.", "Alfoneh, Ali. \"Brigadier General Qassem Suleimani: A Biography.\"\r\n  American Enterprise Institute. January 2011.", "Sahimi, Muhammad. \"The Hostage Crisis, 30 Years On.\"\r\n  PBS. 3 November 2009.", "Soufan, Ali. \"Qassem Soleimani and Iran’s Unique Regional Strategy.\"\r\n  Combating Terrorism Center at West Point. November 2018.", "Wu, Lawrence and Michelle Lanz. \"How The CIA Overthrew Iran's Democracy In 4 Days.\"\r\n  NPR. 7 February 2019.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]