["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "President Donald Trump stands firmly by the distortion that U.S. Rep. Alexandria Ocasio-Cortez, D-N.Y., called the United States and its people \"garbage.\"", "Trump used the line at a rally in North Carolina and repeated it at a July 19 event to mark the first time a man walked on the moon. On July 23, at a Washington meeting of conservative high school students, he dropped it again.", "\"She called our country and our people garbage,\" Trump said July 23.", "White House staffers Hogan Gidley and Stephen Miller stood by the line in interviews on Fox News, as did Fox News hosts Jeanine Pirro and Sean Hannity.", "This mangles what Ocasio-Cortez said.", "Here is the full context of her March 9, 2019, conversation at the South by Southwest Festival in which she used the word \"garbage.\" She had been asked why it took a while for candidates to push for a $15 minimum wage and goals such as the Green New Deal.", "Ocasio-Cortez answered with a story about a conversation with a Trump voter in her district.", "\"I'll never forget this one older woman who came to me and said, ‘You know, I always voted Democrat because growing up my dad told me that Democrats are the people that fight for the working man.’ \"", "\"And we stopped. And the working man and woman and people is the majority of this country, and so what I think we saw was both parties frankly abdicated their responsibility.", "\"No one was fighting for working people who were struggling, and so, as a result, it almost created this opportunity. And you can take all of this anger and direct it to a negative and destructive end that allows a small group of people to benefit a great amount.", "\"Or you have to take a really bold stance to bring it the other way and direct it to the possibility of what we can accomplish together.", "\"And I think the thing that is really hard for people to sometimes see, is that when we are on this path of a slow erosion and a slow move away from what we've always been, we'll be a hundred miles — you won't even realize that you've drifted a hundred miles. So when someone's talking about our core it's like, ‘Oh, this is radical.’ \"", "\"But this isn't radical. This is what we've always been.", "\"It's just that now we've strayed so far away from what has really made us powerful and just and good and equitable and productive. And so I think all of these things sound radical compared to where we are, but where we are is not a good thing. And this idea of like 10% better from garbage shouldn't be what we settle for.\"", "Fox News Sunday host Chris Wallace went back and forth with Miller over the full context of the quote.", "\"She's talking about policies,\" Wallace said.", "\"She's saying her starting point,\" Miller interjects.", "\"She's not talking about the country and the people,\" Wallace continued. \"Is garbage such a horrible word?\"", "\"She's saying that America in her view right now is garbage,\" Miller said.", "Wallace noted Trump himself used a similar turn of phrase to criticize President Barack Obama. In 2014, Trump tweeted, \"The United States, under President Obama, has truly become the ‘gang that couldn't shoot straight.’ Everything he touches turns to garbage!\"", "Trump asserted that Ocasio-Cortez called the country and its people \"garbage.\"", "In context, she was talking about standing up for working men and women, specifically Trump voters. At no point did she call them or the United States \"garbage.\" She used the word to describe a situation that left working people behind.", "Trump’s line turns her words upside down. We rate this claim False.", "Fox News, Trump addresses Turning Point USA's Teen Student Action Summit, July 23, 2019", "White House, President Trump Meeting with Apollo 11 Astronauts, July 19, 2019", "YouTube, AOC at SXSW, March 9, 2019", "Donald Trump, tweet, Oct. 21, 2014", "Fox News, Fox News Sunday, July 21, 2019", "Fox News, Justice With Judge Jeanine, July 20, 2019", "Fox News, Hannity, July 22, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]