["About this rating", "On 9 April 2017, political commentator, prolific Twitter user and former British member of Parliament Louise Mensch tweeted to her 224,000 followers that the Black Lives Matter protests in Ferguson, Missouri in 2014 were funded by the Russian government:", "That's because you, Russia, funded riots in Ferguson. See 0 hour I have your connections to Trump archived via Schiller and Scavino https://t.co/aTUDlCGkYi", "— Louise Mensch (@LouiseMensch) April 9, 2017", "The claim was soon picked up by others, and quickly started roaring around social media. Mensch did not offer any evidence for her claim nor an explanation as to why a \"riot\" would need any funding source. But there is no credible evidence for the claim; the unrest in Ferguson unfolded organically, and because it was well-documented by people with camera phones and the news media, it can be traced from the moment Ferguson police officer Darren Wilson shot and killed Michael Brown (an unarmed 18-year-old African-American man) to the marches and street violence that resulted.", "After Brown was shot on 9 August 2014, police left his body in the open on Canfield Drive for four hours. As documented by the New York Times after the fact, but filmed by residents constantly in real time, civil unrest in Ferguson started with outraged and grief-stricken neighbors gathering and seeing Brown, left facedown with blood and fluids streaming from his wounds:", "Neighbors were horrified by the gruesome scene: Mr. Brown, 18, face down in the middle of the street, blood streaming from his head. They ushered their children into rooms that faced away from Canfield Drive. They called friends and local news stations to tell them what had happened. They posted on Twitter and Facebook and recorded shaky cellphone videos that would soon make their way to the national news.", "Mr. Brown probably could not have been revived, and the time that his body lay in the street may ultimately have no bearing on the investigations into whether the shooting was justified. But local officials say that the image of Mr. Brown’s corpse in the open set the scene for what would become a combustible worldwide story of police tactics and race in America, and left some of the officials asking why.", "“The delay helped fuel the outrage,” said Patricia Bynes, a committeewoman in Ferguson. “It was very disrespectful to the community and the people who live there. It also sent the message from law enforcement that ‘we can do this to you any day, any time, in broad daylight, and there’s nothing you can do about it.’ ”", "In interviews conducted by the New York Times on 23 August 2014, Ferguson residents recounted how shaken they were by the image of the body out for hours in the open, and their outrage at what seemed like the callous responses by police who refused to cover Brown, despite people telling them that children were seeing the grotesque scene. Two residents in particular, interviewed by the Times, explained how Brown's body gradually drew a crowd, and how it resulted in the explosion of anger and outrage that resulted in weeks of protests in Ferguson.", "Jenetra Spears said she had just seen Brown the day before when he was alive, then was faced with the gruesome image of his body. She said:", "The people was just hollering, like, 'Cover him up, there's kids and stuff out here.' And at first they wouldn't pay them no attention.", "Another resident, Tommy Chartman-Bey, then described how a crowd grew around the body:", "People started coming, they started coming and they started coming, and as long as they let him lay there surely more people came. 'Why you letting him lay there like that?' 'This is a crime scene.'", "The tension was so high, so thick, you could cut it with a knife.", "Residents and a police officer interviewed by the New York Times described how the scenario further escalated, with mounting distrust between police and the crowd that had gathered. Witnesses reported hearing what sounded like gunfire; officers called for backup. Tensions were further heightened by the arrival of more officers in riot gear using police dogs for crowd control:", "[O]fficials were contending with what they described as “sheer chaos” on Canfield Drive, where bystanders, including at least one of Mr. Brown’s relatives, frequently stepped inside the yellow tape, hindering investigators. Gunshots were heard at the scene, further disrupting the officers’ work.", "Shaun King, an activist and New York Daily News columnist who became influential through the Black Lives Matter movement, called the claim that the movement was funded by Russia \"ludicrous\":", "That's a complete fabrication. Most activists and leaders in Ferguson never received a dime from anybody at all... most also didn't have charities or organizations. They were everyday people fighting for what they believed in.", "Of course, I have no real idea who could've donated to random people, but I am very sure that it was not a movement funded by Russia. That's ludicrous.", "Another activist who was on the ground in Ferguson did not wish to be interviewed, but simply said the claim was so far afield he didn't want to \"dignify it with a response.\" A third called the claim \"insulting.\"", "News reports from Ferguson in 2014 described scenes of intermittent protests and violence, but many of the demonstrators described in the stories were locals who expressed concerns about inequality between white and black residents in the area. The Washington Post reported:", "The police activity only further incited the crowd, with some people lying in the street with their hands in the air. “Don’t shoot!” they chanted. “Go home, killers.”", "Others fled, crying out for water as stinging tear gas bit at their eyes.", "“I had to go back for my sister,” explained 18-year-old Travis Hollins, who ripped off his shirt as tears streamed from his eyes. His 21-year-old sister had fallen near a tear gas canister, he explained, so he had run back into the fray to help her.", "As police continued to press forward, they demanded that residents “get out of the street,” “return to your homes” and “go home now.”", "In turn, residents responded: “These are our homes.”", "The St. Louis Post-Dispatch reported:", "Protesters complained that the killing was emblematic of deep tensions between black residents of North County and a predominantly white Ferguson police force. Officials have not revealed the race of the officer who killed Brown.", "“We have to stick together because we are targets,” said Robert Brefford, 26, an African-American musician from Berkeley who spoke in front of the police station Sunday night. He said police in the area pull over, poke and prod black drivers to provoke them.", "“The bleeding began long before Michael Brown,” said Pastor Traci Blackmon of nearby Christ the King United Church of Christ.", "She passed a petition seeking a dialogue with officials. “We come in peace,” she said. “But we are angry and in need of action and answers.”", "To place it in historical context, a racial justice movement had already been galvanized in 2013 when George Zimmerman (a self-deputized neighborhood watch member who shot and killed 17-year-old African-American high school student Trayvon Martin) was cleared of murder charges in Florida. Martin's killing launched a national conversation about the way police interact with black Americans in a country with a long legacy of institutional racism.", "Like the Trayvon Martin protests, the Ferguson movement was spontaneous and largely driven by social media. Although it was heavily local, it helped congeal the national movement against police violence against the African-American community under the Black Lives Matter banner. But the Ferguson protests were not dictated nor driven by any top-down organization, and it takes no funding stream to prompt outraged residents to take to the streets, which is exactly what happened in 2014 as well as in subsequent years, when demonstrations were (and are)  hastily organized on social media in response to incidents of police violence captured on video by citizens with smartphones.", "Further, it is clear from exhaustive reporting by the news media at the time — as well as a scathing report issued by the Department of Justice in the aftermath — that Ferguson's black community had serious and legitimate civil rights concerns with the police department. Brown's death was only a catalyst that released tensions that were already burning under the surface.", "We found no evidence that any foreign government, Russia or otherwise, funded the Ferguson protests.", "Bosman, Julie, and Goldstein, Joseph. \"Timeline for a Body: 4 Hours in the Middle of a Ferguson Street.\"\r\n  The New York Times. 23 August 2014.", "Lowery, Wesley. \"Police Use Tear Gas on Crowd in Ferguson, Mo., Protesting Teen’s Death.\"\r\n  The Washington Post. 12 August 2014.", "Giegerich, Steve, et al. \"FERGUSON DAY TWO WRAPUP: Day of Protests, Night of Frenzy.\"\r\n  St. Louis Post-Dispatch. 11 August 2014.", "Berman, Mark, and Lowery, Wesley. The 12 Key Highlights From the DOJ’s Scathing Ferguson Report.\"\r\n  The Washington Post. 4 March 2015.", "Department of Justice. 4\"Investigation of the Ferguson Police Department.\"\r\n  4 March 2015.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]