["About this rating", "May 2013 saw the circulation of a rumor that Muslim immigrants living in the Belgian municipality of Ath had demanded that local schools stop serving pork products in their cafeterias in accordance with Islam's religious restrictions on the consumption of such foods ... only to be told rebuked by the mayor, who asserted that Muslims needed to adapt to local customs, not vice-versa:", "PORK IN SCHOOL CANTEENS", "A REAL MAYOR WHO REFUSES TO REMOVE PORK FROM THE SCHOOL CANTEENS EXPLAINS WHY", "Muslim parents demanded the abolition of pork in all the school canteens of Ath in Belgium.", "Marc Duvivier the mayor of Ath, has refused, and the town clerk sent a note to all parents to explain why.", "\"Muslims must understand that they have to adapt to Belgium, its customs, its traditions, its way of life, because that's where they chose to immigrate.", "They must understand that they have to integrate and learn to live in Belgium.", "They must understand that it is for them to change their lifestyle, not the Belgians who so generously welcomed them.", "They must understand that the Athois are neither racist nor xenophobic, they accepted many immigrants before Muslims (whereas the reverse is not true that Muslims do not accept non-Muslim foreigners on their soil).", "That no more than other nations, the Belgians are not willing to give up their identity, their culture.", "And if Belgium is a land of welcome, it's not Marc Duvivier that welcomes foreigners, but the Belgian people as a whole.", "Finally, they must understand that in Belgium with its Judeo-Christian roots, Christmas trees, churches and religious festivals, religion must remain in the private domain. The municipality of Ath was right to refuse any concessions to Islam and Sharia.", "For Muslims that disagree with secularism and do not feel comfortable in Belgium, there are 57 beautiful Muslim countries in the world, most of them under-populated and ready to receive them with open halal arms in accordance with Shariah.", "If you left your country for Belgium, and not for other Muslim countries, it is because you have considered that life is better in Belgium than elsewhere.", "Ask yourself the question, just once, \"Why is it better here in Belgium than where you come from?\"", "A canteen with pork is part of the answer.", "In an announcement posted to Ath's website at the time, Mayor Duvivier not only denied having made the statement attributed to him, he also denied that any request about removing pork from canteens had ever been presented to him. In his press release, Duvivier explained that \"no person of any nationality or ethnic group whatsoever have made such a request to the municipal services, with Mr. Bruno Boel, Municipal Secretary, or myself ... this is a lie,\" adding that the presence of pork in school canteens had never been an issue.", "This false item appeared to be another entry in the collection of anti-Muslim screeds that feature government officials criticizing immigrants for supposedly refusing to adapt to the local cultures of their new home countries.", "Variations:   A variant of this item shifted the locale from Belgium to Dorval, Quebec, Canada. In 2016 the tale moved around the planet to Maryborough, Victoria, Australia.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]