["A video floating across social media platforms claims that Christian missionaries in Mizoram are burning the Indian flag and an idol of Lord Krishna. The following tweet by a Twitter account called ‘Straight Talk India’ has been retweeted over 1300 times.", "Christian Missionaries burning idol of Lord Krishna & Indian National Flag in Mizoram. If your blood doesn’t boil, you are no Indian. Majority paying price for pampering minorities. @sgurumurthy @rsprasad @rammadhavbjp @narendramodi pic.twitter.com/tUI7v22E77", "— Straight Talk India (@sttalkindia) June 4, 2018", "Among those who have shared it is Madhu Kishwar with a bitter, inciteful tone – “If your blood doesn’t boil, you are no Indian. Majority paying price for pampering minorities,” . Her post has been retweeted more than 900 times in the last four hours.", "In the North East, Christians are no more a “minority”. This is Break Up India politics under garb of religious freedom! https://t.co/GtjyZnaUMj", "— MadhuPurnima Kishwar (@madhukishwar) June 4, 2018", "Kishwar was recently pulled up by the Jammu and Kashmir police for circulating the fake news that the DG of J&K suspended the SP who killed Burhan Wani in an encounter.", "Multiple pages and individual users have shared the video on Facebook in the last 24 hours.", "Members of a newly emerging sect of Christianity in the north-eastern state of Mizoram had, in fact, burned a Hindu idol and set ablaze the tricolour, but the incident took place in 2017.", "Firstpost had reported the incident last year on September 30. “This incident comes to light at a time when the rise of Hindu nationalism has caused a number of incidents of communal violence across India,” the report said.", "The incident occurred on September 21, 2017, at Lunglei district in Mizoram. A man in a white robe, apparently a self-styled preacher of Christianity, can be seen in the video amidst men in traditional Mizo attire. The group can be heard chanting slogans against Hinduism and India. All the seven men were identified by the state police.", "As reported by Firstpost, this sect of Christianity which has no name attributed to itself wants independence from the country.", "Although Mizoram is a Christian majority state, this new sect is seen as extremist and a threat to peace by the community which accounts for 87% of the population.", "The Catholic Church had strongly condemned the act, terming it “fundamentalism”. In a press release dated October 6, 2017, the Catholic Bishops’ Conference of India (CBCI) said, “Those who have committed these acts cannot and should not profess to be Christians.”", "“We are shocked that anyone could show disrespect to members of another religion in the name of Christ”.", "This condemnable act was rightly denounced by Christian leaders and the ones involved were identified, yet the incident is being propagated as a recent affair. Old videos and images of this nature are often recirculated with the objective of keeping the communal pot simmering and citizens distracted from core issues.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A purported video of a Muslim man beating a temple priest with a bat is…", "A picture depicting the Pakistani flag apparently bigger in size and apparently placed higher than…", "Amid the ongoing war between Israel and Hamas, a video of a fleet of cars…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "A clip featuring Pakistan men’s Cricket team captain Babar Azam is viral on social media…"]