["About this rating", "During the 2020 presidential primary campaign season, the worldly possessions of Democratic U.S. Sen. Bernie Sanders became a subject of interest, especially among those who labeled him a \"socialist.\"", "One item of particular scrutiny was the notion that Sanders owned three homes, one of which, according to a popular meme, was an opulent mansion with panoramic views of Vermont's Green Mountains:", "Sanders does indeed own three properties, but none of them is the stately manor pictured above.", "The senator's main residence in Vermont is a colonial four-bedroom house in Burlington, which he purchased in 2009 for a reported $405,000. He also owns a one-bedroom 1890 row house in Washington, D.C., just a few blocks from the Capitol, which he bought for a reported $489,000. As well, he owns a lakefront cabin in North Hero, Vermont, purchased for a reported $575,000 in 2016.", "Those dwellings are pictured in the following Facebook post:", "The residence pictured in the \"Hey morons\" meme, however, is a completely unrelated 15,460-square-foot estate in Stowe, Vermont, which was built in 2001 and boasts four bedrooms and nine bathrooms on 15 acres:", "Green Mountain Estate on 15 acres boasting panoramic views, custom finishes, and innovative home technology. This 4-bedroom home with 6 full and 3 partial bathrooms includes a master sanctuary with exercise room and 3 large guest suites. An entertainer's dream, the home includes indoor pool and spa, home theater, billiards room with wet bar, library and panoramic Green Mountain views from the south terrace. Custom finishes throughout include exotic woods, Bottocino and Carrera marble, and handcrafted suspended staircase, with exterior of the home finished in prized Danby, Vermont marble, and on-demand snow melt system. Located in charming Stowe, Vermont hear world-famous Von Trapp Family Lodge and Stowe Mountain Resort.", "This residence was last sold in August 2017 for just under $3 million, an amount much greater than Sanders' estimated net worth.", "Sraders, Anne.   \"What Is Bernie Sanders' Net Worth?\"\r\n    TheStreet.   6 February 2020.", "Goldstein, Sasha.   \"Bernie Sanders Buys a Summer Home in North Hero.\"\r\n    Seven Days [Vermont].   8 August 2020.", "Keeffe, Dan.   \"3 Houses of Bernie Sanders: What You Need to Know.\"\r\n    Propy.   9 October 2019.", "Craven, Jasper and Mark Johnson. \"Sanders Lake Home Purchase Leaves Questions Unanswered.\"\r\n    VTDigger.   18 August 2016.", "Kruse, Michael.   \"The Secret of Bernie’s Millions.\"\r\n    Politico.   24 May 2019.", "Gould, Martin.   \"Take a Peek at 'Best Known Millionaire Socialist' Bernie Sanders' Three Homes.\"\r\n    Daily Mail.   20 February 2020.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]