["About this rating", "More than 30,000 cows froze to death during Winter Storm Goliath in December 2015.", "This storm did not occur in 2017; farmers tried to protect their animals, but were unable to do so.", "In January 2017, a photograph purportedly showing a group of cows that had been apparently frozen solid was circulated on Facebook along with the claim that 30,000 animals had just died in a winter storm:", "Both the photograph displayed here and its accompanying claim are legitimate. However, while this meme appeared again (and was mistaken for current) in January 2017, this graphic actually references a winter storm that occurred at the end of December 2015.", "Weather.com reported that more than 15,000 cows died during Winter Storm Goliath in Texas, while another 20,000 froze to death in New Mexico:", "Dairy producers in Texas and New Mexico have estimated that the number of animals that died during the recent Winter Storm Goliath will climb to more than 30,000.", "The winds are believed to be the cause for many of the animals’ deaths. It created drifts as high as 14 feet and pushed animals into fenced corners where they suffocated, according to The Associated Press.", "\"As Winter Storm Goliath wrapped up over the southern Plains, strong winds were associated with the storm's tightening pressure gradient,\" said weather.com meteorologist Quincy Vagell. \"When combined with snow, the winds were strong enough to create dangerous blizzard conditions.\"", "Executive director of the Texas Association of Dairymen Darren Turley said that an estimated 15,000 mature dairy cows died between Lubbock, Muleshoe and Friona, the primary impact area of the storm, AP also reports. This region includes the home of half the state’s top 10 milk-producing counties, which provide 40 percent of Texas’ milk.", "According to an agent with New Mexico State University’s extension service, the state lost an estimated 20,000 cows.", "“Like all agriculture, dairy producers always operate at the mercy of Mother Nature,” said Turley. “With Goliath, she dealt a particularly harsh and costly blow to the area’s dairy producers, from the death of thousands of livestock they spend so much time caring for to a loss of milk production both over the weekend and in the future.”", "The photograph is also real, although we were not able to determine a definite source. An uncropped version of the image was published by Tri-State Livestock News shortly after the storm, which showed a group of frozen (or near-frozen) cattle on the side of the road:", "The other part of the meme heavily implied that the cows froze to death out of neglect, because nobody \"felt the need\" to bring them inside in the cold weather. The truth is, of course, more complicated. A January 5, 2016 report from the \"Houston Chronicle\" detailed efforts farmers undertook to protect their cattle from the freak storm:", "More than one foot of snow on December 27 surprised ranchers and dairy farmers in a region accustomed to a few inches of precipitation each winter. Unlike their northern peers, Texas cattle raisers rarely own four-walled barns designed to keep cattle warn, often opting instead for open structures meant to keep Texas cattle cool during the long, hot summers.", "Forecast warnings of a \"historic blizzard\" came too late. Voinis said some cattle raisers had tried to build shelters with hay bales and machinery, to little avail.", "Some cattle were buried in snowdrifts formed by gale force winds. Others froze to death in the open, died of frostbite in later days or just disappeared. Initial loss estimates increased greatly in the days following the storm.", "A similar story unfolded in New Mexico, which was swept by the same storm:", "Meteorologists sounded the first warnings about the storm some eight days before it hit on Dec. 26. Farmers prepared as best they could — putting down extra bedding behind wind breaks, placing extra bales of hay in front of calf bungalows and in places where snow typically accumulates.", "But as the blizzard raged on, cows that had sought shelter behind windbreakers were buried alive by drifting snow. Others froze to death on open fields. Calves that had been nestled inside hutches went hungry because no one could reach them. Farmers who tried to rescue their animals became disoriented and lost on their own land.", "“We did the best we could for our animals,” Ms. Beckerink said. But as the storm worsened, saving them meant risking the lives of her workers — “a horrifying decision to make.”", "The deaths of the cattle dramatically affected the livelihoods of farmers in both states.  It is extremely unlikely that any farmer (dependent on their animals for money and food) would cavalierly leave their main source of income and food out in the snow to freeze to death, despite what this meme implies.", "Carr, Ada.   \"Dairy Cow Death Toll to Surpass 30,000 in Texas, New Mexico Due to Winter Storm Goliath.\"     The Weather Channel.   5 January 2016.", "Maude, Heather.   \"Winter storm Goliath affects cattle producers in Texas, New Mexico.\"     Tri-State Livestock News.   12 January 2016.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]