["About this rating", "In May 2017, a meme appeared that seemed to show U.S. President Donald Trump at a meeting of G7 leaders in Italy, without notes or note-taking paraphernalia in front of him.", "The G7, or Group of Seven, consists of leaders from seven industrialized democracies who regularly hold meetings to discuss issues such as energy policy, international security, and the global economy.  (Until 2014, the Group of Seven was the Group of Eight, but Russia was suspended from the group after its annexation of Crimea that year.)", "The image came with the following caption:", "Trump, the only world leader without notes, folders, or writing tools in front of him. Because the man has a 10 second attention span.", "The photograph — which appears to have originally been tweeted by French President Emmanuel Macron without the commentary on 26 May — also shows Canadian Prime Minister Justin Trudeau without notes in front of him, although he does appear to have a pen. Similarly, German Chancellor Angela Merkel has no notes in front of her.", "Merkel is sitting immediately to Trump's right, and Trudeau is sitting immediately to her right.", "The folder on which Macron is writing, two places to Trump's left, is not his own. As the wording of his tweet explains, it was an anti-terrorism agreement that was passed around the table and signed by each of the G7 leaders, including Donald Trump. Other photographs from the roundtable meeting clearly show Donald Trump with notes in front of him.", "This Reuters image shows the President reading notes or an agenda, as does this video:", "And finally, this official G7 Summit photograph shows Trump with a pen on the table in front of him:", "There is clear photographic and video evidence that shows this meme picked one snapshot from a meeting in order to claim that Trump did not use or read notes at the G7 round table meeting. The meme also ignored the two individuals sitting to his right in order to make the false claim that he was the only world leader in the photo without notes in front of him.", "During the G7 Summit, Trump was also accused of deliberately not wearing headphones carrying an English translation of Italian Prime Minister Paolo Gentiloni's contribution. It turned out the President was just wearing a small earpiece, which was not visible in one particular video clip.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]