["By Katherine Hartzell", "Posted on July 22, 2019", "A misleading meme states that Rep. Alexandria Ocasio-Cortez received “about 16,000 votes” while running for office in 2018. She won her seat with 110,318 votes in the general election. She received 16,898 votes in the district’s Democratic primary.", "A meme circulating on Facebook includes a photograph of Rep. Alexandria Ocasio-Cortez and the words, “Let me get this straight. A young woman, who was bartending because she couldn’t get a job with her economics degree, runs for office and gets about 16,000 votes, (she didn’t WIN by 16,000 votes, she got a total of 16,000 votes) is now driving the Democrat bus? Let that sink in.”", "Ocasio-Cortez was elected to the House with a lot more votes than that.", "The meme is likely referring to the primary election, not the general. In the Democratic primary election in New York’s 14th Congressional District, Ocasio-Cortez received 16,898 votes in her upset victory over Rep. Joseph Crowley, a 10-term congressman. Ocasio-Cortez secured 56.7% of the votes cast, and 4,018 more votes than Crowley, who got 12,880, or 43.3% of the vote.", "Turnout was low for the closed primary, which was only open to registered Democrats. State data show that 214,570 active Democratic voters were registered in that district as of April 1, 2018, but only 29,778 of them voted in the election on June 26, 2018.", "In fact, a November 2018 report from the Bipartisan Policy Center shows that primary election turnout statewide that year in New York was only 3%, the lowest participation rate in the country. The report said that New York’s low federal primary turnout was “likely due to the state holding separate primaries for federal and state offices in the same year, and the federal primary didn’t feature a contested statewide race for either major party.”", "Turnout for the general election, however, was much higher.", "On Nov. 6, 2018, Ocasio-Cortez received 110,318 votes — 78.2% of the 141,122 total votes cast in the 14th District. Republican Anthony Pappas took second place with 19,202 votes — or 91,116 fewer votes than Ocasio-Cortez. And Crowley, who still appeared on the general election ballot, finished third with 9,348 votes.", "It’s misleading to claim Ocasio-Cortez only “got a total of 16,000 votes,” when she won her seat with almost seven times as many votes in the general election.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "“Certified Results for the June 26, 2018 Federal Primary Election.” New York State Board of Elections. Accessed 19 Jul 2019.", "“Certified Results from the November 6, 2018 General Election for U.S. Congress.” New York State Board of Elections. Accessed 19 Jul 2019.", "“NYSVoter Enrollment by Congressional District, Party Affiliation and Status Voters Registered as of April 1, 2018.” New York State Board of Elections. Accessed 19 Jul 2019.", "Fortier, John, et al. “2018 Primary Election Turnout and Reforms.” Bipartisan Policy Center. Nov 2018.", "Goldmacher, Shane and Jonathan Martin. “Alexandria Ocasio-Cortez Defeats Joseph Crowley in Major Democratic House Upset.” New York Times. 26 Jun 2018.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]