["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "President Donald Trump has a commanding hold on Republican voters, but it isn’t as high as he says.", "In a news conference with British Prime Minister Theresa May, a reporter asked Trump what he thought of Republican lawmakers who threatened to block his planned tariffs against Mexico.", "\"I think if they do, it’s foolish,\" Trump said June 4. \"I’ve had tremendous Republican support. I have a 90% — 94% approval rating, as of this morning, in the Republican Party. That’s an all-time record. Can you believe that? Isn’t that something? I love records.\"", "Trump does enjoy strong support among Republican voters. But no public poll backs up the stellar performance he touted. We emailed the White House to point us to the poll Trump relied on. We did not hear back.", "Looking at support among Republican voters, Trump’s highest number in the latest polls is 87% from Gallup. CNN comes in second at 86%. The other four are lower.", "All polls are based on surveys done at the end of May. No margin of error, among the polls that provide them, would be large enough to deliver the 94% that Trump claimed.", "Trump’s approval among Republicans has generally held in the mid-to-high 80s, which would qualify as robust. Gallup clocked in a slightly higher number of 90% in March and April. That sort of shift is within the normal variation in polling.", "We checked out whether Trump’s Republican approval was at an all-time high, both at this point in comparable tenures or all-time, as he said.", "At this point in his administration (around the 860-day mark), Trump’s approval comes in a bit behind George W. Bush, who held a 94% approval rating within his party, as did his father George H.W. Bush. Ronald Reagan and Richard Nixon brought up the rear, getting the nod from just 79% of Republican voters in May of their third year in office. Here’s the full picture, going back to Dwight Eisenhower.", "Trump once claimed that he had the highest polling numbers \"in the history of the Republican Party. That includes Honest Abe Lincoln and Ronald Reagan.\" We rated that False. Not only have other presidents in the recent past enjoyed higher numbers, but there is no data from Lincoln’s time. That is pure invention.", "For real record-setting, look to George W. Bush who, according to Gallup, won approval from 99% of Republicans in the month after the Sept. 11 terrorist attacks.", "Trump said, \"I’ve had tremendous Republican support. I have a 90% — 94% approval rating, as of this morning, in the Republican Party. That’s an all-time record.\"", "While his numbers hold steady in the mid-to-high 80s, no poll puts him at 94%. Nor did the White House point to a poll with that level of support. Still, 87% or 89% approval is a strong showing.", "Where Trump went overboard was in saying he had set some kind of all-time record. That didn’t happen.", "The statement as a whole is partially accurate, so we rate it Half True.", "White House, Remarks by President Trump and Prime Minister May in Joint Press Conference, June 4, 2019", "Gallup, Presidential Approval Ratings -- Donald Trump, June 2019", "Gallup, Presidential Job Approval Center, accessed June 5, 2019", "Economist/YouGov poll, June 2-June poll, accessed June 5, 2019", "Politico/Morning Consult, National Tracking Poll: May 31 - June 02, 2019, accessed June 5, 2019", "CNN, May 28-31, 2019 poll, accessed June 5, 2019", "Harvard-Harris Poll, May 29-30, 2019 poll, accessed June 5, 2019", "Reuters/Ipsos, Core Political Data, May 30, 2019", "Washington Post, Trump loves record poll numbers — including ones he’s apparently made up, June 4, 2019", "PolitiFact, No, Donald Trump's poll numbers do not beat Lincoln, all other GOP presidents, July 30, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]