["About this rating", "On Feb. 7, 2021, NFL quarterback Tom Brady won his seventh Super Bowl at Super Bowl LV. The next day, an online advertisement teased news that purported that the quarterback for the Tampa Bay Buccaneers received his private jet as a gift. It read: \"[Photos] Tom Brady's Private Jet Was a Gift from Whom?\"", "The ad about Brady was surrounded by other misleading and strange advertisements. One was about Monica Lewinsky's net worth. Another ad about actor Jack Nicholson's house contained broken English. It read: \"[Photos] Jack Nicholson is Old Now and Lives in Such House.\"", "Readers who clicked the ad about Brady purportedly owning a gifted private jet were led to a 119-page slideshow article. They had to click \"next page\" more than 100 times to reach the page about him. He appeared near the end of the story.", "It's true that Brady traveled on private jets in the past. However, the story said nothing of his receiving one as a gift:", "Gisele Bundchen & Tom Brady - Gulfstream G550, Estimated $50 Million", "Brazilian supermodel Gisele Bundchen had found a rather great solution for herself and her family since they are always on the go. Her husband and she own a private jet in order to fly back and forth from their LA home to Brady’s work in Boston as well as Gisele’s work in Paris to San Paulo where her family resides permanently.", "Brady doesn’t commute with the rest of his team members when they head off to their games, instead, he travels with his wife and children in their sleek black Gulfstream jet. Well, it might not be as fun but at least he gets more time with his family while traveling for work.", "The ad appeared to be nothing more than clickbait and \"arbitrage.\"", "In June 2008, The Boston Globe reported Tom Brady's then-girlfriend Gisele Bündchen bought a Gulfstream G550 private jet. However, on Jan. 24, 2021, Business Insider also reported that the couple \"doesn't own a private jet.\" They married on Feb. 26, 2009.", "Either way, there was no indication that Tom Brady and Gisele Bündchen received a private jet as a gift.", "Other celebrities mentioned in the lengthy article about private jets included Tiger Woods, Floyd Mayweather, Mark Zuckerberg, and Mark Cuban.", "Snopes debunks a wide range of content, and online advertisements are no exception. Misleading ads often lead to obscure websites that host lengthy slideshow articles with lots of pages. It's called advertising \"arbitrage.\" The advertiser's goal is to make more money on ads displayed on the slideshow's pages than it cost to show the initial ad that lured them to it. Feel free to submit ads to us, and be sure to include a screenshot of the ad and the link to where the ad leads.", "Jordan Liles is a Senior Reporter who has been with Snopes since 2016.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]