["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Sen. Ted Cruz has been openly opposed to same-sex marriage, but he didn’t blame gay people for mass shootings and public nudity during a 2014 speech.", "A 2015 viral image that falsely quotes Cruz is gaining traction again on social media as incumbent Cruz looks to keep his seat in the 2018 Texas Senate race against Democrat Beto O’Rourke.", "This story was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The false image originates from the now defunct Facebook page \"Stop the world: Teabaggers want to get off.\"", "\"When gays stayed hidden we had no mass shootings; we had no public nudity,\" the meme says Cruz said. \"Society was polite. Now anything and everything goes and I blame them.\"", "PolitiFact and its affiliates fact-checked several similar memes about Cruz from that Facebook page when it was active in 2015. We rated those Cruz-related memes Pants on Fire or False.", "This claim is no different. The meme says Cruz made this statement during his speech at a 2014 Conservative Political Action Committee conference. We watched a video of the speech. He does not mention gay people, mass shootings or public nudity.", "The original Facebook page had an About section that says the page \"is for entertainment purposes\" and is \"primarily satire and parody with a mix of political memes and messages.\" However, the meme that’s reappeared on social media three years later does not have this disclaimer attached.", "Cruz didn’t blame public nudity or mass shootings on gay people. We rate this claim Pants on Fire.", "Meme, Ted Cruz, accessed Sept. 13, 2018", "Video, American Conservative Union, \"CPAC 2014 - U.S. Senator Ted Cruz (R-TX),\" March 6, 2014", "PolitiFact, \"'Teabagger' group distorts Ted Cruz and others with images and fake quotations,\" June 11, 2018", "PolitiFact Texas, \"Meme on Facebook says Ted Cruz declared 'no place' for gays, atheists in 'my America,'\" April 8, 2015", "PolitiFact Texas, \"Made-up Ted Cruz quotation has Texan comparing child molesting and gay relations,\" May 28, 2015", "Snopes, \"Ted Cruz Blames Gay People for Mass Shootings?,\" Feb. 26, 2016", "The Washington Post, \"Cruz calls Supreme Court's gay marriage ruling 'fundamentally wrong,'\" Feb. 6, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]