["About this rating", "In the realm of of science-based clickbait, no topic is more reliable for delivering page views and social media shares than claims that the pool of magma sitting below Yellowstone National Park is about to erupt in a humanity-ending cataclysm. As we have repeatedly, exhaustingly, and redundantly reported, the likelihood of that mega-disaster's occurring in the next couple of thousand years is extremely low, and the region is monitored continuously for threatening activity which would provide ample warning if that situation were to change for some currently unknown reason.", "A perfect example of the pervasiveness of this claim (and, perhaps, the futility of fact-checking it), comes from the apocalypse-oriented website Breaking Israel News. Over the course of a few sentences, that website strung together multiple previously debunked Yellowstone claims into a meta-claim in need of a fresh debunking:", "After initially denying that the unusual amount of seismic activity witnessed last year was an indication of imminent danger, NASA scientists are proposing a solution that could save half the world while admitting that their intervention could initiate the explosion it was intended to prevent.", "Last year, increased seismic activity at Yellowstone generated a great deal of concern. More than 2,300 tremors were recorded between June and September, one of the largest earthquake swarms ever recorded at the site. Though geologists assured the public that the activity was normal for the site, another series of quakes and unusual eruptions beginning in February, increased fears that the supervolcano was waking up. An investigation revealed magma filling up in the underneath chamber of the supervolcano. In July, a massive, 100 ft.-wide fissure opened up in the Grand Teton National Park near Yellowstone, further increasing fears.", "While Breaking Israel News didn’t actually mention a year in their story, the “2,300 tremors recorded between June and September” referred to a series of minor earthquakes breathlessly reported by the Daily Mail and other junk news purveyors back in 2017 as a sign of a coming cataclysm. As we noted in our  debunking of those claims, thousands of detectable earthquakes occur in the Yellowstone region in any given year, and they in no way portend an imminent supereruption.", "The reference to a “100 ft.-wide fissure open[ing] up” in nearby Grand Teton National park, as we reported in July 2018, refers to an unrelated crack in a cliff face which rangers feared could result in a large chunk of rock's crushing climbers and onlookers below, not a coming eruption. This newer iteration of a Yellowstone claim introduced viral fear by asserting that a NASA study published in 2015 (which received attention in a 2017 BBC Futures article) somehow proved NASA was not being honest about geologic events that post-dated their report.", "That BBC Future article, which Breaking Israel News and other sources cite extensively but without context, presented commentary from an engineer at NASA’s Jet Propulsion Laboratory, Brian Wilcox, who served on a NASA Advisory Council on Planetary Defense. That body did conclude in 2015 that a risk of a supervolcano was more likely than a large scale comet or asteroid impact, and they gamed out a variety of extremely theoretical and long-term solutions to mitigate such a risk:", "Supervolcanic eruptions occur more frequently than large asteroid or comet impacts that would have a similarly catastrophic effect to human civilization, especially now that many asteroid orbits have been mapped. We assess whether future supervolcanic eruptions could be dampened, delayed, or prevented by engineering solutions.", "That brainstorming did not mean, however, that Wilcox or the other researchers concluded that a supereruption was more likely to occur in our lifetimes than previously thought, or that an urgent need existed to begin geoengineering solutions for it. Via email, Wilcox told us that “Neither I nor, to my knowledge, any of the co-authors has commented on the seismic activity or possible danger of a near-term eruption.” He referred to the geoengineering plans as a thought experiment revolving around the question “is it possible for human civilization to prevent supervolcano eruptions that might threaten humanity?\"", "As described by BBC Future, the solution they proposed involved utilizing the heat from the magma for geothermal energy by drilling toward the hot earth and running water through the holes. This would have two benefits, the study argued: First, in the short term, it would provide a possible source of geothermal energy; and second, in the long term, it could (over thousands of years) reduce the overall risk of a caldera-level eruption:", "They believe the most viable solution could be to drill up to 10km down into the supervolcano, and pump down water at high pressure. The circulating water would return at a temperature of around 662F, thus slowly day by day extracting heat from the volcano ... “Yellowstone currently leaks around 6GW in heat,” Wilcox says. “Through drilling in this way, it could be used to create a geothermal plant, which generates electric power at extremely competitive prices of around $0.10/kWh.", "You would have to give the geothermal companies incentives to drill somewhat deeper and use hotter water than they usually would, but you would pay back your initial investment, and get electricity which can power the surrounding area for a period of potentially tens of thousands of years. And the long-term benefit is that you prevent a future supervolcano eruption which would devastate humanity.”", "When Wilcox said “long-term,” he was not talking about years or decades. In the study, the team made it clear they were speaking in terms of tens of thousands of years:", "The cooling perimeter would close-in on the magma chamber at the rate of approx. 1 m/year. Even for a massive supervolcano such as Yellowstone, it would take less than 50,000 years for such a cooling system to completely drain the heat away from the magma chamber, all the while generating electricity at competitive prices.", "No plans are afoot to begin such a forward-looking initiative, and the report itself stated that any work in that regard right now would be premature. “There are a number of unknowns about the nature of supervolcanic eruptions and how they are supplied that need to be addressed before attempting any engineered solutions,” the reported concluded. Therefore, no immediate plans to geoengineer a risk-reduction solution to the Yellowstone caldera are at hand, nor is new evidence suggesting an increased risk of eruption.", "“The good news is that it does seem possible to achieve [such a risk reduction solution] on a timescale that is short compared to the average time between eruptions of a given supervolcano,” Wilcox told us. “The bad news is that humans would have to make a concerted effort for thousands of years to defang a volcano like Yellowstone, and it would have essentially no effect if the eruption were going to happen anyway within a few human lifetimes.”", "Berkowitz, Adam Eliyahu.   \"Could NASA’s Plan to Cool Yellowstone Backfire?\"\r\n    Breaking Israel News.   8 October 2018.", "Weston, Phoebe.   \"Is It About to Blow? Yellowstone Supervolcano Is Hit by 878 Earthquakes in Just Over Two Weeks.\"\r\n    Breaking Israel News.   28 June 2017.", "United States Geological Survey.   “Steam Explosions, Earthquakes, and Volcanic Eruptions—What’s in Yellowstone’s Future?”\r\n    Accessed 10 October 2018.", "Cox, David.   \"NASA’s Ambitious Plan to Save Earth from a Supervolcano\"\r\n    BBC Future.   17 August 2017.", "Wilcox, Brian H et al.   \"Defending Human Civilization from Supervolcanic Eruptions.\"\r\n    NASA Office of the Chief Scientist.   15 October 2015.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]