["About this rating", "In June 2020, a Twitter thread relaying a story supposedly written by someone identified as \"Rabbi Michael Beals\" about Democratic presidential candidate Joe Biden's attendance at a Jewish funeral service was widely circulated on social media.", "Some social media users were skeptical about this thread. After all, it's not uncommon to see pieces of text incorrectly attributed to influential figures floating around social media. (Check out our ever-growing list of \"misattributed\" articles.)", "The above-displayed text, however, was actually written by Rabbi Michael Beals. This story was originally published on Joe Biden's Medium page back in September 2019, where it was preceded by the following introduction:", "We’re sharing stories directly from the people who truly know Joe and his character — from his family members to his colleagues to veterans he greeted at the White House. Meet Joe Biden through the eyes of those who know him best.\nThen, help build the campaign that’s going to send him to White House.", "Beals, who has been with Delaware's Congregation Beth Shalom since 2004, confirmed to us that he was the author of this story, and assured us in an email that \"the story is true.\" Beals also sent us the obituary for Sylvia Greenhouse, the woman whose death anchored this story, and told us that this was just one of several \"menchy [sic] stories\" about Biden.", "Beals wrote:", "I promise the story is true.", "[...]", "This is one of many such Biden menchy stories -- but this one seemed so exceptional because shivas are not as common as the many funerals he has also attended in the Jewish community.", "In 2019, Beals relayed a story about Biden attending a shiva minyan, a worship service following a death of a Jewish person. According to Beals, he was conducting the service for Greenhouse, a Delaware woman who was \"not a person of means,\" when Biden quietly entered the room. Beals writes that he asked Biden why he attended the service, and that the then-senator responded that Greenhouse had been a frequent small donor to his political career.", "An excerpt from Beals' story appears below. The full post can be read on Medium.", "We assembled the ten elders together, and it was in this most humble of places that I began to lead the kaddish. Toward the end of the service, a door at the back of the laundry room opened, and who walks in but Senator Joe Biden, his head lowered, all by himself.", "I nearly dropped my prayer book in shock.", "Senator Biden stood quietly in the back of the room for the duration of the service.\nAt the close of the kaddish, I walked over to him and asked the same question that must have been on everyone else’s mind:", "“Senator Biden — what are you doing here?”", "And he said to me: “Listen, back in 1972, when I first ran for Senate, Mrs. Greenhouse gave $18 to my first campaign. Because that’s what she could afford. And every six years, when I’d run for reelection, she’d give another $18. She did it her whole life. I’m here to show my respect and gratitude.”", "Now, the number 18 is significant in the Jewish faith — its numbers spell out the Hebrew word chai, as in “to life, to life, l’chayim!” But it’s also a humble amount. Joe Biden knew that. And he respected that.", "There were no news outlets at our service that day — no Jewish reporters or important dignitaries. Just a few elderly mourners in a basement laundry room.", "Joe Biden didn’t come to that service for political gain. He came to that service because he has character. He came to that service because he’s a mensch.", "And if we need anything right now when it comes to the leadership of our country — we need a mensch.", "Medium.   \"I Know Joe Biden: Rabbi Michael Beals.\"\r\n    9 September 2019.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]