["About this rating", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "On Oct 6, 2020, an image started circulating on social media that supposedly showed a screenshot of a television appearance in which U.S. President Donald Trump said, \"the doctors said they've never seen a body kill the Coronavirus like my body. They tested my DNA and it wasn't DNA. It was USA.\"", "This is not a genuine quote from Trump.", "This image of Trump in the above-displayed media comes from a video the president released while he was hospitalized at Walter Reed National Military Medical Center after testing positive for COVID-19. The included quote, however, was made up out of whole cloth. This meme appears to have been created by the Twitter account Out of Context Earth, which bills itself as \"parody.\"", "Trump was airlifted to Walter Reed on Oct. 2, 2020. The following day, Trump addressed the American people in a video that he posted to Twitter:", "In this video, Trump thanked the medical team at the hospital for its hard work, and told the American people that he was doing well. Trump did not say, however, that the doctors marveled at how his body had killed coronavirus, and that his DNA was not actually DNA, but USA.", "Gringlas, Sam and Barbara Sprunt.   \"Timeline: What We Know Of President Trump's COVID-19 Diagnosis, Treatment.'\"\r\n    NPR.   5 October 2020.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]