["By D'Angelo Gore", "Posted on December 21, 2016", "Q: Did Mike Pence call Michelle Obama “the most vulgar first lady we’ve ever had”?", "A: No. That is a made-up quote and story from a self-described “news/satire” website.", "Did Mike Pence call Michelle Obama “vulgar” for speaking out about Donald Trump’s sexist comments?", "“Pence: ‘Michelle Obama Is The Most Vulgar First Lady We’ve Ever Had'” is a bogus quote and headline on a fake news story from Newslo, which claims to be “the first hybrid News/Satire platform on the web.”", "In this case, nearly everything attributed to the soon-to-be vice president about the outgoing first lady has been fabricated.", "Newslo posted its satirical story on Oct. 14. Pence appeared on “CBS This Morning” that day and answered questions about a 2005 video in which Donald Trump talked about grabbing women by the genitals without their permission. Pence also was asked about Michelle Obama’s remarks at a campaign event a day earlier. In her speech, the first lady said that Trump “speaking freely and openly about sexually predatory behavior” against women had “shaken me to my core in a way that I couldn’t have predicted.”", "Pence told CBS that he didn’t understand the first lady’s criticism of Trump. But that’s all he said. Newslo completely made up the rest of the quotes it attributed to Pence.", "For the record, here is what Pence said in the CBS interview:", "Norah O’Donnell, Oct. 14: Let me get you to respond then to the first lady. She said, “This wasn’t just locker room banter, this was a powerful individual speaking freely and openly and freely about sexually predatory behavior.” At the very least, does that make you uncomfortable?", "Pence: Well, look, I have a lot of respect for the first lady and the job that she’s done for the American people over the last seven and a half years. But I don’t understand the basis of her claim. …", "O’Donnell: You don’t believe his language was sexually predatory?", "Pence: Well, no, I already spoke about my concerns about the language he used in that 11-year-old video. But … what he’s made clear is that was talk, regrettable talk on his part, but that there were no actions.", "Several women did step forward to accuse Trump of unwanted sexual contact — claims that the president-elect has denied.", "Newslo and its affiliated websites were also behind the false story flagged by Facebook users that former Alaska Gov. Sarah Palin called for a boycott of the Mall of America in Minnesota because it hired an African American male to play Santa Claus, while “Santa Was Always White In The Bible.”", "The Associated Press reported that Palin never made any of the statements that Newslo claimed she had said to the Minneapolis Star Tribune.", "Palin posted a link to the AP article to her Facebook page on Dec. 20 and added: “Dear Democrats, this is what ‘fake news’ actually looks like, and I guarantee you no Trump voter actually fell for this.”", "Newslo, which uses the tagline “Just Enough News,” gives its readers the option to show or hide the facts in its posts. The default on posts is to “hide facts,” but if a reader selects “show facts,” the portion of the post that the site deems accurate will then appear highlighted in yellow.", "Also, Newslo says it uses “#NNTS” next to headlines of real stories. NNTS stands for “No Need to Satirize.”", "“Newslo’s ‘No Need to Satirize’ brings you completely factual stories that are so ridiculous, they don’t need our trademark touch,” the website says on its “About Us” page.", "That’s the designation Newslo used when it posted a link to a real news story in 2014 about former Texas Gov. Rick Perry comparing homosexuality to alcoholism.", "The posts about Pence and Palin do not include the “#NNTS” label.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to help identify and label viral fake news stories flagged by readers on the social media network.", "Politifact Rating:", "Read More", "Stevan, Alex. “Pence: ‘Michelle Obama Is The Most Vulgar First Lady We’ve Ever Had.’” Newslo.com. 14 Oct 2016.", "Fahrenthold, David. “Trump recorded having extremely lewd conversation about women in 2005.” Washington Post. 8 Oct 2016", "Allen, Cooper. “Michelle Obama blasts Trump, says his comments have ‘shaken me to my core.’” USA Today. 13 Oct 2016.", "CBS This Morning. Pence: “I don’t understand” basis of Michelle Obama’s condemnation of Trump. YouTube video. 14 Oct 2016.", "Vat Kens, Lea. “Sarah Palin Calls To Boycott Mall Of America Because ‘Santa Was Always White In The Bible.’” Newslo.com. 3 Dec 2016.", "Associated Press. “AP FACT CHECK: Sarah Palin Didn’t Criticize Black Santa.”ABCNews.go.com. 20 Dec 2016.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]