["About this rating", "On 1 May 2019, the scientific journal Environment International published research that found, among other things, the presence of cocaine in \"100% of samples\" of freshwater shrimp (Gammarus pulex) from 15 sites across Suffolk, UK. The purpose of the study, titled “Biomonitoring of pesticides, pharmaceuticals and illicit drugs in a freshwater invertebrate to estimate toxic or effect pressure” was two-fold: to present a method for quantifying the presence of pesticide, pharmaceutical, and drugs of abuse in ecological settings, and to develop methods to estimate the relative amount of harm, or effect, each of these chemicals poses to the organisms in those environments.", "In a press release, lead author Thomas Miller, a post-doctoral researcher at King's College London, said, \"The most frequently detected compounds were illicit drugs, including cocaine and ketamine, and a banned pesticide, fenuron.\" The investigators were able to identify 56 compounds among the shrimp samples. The researchers also sampled the water in the streams in which the shrimp were found. Here, too, cocaine was identified in all of the sites, suggesting its occurrence is widespread and not localized to any one source of contamination. The concentrations, however, were “generally very low”:", "Concentrations of compounds were generally very low in both biota samples (parts per billion range) and water samples (parts per trillion range).", "Speaking to NPR, Emma Rosi, who was not involved in this study but who has, as an aquatic ecologist at the Cary Institute of Ecosystem Studies, performed similar work, said: “Pharmaceuticals and personal care products and pesticides and these types of illicit drugs have been detected in surface waters all over the world, because when we use them, our waste isn't always treated properly, and so they come out in rivers and streams.\" Rossi’s past work has identified more than 60 pharmaceutical compounds in aquatic invertebrates and spiders in streams near Melbourne, Australia.", "The question of what effect these compounds have on the organisms studied is a different one. Previous studies have, for example, attempted to ascertain if the behavior or other attributes of minnows exposed to concentrations of antidepressants found in some bodies of water changed as a result of that exposure. One study demonstrated that minnows' \"larval survival behaviors are imperiled by their current environmental exposure to antidepressant mixtures,\" and that \"anatomical variations in body length were also produced.\" Another study by the same researchers found that minnows' \"anatomy and physiology, but not reproductive behavior, can be disrupted by exposure to environmental concentrations of some antidepressants.\"", "In the shrimp study, the researchers attempted to quantify the potential effect on shrimp using a different quantitative measure based on the toxicity of the various chemicals at issue. For nearly all of the chemicals, including cocaine, they concluded that, “The potential for any effect is likely to be low.\" Still, the presence of any illicit drugs in these shrimp was surprising to the researchers. Leon Barron, a co-author on the study from King’s College, said: “Such regular occurrence of illicit drugs in wildlife was surprising. We might expect to see these in urban areas such as London, but not in smaller and more rural catchments.”", "Nic Bury, another co-author from the University of Suffolk, argued that, “The impact of 'invisible' chemical pollution (such as drugs) on wildlife health needs more focus in the UK as policy can often be informed by studies such as these.\" Their study provided refined methodologies to answer these kinds of questions. It also, as headlines claimed, identified the presence of cocaine in freshwater shrimp. As such, we rank the claim \"true.\"", "Miller, Thomas, H.   “Biomonitoring of Pesticides, Pharmaceuticals and Illicit Drugs in a Freshwater Invertebrate to Estimate Toxic or Effect Pressure.”\r\n    Environment International.   1 May 2019.", "King’s College London.   “New Study Finds River Wildlife Contain Cocaine, Pharmaceuticals and Pesticides.\"\r\n    1 May 2019.", "Kennedy, Merrit.   “Traces Of Cocaine, Pesticides Detected In U.K. Shrimp.”\r\n    NPR.   2 May 2019.", "Richmond, Erinn K, et al.   “A Diverse Suite of Pharmaceuticals Contaminates Stream and Riparian Food Webs.”\r\n    Nature Communications.   6 November 2018.", "Painter, M.M., et al.   “Antidepressants at Environmentally Relevant Concentrations Affect Predator Avoidance Behavior of Larval Fathead Minnows (Pimephales promelas).”\r\n    Environmental Toxicology and Chemistry .   30 April 2009.", "Schultz, M.M., et al.   “Selective uptake and biological consequences of environmentally relevant antidepressant pharmaceutical exposures on male fathead minnows.”\r\n    Aquatic Toxicology.   30 March 2011.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]