["About this rating", "An entertainment blog published the headline: \"Tom Hanks’ New Movie Has Been Dominating Netflix All Week.\" It referred to the 2020 Tom Hanks film \"News of the World.\" According to charts on FlixPatrol, the movie was doing quite well on Netflix.", "However, the film was not available to stream on Netflix in the United States. The movie was only available on Netflix for international viewers. It also was not \"dominating\" Netflix. At least one other movie was seeing better numbers.", "In late February 2021, American readers might have been surprised by a story that pictured actor Tom Hanks with a curious headline. The headline from the We Got This Covered website read: \"Tom Hanks’ New Movie Has Been Dominating Netflix All Week.\"", "The story appeared to an unknown number of Google Discover users. The goal of Google Discover is to display personalized content to Google users that they might find relevant.", "The headline likely led American readers to believe that a new movie starring Hanks was available to them on Netflix. The company's headquarters after all are located in Los Gatos, California.", "However, it was all a bit misleading. Not included in the Google Discover card for the story was one important tidbit: the movie was not available to be streamed on Netflix in the United States. The fact was mentioned in the article, but not in the headline or teased in its description.", "The film was originally released in theaters in December 2020. It received an international Netflix release on Feb. 10, 2021.", "Also, according to charts on the FlixPatrol website, the movie wasn't \"dominating\" Netflix. In terms of numbers, the two films \"Finding 'Ohana\" and \"To All the Boys: Always and Forever\" were having a better month. As of Feb. 22, \"News of the World\" was number 3 for February worldwide. As for the week in reference, \"New\" was number 2 behind \"To All the Boys: Always and Forever.\"", "And as of late February 2021, there were no announced plans to bring \"News of the World\" to American Netflix users. The movie reunited Hanks and writer/director Paul Greengrass. The pair previously teamed up for \"Captain Phillips.\"", "Five years after the end of the Civil War, Captain Jefferson Kyle Kidd (Hanks), a veteran of three wars, now moves from town to town as a non-fiction storyteller, sharing the news of presidents and queens, glorious feuds, devastating catastrophes, and gripping adventures from the far reaches of the globe.", "In the plains of Texas, he crosses paths with Johanna (Helena Zengel, \"System Crasher\"), a 10-year-old taken in by the Kiowa people six years earlier and raised as one of their own. Johanna, hostile to a world she’s never experienced, is being returned to her biological aunt and uncle against her will.", "Kidd agrees to deliver the child where the law says she belongs. As they travel hundreds of miles into the unforgiving wilderness, the two will face tremendous challenges of both human and natural forces as they search for a place that either can call home.", "\"News of the World\" is available to rent on multiple streaming platforms in the U.S. for $19.99. The release date for the drop in price appeared to be March 23.", "A new Hanks film might one day appear on Netflix in the U.S., but this wasn't it.", "Jordan Liles is a Senior Reporter who has been with Snopes since 2016.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]