["“HELLO EVERYONE!! All students should enter here and apply for VIVO PHONES to attend online classes because of this pandemic period, VIVO is ready to give away 7000 phones to students to be attending online classes,” part of the post reads, asking readers to type “me” in the comments for a chance to win.", "The post, which we’ve archived here, has racked up more than 2,500 shares since June 15, 2020. Similar claims were shared here by the same Facebook page, using different pictures of mobile phones.", "The Chinese telecommunications company Vivo is not giving out phones in Nigeria, as claimed by the multiple posts. There are no such promotions on its official social media pages (here on Facebook and here on Instagram).", "“Please be informed that vivo Nigeria is not running any official promo or UGC at the moment,” Vivo Nigeria told AFP Fact Check via its verified Facebook account.", "One of the false posts, archived here, which has now been taken down, also claimed that Vivo is giving away 500 Vivo V21 Pro model phones to teachers and students in Nigeria. But AFP Fact Check ran multiple reverse image searches and found that the phone in the image is just a concept and not an actual phone.", "While Vivo V21 Pro is predicted by tech enthusiasts to hit the market soon, the phone itself has not yet been launched by the company. The earliest version of the concept we found was first shared here in April 2020 on a tech review YouTube channel.", "Here are pictures of all Vivo phones currently on the market. None of the pictures being paraded here and here is an actual Vivo phone on the market in Nigeria or elsewhere. They are concepts, some of which have been used for other brands (see here and here).", "An image shared as part of another false post was taken from Vivo Nigeria’s Instagram page, where it gave gifts to some people who bought a Vivo phone from any “authorised retail store”.", "This sort of scam is common in Nigeria. It is used to attract followers to a new Facebook page and for gathering the names, phone numbers and other personal details of unsuspecting Facebook users.", "As soon as you send them a message as instructed in the public post, you get an automatic response saying you have won a phone -- so long as you follow the instruction to share the post in multiple Facebook groups. You are also told to like the page and get others from those groups to like the same page.", "AFP investigated one such page in August 2019 and found that these pages employ such scams to grow their follower numbers, before selling them on.", "One of these pages running the Vivo giveaway scam was converted to a jewellery-and-watches-shop page before it was taken down.", "One of the pages still active on June 25, 2020, used to be run under a completely different name (“Holuwapelumi”) and featured a profile photo of a baby before it changed its name to “Vivo Mobile Phone Giveaway”, updated its profile photo to a phone, and started posting about the fake giveaway.", "Some other live pages employing similar tactics -- but using different phone brands -- to amass followers have also been archived here, here and here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]