["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Capital Public Radio / file photo", "Big-time spending is expected in the fight over California’s ballot measures this election year.", "One expert estimates campaigns could dole out nearly a half billion dollars to influence the fate of the dozen or more initiatives expected on the November ballot.", "Eight have already qualified. They include a measure to overturn the state’s ban on single-use plastic bags; one to raise funds for school facilities; and another that would regulate the cost the state pays for prescription drugs.", "Campaigns for a dozen additional initiatives, including a proposed tobacco tax hike, are gathering signatures and could qualify their measures later this year.", "As money pours in for and against these initiatives, a claim by Californians for Lower Drug Prices caught our attention. The campaign is backing a measure on the November ballot that would impose price controls on state prescription drug purchases.", "Supporters call the initiative the California Drug Price Relief Act.", "And they say spending by the measure’s opponent has dwarfed all other fundraising.", "\"Twenty-seven out-of-state pharmaceutical companies have raised more campaign dollars (against the prescription drug measure) than all other state ballot measures have raised to date, combined,\" Californians for Lower Drug Prices said in a March 21 press release.", "That campaign is funded by the Los Angeles-based nonprofit AIDS Healthcare Foundation, which offers health services and is often at odds with the pharmaceutical industry.", "We wondered was its claim about Big Pharma true? Had a group of pharmaceutical companies really outspent all other ballot campaigns, combined?", "How much did all that spending add up to?", "We set out on a fact check.", "Our research", "Californians Against The Misleading Rx Measure is the campaign opposing the ballot measure. It’s the one that is claimed to have outraised everyone by a wide margin.", "First, we checked to see if it’s contributions came from 27 \"out-of-state pharmaceutical companies,\" as claimed by Californians For Lower Drug Prices.", "We found the campaign in question is sponsored by the Pharmaceutical Research and Manufacturer’s Association of America, an industry group based in Washington D.C.", "And 27 of the 30 companies that had contributed to it are, indeed, from outside California, according to records on the secretary of state’s website.", "Johnson & Johnson of New Jersey and Pfizer, Inc., of New York, made the largest single contributions at $5.7 million each last year.", "Big Pharma is uniquely positioned to influence America’s political system. The pharmaceutical and health products industry spent more than $3.2 billion on lobbying from 1998 through 2015, according to the Center for Responsive Politics, a Washington D.C. based nonprofit that tracks money in politics. That was $1 billion more than the next sector, insurance.", "Also last year, the pharmaceutical industry had nearly 1,400 lobbyists working for it, the center reported.", "Capital Public Radio / file photo", "More than everyone, combined?", "Looking back at the California drug price measure, records show pharmaceutical companies spent nearly $53 million against it by mid-March.", "It’s a big sum, especially this early in the election year. The total ranks among the top 20 largest sums contributed by a campaign for or against a California initiative, according to the research group MapLight.", "But as we dug deeper, we found it’s not necessarily more that what’s been spent on all other 2016 ballot measures in the state, combined.", "It’s not even the highest total raised for an individual measure on this year’s November ballot.", "Another big money pot", "The $53 million from the pharma firms is certainly more than what’s been spent on all other ballot measures (about $33 million), but only if you look at what’s been doled out during the 2015-2016 election cycle.", "What’s missing is the huge sum -- nearly $59 million -- contributed by a California hospitals association over the past three years for a hospital fees measure on November’s ballot. Most of that money streamed in before this election cycle, because the measure was initially intended for the November 2014 ballot.", "When making its claim about the pharma cash, it appears Californians for Lower Drug Prices missed a big pot of money, said Ned Wigglesworth a Sacramento-based campaign strategist, who is not associated with either side on the prescription drug measure.", "\"The statement (by Californians for Lower Drug Prices) doesn’t appear to be accurate,\" he said. \"When you take a closer look at the (campaign) filings … you realize far more money has been raised.\" He estimated spending could eventually top $450 million for all measures on this year’s ballot.", "Representatives for the Californians for Lower Drug Prices campaign said they only looked at the 2015-2016 cycle, and \"missed\" the early money contributed by the hospital group.", "Kathy Fairbanks, a spokeswoman for the campaign backed by the pharma companies, said the claim about its spending \"is an early snapshot,\" noting it’s expensive to campaign in a state as large as California.", "But because other campaigns are expected to pour in hundreds of millions of dollars in more spending, she said the claim \"ignores the bigger picture. Look at (spending totals) in October.\"", "Our ruling", "Californians for Lower Drug Prices is backing a drug price control measure on the November ballot. In late March, it claimed: \"Twenty-seven out-of-state pharmaceutical companies have raised more campaign dollars (against the drug measure) than all other state ballot measures have raised to date, combined.\"", "From our research, it’s clear that 27 of the 30 companies backing Californians Against The Misleading Rx Measure are, indeed, from outside California. Together they’ve amassed nearly $53 million, which dwarfs the $33 million spent on all other initiative campaigns during the 2015-2016 election cycle.", "But what’s also clear is that Californians for Lower Drug Prices did not count a large pot of money, nearly $59 million, collected by a hospital association for a separate ballot measure. It says it simply \"missed\" these funds because it was focused on the current election cycle.", "Much of the $59 million was contributed outside the timeframe used to make the claim, but it is money that was gathered to be spent on a November ballot measure.", "This doesn’t take away from the fact that pharma firms have aggressively spent funds, so much that their totals already are in the top 20 for cash contributed for any California ballot measure.", "But the omission of the hospital association money leaves out important details that would give a different impression.", "We rate the claim Half True.", "CORRECTION: An earlier version of this article incorrectly stated that the pharmaceutical and health products industry spent more than $3.2 billion on lobbying efforts in 2015. The industry spent that total from 1998 through 2015. It spent $240 million in 2015, according to the Center for Responsive Politics.", "Source: California Secretary of State", "Californians for Lower Drug Prices, press release, March 21, 2016", "California Secretary of State, Power Search ballot measures database, accessed March 29, 2016", "Center for Responsive Politics, lobbying by industry database, accessed March 31, 2016", "Los Angeles Times, news article, That blockbuster California ballot will be a $452-million battle, Feb. 16, 2016", "MapLight, news article, \"Pharmaceutical industry gives nearly $50 million to fight prescription drug initiative,\" March 13, 2016", "Sacramento Bee, \"Drug price-control measure qualifies for fall 2016 ballot,\" December 18, 2015", "Interview, Vince Duffy, spokesman, Californians for Lower Drug Prices, March 29, 2016", "Interview, Kathy Fairbanks, spokeswoman, Californians Against The Misleading Rx Measure, March 30, 2016", "Interview, Kevin Riggs, spokesman, Californians United for Medi-Cal Funding and Accountability, March 30, 2016", "Interview, Ned Wigglesworth, founding partner, Spectrum Campaigns LLC, March 30, 2016", "Interview, Miriam Marks, data director, MapLight, March 30, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]