["By Lori Robertson", "Posted on October 24, 2018", "In his midterm campaign rallies, President Donald Trump has repeatedly made the preposterous claim that he came up with “the greatest idea” for “veterans choice” — a program that was launched in 2014 during the Obama administration. He also claimed it took “44 years” to get the legislation passed.", "In fact, nothing he said about the program’s origin is true.", "Trump, Nevada, Oct. 20: And we just passed — after 44 years, we just got it passed, I signed it two months ago, veteran’s choice, so that if they have to wait on line for 12 days or 14 days or 32 days, or much longer than that — can you believe it? …", "They go immediately to see a doctor privately. We pay for their bill. …", "But I thought it was so brilliant, I came back to my group, I said, I got the greatest idea, because I haven’t been doing this that long, so, you know, it wasn’t like high on my list, but it became high. I did know the veterans were never treated fairly. But I said, I have the greatest idea. We’re going to do this. If a veteran has to wait, we’re going to send them to a private doctor. We’ll pay the bill. What a genius — I said, I said, how good is that? They said, “Sir, we’ve been trying to get it passed for 44 years.” So I was good at getting things passed. That’s what I did.", "Ten days earlier, at a rally in Pennsylvania, the president told the crowd: “When I first heard about it, I mean, it’s not like I was studying it for my whole life. But I heard about it three-and-a-half years ago. I said, I have an idea. Let’s — when they wait on line for 10 days, 22 days, 38 days, you have to see, months and months, why don’t we let them go see a private doctor and we pay the bill? It will solve our problem. And I told everybody: I am the most brilliant guy in the world. Who else would think — who else would think of that?”", "And at his rally in Kentucky on Oct. 13, Trump said this was “the greatest idea I think I’ve ever had.”", "In fact, that was the idea for the Veterans Choice Program, which was created by the bipartisan Veterans Access, Choice, and Accountability Act, signed by President Barack Obama on Aug. 7, 2014. The legislation, which garnered a 91-3 vote in the Senate and a 420-5 vote in the House, followed a scandal over wait times at Veterans Affairs facilities.", "The VA summary of the 2014 bill said it would “allow those Veterans who are unable to schedule an appointment within 30 days of their preferred date or the clinically appropriate date, or on the basis of their place of residence to elect to receive care from eligible non-VA health care entities or providers. This is separate from VA’s existing program providing Veterans care outside of the VA system.”", "If a veteran lives more than 40 driving miles from the closest VA medical facility or faces other travel burdens, or the VA can’t provide the services required, that veteran can receive care from another provider, according to the Department of Veterans Affairs, which says on its website that Veterans Choice is “one of several programs through which a Veteran can receive care from a community provider.”", "Since Trump took office, he has continued the program, signing legislation to provide funding for the program and to eliminate the expiration date. In June of this year, Trump signed the bipartisan VA MISSION Act, which provided funding to keep the Veterans Choice program for one more year, and then called for consolidating it and other private-care options into a new Veterans Community Care Program.", "The MISSION Act — a “significant portion” of which came from earlier bipartisan legislation from Republican Sen. Johnny Isakson and Democratic Sen. Jon Tester, according to the senators — says that under the consolidated program a veteran can go to a private medical provider if “the covered veteran and the covered veteran’s referring clinician agree that furnishing care and services through a non-Department entity or provider would be in the best medical interest of the covered veteran,” based on criteria to be set by the VA secretary. Those criteria will include distance from a medical facility, type of services needed, and the timeliness of appointments.", "A June Government Accountability Office report said that it wasn’t clear whether the Choice Program had “improved the timeliness of veterans’ care because VA’s data are incomplete and unreliable,” and Tester has said the new law “streamlines community care.”", "So, Trump has continued the Veterans Choice Program and the new law could expand eligibility for such services. But how can Trump say a law that was passed years before he took office was both his idea and 44 years in the making? We asked the White House press office but haven’t received a response.", "In some of his rallies — such as Oct. 12 in Ohio — Trump merely claims that “I got done what they’d been trying to do for 44 years.” But on several occasions he has expanded that falsehood into a story about “the greatest idea I think I’ve ever had.”", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]