["About this rating", "On March 2, 2021, as lawmakers in the United States continued to debate a proposal to raise the minimum wage to $15 an hour, U.S. Rep. Alexandria Ocasio-Cortez posted a message on Twitter noting that McDonald's workers in Denmark were making $22 an hour and also got six weeks paid vacation:", "This tweet is largely accurate. McDonald’s workers in Denmark truly make more than $20 an hour and they truly get six weeks of paid vacation.", "We reached out to 3F, the union that represents fast food workers in Denmark, to get some more information about the wages at McDonald’s. The union representative told us that the pay scheme in Denmark isn’t as simple as saying that all employees make $22 per hour. The majority of McDonald’s workers in Denmark are part-time, and currently receive a base pay of about $20 an hour. Employees earn additional wages for working off-hour shifts (weekends or nights), overtime, and holidays. Employees over the age of 20 also receive a pension plan.", "The agreement with McDonalds does not only include salary per. hour and 6 weeks holiday. There is extra charge for evening and night work. Payment for seniority, holiday payment (Easter and Christmas for example, (100%), on top of all payment there is an extra 6.85%, Pension plan for employees from the age of 20 (12%).", "The 3F union rep told us that agreements are renewed every few years. The most recent agreement from 2020 has McDonald’s employees over the age of 18 earning a minimum of DKK 127,24 (about $20.59) per hour, with a slight increase in 2021 (DKK 129,74 or about $21 per hour) and 2022 (DKK 132,24 or $21.40).", "As for paid vacations, every working person in Denmark is entitled to five weeks of paid vacation, thanks to the country’s “Holiday Act.” The government of Denmark's website explains:", "If you try to visit a Danish office during the last weeks of July, you may find the doors locked entirely.", "Business largely shuts down at this time of year, as the Danes take time off to enjoy the short Danish summer. Every employee is legally entitled to five weeks' paid vacation per year, and the Danes are not shy about taking every minute of it.", "Work-life balance is important in Denmark - people take pride in their work but do not feel the need to demonstrate their dedication by working long hours.", "The 3F union rep told us that employees at McDonald’s negotiated for an additional week of paid vacation.", "In the Danish labor market, all employees have 5 weeks paid holiday by law. Some of the things that are extra in the companies that have a collective agreement, just like McDonalds, is one week more (called Feriefridage). So, the answer to your question is yes. McDonalds employees have 6 weeks' paid vacation for all.", "McDonald’s workers in Denmark truly make more than $20 an hour. It’s worth repeating, however, that these wages were not determined by the country’s minimum wage. In fact, Denmark does not have a nationwide minimum wage. Rather, the country has a robust union presence and issues such as wages and vacation time are often decided via collective bargaining.", "Another point that is often raised when comparing McDonald's wages in Denmark vs. the United States is how much these wages impact menu prices. While we can't provide any exact figures here, we can say that the change in price isn't extreme. A review by The New York Times, for instance, found that Big Macs cost \"about 27 cents more on average in Denmark than in the United States.\" But according to the \"Big Mac Index\" from the Economist, a Big Mac costs 76 cents less in \"Denmark (US $4.90) than in the United States (US$5.66) at market exchange rates.\"", "4 March 2021 [UPDATED]: Included additional information from a 3F union representative.", "4 March 2021 [CORRECTION]: A previous version of this article misstated figures from an annual financial report from McDonald's Denmark", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]