["About this rating", "An \"ardent supporter\" and possible grassroots activist for Donald Trump named Brandon Hall was convicted in Michigan on ten counts of election fraud relating to signature collection during a 2012 downticket election.", "Hall's conviction was years before the 2016 election and unrelated to Donald Trump.", "What, if any, work Hall did in 2016.", "On 30 November 2016, blog posts appeared claiming that a Michigan Donald Trump campaign staffer was convicted on ten counts of felony election fraud:", "“Donald Trump has made claim after claim calling the integrity of the election into question,” Progress Michigan‘s Lonnie Scott said. “But his Michigan campaign had no problem hiring a staff member facing election law charges.”", "Various articles mentioned details of the case — most of which took place in 2012 — but insinuated that Hall's integrity was somehow a harbinger of fraud present in the Trump campaign.", "But the story was well covered by Michigan-area news outlet, which reported no such tie to the President-elect. On 29 November 2016, the Grand Haven Tribune reported:", "Four years after he forged signatures on a petition for an Ottawa County judicial candidate, Brandon Hall is finally on trial.", "And it’s not because the wheels of justice are slow to turn — it’s because it took that long for the case to work its way through the appeals process. That process is based on a question of whether Hall, now 27, should be charged with misdemeanors or felonies.", "The Grand Haven man faces 10 felony counts of election law forgery, based on petitions he filed in May 2012 for then-judicial candidate Chris Houghtaling.", "Hall has admitted to forging signatures on the petitions in an effort to get enough signatures for Houghtaling prior to the May 1, 2012, filing deadline. Both the prosecutors and defense have stipulated (agreed) to those facts.", "The felony case was thrown out at the District Court level due to language on the petition that states anyone signing a false name on a petition is guilty of a misdemeanor.", "WHTC also covered Hall's conviction, in an article that made no mention of Donald Trump:", "The political blogger and Grand Valley State University Graduate was convicted Wednesday, November 30. In 2012, Hall forged signatures and addresses on a petition to nominate a judicial candidate ... Hall will be sentenced on December 27 in 20th Circuit Court.", "Many of the claims connecting Hall to Trump appeared to originate with a political columnist:", "Brandon Hall of the Michigan Trump campaign was just convicted of 10 of 10 counts of election fraud. https://t.co/KUJV4qNAiv", "— Susan J. Demas (@sjdemas) November 30, 2016", "Hall runs the West MI Politics blog and ran for state House this year as a Republican. Case goes back to 2012.", "— Susan J. Demas (@sjdemas) November 30, 2016", "Demas linked to a blog post asserting that Hall was a \"key figure\" within the Michigan Trump campaign organization, but without key details about his role or relationship to the national campaign. Hall was described as having a \"significant campaign position,\" but the post did not provide his title or the scope of that position:", "Brandon Hall, the controversial west Michigan blogger who served as a key figure in the Donald Trump campaign’s organizing efforts across the state, was found guilty [in November 2016] on 10 felony counts of election fraud ... While Hall was not a part of the national Trump campaign apparatus, he emerged early in the primary election season as an ardent supporter of the New York billionaire and later played a key role as a leader of the Trump camp’s grassroots efforts in the state.", "Hall and a group of young GOP activists emerged as the team that would provide field work and organizing efforts. The state communications director for Trump praises Hall’s campaign role in a post-election commentary on Facebook:", "“Beyond just helping me, he wore about 10 different hats for the campaign and came through for everyone time and time again, even when he knew he would not be receiving the credit,” said Tim Lineberger. “I am proud to call Brandon one of my best friends and look forward to seeing what he does next. No doubt it will be HUGE!”", "It’s unclear if the national Trump campaign team was aware of Hall’s track record of law-breaking when they put him in a significant campaign position.", "At the time of Lineberger's attributed remarks, Hall had not been convicted of \"law-breaking.\" Although it seemed Hall was, at the very least, a grassroots Trump supporter, it was unclear if he worked in an official or unofficial capacity (or at all) for the Trump campaign in 2016 in Michigan.", "Hall was charged with election fraud (in relation to signature-gathering) in 2012, and that conviction was unrelated to the Trump campaign in Michigan in 2016. A search of Google restricted to results prior to 31 October 2016 returned nothing indicating that Hall was officially or unofficially linked with the Trump campaign.", "We contacted Hall via e-mail to clarify the claims, but have not yet received a response.", "Murphy, Mary Ellen.   \"Jury Finds Brandon Hall Guilty Of Election Fraud.\"\r\n    WHTC.   1 December 2016.", "Sekweski, Chad.   \"Top Trump Campaign Aide In Michigan Guilty On 10 Felony Counts.\"\r\n    Politically Speaking.   30 November 2016.", "Vargo, Becky.   \"Update: Brandon Hall'S Election Forgery Trial Enters Second Day.\"\r\n    The Grand Haven Tribune.   29 November 2016.", "WMXI.   \"West Michigan Man Found Guilty Of Election Fraud.\"\r\n    30 November 2016.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]