["The Facebook post, archived here by AFP Fact Check, is captioned: “City Center - Pretoria today”, and was shared more than 1,400 times and provoked dozens of comments. A number of people stated that the picture showed a rubbish workers’ strike in Johannesburg in 2015.", "A reverse image search on TinEye (which tells you where an image appears on the web) leads to an article on a site called The New Observer, dated December 8, 2015. The pictures with the article are captioned:", "“Three photographs taken on December 7, in Johannesburg, South Africa. The country’s largest city is in the midst of a municipal workers’ strike, and part of their “protest” action consists of throwing the city’s trash into the streets.”", "We located the intersection where the littered scenes were captured in Johannesburg on Google Maps Street View, dated March 20, 2017, using markers that can be seen circled in red.", "Between November and December 2015, waste management employees took to the streets and dumped rubbish over two weeks in a bid to raise wages -- watch a local report here for more.", "Pretoria is South Africa’s administrative capital and hosts the offices of the presidency.", "Criticism of poor service delivery is common in South Africa, which is preparing for national elections on May 8.", "African National Congress (ANC) and the Democratic Alliance (DA) representatives have both acknowledged a waste disposal problem and announced clean-up initiatives in recent months. - see here and here respectively.", "The issue has also sparked debate among representatives of both parties on Twitter.", "You represent a party that focused its energies on looting public purse instead of public service, hence the current level of environmental degradation today. https://t.co/F7dJ7bd7Ex", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]