["About this rating", "In July 2016, a video showing a strange object soaring through the sky appeared on social media, and was subsequently widely circulated. Some web sites claimed that it showed a UFO over an airport in Turkey:", "Two lines of lights that seemed to be tangled in the night sky. Such a view is yesterday greeted the people in Turkey, near the local airport. Some began phenomenon labeled as a Frisbee, while others trail behind the rocket fuel residues or space junk or a comet.", "Most people refer to mysterious lights as evidence that the UFO flew over Turkey and commenting on him by saying: \"They are coming\" or \"Welcome to the world of aliens\" . Others again have speculated that it may be a very close flyby of an asteroid.", "The video displayed above does not show an unidentified flying object, nor was it taken in Turkey; it's actually an Atlas V rocket, which was launched from Cape Canaveral, Florida on 2 September 2015. A video of the launch shows the rocket making a similar formation in the sky:", "Col. Shannon Klug, commander of the Air Force's 45th Space Wing Weather Squadron, told USA Today at the time that the formation was simply the rocket's exhaust fumes, which were highlighted by early morning sunlight:", "The 21-story Atlas V painted a white streak through the dark sky starting several hundred miles down range. Then an egg-shaped glow appeared to surround the rocket's exhaust trail and spread outward, a strange and somewhat eerie scene that led some, remembering SpaceX's failed launch in June, to fear the mission was in trouble.", "It was not, nor was any unusual weather responsible for the striking visual effects.", "\"Simply put, it was due to the sun's angle at time of launch,\" explained Col. Shannon Klug, commander of the Air Force's 45th Space Wing Weather Squadron. \"The sunrise highlighted the normal expansion of the exhaust plume which expands as the atmospheric pressure decreases with altitude. The rays of the sun caught the expanding gasses just right and ... magic!\"", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]