["By Angelo Fichera", "Posted on December 2, 2019", "A doctored photo circulating on Facebook purports to show Rep. Adam Schiff with the late financier and sex offender Jeffrey Epstein. The original photo shows Schiff with his father.", "A viral photo shared on Facebook has been manipulated to show Rep. Adam Schiff sitting on a couch alongside the financier and sex offender Jeffrey Epstein.", "Some sharing the photo deemed it evidence that the two were apparently “buddies.”", "But the original photo actually showed Schiff, a Democrat from California, with his father, Ed Schiff, during Thanksgiving last year. Schiff posted the picture in November 2018 on Twitter; he previously shared a photo of his father on Facebook.", "Eve and I are spending a wonderful Thanksgiving with my 90 year old Dad, Ed, and cousins Karen and Julia. Alexa is away for her studies and Eli is our photographer! Wishing you and your family a Happy Thanksgiving! pic.twitter.com/6LYg1DzMCh", "— Adam Schiff (@AdamSchiff) November 22, 2018", "The altered photo swaps the elder Schiff’s face with that of Epstein, and includes a sex toy that was not in the original image.", "Epstein, a financier with connections to high-profile politicians, died in what officials ruled a suicide in a federal prison in Manhattan; he was being held on charges of sex trafficking of minors.", "Schiff, who chairs the House intelligence committee, recently has gained national attention for his role overseeing part of the impeachment inquiry into President Donald Trump.", "We’ve previously debunked other claims involving Epstein, including a widely circulated — and bogus — image that was edited to show Epstein with Trump and Trump’s daughter Ivanka.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "“Jeffrey Epstein Charged In Manhattan Federal Court With Sex Trafficking Of Minors.” Press release, U.S. Attorney’s Office for the Southern District of New York. 8 Jul 2019.", "Schiff, Adam (@AdamSchiff). “Eve and I are spending a wonderful Thanksgiving with my 90 year old Dad, Ed, and cousins Karen and Julia. Alexa is away for her studies and Eli is our photographer! Wishing you and your family a Happy Thanksgiving!” Twitter. 22 Nov 2018.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]