["A video of man removing his burqa in front of two police personnel has gone viral on the Indian social media ecosystem. It is being claimed that Sri Lankan police has caught a Buddhist man masquerading as Muslim woman. The video caption declares that this man was “one of the rogues” involved in Sri Lanka Church bombing.", "A Buddhist dressed as a Muslim woman was caught by the Sri Lankan Police. He os one of the rouges who bombed the Sri Lankan Church.😡😡😡😡😡😡", "Posted by Mohammad Shafi Mulla on Tuesday, 23 April 2019", "Several Individual users on Facebook and Twitter have shared the video with an identical narrative in the backdrop of the recent bombings in Sri Lanka.", "Few more individuals on WhatsApp, have inquired about the veracity of the video, which is also indicative of the fact that it’s also viral on the social media platform.", "Alt News found that the video now shared in the backdrop of the bombings is actually an old video. The viral video has a watermark of a website (www.http://nethnews.lk). A relevant keyword search on this website bore no results. Alt News contacted a local Sri Lankan journalist, who contacted the owner of the said website seeking details about the video. Within an hour, Neth FM, a Facebook page associated with the website put out a clarification regarding the video. According to the website, it’s an old video from August 2018.", "දැනුවත් කිරීමයි!", "මේ මොහොතේ සාමාජජාල ඔස්සේ සංසරණය වන මෙම වීඩියෝව 2018 අගෝස්තු මස 29 වන දින පළවූ පුවතකට අදාළ වීඩියෝවක් බව සලකන්න.", "එම පුවතට අදාළ සබැඳිය – http://nethnews.lk/article/57706", "Posted by Neth FM on Monday, April 22, 2019", "According to this article published in August 2018, the man, who was dressed in a Burqa, was arrested by Welikada police. Welikada is a suburb of Colombo, Sri Lanka. He was arrested at Welikada plaza after the driver of a tuk-tuk (rickshaw) tipped off the police. The report also said that the police are investigating the matter further.", "We found the same video published by a YouTube channel Balanna Watinawa on Aug 29, 2018", "In conclusion, an unrelated video of a man masquerading as a Muslim woman, being searched by the local police, was shared as of the accused arrested in the aftermath of the recent serial blasts in Sri Lanka.", "Donate Now", "Co-founder, Alt News Co-Founder Alt News, I can be reached via Twitter at https://twitter.com/zoo_bear", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "Amid the ongoing Israel-Palestine conflict, media outlet Times Now put out a report claiming that…", "A 45-second video clip is being shared widely on social media where a group of…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…"]