["“Bernie’s Logic: ‘Nobody can live on $7 an hour. We must raise the minimum wage to $15 an hour. Also we must raise the tax rate to 52%,’” according to the post, shared here and here.", "“$15 an hour x .52% = $7.80,” it says. “$15 an hour - $7.80 = $7.20.”", "Another version of the claim has been made on Twitter here.", "Sanders has repeatedly called for the minimum wage to be increased to $15 an hour from its current federal rate of $7.25.", "He has also proposed a tax rate of 52 percent -- but not for people making $15 an hour.", "A section of his website explaining how he would pay for his various plans lists “raising the top marginal income tax rate to 52% on income over $10 million” as an option.", "Sanders also suggested the same marginal tax rate on income above $10 million during his 2016 run for president, according to an archived version of his website.", "Even if the rate for Americans making $15 an hour was 52 percent, not all of their earnings would be taxed at that level, as the false claims state.", "There is a standard deduction of $12,400 for individual filers in 2020, which means at least that amount of income would not be subject to taxes.", "Sanders has emerged as the front-runner for the Democratic presidential nomination.", "He is advocating using revenue from various tax increases on well-off Americans to pay for plans aimed at helping those with lower incomes.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]