["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A rumor making the rounds on social media regarding the untimely death of actor Vin Diesel may be leaving readers feeling quite aghast and furious.", "\"Just in: actor ‘Vin Deisel’ (sic) dies after a failed attempt to perfect a stunt on set,\" reads a headline of an article on the website thth.mayatmenen.info.", "That sounds sadder than the death of Groot. But did it really happen?", "The article is a pitch-black void of evidence to suggest that Diesel died. This story was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Figuring out the facts of this story was less complicated than the plot of XXX.", "For starters, Diesel’s name is spelled incorrectly in the headline.", "It’s also notable that there’s no byline for the article. Reputable news stories usually come with a byline to keep writers accountable and allow readers to contact the author if necessary.", "Below the headline, there are two paragraphs lifted, word-for-word, from Vin Diesel’s Wikipedia page.", "The page also contains a video clip featuring a Fox News logo and a newscaster. Clicking on it, you’d expect to hear a news anchor reporting on the news of Vin Diesel’s death.", "But if you click on the video, you’ll actually hear the anchor say, \"Finally, I have some very sad news,\" before the clip freezes and is replaced by the words \"Share to Uncover This Video.\"", "Clicking on those words opens up a pop-up window that allows you to share a link to the article on Facebook.", "We found after we shared the story, the video still would not load.", "A Nexis search revealed that no major news outlets have reported on Diesel’s death, and no obituaries have been written for him.", "This isn’t the first time that incorrect rumors of Diesel’s death have spread like the Necromongers across the galaxy. The hoax occurred at least one other time, in 2014.", "We were unable to get in touch with the website where the article was posted, as we could not find any contact information for them.", "A story on a website, thth.mayatmenen.info, claims that actor Vin Diesel died \"after a failed attempt to perfect a stunt on set.\"", "The article provides no evidence to support this claim, and no major news outlets are reporting that Diesel died.", "This is an iron giant of a hoax. We rate it Pants on Fire!", "Thth.mayatmenen.info, \"JUST IN: Actor 'Vin Deisel' dies after a Failed Attempt to Perfect a Stunt on set,\" accessed August 22, 2018", "Wikipedia, \"Vin Diesel,\" accessed August 22, 2018", "Snopes, \"Vin Diesel Death Hoax,\" June 12, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]