["The 38-second video was posted here on Twitter on August 17, 2020. It has been viewed more than 293,000 times.", "The tweet’s caption states: “MASSIVE PROTESTS MILLIONS in #SouthKorea in, get this, a Q Protest! O.O BOOM Against Mask Restrictions, against #COVID19 #Scamdemic Against #ChildTrafficking & against the #NWO #Globalism by #UN #EU &the Elite Crime Cabals. INCREDIBLE #Spain also Today”.", "The claim circulated online two days after an anti-government rally in Seoul on August 15. Many protesters can be seen wearing face masks in this Facebook live footage from the protest. On August 30, the South Korean government ramped up coronavirus restrictions for Seoul residents with a week-long advisory to stay at home, state news agency Yonhap reported here. The move came after another surge of Covid-19 cases in the country.", "The video has also been viewed tens of thousands of times here on Twitter; and here and here on Facebook alongside a similar claim.", "The claim, however, is false; the video was first published online in October 2019, nearly four months before the first case of Covid-19 was reported in South Korea in January 2020.", "A reverse image search using the video verification tool InVID-WeVerify found an earlier version of the video posted on Twitter here on October 3, 2019.", "October 2019 video", "A keyword search around October 3, 2019, found this Yonhap report published on the same day. The headline reads: “S. Koreans hold massive rally against justice minister”.", "The article states in part: “Hundreds of thousands of South Koreans took to the streets in downtown Seoul Thursday calling for the ouster of Justice Minister Cho Guk as prosecutors questioned Cho's wife as part of a widening probe into corruption allegations surrounding the family.”", "Cho announced his resignation 10 days after the mass rally, Yonhap reported here on October 14, 2019.", "Rally location", "The Koreana Hotel, which is located in Seoul, is visible in one of the photographs of the October 3 rally published by Yonhap, as seen in the screenshot below.", "Travelling northward from Koreana Hotel on Google Street View found the same brown structure with a billboard that matches the Twitter video at the four-second mark.", "Below is a screenshot comparison of the Twitter video (L) and Google Street View imagery (R) with the corresponding feature circled in red by AFP:", "Google Maps indicates the building belongs to insurance company Kyobo Life.", "An illustration on Kyobo’s website of an advertisement displayed on that particular billboard between September 2 and November 30, 2019, matches the one seen in the October 3, 2019 Twitter video.", "Below is a screenshot comparison of the Twitter video (L) and the ad illustration on Kyobo Life’s website (R):", "Other media footage from October 2019", "A separate keyword search on former justice minister Cho found this YouTube video published by South Korean newspaper The Chosun Ilbo on October 3, 2019.", "The October 3, 2019, Twitter video and the Chosun Ilbo footage share matching elements, as AFP has highlighted in the screenshot comparison below:", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]