["About this rating", "Najat Vallaud-Belkacem, who was France's Minister of Education between 2014 and 2017, was born on 4 October 1977 in the rural Rif region of Morocco. For a few years she grew up in relatively inauspicious circumstances, herding goats with her grandfather and living without electricity or running water before moving with her family to France.", "Her personal history, unusual for a highly accomplished French politician, has formed the basis of numerous memes and articles over the past five years or so — many of them intended to inspire the reader, and all of them claiming to feature an old photograph of Vallaud-Belkacem as a young girl, during her early years in Morocco.", "The IndiaTimes.com web site prominently used the photograph of the girl said to be Vallaud-Belkacem in a 2016 article, Storypick.com used the same girl's image to illustrate a description of Vallaud-Belkacem's life story, and many memes have featured the same image, including one which was posted by the \"Epoch Times Canada\" Facebook page in May 2018:", "The photograph of the girl on the left-hand side of this meme is not a young version of the future politician, a claim first debunked in 2016 by Les Décodeurs, the fact-checking project of the French newspaper Le Monde (although the adult woman on the right-hand side is indeed Vallaud-Belkacem).", "The photograph of the little girl was taken in Morocco on 15 June 2005 by United Nations Children's Fund (UNICEF) photographer Giacomo Pirozzi. The girl, named Fouzia, was eight years old at the time, and UNICEF has used her photograph in official publications ever since (here, for example, on page 26).", "A spokesperson for UNICEF sent us a copy of the original photograph, along with a caption describing the subject as follows: \"Eight-year-old Fouzia rests on a stone in front of a herd of sheep in Tamezaghete Village in the rural district of Iguerferouane in Al Haouz Province. Fouzia attended school for one year but had to drop out because her parents could not afford her books.\"", "Courtesy of UNICEF. © UNICEF/UNI45185/Pirozzi", "Although the girl pictured here is not Vallaud-Belkacem, the former education minister did grow up in a rural part of Morocco, as she recalled in a 2013 radio interview with France Info (translated):", "I have memories etched in my mind in which I'm with my grandfather, minding the goats, for example. Or where I'm fetching water from the well, because we didn't have running water, or electricity for that matter. I can see us very clearly, coming down the mountain in sandals.", "In a March 2017 interview with Porter magazine, Vallaud-Belkacem discussed her early years in further detail:", "Reports in the French press that I was a child shepherd hold a grain of truth: I was born in Morocco and lived in Bni Chiker, a mountain hamlet in the north. My early childhood was spent as a country girl living with near and extended family, all under one roof. We were quite poor. I helped my grandfather with the goats, drew water from a well, and spent most of the day in flip-flops. I don’t have many specific memories, but I carry with me the feeling of a happy family life. Then, in 1982, when I was four, we came to France to join my father, who had moved here in 1975 to work in construction.", "Vallaud-Belkacem became a lawyer and got involved in Socialist Party politics, first coming to national attention in 2007 when she served as a spokesperson for the unsuccessful presidential campaign of Ségolène Royal, and she later worked on the successful 2012 campaign of François Hollande. She held three cabinet positions under Hollande, most notably Minister for Education.", "In June 2017, Vallaud-Belkacem failed to secure election to France's National Assembly and expressed a desire to step back from political life, later joining the international polling firm Ipsos.", "Bisaria, Anjali.   \"Once a Shepherd Girl in Morocco, Najat Vallaud-Belkacem Is Now France's Education Minister!\"\r\n    IndiaTimes.com.   5 September 2016.", "Devnath, Vinay.   \"How Did a Shepherd Girl Become the French Education Minister? Here's Her Inspiring Story.\"\r\n    Storypick.com.   23 April 2016.", "Sénécat, Adrien.   \"Les Fausses Photos d'Enfance de 'la Petite Bergère Devenue Ministre.'\"\r\n    Les Décodeurs/Le Monde.  30 August 2016.", "France Info.   \"Najat Vallaud-Belkacem, du Rif aux Bancs de Sciences Po.\"\r\n    France Info.   30 November 2013.", "Isaac-Goizé, Tina.   \"Every Struggle Is an Opportunity.\"\r\n    Porter Magazine via Najat-Vallaud-Belkacem.com.   March 2017.", "Vallaud-Belkacem, Najat.   \"Parcours.\"\r\n    Najat-Vallaud-Belkacem.com.   Accessed 23 July 2018.", "Fabre, Thierry.   \"Législatives: l'Échec Cuisant de Najat Vallaud-Belkacem.\"\r\n    Challenges.   12 June 2017.", "Amar, Cécile.   \"Najat Vallaud-Belkacem Ne Briguera Pas la Tête du PS: 'Je Ne Veux Pas d'Une Vie Réduite à la Politique.\"\r\n    L'Obs via Najat-Vallaud-Belkacem.com.   3 January 2018.", "Perroud, Marion.   \"Najat Vallaud-Belkacem s'est Trouvée un Nouveau Job dans un Grand Institut de Sondage.\"\r\n    Challenges.   21 February 2018.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]