["By Jessica McDonald", "Posted on November 5, 2020", "An inaccurate graphic on a local TV station briefly showed one Pennsylvania county with more mail-in votes than the number of ballots it had received. The graphic was quickly corrected, but Facebook users are now sharing screenshots of it to misleadingly suggest it is evidence of voter fraud.", "Post-election Facebook posts are circulating an image of a local news station’s implausibly high mail-in vote tally, with some misleadingly suggesting it is evidence of voter fraud. The tally, however, mistakenly included both in-person and mail-in ballots.", "One post on Nov. 4, which has since been removed but was archived by the fact-checking website Lead Stories, shows part of a man’s arm and various on-screen vote totals for Lancaster County in Pennsylvania.", "According to the image, 142,584 mail-in ballots had been counted, even though only 89,681 had been returned and 108,539 had been requested. “Just in case your wondering how biden is gonna win,” the post reads.", "Another Nov. 4 post shows the same photo and asks, “Anyone see a problem with this?” Some 60 other iterations of the same claim were shared on Facebook.", "The photo is real but is not evidence of voter fraud, as some posts imply. The CBS affiliate in Harrisburg, CBS 21, told the news site LancasterOnline that the images were from its Nov. 3 broadcast.", "Bryan Queen, CBS 21’s news director, said the station quickly saw that the mail-in total was wrong and made a correction on-air, including fixing the graphic.", "On Twitter, CBS 21 sports reporter Joel D. Smith also shared the origin of the snafu.", "“As I explained on-air,” Smith said — noting that it was his arm in the screenshot — “there was a temporary reporting error that put all ‘in person’ votes together with ‘Mail-In’ votes creating the incorrect totals. We were there to clear up the confusion. A screen shot without context adds to it unfortunately.”", "Anthony D’Agostino, a news editor at the station, said in a Nov. 5 tweet that the numbers were auto-populated by the state election website. Since the numbers came directly from the state, Queen said he thought the error came from the county and the way it had submitted its data.", "Lancaster County Election Director Randall Wenger told us in a phone interview that the county provides a data file to the state that includes ballot type information — and suggested that perhaps something had gone wrong on the state’s site — but that the county website only provides a total vote tally.", "In a Nov. 5 press conference, Pennsylvania Secretary of State Kathy Boockvar was asked about the artificially high mail-in count on election night in Lancaster County, and said she suspected the issue had to do with the county’s data file, although she couldn’t remember the specifics for Lancaster.", "“If the county’s files were not done perfectly, it might merge two of the categories, it might put things in the wrong category,” she said. “Most of it has been, the county — the way they sent us the files, the data was just not in the right place, basically.”", "In any case, she added, the errors had been fixed.", "Indeed, the notion that the broadcast’s faulty figure — which was rapidly remedied — somehow constitutes nefarious voter activity is incorrect.", "“Around 110,000 absentee and mail-in ballots were issued; we ultimately got back 91,000 of those,” said Wenger. He said the county had completed its count of all votes received up through 8 p.m. on Election Day, although more would be counted in the future, including provisional ballots and overseas and military ballots.", "The county’s current numbers show a total of 273,527 votes cast for three presidential candidates, with 112,536 for former Vice President Joe Biden and 156,938 for President Donald Trump. (Libertarian presidential candidate Jo Jorgensen received 4,053.) Those figures match the state’s website, which shows that 87,387 of those ballots were mail-in.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here for more.", "Perkins, Olivera. “Fact Check: TV News Graphic Does NOT Show Pennsylvania Mail-in Voter Fraud.” Lead Stories. 4 Nov 2020.", "Walker, Carter. “No, Lancaster County did not count more mail-in ballots than it received.” Lancaster Online. 5 Nov 2020.", "Smith, Joel D. (@JoelDReports). “HEY GUYS… That’s my arm! As I explained on-air-there was a temporary reporting error   that put all “in person” votes together with “Mail-In” votes creating the incorrect totals. We were there to clear up the confusion. A screen shot without context adds to it unfortunately.” Twitter. 4 Nov 2020.", "D’Agostino, Anthony (@ADagostinoTV). “Hi I work at the station.  Those numbers are auto populated by the state election website.  We don’t actually input any numbers. So this is because the state election website was incorrect at the time the anchor pulled up Lancaster’s numbers.” Twitter. 5 Nov 2020.", "Wenger, Randall. Lancaster County Election Director. Phone interview with FactCheck.org. 5 Nov 2020.", "“Election Returns Totals.” Lancaster County website. Accessed 5 Nov 2020.", "“Election Update.” Pennsylvania Department of State. Press conference posted to Facebook. 5 Nov 2020.", "2020 Presidential Election Unofficial Returns. Pennsylvania Department of State. Accessed 5 Nov 2020.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]