["On March 19, Alt News received several requests to fact-check a 45-second video on WhatsApp (+91 76000 11160) and on our official Android application. This was shared with the text, “It was seen in the skies of iraq today & peopel were crying & scared thinking the end of the world is near.”", "The viral video, which is also circulating on Twitter and Facebook, shows a planetary object or a moon rotating next to a circular rainbow. Throughout the video, we can hear people scream in terror.", "It was seen in the skies of iraq today & peopel were crying & scared thinking the end of the world is near pic.twitter.com/dO0A1hHWn2", "— Hasan Ahmad Qasmi (@hasanqasmi) March 16, 2020", "A Twitter user posted the viral video and claimed it is from Uttar Pradesh. Alt News received an app request where it was suggested that the clip was shot in “Jalalpur Ambedkar Nagar”.", "A Facebook user shared the viral video along with Gujarati text, “Today in the skies of Iraq, strange structures were seen and people started crying for fear that this was the beginning of the end of the world! [Translated from આજે ઇરાકની આકાશમાં વિચિત્ર રચનાઓ જોવા મળી હતી અને લોકો ડરતા ડરતા રડવાનું શરૂ કરતાં વિચાર્યું કે આ વિશ્વના અંતની શરૂઆત છે!]” Another Facebook user shared the viral video with the same claim in Hindi [viral text in Hindi हाल ही में इराक में आसमान में, अजीब संरचनाएं देखी गईं और लोग डर से रोने लगे, कि यह दुनिया के अंत की शुरुआत है!].", "Alt News found that the same clip was uploaded on YouTube in 2017 however, there are no screams in the background. This suggests that the voices of people panicking were superimposed to the clip.", "According to the title, the video shows a ‘mysterious planet Nibiru.’ However, this is not an actual event but related to a popular doomsday theory debunked by NASA in 2017.", "Using InVid, a video verification tool, Alt News analysed the viral video by performing a reverse image search on Yandex. We found a 2018 report by Turn Back Hoax, an Indonesia-based fact-check platform.", "The outlet debunked the video when several people claimed to post a ‘Facebook live’ of the event. As per Turn Back Hoax, the video was created using clips that already existed on the internet. “One of them is published in Youtube here: https://goo.gl/ebNMBm, about “Planet Nibiru” conspiracy theories,” reads the report. The YouTube video is however unavailable now.", "Turn Back Hoax also cites a 2017 article from The Telegraph which said, “Planet X, or Nibiru, refers to a mythological planet in our solar system that will supposedly crash into Earth and wipe out the human race, however it has been consistently dismissed by Nasa and other experts as an internet hoax.”", "NASA republished an article around the conspiracy theories in 2012. “The biggest missing link in the doomsday prophecy is Nibiru itself. Because no giant, rogue planet has been found in the outer solar system to play the role of Nibiru…” reads the article which also quotes NASA’s David Morrison: “The fact is that these folks are constantly changing their story. For some, Nibiru is no longer the Sumerian god or planet that is supposed to be returning to Earth in late 2012. It has become a catchword for almost any cosmic catastrophe.”", "Therefore, the claims that the viral video is from Iraq or shows a catastrophic planet is false. If you are interested in knowing more about the conspiracy theory, watch the YouTube by The Infographics Show attached below.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "Amid the ongoing Israel-Palestine conflict, media outlet Times Now put out a report claiming that…", "A 45-second video clip is being shared widely on social media where a group of…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…"]