["A popular Facebook post says people should stop talking about former NFL player Michael Vick and dogfighting and instead reflect on a picture that seemingly shows violence against a black man by a smiling white man.", "\"I am a big animal lover, but stop bringing up Michael Vick when this is in your history!!! The man did his time and constantly gives back. But you want us to forget about this,\" said text above a photo that shows a black man with a bloody face being grabbed up by a white man who appears to be looking at the photographer and either smiling or grimacing. Another white man in a U.S. Army sweatshirt is also in the photo, standing next to the black man and looking at the camera.", "Vick served time in prison after pleading guilty to charges related to a dogfighting ring run in a property he owned.", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The caption in the Facebook post implies that the white men in the photo attacked the bloodied black man and that one smiled about it. That’s not an accurate account.", "The Associated Press photo is from June 21, 1943. News organizations that have used the photo say the image shows two young white men helping a black man to his feet after he was badly beaten in street fighting during race riots in Detroit. The captions don’t explain why one of the men appears to be smiling, or if he’s actually grimacing. The photo posted to Facebook is also cropped and doesn’t show that the man in the U.S. Army sweatshirt in one hand has a rag, seemingly with blood from the black man. The cropping also doesn’t fully show that the black man is hardly able to stand on his own.", "Time magazine in 2014 published a slideshow of photos from the 1943 race riots. One of the photos features the three men but in a different setting, walking huddled; in this shot, the man that appeared to be smiling in the other photo has a worried look. The caption says that the white men are helping the black man to safety, and that black people reported many instances of aid from white people during the rioting.", "A Facebook post claims to show a photo of a white man smiling while holding a black man with a bloody face.", "The implication is that the black man was beaten and that the white man smiled about it. It’s difficult to tell whether the white man is smiling or grimacing, but the context of the photo isn’t what is implied by the Facebook post. (There are two white men in the photo, one has a stern look on his face.)\n\nThe two white men in the photo were actually helping the black man during 1943 race riots in Detroit, according to the caption used by news organizations.", "We rate the Facebook post False.", "Facebook post, Dec. 10, 2019", "PolitiFact Georgia, State senator says animal cruelty lead to violent adults, Nov. 10, 2010", "Time, Hatred on the Home Front: The Detroit Race Riots During WWII, June 18, 2014", "Detroit Historical Society, Race Riot of 1943", "PennLive.com, Auto industry decline, racial tension at the root of Detroit's collapse, Updated Jan 05, 2019; Posted Jul 21, 2013", "The Atlantic, Detroit in the 1940s, Jan. 14, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]