["This is a baseless rumor. The barrel depicted in the logo were for storing soda crackers sold in general stores. That’s the origin of the name.", "Cracker Barrel said the curve in its logo is a common calligraphy flourish used in the logos of many brands.", "The Cracker Barrel restaurant chain has been serving Southern cuisine and selling rocking chairs in its old country stores since its first location opened in Lebanon, Tenn., in 1969.", "But several posts spreading on social media claim the company’s name and logo refer to a slaveholder’s whips and the barrels they were stored in.", "\"Cracker was a slang term for whip,\" reads one Facebook post that features an image of the company’s name and logo. \"Thats why blacks called whites crackers, from the crack of the whip. A cracker barrel is a barrel that held the whips for sale at the country store. You see the whip going from the R to the K? Racism in your face!!\"", "The story isn’t true, and the company denied the claim.", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Merriam-Webster defines \"cracker-barrel\" as an adjective \"suggestive of the friendly homespun character of a country store. Dictionary.com defines the term as \"of or suggesting the simple rustic informality and directness thought to be characteristic of life in and around the country store.\"", "The company’s name and the logo allude to barrels that were used to store soda crackers, like saltines or northern common crackers, not whips.", "Cracker Barrel said its logo does not depict a whip and never has.", "\"The part of the logo being referenced in social media posts is a flourish, which is used in the calligraphy of the logos of many brands,\" the company said in an emailed statement. \"Cracker Barrel rejects racism and discrimination in any form.\"", "A 2018 article by Southern Living also covered how the company got its name. The phrase, according to the article, was inspired by the barrels full of soda crackers that were for sale in general stores around the country. Visitors would sit around them to catch up on the day's news. The logo shows a man sitting in the chair, leaning on the barrel.", "Photographs of old newspaper ads support this. One image shared on Twitter shows a 1913 ad from Oklahoma’s May Bugle featuring the crackers. Another, from the Newton Daily News in 1965, depicts the \"general store era\" of cracker barrels.", "The viral posts may be partly correct on the origin of the term \"cracker\" on its own as a racial slur. Jelani Cobb, a historian who has written on the etymology of some anti-white slurs, told NPR in 2013 that the word is suspected to be a shortened version of \"whip-cracker,\" and was used in the mid-18th century as an insult against poor whites who handled livestock with a whip.", "Cracker Barrel has faced accusations of racial discrmination in its treatment of Black employees and customers. A 2004 investigation by the U.S. Justice Department found that the chain violated civil-rights law in its treatment of Black customers at restaurants in seven states. Under a consent decree settling the case, Cracker Barrel agreed to introduce \"effective nondiscrimination policies and procedures,\" improve training and make other policy changes.", "Social media posts claim that Cracker Barrel’s name and logo allude to a slaveholder’s whip and the barrels used to store them.", "That isn’t true. The company rejected the rumor and said its logo features a common calligraphy flourish used in the logos of many brands.", "The barrels referred to in the name were used at general stores to store soda crackers, not whips.", "We rate this False.", "Facebook post, Feb. 7, 2021", "Facebook post, Feb. 8, 2021", "Merriam-Webster, cracker-barrel definition, Accessed Feb. 9, 2021", "Dictionary.com, cracker-barrel definition, Accessed Feb. 9, 2021", "Justice.gov, JUSTICE DEPARTMENT SETTLES RACE DISCRIMINATION LAWSUIT AGAINST CRACKER BARREL RESTAURANT CHAIN, May 3, 2004", "Southern Living, Where Did Cracker Barrel Get Its Name?, Jan. 9, 2018", "Eater.com, Someone Wants Cracker Barrel to Change Its Name Because He Finds It 'Offensive', July 10, 2015", "Twitter, Dan Evon tweet, Feb. 9, 2021", "Newspapers.com, Newton Daily News pg 31, Jan. 29, 1965", "NPR, The Secret History Of The Word 'Cracker', July 1, 2013", "Email interview, Cracker Barrel media relations, Feb. 9, 2021", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]