["About this rating", "A viral video supposedly showing a large tarantula swimming across the surface of a body of water is frequently shared with expressions consisting of equal measures of amazement, skepticism, and horror:", "This is a genuine video of that type of arachnid swimming. This footage was originally shared on the Big Bend Ranch State Park/Texas Parks and Wildlife Facebook page in October 2018, along with the caption \"Did you know that tarantulas can 'swim?' With their legs acting as paddles, they can row across water\":", "Although the video is genuine, this species of spider is not particularly adept at water travel. One paper that investigated the tarantula's ability to swim found that while tarantulas can swim, this \"swimming\" is typically a matter of survival and is not a tarantula's preferred mode of travel:", "Tarantulas are not what instantly comes to mind when one thinks of arthropods that can swim. With that said, there have been a few reports (Hull-Williams 1986; Webb 1987; Reger 1994) and wildlife programs which show that tarantulas can, and do, swim in the wild and in captivity. These swims, however, are almost always the result of a spider being chased, or accidentally falling into a large body of water, and it might be expected that those most prone to such accidents are arboreal tarantulas living in trees overhanging lakes or rivers ...", "Tarantulas effectively swim by ‘rowing’ on the surface of the water, using their first three pairs of legs like paddles. Rowing is the typical mechanism used by swimming arthropods, as opposed to swimming by ‘flying’ underwater, moving their limbs up and down as, for example, in penguins ...", "Most tarantulas probably never have to face the need to swim, but it is clear that if they must swim, they have the behavioral plasticity to do so.", "The tarantula may be capable of swimming when the situation calls for it, but this spider is not a particularly good swimmer. But other types of spiders are quite comfortable in aquatic environments. The diving bell spider, for instance, spends much of its life underwater, and the dolomedes briangreenei, a species of fishing spider found in Australia, hunts insects on the water.", "Robert Raven, Principal Scientist of Arachnology at the Queensland Museum, told Mashable Australia: \"(The dolomedes briangreenei will) sit there on the water and then all of a sudden an insect will hit the water and the spider races out to get it, grabs it, dives under the water and then swims back to the shore and starts eating it.\"", "Cremin, Geraldine.     \"Newly-Discovered Spider Named Brian Rides Waves to Hunt Prey.\" \r\n    Mashable Australia.   8 March 2016.", "Dunlop, Jason.     \"Swimming in Tarantulas.\" \r\n    University of Manchester.   Retrieved 8 January 2020.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]