["About this rating", "The legendary American entertainer Dick Van Dyke, best known for his comedic turns in the 1960s television series The Dick Van Dyke Show and Disney's 1964 film Mary Poppins, is also a man of serious political convictions.", "During the run-up to the 2016 presidential election, Van Dyke, then 90 years old, made the rounds of television and radio talk shows promoting the candidacy of Democratic candidate Bernie Sanders (then 74), whose progressive policy ideas he hailed (and whom he jokingly referred to as a \"promising young politician\").", "When Sanders lost the Democratic nomination to Hillary Clinton, Van Dyke threw his support to the latter. The alternative, he said in an opinion piece for the Hollywood Reporter, \"is a nightmare\" -- by which he meant Republican candidate Donald Trump. \"The last thing that scared me as much as Trump,\" Van Dyke wrote, \"was the Cuban Missile Crisis — if he's elected, I think we'll be at war almost instantly.\"", "In a quote attributed to Van Dyke in 2016 that was still making the rounds as an Internet meme two years later, he allegedly described Trump as \"a man who wants to be the dictator,\" and said the millions who follow Trump \"share his anger, paranoia, and his hatred\":", "@trumps_feed So right Dick Van Dyke! pic.twitter.com/YIJKYI9fpO", "— @CynthiaDM (@Cynthia36013552) November 4, 2018", "We learned while trying to authenticate the quote that Van Dyke himself had tweeted the meme shortly before the November 2018 midterm elections, indicating not only that the sentiments were indeed his own, but that his opinion of Trump had not changed over the course of the first two years of his presidency:", "“Millions of people share his anger, paranoia and his hatred.....Some of the people I talk to have a fuzzy line between the Constitution and the Bible....Stop a man who wants to be The Dictator..it’s such a bare exposure of greed and the lust for power.”\n- Dick Van Dyke 2016 pic.twitter.com/iOJbzoIFMZ", "— Dick Van Dyke (@iammrvandy) November 2, 2018", "As to the origin of the passage, it was assembled from remarks Van Dyke made during a radio interview with Tavis Smiley on 21 October 2016, three weeks before the presidential election. After quizzing Van Dyke about his support for Bernie Sanders, Smiley asked the actor for his thoughts about Donald Trump. Here are the relevant excerpts:", "The thing about Trump is he's a dime a dozen. Without his father he would have been a used car salesman. But most disappointing, there are millions of people who share his paranoia and his anger and his hatred. That's what bothers me. It really sounds like the dumbing-down of America to me.", "Some of the people I talk to, I get the impression that there's kind of a fuzzy line for them between the Constitution and the Bible. The quotes are intermixed, it's very strange. They interviewed some people who didn't know what the three branches of government are.", "As I said, this is not another one of those lesser of two evils, we've already been through that. I think we have to stop a man who wants to be the dictator. I think we'll be in a war within a month if he's in office. It bothers me that people can't read him.", "I think the Republicans just think they'll be able to control him, with the House and the Senate, and they'll be able to steer. It is such a bare exposure of the greed and the lust for power. You can see it in Republican Senators and the people who are supporting him, for no other reason than it's power.", "Van Dyke, Dick and Scott Feinberg.   \"Why Bernie Sanders Is the Best Candidate for Senior Citizens.\"\r\n    The Hollywood Reporter.   1 June 2016.", "The Tavis Smiley Show.   \"Dick Van Dyke.\"\r\n    21 October 2016.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]