["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Former Vice President Joe Biden speaks during an event in Dover, Del., on June 5, 2020. (AP/Walsh)", "Biden campaign spokesman Andrew Bates said in a statement that “Biden does not believe that police should be defunded.”", "The Biden campaign website does not mention defunding police as part of “Joe’s vision.”", "President Donald Trump repeatedly claimed that Democratic rival Joe Biden wants to \"defund the police.\" But there was no record of Biden taking that position at the time of Trump’s claims, and Biden has since rejected the idea through a spokesman and in a TV interview.", "\"Sleepy Joe Biden and the Radical Left Democrats want to \"DEFUND THE POLICE,\" Trump said in the first of two June 7 tweets making the same point. \"I want great and well paid LAW ENFORCEMENT. I want LAW & ORDER!\"", "Sleepy Joe Biden and the Radical Left Democrats want to “DEFUND THE POLICE”. I want great and well paid LAW ENFORCEMENT. I want LAW & ORDER!", "The \"defund\" movement calls on local governments to shift spending on law enforcement to programs that address economic and social issues for minorities. In Minneapolis, a veto-proof majority of city council members pledged to replace the city’s police department with a community-based public safety model following protests over the death of George Floyd in police custody.", "But Biden told \"CBS Evening News\" anchor Norah O’Donnell that he does not intend to defund the police in a clip the program aired on June 8.", "\"No, I don’t support defunding the police,\" Biden said. \"I support conditioning federal aid to police based on whether or not they meet certain basic standards of decency and honorableness and, in fact, are able to demonstrate they can protect the community and everybody in the community.\"", ".@NorahODonnell: “Do you support defunding the police?”Former VP Joe Biden: “No, I don't support defunding the police. I support conditioning federal aid to police based on whether or not they meet certain basic standards of decency and honorableness.”https://t.co/TvsHluVVSW pic.twitter.com/AuJiPyheX6", "Earlier that day, Biden campaign spokesman Andrew Bates addressed Trump’s claims by saying that Biden \"does not believe that police should be defunded.\"", "In the statement, Bates said Biden supports \"the urgent need for reform\" and wants to spend more money on community policing programs, officer training, diversified police departments and body-worn cameras.", "Similar policies are outlined under \"Joe’s vision\" on Biden’s campaign website, but there’s no mention of defunding the police or anything that could reasonably be construed as such.", "Biden would invest $300 million for the federal Community Oriented Policing Services Program, his campaign website says. His plans also include expanding the Justice Department’s authority to investigate unconstitutional policing, excessive force and systemic police misconduct.", "RELATED FACT-CHECK: Fact-checking Kamala Harris’ claim about Donald Trump and investigations of police misconduct", "The Trump campaign did not respond to a request for comment. In a June 8 statement, Trump spokesman Tim Murtaugh argued that because Biden himself had not addressed the \"defund the police\" idea, Americans had \"no way of knowing where he really stands.\"", "But neither did Trump, who said Biden shared that position.", "In a June 6 op-ed in the Los Angeles Times, Biden vowed to establish a national police oversight commission during his first 100 days in office. He called on Congress to \"outlaw chokeholds, stop the transfer of weapons of war to local police forces, improve oversight and accountability, and create a model use-of-force standard.\"", "\"We need to implement real community policing and ensure that every police department in the country undertakes a comprehensive review of their hiring, their training, and their de-escalation practices,\" Biden wrote.", "Trump said Biden wants to \"defund the police.\"", "Biden did not have this position when Trump made this claim, and his campaign’s website does not list defunding the police as part of \"Joe’s vision.\" Biden and his campaign have since said Biden does not support defunding police but does support reform.", "We rate Trump's statement False.", "Donald J. Trump on Twitter, June 7, 2020", "Donald J. Trump on Twitter, June 7, 2020", "Donald J. Trump on Twitter, June 8, 2020", "CBS News, \"Biden says federal aid to police should be based on meeting 'basic standards of decency,'\" June 9, 2020", "Joe Biden for President, \"Justice,\" accessed June 8, 2020", "Trump 2020, \"Trump Campaign Statement on Joe Biden's Weakness on 'Defund the Police,'\" June 8, 2020", "Searches on Google and Nexis, June 8, 2020", "Andrew Clark on Twitter, June 8, 2020", "Jennifer Epstein on Twitter, June 8, 2020", "Bloomberg News, \"Biden Opposes Defunding Police, Rejecting Trump’s Claims,\" June 8, 2020", "Bloomberg News, \"Trump Uses ‘Defund Police’ as Weapon Against Biden, Who Shuns It,\" June 8, 2020", "The Hill, \"Biden campaign opposes calls to 'defund the police,'\" June 8, 2020", "CNN, \"Biden doesn't support defunding police, campaign says,\" June 8, 2020", "The Appeal, \"Minneapolis City Council Members Announce Intent to Disband the Police Department, Invest in Proven Community-Lead Public Safety,\" June 7, 2020", "The Los Angeles Times, \"Op-Ed: Joe Biden: To end systemic racism, no one can stay silent. No one can ignore injustice,\" June 6, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]