["The graphic showing Dissanayake, who is the leader of the opposition Janatha Vimukthi Peramuna (JVP) party, was published on Facebook here on March 23, 2021. The post has been shared over 1,200 times and has since been deleted.", "The image shows Dissanayake speaking on Hiru Salakuna, a Sri Lankan political talk show.", "The graphic’s Sinhala-language text translates to English as: “It was the Sinhala Buddhists who pushed the Tamils and Muslims into becoming suicide bombers / Anura at the Hiru Salakuna program today”", "The Facebook post’s caption translates as: “He too sounds like a member of an extremist organisation. He must be arrested. He is the other one who spreads extremism. Losers! What crime did those innocent victims commit to die like that from the Easter attacks? Your lot is the worst. ..”", "The graphic was also published alongside similar claims on Facebook here, here and here.", "The claim, however, is false.", "A review of the entire 114-minute discussion on the talk show found that at no point does Dissanayake make any such remarks about the majority Sinhala community pushing minorities towards becoming  suicide bombers.", "The programme, which aired on March 22, 2021, can be seen in full on the Hiru network’s Youtube channel here.", "Dissanayake does make brief comments on communal and ethnic rifts in Sri Lanka from the full video’s 17:22 to 20:18 mark.", "After reaffirming the JVP’s support for Sri Lanka’s Sinhala-Buddhist culture, Dissanayake responds to a question about his party not critisizing Tamil and Muslim extremism.", "Dissanayake responds by criticizing politicians for staying “hidden behind Buddhism” and says politicians must protect minorities.", "He adds that since the likelihood of another armed political struggle is low, politicians should “stand by the justifiable rights that minorities struggle to achieve instead of demonizing them and pushing them to take up arms once more.”", "At no point does he blame the Sinhala community for pushing people to become suicide bombers.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]