["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Rep. Ilhan Omar, D-Minn., speaks as she introduces the Zero Waste Act at the Capitol in Washington, Thursday, July 25, 2019. (AP Photo/J. Scott Applewhite)", "A recent Facebook post adds criminal and daughter of a terrorist to the list of baseless accusations that have been made about U.S. Rep. Ilhan Omar, D-Minn.", "The photo, published Aug. 1 by a conservative Facebook page called Tactical Hospitality, makes a variety of claims about Omar, some of which are related to previous fact-checks about her family history and comments about al-Qaida.", "Two claims were new to us: The post said Omar has been \"arrested 23 times\" and is the \"daughter of (a) Somali terrorist.\"", "\"From jail cell, to Congress,\" claims the photo, which includes images of Omar’s purported mugshot and another of her being sworn in as a congresswoman.", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "(Screenshot from Facebook)", "PolitiFact reached out to Tactical Hospitality to see where it got the image. The page told us that it \"grabbed it from an individual whom shared it\" and that it wasn’t sure of the origin.", "When we looked into the claims, we found that Omar has not been arrested 23 times and there’s no evidence to suggest either of her parents are involved with terrorist organizations.", "We checked public records and found that Omar was arrested once — not 23 times. The Facebook post conflated the congresswoman’s traffic violations with arrests.", "Snopes fact-checked a related claim that the representative \"was arrested in 2013 for trespassing.\" The post included the same mugshot pictured in the photo that Tactical Hospitality shared. Snopes rated that statement true.", "The fact-checker pointed to a police report from January 2013. It says Omar was arrested on two misdemeanor charges for trespassing and refusing to leave a Minneapolis hotel. She was booked into Hennepin County Jail. She was 30.", "Omar’s trespassing charges were later dropped, the Associated Press reported in October. The congresswoman refused to leave a hotel lobby that was filled with people following the Somali president, who was in town to give a speech. Omar snuck back in and after police cleared the lobby.", "PolitiFact could not find the incident in a public database of Minnesota court records. Her campaign did not comment.", "What we did find in the database were 24 traffic violations from the past 10 years, the most recent being a parking ticket from January, in which Omar was convicted of a petty misdemeanor for parking \"overtime in a meter zone.\" Under Minnesota law, a conviction means \"a plea of guilty; or a verdict of guilty by a jury or a finding of guilty by the court.\"", "The other 23 charges include several such parking violations, as well as two expired plates and one speeding ticket. In winter 2016, Omar paid two tickets for not following \"snow emergency parking restrictions,\" which set specific times in which drivers cannot park on certain roads.", "Jail time is not listed for any of those traffic violations — and being charged with petty misdemeanors is not the same as being arrested.", "PolitiFact reached out to the Minneapolis Police Department for more details about Omar’s record. The MPD’s Records Information Unit sent us a document indicating that Omar had only been arrested once — in 2013 for the trespassing charge.", "The second claim in the Facebook post is much more serious, alleging that Omar is the daughter of a Somali terrorist.", "A spokesman for Omar’s office sent two articles with biographical information about Omar, without further elaboration.", "City Pages, an alternative newspaper in the Twin Cities, reported in November 2016 that Omar’s mother died when she was little. And, before civil war broke out in the early 1990s, her father trained teachers in Somalia.", "The family was sent to a refugee camp in Kenya during the conflict, The Washington Post reported July 6. They were granted U.S. asylum in 1995, eventually settling in Minneapolis, where Omar’s father worked as a cab driver and, later, at a post office.", "We could not find any evidence that either of Omar’s parents were terrorists or war criminals in Somalia.", "Snopes similarly could not determine whether Omar’s father, Nur Omar Mohamed, was a \"war criminal\" in Somalia, as The Gateway Pundit claimed, for a July 25 fact check.", "The conservative news site, which PolitiFact has fact-checked in the past, reported July 16 that Omar’s father was connected to Siad Barre, president of Somalia from 1969 to 1991. But, as Snopes noted, The Gateway Pundit didn’t offer proof of this. Instead, the site mentioned another man, Yusuf Abdi Ali, and claimed — without evidence — that the two were connected. (Here’s more about him from a CNN report.)", "A viral photo on Facebook claims that Ilhan Omar has been arrested 23 times and is the daughter of a Somali terrorist.", "She was arrested once and the charges were dropped. Minnesota court records show that Omar has had 24 traffic violations in the past 10 years, not arrests. We could not find any evidence that either of Omar’s parents were involved in a terrorist organization in Somalia.", "The post is not accurate. We rate it False.", "Associated Press, \"At history’s doorstep yet again, Ilhan Omar confronts fresh wave of scrutiny,\" Oct. 26, 2018", "City Pages, \"Ilhan Omar's improbable journey from refugee camp to Minnesota Legislature,\" Nov. 7, 2016", "CNN, \"CNN finds accused war criminal driving for Uber and Lyft,\" May 15, 2019", "Document from the Minneapolis Police Department’s Records Information Unit, accessed Aug. 12, 2019", "Facebook post, Aug. 1, 2019", "Facebook post, Feb. 15, 2019", "The Gateway Pundit, \"REPORT: Ilhan Omar’s Father and Other Somalian War Crimes Perpetrators Now Living Illegally in the US,\" July 16, 2019", "Police report, Minneapolis Police Department", "Minnesota trial court records, accessed Aug. 2, 2019", "PolitiFact, \"All statements by The Gateway Pundit,\" accessed Aug. 13, 2019", "PolitiFact, \"Donald Trump twists Ilhan Omar’s comments about al-Qaida,\" July 16, 2019", "Snopes, \"Did Minneapolis Police Arrest U.S. Rep. Ilhan Omar on Suspicion of Trespassing in 2013?\" May 3, 2019", "Snopes, \"Is Rep. Omar’s Father a ‘Somalian War Criminal’ Living ‘Illegally’ in U.S.?\" July 25, 2019", "Snow Emergency Parking Rules, City of Minneapolis, accessed Aug. 8, 2019", "The Washington Post, \"Ilhan Omar’s American story: It’s complicated,\" July 6, 2019", "2018 Minnesota Statutes, accessed Aug. 8, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]