["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "State Sen. Kathleen Vinehout, D-Alma, claimed Wisconsin manufacturing jobs are lagging well below recession levels. (Photo by Mike DeSisti)", "In criticizing Gov. Scott Walker’s Foxconn factory deal, state Sen. Kathleen Vinehout (D-Alma) lamented sluggish manufacturing growth and the governor’s manufacturing policies.", "Vinehout appeared Aug. 6, 2017, on WISN-TV’s \"Upfront with Mike Gousha,\" where she said under Walker the state is \"still 16,000 manufacturing jobs lower than we were during the recession.\"", "In July 2017, Walker announced that technology giant Foxconn, a company best known for making iPhone components, planned to build a near-1,000 acre LCD factory in southeastern Wisconsin that could eventually lead to 13,000 jobs.", "In her interview with Gousha, Vinehout, who ran for governor in 2014 and may run again in 2018, criticized Walker for picking winners and losers and said the continued use of tax credits has not resulted in fast economic growth for Wisconsin’s manufacturing sector.", "But what about her claim?", "Are Wisconsin’s manufacturing jobs still 16,000 below the recession total?", "Sluggish growth", "Vinehout said in an email through an aide that her 16,000 jobs number was a conservative estimate, meaning that the actual number could be much larger.", "She laid out her analysis this way:", "The U.S. Bureau of Economic Analysis, an arm of the U.S. Department of Commerce that tracks GDP and wages, showed 494,427 manufacturing jobs in Wisconsin at the end of 2008. She chose the annual number for 2008 because she said that’s the year the recession started.", "To be clear, the Great Recession started in December 2007 and ended in June 2009, according to the National Bureau of Economic Research.", "Next, Vinehout compared the 2008 annual number to a monthly report from Wisconsin’s Department of Workforce Development, which showed about 472,000 manufacturing jobs in June 2017 in Wisconsin.", "\"Using those numbers Wisconsin still has 22,327 manufacturing jobs to go to get back to the prerecession level,\" Vinehout said through an aide in an email. \"Monthly totals in 2008 would vary depending on which month you looked at.\"", "While the numbers of each source may be sound, experts say it is not appropriate to compare a monthly number, particularly a preliminary one, with a final annual number. In doing so, Vinehout mixed together data that was collected and measured differently.", "Here at PolitiFact, we -- and economists -- consider the U.S. Bureau of Labor Statistics the gold standard for jobs numbers, specifically its Quarterly Census of Employment and Wages data.", "So, let’s do a calculation of job numbers using their annual numbers.", "That data shows an annual total of about 492,000 manufacturing jobs in Wisconsin in 2008. In 2016, the BLS reported about 463,000 manufacturing jobs in the state, meaning Wisconsin is about 29,000 jobs shy of returning to recession levels.", "While Vinehout’s methods might have been off, she’s not wrong in saying Wisconsin’s manufacturing sector hasn’t returned the jobs numbers it previously had.", "What’s more, the recent trend is not good. Manufacturing jobs fell between 2015 and 2016 by about 3,000, as overall job growth for the state slowed, according to a June 2, 2017, Milwaukee Journal Sentinel report.", "Behind the claim", "In her claim, Vinehout used the numbers to criticize Walker’s performance as governor -- even though he took office in January 2011, well after the recession had ended.", "Experts said it is not fair to pin all of the blame for sluggish manufacturing growth in Wisconsin on Walker.", "Some of the factors that influence manufacturing job growth include state and federal economic policies, the overall national economy, automation replacing jobs, shipping jobs overseas and the decades-long shift from a manufacturing-based economy to a service-based economy.", "States set policies that can either attract or discourage businesses from coming, but it’s ultimately the decision of the private sector to decide where to set up shop, said Brian Jacobsen, a Wells Fargo senior investment strategist.", "He added that the effects of policies and reforms typically aren’t felt until years after they have been implemented.", "The state is \"not 100 percent responsible for creating or losing jobs, but state policies help attract new business to the state or retain existing businesses,\" said Abdur Chowdhury, a professor of economics at Marquette University.", "Walker spokesman Tom Evenson touted Walker’s policies as successful, citing plans from Foxconn and Haribo to build factories in the state.", "\"Governor Walker’s reforms have led to a resurgence in Wisconsin manufacturing and have created opportunities few could have imagined during the last recession,\" Evenson said.", "Our rating", "In a TV interview, Vinehout said Wisconsin under Walker is \"still 16,000 manufacturing jobs lower than we were during the recession.\"", "She mixes and matches data from a few government sources, but is right in saying Wisconsin hasn’t hit pre-recession manufacturing job numbers. However, in using the number to criticize Walker, she ignores the fact he was not in office until several years after the recession ended and that governors only have a limited impact on the economy.", "We rate her claim Mostly True.", "Government data, \"Bureau of Labor Statistics Quarterly Census of Employment and Wages Wisconsin manufacturing employment numbers,\" U.S. Bureau of Labor Statistics, accessed Aug. 14, 2017", "Government data and news release, \"BLS Data: Wisconsin's Unemployment Rate Unchanged at 3.1% in June, Maintains Lowest Level Since October 1999,\" Wisconsin Department of Workforce Development, July, 20, 2017", "Government data, \"SA27N Full-Time and Part-Time Wage and Salary Employment by NAICS Industry,\" U.S. Bureau of Economic Analysis, accessed Aug. 14, 2017", "News story, \"Job creation slowed sharply in Wisconsin in 2016, raising questions and worries,\" Milwaukee Journal Sentinel, June, 2, 2017", "News story, \"Slowdown in Wisconsin in 2016 led by weakness in manufacturing sector,\"", "Economic expansions and contractions data, \"US Business Cycle Expansions and Contractions,\" National Bureau of Economic Research, accessed Aug. 14, 2017.", "Emails to State Sen. Kathleen Vinehout, Aug. 14, 2017", "Email to Gov. Scott Walker spokesman Tom Evenson, Aug. 14, 2017", "Government fact sheet, \"WISCONSIN MANUFACTURING AND AGRICULTURE CREDIT,\" Wisconsin Department of Revenue, Sept. 8, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]