["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A two-hour livestream of the Kenosha protests from Aug. 25, 2020, shows Rittenhouse interacting with police.", "About 15 minutes before the shooting, officers throw a water bottle in response to Rittenhouse’s request.", "An officer then said to Rittenhouse’s group, “We appreciate you guys, we really do.”", "The protests and property damage that followed the Kenosha police shooting of Jacob Blake followed a tragically familiar national pattern — until two protesters were shot and killed, allegedly by an armed teenager.", "Kyle Rittenhouse, a 17-year-old from Illinois who considered himself a militia member, has been charged as an adult with one count each of intentional homicide and reckless homicide for the Aug. 25, 2020, shooting. He’s also charged with attempted intentional homicide for the shooting of a third man.", "Rittenhouse is awaiting extradition from Illinois.", "He was able to leave the scene even though, as caught on video, he walked toward police with his hands up as protesters yelled that he had shot people.", "The relationship between Rittenhouse and police has drawn particular scrutiny in the wake of video interactions captured earlier in the night.", "One viral Facebook post on Aug. 26, 2020, said \"video showed police thank him & give him water prior to the killings.\"", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook).", "Did police really have such an interaction with Rittenhouse before the deadly protest shooting?", "A livestream posted by The Rundown Live, an independent radio program based in Milwaukee, shows Rittenhouse interacting with police while standing in front of a store in Kenosha shortly before the shooting.", "About 10 p.m., the man shooting the video approaches an armed Rittenhouse, who introduces himself as Kyle, as he stands outside a business with another armed man.", "Later in the nearly two-hour video, Rittenhouse tells the man shooting the video, \"People are getting injured, and our job is to protect this business, and part of my job is also to help people. If there’s somebody hurt, I’m running into harm’s way. That’s why I have my rifle, because I need to protect myself obviously. But I also have my med kit.\"", "About 90 minutes into the livestream at 11:30 p.m. — 15 minutes before the fatal shooting — the following exchange with police occurs as Rittenhouse and another armed man walk outside a business.", "Police officer (over a loudspeaker): \"You need water? Seriously. (unintelligible) You need water?\"", "Rittenhouse, raising his arm and walking toward the police vehicle: \"We need water.\"", "Police officer: \"We’ll throw you one.\"", "Rittenhouse then walks out into the street amid several police vehicles, holding his hand in the air for a water bottle. An officer surfaces from a hatch at the top of the police vehicle and tosses a water bottle to a person located just out of the camera’s view, where Rittenhouse would likely be standing based on the preceding footage.", "Police officer: \"We got a couple. We’ve got to save a couple, but we’ll give you a couple. We appreciate you guys, we really do.\"", "A police officer on a loudspeaker then directs orders, apparently to another group.", "Police officer: \"You’re going to have to get out of there. This is the last warning. You’re going to have to move south or you’re going to have to get out of this block. This is the last warning. You will disperse.\"", "Kenosha County Sheriff David Beth said in an Aug. 28, 2020, news conference that the armored vehicle shown in the video is one of 19 being used in the area but wasn’t from his department. He noted people have a Second Amendment right to bear arms to protect \"their property,\" but local authorities had not asked them to come.", "It is unclear from the video what law enforcement agency the vehicle belonged to.", "\"The comments that whoever was in that armored vehicle said, that does not reflect what we here in Kenosha are asking for,\" Beth said.", "Beth had initially responded to the incident, on Aug. 26, by saying police in Kenosha \"would toss a water to anybody.\"", "A Facebook post says of Rittenhouse: \"Video showed police thank him & give him water prior to the killings.\"", "Video taken 15 minutes before Rittenhouse allegedly shot and killed two people shows exactly that. Police thanked his group for their presence and gave them water.", "We rate this claim True.", "Facebook post, Aug. 26, 2020", "The Rundown Live, livestream in Kenosha starting at 10:04 p.m., Aug. 25, 2020", "Washington Post, Before a fatal shooting, teenage Kenosha suspect idolized the police, Aug. 27, 2020", "Milwaukee Journal Sentinel, Kenosha updates: Fourth night of protests peaceful, after three nights of violence; Mike Pence decries violence at RNC, Aug. 26, 2020", "Facebook messenger exchange with Kristan T. Harris, reporter with The Rundown Live, Aug. 28, 2020", "David Beth, news conference, Aug. 28, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]