["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "This graphic appeared with the text of Roys' tweet.", "Kelda Helen Roys picked an unusual way to become the latest of the major Democrats to join the 2018 race for governor of Wisconsin.", "She announced her candidacy on a private Facebook page.", "Roys, a former Wisconsin state representative from Madison, undoubtedly will be training her sights on GOP Gov. Scott Walker, who is seeking a third term. But on Dec. 1, 2017, six days before her Facebook announcement, Roys used social media in a different way to criticize tax reform efforts by President Donald Trump and other Republicans.", "She posted this tweet:", "Never let the GOP tell you again that they support low taxes. They don’t—unless you’re already a billionaire or a massive corporation. #TaxBill", "(Attached was the graphic shown above.)", "Many have criticized the proposed GOP tax cuts as favoring the richest.", "But 99.8 percent of Americans wouldn’t get any tax cut?", "That’s not correct. Not close.", "The estate tax", "Roys told us she was referring to an April 2017 Facebook post by U.S. Sen. Bernie Sanders, the Vermont independent who ran for the Democratic presidential nomination in 2016.", "That post blasted Trump’s proposal to repeal the estate tax, and it included the figures about the Waltons, the Koch brothers and Trump’s family that were part of Roys’ tweet. Sanders’ post also said \"99.8 percent of Americans would not benefit by one nickel under Trump’s plan to repeal the estate tax.\"", "So, Sanders was clearly referring to only one tax reform provision: repeal of the estate tax.", "We’ve rated True a claim by U.S. Rep. Mark Pocan, D-Wis., that what some call the \"death tax\" was paid by only \"two out of every 1,000 people\" in 2016. That’s the equivalent of 99.8 percent. The tax applies only if an estate’s value exceeds $5.45 million, or $10.9 million, if there is a surviving spouse, and is paid by only about 5,000 estates per year.", "But Roys’ tweet was making a general reference to Trump’s tax plan -- with no indication that the numbers referred only to the estate tax.", "And its bottom-line claim was that \"under Trump’s new tax plan … 99.8% of Americans\" get \"not one nickel\" in tax cuts.", "Roys told us she now realizes that what she posted did not make it clear she was referring only to the estate tax. Indeed, a reader could only assume her claim was about the tax plan generally, with the \"#TaxBill\" reference she used and the \"Trump’s new tax plan\" in the headline.", "As for the House and Senate tax reform plans now in play, with Republicans hoping to finalize a plan for Trump’s signature before the end of 2017, several tax-cut provisions benefit the rich specifically.", "But the tax cuts would be widespread: Both plans would lower individual income tax rates for the middle class, and most people in lower-income households would see cuts, as well.", "Our rating", "Roys said that \"under Trump’s new tax plan … 99.8% of Americans\" get \"not one nickel\" in tax cuts.", "Roys said she was referring to the Republican proposal to repeal the federal estate tax, which would only benefit the wealthiest and does not apply to 99.8 percent of Americans.", "But her tweet made no reference to the estate tax. It gave the impression she was referring to Trump’s overall tax plan. That plan has its critics, including those who believe it gives too much to the rich. Nevertheless, as has been widely reported, the plan offers widespread tax cuts.", "We rate Roys’ statement Pants on Fire.", "Twitter, Kelda Helen Roys tweet, Dec. 1, 2017", "Interview, Kelda Helen Roys, Dec. 11, 2017", "PolitiFact Wisconsin, \"'Death tax' that Republicans want to repeal is paid by only 2 of 1,000 people who die?\" Oct. 27, 2017", "PolitiFact National, \"The House and Senate tax bills, explained,\" Nov. 28, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]