["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A recent blog post claims that a campaign official for President-elect Joe Biden was arrested for \"electoral fraud,\" but there’s no evidence to support that.", "\"Biden campaign director arrested for electoral fraud,\" reads the headline on the website The Point News, a British website run by volunteers.", "The post goes on to say that Dallas Jones, the \"Democrat director of Texas state political strategy\" for Biden’s campaign, was arrested after he was \"formally accused of helping to run an illegal ballot harvesting operation in the state of Texas on behalf of the Joe Biden campaign.\"", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The claim that Jones was arrested has spread on social media, with some posts wrongly claiming a photo of the actor Cuba Gooding Jr. shows Jones being arrested.", "Jones did not immediately respond to an email asking about the post. But the Biden campaign told us in a statement that \"these claims are laughably false.\"", "The blog post cites the National File, which on Oct. 18 published a post that said affidavits filed as part of a lawsuit claimed to have \"video evidence, documentation and witnesses to prove that Biden’s political director Dallas Jones and his cohorts are currently hoarding mail-in and absentee ballots and ordering operatives to fill the ballots out for people illegally, including for dead people, homeless people, and nursing home residents, in the 2020 election.\"", "The lawsuit, filed in September by conservative activist Steve Hotze among other plaintiffs, sought to limit in-person and absentee voting options for voters in Harris County, where Houston is the county seat.", "In October, Snopes dug into the lawsuit’s allegations that some Texas officials were running an illegal ballot harvesting scheme, finding no evidence to corroborate the claim.", "We similarly found no evidence that Jones, a Houston political consultant who the Biden campaign tapped to serve as its Texas political director, has been charged with a crime or arrested.", "We looked at Harris County court records and found nothing to suggest he was charged with electoral fraud.", "Jones told FactCheck.org, \"This is completely make believe and they’re running with it.\"", "With no evidence to back the claim, we rate it False.", "This fact check is available at IFCN’s 2020 US Elections #Chatbot on WhatsApp. Click here, for more.", "The Point News, Biden campaign director arrested for electoral fraud, Nov. 15, 2020", "Tweet, Nov. 14, 2020", "The National File, Biden’s Texas political director accused of illegal ballot harvesting at Texas Supreme Court, Oct. 18, 2020", "The Texan, Biden campaign operative, Texas state senator accused of mail-in ballot fraud, Sept. 28, 2020", "Case 20-0751, filed Sept. 28, 2020", "The Texas Tribune, Houston Republicans sue to limit in-person absentee voting options in Harris County, Sept. 28, 2020", "Snopes, Texas legal filing to block early voting offers little evidence of ‘illegal ballot harvesting’ scheme, Oct. 5, 2020", "Texas Tribune, Biden campaign adds more staff in Texas, Sept. 14, 2020", "FactCheck.org, Fabricated claim of Biden campaign official’s arrest, Nov. 17, 2020", "Harris County district clerk case search, visited Nov. 17, 2020", "Statement from Joe Biden’s campaign, Nov. 17, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]