["About this rating", "A rare and poorly understood condition called \"cannabinoid hyperemesis syndrome\" is tied to long-term cannabis use which drives sufferers to experience excessive vomiting and abdominal pain; this condition could plausibly lead to a combination of screaming and vomiting.", "The degree to which increased access to marijuana is causing increased cases of the syndrome is not fully established, and it is also unclear how widespread emergency room use of the word \"scromit\" is.", "On 5 December 2017, the UK tabloid Metro attempted to revive discussion of an enigmatic and poorly understood disease linked to heavy long-term cannabis consumption by pushing the word \"scromit\" — a portmanteau of \"scream\" and \"vomit\" — onto an unsuspecting public:", "Doctors said users have been taken to hospital after suffering extreme bouts of ‘scromiting’ – which means they are screaming and vomiting at the same time.", "This new word was invented by staff at emergency rooms across the US, who are seeing more and more people turn up yelling in pain and throwing up all over the place.", "Its [sic] believed the scromiting is caused by a condition called Cannabinoid Hyperemesis Syndrome (CHS) which affects people who have consumed weed for a long period of time.", "Cannabinoid Hyperemesis Syndrome (called CHS for short) is, indeed, a real condition. It was first described in a 2004 case report of 19 patients in Australia.  A 2016 report described the progression of the illness this way:", "Classically, CHS progresses into three distinct phases: prodromal [early symptoms], hyperemetic [severe vomiting] , and recovery. During the prodromal phase, the patient develops early morning nausea, a fear of vomiting, and abdominal discomfort. Afterward, the hyperemetic phase consists of incapacitating nausea and profuse vomiting. Most patients complain of mild abdominal pain and weight loss. Patients are relieved by taking hot showers. The recovery stage begins with cessation of cannabis use. The majority of patients will develop this symptom within 1-5 years after the beginning of consumption.", "Among the most pressing mysteries about the condition are what causes some heavy marijuana users to develop it when many other heavy users do not. A 2011 review of the literature has concluded:", "...the mechanism by which cannabis induced hyperemesis is presently unknown.", "Similarly unknown is the reason why the excessive vomiting phase of the syndrome is alleviated by a hot bath or shower, even though this, enigmatically, appears to be the most effective short-term treatment of the condition:", "The most effective treatment during the hyperemetic phase of CHS is the use of hot showers by patients. The effects of this learned behavior are temperature-dependent, fast acting, but short-lived. Hot showers improve symptoms of nausea and vomiting, abdominal pain, and decreased appetite during the hyperemetic phase. The precise mechanism by which hot bathing produces a rapid reduction in the symptoms of CHS is unknown.", "Another question is the degree to which increasingly legal marijuana has played a role in increased diagnosis of the disease. While diagnoses have been rising, it is hard to develop a conclusive understanding of a disease only recently defined in the medical literature. One 2015 study attempted to address this by comparing pre-legalization cases of cyclical vomiting in Colorado emergency rooms to post-legalization cases, seeing a marked increase post legalization, but their numbers were limited by a lack of specific information on each patient's drug use:", "The prevalence of cyclic vomiting presentations nearly doubled after the liberalization of medical marijuana. Patients presenting with cyclic vomiting in the postliberalization period were more likely to endorse marijuana use, although it is unclear whether this was secondary to increased marijuana use, more accurate marijuana reporting, or both.", "The final claim made by Metro concerns the use and origin of the word \"scromiting,\" which they claim was invented by staff at emergency rooms across the United States, \"who are seeing more and more people turn up yelling in pain and throwing up all over the place.\"", "Outside of this unsourced statement and its reappearance in articles referencing the original Metro report, we can find no evidence of this term’s widespread and specific use as it concerns any cannabis-related ailment. Based on the term’s inclusion in the internet-slang database Urban Dictionary since at least 2008, its use likely pre-dates emergency room CHS cases.", "However, the condition, its symptoms, and its occurrence, as described by Metro and other outlets, is accurate. As such, we rank the claim that “people are ‘scromiting’ after smoking too much cannabis” as mostly true, though the condition itself is rare.  Finally, this syndrome is reasonably self-limiting, as CHS is generally resolved fairly simply: through cessation of cannabis consumption.", "Hamill, Jasper.   \"People Are ‘Scromiting’ After Smoking Too Much Cannabis.\"\r\n    Metro.   5 December 2017.", "Allen, J.H., et al.   \"Cannabinoid Hyperemesis: Cyclical Hyperemesis in Association With Chronic Cannabis Abuse.\"\r\n    Gut (BMJ).   November 2004.", "Desjardins, N., and Stheneur, C.   \"Cannabinoid Hyperemesis Syndrome: A Review of the Literature.\"\r\n    Arch Pediatr..   12 April 2016.", "Galli, Jonathan, A., et al.   \"Cannabinoid Hyperemesis Syndrome.\"\r\n    Curr Drug Abuse Rev..   December 2011.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]