["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Donald Trump has often attacked Hillary Clinton’s treatment of women by accusing her of enabling former president Bill Clinton’s sexual impropriety.", "A new ad from pro-Trump super PAC Rebuilding America Now did the same, citing tweets, excerpts from a New York Times article and Hillary Clinton’s own words.", "Referring to Bill Clinton's accusers, the ad claims that Hillary Clinton \"stage-managed their destruction from a White House war room. She savaged their dignity and shamed them.\"", "The video attributes several quotations to Hillary Clinton, which we’ll explore later. We fact checked each individually to see if any were taken out of context.", "But before that, there’s some history you need to understand.", "Accusations", "The Washington Post published a guide to Bill Clinton’s alleged impropriety, dividing claims against him into alleged consensual acts and alleged harassment or assault.", "Five women have alleged consensual affairs, and three others harassment or assault, according to the Post.", "Bill Clinton has not been found guilty in any court of the accusations.  Sources other than the Washington Post — such as the conservative website Breitbart — have higher numbers on how many women Clinton allegedly assaulted or harassed.", "The pro-Trump video does not name specific women, and a spokesperson for the super PAC declined to go into more detail. Experts we reached out to had opposing views on both the ad’s overarching message and on the substance of the alleged incidents. We didn't weigh in on those issues.", "What we could fact-check, however, was whether the ad accurately depicted Hillary Clinton’s quotes. Let’s go one by one.", "The ‘Cosby’ tweet", "The ad says, \"When Bill Cosby was accused of sexual assault, Mrs. Clinton tweeted, ‘Every survivor of sexual assault deserves to be believe.’ \"", "The ad initially references a Nov. 22, 2015, Hillary Clinton tweet on sexual assault. The text of the tweet is accurate. She made similar claims at a rally two weeks later, adding that survivors ought to be believed until \"disbelieved\" by evidence.", "But the tweet is not easily identifiable as a direct reference to Cosby.", "The tweet itself links to Clinton’s plans to tackle sexual assault in college. This might not be a coincidence — CNN aired a version of a documentary on campus assault the same day.", "The Cosby allegations were in the news at the time, although we were unable to find any specific Cosby-related incident that day. The closest was on Nov. 13, when four women joined a defamation lawsuit against the comedian.", "No evidence from the tweet itself, however, directly suggests she responded to Cosby.", "‘Loony toon’", "The ad, turning to allegations against Bill Clinton, said Hillary Clinton called her husband’s accusers \"loony toon.\"", "The \"loony toon\" comment comes from the diaries of Diane Blair, a former University of Arkansas professor and friend of the Clintons. According to those notes, Hillary Clinton referred to Monica Lewinsky — whom the Post lists as a consensual affair — as a \"narcissistic loony toon.\"", "The citation is correctly attributed to Blair’s diaries. The accuracy of what Blair wrote is impossible to determine.", "The ad claims Clinton was referring to sexual assault accusers, but she was speaking of only one woman — Lewinsky.  Experts had differing takes on whether the \"Lewinsky affair\" was consensual or not.", "‘Floozy, bimbo and stalker’", "The ad says \"The Clinton effort used words like ‘floozy, bimbo and stalker.' \" Note, it does not say Clinton said these words — which she didn't.", "The terms are found in a book — Target: Caught in the Crosshairs of Bill and Hillary Clinton — by Kathleen Willey, a woman who accused Bill Clinton of groping her. The language is also found in a New York Times article.", "In the book, Willey writes that Robert Bennett — Bill Clinton’s former lawyer — referred to her in conversations with CBS producers as a \"floozy, bimbo flake.\" The book attributes the \"stalker\" remark to Sidney Blumenthal — a former White House aide — speaking with author Christopher Hitchens.", "The quotations do come from an identifiable source, but again it is impossible to determine whether the quotes themselves are accurate.", "‘A lot to answer for’", "The ad claims that referring to the women, Hillary Clinton said \"some folks are going to have a lot to answer for.\"", "The comment comes from a Today show interview with Matt Lauer on Jan. 27, 1998, soon after news of the Lewinsky affair broke. Lauer asks Clinton about her role defending her husband.", "\"The great story here for anybody willing to find it and write about it and explain it is this vast right-wing conspiracy that has been conspiring against my husband since the day he announced for president,\" Clinton said.", "She goes on to note prior attempts to shut down her husband’s political aspirations, eventually declaring the allegations are \"not going to be proven true.\"", "\"And I think that when all of this is put into context, and we really look at the people involved here, look at their motivations and look at their backgrounds, look at their past behavior, some folks are going to have a lot to answer for,\" she said.", "This could be interpreted as targeting the women making the accusations, but alternatively it could also be targeting various \"right-wing\" political operatives based on the interview’s prior context.", "The Washington Post’s Fact Checker, which previously looked into the ad, noted the ambiguity. A spokesman for the pro-Trump PAC acknowledged it as well, but found their interpretation plausible based on books alleging Clinton mistreated female accusers.", "The ad claims Clinton was questioning the accounts of the women involved. Going back to the source, that is not certain.", "The Clinton camp declined to go on record for this fact-check.", "Our ruling", "A pro-Trump advertisement makes several claims about Hillary Clinton’s hypocritical treatment of women, relying primarily on her own words or those of close confidants.", "The broader message — that Clinton enabled her husband’s alleged sexual assaults — has been and continues to be debated, by pundits and experts alike.", "We didn't weigh in on those arguments, but we did look into the ad’s more specific use of quotes attributed to Clinton. The quotes themselves are hearsay in some cases and subject to different interpretations based on context.", "The ad further misleads by saying Hillary Clinton \"savaged\" the dignity of people who accused Bill Clinton of sexual harassment or assault \"and shamed them.\"", "We rate this claim Mostly False.", "https://www.sharethefacts.co/share/26258019-ded0-4ed2-aec3-33d9bb6b14d6", "\"Rebuilding America Now: It Takes Two,\" Rebuilding America YouTube channel, June 23, 2016", "The New York Times, \"90s Scandals Threaten to Erode Hillary Clinton’s Strength with women,\" January 20, 2016", "The Washington Post, \"A guide to the allegations of Bill Clinton’s womanizing,\" December 30, 2015", "CNN, \"Sources: Clinton Admits Sexual Affair with Flowers,\" January 22, 1998", "\"Bill Clinton admits to having inappropriate relationship with Monica Lewinsky,\" iconic’s YouTube channel, November 18, 2010", "The Wall Street Journal, \"Don’t You Get The Message?\" October 26, 1998", "The Washington Post, \"Another Clinton Accuser Goes Public,\" February 20, 1999", "Breitbart, \"Rap Sheet: The Women Who Claim To Be The Victims Of Bill and Hillary Clinton,\" December 31, 2015", "Personal tweet, Hillary Clinton’s Twitter account, November 22, 2015", "Hillary Clinton’s campaign website, \"It’s not enough to condemn campus sexual assault. We need to end it.\"", "U.S. News, \"4 more women claiming sexual abuse join defamation suit against Bill Cosby,\" November 13, 2015", "\"New Hampshire Voter Asks Hillary Clinton About Bill’s Infidelities,\" Casey Jones’ YouTube account, December 3, 2015", "CBS News, \"Hillary Clinton: Monica Lewinsky a ‘narcissistic loony toon,’\" February 10, 2014", "Kathleen Willey, \"Target: Caught in the Crosshairs of Bill and Hillary Clinton,\" 2007", "Today Show transcript, \"First Lady’s Counteroffensive,\" January 27, 1988", "The Washington Post, \"Pro-Trump group’s ad misrepresents Hillary Clinton’s comments about women,\" June 29, 2016", "Response from Alex Castellanos, \"America Rising Now\" PAC spokesperson, June 29, 2016", "Response from Josh Schwerin, Hillary Clinton spokesperson, June 30, 2016", "Email interview with William Chafe, professor of history at Duke University, June 29, 2016", "Email interview with Paul Kengor, professor of political science at Grove City College, June 30, 2016", "Email interview with Patrick Maney, professor of history at Boston College, June 30, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]