["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Democratic congressional hopeful Shelley Adler says the voting record of her Republican opponent, Rep. Jon Runyan, stands as \"proof that we can't trust him to be on our side.\"\n\nBut one piece of Adler’s evidence against Runyan doesn’t hold up against the facts.  \n\nAt an Oct. 10 campaign event, Adler -- who is challenging Runyan on Nov. 6 for the seat representing the state’s third congressional district -- listed the reasons women should be wary of her opponent.\n\n\"We can’t trust him to stand up for women, after he sponsored legislation that would allow insurance companies to deny women access to birth control and basic preventive health care services. He voted to cut off critical, life-saving health care for women that included cancer screenings, like mammograms, and even voted to redefine rape,\" Adler said. \"That’s not being on our side.\"\n\nAdler levies a hefty allegation against Runyan in claiming he voted to redefine rape, but it’s just not true.\n\nAdler’s charge -- which her campaign has repeated before -- stems from legislation sponsored by Rep. Chris Smith (R-4th Dist.) called the \"No Taxpayer Funding for Abortion Act.\"\n\nThe bill, as introduced, would have permanently restricted federal funding for abortions except in cases of \"forcible rape,\" incest, if the victim was a minor, or to save the life of the mother.\n\nIn September, PolitiFact Wisconsin checked a claim from Rep. Gwen Moore, a Democrat from Wisconsin, that House Republicans \"tried to change the definition of rape\" and rated it Mostly False.\n\nAs one piece of evidence to support the statement, Moore’s spokeswoman cited Smith’s legislation. But PolitiFact Wisconsin found that House Republicans were not trying to change the definition of rape, per se. Rather, they were trying to limit federal funding for abortions.\n\nSo Adler starts off on a flawed premise. But the charge against Runyan  -- which Chris Russell, Runyan’s campaign spokesman, called \"just plain despicable\" --  is even more misleading because when he cast a vote in favor of Smith’s bill, the word \"forcible\" had been removed.\n\nAdler’s spokesman, Michael Muller, acknowledged the error, saying \"you're right about the vote.\"\n\nSmith first introduced the bill in 2010 when Democrats controlled the House. The legislation went nowhere.\n\nBut the next year Republicans gained control of the House. Smith reintroduced his bill on Jan. 20, 2011.\n\nAs we noted in a previous fact-check, Rep. Paul Ryan of Wisconsin, the Republican nominee for vice president, and Rep. Todd Akin -- a Republican Senate candidate from Missouri who made the controversial remark that pregnancies are rare in cases of \"legitimate rape\" -- both signed on as co-sponsors of Smith’s bill.\n\nRunyan never co-sponsored the legislation.    \n\nCritics condemned the term \"forcible rape,\" saying it would exclude rapes involving drugs and victims of statutory rape. By February, Smith had agreed to strip the controversial language from the bill.\n\nSo when the House passed the bill on May 4, 2011, the legislation exempted all cases of rape from the ban on federal funding for abortions.\n\nThe legislation passed by 251 to 175, with Runyan voting in favor of the legislation. The Democrat-controlled Senate never voted on the proposal.\n\nSo  Adler is wrong to claim Runyan voted to redefine rape.\n\nThe vote he cast was in favor of prohibiting federal funding for abortions, except in cases of rape, incest or when the life of the mother was at risk.\n\nOur ruling\n\nAdler said Runyan \"voted to redefine rape\" while listing the reasons \"we can’t trust him to stand up for women.\"\n\nThe Democratic congressional hopeful distorts the voting record of her Republican rival with this claim.\n\nHouse Republicans introduced a bill that restricted federal funding for abortions, except in cases of \"forcible rape.\"\n\nRunyan never signed on as a co-sponsor of that legislation. Further, when the bill reached the House floor for a full vote and Runyan voted in favor of it, the word \"forcible\" had been removed.\n\nWe rate Adler’s claim False.\n\nTo comment on this ruling, go to NJ.com.", "BlueJersey.com, Cory Booker Stumps for Shelley Adler, Oct. 10, 2012\n\nPhone and e-mail interviews with Michael Muller, campaign spokesman for Shelley Adler, Oct. 16, 2012\n\nThe Library of Congress: Thomas, Bill Summary & Status: H.R. 3, accessed Oct. 16, 2012\n\nThe Library of Congress: Thomas, Bill Summary & Status: H.R. 5939, accessed Oct. 16, 2012\n\nHouse Clerk, Final Vote Results for Roll Call 292, accessed Oct. 16, 2012\n\nShelley Adler for Congress, Shelley Adler Blasts Rep. Runyan for his Radical Agenda to Deny Women Access to Preventive Healthcare Services Including Mammograms & Cancer Screenings, Oct. 2, 2012\n\nThe Washington Post, Legislative proposal puts abortion rights supporters on alert, Feb. 1, 2011\n\nPolitiFact Wisconsin, GOP House members tried to redefine rape, Democratic Rep. Gwen Moore says, Sept. 6, 2012\n\nPolitiFact Texas, PAC says, like Todd Akin and Paul Ryan, all Texas Republicans in U.S. House cosponsored bill trying to distinguish \"forcible rape,\" Sept. 6, 2012\n\nPolitiFact New Jersey, Paul Ryan and Todd Akin co-sponsored bill limiting federal funding for abortions to victims of \"forcible rape,\" New Jersey Democratic leader says, Aug. 22, 2012\n\nPolitiFact, Codify Hyde Amendment to prohibit federal funding of abortion, July 24, 2012\n\nThe Washington Post, 'Forcible rape' cut from antiabortion bill after backlash from women's groups, Feb. 3, 2011", "E-mail interview with Chris Russell, campaign spokesman for Jon Runyan, Oct. 17, 2012", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]