["About this rating", "An Australian teenager found his legs covered in blood, unable to stop bleeding, after soaking his feet in the water.", "Marine scientists have concluded that the critters responsible were likely sea fleas, not sea lice.", "On 6 August 2017, Daily Mail Australia ran a story with an alarming headline:", "Teen rushed to hospital with blood pouring from his feet after flesh-eating SEA BUGS attacked him as he swam at a Melbourne beach", "The article describes a 5 August 2017 incident in which 16-year-old Sam Kanizay decided to soak his legs in the ocean after playing soccer. When he removed his legs from the water after about 30 minutes, they were covered in blood:", "Sam Kanizay, 16, was soaking his legs in the water at Dendy Street Beach in Brighton, Melbourne, on Saturday evening when he said he felt his legs tingling. He told Fairfax Media he presumed it was because his legs were sore from playing football and the water was cold.", "But after coming out of the water about 30 minutes later, he found his legs were covered in tiny sores which were oozing with blood. [...]", "After attempts to stop the bleeding were unsuccessful, the teenager spent his weekend at two different hospitals, where doctors also tried and failed to stop the sores from bleeding. One nurse advised the bites could be from sea lice, but it was no more than a 'guess'.", "While Daily Mail latched onto this guess with some certainty (even adding a sidebar about the critter), the Sydney Morning Herald later reported that marine scientist Genefor​ Walker-Smith had examined the critters in question and found that they were most likely amphipod crustaceans -- commonly known as “sea fleas”:", "Museum marine scientist Dr Genefor​ Walker-Smith has examined specimens collected by Sam's father, Jarrod Kanizay – using bites of meat as lures – at Brighton on Sunday night, and said the creatures were sea fleas, not sea lice as first thought.", "Yes, these tiny (half-a-centimetre to one-centimetre long) carnivores will feed on human flesh, but Dr Walker-Smith said there was no cause for alarm.", "She said the number of bites sustained by 16-year-old Sam was unusual and a swarm of fleas might have been attracted by a cut in his skin, or Sam might have stepped near a fish carcass they were feeding on.", "While Kanizay is expected to make a full recovery, the issue of his excessive bleeding has remained somewhat mysterious. Walker-Smith suggested that some sea fleas might inject an anticoagulant into their food to prevent blood from clotting:", "[Walker-Smith] said it was not surprising that Sam's bleeding would not stop – this symptom had been seen in bite cases from crustaceans before, although she hadn't heard of it among crustaceans in this group. \"It is possible that the amphipod has an anti-coagulant that it released like leeches do, so it stops the blood from clotting.\"  [...]", "\"It probably did make it worse that [Sam] was standing still; they may not have been able to cling on too tightly if he had been moving through the water. They're used to eating dead things still on the bottom [the ocean floor].\"", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]