["By Angelo Fichera", "Posted on January 11, 2019", "Viral Facebook posts say that former President Barack Obama “shut down the government to force Obamacare.” That’s misleading.", "The current partial government shutdown that began Dec. 22 arose as a result of an impasse between President Donald Trump and Democratic congressional leaders over funding for Trump’s proposed wall at the southern border.", "The lingering disagreement has stalled Congress’ passing seven appropriations bills to fund a number of federal departments and agencies, creating the partial shutdown.", "Amid the skirmish, viral posts have circulated on social media reminding users of a 2013 government shutdown, which was over President Barack Obama’s signature healthcare law, the Affordable Care Act — often referred to as “Obamacare.”", "“By the way in 2013 Obama shut down the government to force Obamacare,” one posts read. “In case you forgot.”", "That misleading text mirrors a popular Dec. 30 tweet from the singer Kaya Jones, a Trump supporter who was once affiliated with the girl-band group the Pussycat Dolls. A Jan. 6 Facebook post using similar language garnered more than 150,000 shares alone.", "Here’s what happened: The October 2013 shutdown occurred when the Republican-controlled House and Democrat-controlled Senate could not reach an agreement on a government spending plan.", "Republicans, who made clear they wanted to derail the Affordable Care Act by stripping funds from it, attempted to attach to a funding bill provisions to defund or delay aspects of the act. Democrats refused to support any such move.", "But the Affordable Care Act itself was enacted in 2010, and the efforts to defund it would not have been the same as repealing it because provisions of the law would have remained in effect regardless (which some Republicans at the time recognized).", "The 2013 shutdown itself also didn’t stop implementation of key aspects of the Affordable Care Act. Insurance enrollment through the ACA marketplace began Oct. 1, as scheduled, and premium credits to help people buy insurance were still available because the funding was outside the annual appropriations process.", "After 16 days, Congress approved funding legislation on Oct. 16, 2013, to reopen the government.", "While it’s true Obama didn’t concede to Republicans’ demands to roll back the Affordable Care Act, it’s misleading to say “Obama shut down the government to force Obamacare.” The healthcare law was already in place and its financing already approved.", "Some Republicans held fellow Texas Sen. Ted Cruz responsible for pushing the shutdown (although he has denied prompting it). Cruz reportedly helped gather the support to force then-House Speaker John Boehner to pass a spending bill that would strip money from the health care law, despite the unlikely chance of it passing the Senate or being signed by Obama. Days before the shutdown, Cruz gave a 21-hour speech about the need to defund Obamacare.", "In the case of the current shutdown, Trump has refused to sign an omnibus spending bill unless it includes $5.7 billion to build his promised border wall.", "At a Dec. 11 Oval Office meeting, Senate Minority Leader Chuck Schumer said the Democrats “want to do the same thing we did last year, this year” — meaning $1.375 billion, which was how much Congress appropriated for border infrastructure in fiscal 2018. Trump refused, saying “we can build a much bigger section with more money.”", "“I am proud to shut down the government for border security, Chuck, because the people of this country don’t want criminals and people that have lots of problems and drugs pouring into our country,” Trump said. “So I will take the mantle. I will be the one to shut it down.”", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on the social media network.", "Gillman, Todd. “Eyes roll as Ted Cruz denies role in 2013 government shutdown; ‘Speechless’ says one senator.” Dallas Morning News. 22 Jan 2018.", "“Meadows Sends Letter Encouraging House Leadership to Defund Obamacare.” Press release, Office of Rep. Mark Meadows (N.C.-11). 22 Aug 2013.", "“Open enrollment in the Health Insurance Marketplace is here!” HealthCare.gov. 1 Oct 2013.", "Page, Susan. “Poll: Nearly half say replace everyone in Congress.” USA Today. 21 Oct 2013.", "“Patient Protection and Affordable Care Act.” HealthCare.gov. Accessed 9 Jan 2019.", "“Q&A: Everything You Should Know About Government Shutdowns.” Committee for a Responsible Federal Budget. 7 Jan 2019.", "Rae, Matthew et al. “The Cost of the Individual Mandate Penalty for the Remaining Uninsured.” Kaiser Family Foundation. 9 Dec 2015", "Raju, Manu. “Some colleagues angry with Cruz.” Politico. 2 Oct 2013.", "Redhead, C. Stephen, et. al. “Affordable Care Act (ACA) and the Appropriations Process: FAQs Regarding Potential Legislative Changes and Effects of a Government Shutdown.” Congressional Research Service. 2 Oct 2013.", "“Remarks by the President on the Affordable Care Act and the Government Shutdown.” Obama White House. 1 Oct 2013.", "Weisman, Jonathan and Ashley Parker. “Republicans Back Down, Ending Crisis Over Shutdown and Debt Limit.” The New York Times. 16 Oct 2013.", "Yan, Holly. “Government shutdown: Get up to speed in 20 questions.” CNN. 1 Oct 2013.", "“FY2018 Agency Financial Report.” Department of Homeland Security. 15 Nov 2018.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]