["President Donald Trump delivers his State of the Union address to Congress on Capitol Hill in Washington on Feb. 4, 2020. (AP/Brandon)", "Sanctuary policies don’t mean that undocumented criminals get to walk free of charges, or that local officials order police to release them as standard operating procedure.", "Sanctuary policies protect noncitizens from being turned over to ICE after they’ve gone through the justice system. But many sanctuary policies have provisions allowing police to cooperate with ICE for noncitizens with previous felony convictions.", "Media reports and ICE have documented some cases in which noncitizens with serious criminal records were released by sanctuary cities in spite of detainer requests.", "During the 2020 State of the Union address, President Donald Trump slammed \"sanctuary cities\" for their limited cooperation with Immigration and Customs Enforcement.", "\"In sanctuary cities, local officials order police to release dangerous criminal aliens to prey upon the public instead of handing them over to ICE to be safely removed,\" he said.", "Trump cited an incident in which an undocumented immigrant released from custody allegedly assaulted and killed a 92-year-old woman in New York City. Trump also spotlighted the brother of a man killed in a crime spree by an undocumented immigrant released in California.", "\"The United States of America should be a sanctuary for law-abiding Americans, not criminal aliens,\" he said, calling on Congress to pass a bill to let victims sue sanctuary cities.", "There’s no federal definition for a sanctuary city, and the details vary from place to place.", "But broadly speaking, the term refers to any jurisdiction that refuses to continue holding people in local jails beyond their jail or prison sentence solely because ICE has asked the jurisdiction to do so. (ICE’s request is formally known as a detainer.)", "The individual cases Trump addressed were documented in media reports, and the White House has published a list of other criminal noncitizens shielded from ICE officials.", "But Trump’s claim that local officials \"order police to release dangerous criminal aliens\" makes setting criminals free sounds like standard operating procedure.", "As we detailed while fact-checking a similar claim in 2018, that’s not the case. Even sanctuary cities typically turn over to ICE many of the felons Trump warns about.", "The White House and Trump campaign did not respond to requests for comment.", "ICE news releases report numerous instances of ignored detainer requests that result in undocumented immigrants being set free and later arrested by ICE.", "According to ICE’s report for the 2019 fiscal year, 86% of the roughly 143,000 noncitizens arrested by ICE had criminal convictions or pending charges.", "It’s unclear how many were arrested after being released in sanctuary cities. The report says ICE issued 165,487 detainers to law enforcement officials, and that \"a number of aliens who have been released under these circumstances have gone on to commit additional crimes.\"", "Some insight came during an October Senate hearing, when ICE official Timothy Robbins said the agency brought roughly 1,300 noncitizens into custody over the span of a \"few weeks,\" including \"large numbers\" of people who had been released in sanctuary cities.", "Robbins said three of those 1,300 people had prior convictions for manslaughter or murder, 100 had convictions for sexual assault or related crimes, 70 had convictions for drug-related crimes, and 320 had convictions for driving under the influence.", "\"Almost 200 of the aliens arrested during the most recent operation could have been taken into custody at local jails if the detainer had been honored,\" Robbins said.", "Robbins did not say whether any of the 200 people ICE targeted with detainers went on to commit further crimes or, in Trump’s words, \"prey\" on Americans.", "Sanctuary policies across the country treat dangerous criminals differently, but experts told us many have specific ways of dealing with them.", "\"A number of the sanctuary policies have carve-outs for individuals with certain types of felony offenses, and some non-felony offenses,\" Annie Lai, clinical professor of law at the University of California Irvine, told us. \"You want to see if the policy allows for detention for ICE, notification to ICE, transfer to ICE or transfer only with a warrant. Each of these mean different things.\"", "California’s sanctuary law, for example, gives law enforcement officials leeway to hold someone for ICE if they’ve committed one of a number of crimes.", "The list includes gang-related offenses, assault, battery, sexual abuse and exploitation, rape, crimes endangering children, burglary, robbery, theft, fraud, forgery, any crime resulting in death, some domestic violence offenses, and drug and weapon-related offenses.", "In New York City, people convicted of one or more of 177 types of felonies within the last five years can be handed over to ICE authorities, but only if those authorities secure a warrant first.", "Michelle Mittelstadt, director of communications at the Migration Policy Institute, told us she’s \"unaware of a jurisdiction that releases ‘dangerous criminal aliens’ as a matter of policy.\"", "\"Where jurisdictions have set limits on their cooperation with ICE typically revolve around the issue of whether the agency is seeking transfer of a noncitizen who has been booked or charged versus an offender who is completing a criminal sentence, as well as whether ICE needs to seek a court order for the request to detain a noncitizen,\" she added.", "Mittelstadt explained that when noncitizens are released in sanctuary cities, \"the criminal justice process has taken place or is taking place as it would in the case of anyone else.\"", "\"When state and local prisons release noncitizens without transfer to ICE, the person has completed their criminal sentence, has been released without charge, or has been charged and released on bond pending further action in the criminal justice system,\" she said.", "The New York City murder suspect Trump mentioned had originally been arrested for attacking his father with a broken coffee cup and arraigned on charges of assault and criminal possession of a weapon before he was released pending trial, according to reports.", "He had not yet been convicted on those charges by the time of the alleged murder.", "Meanwhile, the California man who went on a crime spree in 2018 had previously been convicted of armed robbery. But the charge was 15 years old, meaning local police couldn’t use it to justify holding him for ICE, according to the Washington Post.", "He had been deported twice before, in 2004 and 2014, and was arrested in 2018 after a caller reported erratic behavior. He tested positive for use of a controlled substance, but because that offense only carried a misdemeanor charge, he was released after 10 hours in custody.", "Mike Boudreaux, the county sheriff on the case, blamed California’s sanctuary law for keeping his officers from coordinating with ICE authorities.", "\"That tool has been removed from our hands,\" he said, according to the Washington Post. \"And because of that, our county was shot up by a violent criminal.\"", "Trump said, \"In sanctuary cities, local officials order police to release dangerous criminal aliens to prey upon the public instead of handing them over to ICE to be safely removed.\"", "Sanctuary policies don’t mean that undocumented criminals get to walk free of charges, or that local officials order police to release them as standard operating procedure.", "Noncitizens facing arrest still go through the criminal justice system; sanctuary policies mean that they aren’t turned over to ICE authorities after they’ve done so.", "Still, many sanctuary policies include specific provisions allowing law enforcement to comply with ICE’s requests when it comes to noncitizens who have been convicted of felonies. That’s the case in both California and New York City — the two places Trump called out by name.", "Media reports and ICE press releases have documented some cases in which noncitizens with serious criminal records were released by police in spite of detainer requests. But these individuals had already gone through the criminal justice system in one way or another.", "We rate this statement Mostly False.", "C-Span, \"2020 State of the Union Address,\" Feb. 4, 2020", "U.S. Customs and Immigration Enforcement, \"U.S. Immigration and Customs Enforcement Fiscal Year 2019 Enforcement and Removal Operations Report,\" accessed Feb. 5, 2020", "Senate Judiciary Committee, Testimony of Timothy S. Robbins, Oct. 22, 2019", "Congress.gov, \"S.2059 - Justice for Victims of Sanctuary Cities Act of 2019,\" July 9, 2019", "California Legislative Information, SB-54, Oct. 5, 2017", "ABC News, \"Acting ICE director slams New York City's sanctuary city policy following murder of 92-year-old woman,\" Jan. 17, 2020", "The New York Times, \"Man Accused of Murdering Woman, 92, Should Have Been Deported, ICE Says,\" Jan. 14, 2020", "New York Post, \"De Blasio adds sex crimes to ICE list used to deport convicted felons,\" May 10, 2019", "Center for Immigration Studies, \"Map: Sanctuary Cities, Counties, and States,\" April 16, 2019", "The Washington Post, \"After a shooting suspect’s ‘reign of terror,’ a California sheriff blames the state’s sanctuary law,\" Dec. 20, 2018", "Los Angeles Times, \"No, California’s ‘sanctuary state’ law does not allow the release of dangerous criminals to the streets,\" April 6, 2018", "The New York Times, \"In a ‘Sanctuary City,’ Immigrants Are Still at Risk,\" Feb. 27, 2018", "The White House, \"Criminal Aliens Set Free By Sanctuary Cities,\" Feb. 13, 2018", "PolitiFact, \"Sanctuary jurisdictions 'violate the laws of our nation'? That's Mostly False,\" Nov. 27, 2018", "PolitiFact, \"Donald Trump's wild number of sanctuary city criminal releases,\" Oct. 31, 2018", "PolitiFact, \"Separating fact from fiction on California’s Sanctuary State law,\" Aug. 2, 2018", "PolitiFact, \"Jeff Sessions exaggerates claim about 'sanctuary' policies and violating federal law,\" March 30, 2017", "Email interview with Michelle Mittelstadt, director of communications at the Migration Policy Institute, Feb. 4, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]