["The misleading image was shared on Facebook here on July 9, 2019, and here on July 11, 2019. The same photo was also posted to Facebook here, where it was shared more than 7,000 times before it was removed.", "Below is a screenshot of the misleading post published on July 9, 2019:", "The Indonesian-language caption translates to English as: “So delicious...it is also halal...hahahaha.”", "On the top left corner of the package, the two Indonesian words translate to English as: “Pork Crisps”.", "A drawing of a pig can also be seen on the package, with the word “cap” written above translates to English as “brand” and “BABI”, below it, which means “pig”.", "The text in red below translates to English as: “Meat and quality guaranteed. Without preservatives and flavoring”.", "A halal logo can also seen on the top right of the label, in black.", "Eating pig products is prohibited in the Islamic faith, as explained here.", "The image in the misleading posts has been doctored. A keyword search on Google found the pork crisps shown in the photo for sale in a number of online shops, for example oleholehkhasbali.com, on the Hindu-majority Indonesian resort island of Bali.", "However, there is no halal label on the crisp packets sold via the shop, as seen in the screenshot below:", "The owner of the crisp factory in Bali’s Tabanan district, Made Dharma Putra, confirmed to AFP by phone on July 16, 2019, that he had never registered his product to Indonesia’s halal certification agency.", "“It is impossible for me to register the product. It is clear the product is made of pork and the drawing of a pig can be seen in the package. It is made for non-Muslims,” he said.", "UPDATED: this fact check was updated 23/07/2019 to change the description of Bali's Tabanan from \"town\" to \"district\" second paragraph from end.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]