["By Angelo Fichera", "Posted on June 18, 2020 | Updated on June 19, 2020", "Headlines on social media misleadingly suggest that House Speaker Nancy Pelosi violated a military tradition when she gave a folded flag to the brother of George Floyd. A folded flag is not “Reserved Only For Fallen Veterans,” as one headline claims. Members of Congress routinely present flags that have flown over the U.S. Capitol as gifts.", "Philonise Floyd — the brother of George Floyd, who was killed in police custody in Minneapolis in late May — testified before the House Judiciary Committee on June 10 during a hearing on police practices and law enforcement accountability.", "During Philonise Floyd’s visit to the Capitol, House Speaker Nancy Pelosi gifted him a folded, encased U.S. flag — as a photo posted on her official Facebook and Twitter accounts shows.", "“Philonise Floyd’s heart-wrenching testimony to the House Judiciary Committee left its mark on us all. May this flag, which flew over the Capitol on the day of his brother’s murder, serve as a symbol of our shared commitment to securing justice for George and all victims of police violence,” her Facebook post said.", "Headlines that circulated on social media in the days after, however, misleadingly suggested that Pelosi’s act trampled on a tradition that reserved the gifting of a folded flag only for military families.", "The conspiracy theory website InfoWars, in a June 15 story that was republished by teaparty.org, declared: “Pelosi Gifts George Floyd’s Brother Folded American Flag Reserved Only For Fallen Veterans.”", "A headline on NeonNettle.com on June 16 echoed the claim: “Pelosi Gifts George Floyd’s Brother Folded American Flag Meant for Fallen Military.” The website later corrected its story.", "The InfoWars story goes on to claim that “[f]olded American flags are traditionally presented by the U.S. government to families of fallen veterans during military funerals” and cites “specific criteria necessary to receive a folded American flag” from the U.S. Veterans Affairs website. It claims Floyd’s family “does not fall into the listed criteria of eligible recipients.”", "There are indeed criteria for those eligible to receive burial flags from Veterans Affairs; the flags are provided at no cost for the funeral of veterans and typically are given to the next-of-kin as a keepsake afterward.", "But there’s nothing that precludes Pelosi, or any other American citizen, from gifting a flag — or folding it.", "“There are no prescriptive rules saying you can’t give a flag to anyone,” said Scot Guenter, senior director of the Flag Research Center and professor emeritus of American Studies at San Jose State University. “The whole point of the American flag is that we don’t live in a society that says you can’t use the flag.”", "Guenter, who wrote the book, “The American Flag, 1777-1924: Cultural Shifts from Creation to Codification,” also told us in a phone interview that folding a flag is a sign of respect for it.", "There is also no mention in the U.S. “Flag Code,” whose provisions Guenter said are “rules of etiquette,” of who is allowed to gift a flag.", "“While the Department of Veterans Affairs provides a casket flag for all honorable veterans and the military service provides them for active-duty service members upon their death, the U.S. Flag Code does not prohibit or limit a flag draping the coffin to any specific group,” John Raughter, a spokesman for the American Legion, a veterans association, told us in an email. “Traditionally though, as the flag is provided for veterans and active-duty service members, it has come to represent a veteran funeral rite.”", "Raughter added that “there is no rule about who may receive a flag as a gift. We encourage the display of the flag of the United States by all citizens of the United States. Now while there is no rule for it, traditionally a flag is folded into a triangle when it is not flown and may be stored in a presentation case if a particular flag has special meaning.”", "“So presenting someone with a flag, folded into a triangle and placed into a display case is an honorable way of presenting and maintaining the flag of the United States,” he said.", "Flags that are flown over the Capitol — as was the case with the one given to Philonise Floyd — are, in fact, routinely requested by the offices of members of Congress through the Capitol Flag Program, which started in the 1930s.", "The program, under the Architect of the Capitol, allows members of the public to purchase such flags through House and Senate offices; many members of Congress have instructions on their websites for ordering a flag for any occasion. The Architect of the Capitol “fulfills on average more than 100,000 flag requests from Members of Congress annually, with the number of requests and the popularity of the Capitol Flag Program growing steadily each year,” according to the program’s website.", "And, according to the House Members’ Congressional Handbook, members can use such flags as official gifts.", "“U.S. flags flown over the Capitol for official presentation as a gift, including the flag flying fee, are reimbursable,” the handbook says. “Such flags must be for the personal use of or display by the recipient (examples may include, but are not limited to: flags presented at a building dedication for which the Member secured official funding, a flag presented to the family of a fallen soldier, flags presented for exceptional public distinction, etc,).”", "So nothing in the handbook, either, limits members’ gifting of flags flown over the Capitol only to military families.", "In December 2016, former Rep. Dennis Ross, a Republican from Florida, gave a folded, framed flag that had flown over the Capitol to a new school in Davenport, Florida. And the next year, Republican Rep. Roger Williams of Texas gifted two folded, encased flags from the Capitol to two new schools in his district.", "Update, June 19: We updated this article to reflect that NeonNettle.com has corrected its story.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "“Burial Flags Frequently Asked Questions.” U.S. Department of Veterans Affairs. Accessed 17 Jun 2020.", "“Capitol Flag Program.” Architect of the Capitol. Accessed 18 Jun 2020.", "“Citrus Ridge: A Civics Academy Grand Opening.” The Ledger. 9 Dec 2016.", "Guenter, Scot. Senior director, Flag Research Center. Phone interview with FactCheck.org. 17 Jun 2020.", "Martin, Todd. “‘This gift represents our country’: Flags flown at U.S. Capitol arrive in Killeen.” Killeen Daily Herald. 15 Dec 2017.", "“Members’ Congressional Handbook.” House Committee on House Administration. Accessed 18 Jun 2020.", "Pelosi, Nancy (@NancyPelosi). “Philonise Floyd’s heart-wrenching testimony to the House Judiciary Committee left its mark on us all. May this flag, which flew over the Capitol on the day of his brother’s murder, serve as a symbol of our shared commitment to securing justice for George and all victims of police violence.” Facebook. 10 Jun 2020.", "“Oversight Hearing on Policing Practices and Law Enforcement Accountability.” House Committee on the Judiciary. 10 Jun 2020.", "Raugher, John. Spokesman, American Legion. Email to FactCheck.org. 18 Jun 2020.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]