["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Dolly Parton and Queen Latifah starred in \"Joyful Noise,\" one of the recent movies to be filmed in Georgia. Photo provided by Warner Bros. Pictures.", "Georgia’s lucrative tax credits for movie and TV production generate more than just the chance to spot Betty White and Chris Evans noshing in restaurants around Atlanta.", "The industry also supports more than 24,000 jobs and pays more than $1.68 billion in wages to those workers, according to a press release this week from the Motion Picture Association of America.", "That’s the equivalent of the entire population of the city of Decatur working in an industry that in 2013 saw $261 million spent on location in shoots in Georgia, according to a 2013 report from a nonprofit that tracks English-language film production worldwide.", "So, PolitiFact Georgia thought those numbers seemed high but plausible – especially if you count the hordes of zombies needed every week in \"The Walking Dead.\" We decided to check it out.", "First, it’s worth knowing that the MPAA released its data for Georgia and other states as part of a hard push of Trade Promotion Authority (TPA), in which Congress defines negotiating priorities for trade agreements.", "In this case, the Senate has approved but the House has yet to vote on providing \"fast track\" authority for President Obama to speed a Trans-Pacific Partnership trade deal (TPP) through Congress.", "In other words, the deal would expand trade and access for Atlanta’s zombies – not to mention \"The Hunger Games\" franchise and the Evans’ now-filming \"Captain America: Civil War\" – to much of the Asia-Pacific region, said MPAA spokeswoman Kate Bedingfield.", "\"The movies made in Georgia are reaching a global audience, and it’s important we can access those markets with as little friction as possible,\" Bedingfield said. \"The jobs grown in Georgia are dependent on being able to market those products easily overseas.\"", "Georgia has heavily incentivized the industry in recent years to lure projects. Production companies can earn a 20 percent income tax credit on in-state costs of projects worth at least $500,000.", "Another 10 percent credit is given for using a Georgia logo in production credits.", "The MPAA used the federal government’s own data, compiled by the U.S. Bureau of Labor Statistics in the Quarterly Census of Employment and Wages, in calculating the total job and wage estimates.", "The BLS data broad categories of motion pictures and broadcasting show an annual average of 20,869 employees and total annual wages of $1.55 billion in 2013.", "But the MPAA drills down deeper into those broad categories and others, excluding the recording artists covered in the broad category but captures jobs from other categories – such as payroll workers and electricians – it can show work in the film or TV industry, said Julia Jenks, the vice president of research for the MPAA.", "In some of those more specific groups, such as cable TV production, all of the jobs and pay count toward the MPAA tally.", "Others, such as costume rental and wardrobe, are counted based on U.S. Census or research calculations that tell what proportion of those jobs work in the industry. The MPAA calls that its adjustment factor on the government figures.", "\"It’s our best estimate, and a very conservative estimate,\" Jenks said.", "Using those parameters, the BLS counts 48,539 jobs but the MPAA tally for Georgia is 24,162:", "Job Code", "Description", "BLS total", "Adjustment", "MPAA total", "334614", "Audio/Video Reproduction", "152", "68.7%", "104", "512110", "Motion Picture Video & Production", "3,864", "100%", "3,864", "512120", "Motion Picture & Video Distribution", "22", "100%", "22", "512191", "Teleproduction, Other Post Production", "148", "42%", "62", "512199", "Other Motion Picture & Video", "59", "100%", "59", "532220", "Formal Wear/Costume Rental", "623", "3%", "19", "532490", "Other Machinery Rental, Leasing", "1,349", "6%", "81", "541214", "Payroll", "15,739", "30%", "4,722", "561311", "Employment Placement", "6,198", "1%", "62", "711510", "Independent artists, writers", "1,291", "23%", "297", "423990", "Prerecorded Video Wholesale", "1,738", "12%", "209", "512131", "Movie Theaters (except drive-ins)", "3,348", "100%", "3,348", "512132", "Drive-in Theaters", "45", "100%", "45", "515120", "Television Broadcasting", "7,138", "100%", "7,138", "515210", "Cable & Subscription Programming", "3,670", "100%", "3,670", "519130", "Internet Publishing & Broadcasting", "2,778", "3%", "83", "532230", "Video & Disk Rental", "377", "100%", "377", "Using the BLS tables, PolitiFact Georgia was able to replicate all of the job figures, except in three categories.", "The 2013 quarterly census shows 303 jobs in audio/video reproduction – exactly double the MPAA’s count.", "And, the official BLS data does not have an annual average for jobs in the one category few think of as a movie industry gig: working in movie and drive-in theaters, economist Timothy Ewing said.", "A nine-month average is available for those jobs, which have high turnover. But that means they are comparable to the yearly figures in other categories.", "Ewing could not comment on the adjustments the MPAA made in categories, other than to note it would create more conservative estimates.", "So, using the BLS-confirmed data, and the MPAA’s own adjustments, the total number of jobs drops to 20,873.", "But the MPAA is conservative in other ways. It does not include at all freelance workers common in production, who provide contract work in, say, makeup or construction.", "PolitiFact Georgia recently showed that Tyler Perry’s new studio planned for Fort McPherson will alone create between 2,000 to 6,000 of those jobs.", "It is reasonable to think the MPAA could easily reach its 24,000 jobs figure if it counted contract work on the 23 movies or 39 TV series filmed in Georgia in 2013.", "The question remains if those jobs, and their pay, are truly Georgia jobs. The state incentive allows movie companies to get credits on what they pay stars, and accountants, for the time they work in the state.", "Our ruling", "The MPAA released data this week to bolster its lobbying to fast-track a trade deal that would open more of Asia to its content.", "It claimed the industry supported 24,000 direct jobs and paid workers more than $1.68 billion in the Peach State in 2013.", "Federal data confirms nearly all of the job figures and payroll, many of which have been reduced from the official headcount.", "The MPAA overreaches in deciding movie theater workers such as ushers are industry workers, versus retail employees. But those jobs would likely be outweighed by freelance workers on production sets, which the MPAA did not count in its tally.", "We rate the group’s claim Mostly True.", "Motion Picture Association of America, Creating Jobs, June 8, 2015", "Economic Contributions of the Georgia Film and Television Industry,  MNP LLP, MPAA-commissioned Economic Impact Study, February 2011", "Motion Picture Association of America, Industry Economic Contribution Factsheet, 2013", "Bloomberg News, \"Fast track trade vote in House set for Friday,\" June 10, 2015", "FilmLA, 2013 Feature Film Production Report, March 2014", "The U.S. Census Office, Reference guide for Bureau of Labor Statistics job codes in motion picture industry, archived 1997", "Georgia Department of Economic Development, Film and TV Production Office, accessed June 8, 2015", "U.S. Department of Labor, Bureau of Labor Statistics, Quarterly Census of Employment and Wages 2013 Annual Averages, Georgia, created June 9, 2015", "PolitiFact Georgia, \"Studio plan jobs claim misleading,\" May 1, 2015", "Phone interview, Kate Bedingfield, spokeswoman, Motion Picture Association of America, June 9 and 10, 2015", "Phone interview, Julia Jenks, vice president of research, Motion Picture Association of America, June 10, 2015", "Email interview, Timothy Ewing, economist, U.S. Department of Labor Bureau of Labor Statistics, June 9 and 10, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]