["A new political ad shows a burglar climbing into a window, taking someone's wallet, and driving off in their car.\n\n\"What would it feel like if someone broke into your home?\" The narrator asks. \"Would you be upset? Then what about what's happening in Washington? Zack Space voted for Nancy Pelosi's budgets and debt, for job-killing energy taxes, and for her wasteful stimulus. And we still lost more than 2.5 million jobs. With Pelosi and Space's agenda, it can feel like you're getting robbed. This November, vote against Zack Space.\"\n\nThe ad comes from Americans for Job Security, a conservative anti-tax group. The group does not disclose its donors, and that has led to questions about who funds the group and for what purposes. The ad, called \"Robbed,\" is part of an ad buy against several Democratic candidates around the country. The ad targets Space of Ohio, Pennsylvania Rep. Jason Altmire and Democratic challengers Bryan Lentz of Pennsylvania and Trent Van Haaften of Indiana. For Lentz and Van Haaften, the ad says that each candidate \"wants to join Nancy Pelosi,\" and then lists the measures as  \"Pelosi's agenda.\"\n\nThe ad mentions major pieces of legislation passed by Democrats in Congress and labels them a failure because \"we still lost more than 2.5 million jobs.\" Take away the scary robber imagery, and it's a fairly straightforward claim.\n\nWe decided to fact-check the ad for Space, who represents eastern Ohio and is a member of the Blue Dog coalition, a group of fiscally conservative Democrats. We'll take the ads' claims about him in order.\n\n• Space \"voted for budgets and debt.\"\n\nSpace did vote for the 2010 budget, a vote that in the U.S. House of Representatives was mostly along party lines, 233-193. (Seventeen Democrats voted with Republicans in opposition.)\n\nOne might argue that the budget is more President Barack Obama's than Nancy Pelosi's -- the president proposes the budget, and Congress votes on it. But Pelosi, as speaker of the House, leads the Democrats, who overwhelmingly approved the budget.\n\nBut the ad gets it wrong on Space's vote on \"debt.\" Here, the ad cites a vote from December 2009 that permitted the national debt limit to increase from $12.1 trillion to $12.39 trillion. The vote in this case was 218 to 214, with 39 Democrats joining all the Republicans.\n\nIn this case, Space voted with the Republicans and against raising the debt limit. So the ad gets this point wrong.", "• Space voted for \"job-killing energy taxes.\"\n\nThis is Americans for Job Security's way of saying that Space voted for major energy legislation (Republicans lately have been fond of putting \"job-killing\" in front of many things the Democrats support.) But as we've pointed out before, the legislation was for a cap-and-trade system, not an energy tax.\n\nAt its heart, cap-and-trade is a simple concept: To slow climate change, the government would set a cap on carbon dioxide and other greenhouse gas emissions. To comply, companies such as electric utilities must either upgrade to cleaner technologies or buy credits — also known as allowances — to continue polluting. Presumably, the costs associated with that end up getting passed on to consumers.\n\nPolitiFact Ohio looked into this issue previously, when Republican candidate Bob Gibbs attacked Space for voting for the legislation, saying the measure would cost the average household \"approximately $1,761 per year in increased energy rates.\" We found that number to be a wild exaggeration, based on estimates that were not part of the bill that Space voted for. We rated that statement Pants on Fire. And whether the measure is job-killing is also a contested issue. Some say it will actually create jobs, and there's a lively debate on the issue. The nonpartisan Congressional Budget Office found that employment rates would be \"slightly lower\" if cap-and-trade passes.\n\nHere, we'll note that Space did vote for the cap-and-trade legislation, but calling it a \"energy tax\" is not an accurate way to describe the measure.", "• Space voted for a \"wasteful stimulus.\"\n\nAgain, Space did vote in favor of the American Recovery and Reinvestment Act, popularly known as the economic stimulus. Whether it was \"wasteful\" is still a matter for debate at this point. (We've done many fact-checks on the stimulus, read them all here.)\n\nWe should point out that the nonpartisan Congressional Budget Office released new estimates on Aug. 24, 2010, that the stimulus added between 1.4 million and 3.3 million jobs to the economy, compared with not having any stimulus. Still, the economy was in such bad shape that overall employment declined anyway, as we'll see in the next point.\n\n• \"And we still lost more than 2.5 million jobs.\"\n\nTo check this jobs number, we turned to the Bureau of Labor Statistics, a division of the U.S. Department of Labor. Given the ad's content, we think it's fair to start counting from about the time the stimulus passed to today. There are several different ways to calculate employment numbers, so we decided to look at two measures. Both supported the ads' claim.\n\nFirst, we looked at total employment, the number of workers in the United States. It was 132.8 million in February 2009, and 130.4 million in June 2010. (June is the most recent month with final numbers; data for July and August are still preliminary.) That's a difference of 2.4 million workers, very close to the ad's statement.\n\nIf you look at only private employment, there were 110.3 million people employed in February 2009 and 107.7 million employed in June 2010. That's a difference of 2.6 million people.\n\nSo the ad's claim on jobs lost since the Democrats passed their legislation is accurate.\n\nIn deciding upon a Truth-O-Meter ruling for this ad, we had a lot to consider on the many different points the ad raises. The ad's bottom line is that the Democrats passed legislation that Space voted for, and overall employment still declined. But the ad gets some of its details wrong, most notably Space's vote on increasing the debt ceiling. That point is flat-out wrong. The ad also mischaracterizes cap-and-and trade legislation as an energy tax. Space did vote for cap-and-trade, the 2010 budget and the stimulus. Given the ad's inaccuracies, we rate its statement Half True.", "Americans for Job Security, Robbed ads against Zack Space, Jason Altmire, Bryan Lentz and Trent Van Haaften, accessed Sept. 24, 2010\n\nPolitico, AJS 'Robbed' ad hits four Dems, Sept. 23, 2010", "The New York Times, Hidden Under Tax-Exempt Cloak, Political Dollars Flow, Sept. 23, 2010", "U.S. House of Representatives, Office of the Clerk, vote on Congressional Budget for Fiscal Year 2010, April 29, 2009.\n\nU.S. House of Representatives, Office of the Clerk, vote on raising the debt limit, Dec. 16, 2009.\n\nCongressional Quarterly, House Passes Short-Term Debt Limit Hike, Dec. 16, 2009\n\nRep. Zack Space, Space elected newest member of the Blue Dog Coalition, June 14, 2007\n\nU.S. House of Representatives, Office of the Clerk, vote on cap and trade, June 26, 2009.\n\nU.S. House of Representatives, Office of the Clerk, vote on the economic stimulus, Feb. 13, 2009\n\nCongressional Budget Office, Director's Blog, Estimated Impact of the Stimulus Package on Employment and Economic Output, Aug. 24, 2010\n\nUSA Today, Economists agree: Stimulus created nearly 3 million jobs, Aug. 30, 2010\n\nThe Bureau of Labor Statistics, Employment, 2008 - 2009", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]