["The nomination of federal appeals court Judge Amy Coney Barrett to the Supreme Court reignited claims of unfair behavior by Senate Republicans who refused to confirm Judge Merrick Garland to the nation's highest bench four years ago. Garland was then-President Barack Obama's nominee; Barrett is President Donald Trump's.", "In a Sept. 19 post, a Facebook user asserted racism is behind Trump being shown favoritism by a Republican-controlled Senate willing to rush the confirmation process for his Supreme Court nominee before the presidential election. Obama wasn't afforded the same courtesy.", "\"Systemic Racism definition: when a black American president is not allowed to name a Supreme Court Justice in the last 10 months of his term but a white American president can name one in the last 46 days,\" the post says.", "USA TODAY reached out to the user for comment.", "Obama was, in fact, allowed to name Garland as his Supreme Court nominee near the end of his second term in office, but Republicans in the Senate blocked his confirmation. In contrast, Barrett's confirmation process proceeded with only weeks left until the presidential election next month.", "Fact check:It's true, Ginsburg said bipartisanship needed 'true patriots' on both sides", "Republican senators immediately opposed an Obama nominee to fill the vacancy on the Supreme Court left by the late Justice Antonin Scalia, according to USA TODAY. Scalia died unexpectedly on Feb. 13, 2016, and reaction came hours later.", "When Obama chose Garland, of the U. S. Court of Appeals for the District of Columbia Circuit, as his nominee a month later, Republicans vowed to block the nomination on the basis that it was too close to the 2016 presidential election approximately eight months later, USA TODAY reported. Obama had roughly 10 months left in his term.", "Senate Majority Leader Mitch McConnell, R-Ky., said the people should \"have a voice\" about the next justice.", "\"The American people may well elect a president who decides to nominate Judge Garland for Senate consideration. The next president may also nominate someone very different. Either way, our view is this: Give the people a voice,\" McConnell said, according to USA TODAY.", "Sen. Mike Lee, R-Utah, a member of the Senate Judiciary Committee, said holding confirmation hearings for Garland would be \"a waste of time.\"", "\"In light of the contentious presidential election already well underway, my colleagues and I on the Judiciary Committee have already given our advice and consent on this issue: we will not have any hearings or votes on President Obama’s pick,\" Lee said.", "The opening was eventually filled in April 2017 by Trump's nominee, Neil Gorsuch, according to the official website of the Supreme Court.", "Fact check:True claim about Harris failing bar exam on first try and Barrett's law school rank", "The conditions of Barrett's confirmation process have been drastically different.", "If confirmed, Barrett would fill the seat left by Justice Ruth Bader Ginsburg, who died last month at 87.", "In 2019, McConnell said he would confirm a Supreme Court nominee of Trump's choosing during an election year, according to USA TODAY.", "Last month, the president said he wanted to fill the Supreme Court vacancy as soon as possible to avoid any post-election disputes and a possible tie vote.", "\"I think (the election) will end up in the Supreme Court, and I think it's very important that we have nine Justices,\" Trump said, according to USA TODAY.", "Conservative leaders told Trump that Barrett would vote similarly to Scalia, who is revered in right-leaning legal circles for his conservative approaches to interpreting the Constitution and deciding cases. Early in her career, Barrett was a law clerk for Scalia and has said she shares his originalist and textualist approaches to interpreting the law.", "Trump held a nomination ceremony for Barrett on Sept. 26, 38 days before Election Day, at the White House Rose Garden.", "McConnell sought a consent agreement to delay return of the Senate until Oct. 19 out of concern for the spread of the coronavirus, but the Senate Judiciary Committee proceeded with confirmation hearings for Barrett, according to USA TODAY.", "“We’re going to have a hearing for Amy Barrett, the nominee to the Supreme Court. It will be done safely,” Graham said Oct. 3. “But I’ve got a job to do, and I’m pressing on.”", "Confirmation hearings stretched over four days of the week of Oct. 12.", "The Senate Judiciary Committee will meet on Oct. 22 for a vote on Barrett's nomination, USA TODAY reported. Once out of committee, the full Senate will consider the nomination on Oct. 23 and is expected to vote on confirming Barrett on Oct. 26, eight days before the Nov. 3 election.", "More:Amy Coney Barrett Supreme Court hearings conclude, paving way for confirmation days before election", "We rate this claim PARTLY FALSE, based on our research. It is true that Senate Republicans, led by McConnell blocked the confirmation process for Obama's Supreme Court nominee but held a hearing for Trump's pick. But claims of racism are unsubstantiated. In 2019, McConnell said he would fill a Supreme Court nominee during an election year. And Trump tapped Barrett for the Supreme Court as a possible tie-breaker vote in the event of a dispute over the results of the presidential election next month. Nonetheless, the timing is a bit off in the claim. There were 123 days between the date of the post and inauguration day on Jan. 20, 2021. Trump still has a little over 100 days in office, but the claim correctly states Obama had about10 months left in his term when he announced Merrick Garland as his Supreme Court nominee.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more."]