["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Gov. Andrew M. Cuomo claimed women in New York are protected from a federal decision on health coverage for birth control. (Courtesy: Cuomo's Flickr account)", "Gov. Andrew M. Cuomo says women in New York state don’t have to worry about new Trump administration rules ending a federal requirement that employers must include birth control coverage in their health insurance plans.", "The new rules exempt employers from the Obama-era mandate if they have religious or moral reservations to the coverage.", "But Cuomo said contraception will still be covered in New York state.", "\"This year, we ensured that whatever happens at the federal level, women in our state will continue to have cost-free access to reproductive health care,\" Cuomo said in a statement.", "States can set certain insurance standards beyond what the federal government requires. New York state told insurance companies in January they are required to cover birth control and abortion services.", "That condition still stands, but is Cuomo right that women in New York state are not affected by Trump’s decision?", "Limits to state regulation", "State regulations, like the one from January, do not apply to all plans.", "The state Department of Financial Services regulates everything sold on the state health exchange, called New York State of Health. That includes plans sold to individuals and companies with 100 or fewer employees. The agency says the state’s birth control mandate covers 1.35 million residents in those plans.", "Health care offered through companies with more than 100 employees is more complicated.", "Companies that go the traditional route of buying health coverage through an insurance carrier must adhere to the rules. About 2.5 million people in that category are covered by the state’s birth control mandate.", "But companies that are self-insured, where the employer assumes a large part of the costs, are not regulated by the state, meaning they need not adhere to the state's birth control mandate.", "About 60 percent of private sector workers in the U.S. who get their health coverage through an employer were enrolled in a self-insured plan in 2015. That’s up from 46 percent in 1996, according to research from the Employee Benefit Research Institute.", "In New York state, about 54 percent of private sector employees who get health insurance through their employer had a self-insured plan last year, according to the federal Agency for Healthcare Research and Quality.", "The option is most popular for companies with at least 1,000 employees. Eighty percent of private sector employees at companies that size in New York state are enrolled in a self-insured plan.", "What about public health insurance?", "The federal government sets the baseline for what services are covered under Medicaid. Government workers are covered under state regulation, but Medicaid and Medicare enrollees are not.States can add to that list.", "The list of services covered by Medicaid in New York state goes well beyond the federal standard. New York is one of multiple states where Medicaid covers birth control and abortion services. About a third of the state’s population alone is on Medicaid.", "Our ruling", "Cuomo said women in New York state \"will continue to have cost-free access to reproductive health care\" because of an action the state took earlier this year.", "But not every woman is in an insurance plan regulated by the state.", "It’s possible a self-insured large employer in New York state could apply for an exemption from the federal birth control mandate. If granted the exemption, the company would not have to provide health coverage for birth control to its employees.", "Those exemptions are not expected to be widespread, but they are possible.", "Cuomo’s statement needs clarification. We rate it Mostly True.", "Statement from, Gov. Andrew M. Cuomo, Oct. 6, 2017", "Health Insurance Coverage of the Total Population, Kaiser Family Foundation", "Data and insurance regulation information obtained from the state Department of Financial Services press office", "Governor Cuomo Announces Decisive Actions to Secure Access to Reproductive Health Services in New York, Jan. 21, 2017", "Email conversation with Amy Shefrin, program officer at the New York State Health Foundation", "Percent of establishments that offer at least one self-insured plan, 2016, U.S. Dept. of Health and Human Services", "Percent of private sector enrollees enrolled in a self-insured plan, 2016, U.S. Dept. of Health and Human Services", "Email and phone conversation with Dr. Paul Fronstin, Director of the Health Research and Education Program at the Employee Benefit Research Institute", "Self-Insured Health Plans: Recent Trends by Firm Size, 1996‒2015, Employee Benefit Research Institute", "Services covered by Medicaid in New York", "State Medicaid Coverage of Family Planning Services, Kaiser Family Foundation", "An Overview of Abortion Laws, Guttmacher Institute", "PolitiFact New York: One in three people in New York is on Medicaid, July 21st, 2017", "\"If You Want An IUD, Take Note Of Trump's New Birth Control Policy\", Kaiser Health News, Oct.. 17, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]