["About this rating", "A meme posted in the Facebook group “Lyme Disease Posters” on 3 December 2016 (and its accompanying text) provides dire warnings about the risks posed by potentially tick-infested Christmas trees.", "While ticks, specifically the kind that can transmit Lyme disease, are indeed a serious medical concern and could conceivably be found on Christmas trees brought into your home, the information presented in this meme is generally misleading, scientifically inaccurate, or incomplete. More likely than not, a Christmas tree would not contain any Lyme disease-bearing ticks, and if it did the overwhelming likelihood is that the tick would not be in a position to transmit a disease during Christmas.", "Lyme disease is caused by the Borrelia genus of bacteria which is transferred from one animal (typically birds or small rodents), into the gut of a specific genus of tick called blacklegged ticks (genus Ixodes) in their larval stages, where it can then be transferred to a human through biting once that tick is in later stages of life.", "Per the Centers for Disease Control and Prevention:", "The lifecycle of blacklegged ticks (Ixodes scapularis and Ixodes pacificus) generally lasts two years. During this time, they go through four life stages: egg, six-legged larva, eight-legged nymph, and adult. After the eggs hatch, the ticks must have a blood meal at every stage to survive.", "A blacklegged tick’s feeding times are seasonally determined, with little to no activity happening during the weeks leading up to Christmas, according to the Minnesota Department of Health (though the information is broadly applicable to all blacklegged ticks):", "In the spring and summer of year one, eggs hatch into larvae which feed once and molt into nymphs. Nymphs become dormant for the fall and winter.", "In year 2, nymphs feed from May through July. At this time, the nymph may transmit disease-causing organisms (such as the bacteria that cause Lyme disease) to humans or to wild or domestic mammals. In the fall, nymphs molt into adult male and female ticks. The females feed on deer and other large mammals, mate, lay eggs, and die. If females don't feed in the fall, they try to find a large mammal host in the following spring. Male blacklegged ticks attach to a host to wait for females, but do not take a blood meal.", "This is the season-to-season life cycle of a blacklegged tick, according to the CDC, which shows the times of highest risk of transfer to humans is late spring into summer:", "The blacklegged tick’s ability to transmit the disease to a human is dominantly relegated to only one-and-a-half of its four life stages (the nymph stage and female adult stage). Both of these stages are generally dormant during Christmas, making most of the claims about the dangers of ticks and Lyme disease in Christmas trees fairly trivial. The actual human data provided by the CDC bore this out as well, clearly demonstrating that there are relatively few cases of Lyme disease during Christmas based on 10 years of monthly data:", "CDC", "That being said, here’s some background on specific assertions made by the meme:", "If you bring a Christmas tree home to decorate it may be full of ticks of all ages and tick eggs.", "Ticks typically attach themselves to grass and smaller shrubs, not trees. Further, as mentioned above, the “all ages” shouldn’t really be frightening, as we are interested only in nymphs and female adults who have previously fed on another disease carrying bird or mammal. These critters are not typically interested in feeding during Christmas.", "One female tick can lay thousands of eggs.", "Fully engorged (that is to say, freshly fed) female deer ticks do indeed lay numerous eggs — up to 3000, in fact. There are three important things to note, though, when talking about tick eggs in Christmas trees. The first is that deer ticks lay eggs in May — a time that is demonstrably not Christmas. The second is that they lay their eggs in the ground (a place demonstrably not a Christmas tree). Third, larvae (in terms of transferring a disease to a humans) are all born pathogen-free. If the larvae for some reason were not born dormant (unlikely) and then used a human as a host (impossible), it would have no pathogen to transfer.", "All ticks can carry and transmit disease.", "Only blacklegged ticks are capable of transmitting Lyme disease, and within those species they are further limited to transmitting diseases to humans only in their nymph and female adult life stages. Larval blacklegged ticks and the eggs from which they come are scientifically incapable of transferring disease to humans.", "Other ticks do carry other diseases. For an overview of those risks and their location, the CDC has a convenient map of the six potentially infectious tick species in the United States. If you are concerned that you may have been bitten by a tick or have symptoms of Lyme disease, the CDC also has a helpful guide here.", "The bottom line is — at least from a Lyme disease perspective — Christmas is pretty much the safest time of the year to bring a tree into your house.", "cdc.gov.   \"Lyme Disease.\"", "cdc.gov.   \"Lifecycle of Blacklegged Ticks.\"", "Minnesota Department of Health.   \"Diagram: Two-Year Life Cycle of the Blacklegged Tick (Ixodes scapularis, also known as the Deer Tick or Bear Tick).\"", "cdc.gov.   \"Lyme Disease: Transmission.\"", "cdc.gov.   \"Reported Cases of Lyme Disease by Year, United States, 1995-2015.\"", "Minnesota Department of Health.   \"Blacklegged Ticks (Deer Tick, Bear Tick).\"", "Anderson, John F., and Mangnarelli, Louis, A..   \"Biology of Ticks.\"\r\n    Infectious Disease Clinics of North America.   June 2008.", "University of Rhode Island TickEncounter Resource Center.   \"How Do Deer Ticks Become Infected?\"", "cdc.gov.   \"Geographic Distribution of Ticks That Bite Humans.\"", "cdc.gov.   \"Symptoms of Tickborne Illness.\"", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]