["About this rating", "Amazon-owned video doorbell manufacturer Ring has recalled more than 350,000 doorbells over concerns that the video doorbell’s battery can overheat and catch fire, posing fire and burn risks.", "This claim is true. About 350,000 second-generation doorbells (model number 5UM5E5) were recalled in the U.S. and an additional 8,700 in Canada on Nov. 10, 2020, according to a recall posted by the U.S. Consumer Product Safety Commission (CPSC).", "Sold from June to October 2020 at home goods stores and online at Amazon.com, the two-way audio and video doorbell runs on a built-in rechargeable battery. The doorbell retails for around $100 and can be hardwired into an existing doorbell system and run via the internet.", "But when the incorrect screws are used in the installation, the battery can overheat and catch fire.", "The California-based home security company received at least 85 incident reports that described doorbells installed with incorrect screws and 23 of those doorbells igniting, resulting in minor property damage. Eight people reported minor burns.", "If you are a customer whose doorbell has been recalled you don't need to return the product, according to a statement on Ring's support page, but rather download new instructions for installing it. Customers can contact Ring here if they have any questions.", "To determine if a doorbell was included in the recall, the CSPC advised checking the serial and model numbers, which are located on the back of the doorbell and on its outer packaging:", "The model and serial number are printed on a label on the back of the doorbell (left) and on the product packaging (right).", "Do not buy or install video doorbells without reading the newly revised installation manual. Consumers can also check their doorbell’s serial number here. Only certain serial numbers are included in the recall.", "Madison Dapcevich is a freelance contributor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]