["Now that Donald Trump moved into the White House, his staff has made over the White House website to its liking, including a new web page called \"Standing Up For Our Law Enforcement Community.\"", "The page decries the country’s \"dangerous anti-police atmosphere\" and includes some new statistical claims about crime in the United States, including one about Washington, D.C., homicides that we rated Mostly False.", "Another claim on the web page addressing violence in major cities caught our eye. It read, \"The Trump Administration is committed to reducing violent crime. In 2015, homicides increased by 17 percent in America’s 50 largest cities. That’s the largest increase in 25 years.\"", "Trump offered this same claim in July 2016, during his speech at the Republican National Convention in Cleveland. As we noted in our original fact-check, Trump stuck close to the wording of a passage in a January 2016 article by the Wonkblog team at the Washington Post. \"The number of homicides in the country's 50 largest cities rose nearly 17 percent last year, the greatest increase in lethal violence in a quarter century,\" the article began.", "Since the 2015 data used in the Wonkblog article was a projection based on preliminary figures, we decided to take a new crack at fact-checking the statement, this time using full-year FBI crime data for 2015 that had been released after the Wonkblog article appeared and after Trump made his speech at the convention. (Full-year data for 2016 is not yet available.)", "\"In 2015, homicides increased by 17 percent in America’s 50 largest cities\"", "First, we used Census Bureau data to determine the 50 largest cities. Then, we obtained the number of murders and non-negligent homicides for each of those cities in 2014 and 2015. We found that five of those cities -- Fort Worth, Texas; Raleigh, N.C.; Tucson, Ariz.; Portland, Ore., and Wichita, Kan. -- did not submit data for one of those years, so we excluded those cities from our calculations. That left 45 cities with data we could work with.", "When we added up the homicides in each of those 45 cities, we found that the total number increased by 16 percent between 2014 and 2015. That’s quite close to what Trump said.", "\"That’s the largest increase in 25 years\"", "To check whether the increase was the largest in a quarter-century, we recreated the Wonkblog methodology.", "They looked at the year-to-year rise or decline, in percentage points, of the homicide rate in the 50 largest U.S. cities. So we took the total number of homicides we’d assembled for those 45 cities and converted the raw numbers into the standard rate -- murders and non-negligent homicides per 100,000 population.", "In 2014, the homicide rate was 9.3 per 100,000 population. In 2015, the rate rose to 10.8 -- an increase of 1.5 percentage points. That was barely different from the 1.6 percentage-point increase that Wonkblog had found based on the preliminary data, and the chart makes clear that that was the biggest increase since 1990. So the White House website was correct that the jump in homicides between 2014 and 2015 was the largest increase in 25 years.", "This finding fits with our own research.", "The following graph we assembled from FBI data shows that in cities with a population of at least 250,000 -- shown in red -- the increase from 2014 to 2015 was the largest going back at least to 1995. (The top 50 cities all had populations of at least 388,000, so this is a somewhat broader group of cities.) Meanwhile, the overall national rate, in blue, also showed an uptick between 2014 and 2015.", "Richard Rosenfeld, a criminology professor at the University of Missouri-St. Louis, told PolitiFact that our methodology was sound. But he cautioned that the one-year uptick may not prove to be a lasting change in the trend line -- and that focusing on just one year’s numbers obscures the significant and consistent decline in homicides over the past-quarter century, as shown in the following chart:", "\"Violent crime rates are up compared with historic lows, and they are still very, very low compared with just five or 10 years ago,\" Raymond Paternoster, a University of Maryland criminologist, told PolitiFact last October.", "Alan Lizotte, a University at Albany criminologist, agreed. \"A small increase between two time points is not an increase when the 20-year trend is downward,\" he said. \"If it went on for several years, it might indicate an increase.\"", "Our ruling", "The Trump White House website said, \"In 2015, homicides increased by 17 percent in America’s 50 largest cities. That’s the largest increase in 25 years.\"", "By our calculations, the increase between 2014 and 2015 is very close to that -- 16 percent -- and this does appear to be the biggest one-year spike in 25 years. But we’ll reiterate a caveat we noted in past fact-checks: first, that even after the spike, homicide rates remain far lower now than they were 25 years ago, and second, that this one-year increase may, or may not, prove to be a significant turning point in the homicide trend line.", "We rate the statement Mostly True.", "White House website, \"Standing Up For Our Law Enforcement Community,\" accessed Jan. 23, 2017", "FBI, \"Table 8: Offenses Known to Law Enforcement, by State by City,\" 2014", "FBI, \"Table 8: Offenses Known to Law Enforcement, by State by City,\" 2015", "U.S. Census Bureau, \"National Population by Characteristics Tables: 2010-2016,\" accessed Jan. 24, 2017", "Washington Post Wonkblog, \"More people were killed last year than in 2014, and no one’s sure why,\" Jan. 27, 2016", "PolitiFact, \"Donald Trump largely accurate that U.S. had biggest increase in murders in 45 years,\" Oct. 10, 2016", "PolitiFact, \"Donald Trump says homicides are up 17 percent in 50 biggest cities, largest increase in 25 years,\" July 21, 2016", "Email interview with Richard Rosenfeld, criminology professor at the University of Missouri-St. Louis, Jan. 24, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]