["About this rating", "On 27 October 2016, social media users encountered an article reporting that the American Amish Brotherhood endorsed Donald Trump for President:", "The Amish, who are direct descendants of the protestant reformation sect known as the Anabaptists, have typically stayed out of politics in the past. As a general rule, they don’t vote, serve in the military, or engage in any other displays of patriotism. This year, however, the AAB has said that it is imperative that they get involved in the democratic process.", "“Over the past eight years, the Democratic Party has launched a systematic assault on biblical virtues,” said AAB chairman Menno Simons. “We have seen more and more Christians being persecuted for their faith; we have seen the state defile the institution of marriage. Now, they want to put a woman in the nation’s highest leadership role in direct violation of 1 Timothy 2:12. We need to stop this assault and take a stand for biblical principles. Donald Trump has shown in both action and deed that he is committed to restoring this country to the Lord’s way.”", "The piece appeared on two different but related web sites, both of which masquerade as legitimate news outlets, illegally appropriating the trademarks of those organizations to drive traffic to malware-spreading sites via fabricated stories with clickbait headlines.", "These fake news sites can be distinguished from legitimate news sites by looking at their web addresses: the hoax sites generally contain an extra few letters at the end of the domain (e.g., .de or .co), or a slight misspelling in the title.", "Moreover, there is no group called the \"American Amish Brotherhood.\" There are Old Order Amish and New Order Amish (who are sometimes called the Amish Brotherhood) but no organized group called the American Amish Brotherhood, or AAB.", "The article also claimed that the telephone number for the Pennsylvania Amish Heritage Museum is (785) 273-0325, but that is actually the number for the Westboro Baptist Church.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]