["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Mahlon Mitchell, the latest in an historic number of Democrats who are running for governor of Wisconsin in 2018, entered the race ready with criticism of Republican Gov. Scott Walker.", "Mitchell, president of the Professional Firefighters of Wisconsin union, was asked what changes he would make from the policies of Walker, who is seeking a third term. On the Nov. 19, 2017 edition of \"Upfront with Mike Gousha,\" a Milwaukee-based TV talk show, Mitchell replied by saying:", "Well, there’s a lot of them. I think we actually have to make sure the people of Wisconsin are first. We need to make sure that we raise wages. We haven’t done that. We have the highest -- and the fastest-shrinking middle class in the country.", "Let’s see if Mitchell’s statement about the fastest-shrinking middle class -- while criticizing Walker, but not directly blaming him -- fares better than two similar statements that both failed on the Truth-O-Meter.", "Two past fact checks", "Both of the previous claims were about the rate of decline of the size of the middle class.", "1. In 2015, liberal MSNBC talk-show host Rachel Maddow said that under Walker, \"the Wisconsin middle class is shrinking at a faster rate than any other state in the country.\" Our rating was False.", "Maddow cited a March 2015 report by the Pew Charitable Trusts, a widely respected nonpartisan research organization. Between 2000 and 2013, the size of Wisconsin’s middle class shrank by 5.7 percentage points -- the largest among the 50 states.", "But Walker didn’t become governor until January 2011. We ran updated University of Minnesota data, the same used by Pew, to compare 2010, the year before Walker took office, to 2013, the latest year then available. Wisconsin’s middle class had dropped by 0.5 percentage points, 24th among the 50 states.", "2. In January 2017, state Rep. Peter Barca, a Kenosha Democrat who was then the Assembly’s minority leader, said Wisconsin’s middle class is the \"most diminished\" in the United States. Our rating was False.", "Barca also relied on the 2015 Pew report. We ran updated University of Minnesota data and found that in 2015, the size of Wisconsin’s middle class was down 4.5 percentage points from 2000 -- the 10th-largest decline of any state, not the largest.", "To back Mitchell’s statement, his campaign also cited the 2015 Pew report.", "But, as we noted, more recent data is available, so we again ran the University of Minnesota numbers.", "Latest numbers", "Using Pew’s formula, a Wisconsin household was in the middle class in 2016 if its income was between $38,063 and $113,622. For that year, 48.5 percent of Wisconsin households were in the middle class.", "Here’s how Wisconsin ranked comparing 2000 -- the year the Pew report, which was cited by Mitchell, used as a starting point -- to 2016, the latest year available; and comparing 2010 to 2016, for Walker’s tenure:", "Period", "Percentage points shrinkage in size of middle class", "Rank among the states", "2000 to 2016", "6.1", "1st", "2010 to 2016", "0.9", "14th", "But his statement was made in the context of criticizing Walker, and during Walker’s tenure Wisconsin ranked 14th, not first.", "During both periods, most Wisconsin households that left the middle class went to the higher income bracket, rather than dropping down out of the middle class.", "But when adjusting for inflation, the median household income in Wisconsin -- where half of households earn more and half earn less -- was lower in 2016 than it was in 2000.", "Our rating", "Mitchell said Wisconsin has \"the fastest-shrinking middle class in the country.\"", "Mitchell pointed to a report by Pew Charitable Trusts, which compared the states going back to 2000. Using Pew’s formula and running the latest-available data, we found Wisconsin ranked first in the shrinkage of the size of its middle class when comparing 2000 to 2016.", "But Mitchell made his statement while criticizing Walker, and during Walker’s tenure, Wisconsin’s shrinkage ranked 14th when comparing 2010 to 2016.", "For a statement that contains an element of truth but needs clarification, our rating is Mostly False.", "YouTube, \"Upfront with Mike Gousha\" interview of Mahlon Mitchell (1:25), Nov. 19, 2017", "Email, Mahlon Mitchell campaign spokeswoman Lis Smith, Nov. 27, 2017", "Email, Scott Walker campaign spokesman Nathan Craft, Nov. 27, 2017", "PolitiFact Wisconsin, \"Citing old data, Wisconsin lawmaker says the state's middle class is 'most diminished' in U.S.,\" Jan. 20, 2017", "PolitiFact Wisconsin, \"Rachel Maddow says under Scott Walker middle class in Wisconsin is shrinking fastest among states,\" Aug. 24, 2015", "Pew Charitable Trusts, \"The Shrinking Middle Class, Mapped State by State,\" March 19, 2015", "Pew Charitable Trusts, \"Many Americans Are Rising Out of the 'Middle Class' — But Are They Better Off?\" Feb. 12, 2016", "Email, Pew Charitable Trusts Stateline staff writer Tim Henderson, Nov. 27, 2017", "Integrated Public Use Microdata Series, University of Minnesota, accessed Nov. 28, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]