["Ahead of the Delhi assembly elections on February 8, a 26-second video has gone viral which shows a man on wheelchair accepting a blanket. After introducing himself and thanking the organiser for distributing blankets to differently-abled persons, he is seen as getting up from the wheelchair and walking away. This video has been labelled as an Aam Aadmi Party (AAP) propaganda video with the insinuation that the event was stage-managed and those receiving blankets were masquerading as differently-abled persons.", "On January 30, @ugtunga, a Twitter-user, posted the viral video and said, “Magic blanket from AAP. The moment this divyang got the blanket he started walking. See it to believe it” It has been retweeted over 1,200 times.", "Magic blanket from AAP. The moment this divyang got the blanket he started walking.", "See it to believe it 😳😌 pic.twitter.com/AWUmY4dsPE", "— Mauna (@ugtunga) January 30, 2020", "On January 29, Bhubaneshwar-based IPS officer Arun Bothra tweeted the viral video and said, “Breaking news: Magical blanket makes ‘specially abled’ person discard his wheel chair & walk briskly.” Unlike several social media users, Bothra didn’t link this video with a political party. His tweet was retweeted over 1,100 times.", "Similarly, several Twitter and Facebook users have shared the viral video, claiming it’s an AAP propaganda video.", "Alt News has received several requests to fact-check the viral video on WhatsApp (+91 76000 11160) and on our official mobile app.", "The man in the viral video introduced himself as Ramesh Singh. In the background, a banner can be spotted with a Hindi text which reads ‘Digital Saksharta Sansthan [Translated from डिजिटल साक्षरता संस्थान].’", "A second keyword search led us to the Facebook page of ‘Digital Sakshrta Sansthan’. According to the page, it is an NGO based out of Seohara, Uttar Pradesh. On the same profile, Alt News found a fact-check report by Abhitak, a Moradabad-based Hindi news channel. We found a video report on Abhitak‘s YouTube channel as well.", "In the Abhitak report, Singh displayed his proof of disability and said, “There is some misunderstanding among the masses. I’m really disabled and I have proof. I have UD ID (Unique Disability ID) which states I’ve 40% disability.” The reporter asked him to comment on the controversial moment when he stood up from the wheelchair, Singh replied, “While receiving the gift, I was made to sit (on the wheelchair). When I stood up, people (who saw the video) couldn’t understand the nature of my disability.”", "Alt News also noticed that Digital Sakshrta Sansthan’s Facebook account has uploaded several other videos from the event. A video uploaded on January 19, shows the full sequence of another man receiving the blanket on a wheelchair and then getting up.", "On February 1, The Quint published a fact-check report according to which, Najam was the reporter on duty for Abhitak. It reported that Singh has a locomotor disability. The Quint’s report also has photos of Singh’s Unique Disability ID. Alt News has not uploaded the photos in for the sake of privacy.", "While speaking to The Quint, Najam said, “The man sitting on the wheelchair is Ramesh Singh and the one giving the blanket is Ravi Saini. AAP is not involved in this in any manner.” The report added that Saini is a part of the ‘Digital Saksharta Sansthan’. Siani told The Quint that they had organised a programme to distribute 100 blankets to the differently-abled.", "Alt News did a keyword search and found the Twitter account of Saini. He tweeted local media reports of the event.", "In local newspapers our NGO @Digital_Sakshar @drajaykumar_ias @rsprasad @narendramodi @rashtrapatibhvn pic.twitter.com/9ZYo0bIRRt", "— Ravi Saini (@RsDigitalIndia) January 21, 2020", "Moreover, looking at Saini’s Twitter account (screenshot attached below) one can assess that it is unlikely that he is associated with AAP.", "Therefore, the social media claim that Aam Aadmi Party (AAP) distributed blankets to the people who were not differently-abled for their propaganda is false.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]