["About this rating", "The online world is fraught with clever photo manipulations that often provoke gales of laughter in those who view them, put together by pranksters acting on a lark. However, prompted by lighthearted motives or not, one photo sparked sensations of horror in those who viewed it in the days immediately following the 9/11 terrorist attacks on the United States. The image seemingly captured the last fraction of a second of a man's life ... and also of the final moment of normalcy before the universe changed for all of us. In the blink of an eye, a beautiful yet ordinary late summer day was transformed into flames and falling bodies, buildings collapsing inwards on themselves, and wave upon wave of terror washing over a populace wholly unprepared for a war beginning in its midst:", "The picture ripped away the healing distance brought by the nearly two weeks between the attacks and the appearance of this grim reminder, leaving the sheer horror of the moment once again raw and bared to the wind. Whether or not the picture was real, the emotions it stirred up certainly were. It was because of those emotions that the photograph began to speed from inbox to inbox at the end of September 2001.", "However, aside from all the digital imperfections in the image (e.g., shadows of different objects that don't correspond to the same light source, the date-time stamp in the wrong type of font), a number of logistical errors proved it to be suspect beyond credibility:", "Healing takes place in many fashions, and the Accidental Tourist not only became part of that healing process but also spawned an iconic genre of Internet lore, featured at web sites such as <!--TouristofDeath.com-->TouristofDeath.com.", "Although the photo itself was quickly debunked as a digital manipulation, one looming mystery remained: Who was the tourist whose likeness appeared in the image?", "In November 2001, a 41-year-old Brazilian man named José Roberto Penteado from Campinas, Sao Paulo, stepped forward to assert his face was used for the \"Accidental Tourist\" photo, but his claim later proved to be rather dubious.", "A few weeks later, a Hungarian man named Peter staked a much better claim to the \"Tourist Guy\" crown by supplying the original photograph of himself (and other similar snapshots from the same session) and revealing that he himself had created the infamous \"Accidental Tourist\" image:", "Benner, Jeffrey.    \"'Tourist Guy': Is He or Isn't He?\"\r\n   Wired.com.   9 November 2001.", "Benner, Jeffrey.   \"He's the Real Tourist Guy.\"\r\n    Wired.com.    20 November 2001.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]