["By Angelo Fichera", "Posted on March 4, 2020", "Posts on Facebook falsely claim to show screenshots of two tweets by Senate Minority Leader Chuck Schumer about the U.S. coronavirus response. Schumer didn’t post the supposed tweet criticizing President Donald Trump’s decision to bar travelers from China.", "Senate Minority Leader Chuck Schumer has used Twitter to repeatedly criticize the Trump administration’s response to the spread of the novel coronavirus.", "But screenshots circulating on Facebook use a fabricated post alongside one of Schumer’s actual tweets to make the prominent Democrat look as if he contradicted himself.", "Schumer did indeed tweet on Feb. 24 that, “We’ve seen no sign that President Trump has any plan or urgency to deal with the spread of the Coronavirus. We need real leadership, and we need it fast.”", "But the New York senator didn’t tweet on Feb. 5 about Trump’s “premature travel ban to and from China,” as the doctored post shows. The fake tweet references the Trump administration’s decision on Jan. 31 to bar foreign nationals from entering the country if they visited China in the preceding 14 days (with some exceptions).", "The full fabricated tweet reads: “The premature travel ban to and from China by the current administration is just an excuse to further his ongoing war against immigrants. There must be a check and Balance on these restrictions.”", "We could find no such tweet by Schumer’s account on his feed. ProPublica’s tool to track deleted tweets from elected officials also shows no such tweet — or any other deleted tweet about the coronavirus — by Schumer. The senator’s spokesman also confirmed to the Associated Press that the tweet was fabricated.", "Schumer’s 14 tweets on Feb. 5 focused on the Senate impeachment trial of Trump, which was concluding; Trump’s State of the Union address the night before; a black transgender activist; aid to Puerto Rico; and voting rights.", "Some who helped spread the fake tweet later corrected the record. The conservative Power Line blog declared it “a hoax” and apologized to readers.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "“Politiwoops | Deleted Tweets From Chuck Schumer, D-N.Y.” ProPublica. Accessed 4 Mar 2020.", "“Proclamation on Suspension of Entry as Immigrants and Nonimmigrants of Persons who Pose a Risk of Transmitting 2019 Novel Coronavirus.” White House. 31 Jan 2020.", "Schumer, Chuck (@SenSchumer). “We’ve seen no sign that President Trump has any plan or urgency to deal with the spread of the Coronavirus. We need real leadership, and we need it fast.” Twitter. 24 Feb 2020.", "“SCHUMINATIONS: HIDING THE TRUTH [HOAXED!]” Power Line Blog. 29 Feb 2020.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]