["About this rating", "A three-minute Facebook video attracted millions of views and a boatload of controversy in June 2018, with the astonishing claim that there exists a type of jewelry made and worn in Mexico that consists of live beetles bedecked with gold and semi-precious gemstones.", "According to the video, which was produced and posted by In the Know by AOL, the \"bedazzled brooches\" even come equipped with tiny gold leashes designed to prevent one's jewelry from escaping:", "Noting that the so-called \"pet-cessory\" might not be for everyone, particularly those afraid of bugs, the video closes by posing the question, \"Would you wear one?\"", "The consensus among the thousands who commented was basically no, they would not wear such a thing, ever — with many relying on terms like \"gross,\" \"creepy,\" \"cruel,\" and \"inhumane\" to express their opinions of the practice.", "Besides those who questioned the ethics of it, there were some who wondered if the practice is even real. It is, we discovered, and indeed the practice is more than a hundred years old. Among the earliest print references we found to \"jeweled bugs\" was in a syndicated newspaper article dating from 1887, attributed to the New Haven Register:", "Miss Nelson's Bug.", "Miss Emily Nelson, of Bridgeport, has received a present from Merida, Yucatan, in the shape of an educated jeweled bug. It has a harness of gold and is jeweled with precious stones, and is the gift of Senora Fuentes, of Merida, Yucatan, whose daughter, Senorita Eveliety Fuentes, has passed the last three years as a pupil at Miss Nelson's seminary on Golden Hill. Her bestowal of the live, educated, jeweled bug as a gift is considered in Yucatan as a high distinction. The bugs are extremely difficult to educate and are looked upon by the lower classes as the particular property of royalty. Miss Nelson is very proud and justly happy over her bug, and wears it constantly while driving or out shopping. The insect is about the size of an ordinary black beetle. Around its body is firmly fastened a gold band. Another gold strap is riveted to this and passes down the back, around and under the body, and is welded upon the under side to the gold belt encircling the body. Upon the back are tiny jewels set in gold and fastened into the shell. The coloring of the shell is a brilliant, sparkling Nile green, edged off with black. The movement of the bug gives flashes of variegated colors which are remarkably pretty and effective. Upon the under side is fastened a delicate gold chain, which in turn is attached to a chased brooch. This can be pinned upon any part of the dress. Miss Nelson say these bugs live for a number of years if not exposed to the rigors of northern climes. She fastens hers at the belt, and the jeweled beauty goes wandering around among the garaiture of roses, flowers, and laces upon her corsage. The bug does not seem to be timid, but crawls tranquilly oblivious to the admiration he creates.", "The description comports in most respects with modern accounts of jeweled \"makech\" (or \"maquech\") beetles (Zopherus chilensis), including an April 2015 article on Smithsonian.com that delves into the supposed mythological origins of the phenomenon:", "If the idea of mobile insect brooches makes you squirm, their backstory may soften the sartorial blow. [Charles] Hogue and other beetle curators report that the makech, or maquech, is linked to a Yucatán legend involving an ancient princess — often identified as Maya nobility — and her lover. The story has several variations, but the most popular say that the pair’s love was forbidden. The princess was heartbroken when they were discovered and her lover was sentenced to death, so a shaman changed the man into a shining beetle that could be decorated and worn over the princess’s heart as a reminder of their eternal bond.", "But the article also quotes Raul Aguilar, a San Francisco artist who grew up in Mexico and once owned a makech, and who questions the authenticity of the legend, as well as the implied \"trendiness\" of the beetle brooches:", "“There are a lot of traditions in that part of Mexico, and it is very muddy as far as which culture the makech comes from,” says Aguilar. “Maya culture is pretty well documented — they had writing and stelae and books. If they had this legend, we would know something about it.” He suspects the story is just something vendors tell the curious, although elements of it do echo certain traditions in the pre-Columbian cultures of the Yucatán, such as the idea of a shape-shifting shaman and the use of living animals as offerings in religious ceremonies.", "Aguilar first encountered the makech as a child in the 1970s, when he bought one from a plaza vendor during a family trip to Veracruz. “It’s not really a fashion trend so much as a curiosity. You wouldn’t wear it to a party,” he says. He decided to remove the jewels and leash and let the unadorned beetle roam free inside a house planter, where it lived for several months without seeming to eat or drink.", "A 2015 story in the Yucatan Times questioned the validity of the claim that wearing live beetles as jewelry originated in Mayan culture, although it also suggested — wrongly — that there is no proof that the practice existed before the 1980s. Environmentalists and animal rights advocates in Mexico and elsewhere are now trying to discourage the capture and decoration of makech beetles, which these days are mostly sold as a novelty to foreign tourists. U.S. residents should think twice before purchasing one, however, as federal regulations forbid transporting live animals across the border into the United States without a permit.", "In 2010, it was reported that U.S. Customs and Border Protection officers confiscated a live makech beetle from a woman who declared her \"living brooch\" as she crossed into Texas from Mexico. A representative for People for the Ethical Treatment of Animals (PETA) quipped sardonically that the woman's choice of fashion accessories \"gives new meaning to the term fashion victim.\"", "Aguilar, Raul.  \"Bejeweled Scarabs, Roaches, and Other Fantastic Bugs.\"\r\n  The Holy Enchilada.  30 June 2009.", "Bouchard, Patrice.  The Book of Beetles: A Life-Size Guide to Six Hundred of Nature's Gems.\r\n  Chicago: University of Chicago Press, 2014.  ISBN 9780226082899.", "Jaggard, Victoria.  \"Meet the Makech, the Bedazzled Beetles Worn as Living Jewelry.\"\r\n  Smithsonian.com.  27 April 2015.", "KHOU 11 News.  \"Beetle Brooch Bugs Texas Customs.\"\r\n  22 January 2010.", "Washington Progress.  \"Ladies' Department: Miss Nelson's Bug.\"\r\n  11 October 1887.", "The Yucatan Times.  \"Live Jewels: The Makech.\"\r\n  2 April 2015.", "Yucatan Today.  \"Maya Legends: The Princess and the Beetle.\"\r\n  Accessed 5 June 2018.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]