["About this rating", "In February 2021, a video supposedly showing a drone hitting the wing of a passenger plane as it was taking off from an airport went viral on TikTok. As of this writing, this posting has close to 4 million views:", "This is not a genuine video of a drone damaging the wing of a plane.", "This video was created by visual effects artist Bruce Branit, and shared to his YouTube page BranitFX in June 2015. Here's the original video:", "This video caused a bit of a stir at the time as it was widely shared on social media by people claiming that this was an authentic video of a drone crashing into a Southwest Airlines plane at New York's LaGuardia Airport.", "Southwest even issued an internal message to assure pilots and personnel that none of its planes had been damaged by a drone.", "\"We wanted to bring a fake drone strike video to your attention, as it is gaining momentum across the social web and sparking interest from traditional news media.", "The video shows a winglet colliding with a drone on ascent near LaGuardia Airport. The winglet is SWA colours and branding, but if you look closely it says 'Branit.com', which is a portfolio site for a special effects artist.", "The communication team has confirmed the video is fake, and is working with the FAA to squash any reports of it being real.\"", "While it's difficult to tell in the viral TikTok video, it's clear in the original footage that the words \"BranitFX\" are displayed on the wing, not \"Southwest.\"", "In addition to this cleverly-placed watermark, Branit released a second video showing how he made this clip of a drone hitting a plane.", "While this video of a drone hitting a plane wing is undoubtedly fake, similar incidents have occurred in real life. In October 2017, for instance, a Skyjet plane suffered minor damage when it struck a drone during its descent to Jean Lesage International Airport in Québec.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]