["By Robert Farley and Eugene Kiely", "Posted on August 16, 2017", "President Donald Trump claimed that his administration is “spending a lot of money on the inner cities.” But there has been little change in spending so far, and his first budget proposes to cut or eliminate funding for some programs that benefit cities.", "For example, Trump’s proposed 2018 budget would cut the Housing and Urban Development budget by 13 percent, including eliminating the Community Development Block Grant program for a savings of $3 billion.", "Trump has said his urban agenda would focus on education and crime. And to be sure, the president has shifted some existing resources in an attempt to reduce violent crime in cities and has proposed significant increases in school-choice programs for students from low-income families. But the reductions to other programs that benefit cities cut much deeper.", "Trump’s comments about funding for inner cities came during a press conference on Aug. 15 in which he defended his response to the deadly violence at a white nationalist rally in Charlottesville. Trump argued that job creation would have “a tremendous, positive impact on race relations.”", "“And I’ll tell you, we’re spending a lot of money on the inner cities,” Trump added. “We’re going to fix — we’re fixing the inner cities. We’re doing far more than anybody’s done with respect to the inner cities. It’s a priority for me. And it’s very important.”", "We reached out to the White House press office for support for the president’s claim, but we did not receive a response.", "Trump promised repeatedly on the campaign trail that he would fix the “unacceptable” condition of America’s inner cites, but the president’s proposed 2018 budget provides little backing for his claim that “we’re doing far more than anybody’s done with respect to the inner cities.” And while Congress is unlikely to pass Trump’s budget plan, it provides a window into the president’s priorities.", "“There is no discussion taking place in the White House that I am aware of about new initiatives, programs, or investments in inner cities,” Robert Silverman, a professor in the Department of Urban and Regional Planning at the University at Buffalo, told us. “The federal agencies that have some of the greatest impacts on urban areas are [Housing and Urban Development], the Department of Education, [Health and Human Services], Transportation, and the [Environmental Protection Agency]. The Trump Administration has proposed to cut the budgets of all of those agencies by at least 12 percent in FY2018.”", "“The EPA has some of the most drastic cuts, exceeding 30 percent,” Silverman said via email. “In my area, housing, the White House has reduced proposed funding levels for fair housing and a variety of affordable housing programs, and delayed implementation of newly adopted administrative rules related to those programs. It seems that is the approach in other agencies as well.”", "In a survey of 68 (mostly Democratic) U.S. mayors in April, Politico Magazine found that 88 percent said Trump’s proposed budget “would be ‘devastating’ or ‘extremely painful’ to their city.”", "As we have written before, the budget proposal would increase funding for defense, homeland security and veterans affairs, and make cuts in all other executive departments and agencies.", "According to an analysis by the Committee for a Responsible Federal Budget, nondefense spending would be cut by about $54 billion, or 10 percent.", "CRFB, March 14: Relative to today’s level, the budget would cut the State Department by 29 percent ($11 billion), the Environmental Protection Agency by 31 percent ($3 billion), the Health and Human Services Department by 16 percent ($13 billion), and the Education Department by 14 percent ($9 billion). Most other domestic agencies would also see substantial cuts; 19 smaller agencies would be eliminated entirely.", "CRFB says the cuts to housing and community development programs would include the elimination of: the Low Income Home Energy Assistance Program, the Community Services Block Grant program (a program designed to lessen poverty in communities), HOME Investment Partnership Program (which provides grants to develop low-income housing), the Choice Neighborhoods program (which seeks to help communities struggling with distressed housing), and the Community Development Financial Institutions program (which provides sources of capital to distressed neighborhoods). It would also reduce rental assistance programs by 5 percent and funding for NeighborWorks, a nonprofit housing and community development organization, by 85 percent.", "In the “full” budget proposal released in May, Trump proposes cutting the Housing and Urban Development budget by $6.2 billion, or 13.2 percent. In a press briefing in March, Mick Mulvaney, director of the White House Office of Management and Budget, singled out HUD as being rife with wasteful and duplicative programs. “We’ve spent a lot of money on Housing and Urban Development over the last decades without a lot to show for it,” Mulvaney said.", "The biggest ticket item on the HUD chopping block is the Community Development Block Grant program, which Trump has proposed to completely eliminate.", "According to the budget blueprint released in March, CDBG, which provides grants to cities and states for a variety of community development programs, “has not demonstrated results.”", "Trump administration’s proposed FY 2018 budget: The Federal Government has spent over $150 billion on this [CDBG] block grant since its inception in 1974, but the program is not well-targeted to the poorest populations and has not demonstrated results.", "That assessment is not shared by the U.S. Conference of Mayors, which sent Congress a letter in July urging its members to support the CDBG program at a level of $3.3 billion next year.", "“CDBG is one of the most effective federal programs for growing local economies and for providing a lifeline to families and communities with proven results,” the mayors’ letter states. “It has provided funds in every state, including housing investments, public infrastructure improvements, and economic development, while also providing public services, including services for seniors, youth, the disabled, and employment training. … This program helps more than 1,200 cities, counties, states, and rural areas that meet the needs of low- and moderate-income people and communities.”", "Penned by the U.S. Conference of Mayors president, vice president, second vice president and CEO, the letter was signed by the mayors of more than 350 U.S. cities.", "The Urban Institute also has contested the White House’s determination that the CDBG program has not demonstrated results. The report “Taking Stock of the Community Development Block Grant” concluded: “The Trump administration has proposed to eliminate CDBG funding, and the program has faced criticism for the lack of evidence on its benefits. This lack of evidence, though, may be more related to a lack of investment in evaluating the program rather than to a lack of true impacts.”", "“What’s special about the Community Development Block Grant program is that it provides the flexible resources you need to revitalize neighborhoods that are struggling,” Solomon Greene, a senior fellow at the Urban Institute, told us. What it means to “fix” a city can mean different things to different cities, Greene said, whether that be affordable housing, addressing crumbling infrastructure or connecting people with jobs. And CDBG funds allow cities the flexibility to address those unique needs.", "Overall, Trump’s proposed budget would cut education spending by $9.2 billion, or 13.5 percent, including cuts in programs designed to help young children from low-income families.", "The budget, for example, would eliminate $1.2 billion in funding for an after-school program — the 21st Century Community Learning Centers – that the Education Department says targets “students who attend high-poverty and low-performing schools.”", "The administration, however, points to increased funding in other areas for low-income students.", "The biggest increase would be in Title 1 funding, which is awarded to schools with high numbers of children from low-income families. The department’s budget proposes an additional $1 billion for Title 1, up to $15.9 billion, to provide funding for a new school-choice program called Furthering Options for Children to Unlock Success, or FOCUS. The grant money would be awarded to school districts “with open enrollment systems that allow Federal, State, and local funds to follow students to the public school of their choice,” the department budget says.", "The FOCUS grant money is part of what Education Week described as “a historic $1.4 billion federal investment in school choice.” The budget also would award $250 million in scholarships for low-income students who want to attend private schools and increase charter-school funding by $168 million.", "The NAACP opposes the shift of funds to school-choice programs, saying such efforts undermine “already underfunded [public] school districts.”", "On balance, John B. King Jr. — the president and CEO of The Education Trust, a nonprofit that advocates on behalf of low-income students — called Trump’s budget “an assault on the American Dream,” citing cuts in after-school and preschool programs in particular.", "“This shortsighted and cruel proposal would make the climb to success much steeper for all our young people, especially students of color and students from low-income families,” King, a former education secretary under President Barack Obama, said in a May 23 statement. “Instead of investing in the future, the proposal underfunds or eliminates many vital supports that give people the opportunities and tools to better their lives.”", "Darrel Stephens, executive director of the Major Cities Chiefs Association, told us that the Trump administration is still operating under the budget enacted under President Obama, “so there has not been any increase in funding for dealing with crime in inner cities.”", "However, he said, the Department of Justice has taken some steps to address violent crime in certain cities using existing resources.", "In June, Attorney General Jeff Sessions announced the Justice Department would partner with 12 cities to combat violent crime as part of a program called the National Public Safety Partnership.", "“The program existed before — it was the Violence Reduction Network — in addition to the name change I think there were cities added,” Stephens wrote to us in an email. “Police routinely work with the federal agencies on a number of problems.”", "Stephens said “the big increase [in resources] was in Chicago,” where the U.S. Bureau of Alcohol, Tobacco, Firearms and Explosives in June sent 20 ATF agents in an attempt to reduce the gun violence in that city.", "As for next fiscal year, Stephens said his organization has not done an analysis of Trump’s proposed budget for 2018. However, Michael F. Crowley, a senior fellow at the Brennan Center for Justice at the New York University School of Law, has done a review of nine federal grant programs that could potentially reduce violent crime. Crowley’s analysis found a slight decrease in violence-related grants.", "Crowley, who worked as a budget analyst in the White House Office of Management and Budget under both Republican and Democratic presidents, said there are two major federal grant programs for combating crime: the Edward Byrne Memorial Justice Assistance Grant Programs, known as Byrne JAG, which provide general operating funds based on a formula, and the Community Oriented Policing Services, or COPS, grant for hiring police officers. According to Crowley, Trump’s proposed budget would increase funding for COPS, but decrease it for Byrne, resulting in a net reduction of $55.1 million, or nearly 12 percent, in the two major programs.", "Overall, there would be a net reduction of about $7.1 million, or 1 percent, across nine grant programs that could potentially address violent crime, according to Crowley’s analysis.", "Mayors and police chiefs in major U.S. cities have expressed concern about the potential for the Trump administration to take away some of that money for failure to comply with the president’s executive order on so-called sanctuary cities.", "Sanctuary cities limit the degree to which local police are willing to cooperate with federal requests to detain immigrants living in the country illegally. The president’s order would withhold funding for cities that do not cooperate.", "In a joint statement, the U.S. Conference of Mayors and the Major Cities Chiefs Association warned earlier this year that a crackdown on so-called sanctuary cities will interfere with “police-community relations” and hamper efforts to reduce crime.", "“Cities that aim to build trusting and supportive relations with immigrant communities should not be punished because this is essential to reducing crime and helping victims, both stated goals of the new Administration in Washington,” the statement said.", "On balance, Crowley said discretionary funding resources available to the president and attorney general for fighting crime are limited. “So, it’s unlikely that we’re seeing any great surge in resources for cities in terms of DOJ grants based on anything that the Trump administration is doing,” he said.", "FactCheck.org Rating:", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]