["About this rating", "Disney Parks are filled with so-called Easter eggs, secrets, and history tidbits that have been shared far and wide in the last several decades. We've covered many of them, such as how a yeti from Disneyland Park's Matterhorn ride was relocated to the Guardians of the Galaxy ride in Disney California Adventure Park. (And don't miss Eeyore hiding in Indiana Jones Adventure.) There's also an interesting story behind how Snow White Grotto came to be. However, another category exists that fascinates Disney fanatics: abandoned attractions.", "For example, Disney's River County was the first waterpark in Walt Disney World in Orlando, Florida. It opened in 1976 and closed in 2001. A video recorded in 1981 showed the park filled with guests. The deadly history of the waterpark may have contributed to its closure. It was explored by multiple YouTubers.", "More examples of abandoned Disney history came from The Mouselets on TikTok. In December 2020, the Tiktoker began producing an \"Abandoned Disney\" series.", "No shortage of stories, photographs, and videos exist for abandoned Disney attractions. For this story, we're going to look at part of the Skyway ride left behind in Disneyland Park. Disney fanatics might already know plenty about the old ride. However, the vast majority of guests likely have no idea that the abandoned steps, overgrown with vegetation, are hidden behind a vendor tent in Fantasyland.", "The Skyway was a gondola lift attraction that allowed guests to get a birds-eye view of the Anaheim, California, theme park, and it opened in 1956.", "The Skyway even took guests through the thrilling Matterhorn ride.", "One end of the ride was in Tomorrowland.", "The opposite end of the ride loaded and unloaded passengers in Fantasyland at a chalet.", "The Fantasyland side of the Skyway ride can be viewed on an old map for the theme park, as can pathways that led up to the chalet.", "The Skyway ride closed in 1994, becoming the latest abandoned Disney attraction. In 2016, crews removed the old chalet building to make way for Star Wars: Galaxy's Edge. At the time, some Disney fanatics may have thought that was the last piece of the Skyway ride to go.", "During initial construction for Star Wars: Galaxy's Edge, a decorative wall covered the old entrance and exit pathways for the Skyway ride.", "However, soon after, the wall was removed. But a piece of Disneyland history was still there, hidden behind a vendor tent.", "https://streamable.com/ciiyif", "The abandoned steps were also visible on Google Maps in the Street View mode.", "Crews hired by Disneyland Park may have removed the old steps and pathways during lengthy park closures in 2020, but we won't know for sure until various attractions reopen in the future.", "Jordan Liles is a Senior Reporter who has been with Snopes since 2016.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]