["About this rating", "On 14 August 2017, the satirical web site Our Land of the Free falsely reported that former United States president Barack Obama had intervened to reverse Harvard University's suspension of his daughter Malia Obama:", "If you haven’t heard, Malia Obama was recently arrested in Chicago after purchasing a whopping six pounds of marijuana (a seller’s quantity according to police) from a drug lord her father had released from prison in 2015.", "The teenage Obama faces a good bit of time in prison and has even been suspended from Harvard until the conclusion of the trial, but the regular course of justice is not acceptable to the Obama family.", "According to sources within Harvard, Barack Obama called school president Harmon Finklestein and angrily demanded that his daughter be allowed to attend the university. Of course, he caved.", "The article then presents a fabricated quotation from the president of Harvard University.", "The story is entirely false: Malia Obama was not arrested in Chicago, she has not been suspended from Harvard, she is not facing trial, and the president of Harvard University is Drew Gilpin Faust, not the fictional \"Harmon Finklestein\". This is just the latest in a series of fabricated, fake stories revolving around Malia Obama, which has included false claims that she lost an internship following her (fictional) arrest, and that she had been expelled from Harvard.", "Our Land of the Free is a satirical web site that describes itself as publishing exclusive fake stories:", "...We make no guarantee that what you read here is true. In fact, it most definitely is not. Our Land Of The Free is here to entertain you with the kind of whimsical satire conservatives enjoy.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]