["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Kanye West embraces President Donald Trump in the Oval Office during a visit on Oct. 11, 2018. (Getty Images)", "Kanye West this week upped the ante in an already interesting campaign season for Wisconsin.", "On Aug. 4, 2020, the rapper made a last-ditch effort to get on the ballot for the Nov. 3 presidential election. West said in July that he would run for president under the \"Birthday Party\" and has since targeted ballots in several states — including key swing states like Wisconsin.", "It remains unclear whether West obtained enough signatures to secure his spot — or if his campaign even filed the paperwork in time. But the attempt has stirred controversy across the state and country.", "\"The GOP lawyer who helped @kanyewest get on the ballot in Wisconsin is actively working for @realDonaldTrump’s campaign,\" stated an Aug. 5, 2020 Instagram post.", "This post was flagged as part of Facebook’s and Instagram’s efforts to combat false news and misinformation on their News Feeds. (Read more about our partnership with Facebook.)", "Let’s dig in.", "The Instagram post, viewed more than 32,000 times, shows a screen grab of a tweet from singer-songwriter John Legend that quotes another tweet by Vice reporter Cameron Joseph.", "\"Just in case anyone needs some clarity around what’s happening here,\" Legend wrote.", "Joseph tweeted the statement on Aug. 4, the day signatures were due in Wisconsin.", "According to an article from Joseph in Vice, the person seen dropping off West’s paperwork was Lane Ruhland, a lawyer who previously worked for the Republican Party of Wisconsin. Matt Smith, a reporter for WISN in Milwaukee, tweeted a video of Ruhland walking into the state Election Commission’s building a few minutes after the 5 p.m. filing deadline.", "Ruhland is also representing Trump’s campaign in a lawsuit against the Democratic super PAC Priorities USA and a Rhinelander TV station, the Milwaukee Journal Sentinel reported.", "Daniel Bice of the Journal Sentinel also noted that some of West’s 10 electors, who must pledge to vote for the rapper in the Electoral College if he wins Wisconsin, appear to be Trump supporters and Republican activists.", "Citing a tweet from a Vice reporter, an Instagram post said the GOP lawyer who helped Kanye West get on the ballot in Wisconsin is actively working for Donald Trump's campaign.", "West lined up help from several Republicans in Wisconsin in his effort to appear on Wisconsin’s presidential ballot, including a GOP lawyer who’s representing the Trump campaign in a federal lawsuit.", "We rate this claim True.", "Milwaukee Journal Sentinel, Kanye West hires firm to get on November presidential ballot in Wisconsin, Aug. 4, 2020.", "Twitter, tweet from Cameron Joseph, Aug. 4, 2020.", "Vice, A Well-Connected GOP Strategist Is Helping Kanye West Get on the Ballot in Wisconsin, Aug. 4, 2020.", "Twitter, tweet from Matt Smith, Aug. 4, 2020.", "Milwaukee Journal Sentinel, Bice: Wisconsin Republicans help Kanye West in his attempt to get on state presidential ballot, Aug. 4, 2020.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]