["By Robert Farley", "Posted on November 29, 2016", "Despite Donald Trump and his campaign manager describing his election victory as a “landslide,” Trump’s margin of victory actually ranks among the closest in the Electoral College.", "With the Michigan election results now certified, Trump expanded his Electoral College victory over Hillary Clinton to 306 to 232. That’s a convincing victory, for sure, but it hasn’t stopped Trump from embellishing his victory.", "On Nov. 27, Trump tweeted that in addition to winning the Electoral College “in a landslide” he also won the popular vote “if you deduct the millions of people who voted illegally.” We found no basis for Trump’s claim about “millions of people who voted illegally” and whether that swung the popular vote in favor of Clinton (who currently leads the popular vote tally by more than 2 million votes). But what about the claim of a landslide victory?", "In addition to winning the Electoral College in a landslide, I won the popular vote if you deduct the millions of people who voted illegally", "— Donald J. Trump (@realDonaldTrump) November 27, 2016", "The following day, Kellyanne Conway, Trump’s former campaign manager and now a senior adviser to the president-elect,  used similar language — “landslide” — to characterize the 306 electoral votes won by Trump.", "306. Landslide. Blowout. Historic. https://t.co/ObYZDo8cBq", "— Kellyanne Conway (@KellyannePolls) November 28, 2016", "And Trump again used the term later the same say in a tweet criticizing CNN for reporting — correctly — that Trump’s claims about illegal voters swaying the popular vote to Clinton were baseless.", ".@CNN is so embarrassed by their total  (100%) support of Hillary Clinton, and yet her loss in a landslide, that they don't know what to do.", "— Donald J. Trump (@realDonaldTrump) November 29, 2016", "But it turns out that the percentage of electoral votes won by Trump, 56.9 percent, is hardly a landslide by historic comparison.", "John Pitney, a professor of American Politics at Claremont McKenna College, put together a chart showing the Electoral College share won by every president since George Washington and found that Trump’s margin of victory ranked 46th out of 58 U.S. presidential elections. (You can view the whole list below.)", "“It’s just not true,” Pitney said of Trump’s “landslide” boast.", "Pitney told us in a phone interview that while there’s no legal definition of landslide, such a victory should have to at least be in the top half of electoral wins. “And this doesn’t come close to that,” Pitney said.", "George Washington tops the list, having carried 100 percent of the electoral vote. But one need not go so far back in history to see true landslides. Ronald Reagan carried 49 states in 1984, garnering him nearly 97.6 of the electoral vote. Richard Nixon also carried 49 states in 1972, winning 96.65 percent of the electoral vote.", "“Those were landslides,” Pitney said.", "Even George H. W. Bush in 1988 got 426 electoral votes, which translated to over 79 percent of the electoral vote. It only seemed smaller compared to Reagan’s victories, Pitney said. But Bush got a higher percentage of electoral votes than Obama did in 2008 (365 votes, or 67.84 percent), Pitney said, and “everybody was saying what a big margin Obama won by.”", "Trump’s margin of victory in the Electoral College is greater than George W. Bush’s in 2000 or 2004, but both of those were among the tightest electoral victories in American history.", "“Trump won. He won by a clear margin,” Pitney said. “But it was no landslide by any accepted definition of that term.”", "Nate Silver of FiveThirtyEight also looked at Trump’s victory in historical context and concluded it was “a bit Orwellian to call it a ‘landslide’ or a ‘blowout.'”", "Silver found that the percentage of electoral vote won by Trump — 56.9 percent — was well below the historical average, 70.9 percent. Silver found that Trump’s share of electoral votes ranked 44th out of 54 elections going back to 1804. Before that, he noted, “presidential electors cast two votes each, making it hard to compare them to present-day elections.”", "To this, we will add the disclaimer that these calculations assume Electoral College electors on Dec. 19 will vote according to who won a plurality of votes in their state, and that recounts will not overturn any of the state results.", "Here’s Pitney’s list:", "https://www.sharethefacts.co/share/0e7f65c8-8066-4eb9-ba8c-de764437aa41", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]