["About this rating", "Luca Colombo rode a customized motorcycle across Lake Como in Italy.", "This was not a typical motorcycle; it had been modified for the task and was outfitted with special skis.", "On 18 April 2018, the Facebook page \"What Did I Just Watch\" shared a video purporting to show a man \"defying physics\" as he rode a motorcycle across the surface of Italy's Lake Como:", "This guy is attempting to break a world record by riding his motorbike across the water surface! (Lake Como, Italy). By defying the rules of physics he tries to ride from one coast to the other. While knowing it's an extremely hard task.... and dangerous too. But it doesn't stop this brave guy from giving it a shot! After revving his engine he's going as fast as he can to avoid sinking after speeding for a couple of minutes he makes it to the other shore without falling in the water and he broke the world record! Let's watch it again.... A speedboat is following him to film his stunt and to make sure he doesn't get hurt. This is outstanding!", "The video was presented as if it showed an ordinary motorcycle \"defying the rules of physics,\" and it is real, inasmuch as it was not tampered with or altered. The text accompanying this footage failed to mention, however, that this motorcycle had been outfitted with ski-like features enabling it to travel across the water.", "Luca Colombo rode the customized Suzuki 450/4T across Lake Como in July 2017, covering just under 3.5 miles (around 5.6 kilometers) within five minutes. The motorcycle was outfitted with special skis around the front and rear tires which were also modified with fin-like rubber blades designed to help propel the motorcycle across the water's surface:", "La Suzuki 450/4T è stata preparata da Carlo Gelmi, il “padre” della Yamaha R6E elettrica, e da Giorgio Lumini, tecnico motorista di numerosi campioni iridati. La moto è stata allestita con pattini nautici e una gomma dotata di pale speciali che le hanno fornito la spinta idrodinamica necessaria a far planare gli oltre 230 chilogrammi di stazza a pieno carico a una velocità di 30 nodi (60 km/h).", "The Suzuki 450/4T was prepared by Carlo Gelmi, the \"father\" of the Yamaha R6E electric, and by Giorgio Lumini, motor technician for many world champions. The bike was set up with water shoes and equipped with special blades that gave it the hydrodynamic thrust necessary to plan the more than 230 kilograms of full load at a speed of 30 knots (60 km/h).", "Photographs from Colombo's Facebook, as well as that of his company, Hydro MX, provide a clear view of these modifications:", "Red Bull.   \"Luca Colombo: Record Del Mondo Pazzesco!\"\r\n    24 August 2017.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]