["Actor and comedian Bill Cosby was convicted on three counts of felony sexual assault in April 2018 after a jury found him guilty of drugging and assaulting a woman in 2004. She was one of 60 women who publicly accused Cosby of rape, sexual assault or harassment over the years. He was sentenced to three to 10 years in state prison and is currently incarcerated.", "But one conspiracy theory that’s persisted in recent years claims that Cosby was framed by the Illuminati, alleged to be a secret society of elites that control the world’s affairs. The rumor has been making the rounds on the internet since at least 2016 and continues to be shared on social media.", "We came across one version of the story that’s been shared on Facebook over 1,800 times.", "The account was posted on a Wordpress blog called \"Governmental Services Corporation Watch\" in June 2017 and is identical to another story that was posted (and is now deleted) by News Punch, a website that’s been associated with spreading fake news stories and conspiracy theories.", "The story says that a \"Hollywood insider\" came forward and alleged that Cosby was \"framed with rape allegations in order to prevent him from buxying TV network NBC.\"", "\"Cosby, known as ‘America’s Dad’, is standing trial for aggravated sexual assault in Pittsburgh, and has responded to allegations that he drugged and sexually abused women with fierce denials.", "The Hollywood insider says that Bill Cosby became such a threat to the establishment elite that they had to invent the vilest of accusations against him in order to destroy his career.", "The accusers are women who have worked with the Illuminati in the past and were paid to state they are victims of rape. Only one of Cosby’s accusers leveled accusations against him within the statute of limitations (12 years), and the others, according to the Hollywood insider, are opportunists who have been paid off to smear Cosby’s reputation and destroy his career.\"", "The article was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The account lacks corroborating evidence and does not include any sources besides the unnamed \"Hollywood insider.\"", "The article further diminishes in credibility by claiming that the \"Illuminati\" is behind framing Cosby. While there was a secret group called the Bavarian Illuminati that operated from 1776 to 1785 that sought to empower a small group of people to be influential world leaders, there is no evidence it exists today. Yet the group is often implicated by conspiracy theorists of being the masterminds behind government dealings, the media and major events. These theories have long been discredited and debunked.", "It is accurate that Cosby was reportedly interested in purchasing NBC in the early 1990s from its owner at the time, General Electric. But that was more than 20 years before the accusations against Cosby started to surface publicly. We reviewed Nexis news archives for coverage of Cosby’s efforts to buy the network, and found that talk of any possible deal appears to have dissipated after 1993, when the Associated Press characterized Cosby’s interest as \"short-lived.\"", "The New York Times also said that the asking price for NBC at the time was likely to be around $4 billion when Cosby’s net worth was estimated at $300 million. A 1993 Vanity Fair article said, because of this, Cosby was willing to team up with others but the offer was declined twice by Brandon Tartikoff, the network’s president at the time.", "An internet rumor posted on multiple blogs says that Cosby was framed for sexual assault by the Illuminati to keep him from buying NBC.", "There is no credible evidence to support this claim. Credible news coverage indicates Cosby was interested in purchasing the network in the early 1990s – decades before he was publicly accused of sexual assault – but no deal was made.", "We rate this Pants on Fire!", "Washington Post, Bill Cosby convicted on three counts of sexual assault, April 26, 2018", "Govbanknotes.wordpress.com, Hollywood Insider: Bill Cosby was Framed by Elite to Stop him Buying NBC, June 14, 2017", "Washington Post, The Bill Cosby trial, explained, June 5, 2017", "Archive.Today, NewsPunch article; Accessed Nov. 2, 2019", "WayBack Machine, YourNewsWire article; Accessed Nov. 2, 2019", "New York Times, THE MEDIA BUSINESS; Bill Cosby Trying to Buy NBC From G.E., Oct. 29, 1992", "Vanity Fair archives, Bill Cosby’s Big Adventure, August 1993", "Associated Press, Is Bill Cosby in Pursuit of NBC?, June 15, 1993", "Vox, 9 questions about the Illuminati that you were afraid to ask, Jan. 19, 2016", "Snopes, Did a Woman Admit She Was Paid to Frame Bill Cosby With Rape?, March 1, 2019", "Inquisitr, Was Bill Cosby Going To Buy NBC? [Fact Checking], April 29, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]