["About this rating", "The \"coachman's warning\" legend has been kicking around since 1906 when it was told in Pall Mall Magazine as the E.F. Benson short story The Bus-Conductor. In that long-ago version, a man has the presaging encounter that saves his life through a disturbing late-night exchange with the driver of a hearse that pulls up to the home where he is staying as a houseguest. The hearse driver (who is puzzlingly dressed as a bus conductor) locks eyes with the man, gestures at his empty conveyance, and announces, \"Just room for one inside, sir.\" A month later, that same unsettling man attempts to gesture the former houseguest into a bus he'd been planning to take, once again with \"Just room for one inside, sir.\" The terrified man backs away then runs off. Moments later, the bus is struck from the side by a car traveling too fast, the automobile \"burrowing into it as a gimlet burrows into a board, making matchwood and — other things of it.\"", "A well-known version of the yarn surfaces in Bennett Cerf's 1944 Famous Ghost Stories. More modern tellings present the narrowly-avoided fatal accident as the falling of an elevator car and the person so warned (and thus saved) as a woman.", "A young woman on her way to town broke her journey by staying with friends at an old manor house. Her bedroom looked out to the carriage sweep at the front door. It was a moonlit night, and she found it difficult to sleep. As the clock outside her bedroom door struck 12, she heard the noise of horses' hooves on the gravel outside, and the sound of wheels. She got up and went over to the window to see who could be arriving at that time of night. The moonlight was very bright, and she saw a hearse drive up to the door. It hadn't a coffin in it; instead it was crowded with people. The coachman sat high up on the box: as he came opposite the window he drew up and turned his head. His face terrified her, and he said in a distinct voice, \"There's room for one more.\"", "She drew the curtain, ran back to bed, and covered her head with the bedclothes. In the morning she was not quite sure whether it had been a dream, or whether she had really got out of bed and seen the hearse, but she was glad to go up to town and leave the old house behind her.", "She was shopping in a big store which had an elevator in it — an up-to-date thing at that time. She was on the top floor, and went to the elevator to go down. It was rather crowded, but as she came up to it, the elevator operator turned his head and said, \"There's room for one more.\"", "It was the face of the coachman of the hearse. \"No, thank you,\" said the girl. \"I'll walk down.\" She turned away, the elevator doors clanged, there was a terrible rush and screaming and shouting, and then a great clatter and thud. The elevator had fallen and every soul in it was killed.", "No matter the mode whereby others perish or the sex of the person spared, the eerie coachman remains a constant element of the tale. Sometimes the forewarned recognizes the vehicle the midnight coachman shows up in as a hearse, but sometimes sees only an unremarkable coach and is left puzzled by why the driver's appearance and invitation are so unsettling.", "Sightings:   The plot of the 1945 film Dead of Night was based on this legend, as was an episode of the television anthology series The Twilight Zone (\"Twenty-Two,\" original air date 10 February 1961).", "Benson, E.F.   \"The Bus-Conductor.\"\r\n   Pall Mall Magazine.   July-December 1906   (pp. 721-726).", "Briggs, Katherine & Ruth Tongue.   Folktales of England.\r\n    London: Routledge & Kegan Paul, 1965.   (pp. 67-68).", "Brunvand, Jan Harold.   Too Good to Be True.\r\n    New York: W. W. Norton, 1999.   ISBN 0-393-04734-2   (pp. 229-231).", "Cerf, Bennett.   Famous Ghost Stories.\r\n    New York: Modern Library, 1944.", "de Vos, Gail.   Tales, Rumors and Gossip.\r\n    Englewood: Libraries Unlimited, 1996.   ISBN 1-56308-190-3   (pp. 317-318).", "Schwartz, Alvin.   Scary Stories to Tell in the Dark.\r\n    New York: HarperCollins, 1981.   ISBN 0-397-31927-4   (pp. 47-48).", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]