["About this rating", "A tourism company in Trier, Germany released a \"Zero Euro\" note celebrating Karl Marx on his 200th birthday.", "This is a souvenir item, not a genuine piece of currency.", "In March 2018, an image showing a young woman holding what appeared to be an official piece of European currency featuring the face of German philosopher and Communist Manifesto co-author Karl Marx started making its way around the Internet:", "\"Zero Euros\" are a popular souvenir item in Europe. Richard Faille started producing the realistic currency (which is authorized by the European Central Bank) in 2015, with the help of an official banknote printer called Oberthur Fiduciaire. Faille's operation expanded over the years and now Zero Euro notes are available in a number of European countries and commemorate a variety of topics, such as anniversaries, historical locations, city events, and notable individuals:", "The Zero Euro is a souvenir banknote with authorized printing by the European Central Bank (ECB) and is on queue to be a popular in 2017 banknote collector markets. It’s origins stem from France in 2015 after Richard Faille, creator of popular French currency souvenirs, decided to create euros that promote tourism. The banknotes are printed at a private fiduciary facility and they share many of the same characteristics of a real Euro except that they are marked as “0”, hence the name, and are tested to ensure they cannot enter circulation as legitimate financial currency. The front of all zero euros is the same and it includes a white zero followed by the Euro sign to denominate no financial value. Then (from left to right) Brandenburg Gate, Big Ben, the Eiffel Tower, the Colosseum, Sagrada Familia, Manneken Pis and the Mona Lisa.", "The pictured item is a souvenir that was produced by a tourism company in Trier, the German town where Marx was born, in honor of what would have been the author's 200th birthday in May 2018. The bill can be purchased for €3:", "On 5 May 2018 the city of Trier celebrates the 200th birthday of its famous son Karl Marx and on this occasion we have a bill from Trier Tourismus und Marketing GmbH.", "Norbert Käthler, the Managing Director of Trier Tourism and Marketing, acknowledged the humor in putting Marx on a worthless piece of currency:", "Norbert Käthler, Geschäftsführer der ttm, sagt zu dem Null-Euro-Schein: „Das Souvenir setzt sich spielerisch mit der Marx’schen Kapitalismuskritik auseinander. Und natürlich passen die Null-Euro-Scheine auch hervorragend zu Marx als Geldscheinmotiv.“", "Norbert Käthler, Managing Director of TTM, says about the Zero Euro note: \"The souvenir playfully deals with Marx's critique of capitalism. And of course, zero-euro bills also fit perfectly with the Marx motif.\"", "Satirical web site the Sacramento Brie also used an altered version of this image in an article that facetiously claimed that the zero value Marx bill was being used in Venezuela to boost the country's economy.", "Numis Magazine.   \"“Zero Euro” Banknote Creator Richard FAILLE Strikes Again!\"\r\n    25 June 2017.", "Lokalo.de.   \"'Das Geld Wird Abgeschafft!' – Trier Bietet Zum 200. Geburtstag Von Karl Marx Einen Null-Euro-Schein An.\"\r\n    17 March 2018.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]