["About this rating", "This claim has a few ambiguities to it.  First of all, \"poisonous\" and \"venomous\" are two distinctly different qualities: poisonous animals give off toxins which are absorbed when they are touched or eaten by attackers; venomous animals transmit toxins by injecting them into their victims.", "Secondly, more than one type of critter is referred to as a \"daddy longlegs.\" The crane fly, a winged insect which looks like a large mosquito, is called a daddy longlegs in some parts of the world (such as England), but it is not venomous (nor is it a type of spider). The pholcus phalangioides, also referred to as the long-legged cellar spider, is an example of a \"daddy longlegs\" spider, probably the one referred to here as being the world's \"most poisonous animal\":", "In terms of being poisonous (i.e., posing a danger to people who might eat or handle it), a daddy longlegs spider can't compare to the South American poison dart frog.  And according to the Spiders and other Arachnids site at the University of California, Riverside, there's no evidence that daddy longlegs spider venom poses any danger to humans:", "There is no reference to any pholcid spider biting a human and causing any detrimental reaction. If these spiders were indeed deadly poisonous but couldn't bite humans, then the only way we would know that they are poisonous is by milking them and injecting the venom into humans. For a variety of reasons including Amnesty International and a humanitarian code of ethics, this research has never been done. Furthermore, there are no toxicological studies testing the lethality of pholcid venom on any mammalian system (this is usually done with mice). Therefore, no information is available on the likely toxic effects of their venom in humans, so the part of the myth about their being especially poisonous is just that: a myth. There is no scientific basis for the supposition that they are deadly poisonous and there is no reason to assume that it is true.", "In the pantheon of venomous animals, the box jellyfish is a particularly bad creature for humans to encounter.  With the realm of venomous spiders, the funnel web spider or the brown recluse spider are among the most dangerous to people.", "Beem, Kate.   \"Poison-Dart Frogs Call School Home.\"\r\n    The Kansas City Star.   26 January 1998   (p. B1).", "Gadd, Laurence.   Deadly Beautiful: The World's Most Poisonous Animals and Plants.\r\n    New York: Macmillan, 1980.", "Jones, Rebecca.   \"PB and Honey Sandwich a Sweet Lunchroom Treat.\"\r\n    Denver Rocky Mountain News.   12 October 1997   (p. D20).", "Levey, Bob.   \"At Camp, Chester Provides a Leggy Lesson.\"\r\n    The Washington Post.   18 July 2000   (p. C9).", "McClanahan, Thomas.   \"'Raccoons Ate All My Gumballs.'\"\r\n    The Kansas City Star.   20 July 1999   (p. B7).", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]