["In his June 15, 2010, Oval Office address on the Gulf oil spill, President Barack Obama defended his decision to temporarily halt new oil drilling in the Gulf of Mexico in the wake of the Deepwater Horizon tragedy.", "\"Already, I’ve issued a six-month moratorium on deepwater drilling,\" Obama said. \"I know this creates difficulty for the people who work on these rigs, but for the sake of their safety, and for the sake of the entire region, we need to know the facts before we allow deepwater drilling to continue.\"", "On May 27, Obama did announce a 6-month moratorium on exploratory drilling in the Gulf of Mexico. But if you think that means there's no more oil production going on in the Gulf, you'd be mistaken.", "Wells that are currently producing oil will continue to produce. There are 72 active platforms in water depths of 500 feet or greater (the definition of deepwater) in the Gulf of Mexico that will be allowed to continue to operate.", "At issue here is the term \"oil drilling.\" Many people use the term broadly to refer to the entire process of extracting oil from the ground, not just drilling the holes looking for oil. But once a well starts producing oil, it's not being \"drilled\" anymore.", "According to the moratorium notice, the U.S. Minerals Management Service will not consider drilling permits for deepwater wells for six months. In addition, operators that are currently drilling any well \"must proceed at the next safe opportunity to secure the well and take all necessary steps to cease operations and temporarily abandon or close the well until they receive further guidance from the Regional Supervisor for Field Operations.\" There are 33 drilling operations in water deeper than 500 feet that fit that bill, which means that they needed to get to a safe place and then stop drilling. For the record, Deepwater Horizon was among the wells in the exploratory drilling phase.", "When the Department of the Interior issued the moratorium directive on May 30, Secretary Ken Salazar published a statement saying, \"Deepwater production from the Gulf of Mexico will continue subject to close oversight and safety requirements, but deepwater drilling operations must safely come to a halt. With the BP oil spill still growing in the Gulf, and investigations and reviews still underway, a six-month pause in drilling is needed, appropriate, and prudent.\"", "We think a lot of people probably assumed Obama's statement meant that all oil operations in the Gulf of Mexico were put on a six-month hiatus. That's not the case. The moratorium relates to exploratory oil drilling, not to existing, oil-producing deepwater platforms, which will continue to produce. So Obama's words were technically accurate, though due to the common use of the phrase oil drilling to refer to all oil operations, we think it may have confused some people. And so we rule his statement Half True.", "White House website, President Obama's Oval Office Address on the BP Oil Spill, June 15, 2010", "U.S. Department of the Interior, Press release: Interior Issues Directive to Guide Safe, Six-Month Moratorium on Deepwater Drilling, May 30, 2010", "U.S. Department of the Interior, Moratorium Notice to Lessees and Operators, May 30, 2010", "U.S. Department of the Interior, Table of affected deepwater drilling activities, May 30, 2010", "White House blog, Obama press conference: \"Whatever is Necessary to Protect and Restore the Gulf Coast,\" May 27, 2010", "White House website, Executive Order: National Commission on the BP Deepwater Horizon Oil Spill and Offshore Drilling, May 22, 2010", "The Christian Science Monitor, \"In offshore drilling freeze, rumblings of a new era for oil industry,\" by Mark Clayton, May 27, 2010", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]