["This claim was posted here on Facebook on December 13, 2020. It has since been shared more than 12,000 times.", "The caption translates to English in part as:", "“The new 100 baht yellow banknotes of Thailand were produced without the EURion constellation to prevent scans and prints, the producers and banks say this is because they are commemorative notes so they did not put them in.", "“All internationally recognised bills all have unique EURion constellations scattered on them, even the lowest valued bill in Thailand such as the 20 baht bill has this as referenced in the picture.”", "“This commemoration banknote may not be used for the exchange of other currencies, it can only be used in this country, due to it lacking the eurion constellations. Foreigners will think that this can be a counterfeit banknote.”", "On December 12, 2020, the Bank of Thailand (BOT) issued a new set of commemorative notes to mark the Royal Coronation Ceremony of 2019.", "The release of the new gold 100 baht banknotes triggered concerns they could be mistaken for the existing 1,000 baht notes, the Bangkok Post reported.", "This 2010 research paper about banknotes describes a EURion constellation as: “A pattern of symbols which can be found in a large amount of banknote designs since 1997. This pattern is one of many security features in a banknote.”", "A similar claim about the banknotes was shared on Facebook here, here, here, here and here.", "The claim, however, is misleading.", "‘Modern anti-counterfeit technology’", "The BOT also stated in this Facebook post that the commemorative banknotes possess anti-counterfeit features in line with other banknotes in circulation.", "On December 14, 2020, the Bank of Thailand issued this press release about the 100-baht commemorative notes, saying they incorporate “modern anti-counterfeiting technology”.", "The text reads: “The two types of commemorative banknotes have utilised modern anti-counterfeiting technology which is used in the current banknotes (type 17) incorporated into their design, such as the translucent watermark, an animated 3D magnetic ink, a special ink with altering colours, and a special ink that glows under ultraviolet rays, in order to blend technology and storytelling through the pattern on the banknote for appropriateness and aesthetics.”", "‘Not necessary’", "Steven J. Murdoch, a Professor of Security Engineering at University College London’s Department of Computer Science, said the EURion constellation was not a “necessary feature to prevent counterfeiting”.", "“The EURion constellation and CDS (Counterfeit Deterrence System) are designed primarily to disrupt amateur attempts to counterfeit currency, and can be circumvented without too much difficulty,” he said in an email to AFP on December 16, 2020. “Banknotes contain many other security features which are much harder to bypass than the EURion constellation or CDS, such as the use of special papers/plastics and printing techniques which are hard to replicate.”", "Nicholas Gessler, a retired Research Associate in Information Science and Information Studies at Duke University, North Carolina said: “The lack of the EURion Constellation does not necessarily mean that there are no security features incorporated into the note.”", "“The EURion Constellation was designed to be detected by office photocopiers, it never did deter serious counterfeiters,” he said in an email to AFP on December 18, 2020. “There are many other more modern and effective security features in use today. Some are made public to reassure the populace. Others remain secret to confuse the counterfeiters. Counterfeiting and counterfeit detection have always been, and always will be, a cat-and-mouse game.”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]