["About this rating", "In August 2018, Facebook users encountered multiple postings of a photograph of what looked to be a very large newborn child, accompanied by text suggesting the baby weighed in at a whopping 8.6 kilograms (18.96 pounds) -- said to be a Guinness World Record for \"the biggest baby born by natural birth\":", "This photograph has been online since at least as far back as March 2017, with varying weights offered for the pictured child.  We haven't yet been able to tie the photograph to any details documenting the identity of the pictured child, its birth weight, or the date and circumstances of its birth. or link the picture with any news story or other report about the birth of an extraordinarily large baby.", "We can note that the current Guinness World Record for \"Heaviest Birth\" is a 9.98 kg (22 lb.) boy born in 1879 to a 7 ft. 11 in. Ohio woman who was also part of a Guinness World Record for \"Tallest Married Couple\":", "Giantess Anna Bates, who measured 241.3 cm (7 ft 11 in), gave birth to a boy weighing 9.98 kg (22 lb) and measuring 71.12 cm (28 in) at her home in Seville, Ohio, USA, on 19 January 1879.", "The baby, who was not officially named but just referred to as \"Babe\", sadly died 11 hours later.", "It has been reported that when Anna's waters broke, she lost an estimated six gallons of fluid.", "Martin van Buren Bates, the father of the child wrote: “He was 28” tall, weighed 22 lbs and was perfect in every respect. He looked at birth like an ordinary child of six months”.", "Many commenters have pointed to news accounts of the 2009 birth (by cesarean section) of a child in Indonesia whose weight (8.7 kilograms, or 19.2 pounds) was even greater than that claimed of the child pictured above:", "A baby made his way into the world in Indonesia at 19.2 pounds (8.7 kg) -- about three times the weight of an average newborn.", "Muhammad Akbar Risuddin is thought to be the heaviest baby born to date in Indonesia.", "\"I was very surprised. I thought it was twins,\" said Binsar Sitanggang, the lead doctor in the cesarean-section delivery at Abdul Manan Hospital in North Sumatra.", "\"It needed a longer time than normal to deliver this baby,\" Sitanggang said. \"He was hardly breathing when we took him out. But, thank God, he is healthy.\"", "\"We can compare this giant baby with a 9- to 10-month-old baby,\" Sitanggang said. \"Both his parents are tall and big, so there might be a genetic cause for this.\"", "But again, we haven't yet found anything definitively linking the viral photograph at the head of this article to that Indonesian birth, or to any of the other reported births of unusually large babies in recent years.", "CNN.   \"Giant Baby Born in Indonesia.\"\r\n    25 September 2009.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]