["About this rating", "Jill Biden received her doctorate in education from the University of Delaware in January 2007.", "The future first lady is not a medical doctor, nor did she receive a degree in medicine.", "Following the contentious 2020 presidential contest between Republican incumbent U.S. President Donald Trump and his opponent, former Vice President Joe Biden, the victory of the latter politician sparked a new wave of political misinformation and smear campaigns on the internet.", "Among such coverage was the argument that future first lady Dr. Jill Biden should nix her prefix because she is not a medical doctor, nor did she receive a medical degree. The first lady-elect is referred to as \"Dr. Jill Biden\" in news releases issued from the president-elect's office and also has the title on her official Twitter and Facebook profiles.", "The question of whether the first lady-elect was a doctor came after a Dec. 11, 2020, opinion piece was published in The Wall Street Journal titled, \"Is There a Doctor in the White House? Not if You Need an M.D.\" In the article, former Northwestern University lecturer Joseph Epstein — who had not taught at the university since 2003 — referred to the future FOTUS as \"kiddo,\" and said that her honorific title felt \"fraudulent\" and comic.\" The piece went on to say:", "Madame First Lady—Mrs. Biden—Jill—kiddo: a bit of advice on what may seem like a small but I think is a not unimportant matter. Any chance you might drop the \"Dr.\" before your name? \"Dr. Jill Biden\" sounds and feels fraudulent, not to say a touch comic.", "[…]", "A wise man once said that no one should call himself \"Dr.\" unless he has delivered a child. Think about it, Dr. Jill, and forthwith drop the doc.", "Subsequent coverage of the opinion piece was covered in a number of news publications, from The New York Times to Fox News.", "It is true that Biden is not a medical doctor nor did she receive a degree in medicine. However, the future first lady received two master's degrees from West Chester University and Villanova University, as well as a doctorate in education from the University of Delaware in January 2007 — an academic accomplishment that warrants the prefix of \"Dr.\"", "A doctorate of education is a professional degree for practitioners interested in educational leadership roles that differ from a doctor of philosophy (Ph.D.) in education. An Ed.D. is designed for those wishing to pursue research and teaching roles, according to the private research institute Northeastern University in Boston. Those with an Ed.D. typically work in higher education as administrators or executives in a practice-based leadership role. Biden worked as an educator at a psychiatric hospital in the 1980s, and taught as an English professor at Northern Virginia Community College.", "The question of who is entitled to affix the \"Dr.\" preface before their name is largely a matter of opinion. But as a general practice, it is acceptable for those with doctorate degrees to refer to themselves as a doctor. At news organizations like Snopes, for example, we follow Associated Press style guidelines, which dictate that only medical doctors are referred to as \"Dr.\"", "In a statement released on Dec. 12, Northwestern University condemned the opinions expressed in the Wall Street Journal article.", "\"While we firmly support academic freedom and freedom of expression, we do not agree with Mr. Epstein's opinion and believe the designation of doctor is well deserved by anyone who has earned a Ph.D., an Ed.D. or an M.D.,\" wrote the university. \"Northwestern is firmly committed to equity, diversity and inclusion, and strongly disagrees with Mr. Epstein's misogynistic views.\"", "The English department at the university also furthered that Epstein was a former adjunct professor who had not taught within the department in nearly 20 years, adding that his written piece \"casts unmerited aspersion on Dr. Jill Biden's rightful public claiming of her doctoral credentials and expertise.\"", "\"The Department rejects this opinion as well as the diminishment of anyone's duly-earned degrees in any field, from any university,\" wrote the department on its website.", "Correction [Dec. 14, 2020]: Changed Joseph Epstein's Northwestern University job description from \"professor\" to \"lecturer,\" in accordance with the university's own description.", "Madison Dapcevich is a freelance contributor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]