["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Gov. Rick Scott rallied Republican activists at Florida's Presidency 5 straw poll with an argument for the state's supremacy in choosing the party's presidential contender.\n\n\"None will have a greater impact on the selection of the nominee than our own primary in the Sunshine State,\" Scott told a crowd of 3,500 on Sept. 24, 2011.\n\nWhile other primaries or caucuses might be earlier, he said, Florida's population and diversity set it apart.\n\n\"At nearly 19 million people, the population of Florida is larger than all the earlier primary and caucus states combined,\" he said.\n\nThe Republican National Committee allows just Iowa, New Hampshire, South Carolina and Nevada to vote in February 2012 without penalty.\n\nFlorida has yet to choose its primary date. But state lawmakers would like to see it as early as possible, saying it better reflects the country than the four \"early\" states and should play an agenda-setting role.\n\nAs Scott made his plea, we wondered: Is the population of Florida larger than Iowa, New Hampshire, South Carolina and Nevada combined? We turned to the U.S. Census Bureau:", "2010 population", "Iowa: 3 million\nNew Hampshire: 1.3 million\nSouth Carolina: 4.6 million\nNevada: 2.7 million\nTotal: 11.7 million\n\nFlorida: 18.8 million\n\nSo, Scott's right on. Florida's \"nearly 19 million people\" does eclipse the early states' nearly 12 million. (Now, that doesn't tell us who actually votes there — but he didn't say voters, so we won't quibble.)", "Gov. Rick Scott, speech at Presidency 5, Sept. 24, 2011\n\nTimes/Herald Tallahassee Bureau, \"Gov. Rick Scott delivers forceful speech at Presidency 5,\" Sept. 25, 2011\n\nPolitiFact Florida, \"Rep. Will Weatherford says penalized Florida delegation would still wield clout,\" July 7, 2011\n\nTimes/Herald Tallahassee Bureau, \"Panel postpones decision on setting date for presidential primary until eve of deadline,\" Sept. 23, 2011\n\nU.S. Census Bureau, State & County QuickFacts: Florida, accessed Sept. 26, 2011\n\nU.S. Census Bureau, State & County QuickFacts: Iowa, accessed Sept. 26, 2011\n\nU.S. Census Bureau, State & County QuickFacts: New Hampshire, accessed Sept. 26, 2011\n\nU.S. Census Bureau, State & County QuickFacts: South Carolina, accessed Sept. 26, 2011\n\nU.S. Census Bureau, State & County QuickFacts: Nevada, accessed Sept. 26, 2011", "Interview with Scott spokesman Lane Wright, Sept. 27, 2011", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]