["The misleading claims were published on Facebook here on March 16, 2020. The post has been shared more than 17,000 times.", "Below is a screenshot of the misleading post:", "The post’s lengthy caption, which is written in Sinhala, details a list of instructions that purportedly help control the spread of the novel coronavirus.", "The new virus has killed more than 8,500 people and infected over 200,000 others worldwide, according to the World Health Organisation.", "The post also features an image with text translates as: “This is a valuable article revealed by a Chinese doctor on how China managed to control coronavirus so swiftly..”", "Identical posts were also shared on Facebook here, here and here.", "However, many of the recommendations are misleading.", "The misleading posts did not cite a specific Chinese doctor or Chinese health authority; a keyword search in Chinese combining \"coronavirus\" and the alleged preventive measures in the posts also found no record of similar advice provided by health practitioners.", "--Light bulbs--", "While highlighting the importance of frequent handwashing, the post urges readers to “Fix a CFL bulb and keep it lit near taps constructed indoors. It is advisable to use red colored soap or liquid to wash hands…”", "While compact fluorescent lamps (CFL) do emit UV light, which can be used at high intensities as a disinfectant, CFL bulbs emit very low levels of UV, as noted by the US Food & Drug Administration here. This makes them safe for daily use and renders them an ineffective disinfectant.", "Dr. Ashan Pathirana, the registrar of Sri Lanka’s Health Promotion Bureau (HPB), also said that installing CFL bulbs near water taps will not provide additional protection.", "“The installation of a CFL bulb will not help disinfect oneself from the novel coronavirus. There is no scientific basis behind the use of a CFL bulb to kill the novel coronavirus,” Dr. Pathirana told AFP via phone on March 16.", "--Red soap--", "Dr. Pathirana also refuted the claim that red-coloured soap is a more effective disinfectant than other types of soaps.", "“The red may be in reference to carbolic soap,\" he said. \"But soap or liquid soap nowadays may have a red colour due to a colorant. The advice to seek specifically red coloured soap is counterproductive. The point is to make it a habit to wash one’s hands after being in a public location. For general hygiene it is advisable to wash hands with soap at least five times a day.”", "The misleading post also claims that the colour white has a “harmful” impact on the virus.", "“If you can cover with a white handkerchief or tissue when sneezing or coughing, it will prevent the virus in the mucus from being transferred to others..” the post reads.", "Dr. Pathirana said: “It's good to use a tissue when sneezing or coughing but there is no reason to seek out white because colors of the tissue absolutely have no impact on the virus. The only way to ensure the tissue does not end up transferring the virus to others, is to dispose of it safely,” he added.", "--Coughing etiquette--", "The post also calls for the use of the elbow to cover a cough as the “angle of the elbow” will kill viruses faster.", "“We ask the public to use the elbow when sneezing or coughing in order to control the spread of droplets. The angle of the elbow has no impact on killing the virus,” Dr. Pathirana noted.", "Coughs, along with sneezes, play a key role in transmitting respiratory diseases pic.twitter.com/Ud05iGJmZB", "--Official guidelines--", "Dr. Pathirana also urged the public to follow the “tried-and-tested” methods that have proven effective in minimising novel coronavirus infections including general hygiene practices and social distancing.", "Here are the safety guidelines issued by Sri Lanka's Ministry of Health.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]