["About this rating", "A conspiracy theory spread during and in the days immediately following the first presidential debate on Sept. 29, 2020, that alleged Democratic candidate Joe Biden was wearing various technological aids, which fed him talking points while debating U.S. President Donald Trump.", "NBC News reported that rumors Biden's debate night performance was aided by a wire or other technology were part of a coordinated amplification of disinformation, which was pushed by the Trump campaign. The conspiracy echoes one that claimed Trump's 2016 opponent Hillary Clinton wore a secret earpiece during a debate.", "The conspiracy theories were shared by numerous social media users — including actor James Woods on Twitter, where he has 2.6 million followers. For example he shared a low-resolution video showing a dark line on Biden's shirt, in which a man could be heard exclaiming, \"There it is! Biden's wearing a wire! Why do you need a wire bro!\"", "As USA Today pointed out, the line in Biden's shirt can be seen in a high resolution version of the video — but it disappears when he moves, because it's just a crease in the material of his shirt.", "Woods also shared a poor-quality photograph to promote another conspiracy theory claiming that Biden was wearing high-tech contact lenses that allowed him to read a script provided to him by an unseen source, arguing that the proof was that Biden's eyes looked darker in the photograph than their natural color:", "Many claimed that Biden specifically wore lenses made by a tech company called Mojo, which is developing a \"smart\" contact lens. We will provide an example of one such post on Facebook, with the user's name cropped out for the sake of privacy:", "But a spokesperson for Mojo Vision told us that wouldn't be possible.", "\"It’s exciting that people are following our product with such great imagination,\" the company said in a statement. \"The reality is that only the Mojo team has worn our smart contact lens and it doesn’t have FDA clearance yet.\"", "We zoomed in on a higher-quality video so that Biden's shirt crease and blue eye color can be seen, indicating that the dark line wasn't a wire, and that he wasn't wearing black contact lenses:", "Woods shared yet another meme that contained an outline drawing that indicated Biden was supposedly wearing a \"special communication device.\" The \"device\" was, per the meme, made up of headphones that attached in his pocket and left hand. It also contained a close-up image of Biden's left hand.", "The dark object on Biden's left wrist, circled in the above meme, isn't part of a wire device. It's a rosary that Biden wears that belonged to his son Beau Biden, who died in 2015 of cancer.", "Biden, who is Catholic, talked about wearing the beads during a 2017 \"Today\" show interview conducted by then-host Megyn Kelly. During the interview, the beads were visible on Biden's left wrist. He explained wearing them, stating:", "Beau wore these. Hunt got these for Beau and me at Our Lady of Guadalupe down in Mexico, and I visited there, and we all wore them. I'm a practicing Catholic, Beau was a devout Catholic as well. And it was more — both of us found solace in the elements of the church, it's almost like meditation for us. And so, I have not taken off the rosary Beau was wearing when he passed, since then. But it's my connection with him. I'm not trying to be, I'm not preaching, I'm not talking about, it's not even about religion per se. It's about the connection. And it just always makes me feel good. I know he's with me, just touching them.", "Collins, Ben. \"Coordinated Push of Groundless Conspiracy Theorie Targets Biden Hours Before Debate.\"\r\n  NBC News. 29 September 2020.", "Evon, Dan. \"Biden ‘Secret Earpiece’ Rumor Sounds a Lot Like False Claims Made About Clinton in 2016", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]