["The photo was published on Facebook here on January 13, 2020. The post has been shared more than 87,000 times.", "The post’s Urdu-language caption translates to English as: “O Allah, help the Muslims of Burma [Myanmar]. Say Amen and share the post. May Allah reward you”.", "The Urdu text superimposed below the photo translates as: “Just one minute for the Muslims of Burma. O Allah, help the Muslims of Burma. Write Amen and share”.", "The post circulated online after a 2017 military crackdown on Myanmar's Rohingya community that razed entire villages and sent around 750,000 people fleeing across the border into Bangladesh.", "Following a military coup in Myanmar in February 2021, the image circulated alongside similar captions on Facebook here, here, here, and here.", "AFP reported here on February 13, 2021 that Myanmar's Rohingya community were living in fear after a return to military rule.", "The photo, however, has been shared in a misleading context.", "A reverse image search found image shows protesters arrested in Thailand in October 2004. It was published by AFP here.", "The photo’s caption reads: “Some of the 300 demonstrators arrested by policemen and soldiers lie on a pavement at Tak Bai police station in Narathiwat [s]outhern Thailand, 25 October 2004. Dozens of people were injured in clashes between Thai security forces and hundreds of protesters who tried to storm a police station in Thailand's troubled Muslim-majority south, officials said Monday.”", "Below is a screenshot comparison of the photo in the misleading posts (L) and the AFP photo (R):", "The photo was taken after the Tak Bai massacre, which is remembered as one of the deadliest days in the rebellion by Malay-Muslims against the rule of the Thai state. Thailand colonised the southern provinces bordering Malaysia over a century ago, as AFP reported here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]