["About this rating", "Steve Burns, former host of Blue's Clues, the popular television show for preschoolers broadcast on Nickelodeon, is exceedingly healthy and not the slightest bit dead. He's neither been run over by a car nor done himself in by a heroin overdose, the two most popular paths this particular rumor has taken. (Another version claims he was arrested for heroin possession. That too is false, as is the rumor about his being a porn star.) More elaborate versions of the tale claim that he's been replaced on the show by a look-alike.", "Rumors about Steve's demise began surfacing early in December 1998, much to the distress of Steve and his family. To help refute the claims, Burns guested on The Rosie O'Donnell Show on 17 December 1998, and he and Blue's Clues co-creator Angela Santomero also appeared on Today to discuss how parents might talk to their children about the rumor.  Nonetheless, this false tidbit continues to circulate no matter how often or in how many places Steve shows up very much alive.", "Some parallels have been drawn between the rumors of this TV show's host's demise and equally specious claims that Paul McCartney died and was replaced with a look-alike while with the Beatles. At least half-jokingly, some viewers point to various items on the show or behaviors of the host as \"clues\" to Burns' death. Though not exactly yet on par with the 'I buried Paul' \"proofs,\" things are getting there.", "Rumors of very-much-alive celebrities being dead are not uncommon. French movie star Isabelle Adjani battled the rumor of her demise in 1987, when whispers of her languishing on a deathbed and finally kicking the bucket swept France. In common with Burns' experience, a wealth of detail was often provided by those passing along the story. Some versions specified the hospital where she had supposedly been cared for and even the number of the hospital room where she drew her last breath. To combat the rumor, Adjani made heavily-publicized appearances on the national evening news, accompanied by the president of France's Ordre des Medicins (comparable to the American Medical Association), who certified her to be in the pink of health. Even so, there were still those who believed the rumor. In a poll taken only one month after her debunking blitz, more than two million people expressed their unshaken conviction she was ill.", "However, the impact of such a rumor is not quite the same when applied to a children's host:", "\"It's very different from Paul McCartney,\" said Angela Santomero, the show's chief writer and one of its co-creators. \"It's very different when these are 2- to 5-year-old children you're talking about. Steve has become someone they trust, someone they almost have a play date with and go on adventures with, and thinking he might not be there anymore is really upsetting to them . . . It's like losing a caregiver.\"", "The easy answer about why this rumor took hold would be to pin it on society's distrust of children's hosts, as expressed in rumors about these nice, smiling men not being all they seem. (Such a theme shows up in the Uncle Don and Mr. Rogers legends.)  Yet it might all be a lot simpler than that.", "In the same year he began with Blue's Clues, Burns put in an appearance on the popular TV show  Law and Order. In the episode \"Cruel and Unusual\" (original air date 19 April 1995), he played Kevin Jeffries, an apparently drugged-out kid who died while in police custody. It's possible the current rumor has its roots in someone's seeing \"Steve of Blue's Clues\" die, albeit on a completely different TV show. This sort of confusion would also explain the recurring theme of a heroin overdose rather than some other manner of death's being associated with him. The role he played on Law and Order was one of an autistic young man who died after police mistakenly attributed his strange behavior to drug use.  To children unable to fully distinguish between an actor and his television role, seeing or hearing Steve \"die\" on one television program could lead to a belief that the actor himself had died.", "In January 2001, Steve Burns chose to leave Blue's Clues after a five-year run as its host, and the show's producers announced his character would be replaced on the show by Steve's \"brother\" Joe, played by actor Donovan Patton.  The new host was slowly phased in (episodes featuring Steve Burns continued to air until Donovan Patton made his debut in April 2002) until Burns took his final leave of viewers to pursue other opportunities:", "Burns left Blue’s Clues in 2002. He has explained that he left in part simply because he felt it was time to move on. He also wanted to pursue his career in voice-over artistry. Burns has also cited burn out as one of the reasons he decided to make his exit.", "There is a funny side to Burn’s exit as well. At the time of his departure, he had started to go bald. He despised the idea of wearing a wig picked out by the people who forced him to wear a striped rugby shirt and khaki pants on television every day.  And so, he left to keep his integrity intact.", "Steve’s character was eased out of the show gradually not to upset or confuse young viewers. Steve was replaced by his younger brother, Joe (played by Donovan Patton). The show aired a three-part special where Joe came to the house to learn to play Blue’s Clues. Steve told viewers he was going to college and packed to leave. Joe took over playing ‘Blue’s Clues’ with the children and Blue and when Steve said goodbye, he thanked the children for helping him grow.", "Laswell, Mark.   \"TV Confidential 2.\"\r\n    TV Guide.   24 July 1999   (p. 19).", "Mifflin, Lawrie.   \"TV Notes: Blues Clueless.\"\r\n    The New York Times.   24 March 1999   (p. E7).", "Oldenburg, Ann.   \"Get a Clue: Host of Blue's Neither Dead Nor Drugged.\"\r\n    USA Today.   18 December 1998    (p. E3).", "The Houston Chronicle.   \"Host Says Goodbye, Leaves His Dog Blue.\"\r\n    USA Today.   4 January 2001    (p. A2).", "Library of Curious and Unusual Facts: Manias and Delusions.\r\n    Virginia: Time-Life Books, 1992.   ISBN 0-8094-7731-9   (pp. 30-31).", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]