["A photograph where Muslim men can be seen with the Atharva Veda has been shared with the claim that they are altering Hindu scriptures. The claim further suggests that 20 years hence, next generations will not be able to read the Vedas, Puranas and Upanishads in the original form. A post by Facebook page Vastavik Bharat has received more than 2,800 shares.", "[Translated from; देखो और ध्यान दो और क्या हो रहा है हमारे देश में. क्या ये हमारे धर्म ग्रंथों में मिलावट करने का कार्य हो रहा है. क्या आने वाले 20 साल बाद हमारी अगली पीढ़ियां ये #मिलावटी वेद, पुराण, उपनिषद पढ़ेंगे.]", "The picture is viral on Facebook with people talking about Hindu scripture being changed.", "Identical claim is floating on Twitter.", "देखो और ध्यान दो और क्या हो रहा है हमारे देश में 🤔🤨🤨🤨🤨🤨हमारे धर्म ग्रंथों में मिलावट करने का कार्य जोरों से चल रहा है,,,, 🙄🙄🙄", "आने वाली 20 साल बाद हमारी अगली पीढ़ियां ये #मिलावटी वेद ,पुराण , उपनिषद पढ़ेंगे। ,,,", "जिसमें लिखा होगा चरित्र निर्माण बेकार की बात है🦹 pic.twitter.com/ZJk8zxfC7C", "— Rï†wïk §ïñgh ।धर्मार्थम् हिंसा परमो धर्मः। (@RAJPOOT_HUNK) July 21, 2020", "A reverse-image search led us to a 2014 report in The Hindu which described the image as, “Students at Al Mahadul Aali Al Islami studying the Vedas to understand the common attributes in Islam and Hinduism. This seminary has more than 1000 books on other religions at Hyderabad.” The photograph is credited to G Ramakrishnan.", "We contacted Al Mahadul Aali Al Islami institute for more information on the photo. Deputy Director Mufti Omar Abedeen told us that this picture was shot in their library and is several years old. “We have a department called ‘Mutalaya Mizahid’ which means ‘Studies of Faiths’ where students are taught not only about Hinduism but also about other religions like Christianity and Sikhism. We have been doing this work for almost 20 years. We also invite scholars of other religions to teach so that the students get the best understanding of every religion.”", "Therefore, a 6-year-old image of Muslim students studying Hinduism was shared with the false claim that they are tampering with Hindu scriptures.", "Donate Now", "Priyanka Jha specialises in monitoring and researching mis/disinformation at Alt News. She also manages the Alt News Hindi portal.", "A purported video of a Muslim man beating a temple priest with a bat is…", "A picture depicting the Pakistani flag apparently bigger in size and apparently placed higher than…", "Amid the ongoing war between Israel and Hamas, a video of a fleet of cars…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "A clip featuring Pakistan men’s Cricket team captain Babar Azam is viral on social media…"]