["About this rating", "On 11 February 2017, a web site operating under the names \"Health and DIY Tips\" or \"Daily Tips\" falsely claimed that several brands of baby wipes were recalled in January 2017, and that the products posed a serious risk:", "Ten brands of baby wipes produced by the Pennsylvania-based Nutek Disposables, Inc., were recalled on January 25, 2017, following complaints of foul odor and discoloration.", "Upon further testing, the baby wipe and adult washcloth manufacturer discovered that some of their products contained Burkholderia cepacia, a species of antibiotic-resistant bacteria frequently found in soil and water, according to the U.S. Centers for Disease Control and Prevention (CDC).", "Known for its vinegar-like odor, B. cepacia has emerged as a human respiratory pathogen in people with weakened immune systems or chronic lung disease, especially cystic fibrosis patients.", "Pulmonary infections involving these bacteria are capable of causing accelerated decline in lung functions and can induce “cepacia syndrome,” a progressive form of pneumonia that can be fatal and untreatable, according to MicrobeWiki.", "The site specifically said that the wipes were recalled on 25 January 2017, but its content closely matched an October 2014 Food and Drug Administration (FDA) press release about to an obsolete but nearly identical recall:", "Nutek Disposables, Inc. of McElhattan, PA has initiated a nationwide voluntary product recall at the retail level of all lots of baby wipes that it manufactured under the brand names Cuties, Diapers.com, Femtex, Fred's, Kidgets, Member's Mark, Simply Right, Sunny Smiles, Tender Touch, and Well Beginnings, because some packages may contain bacteria. These wipes were distributed by Nutek prior to October 21, 2014 to the following retail stores: Walgreens, Sam's Club, Family Dollar, Fred's, and Diapers.com.", "After receiving a small number of complaints of odor and discoloration, Nutek conducted microbial testing that showed the presence of a bacteria, called Burkholderia cepacia (B. cepacia), in some of these products. Soon after, on October 3, 2014 the company initiated a voluntary withdrawal of lots that had tested positive for the bacteria, as well as other baby wipes in the surrounding time frame. After some additional lots were tested, as a precautionary measure, Nutek believed it was a prudent decision to withdraw all its baby wipe products.", "On Twitter, Sam's Club (a retailer mentioned prominently in the claim) repeatedly promoted baby wipes in February 2017. No mention of any sort of recall was made in 2017 or 2016 by the account; in 2015, the brand advised a customer that there was no baby wipes recall:", "@SarahRaphael At this moment there is no active recall for Member's Mark baby wipes. Thank you for asking and have a great day!", "— Sam's Club (@SamsClub) July 10, 2015", "The Consumer Product Safety Commission did not have any January 2017 wipes recall notices on its site. A wipe warmer was recalled in August 2016, but the notices were clearly unrelated to the claim of a January 2017 baby wipes recall.", "We contacted Nutek on 1 March 2017, and a company representative described the circulating baby wipes recall rumor as simply a scam. No recall notice was distributed by Nutek about several brands of baby wipes in January 2017, and the wording for the viral rumor appears to have been stolen from an October 2014 Food and Drug Administration press release and updated just enough to ensure clicks and shares on social media.", "FDA Recalls.   \"Nutek Disposables, Inc. Issues Alert Due To Potential Bacteria In Baby Wipes.\"\r\n    25 October 2014.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]