["GOP Senate candidate Ed Gillespie says Obamacare won’t help you grow old.", "\"It’s a law that cuts seniors’ Medicare,\" Gillespie said in a campaign email listing reasons why  he opposes the health care law.", "This is a well-traveled claim that PolitiFact has met frequently over the years. Paul Logan, Gillespie’s campaign spokesman, backed up the statement, in part, with blurbs from fact checks written by our colleagues in two other PolitiFact bureaus.", "He pointed to a 2013 PolitiFact National article examining a claim by Scott Brown -- the Republican U.S. Senate nominee in New Hampshire -- that Obamacare \"raises taxes and cuts Medicare.\"", "PolitiFact rated the two-pronged statement Mostly True, saying the law \"definitely raises taxes,\" to help pay for its costs. But our colleagues also said the claim that Obamacare cuts Medicare is a complicated issue that undercut the accuracy of Brown’s full claim.", "PolitiFact has looked askance at bare statements that Obamacare cuts Medicare, rating them either Half True or Mostly False depending on how they are worded.", "Obamacare, to help cover its costs, also imposed a series of savings. Among them are measures that will reduce the increase in Medicare by $716 billion from 2013 to 2022, according to a Congressional Budget Office estimate. It’s important to note that Medicare spending will continue to rise, but at a slower pace than they it would have without the law. And the savings are focused on lowering payments to hospitals and insurance companies -- not beneficiaries.", "Gillespie’s says that Obamacare cuts \"seniors’ Medicare.\" That suggests the law isn’t just reducing Medicare spending but is actually slicing Medicare benefits.", "To support that line of reasoning, Logan pointed to a couple of PolitiFact articles in which experts suggested that the reduced payments the law calls for could affect patients’ access to services.", "PolitiFact Wisconsin noted in October 2012 concerns that slowing growth in Medicare payments might discourage some health care providers from accepting Medicare patients. One area of concern is the Medicare Advantage program, which is run by private insurers and offers greater benefits than traditional Medicare for things such as dental care, free eye glasses and gym memberships.", "About 30 percent of the 54 million Medicare beneficiaries in the U.S. are enrolled in those plans, according to Kaiser Family Foundation estimates.", "Those privately run plans cost more per beneficiary than traditional Medicare, and Obamacare  seeks to even out those costs. Some health care analysts have said the law’s Medicare Advantage cost savings might lead to its enrollees’ paying higher premiums or losing some of their extra benefits", "On the other hand, Gillespie does not mention that the health care law actually adds some new services: It gradually closes that gap in Medicare prescription drug coverage known as the \"doughnut hole,\" funds illness prevention benefits and expands preventative care benefits.", "Logan also referred us to statements issued by for former U.S. Sen. Jim Webb, D-Va. In March 2010, Webb said said Obamacare would make \"dramatic cuts in Medicare\" and lamented the reductions in Medicare Advantage.", "Here’s a quick note on the timing of Gillespie’s email. Logan told us it was originally sent in January and was resent by the campaign on Aug. 25 after the Daily Press in Newport News -- which published a weekly PolitiFact Virginia digest --signed up recently to get automated email updates from the campaign.", "\"Unless you want to single out that particular signup, it would be more accurate to refer to it as a January email rather than an Aug. 25 email,\" Logan said.", "Because the email is part of the campaign’s ongoing communications about Obamacare -- one that the Gillespie campaign feels free to resend -- we think it’s fair to judge it as a current line of attack from Gillespie’s campaign on the law.", "Our ruling", "Gillespie says Obamacare \"cuts seniors’ Medicare,\" a statement that implies the law is reducing benefits across the board.", "There’s debate among analysts over how the law’s cost savings measures will impact some beneficiaries, particularly seniors enrolled in Medicare Advantage plans run by private insurers. Some of those seniors -- who comprise about 30 percent of Medicare recipients -- may lose some of the extra benefits they had before the law or could see higher premiums.", "Overall, the health care law slows Medicare’s growth, but spending will still rise significantly and some new services for seniors were added. So we rate Gillespie’s statement Mostly False.", "Ed Gillespie’s campaign email, \"I fought to stop it,\" Aug. 25, 2014.", "E-mail from Paul Logan, spokesman for the Ed Gillespie campaign, Aug. 27, 2014.", "Congressional Budget Office letter to John Boehner, July 24, 2012.", "Kaiser Family Foundation, \"Summary of key changes to Medicare in 2010 health reform law,\" April 29, 2010.", "Kaiser Family Foundation, \"Health reform and Medicare: Overview of key provisions,\" 2010.", "Kaiser Family Foundation, \"Repealing the Affordable Care Act: Implications for Medicare spending and beneficiaries,\" Sept. 10, 2012.", "PolitiFact, \"The health care law raises taxes and cuts Medicare, says Scott Brown,\" Nov. 3, 2013.", "PolitiFact Florida, \"Rick Scott says Medicare rate cuts will affect seniors’ ability to keep their doctors, hospital and prevention services,\" March 3, 2014.", "PolitiFact Florida, \"Bill Young says he opposed $716 billion Medicare cut,\" Oct. 30, 2012.", "PolitiFact Wisconsin, \"Thompson says Baldwin voted to ‘gut’ Medicare,\" Oct. 21, 2012.", "PolitiFact, \"James Capretta says Obamacare is a ‘massive income redistribution,’\" Dec. 5, 2013.", "PolitiFact, \"Obama claims Medicare benefits will not be cut under the health care bill,\" Aug. 14, 2009.", "PolitiFact, \"Medicare ‘cuts’ in the health care law will hurt seniors, says 60 Plus Association,\" Sept. 20, 2010.", "Washington Post, \"Fact-checking Bill Clinton on Medicare,\" Sept. 6, 2012.", "Kaiser Health News, \"Decoding the $716 billion in Medicare reductions,\" Aug. 17, 2012.", "Kaiser Health News, \"Impact of Medicare Advantage cuts on seniors sharply disputed,\" Feb. 23, 2014.", "Kaiser Health News, \"Obama administration proposes a 1.9 percent cut in Medicare Advantage payments,\" Feb. 24, 2014.", "PolitiFact, \"Paul Ryan said President Obama ‘funnelled’ $716 billion out of Medicare at the expense of the elderly,\" Aug. 29, 2012.", "PolitiFact, \"Romney says Obama ‘cuts’ $716B from Medicare to pay for Obamacare,\" Aug. 20, 2014.", "PolitiFact Virginia, \"American Crossroads says Tim Kaine urged $500 billion in Medicare cuts,\" June 20, 2012.", "Kaiser Family Foundation, \"Medicare Advantage Fact Sheet,\" May 1, 2014.", "National Journal, \"Study: Cuts to Medicare Advantage top $1,500 per senior,\" April 17, 2014.", "The Washington Post, \"Obama administration reverses proposed cuts to Medicare plans,\" April 7, 2014.", "PolitiFact, \"Will Obamacare hurt Medicare Advantage?\" Aug. 19, 2013.", "FactCheck.org, \"Misleading onslaught by 60 Plus,\" Sept. 17, 2010.", "The Heritage Foundation, \"Obamacare’s impact on seniors: An update,\" Aug. 20, 2013.", "Forbes, \"How Obamacare’s $716 billion in cuts will drive doctor out of Medicare,\" Aug. 20, 2012.", "Department of Health and Human Service, \"Key features of the Affordable Care Act by year,\" accessed Sept. 3, 2014.", "Department of Health and Human Services, \"Estimated savings of $5,000 to each Medicare beneficiary from enactment through 2022 under the Affordable Care Act,\" September, 2012.", "Kaiser Health News, \"Obama administration retreats on private Medicare rate cuts,\" April 8, 2014.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]