["A few images, allegedly of Indian soldiers at sub-zero temperature, has been shared on social media. In the photos, the men are seen sleeping and standing guard under a blanket of snow.", "The post below was made on the Facebook page ‘बुलंद भारत की बुलंद आवाज़‘ and has 24,000 likes.", "The same images were shared in 2020 with users claiming that they show Indian soldiers at Siachen glacier, located on the eastern side of the Himalayas. Retired IG BN Sharma tweeted a collage with the same claim. It had received more than 2,900 retweets at the time of writing. (Archive link)", "One of theost Harshest conditions on this planet, soldiers facing at the highest battlefield Siachin. Other high altitude areas along LC and LAC are no different except the temperature is few celcius higher. Jai Hind Ki Sena pic.twitter.com/soAvUyBCuC", "— 🇮🇳 BN Sharma, IG (Retd) (@BholaNath_BSF) December 19, 2020", "Arun Pudur was one of the users who retweeted the post. Pudur has shared misinformation on social media several times in the past that can be read here.", "Facebook page ‘Police News – English’ also shared the image and accompanying claim. (Archive link)", "One of theost Harshest conditions on this planet, soldiers facing at the highest battlefield Siachin. Other high…", "Posted by Police News – English on Saturday, December 19, 2020", "In December 2017, Alt News published a fact-check report on the viral photo when BJP MP Kirron Kher had tweeted it. Alt News found that these photos were actually of the Russian army. The original images were first shared in 2013 according to StopFake’s December 2014 fact-check report.", "Upon further research, we found the pictures in a 2012 article by a Russian website.", "This slideshow requires JavaScript.", "Fact-checking website SMHoaxSlayer had also published a fact-check report on this collage back in December 2016.", "Therefore, pictures of Russian soldiers sleeping in the snow are at least eight years old and are repeatedly circulated on social media as Indian soldiers.", "In December 2017, Bollywood actress Shraddha Kapoor also shared the collage on Twitter. Despite being informed of the truth, her tweet is accessible as of this writing. (Archive link)", "They freeze to make sure that we are warm. They protect to make sure that we feel safe. Can never thank you Jawaans enough. pic.twitter.com/z1Df4sw0dA", "— Shraddha (@ShraddhaKapoor) December 17, 2017", "Apart from this, Facebook page ‘Laughing Colors’ also posted the image in a now-deleted post. The page has previously shared false news on multiple instances. Read Alt News’s in-depth report on the page.", "Donate Now", "Kinjal Parmar holds a Bachelor of Science in Microbiology. However, her keen interest in journalism, drove her to pursue journalism from the Indian Institute of Mass Communication. At Alt News since 2019, she focuses on authentication of information which includes visual verification, media misreports, examining mis/disinformation across social media. She is the lead video producer at Alt News and manages social media accounts for the organization.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]