["“Nevada just decided to stop counting ballots until THURSDAY. What the he** is going on in America!?” reads a November 4, 2020 tweet by Evan Kilgore, who describes himself as a conservative political commentator and has more than 78,000 followers.", "“We did not stop counting ballots at all,” Jennifer Russell, public information officer for the Nevada secretary of state’s office told AFP on November 4.", "“Counties are busy counting today” and will not be stopping to update online results, with the possible exception of Washoe and Clark counties, Russell explained by phone.", "She said that frequent pauses to update results interrupt and delay the process, and the counties “just need to be counting today.”", "Russell said the confusion likely resulted from a Nevada elections division tweet announcing that result updates -- but not ballot counting -- would be paused until the morning of November 5.", "In Nevada, one of the most contested states in the presidential race, mail ballots that will be received over the next week and provisional ballots are still left to be counted.", "Kilgore’s claim is part of a larger pattern of right-wing distrust of the American voting process.", "Trump, who overnight prematurely declared himself the winner of Tuesday's election, has spent months denouncing mail-in ballots, making unsubstantiated claims that they are liable to fraud.", "AFP has debunked additional false and misleading claims about Election Day here, here and here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]