["“There are tens of thousands of rejected mail-in ballots in DeKalb County, GA where we are locked in a battle for the state’s electoral votes. The number is as high as 40,000,” says a November 4 Facebook post.", "“Here’s the thing: The errors can be CURED, but that has to happen by Friday or they will be tossed (mismatch signature, etc.),” the post says.", "With Donald Trump and Joe Biden locked in a close race for the White House, Georgia has become a battleground state and it looks like being decided by a razor-thin margin.", "The claim of a large number of ballots with problems in DeKalb County also appears on Facebook here and Instagram here and here. But it is false.", "“Voters: there is incorrect info circulating regarding the number of DeKalb ballots that need to be cured by Friday,” the DeKalb County Board of Registration and Elections tweeted on November 4.", "“Currently, there are approximately 200 ballots that need to be cured and each voter is being contacted via phone or overnight mail,” it said.", "The board did not answer a call seeking an updated figure on November 5.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]