["About this rating", "Did a photographer capture an owl's wh-O Face?", "An image showing an owl with a funny facial expression went viral in October 2017 after an alleged \"Owl Expert\" claimed that the image showed the animal experiencing an orgasm:", "\"Dr. Owl\" is not an owl expert. Considering the majority of women fake orgasms at one time or another, we are skeptical that this fake ornithologist would be able to identify this owl's o-face even if he were the one ruffling its feathers.", "This Twitter account was barely a month old when it made the \"owl orgasm\" claim. This account started by posting political content under the handle \"@USdotard\" and the username \"Mentally Deranged\", a reference to the phrase North Korean leader Kim Jong-Un used to insult President Trump:", "When the twitter account failed to gain traction posting political content, @USdotard changed their username to \"Dr Owl\" and claimed that this photograph showed an owl orgasming.", "We searched for the origins of this photograph but were unable to find any details about where or when this picture was taken. However, it has been circulating since at least 2014. It is frequently included in galleries featuring \"unflattering\" images of animals and has been accompanied by dozens of different funny captions humorously asserting that this image represented various emotional states, such as:", "Here's a sampling of some of the memes that have been created with this image:", "This funny looking photograph has been the basis for dozens of owl jokes over the years. Although the claim that this image showed an owl orgasming came from a Twitter account posing as an \"owl expert,\" this claim was simply made in jest.", "Scientists don't really know if about the pleasure levels of animals during sex. It's a bit hard to say, actually.", "\"The short answer is that we don't know much about orgasms in other species — in fact, scientists are still studying the significance/evolution of female orgasms in humans,\" Marlene Zuk, a professor of ecology, evolution and behavior at the University of Minnesota, told us.", "So what is this owl actually doing? As we have yet to determine the original source of this photograph, we can't say exactly what this owl was doing when the photograph was taken. However, it seems that this image simply shows an owl blinking. Owls have three eyelids, including a nictitating membrane that closes diagonally across the eye:", "To protect their eyes, owls are equipped with 3 eyelids. They have a normal upper and lower eyelid, the upper closing when the owl blinks, and the lower closing up when the owl is asleep. The third eyelid is called a nictitating membrane, and is a thin layer of tissue that closes diagonally across the eye, from the inside to the outside. This cleans and protects the surface of the eye.", "If you are still curious about what it looks like when owls mate, well, you're in luck. Shortly after this article was published, Karla Bloem, the Executive Director of the International Owl Center in Houston, Minnesota, reached out to give us some additional information about the mating rituals of great horned owls.", "Although Bloem said that she certainly did not know if owls had orgasms, she agreed that the owl pictured above was likely blinking its nictitating membrane when the photograph was taken:", "I have been breeding Great Horned Owls to study their vocal development for 7 years and have seen them copulate hundreds of times. Although we certainly don't know for sure if owls have orgasms, in Great Horned Owls the male lands on the female's back, wraps his tail under her tail so their cloacae can touch (the all purpose in/out door for everything including sperm), and he produces a long, squealing chitter if copulation is successful.", "Here is a video from the back:", "From the front, showing facial expressions from the front:", "If there is indeed such a thing as an orgasm in owl copulations, it would be when the squeal occurs. In this case the male is on the female's back, leaning forward and often sort of biting the nape of the neck of the female. The owl in the photo is not in the proper posture for a male during copulation, nor a female with a male on her back.", "Instead this owl appears to be finishing up swallowing something and blinking its nictitating membranes, which give the opaque bluish color.", "Ramzy, Austin.   \"Kim Jong-un Called Trump a ‘Dotard.’ What Does That Even Mean?\"\r\n    The New York Times.   22 September 2017.", "Lewis, Deane.   \"Owl Eyes & Vision.\"\r\n    Owl Pages. 25 June 2015.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]