["About this rating", "Germany's 16 federal states have the authority to detain repeated offenders of COVID-19 quarantine regulations. At the time of this reporting, four states have plans to use existing spaces as potential quarantine detention centers. In two cases that facility is on the grounds of a refugee center; in another, the facility is on the grounds of a juvenile detention center.", "However, the use of these facilities, at the time of this reporting, is largely theoretical. In theory, they would be reserved only for extreme cases involving repeat offenses. A majority of German states have no plans for the creation of quarantine violation detention centers, according to recent reporting.", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "In Germany, the Infectious Diseases Protection Act, a law amended several times since the onset of the COVID-19 pandemic in March 2020, provides authorities with a variety of legal tools aimed at halting the spread of the virus. Though listed as an option of last resort, the act allows for the segregation of sick individuals. In theory, according to experts, this law could possibly be used to force repeated quarantine violators into isolation. In January 2021, several papers reported on plans to draw up laws and policies to crack down on such cases at the state level.", "On Jan. 17, 2021, the German Sunday paper Welt am Sonntag contacted officials in each German state to see if they actually had plans to create or use a facility to segregate quarantine breakers from the rest of the population. In their survey, four of the 16 German states had some sort of plan in place for that possibility. That report spawned headlines and commentary in English-language media markets suggesting comparisons to Nazi Germany's use of concentrations camps.", "Most of the states contacted by Welt am Sonntag, however, told the paper they did not have plans to make or use such a detention facility. Four states did respond to say that they had plans in place to use or create a facility to detain repeated offenders: Baden-Württemberg, Brandenburg, Saxony, and Schleswig-Holstein. The largest of these facilities would have the capacity to hold only nine detainees, and only people who had repeatedly and flagrantly violated COVID-19 laws would be sent there.", "According to Welt, Baden-Württemberg will soon have central facilities at two hospitals that could be guarded to segregate repeat quarantine breakers. According to the English-language German outlet DW, though, the Baden-Württemberg plan \"is still being negotiated, and it is unknown if and when the accommodation will be opened.\"", "According to reports in Metro, the facilities planned for both Brandenburg and Saxony would be on the grounds of existing refugee centers. Officials in Saxony told Welt that, while they had previously used a hospital room for repeated offenders, they were looking for a facility with suitable medical care that could be guarded by police that did not take up valuable hospital beds.", "In Schleswig-Holstein, repeat quarantine breakers may be held in an \"unused annex of a juvenile detention center\" that has six rooms, according to DW. Detainees would \"be allowed televisions, laptops, phones and other domestic comforts\" and \"psychological support is also available,\" they reported. \"The rooms themselves have a comfortable bed and space to walk around.\" DW reported that being detained there would be an extreme last resort:", "In order to receive a \"sentence,\" people must repeatedly refuse to quarantine at their homes — whether after travel, because of a high-risk contact or a positive test result — and there must be evidence that they broke quarantine. Then police will visit their home, and a fine may be handed out. Only after that, with a court order, can they be sent to the accommodation at Neumünster.", "Because there are plans —  or at least contingency plans — to house repeat COVID-19 quarantine breakers in facilities that historically have been either detention and refugee centers, headlines like the New York Post's \"German Quarantine Breakers to be Held in Refugee Camps, Detention Centers\" are narrowly accurate, but potentially misleading. There are no nationwide plans for the detention of these individuals, and only four states out of 16 are even considering such a move. The largest of these planned facilities would have just nine beds. Only egregious repeated offenders would be considered for such a detention. For these reasons, we rank the truth of this claim as a \"Mixture\"", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]