["“MEDICAL SHOCKER: Scientists at Sloan Kettering discover mRNA inactivates tumor-suppressing proteins, meaning it can promote cancer,” reads the headline of a March 2, 2021 article, which also appears on this site.", "The article calls on “independent laboratories” to test Covid-19 vaccines “and find out if these are cancer-driving inoculations that, once the series is complete, will cause cancer tumors in the vaccinated masses.”", "It was published on Natural News, a website known for pushing false claims that was banned from Facebook in 2019 and now uses alternative URLs to evade detection. AFP Fact Check has already debunked several of its claims, including about vaccine ingredients and the flu vaccine.", "The bottom of the article includes a link to a 2018 announcement from the Memorial Sloan Kettering Cancer Center about the study.", "Jeanne D’Agostino, a spokeswoman for the cancer center, told AFP in an email that “this article circulating is categorically false, misrepresents the findings of our study and draws incorrect conclusions about vaccine risks.”", "The Sloan Kettering announcement said researchers found “that changes in an information-carrying molecule called messenger RNA can inactivate tumor-suppressing proteins and thereby promote cancer. The findings pinpoint previously unknown drivers of the disease.”", "In an update, it emphasized “that mRNAs are a normal component of all cells and the specific ones discussed here are not involved in mRNA-based vaccines, like the one developed against SARS-CoV-2,” the virus that causes the Covid-19 disease.", "More than seven percent of Canadians have received at least one dose of a Covid-19 vaccine, while 116 million total doses have been administered in the United States.", "Several Covid-19 vaccines are being administered or are in trials around the world. In December, the Pfizer-BioNTech shot using mRNA technology was authorized in the United States and Canada, followed by Moderna’s mRNA vaccine.", "The mRNA shots are the first to use the cutting-edge messenger ribonucleic acid technology, which differs from that of regular vaccines. Instead of confronting the immune system with part of a virus in a weakened or deactivated form to build antibodies, it introduces a “blueprint” of the spike protein, part of the virus that the body can then recognize and fight if it encounters it later.", "Medical experts confirmed that the study -- which was published in Nature in August 2018, more than a year before the start of the Covid-19 pandemic -- had nothing to do with mRNA vaccines developed to protect against the disease.", "Brian Lichty, associate professor with the Department of Pathology and Molecular Medicine at McMaster University, said in an email that the Natural News article “is a completely erroneous interpretation of the scientific report they refer to.”", "To understand the study, he said one must first understand the process of transcription, or how a cell copies a specific gene into messenger RNA (mRNA).", "Messenger RNA, just one type of RNA found in a cell, is a single-stranded molecule complementary to one of the DNA strands of a gene and plays a vital role in the synthesis of proteins, which enable the body to work. “Translation machinery” binds to mRNA to read its genetic code and make a specific protein.", "Lichty explained that, according to the study, “in a certain type of leukemia, this process is deranged such that transcription yields an inaccurate mRNA,” and certain proper tumor-suppressing proteins may not be correctly made, contributing to leukemic cells.", "“The problem in the cancerous cell is an error in transcription.The problem is not that ‘mRNA can cause cancer,’” he said.", "Paul Hamel, a professor at the University of Toronto’s Department of Laboratory Medicine and Pathobiology, agreed that the Natural News article “completely misrepresents the remarkable findings that were published in the Nature paper.”", "The findings pointed to a need to look past DNA to understand what causes cancer, according to Sloan Kettering, and Hamel said the study showed holes in the ways researchers were screening cancer-causing genes in patients.", "Both experts confirmed that the study does not address mRNA shots such as those from Pfizer or Moderna.", "The research findings have “nothing to do with the current mRNA vaccines in use,” according to Lichty.", "“These vaccines consist of an mRNA that has been synthesized in a production facility,” he said, adding that because the mRNA is already made, there is no opportunity for error in transcription.", "“It only encodes for the coronavirus protein,” he said.", "Hamel agreed that study findings had “nothing to do with how the RNA vaccines work or what the RNA in the vaccines actually do... There really is no relationship between what was described in the paper and the RNA in these vaccines.”", "Here is how mRNA vaccines work:", "AFP Fact Check previously debunked numerous false or misleading claims about Covid-19 vaccines.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]