["About this rating", "H.R. 6666 creates grants for health care, school-based, academic, and nonprofit entities to run mobile testing sites and hire staff to perform diagnostic tests and contact tracing.", "The bill does not require participating entities to \"only allow people into their facilities that have the COVID-19 vaccination [and] are tested and tracked.\"", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "On May 1, 2020, U.S. Rep. Bobby Rush of Illinois introduced the Testing, Reaching, and Contacting Everyone (TRACE) Act to the U.S. House of Representatives, a piece of legislation that was assigned the ominous-sounding number H.R. 6666. The intent of H.R. 6666, as summarized on GovTrack, is as follows:", "This bill would provide $100 billion in grants to faith-based organization, clinics, medical centers, and other organization which perform testing for COVID–19, tracing of exposure to COVID–19, or services for individuals who are isolating at home. The funding could be used to pay their staff or purchase personal protective equipment to protect their staff.", "No provision in this bill would make testing or quarantining mandatory. The bill includes privacy protections for the medical information of individuals that would limit how grantee organizations could share information collected with the federal government.", "A popular meme asserted that the substance of H.R. 6666 would give $100 billion to \"schools, churches, and medical buildings,\" and that \"they only way they can receive the money is to agree by contract that they will only allow people into their facilities that have the COVID-19 vaccination [and] are tested and tracked\":", "The text of the bill does allow for an appropriation of up to $100 billion for fiscal year 2020 to award grants to \"eligible entities to conduct diagnostic testing for COVID–19, and related activities such as contact tracing, through mobile health units and, as necessary, at individuals’ residences, and for other purposes.\" Eligible entities include federally qualified health centers, school-based health clinics, disproportionate share hospitals, academic medical centers, nonprofit organizations (including faith-based organizations), institutions of higher education, and high schools.", "However, the bill text makes no reference to any contractual terms requiring qualifying entities to \"agree that they will only allow people into their facilities that have the COVID-19 vaccination [and] are tested and tracked.\" In fact, such a requirement would be impossible to satisfy, as no COVID-19 vaccine yet exists.", "One of the services covered by the grants is contact tracing, which, as explained by the CDC, involves the following:", "Contact tracing is part of the process of supporting patients with suspected or confirmed infection.", "In contact tracing, public health staff work with a patient to help them recall everyone with whom they have had close contact during the timeframe while they may have been infectious.", "Public health staff then warn these exposed individuals (contacts) of their potential exposure as rapidly and sensitively as possible.", "To protect patient privacy, contacts are only informed that they may have been exposed to a patient with the infection. They are not told the identity of the patient who may have exposed them.", "In short, the Act would, if passed (it currently sits in the House Committee on Energy and Commerce), create grants for health care, school-based, academic, and nonprofit entities to run mobile testing sites and hire staff to perform diagnostic tests and contact tracing. It doesn't include any additional or hidden contractual terms.", "GovTrack.   \"H.R. 6666: COVID-19 Testing, Reaching, and Contacting Everyone (TRACE) Act\"\r\n    Accessed 11 May 2020.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]