["The image has been shared almost 300 times since it was posted on Facebook here on February 25, 2021.", "The image shows Sara Duterte, who is currently the mayor of Davao City, reading a newspaper with a purported headline that reads: \"Sara in 2022\".", "The Facebook post’s caption reads in part: \"Our next President... We will not allow the good deeds of (President Rodrigo Duterte) to go to waste, and only Mayor Sara can continue this genuine change.”", "The image circulated as banners urging Sara Duterte to run for president in 2022 began being seen throughout the country, as noted by Philippine Daily Inquirer here and Philippine News Agency here.", "President Duterte is set to finish his six-year term in 2022 and cannot run for reelection, as per Philippine law.", "The image was also shared alongside similar claims on Facebook here, here and here; and on YouTube here.", "However, the claim is false.", "A reverse image search on TinEye found that the image has been doctored. The original photo was published here by The Philippine Star on February 25, 2018 and shows a headline that reads: “Speaker Sara in 2019?”", "The original article — seen on the Star’s website here and here on February 24, 2018 — reports on Sara Duterte’s choice to run for reelection as mayor of Davao City in the 2019 midterm elections or seek a congressionals seat, which would make her eligible to serve as speaker of the House of Representatives. She chose the former and was reelected mayor.", "Below is a screenshot comparison of the doctored image (L) and the original photo published by The Philippine Star in 2018 (R):", "As of March 1, 2021, Sara Duterte has not made any formal announcement regarding a 2022 presidential bid.", "The misleading post was also debunked by Philippine news organisation Rappler.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]