["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Pro and con, about a dozen speakers came forward last month when the House of Delegates  Commerce and Labor Committee invited comment on bills to raise Virginia’s minimum wage.", "Robin Gahan, the director of programs at the Virginia Interfaith Center for Public Policy, urged an increase, saying families can’t get by on the bottom rate of $7.25 an hour, which is also the national floor.", "\"In 1968, a full-time worker earning minimum wage could actually support a family of three above the poverty line,\" Gahan said. \"Today, that same worker would earn less than the poverty line for a family of two.\"", "The Republican-controlled committee went on to kill three bills this winter that would have increased the minimum wage, maintaining that raising the rate would force employers to cut jobs. But the issue remains alive in Washington, where the U.S. Senate this spring is expected to vote on legislation that would raise the national minimum wage to $10.10 an hour.", "So we looked into the Interfaith Center’s claim.", "Gahan pointed us to a December 2013 report by the Economic Policy Institute, a liberal think tank that advocates boosting the wage. A graph measures the minimum wage over the years against household poverty levels.", "In 1968, the minimum wage for most workers was $1.60 an hour. An employee working at that rate for 40 hours a week, 52 weeks a year, would have earned $3,328. That was above the poverty thresholds that year for a three person-household: $2,817 annually for a home headed by a man and $2,516 for a home headed by a woman.", "The minimum wage was bifurcated back then, however, and a small group of employees -- including workers at schools, public hospitals, laundries, hotels and motels -- could be paid as little as $1.15 an hour. Those employees, working full time every week of the year, would have earned $2,392 annually and fallen below the poverty line for a three-person household.", "Congress ended the dual minimum wages in 1978.", "Now, let’s move forward to modern times.", "The $7.25 hourly minimum was established in 2009. A full-time minimum wage earner makes $15,080 a year. That falls slightly below the average 2013 poverty threshold for a family of two, which is $15,156.", "There are a few details about all these numbers that should be noted:", "Our ruling", "There’s a slight snag in the first part of the Virginia Interfaith Center’s claim that, in 1968, a full- time minimum wage earner could support a household of three above the poverty line. The wage was bifurcated then. The majority earning $1.60 an hour could support a family of three, but a small group of workers qualifying for $1.15 an hour would have lived below the poverty line", "The second part of the center’s claim -- that a full-time worker today could not raise a family of two on the minimum wage of $7.25 an hour -- holds up.", "Clearly, the buying power of the minimum wage has decreased in recent decades. The center tried to illustrate that point with a statement that is accurate but needs a little clarification. So we rate its claim Mostly True.", "Comments by Robin Gahan, the director of programs at the Virginia Interfaith Center for Public Policy, before the Virginia House Commerce and Labor Committee, Feb. 4, 2014.", "E-mail from Robin Gahan, Feb. 18, 2014.", "Economic Policy Institute, \"Raising the federal minimum wage to $10.10 would give worker families, and the overall economy, a much-needed boost,\" December 13, 2013.", "U.S. Department of Labor, \"History of federal minimum wage rates under the Fair Labor Standards Act, 1938-2009,\" accessed Feb. 17, 2014.", "U.S. Census Bureau, \"Poverty thresholds,\" accessed Feb. 17, 2014.", "U.S. Department of Labor, \"Changes in basic minimum wages in non-farm employment under state law: 1968 to 2013,\" accessed Feb. 18, 2014.", "U.S. Department of Labor, \"History of changes to the minimum wage law,\" accessed Feb. 19, 2014.", "Congressional Research Service, \"Inflation and the real minimum wage: a fact sheet,\" Jan. 8, 2014.", "National Conference of State Legislatures, \"State minimum wages,\" accessed Feb. 18, 2014.", "The Manhattan Institute, \"How solid is the case for raising the minimum wage?\" Dec. 3, 2013.", "Legislative Information System, House Bill 536, Jan. 8, 2014.", "Legislative Information System, House Bill 32, Jan. 8, 2014.", "The Heritage Foundation, \"What is minimum wage: Its history and effects on the economy,\" June 26, 2013.", "The Heritage Foundation, \"Value of the minimum wage in 1968 in 2013 dollars,\" accessed Feb. 19, 2014.", "The Bureau of Labor Statistics Monthly Labor Review, \"The minimum wage: its relation to incomes and poverty,\" June, 1987.", "American Enterprise Institute, \"Joe Biden’s flawed logic of a 1968 minimum wage hike,\" July 10, 2013.", "The New York Times, \"Bill pushes for increase in wages,\" June 2, 2012.", "Economic Policy Institute and \"To work with dignity,\" Aug. 26, 2013.", "U.S. Department of Commerce, \"Survey of current business,\" page 2, March, 1968.", "Congressional Research Service, \"The Fair Labor Standards Act (FLSA): An overview,\" June 4, 2013.", "Bureau of Labor Statistics, \"Characteristics of minimum wage workers: 2012,\" accessed Feb. 21, 2014.", "The Social Security Administration, Annual Statistical Supplement, 2013, table 3.E1, accessed Feb. 19, 2014.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]