["About this rating", "Ginsburg once said she believed that others' concerns about overpopulation might have influenced the high court's decision in Roe v. Wade.", "Ginsburg did not say she personally supported Roe v. Wade because it could help limit the population growth of \"undesirable\" communities.", "Some social media users have seized on a quote excerpted from a decade-old interview to accuse U.S. Supreme Court Justice Ruth Bader Ginsburg -- and by extension those who support keeping abortion legal -- as advocating for eugenics.  The statement was taken from a July 2009 interview published in the New York Times Magazine, during which Ginsburg said: \"Frankly I had thought that at the time Roe was decided, there was concern about population growth and particularly growth in populations that we don't want to have too many of.\"", "Ginsburg's remark was disseminated online not only in text, but as a graphic:", "Another version of the meme, reproducing the quote under a caption reading \"abortion logic 101,\" was shared thousands of times on Facebook after being posted on the social media network in June 2018:", "However, the graphic did not represent the entirety of the exchange between Ginsburg and reporter Emily Bazelon concerning the justice's belief that reproductive choice laws in the U.S. needed to be \"straightened out\" so that economic factors would not influence a woman's ability to seek an abortion:", "Ginsburg: The states that had changed their abortion laws before Roe [to make abortion legal] are not going to change back. So we have a policy that affects only poor women, and it can never be otherwise, and I don't know why this hasn't been said more often.", "Bazelon: Are you talking about the distances women have to travel because in parts of the country, abortion is essentially unavailable, because there are so few doctors and clinics that do the procedure? And also, the lack of Medicaid for abortions for poor women?", "Ginsburg: Yes, the ruling about that surprised me. [Harris v. McRae -- in 1980 the Court upheld the Hyde Amendment, which forbids the use of Medicaid for abortions.] Frankly I had thought that at the time Roe was decided, there was concern about population growth and particularly growth in populations that we don't want to have too many of. So that Roe was going to be then set up for Medicaid funding for abortion. Which some people felt would risk coercing women into having abortions when they didn't really want them. But when the court decided McRae, the case came out the other way. And then I realized that my perception of it had been altogether wrong.", "In an op-ed published three years later, Bazelon apologized for not following up on her question and asking Ginsburg to clarify her stance, adding:", "To imagine that Justice Ginsburg would endorse eugenics as a motivation for supporting legal abortion, you have to be out to get her. I say that because this notion is so entirely at odds with her life’s work advocating for equal rights for women, especially poor women. That’s why it didn’t occur to me at the time. It’s a gotcha, and nothing more.", "Bazelon's follow-up piece also included her account of a second interview she conducted with Ginsburg during an appearance by the justice at Yale University:", "\"Emily, you know that that line, which you quoted accurately, was vastly misinterpreted,\" [Ginsburg] said. \"I was surprised that the court went as far as it did in Roe v. Wade, and I did think that with the Medicaid reimbursement cases down the road that perhaps the court was thinking it did want more women to have access to reproductive choice. At the time, there was a concern about too many people inhabiting our planet. There was an organization called Zero Population Growth.\" She continued, \"In the press, there were articles about the danger of crowding our planet. So there was at the time of Roe v. Wade considerable concern about overpopulation.\"", "The group Ginsburg referenced during her appearance, Zero Population Growth (ZPG), was founded in 1968. From 1975 to 1977, ZPG was headed by anti-immigration activist John Tanton, who advocated for what he called \"passive eugenics.\" In that context, and given her record, Ginsburg's original remark was a description of ZPG's philosophy and not her own.", "In 2002, ZPG renamed itself Population Connection, saying on its website that \"the media avoided using us as a helpful resource, and members of Congress were wary of meeting with us and our members because we sounded to them like an extremist group.\" The site now includes no mention of Tanton.", "Ginsburg has said that while she supported the High Court's 1973 decision in Roe v. Wade, she did not feel it went far enough in protecting women's rights. During a 2013 appearance at the University of Chicago she noted, \"Roe isn't really about the woman's choice, is it? It's about the doctor's freedom to practice ... It wasn't woman-centered, it was physician-centered.\"", "Bazelon, Emily.   \"The Place of Women on the Court.\"\r\n    New York Times Magazine.    7 July 2009.", "Bazelon, Emily.    \"Talking to Justice Ruth Bader Ginsburg.\"\r\n    Slate.    19 October 2012.", "Starkey, Marian.    \"Whatever Happened to 'ZPG'?\"\r\n    Population Connection.    7 April 2017.", "Heagney, Meredith.    \"Justice Ruth Bader Ginsburg Offers Critique of Roe v. Wade During Law School Visit.\"\r\n    University of Chicago Law School.    15 May 2013.", "The Social Contract Press.    \"About the Social Contract.\"\r\n    Accessed 17 December 2018.", "Arturo Garcia is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]