["Multiple media outlets in India have reported that Pakistani singer Meesha Shafi faces up to three years in prison for “levelling false accusations of sexual harassment” against actor-singer Ali Zafar. “As per a report, post Ali Zafar’s defamation case against Meesha, a Pakistani Court has awarded 3 years of jail term to Meesha for causing ‘irreparable damages to his career thanks to the false case’,” reported The Times of India citing an unnamed report.", "In 2018, when the global #MeToo movement was at its height, Meesha Shafi had accused Ali Zafar of sexual harassment on more than one occasion. A day later Zafar denied all allegations and tweeted that he will take the case “through the court of law”. Last September, multiple other women came forward with similar allegations.", "New18, ABP News, DNA, Republic, Amar Ujala, Aaj Tak, IB Times and Newsd were among the media outlets that claimed Meesha will face three years in prison. “As per Mail Online, Shaafi, who accused Zafar of sexually harassing her during the #MeToo 2018 movement, faces a three-year jail term in Pakistan after Ali filed criminal defamation charge against her,” reported Zee News.", "This slideshow requires JavaScript.", "Other platforms that reported the same were Koimoi and SheThePeople.", "Reports carried by Indian media outlets have got several facts of the case wrong. For starters, Meesha Shafi was not sentenced to three years in prison by a Pakistani court but the Federal Investigation Agency (FIA) cybercrime wing booked eight women, including Shafi, who had levelled charges of sexual harassment against Zafar. Shafi was the only one who had lodged a formal complaint. An FIR was filed against the women for a non-cognisable offence on the order of the FIA special court, based on a complaint filed by Zafar alleging a smear campaign, reported Pakistan-based Dawn on September 29, 2020. “A verdict is yet to be announced,” reported Dawn in a recent article.", "The Wall Street Journal (WSJ) had published an extensive report on March 12 explaining the details of the case. In the latest development, the Supreme Court agreed to deliberate on whether her allegations against Zafar fall under the country’s Protection Against Harassment of Women at the Workplace Act of 2010. This was after Shafi lost a series of legal battles in which judicial authorities ruled that her case isn’t covered by the law.", "The report in WSJ does not say that she has been awarded three years imprisonment but that she could face up to three years of jail time if she is convicted in the defamation case filed by Zafar. According to Dawn, the defamation case has been pending before a session’s court.", "British tabloid Daily Mail’s erroneous interpretation of WSJ’s report was referred by multiple Indian media outlets.", "Shafi’s lawyer Asad Jamal took to Twitter to clarify that media reports have published false news. “Let there be no confusion that no such verdict has been passed by any court in Pakistan. In fact, the court has not even indicted any of the several men and women accused by Ali Zafar of spreading falsehood,” he wrote.", "This is with ref to the fake news claiming that my client Meesha Shafi has been sentenced to 3 yrs imprisonment. No such verdict has been passed by trial court in the frivolous criminal defamation case instituted by Ali Zafar against several women. Read complete statement below pic.twitter.com/49vRSXtvFe", "— Asad Jamal (@LegalPolitical) March 15, 2021", "Shafi also responded to the misinformation. “Speaking up is WAY MORE EXHAUSTING than being groped. This is why we end up suffering in silence,” she wrote.", "Another day, another campaign spreading false information.", "Speaking up is WAY MORE EXHAUSTING than being groped. This is why we end up suffering in silence. Sending lots of love and solidarity to all who speak up. It’s hard! @LegalPolitical setting the record straight 👇🏼👇🏼👇🏼 https://t.co/en22Mc7I25", "— MEESHA SHAFI (@itsmeeshashafi) March 15, 2021", "Media outlets in India that carried the false news have neither updated their reports nor issued a clarification on the misreporting as of this writing.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A claim that Nobel laureate Amartya Sen has passed away went viral on social media…", "Within hours of Prime Minister of Canada Justin Trudeau alleging that “agents of the government…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…", "On the front page of its national edition dated August 22, Hindi daily Dainik Jagran…", "In his reply to the no-confidence motion brought by the Opposition in the Lok Sabha,…"]