["Ahead of the election, politicians, newspapers and celebrities are offering their endorsements of the contenders for the country’s highest office. A post on social media claims two rappers are among the most recent to support a candidate.", "“50 Cent & Ice Cube have boarded the trump train!” a Facebook post reads. It’s accompanied by a photo of the two rappers posing next to each other, both sporting black hats that read “Trump 2020.”", "More:Fact check: Are poll workers putting notes on ballots? Yes, to enforce election laws", "The altered photo was shared on Twitter by President Donald Trump’s son Eric, calling the rappers “two great, courageous Americans,” Lead Stories reported. The tweet has since been deleted.", "The Facebook user that made the post did not respond to USA TODAY’s request for comment.", "More:Fact check: Viral video of Joe Biden on running for Senate is missing context", "While the picture of the two rappers sitting together is real, both of their hats have been edited to reflect support of Trump. The photo was originally posted on Ice Cube’s Twitter in July in celebration of 50 Cent’s birthday.", "In the original photo, Ice Cube is wearing a hat that reads “BIG3,” the name of a 3-on-3 pro basketball league he founded. 50 Cent is wearing a hat with the New York Yankees logo on it.", "50 Cent appeared to endorsed Trump on his Instagram Monday, citing Democratic presidential nominee Joe Biden’s tax plan as the reason.", "Ice Cube recently came under fire after announcing he is working with Trump on a plan geared toward helping Black Americans. But the rapper made it clear that their teamwork is not an endorsement on his end.", "\"I didn't run to go work with any campaign. Both campaigns contacted me,\" Ice Cube told CNN Oct. 17. \"Both campaigns wanted to talk to me about the Contract with Black America. One campaign said, 'We love what you have, but let's really dig into it after the election,' and one campaign said, 'We love what you have, do you mind talking to us about it?' And that's what I did, so I didn't run to nobody.\"", "He added that he doesn’t “trust” either presidential candidate and he’s not on anybody’s “team,” but that he plans to work with “whoever is in power.” Ice Cube has been critical of Trump in the past, an example being his 2018 song titled “Arrest the President.”", "A photo shared in a Facebook post depicting rappers Ice Cube and 50 Cent in Trump hats was ALTERED. The Trump logo was added to hats the rappers were already wearing. 50 Cent has informally endorsed Trump, and Ice Cube has not made any endorsement.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more."]