["When Oregon legislators set out to evaluate the state’s budget in the coming months, they’ll take a keen look at the state’s prison system. For the 2007-09 budget period, public safety accounted for nearly 15 percent of what the state spends, and, by one measure, the state’s prison system takes nearly one dime out of every dollar in the general fund.\n\nNaturally, there’s a lot of talk about how the state can make that slice of the dollar smaller. That talk then turns to the subject of minimum sentences and how the measures that Oregonians have approved over the years might be contributing to the large cost. (Most recently, voters said \"yes\" to Measure 73, which mandated longer sentences for repeat drunken drivers and sex offenders.)\n\nPushing back on this line of reasoning, Oregon Crime Victims United offered a little context in a piece online that then got picked up by another tough-on-crime group called the Oregon Anti-Crime Alliance.\n\nIn the statement, Crime Victims United argues that the cost of corrections is sometimes used as proof that Oregon has gone too far on incarceration. \"However,\" the statement says, \"costs have risen far faster than incarceration. Oregon still ranks just 30th in incarceration rate. We have not gone overboard with incarceration.\"\n\nThere’s a lot there to consider, but what jumped out at us was the statement that Oregon ranks \"just 30th in incarceration rate.\" We decided to check the number out.\n\nWe spoke with Howard Rodstein, the group’s number cruncher. He e-mailed us a link to a Bureau of Justice Statistics report that compares all 50 states’ incarceration rates. According to this report, \"imprisonment rate is the number of prisoners sentenced to more than 1 year per 100,000 U.S. residents.\"\n\nUnder that definition, Oregon scored 371 for 2008 and did, in fact, come in at 30th place. As a comparison, the national number was 504 prisoners per 100,000 residents..\n\nWe went to the source of that report, and asked spokeswoman Kara McCarthy whether the Bureau of Justice Statistics had any newer numbers. She said it did not.\n\nTo make sure we did our due diligence, we checked in with Tony Green, spokesman for the Oregon attorney general. Green said he didn’t have any other numbers to provide, but pointed us to the state Department of Corrections. We dialed them up, too.\n\nThere, spokeswoman Jeanine Hohn was able to provide fresh numbers. She sent us another report by the Bureau of Justice Statistics that showed Oregon with an incarceration rate of 375 midway through 2009. That put Oregon in 28th place. That indicates some slight movement upward.\n\nHohn also got Michael Wilson, an economist with the Criminal Justice Commission, on the phone with us. Wilson said that the Bureau of Justice Statistics reports are pretty much the standard measurement. \"For the most part, it's what people use because it's the best that's out there,\" he said.\n\nOregon’s incarceration rate did increase faster than the national rate from the early ‘90s through 2005 or so, he said, but -- with help from population growth -- has leveled off since then, keeping our rate below the national average.\n\nBefore we get to the ruling, we want to point out one final piece of context: While Oregon ranks near the middle when it comes to U.S. incarceration rates, the United States happens to be a world leader in this area. According to the International Centre for Prison Studies at King’s College London, the United States’ incarceration rate far outpaces most other countries’.\n\nNow, back to the issue at hand. Oregon Crime Victims United said that Oregon ranked 30th in state incarceration rates. Newer numbers show that to be off, but only slightly. Because not even the spokeswoman for the Bureau of Justice Statistics knew about the fresher numbers, we won’t fault Crime Victims United for the slight discrepancy. We find this claim to be True.", "Oregon Anti-Crime Alliance, Nov. 12, 2010\n\nBureau of Justice Statistics, \"Prisoners in 2008\", June 30, 2010\n\nBureau of Justice Statistics, \"Prison Inmates at Midyear 2009 - Statistical Tales\", June 2010\n\nInterview with Howard Rodstein of Oregon Crime Victims United, Nov. 15, 2010\n\nInterview with Kara McCarthy, spokeswoman for Bureau of Justice Statistics, Nov. 16, 2010\n\nInterview with Tony Green, spokesman for the Oregon attorney general, Nov. 16, 2010\n\nInterview with Jeanine Hohn, spokeswoman for Oregon Department of Corrections, Nov. 16, 2010\n\nInterview with Michael Wilson, economist for the Criminal Justice Commission, Nov. 16, 2010\n\nThe Oregonian, \"Hard choices: Big part of Oregon prison budget is all locked up\", Sept. 27, 2010\n\nWorldwide incarceration database, International Centre for Prison Studies at King’s College London", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]