["A Facebook post, which we’ve archived here, shows the gruesome image in a screenshot of what appears to be a WhatsApp status, edited with a thought bubble to conceal the identity of the person who posted it.", "A comment from Facebook user Wøñdér Zúlú, who posted the screenshot on the social network, says in Zulu: “My brother, I don't know how South Africans are. Don't they have a conscience”.", "However, a reverse image search on Yandex quickly finds that the image is related to the recent fuel truck explosion in Tanzania and not the xenophobic violence in South Africa.", "A slightly expanded version of the image can be seen on Media Brest, a news website based in Belarus, describing the fatal explosion.", "Fifty-seven people were burned to death on August 10 after a fuel tanker exploded near Morogogo in Tanzania. As reported by AFP in the days after the explosion, more people succumbed to their injuries and the death toll climbed to 100.", "The explosion engulfed a crowd of people who were siphoning petrol from the overturned tanker, many of them motorbike taxi drivers who had rushed to the scene.", "Officials said the explosion was triggered when a man tried to take the truck's battery, creating sparks that ignited the fuel.", "AFP Fact Check has debunked content from the Tanzania explosion before, in a claim that also purported to show violence in South Africa.", "Comparing a news report by Al Jazeera, and the wider graphic image of the burnt bodies, AFP confirmed the image is indeed from the tragedy.", "A man in a pink shirt, blue jeans and white gloves can be seen in both the larger picture and the Al Jazeera video. A closer look also shows a small part of the gate where the bodies were placed.", "As reported by AFP, at least twelve people have been killed since the start of the month in a wave of violence mainly targeted at foreigners and foreign-owned businesses in and around South Africa's Johannesburg.", "Over the weekend President Cyril Ramaphosa sent high-ranking emissaries on a mission to reassure other African countries after their citizens were attacked and their stores ransacked in the country.", "The mission, led by former minister Jeff Radeba, left South Africa on Saturday and will visit Nigeria, Niger, Ghana, Senegal, Tanzania, DR Congo and Zambia.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]