["Against the backdrop of Shringi Yadav arrested from Ghaziabad for mercilessly beating a Muslim boy for drinking water from a temple, a video of a man urinating on a shivling has been shared with the claim that he hails from the Muslim community.", "The video was posted by Twitter users Gopal Goswami @gopugoswami, Ramesh Solanki @Rajput_Ramesh, @Dharmicbaba, @YamrajFromHell, and @P_Katyayan. Between just these accounts the video has been viewed over one lakh times. Goswami wrote, “See why they go to Temples:- it’s nothing to do with drinking water but to pee on the murtis & Ling”. His tweet gained close to 4,000 retweets. The video shared by @Dharmicbaba and @P_Katyayan has a watermark that reads ‘Top Most Media’.", "This slideshow requires JavaScript.", "The video was also shared by @HinduEcosystem_, promoted by BJP leader Kapil Mishra, where it drew over 50,000 views. Swarajya’s senior editor Swati Goel Sharma and BJP member and former MLA Hari Manjhi shared the video as well.", "This slideshow requires JavaScript.", "Multiple social media users have circulated the video along with the following Hindi text, “सनातन हिंदूओं के कोई भी धार्मिक स्थल हो या मंदिर विधर्मीयो का प्रवेश सक्त वर्जित होना चाहिए ! ये वीडियो देखो डासना मामले में **** के हिमायतियों।ये भी नाबालिग ही है और किस प्रकार ये विधर्मी शिवलिंग पर पेशाब कर अपवित्र कर रहा है ! अब भी बोलो की ये मासूम भाईचारे का संदेश दे रहा है।” The message says that those who are symathetic to the minor who was beaten in Ghaziabad should watch this video.", "The viral video is at least three years old. It was uploaded by YouTube channel Top Most Media in April 2018 and was verified by Alt News in 2019 as well.", "Telugu language news outlets MIC TV and ABN Live TV reported that the incident took place at a Shiva temple in Pisinikada village of the Visakhapatnam district in Andhra Pradesh on April 10, 2018. MIC TV reported that the accused were Santipura-based Anand and Ramesh Anand.", "We also found two Facebook posts (1, 2) that state Ramesh was the person urinating and was charged under the following sections — Section 66A in The Information Technology Act, 2000 (Punishment for sending offensive messages through communication service, etc), Section 295A in The Indian Penal Code (Deliberate and malicious acts, intended to outrage reli­gious feelings of any class by insulting its religion or reli­gious beliefs) and Section 153A in The Indian Penal Code (Promoting enmity between different groups on grounds of religion, race, place of birth, residence, language, etc., and doing acts prejudicial to maintenance of harmony). Alt News reached out to Ramesh Devarapalli who had made the Facebook post. He said that the culprits were from the Christian community.", "ఇదే ఆ దేవాలయం! పాషండుల దురాగతాలకు, గురైన అనాధ దేవాలయం! అనకాపల్లి మం, పిసినికాడ గ్రామ శివారు, శ్రీశ్రీశ్రీ స్వయంభూ కాశీవిశ్వేశ్వర స్వామి వారి ఆలయం! ॐ నమశ్శివాయః! ఆదాయమొచ్చే ఆలయాలనే గానీ ఇలాంటి స్వయంభూ ఆలయాలు వారి దృష్టిలో ఉండవేమో శివా!!??", "#వీడు_ఎక్కడ_దొరికిన హిందువులారా వీడిని మాత్రము #కొట్టి_కొట్టి #చావగొట్టండి_😡🐑✝😡", "శివాలయం లో అపచారం చేసిన వాడి పేరు జగన్నాధ. రమేష్ s/o వెంకన్న తల్లి పేరు పెంటమ్మ ,D.B.Colony రామ బద్రాపురం పిసిన కాడ పంచాయతీ అనకాపల్లి మండలం విశాఖపట్నం జిల్లా వాడి వృత్తి పాముల గారడీ వాడిపైన నమోదైన సెక్షన్లు 66A,295A,153A", "Posted by Ramesh Devarapalli on Tuesday, 10 April 2018", "We also contacted Anakapalli rural police sub-inspector who similarly informed us, “This incident happened in 2018. The culprits were juvenile. The boy seen in the video is Jagannadha Ramesh and Anand Dasari recorded it. As per their confession, they were from the Christian community. The case was registered under FIR 52/2018 under sections 295A Section, 153A, and 34 (Acts done by several persons in furtherance of common intention) of The Indian Penal Code Section and 66A of The Information Technology Act, 2000.”", "A video from 2018 that shows a boy urinating on idols of Hindu deities was shared on social media with the false claim that he hails from the Muslim community. A few days ago a video of a Bangladesh-based Maulwi thrashing a child was shared on social media with the claim that the incident is from India.", "Donate Now", "A purported video of a Muslim man beating a temple priest with a bat is…", "A picture depicting the Pakistani flag apparently bigger in size and apparently placed higher than…", "Amid the ongoing war between Israel and Hamas, a video of a fleet of cars…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "A clip featuring Pakistan men’s Cricket team captain Babar Azam is viral on social media…"]