["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "One of the ways Sen. John McCain is trying to put distance between himself and President Bush is by criticizing the administration's response to Hurricane Katrina. But to pull it off, he's having to sidestep politically sensitive votes he took in 2005 and 2006 to limit Democrats' ability to investigate federal response to the disaster.", "At a press conference in Baton Rouge, La., on June 4, 2008, the presumptive Republican nominee was asked why he twice opposed creation of an independent commission to probe such issues as the government's role and the impact of the storm. McCain responded that he had backed every probe into the disaster.", "\"I've supported every investigation (into Hurricane Katrina) and ways of finding out how — what caused the tragedy,\" McCain replied. \"I've met with people on the ground. I've met with the governor.\"", "But McCain twice joined other Senate Republicans to beat back Democratic efforts led by Sen. Hillary Rodham Clinton to launch an independent probe that could have embarrassed the administration. Those efforts came at a time of particularly bitter recriminations over the federal response to Hurricane Katrina, while the White House was refusing to release certain documents or to make senior officials available for sworn testimony before Congress, citing the confidentiality of executive branch communications.", "In the GOP-controlled Senate, the Homeland Security and Governmental Affairs Committee had launched a probe of the federal role in hurricane preparedness and its response. Republican leaders expressed faith in the bipartisan investigation and derided Democratic efforts to charter an independent commission to conduct a parallel inquiry. An aide to then-Majority Leader Bill Frist, R-Tenn., called amendments to establish an independent Katrina commission \"taxpayer-funded flatulence that would just waste time and money to distract from the inquiry already well under way in the Senate.\"", "On Sept. 14, 2005, McCain and 53 other Senate Republicans rejected an effort by Clinton to establish the commission by attaching an amendment to a spending bill. Republicans said the move violated Senate rules, by attempting to legislate policy via a spending bill.", "Less than five months later, on Feb. 2, 2006, McCain joined with 52 Senate Republicans in a vote to kill a Clinton effort to attach a similar amendment to a tax bill.", "The Republicans countered Clinton's proposal by offering to create a bipartisan congressional committee consisting of senators and representatives to examine the hurricane response, but Democrats rejected the idea.", "Sen. Barack Obama's campaign and the Democratic National Committee each pounced on McCain's gaffe, sending e-mails providing the dates and vote numbers of the two Senate votes. \"John McCain seems perfectly comfortable misleading the American people rather than telling them the truth,\" said DNC spokeswoman Karen Finney.", "McCain campaign spokesman Brian Rogers said the Arizona senator was not familiar with the votes referenced in the question at the press conference, and was referring to his support for the Senate Homeland Security Committee investigation that was ongoing while Clinton offered her amendment. He issued a statement chastising Obama for launching \"tired negative attacks.\"", "As for McCain's claim that he met with \"people on the ground\" and then-Louisiana Gov. Kathleen Blanco, his campaign would not provide information to back it up.", "But in March 2006, McCain was among the first senators to visit stricken districts of New Orleans, partly at the behest of the community activist group Women of the Storm, and he subsequently called for expanded funding to rebuild portions of the city. Media accounts of the visit state he was briefed by civic and business leaders and Army Corps of Engineers officials.", "Though there are no accounts of McCain and Blanco meeting, McCain and Louisiana state officials did consult on hurricane-related matters, such as in late 2006, when he was a player in unsuccessful House-Senate negotiations over a water resources bill that took up how much oversight to apply to future Army Corps of Engineers projects.", "McCain clearly showed empathy over the government's response to the disaster and the scope of the damage. But he overlooked his participation in two outright Senate rejections of Democratic efforts to establish an independent Katrina commission, so we rate his claim Barely True.", "Editor's note: This statement was rated Barely True when it was published. On July 27, 2011, we changed the name for the rating to Mostly False.", "YouTube.com,  McCain on Katrina investigations", "Politico,  \"McCain's Katrina Claim Gets Rapidly Fact-Checked,\"  by Jonathan Martin, June 4, 2008", "Times-Picayune,  \"Two Key Senators Go to Bat for N.O.,\"  by Jeff Duncan, March 11, 2006", "New York Times,  \"White House Declines to Provide Storm Papers,\"  by Eric Lipton, Jan. 25, 2006", "Associated Press,  \"Senate Kills Bill for Katrina Commission,\"  by Lara Jakes Jordan, Sept. 14, 2005", "Associated Press, \"McCain Urges Obama to Join Him in 10 Town Hall Meetings,\" by Libby Quaid, June 4, 2008", "Times-Picayune, \"La. Officials Pushing to Wrap Up Water Bill,\" by Bruce Alpert,Sept. 22, 2006", "CQ Today, \"Reid Ponders Reviving Katrina Commission on Defense Bill, Raising Tensions,\" by John M. Donnelly, Nov. 4, 2005", "CQ Almanac, 2005 and 2006", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]