["A new ad by Gov. Rick Scott’s campaign has a simple message: Scott and his wife Ann have shown Florida their tax returns, so it’s only fair that former Gov. Charlie Crist and wife Carole show theirs.", "In the ad released June 25 called \"What’s He Hiding,\" Scott’s political group Let’s Get To Work demands that Crist release not only his tax returns, but Carole’s, too. The ad says the Scotts have released tax returns both in 2010 and for this year’s election.", "\"But millionaire Charlie Crist refuses to release his spouse’s tax returns,\" the ad says. \"Candidates for governor routinely disclose those returns. Alex Sink and Rick Scott both did it four years ago.\"", "Crist has said he won’t be releasing his wife’s tax returns, saying Scott was \"out of bounds\" for making the request and should apologize. PolitiFact Florida wondered, however, if spouses truly do \"routinely disclose\" their tax returns. Here’s our disclosure: It depends on what you consider routine.", "A separate issue", "The practice of gubernatorial candidates themselves disclosing tax returns goes back a long time, but for this check we’ll head as far back as Reubin Askew, who became governor in 1971 and released several years’ worth. Florida elected officials are required by law to file an annual statement showing their assets and liabilities. They are not required to release tax returns, but candidates for governor have traditionally done so.", "We should note that this generally applies to the general election candidates, and not always primary candidates. For example, Bill McCollum did not release his returns in 2010 while running in the primary against Rick Scott.", "As to whether spouses fess up their finances, well, that’s an interesting history.", "Most candidates have filed jointly with their spouses. Jeb Bush and his wife Columba released several years’ worth of joint returns during Bush’s years in office, and Rick and Ann Scott filed jointly. It wasn’t until 2002, when Democrat Bill McBride ran against Bush, that the issue of a spouse filing separately came up.", "McBride’s wife, Alex Sink, began to file separately from her husband specifically because her husband was running for governor, but in 2002 she released two years of tax returns under pressure from the Bush campaign. Sink had retired as president of Bank of America’s Florida operations in 2000. McBride, a lawyer who worked at Tampa firm Holland & Knight for many years, returned the favor in 2010 and released his returns when his wife ran for governor against Rick Scott (McBride died in 2012).", "Crist was a solo filer when he ran for governor in 2006, because he was single. He didn’t marry Carole Crist until 2008. He has said they continue to file separately because he \"was a single guy for a long time. She's got her own business, and it's her business.\"", "Carole Crist is an owner of a family Halloween costume and novelty business, Franco-American Novelty Co., and has created a second company, Goddessey. Crist, a lawyer by trade like McBride, announced the release of three years of tax returns as the ad began airing. The next day, he released returns going back to 2001, with promises to release more, going back to 1991.", "Candidates releasing their spouses separate returns has become more of an issue in the last couple of decades as more women become entrepreneurs independently of their spouses. Susan McManus, a University of South Florida political science professor, says the expectation of disclosing separate returns really took off when Walter Mondale chose Geraldine Ferraro as his Democratic running mate during the 1984 presidential campaign.", "Ferraro faced many questions from political opponents and the media about her husband John Zaccaro’s real estate company. They ultimately released the returns, and Ferraro admitted she was an officer in the company, albeit without the authority to sign company checks.", "In recent years the same expectation has come up in presidential campaigns; Sen. John McCain’s millionaire wife Cindy eventually released two years of individual tax returns during the 2008 presidential campaign amid Democratic pressure.", "But those are examples from presidential politics. In Florida, the question is whether two instances -- by the same couple, in McBride and Sink -- over the last 12 years constitutes spouses’ tax returns being released \"routinely,\" as Scott alleges. It’s only recently that we’ve seen candidates’ spouses filing separate returns.", "How you feel about it as a voter likely depends on how you feel about the race and the candidates, McManus said.", "\"The interesting thing in this case is that attitudes about this are changing,\" she said. \"In the future we’re likely to see everyone routinely releasing everything.\"", "Our ruling", "Scott said \"candidates for governor routinely disclose\" spouses’ tax returns. It is routine when candidates file joint returns with their spouses. It’s only recently that gubernatorial candidates and their spouses have started filing separate tax returns, though. When spouses file separately, there are two instances to look to, when first Alex Sink and then her husband Bill McBride disclosed individual returns for their spouse’s respective gubernatorial runs in 2002 and 2010.", "So the trend of spouses who file separately is a new one, but one way or the other, spouses' returns have been released over the years. We rate the statement Mostly True.", "Let’s Get to Work, \"What’s He Hiding?,\" June 25, 2014", "Associated Press, \"Cindy McCain: I'll never release my tax returns,\" May 8, 2008", "Tampa Bay Times, \"Meet Carole Rome, the governor's fiancee,\" July 12, 2008", "Tampa Bay Times, \"Sink, Scott agree to release tax returns and to debate,\" Sept. 8, 2010", "Bloomberg, \"What Romney Can Learn From Geraldine Ferraro,\" July 16, 2012", "Tampa Bay Times, \"Charlie Crist's wife regains joint custody of her two girls,\" April 2, 2013", "Tampa Bay Times, \"As Scott ad blasts Crist for 'hiding' tax returns, Crist releases some,\" June 25, 2014", "Associated Press, \"Tax returns an issue in Florida governor’s race,\" June 25, 2014", "Tampa Bay Times, \"Scott and Crist, on Gold Coast, trade barbs over their tax returns,\" June 25, 2014", "Orlando Sentinel, \"Chiles says he’s millionaire, Candida files financial disclosure forms,\" July 20, 1990, accessed June 26, 2014 via Nexis", "Miami Herald, \"Bush, Brogan officially on the ballot,\" July 17, 1998, accessed June 25, 2014 via Nexis", "Miami Herald, \"Bush’s income declines sharply; Governor richer in private sector,\" July 31, 2002, accessed June 25, 2014 via Nexis", "Miami Herald, \"Mrs. McBride’s tax returns released,\" Sept. 21, 2002, accessed June 25, 2014 via Nexis", "Interview with Greg Blair, Scott campaign spokesman, June 25-26, 2014", "Interview with Susan McManus, University of South Florida political science professor,\" June 26, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]