["AFP has found at least three Facebook posts featuring the image, which shows Kalla, popularly known as JK, posing for a photo with Subianto and his running mate, Sandiaga Uno. The image shows the trio clasping hands.", "One of the posts is this January 30 entry which has been shared more than 800 times and is captioned: “Breaking news!! Mr. JK officially joins the camp of and supports Mr. Prabowo and Mr. Sandiaga Uno at 4 pm.”", "Kalla is the chief adviser for incumbent president Joko Widodo's re-election campaign team, according to Widodo’s party website and this Kompas.com report on February 3.", "According to a Google Reverse Image search, the photo was taken from an August 15, 2018 article which did not say Kalla was joining Subianto’s camp or officially supporting him.", "The Okezone.com news report was headlined “When Prabowo and Sandiaga shake JK’s hands, competing but still friends.”", "Below is a screenshot of the article:", "The article says: “The Prabowo Subianto-Sandiaga Uno ticket met vice president Jusuf Kalla at his official residence, Diponegoro street, Menteng, Central Jakarta, Wednesday evening, August 15, 2018.", "\"An intriguing moment took place after the meeting. JK, Prabowo and Sandiaga shook each other hands and smiled while posing for a media photo.", "\"Prabowo said that even though he and JK were in different camps in the 2019 presidential election, he and JK were still friends.”", "Kalla does not have an official website but he has not issued any statements about supporting Prabowo on his verified Twitter handle.", "His aide has said that Kalla “fully supports” Widodo, according to this February 3, 2019 report by state news agency Antara.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]