["About this rating", "In mid-August 2017, the disreputable web site FreedomDaily.com posted a story with the clickbait headline \"Packers Coach Just Pissed Off Every Racist Player With What He Put On Field To Stop Protests.\"", "The story is essentially an invective against football players that have been kneeling during the playing of the national anthem before games as an act of protest against racism. The practice started with then-San Francisco 49ers quarterback Colin Kaepernick, who kneeled to protest police shootings of African-Americans. On 21 August 2017, 12 Cleveland Browns players escalated the protest in response to violence at a white supremacist rally in Charlottesville, Virgnia, that left a woman dead and 19 injured.", "It takes a few minutes of reading before one discovers the headline is misleading -- McCarthy didn't put anything on the field. Instead, he's having players watch an educational presentation about the historical significance of playing the anthem before games. FreedomDaily.com quotes the Wisconsin State Journal, which reported:", "\"McCarthy said he addresses the anthem and his expectation of proper decorum during it with the players via a preseason presentation.", "'It’s something that I’ve done each and every year here since I’ve been the head coach,” McCarthy said. “We have a PowerPoint presentation that you update (each year), and you always try to deliver the message clearly to the team.", "“Our approach has always been to give the history and the understanding of what the national anthem means, and why it’s played before any National Football League game, particularly how (the tradition) started after World War II. I go through the whole history and the importance of what it means to you personally.'\"", "The quote was taken from a press conference, where McCarthy and Packers general Manager Thompson were asked about the issue. Thompson responded by saying that it's a \"free country\" and the players are free to protest how they see fit.", "McCarthy also said that he has given the presentation \"each and every year\" since he became head coach -- in other words, since 2006, long before the controversy began over players kneeling during the anthem.", "FreedomDaily.com posted a similarly-formatted story about the Cowboys -- reporting Dallas coach Jason Garrett was putting some vague item on the football field to anger \"racist\" players. Garrett said he felt the flag and anthem were sacred but he, like McCarthy, isn't putting anything on the field. Further the FreedomDaily story flips the narrative by calling the protesting players racists -- all of them have been people of color up until 21 August 2017 when a white player joined his teammates in kneeling to protest against racism.", "Shea, Amanda. \"Packers Coach Just Pissed Off Every Racist Player With What He Put On Field To Stop Protests.\"\r\n  FreedomDaily.com. August 2017.", "Shea, Amanda. \"Cowboys Coach Just Announced What Every Anti-American Protester Player Is Getting on His Field.\"\r\n  FreedomDaily.com. August 2017.", "Wilde, Jason. \"Packers: Mike McCarthy Gives Players Lesson on National Anthem.\"\r\n  Wisconsin State Journal. 17 August 2017.", "KTVT. \"Jason Garrett: “The National Anthem Is Sacred, the Flag Is Sacred.”\r\n  15 August 2017.", "Strassman, Mark. \"Despite Leading Team to Super Bowl, Colin Kaepernick Remains Unemployed.\"\r\n  CBS News. 22 August 2017.", "Wagner, Kyle. \"Yes, It’s Strange That Colin Kaepernick Doesn’t Have a Deal Yet.\"\r\n  FiveThirtyEight.com. 29 May 2017.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]