["A picture of a giant sinkhole in the middle of a road is being shared on social media with the claim that it is from the city of Varanasi in Uttar Pradesh. Mahrukh Firdaus sarcastically wrote this is the first ‘underground’ cricket stadium. His post drew 1,000 shares.", "विश्व का पहला अंडरग्राउंड क्रिकेट स्टेडियम बनारस में बन कर तैयार, वो भी सड़क के बीचों-बीच ! 😂😂😂", "Posted by Mahrukh Firdaus on Wednesday, 4 August 2021", "It has been shared on several Facebook pages and groups including Samajwadi Digital Force: Mission 2022, Arvind Kejriwal Fans Group and Gulpham Madhopuri Page.", "This slideshow requires JavaScript.", "The same image was shared last year by Rajesh SP, affiliated with the Samajwadi Party. His post had been retweeted 150 times (archived link to the tweet). Rajesh had also shared this image on his Facebook account claiming this is from UP.", "दुनिया का पहला इंटरनेशनल अंडरग्राउंड क्रिकेट स्टेडियम अपने भारत मे… जी हां भारत के क्योटो शहर मे पहला इंटरनेशनल अंडरग्राउंड क्रिकेट स्टेडियम सड़क के बीचों-बीच स्थित… आदरणीय श्री @yadavakhilesh जी को इस मामले बाबाजी पीछे कर दिए हैं 🤣#गढ्ढायुक्त_यूपी बाबा ने 13027cr. BJP लूटी pic.twitter.com/gIAfIyUp32", "— Rajesh SP (@ARajesh_SP) August 11, 2020", "A Facebook page by the name of ‘Naye Bharat ki Buland Awaz’ posted the image claiming that it showed Ahmedabad.", "The picture is also being shared in the form of a graphic. Its caption states, “The world’s biggest underground stadium is now ready in Varanasi, that too in the middle of the street.”", "A few other users shared the image on Twitter and Facebook claiming that it was taken in Ahmedabad.", "After doing a reverse image search, we found that the original image of the sinkhole had been uploaded on July 29, 2017. Sanjeev Bhatt, a former IPS officer from Gujarat, had tweeted the image writing that it was taken in Ahmedabad. Apart from this, Aam Aadmi Party MP Sanjay Singh had also tweeted this image that same day. Divya Spandana had shared the image on August 7, 2017, stating that it was from Ahmedabad.", "This morning’s pictures from the smart city of Ahmedabad. 🙂 pic.twitter.com/VXislkEkZr", "— Sanjiv Bhatt (IPS) (@sanjivbhatt) July 29, 2017", "A signboard with the letters ‘AMC’ can be spotted near the sinkhole. ‘AMC’ stands for Ahmedabad Municipal Corporation. Apart from this, the word ‘danger’ is also written in Gujarati right above it on the same sign.", "In July 2017, the state of the roadways in Ahmedabad had worsened considerably due to heavy rain. In a video report dated July 23, 2017, The Times of India had reported on the poor condition of the roads in the Vastrapur-IIM area of the city. A local media organisation named VTV Gujarat had also shared a report on the condition of the roads. On June 2 2018, Hindi daily Jagran shared a fact-check report on the same photo. It was being shared as an image of roads in Varanasi back then as well.", "Alongside the sinkhole, the image of the stadium Rajesh SP had shared was of the Atal Bihari Vajpayee International Cricket Stadium in Lucknow.", "A picture taken in the city of Ahmedabad after heavy rains in July 2017 was circulated online with the false claim that it showed the dilapidated condition of the roads in Varanasi.", "Donate Now", "Kinjal Parmar holds a Bachelor of Science in Microbiology. However, her keen interest in journalism, drove her to pursue journalism from the Indian Institute of Mass Communication. At Alt News since 2019, she focuses on authentication of information which includes visual verification, media misreports, examining mis/disinformation across social media. She is the lead video producer at Alt News and manages social media accounts for the organization.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]