["“Canada cancels funding of the planned UGANDA AIRLINES worth $180m over state brutality,” according to a Facebook post by an impostor version of private Ugandan media NBS television.", "The post is referring to is a deal struck between Canadian plane manufacturer Bombardier and the Ugandan state. The Montreal-based company announced in mid-July that it would sell four CRJ 900 aircrafts to the Ugandan National Airlines Company, in a deal worth approximately $190 million.", "Bombardier Head of Communications Nathalie Siphengphet told AFP that “the order (for the planes) was not cancelled”, adding that Bombardier was “enthusiastic about delivering the planes in due course.” Bombardier did not disclose to AFP how and when payment for the planes would be made.", "The Canadian government could not have withdrawn funding for the plan because no evidence suggests that it committed any public funding to Uganda for the purchase of the planes in the first place. Export and Development Canada (EDC), a Canadian export credit agency -- a governmental loan agency aimed at encouraging the purchase of Canadian products -- would have been the most likely source of public money for such a deal.", "Yet Shelley MacLean, the EDC spokesperson, told AFP that “EDC was approached for financing support, but is not participating in the transaction.”", "The Canadian Commercial Corporation (CCC), an organization like EDC, and Global Affairs Canada, the Canadian government branch in charge of foreign aid, both confirmed to AFP that they did not commit any funds for the deal either.", "“That is hogwash,” General Edward Katumba Wamala, the Ugandan Minister of State for Works, whose ministry oversees the Ugandan National Airlines Company, told local AFP journalist Grace Matsiko about claims of withdrawn funding. Wamala did not disclose the source of funding for the planes to AFP.", "NBS television, the media company impersonated, also released a statement warning their audience about the spread of the false information.", "NOTICE: #FakeNews alert#NBSUpdates #NBSAT10 pic.twitter.com/2S2j3CavNV", "Although the most-widely shared version of this false post did not provide any more information, a less popular article published on September 11 provided more context.", "According to the article on Mulengera Media, Canada withdrew funding for the four aircrafts because Canadian lawyer Robert Amsterdam called on the international community to end funding to Uganda in order to compel Ugandan president Yoweri Museveni to improve his human rights record.", "Amsterdam is the lawyer of Ugandan musician and opposition MP Bobi Wine, who is currently seeking medical treatment in the United States after being allegedly tortured while under arrest in Uganda.", "At a press conference in Washington on September 6, Amsterdam told reporters that his client and he would “contact major investors in Uganda (...) to ask them to intervene,” before adding: “We are not seeking disinvestment from Uganda, what we’re seeking is responsible investment in Uganda.”", "* Note: This article was written with the contribution of Grace Matsiko, local AFP journalist in Uganda", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]