["Tropical Cyclone Nivar made landfall near Puducherry in the early hours of November 26, bringing heavy downpour to the union territory and neighbouring Tamil Nadu where three people have died. Prasar Bharati News shared a video from their official Twitter handle claiming it shows Marina beach in Chennai underwater due to heavy rain. (Archive link)", "Marina beach in Chennai underwater as Chennai is receiving incessant rain. pic.twitter.com/SPTdHZVFM0", "— Prasar Bharati News Services पी.बी.एन.एस. (@PBNS_India) November 25, 2020", "DD News Malayalam retweeted this video while reporting that Tamil Nadu, Puducherry, Andhra Pradesh, Telangana and Karnataka have issued a high alert. (Archive link)", "നിവാർ ചുഴലിക്കാറ്റ് അടുത്ത 12 മണിക്കൂറിനുള്ളിൽ അതിതീവ്ര ചുഴലിക്കാറ്റായി മാറുമെന്ന് മുന്നറിയിപ്പ്.", "തമിഴ്നാട്, പുതുച്ചേരി, ആന്ധ്രാപ്രദേശ്, തെലങ്കാന, കർണാടക തുടങ്ങിയ സംസ്ഥാനങ്ങൾ അതീവ ജാഗ്രതാ നിർദ്ദേശം നൽകി. ദുരന്ത നിവാരണ സേനയുടെ 22 ടീമുകളെ വിവിധ സംസ്ഥാനങ്ങളിലേക്ക് അയച്ചിട്ടുണ്ട്. https://t.co/KyXNJOlfAL", "— DD News Malayalam (@DDNewsMalayalam) November 25, 2020", "DD News Andhra also shared this video on its official Facebook page. (Archive link)", "Marina beach in Chennai underwater as Chennai is receiving incessant rain.", "Posted by DDNewsAndhra on Wednesday, November 25, 2020", "The clip has been circulated on Facebook and Twitter by individual users as well.", "A keyword search on Facebook in Tamil ‘மெரீனா கடற்கரை’ (Marina Beach) led us to a Facebook post where the same video was shared on November 3, 2017.", "We subsequently looked for the video on Youtube and saw that the clip was uploaded by a verified channel ‘New Waves’ that same day. It uploaded a collage of pictures and videos of flood-affected area in Chennai where the video was also attached.", "The coast of marina beach was severely affected due to heavy rainfall in November 2017. Visuals from the time show small shops submerged in the water.", "On November 5, 2017, Deccan Chronicle reported that the death toll crossed 10 as thousands took refuge in relief camps. Marina beach was inundated due to incessant downpour.", "All roads leading to Marina beach have also been temporarily closed in the ongoing severe cyclonic storm Nivar.", "Prasar Bharti shared a three-year-old video of flooding in Chennai’s Marina beach as recent. This was amplified by DD News.", "Donate Now", "Aqib is monitoring and researching mis/disinformation at Alt News", "A claim that Nobel laureate Amartya Sen has passed away went viral on social media…", "Within hours of Prime Minister of Canada Justin Trudeau alleging that “agents of the government…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…", "On the front page of its national edition dated August 22, Hindi daily Dainik Jagran…", "In his reply to the no-confidence motion brought by the Opposition in the Lok Sabha,…"]