["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "High prescription drug prices are fast becoming a leading political topic, with medications like insulin emerging as a poster child for the issue. Nearly doubling in price from 2012 to 2016, the diabetes medication has commanded bipartisan attention on Capitol Hill and even a shoutout in a recent Netflix comedy special.", "Voters say curbing such prices should be a top priority for lawmakers — and Democratic presidential candidates are paying attention.", "At an April 22 CNN town hall, Sen. Kamala Harris (D-Calif.), among the field of Democrats vying for the 2020 nomination, responded to a health care question by spotlighting insulin’s spiraling price tag.", "\"One out of 4 diabetes patients in our country cannot afford their insulin,\" she said.", "That would be a shockingly high number, researchers point out, and could become a talking point Democrats return to throughout the campaign season. The cost of insulin particularly resonates given diabetes’ incidence rates.", "According to the American Diabetes Association, about 1.25 million Americans have type 1 diabetes, which is less common than type 2, and cannot live without insulin.", "With that in mind, we decided to dig in to see if Harris’ statement checks out.", "Three different datasets back Harris’ claim", "When asked about this particular statement, Harris’ campaign first cited a peer-reviewed study published in December, which looked at people with diabetes being treated at the Yale Diabetes Center in New Haven, Conn. Of 199 participants, 51 people — just over 25% — reported they either reduced or stopped taking insulin because of the cost.", "The study is small and limited to one metropolitan area. But it likely paints a more-or-less accurate picture nationally, three health care academic researchers said.", "\"The characteristics of the people that were included look reasonably well-distributed across measures we’d be thinking about, like age, insurance type, race, ethnicity,\" said Stacie Dusetzina, an associate professor of health policy at Vanderbilt University. \"They probably are pretty much on target.\"", "The study also corresponds with other surveys, though they too have limitations.", "One, commissioned by the American Diabetes Association and made public last May, polled about 530 people online whose demographics corresponded to the national data of people with the illness. About 27% of respondents suggested the price of insulin had \"affected their past year purchase or use of insulin.\"", "There is also an online opt-in survey administered by T1International, an advocacy group for people with diabetes. Its 2018 results and methodology are undergoing peer review and have not yet been published in full, said James Elliott, one of the organization’s trustees. He suggested it would likely ultimately support Harris’ \"1 out of 4\" talking point.", "There’s some extrapolation, but the point is 'more true than not'", "The caveat is that Harris’ comment is based on limited data, and only one of the papers has been peer-reviewed.", "Though insulin’s price has skyrocketed in recent years, no sizable national survey or study has tracked insulin affordability, said Dr. Jing Luo, an instructor at Harvard Medical School who was involved with the Yale study and has researched insulin pricing more generally.", "That perhaps limits any effort to make an argument about insulin access nationwide, or at the very least requires some extrapolation.", "That said, the 1-in-4 figure is \"more true than not,\" Luo said.", "\"It’s as accurate as the data available allows,\" Luo said. \"It’s a reasonable estimate. Really, there’s no data to suggest otherwise.\"", "We also asked about Harris’ specific word choice: \"cannot afford their insulin.\" All the research examining this issue doesn’t ask that precise question, but rather, asks if the cost has resulted in a patient’s purchasing or using less medication.", "That, analysts said, is, in fact, a good proxy for whether people can’t afford insulin. And it may understate the problem, said Dr. Kasia Lipska, the endocrinologist who led the Yale study, since it doesn’t account for people who keep buying medication but skimp on groceries or other necessities as a result.", "Our ruling", "The lack of a national study is an issue, for sure, and to some extent limits the extent to which we can put stock in Harris’ 1-in-4 figure. It's also important to remember that it refers to a narrower group - only patients with Type 1 - rather than all people with diabetes.", "But experts broadly suggested that the findings in the three reports referenced — one peer-reviewed academic paper and two surveys — amply support her claim. And the broad meaning of the phrase \"cannot afford\" means the problem could be more significant than these datasets suggest, since they measure only people going without medication, not those for whom insulin prices maybe create other financial issues.", "This statement is accurate but needs some additional information. We rate this claim Mostly True.", "Kamala Harris, comments on CNN, April 22, 2019", "Kaiser Family Foundation, \"Public Opinion on Prescription Drugs and Their Prices,\" March 1, 2019", "Health Care Cost Institute, \"Spending on Individuals with Type 1 Diabetes and the Role of Rapidly Increasing Insulin Prices,\" Jan. 21, 2019", "Kaiser Health News, \"The Blame Game: Everyone And No One Is Raising Insulin Prices,\" April 10, 2019", "The Patriot Act With Hasan Minhaj, \"Drug Pricing,\" Feb. 17, 2019", "The Centers for Disease Control and Prevention, \"National Diabetes Statistics Report, 2017\"", "JAMA Internal Medicine, \"Cost-Related Insulin Underuse Among Patients With Diabetes,\" January 2019", "American Diabetes Association, \"Insulin Affordability Survey, 2018\"", "T1 International, \"Access to Insulin and Supplies Survey\"", "Telephone interview with Stacie Dusetzina, an associate professor of health policy at Vanderbilt University, April 23", "Telephone interview with Dr. Jing Luo, an instructor at Harvard Medical School, April 23", "Telephone interview with Dr. Kasia Lipska, an assistant professor of endocrinology at Yale School of Medicine, April 24", "Email interview with James Elliott, T1 International trustee, April 23", "Email interview with Elizabeth Feister, T1 International executive director, April 24", "Email interview with Michelle Kirkwood, American Diabetes Association vice president of scientific, medical and mission communications, April 23", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]