["About this rating", "As Godwin's Law would predict, all U.S. presidents in recent history have ended up being compared to Adolf Hitler by some critics, and President Donald Trump is no exception to that rule.", "Certainly Trump's constant attacks on the U.S. news media have drawn many Hitlerian comparisons, including the following tweet that presented one of Trump's anti-press diatribes as \"translating Mein Kampf\":", "We can verify that the quoted words are indeed correctly attributed to their respective authors.", "Trump's denunciation that much of what the U.S. press reports is \"FAKE NEWS, pushing a political agenda or just plain trying to hurt people\" comes from an Aug. 16, 2018, tweet:", "The statement on the right comes from Hitler's 1925 autobiographical manifesto \"Mein Kampf,\" begun while he was imprisoned for his part in a failed coup d'état in Munich, Bavaria, in November 1923. Although Hitler's work is subject to the vagaries of translation (since Hitler wrote in German), the above passage does appear as worded in Chapter 11 of \"Mein Kampf\" in at least one English-language translation:", "By the creation of a press whose content is adapted to the intellectual horizon of the least educated people, the political and trade-union organization finally obtains the agitational institution by which the lowest strata of the nation are made ripe for the most reckless acts. Its function is not to lead people out of the swamp of a base mentality to a higher stage, but to cater to their lowest instincts. Since the masses are as mentally lazy as they are sometimes presumptuous, this is a business as speculative as it is profitable.", "It is this press, above all, which wages a positively fanatical and slanderous struggle, tearing down everything which can be regarded as a support of national independence, cultural elevation, and the economic independence of the nation.", "Above all, it hammers away at the characters of all those who will not bow down to the Jewish presumption to dominate, or whose ability and genius in themselves seem a danger to the Jew. For to be hated by the Jew it is not necessary to combat him; no, it suffices if he suspects that someone might even conceive the idea of combating him some time or that on the strength of his superior genius he is an augmenter of the power and greatness of a nationality hostile to the Jew.", "Other translations provide slightly different wording, but the gist is the same:", "But it is the press above all which now, in a truly fanatic fight of calumny, derides everything which could be looked upon as the support of national independence, cultural height, and economic self-dependence of the nation.", "To what extent the two statements presented above resemble each other is something of a subjective issue, but many critics, such as civil rights lawyer Burt Neuborne, have drawn parallels between Trump's and Hitler's attacks on the mainstream press:", "[Hitler and Trump] unceasingly attack objective truth. “Both Trump and Hitler maintained a relentless assault on the very idea of objective truth,” [Neuborne says]. “Each began the assault by seeking to delegitimize the mainstream press. Hitler quickly coined the epithet Lügenpresse (literally ‘lying press’) to denigrate the mainstream press. Trump uses a paraphrase of Hitler’s lying press epithet -- ‘fake news’ -- cribbed, no doubt, from one of Hitler’s speeches. For Trump, the mainstream press is a ‘lying press’ that publishes ‘fake news.’” Hitler attacked his opponents as spreading false information to undermine his positions, Neuborne says, just as Trump has attacked “elites” for disseminating false news ...", "They relentlessly attack mainstream media. Trump’s assaults on the media echo Hitler’s, Neuborne says, noting that he “repeatedly attacks the ‘failing New York Times,’ leads crowds in chanting ‘CNN sucks,’ [and] is personally hostile to most reporters.” He cites the White House’s refusal to fly the flag at half-mast after the murder of five journalists in Annapolis in June 2018, Trump’s efforts to punish CNN by blocking a merger of its corporate parent, and trying to revoke federal Postal Service contracts held by Amazon, which was founded by Jeff Bezos, who also owns the Washington Post.", "Hitler, Adolf.   Mein Kampf: Complete and Unabridged, Fully Annotated.\r\n    Boston: Houghton Mifflin Company, 1939.", "Rosenfeld, Steven.   \"Leading Civil Rights Lawyer Shows 20 Ways Trump Is Copying Hitler’s Early Rhetoric and Policies.\"\r\n    Common Dreams.   9 August 2019.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]