["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Members of the National Education Association, the nation’s largest teachers union, teach all kinds of students. Some have autism, a disorder of brain development, and special education teachers are trained to deal with their social behavior and communication issues.\n\nDaria Denoia, a teacher in Columbus, Ohio, is one such teacher. She was featured in a recent commercial sponsored by the NEA Fund for Children and Public Education sponsored by the NEA Fund for Children and Public Education, a  political action committee, as part of the union’s campaign against Josh Mandel’s election to the U.S. Senate. Mandel, a Republican, is Ohio’s treasurer but hopes to replace Democrat Sherrod Brown in the Senate.\n\nIt is no surprise that the NEA takes sides in political races, especially considering recent tensions between public employees and state officials over collective bargaining rights. But something that the teacher said in the anti-Mandel commercial stood out -- a new and measurable charge in a race in which many other other issues are litigated over and over.\n\nDenoia said, \"I read that Josh Mandel voted to let insurance companies deny coverage for autism.\"  \n\nThis was actually the second claim in the teachers union ad. The first was that \"I heard that Josh Mandel wants to allow insurance companies to deny medical coverage for pre-existing medical conditions.\"\n\nMandel unquestionably supports repeal of the Patient Protection and Affordable Care Act, which says that starting in 2014 insurers may not deny coverage for pre-existing conditions. Mandel says other portions of the act, including fines on employers who do not provide health coverage, could harm the economy.\n\nSince issuing a statement in June saying the law should be fully repealed, Mandel has said in interviews that he would support keeping some provisions, including the one on pre-existing conditions. Exactly how that would work is not known.\n\nCovering people with high health care expenses could drive up insurance costs, insurers say, unless nearly every American, healthy or sick, is required to have insurance and spread the financial risk. That very mandate is the cornerstone of the Affordable Care Act. There could be other ways to block denial, including expanding state-based high-risk pools (which have their own cost issues) or passing reforms in less-divisive existing laws, conservative groups say.\n\nCould they work, or is this all just a political sop, as Democrats suggest? That is speculative. The NEA has made a claim based on what Mandel says he opposes but not on Mandel’s later statement of intent. He opposes the current law but says he could support something else to take care of pre-existing conditions. Since the form of that \"something else\" is not yet set and we cannot measure intent on a true-false spectrum, we cannot rate this claim by the NEA.\n\nBut what about the claim that Mandel voted to deny autism coverage?\n\nMandel has, in fact, voted on autism coverage. He was in the Ohio General Assembly at the time.\n\nA 2009 state bill would have mandated that health insurers cover autism. The bill, backed by autism-care groups, passed the Ohio House but never got out of the Ohio Senate. Mandel, in the House, was among the minority voting no.\n\nAccording to news coverage, opponents said they worried the mandate would drive up premiums, which small employers could not afford. This was also the view of the National Federation of Independent Businesses, which lobbied against the bill.\n\nYet the bill contained controls against excessive costs. According to the bill language and a related analysis we read from the Ohio Legislative Service Commission, the legislation stipulated that any company could opt out of the coverage requirement if it could show this mandate drove up its insurance costs by 1 percent or more.  \n\nMandel’s campaign communications director, Travis Considine, acknowledged Mandel’s \"no\" vote. But he pointed us to an amendment that Mandel supported before voting against the final bill. Intended to help control costs, the amendment would have required an attending psychologist or physician to develop a treatment plan for each autism patient using insurance, and to limit mandatory autism coverage to $36,000 a year, according to the bill language and a legislative summary. The amendment also would allow insurers to request reviews of treatment every six months.\n\nThe amendment passed unanimously and its requirements were included in the final bill. That final bill had 57 \"yes\" votes and 39 votes of no, including Mandel’s, before moving the state Senate, where it died. The support group Autism Speaks says it expects a new version to emerge in Columbus soon.\n\nConsidine also told us that in a separate matter, Mandel voted for state legislation providing money for a special education scholarship program. Special education students sometimes transfer out of their local schools and attend alternative programs to get the individualized attention their parents want for them. The scholarships are similar to vouchers, reducing parents’ costs, and have been popular among families with autistic children.\n\nThis may help show that Mandel is not heartless. But it does not change the accuracy of the NEA claim that Mandel \"voted to let insurance companies deny coverage for autism.\" The point of the commercial, in fact, comes in Denoia’s final line: \"Ohio needs a senator who will stand up to the insurance companies...\"\n\nTwo points are worth mentioning.\n\nFirst, the NEA couched its claim with the teacher saying, \"I read that Josh Mandel voted to let insurance companies deny coverage for autism.\" (Italics added for emphasis.) Some ad campaigns use similar words to get a little wiggle room if their accuracy is challenged. Hey, the teacher is only saying what she read. But in this case, no couching was necessary. The teacher’s reading comprehension was good.\n\nSecond, as a point of semantics, Mandel did not actually vote to deny autism coverage; it was already denied by many insurers. But he voted against requiring coverage, which has the same effect as voting to allow insurers to deny it.\n\nThat’s additional information that provides clarification.\n\nOn the Truth-O-Meter, the NEA’s claim rates Mostly True.", "National Education Association, \"Ohio special education teacher opposes Josh Mandel for US Senate,\" Sept. 27, 2012\n\nOhio General Assembly, House Bill 8, passed by Ohio House, Dec. 8, 2009\n\nTelephone and email conversations with Joyce Rene Carter, spokeswoman, National Education Association, Sept. 28 and Oct. 1, 2012\n\nTelephone interview with Rick Farfaglia, senior campaign specialist, National Education Association, Oct. 1, 2012\n\nNEA fact-check sheet for ad, sent by email, Oct. 1, 2012\n\nEmail and telephone conversations with Travis Considine, communications director for Josh Mandel campaign, Oct. 1-4, 2012\n\nOhio Legislative Service Commission, analysis of House Bill 8, 128th General Assembly, 2009\n\nTelephone interview with Doug Krinsky, central Ohio volunteer parent advocate, Autism Speaks, Oct. 1, 2012\n\nTelephone and email conversations, Rick Remington, communications director, Autism Speaks, Oct. 1, 2012\n\nOhio Votes, Chronology of House Bill 8, accessed Oct. 5, 2012\n\nThe Columbus Dispatch, \"House OKs bills on autism, diabetes,\" by Jim Siegel, Dec. 9, 2009\n\nThe Plain Dealer via Cleveland.com, \"Helping young adults with autism,\" editorial, Dec. 13, 2009\n\nDayton Daily News, \"No end in sight for Statehouse bill gridlock,\" by William Hershey, Dec. 13, 2009\n\nNational Journal’s Congress Daily, \"Ohio House passes legislation mandating autism coverage,\" Dec. 14, 2009", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]