["The day state Sen. Wendy Davis announced her run for governor, Texas Right to Life announced it would air a radio ad calling her an \"abortion zealot.\"", "Audio that the anti-abortion group released Oct. 3, 2013, of its ad said, \"Wendy Davis opposes any limits on abortion.\"", "That’s a clear-cut statement, which the group also had on its website.", "An Oct. 3, 2013, entry on the site said that Davis’s \"views are so fanatical that she opposes any safeguards for the unborn at any stage of pregnancy, up to and including the final weeks before birth… (Davis) thoroughly aired her abortion views during her 11-hour filibuster in June in her failed attempt to block the new Pro-Life law from passing.\"", "A spokeswoman for the group, Melissa Conway, told us by phone that her group could not immediately provide backup information.", "Davis, a Fort Worth Democrat, was indelibly linked to abortion issues by her June 25, 2013, filibuster, which made headlines worldwide and briefly helped derail changes in law intended to restrict abortions.", "Campaign spokesman Bo Delp told us by email it’s incorrect to say Davis opposes any limits. \"Like most Texans, Sen. Davis opposes late-term abortions except when the life or health of the mother is endangered, in cases of rape or incest or in the case of severe and irreversible fetal abnormalities,\" Delp said.", "Delp’s response fits with an Oct. 5, 2013, news story in the Austin American-Statesman saying that Davis, while addressing the National Press Club in Washington, D.C., Aug. 5, 2013, was asked, \"Could you discuss what legal limits on abortion you do support?\"", "She replied, \"You know, the Supreme Court has made that decision. And it’s one of the protected liberties under our Constitution. And I respect the constitutional protections that are in place today.\"", "The Supreme Court’s 1973 landmark decision in Roe v Wade struck down a Texas law that banned all abortions except those performed to save the mother’s life.", "The justices ruled then that states can’t restrict or ban abortions in the first trimester (roughly three months or the first 12 weeks of the pregnancy). Their ruling said, though, that states can make laws governing abortions in the second trimester if the laws are \"reasonably related\" to the woman’s health. After the point at which fetuses attain \"viability,\" meaning they can survive outside the womb, states can limit or ban abortions unless the woman’s life is in danger, the court held.", "So in her response in Washington, Davis signaled that she both accepts letting states limit abortions after the first trimester and limit or ban abortions after fetuses are viable, unless the mother’s life is at risk.", "Elected to the Senate in 2008, Davis voted in 2009 and 2011 against state legislation requiring women to get sonograms before having an abortion. The measure passed into law in 2011 requires doctors performing abortions to provide a sonogram 24 hours before the abortion and describe what the image shows, including the fetus' size, body features and internal organs.", "Her 2013 filibuster delayed, but didn’t prevent the Republican-majority Legislature from approving restrictions that will soon begin taking effect. Starting Oct. 29, 2013, the law bans abortions after the 20th week post-fertilization, except when the woman’s life is endangered or in cases of severe fetal abnormality; requires abortion doctors to gain admitting privileges in a hospital within 30 miles of the clinic; and beefs up regulations on the dispensing of abortion-inducing drugs. Starting Sept. 1, 2014, the law requires that all abortion clinics meet the same standards as ambulatory surgical centers.", "In its October news story, the Statesman quoted a Davis adviser as saying that Davis would not have picked a fight over the 20-week provision by itself. However, she indicated in the early part of her filibuster that she was opposed to that provision on medical grounds. \"From our medical community, we’ve heard the concern that this interferes with the practice of medicine,\" Davis said, according to CounterPath Press’ transcript of the filibuster. \"As important, we know that concerns have been raised that this ban interferes with a woman’s health care decision before she and her doctor may have important health information about her own health and the health of the pregnancy.\"", "Repeatedly during the filibuster, Davis said that a major reason she opposed the legislation was that in her view, its provisions were not intended to make women safer but to make sure fewer abortions were performed. \"I think that the state of Texas has already established a fine standard of care,\" she said.", "Our ruling", "Texas Right to Life said, \"Wendy Davis opposes any limits on abortion.\"", "Although Davis has spoken and voted against certain abortion limits, her campaign statement and her stated support for the Roe v. Wade decision indicate she opposes late-term abortions except in extreme circumstances. The group did not provide, and we did not find, evidence of Davis opposing \"any limits on abortion.\"", "We rate this claim as False.", "FALSE – The statement is not accurate.", "Click here for more on the six PolitiFact ratings and how we select facts to check.", "Audio of Texas Right to Life ad, released Oct. 3, 2013", "Telephone interview with Melissa Conway, spokeswoman, Texas Right to Life, Oct. 21, 2013", "Email interview with Bo Delp, director of communications, Davis campaign, Oct. 18, 2013", "Austin American-Statesman news story, \"In polarized world of abortion politics, Davis and Abbott advance nuanced views,\" Oct. 5, 2013", "Cornell University Law School Legal Information Institute, \"Roe v. Wade,\" Jan. 22, 1973", "Senate Journal, State of Texas, entry for May 1, 2009", "Senate Journal, State of Texas, entry for May 3, 2011", "CounterPath Press, transcript of Davis filibuster speech, accessed online Oct. 22, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]