["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "“CBS Evening News” ran a segment Sept. 15 about a Joe Biden campaign trip to Florida and his efforts to court Latino voters.", "At one point, while CBS News correspondent Ed O’Keefe spoke in a voiceover about President Donald Trump’s standing with Latino voters, an image of a Latinos for Trump event in Phoenix was displayed on screen.", "The full segment makes it clear that “CBS Evening News” was not trying to pass off the photo of Trump’s Latino supporters as the crowd from a Biden event.", "Social media users are wrongly claiming that a recent TV segment from \"CBS Evening News\" swiped a photo of President Donald Trump’s Latino supporters and portrayed it as the crowd from one of Vice President Joe Biden’s campaign events.", "That’s not what happened.", "The false claim took off on Twitter and Facebook with an assist from the conservative news and opinion website the Gateway Pundit, which published an article with the headline, \"Fake news CBS caught using photo from Latinos for Trump event in Phoenix and tagged it as Biden’s Florida event!\"", "\"CBS stole a photo from Latinos for Trump in Phoenix and tagged it as a Biden event,\" said the text on one Sept. 17 Facebook post shared thousands of times.", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The program did not try to pass off a photo of Trump supporters as an event for Biden, the Democratic presidential nominee.", "The picture of the \"CBS Evening News\" broadcast was snapped during a segment that aired on Sept. 15. In the segment, CBS News correspondent Ed O’Keefe reported on a Biden campaign stop in Florida and the former vice president’s efforts to court Latino voters.", "The full segment, complete with audio, shows that the photo of Trump supporters at a Latinos for Trump event in Phoenix was displayed on screen while O’Keefe was speaking in a voiceover about Trump’s support among Latino voters. (The photo pops up at the 3:45 mark.)", "\"The president has cut into Biden’s advantage by wooing conservative Latinos with ominous warnings about a Biden presidency,\" O’Keefe said as the photo in question, taken by Associated Press photographer Andrew Harnik on Sept. 14, flashed on screen.", "Supporters react as President Donald Trump speaks at a Latinos for Trump event at Arizona Grand Resort & Spa, on Sept. 14, 2020, in Phoenix. (AP)", "The segment cut next to another photo of a Latina Trump supporter, followed by footage from a Trump event and then footage of the president speaking.", "The chyron — which read, \"Biden pitches crucial Latino voters during Florida campaign stop — remained on screen for more than a minute and a half. The full clip can be viewed here.", "Fact-checkers at Snopes, FactCheck.org, the Dispatch and the Associated Press have debunked the false claims about the \"CBS Evening News\" broadcast. The Gateway Pundit did an about-face, changing its headline to \"Trump’s cut into the Hispanic vote leaves Democrats panicked.\"", "We rate this Facebook post False.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more.", "Facebook post, Sept. 17, 2020", "Snopes, \"Was CBS ‘Caught’ Passing Off ‘Latinos for Trump’ as Biden Supporters?\" Sept. 17, 2020", "The Dispatch, \"Did CBS Conflate a Latinos for Trump Rally With a Biden Event?\" Sept. 17, 2020", "FactCheck.org, \"CBS News Didn’t Misrepresent Trump Gathering as a Biden Event,\" Sept. 17, 2020", "The Associated Press, \"CBS did not misrepresent photo of Trump Latino supporters,\" Sept. 17, 2020", "The Gateway Pundit, \"Fake News CBS Caught Using Photo From Latinos For Trump Event in Phoenix and Tagged it as Biden’s Florida Event!\" Sept. 16, 2020", "The Gateway Pundit, \"Trump’s Cut into the Hispanic Vote Leaves Democrats Panicked,\" Sept. 16, 2020", "Tweet, Sept. 16, 2020", "CBS Evening News on YouTube, \"Biden visits Florida to meet Latino voters,\" Sept. 15, 2020", "AP Images, \"Election 2020 Trump,\" Sept. 14, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]