["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "President Donald Trump attempted to rewrite history by claiming that the reason for the 1979 Soviet invasion of Afghanistan was to defeat terrorists entering Russia.", "While fielding questions from White House reporters about U.S. strategy in Afghanistan, Trump revisited Russia’s Cold War-era occupation of the country.", "\"The reason Russia was in Afghanistan was because terrorists were going into Russia,\" Trump said Jan. 2 during a Cabinet meeting. \"They were right to be there.\"", "Documentary evidence shows Russia invaded Afghanistan as part of a broader Cold War strategy. But is there anything to Trump’s claim that terrorism was what motivated Moscow?", "Historians say no.", "\"There have never been any terrorist attacks from Afghanistan in Russia from the creation of the universe until now,\" said Barnett Rubin, an Afghanistan expert at New York University’s Center on International Cooperation.", "\"A few Chechens and Arabs who went to Chechnya participated in acts of terror in the 1990s,\" he added. \"None of them came from Afghanistan to do so, though some may have been there at one time, and not a single Afghan has ever been involved.\"", "In other words, Trump’s retelling of Russia’s invasion is completely mistaken.", "\"The Soviet Union’s primary motivation to invade Afghanistan was to balance against a perceived growing U.S. interest in Afghanistan in the late 1970s,\" said Seth Jones, a political scientist at the Center for Strategic and International Studies. \"It was about cold, calculating balance-of-power politics.\"", "Moscow and Washington competed for sway over Afghanistan beginning in the 1950s. Its value as a Cold War bargaining chip lay in the fact that it was the Soviet Union’s southern neighbor, with the two sharing a nearly 1,500-mile border.", "The rivalry for Afghanistan began peacefully as a bidding war for Kabul’s affections. At the outset, each side attempted to curry favor through economic aid and other soft power measures, said Benjamin Hopkins, a professor of history and international affairs at George Washington University.", "But over the following decades the rivalry grew more tense as Afghan politics frayed.", "The Soviet Union viewed Afghanistan as part of its natural sphere of influence, while the United States saw it as the Soviet regime’s \"soft underbelly,\" in the words of former U.S. diplomat Graham Fuller.", "\"The United States saw this as an area of competition precisely because of Afghanistan’s proximity to the Soviet Union,\" said Benjamin Hopkins, a professor of history and international affairs at George Washington University. \"They saw this as an easier way in to undermine the Soviet Union.\"", "In his political history of Afghanistan, In the Graveyard of Empires, Jones, of the Center for Strategic and International Studies, relied on declassified Soviet documents that give a window into Moscow’s thinking at the time.", "In fall 1979, Soviet leadership grew increasingly worried that a new Afghan leader, Hafizullah Amin, was too amenable to Western influence. Or worse, that he was an agent of the CIA.", "The KGB warned the Politburo that Amin might turn to the United States for help with tamping down his country’s lingering civil unrest.", "In early December, Soviet leader Leonid Brezhnev convened his inner circle to discuss options, amid growing fears that the United States was increasingly eyeing Afghanistan.", "Soviet leadership decided to have the KGB depose Amin and replace him with Babrak Karmal, one of the leaders of the far-left April Revolution of the previous year. Brezhnev and his advisers also weighed deploying a large-scale contingent of troops to stabilize the country.", "By Dec. 27, 1979, Soviet forces numbered 50,000, with 5,000 troops and special forces positioned around the Afghan capital of Kabul, according to Jones’ account. Covert KGB forces launched an assault on the presidential palace where Amin and his security guards were located.", "\"Amin’s guards fought back for several hours,\" Jones wrote, \"but they were ultimately overcome, and KGB forces assassinated Amin.\"", "In his place, Soviets installed their hand-picked successor, Babrak Karmal, who would lead Afghanistan for 7 years. The Soviet occupation of Afghanistan wore on for even longer, ultimately ending in defeat in February 1989.", "It’s possible Trump conflated several details related to the Soviet-Afghan conflict.", "Within days of the Soviet invasion, the U.S. launched a covert strategy to give lethal aid to Afghan Mujahideen insurgents who were fighting the occupying Soviet forces. Osama bin Laden, who would later become the world’s most notorious terrorist, was among a contingent of Arab fighters who fought against the Soviets alongside the Mujahideen.", "It’s worth noting there’s no evidence the United States directly armed or funded bin Laden (hat tip to our friends at Factcheck.org), though it’s possible this common misconception was on Trump’s mind at the time of his claim. In any event, U.S. aid went to the Afghan insurgents only after the Soviet invasion.", "Trump said, \"The reason Russia was in Afghanistan was because terrorists were going into Russia.\"", "The Soviet Union’s motivation for invading Afghanistan was about Cold War balance-of-power politics. At no point has Afghanistan served as a launchpad for terrorist attacks in Russia, historians said.", "We rate this Pants on Fire.", "President Donald Trump remarks, Jan. 2, 2019", "In the Graveyard of Empires, Seth Jones, a political scientist at the Center for Strategic and International Studies, 2009", "Benjamin Hopkins, professor of history and international affairs at George Washington University, \"Why did the United States and the Soviet Union compete in Afghanistan?\" July 13, 2011", "U.S. State Department, Foreign Relations of the United States, 1977–1980: Afghanistan, December 2018", "Factcheck.org, \"Rand Paul’s Bin Laden Claim Is ‘Urban Myth,’ \" Feb. 8, 2013", "Email interview with Seth Jones, a political scientist at the Center for Strategic and International Studies, Jan. 7, 2019", "Email interview with Barnett Rubin, an Afghanistan expert at New York University’s Center on International Cooperation, Jan. 7, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]