["The report by regional television channel Janam TV contains video footage of students wearing black and waving white flags.", "The report, which was posted on Janam TV's official Facebook page where it has been viewed nearly 850,000 times since it was published on December 29, 2018, claims the footage shows that a college in the southern Indian state of Kerala is a hub of Al Qaeda and Islamic State group sympathisers.", "Janam TV also posted the report on their official YouTube channel here, where it has been viewed more than 17,000 times.", "The news report, in the local Malayalam language, says: “Students raise the flag of terrorists at the Varkala CH Mohammed Koya Memorial College in Thiruvananthapuram district. There are many names from Kerala linked to ISIS. These scenarios clearly show how Islam is strengthened by terrorism.”", "Other media picked up the Janam TV story and published online reports, for example here, and it has also been shared widely on Facebook, for example here and here.", "The original Facebook post's caption says: “Students raised the flag of terrorist organizations in the capital. IS-Al Qaeda organizations rooted in Kerala, they also raise the flag of terrorist organizations.”", "The footage actually shows an arts festival held on March 14, 2018 at the college in Kerala, also known as CHMM College for Advanced Studies.", "College principal Dr. B. Janardanan Pillai told AFP that the students were dressed in black to pay tribute to chief guest and famous regional actor Salim Kumar, who wears all black while playing a detective in the 2003 movie CID Moosa.", "“The students were wearing black dresses as part of cultural programme theme for our chief guest, no terrorists flags were raised. It is a ploy from Janam TV and its right-wing supporters to defame our college,” he said in a January 1, 2018 telephone interview.", "The college is planning to file a defamation case against the channel, he added.", "When contacted by AFP, Janam TV said it stood by its story.", "The channel’s editor-in-chief, GK Suresh Babu, told AFP by phone: “This was unconstitutional, students chanted radical slogans like ‘Bolo Takbir’ and were dressed in the same manner as IS and Al Qaeda terrorists.\"", "He said the channel had been given the footage used in its report by a local source.", "The college administration provided AFP with their photographs of the arts festival. Certain distinctive markers can be seen in both the photographs and the footage used in the Janam TV report.", "This composite image created by AFP contains screenshots from the news report on the left hand side and cropped details from the photographs provided by the college on the right:", "In the first pair of images, the same two students can be seen riding on a motorbike with a large front lamp and wearing long white scarves.", "The second pair of images shows a black utility vehicle used by the students, while the third shows two students riding a black-and-yellow motorcycle. Distinguishing details such as the position of the car's headlamps and the pattern on the bike's frame can be identified.", "One student wearing sunglasses and a distinctive white scarf with fringing is clearly visible in both the TV footage and the pictures provided by the college. This can be seen in another composite image created by AFP:", "Actor and guest of honour at the event Salim Kumar told AFP that the Janam TV video showed the arts festival at which he had been present.", "\"This particular video that was circulated by the Janam TV was actually one among several videos that the students themselves had posted on social media. What Janam TV did was choose a video where I was not present, and then came up with baseless allegations,\" he said.", "\"I myself turned up in black dress. The kids behaved like any other normal college kid, it was a normal college function, nothing else,\" he added.", "One of the photographs provided to AFP by the college shows students wearing black clothes and monochrome scarfs greeting Kumar as he arrives at the event, with the school's distinctive gate visible behind:", "Siddiq Saifudeen, a student at the college, provided AFP with a video he had shot of Salim Kumar arriving at the event which shows the scene in the college's photographs from a different angle:", "This can be compared to a screenshot from the Janam TV report, which shows students dressed in black in front of the closed gates, with a poster of Salim Kumar clearly visible in the background:", "In the Janam TV video, the students appear to wave white flags. The Islamic State group flag, which is black with white writing, cannot be seen in the footage.", "College principal Pillai told AFP of the flags being waved that day: \"Some of them were plain white flags, while a few had random drawings like college emblem or abbreviation of college written on it. First of all it was not black as to what extremists would carry, also the flags did not had anything written on it.\"", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]