["An image of Bollywood actor Amir Khan with Turkish President Recep Tayyip Erdogan is being circulated on social media with the claim that the duo met recently.", "On February 18, Anant Gandhi, who to claims to be a member of Ahmedabad BJP IT cell, posted (archive link) the viral image and said, “Why did film actor Aamir Khan go to Turkey to meet Turkish President? Turkey’s anti-India and pro-Pakistan war continues. (फिल्म अभिनेता आमिर खान तुर्की के राष्ट्रपति से तुर्की मे मिलने क्यों गये??तुर्की का भारत विरोघ और पाकिस्तान प्रेम जग जाहिर हे।)”", "It is noteworthy that Erdogan raked up the issue of Kashmir in the Pakistani parliament on February 14 and offered to support Pakistan’s stand. The Turkish President had made a similar statement in the United Nations last year.", "Another Twitter user posted (archive link) the image and said, “The jihadi President of Turkey who opposed India for the removal of section 370 in UNO… the one who supports Pakistan openly and just visited Pakistan two days ago…Aamir, the pig who feels scared in India, has gone to this enemy.” This tweet was retweeted over 150 times.", "[ Translated from #हमने_तो_आस्तीन_मे_ही_सूूवर_पाले_है जिस तुर्की के जेहादी राष्ट्रपति एबोर्देन ने यूएनओ मे 370 हटाये जाने का भारत का विरोध किया..जिसने खूलकर पोर्किस्तान का साथ दिया और अभी दो दिन पहले भी वही कर चुका है..उसी दुशमन से मिलने..हिन्दुस्तान मे डर लगने वाले सूअर आमिर खान मिलने गया है..!!]”", "Similarly, several other accounts posted the viral image on Twitter.", "Alt News did a reverse image search on Yandex and found the viral image on Getty Images. According to the stock photo agency, the picture was clicked in Ankara, Turkey on October 6, 2017, by Kayhan Ozer.", "A News Nation report from October 8, 2017 states Khan met President Erdogan to promote his film ‘Secret Superstar’ at the Presidential Complex in the Turkish capital Ankara.", "Therefore, the social media claim that Khan met Erdogan after the latter’s recent comment on section 370 is false. Khan met President Erdogan in 2017 for a movie promotion.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]