["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A news release from the Tennessee Republican Party titled \"Anti-Semites for Obama\" seeks to cast doubt on Sen. Barack Obama's public pronouncements of support for Israel, in part, by noting Obama's role with the Woods Fund, a Chicago grantmaking foundation whose goal is to \"increase opportunities for disadvantaged people.\"", "The release says: \"The board of a nonprofit organization on which Obama served as a paid director ... granted funding to a controversial Arab group that mourns the establishment of Israel as a 'catastrophe.' \"", "Deborah Harrington, president of the Woods Fund, said Obama was, in fact, a director from 1994 through 2001, when the board approved a $40,000 grant to the Arab American Action Network for \"community organizing.\"", "The source for the allegations can be traced to a Feb. 24, 2008, article written by Aaron Klein for WorldNetDaily, an Internet publication.", "The story takes issue with the founder of AAAN, Rashid Khalidi, a Columbia University professor who is \"a harsh critic of Israel and has made statements supportive of Palestinian terror.\" The article also notes that the AAAN co-sponsored an art exhibit that featured \"works related to what some Palestinians call the 'Nakba' or 'catastrophe' of Israel's founding in 1948\" (although the exhibit came years after Obama left the Woods Fund board).", "Other blogs note that in a July 2006 interview, AAAN's executive director, Hatem Abudayyeh, referred to the \"Israeli government and its military killing machine.\"", "Abudayyeh has been bombarded with media calls from the likes of\n\nTime\n\nand\n\nNewsweek.\n\nIn an interview with PolitiFact, he dismissed the WorldNet article and others that have parroted it as misguided attempts by \"marginal right wing, anti-Muslim\" Internet voices to try to discredit Obama.", "The AAAN has no foreign policy agenda, Abudayyeh said. It is a nonprofit \"community-based organization working to improve the social, economic, and political conditions of Arab immigrants and Arab-Americans in the Chicago metropolitan area.\" The AAAN provides Chicago-based adult education, social services, youth development programs, domestic violence prevention and \"community empowerment\" through community organizing, activism and leadership development, Abudayyeh said.", "There are hundreds of organizations in the Chicago area that serve many different communities, he said, and \"individuals within those organizations have different political viewpoints on domestic and foreign policy.\" But those viewpoints have no bearing on the services provided by the organization, he said.", "Louise Cainkar, an associate professor of sociology at Marquette University, formerly served on the AAAN board and specifically remembers the 2001 grant from the Woods Fund.", "\"It was after the Sept. 11 attacks,\" said Cainkar. \"Many Arab-Americans were being victimized by hate crimes. It was a hostile environment. That was an essential grant to cope with what community members were facing.\"", "Money was used to educate Arab-Americans about their civil rights, how to report hate crimes to law enforcement and to organize the community.", "Chicago has the country's largest Palestinian-American community, said Cainkar, who is writing a book about the Arab-American experience after 9/11. Many of them are critical of Israeli government policies, she said.", "\"Does the organization takes sides? No,\" she said. \"Do individuals? I'm sure they do.", "\"AAAN is a community organization and they are careful about not getting involved in anything with foreign policy.\"", "Harrington, president of the Woods Fund, called it \"pretty ridiculous\" to suggest the AAAN promotes anti-Israeli ideas.", "The Woods Fund's goal is \"to increase opportunities for less advantaged people and communities in the metropolitan area, including the opportunity to shape decisions affecting them.\" The foundation works with a diverse array of nonprofits \"engaging people in civic life, addressing the causes of poverty and other challenges facing the region, promoting more effective public policies, reducing racism and other barriers to equal opportunity, and building a sense of community and common ground.\"\nAmong those who have gotten grants in recent years: Protestants for the Common Good, the Black Ensemble Theater Group, the Japanese American Service Committee and the International Latino Cultural Center of Chicago.", "\"It just seems like, why this one?'' Harrington said of singling out the grant to the AAAN. \"It's a witch hunt.\"", "So what do we have? Seven years ago, Obama was a director of the Woods Fund when the board approved a grant to the AAAN. And some of the leaders of AAAN have made statements that could be interpreted as anti-Israel. The release implies that Obama's public pro-Israel stance should be questioned based on the opinions of leaders from the AAAN. But there's no evidence the AAAN used any of the Woods Fund money to promote an anti-Israel foreign policy agenda. In fact, the AAAN's focus is on local initiatives, and has no foreign policy. We rate the claim Barely True.", "Tennessee Republican Party", "WorldNetDaily,\n\n\"Obama worked with terrorist,\"\n\nby Aaron Klein, Feb. 24, 2008", "BarackObama.com,\n\nPosition on Israel", "Fight Back News,\n\nInterview with Hatem Abudayyeh,\n\nJuly 2006", "Arab American Action Network", "Woods Fund of Chicago", "Interview with U.S. Rep. Robert Wexler, co-chair of Obama's Florida campaign, Feb. 29, 2008", "Interview with Hatem Abudayyeh, executive director of the Arab American Action Network, March 3, 2008", "Interview with Deborah Harrington, president of the Woods Fund of Chicago, March 3, 2008", "Interview with Louise Cainkar, associate professor of sociology at Marquette University, March 13, 2008", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]