["About this rating", "A CNN reporter stated that a purported former Donald Trump supporter discovered it was impossible to cancel recurring campaign donations.", "It isn't impossible to cancel such donations, but it may be very difficult.", "On 3 August 2016, CNN reporter Jeremy Diamond shared a screenshot via Twitter of an e-mail sent by a frustrated former Trump supporter, claiming that it was impossible for backers to cancel recurring donations to the Trump campaign:", "INBOX: Help, I set up a recurring contribution to Trump's campaign & want to cancel it: (cc: @realDonaldTrump) pic.twitter.com/TFOHhdZDlJ", "— Jeremy Diamond (@JDiamond1) August 4, 2016", "Diamond's tweet sparked a number of articles and blog posts stating it was \"impossible\" to cancel recurring Trump campaign donations, based solely or primarily on the anecdotal, secondhand claim made  in that tweet. Among the comments prompted by original tweet sent by Diamond were those left by other purported donors asserting that the claim wasn't exactly accurate:", "@JDiamond1 @realDonaldTrump Spreading bogus info. When you contribute, you get receipt with an email + tel number to call if you need help.", "— M G (@MadaGasp) August 4, 2016", "@JDiamond1 @realDonaldTrump now please stop spreading false information, its all in the email you receive when you contribute", "— Brian (@Brian_with_a_B) August 6, 2016", "A large number of commenters expressed skepticism about the report, given that the claim was anonymously  sourced from a single individual:", "@JDiamond1 @realDonaldTrump Cheap shot: we all know you can contact your bank or other form of payment you use, to cancel right away.", "— Viktor Staudt (@ViktorStaudt) August 4, 2016", "@JDiamond1 @realDonaldTrump so exactly who was this unknown mystery person that went straight to a journalist? pic.twitter.com/R4h78829CP", "— Patti Hannah (@b6sangel) August 7, 2016", "We were unable to turn up any reports about the issue that antedated Diamond's tweet. If any Trump donors had previously encountered difficulties canceling their recurring donations, they didn't seem to chatter very much about it on social media prior to 3 August 2016 (and ceasing to support Trump as a candidate is only one reason someone might seek to cancel a recurring payment). Diamond appeared to pass the baton on the story overall, updating followers later with a link to an article published by Mic:", "The folks at @mic took this ball and ran with it. Here's what they found: https://t.co/eTODFa4f3O https://t.co/cktSrf88Z2", "— Jeremy Diamond (@JDiamond1) August 5, 2016", "Diamond did not provide any further information about the claim, the claimant, or how he verified it before sharing it to Twitter. But Mic attempted to reproduce the problem on 4 August 2016 and gathered more information on the difficulty level of canceling recurring Trump donations. In a series of screenshots the site illustrated their findings, stating it was not possible to delete a stored credit card without replacing it with a separate valid credit card:", "After investigating, Mic can confirm that there is no easy option to stop recurring donations on Trump's donation site: We set up a recurring donation of $1 and found no button or other obvious way to cancel payments or remove a credit card from the system — either on the homepage, the \"update card\" page, or in your contribution confirmation email. Once you're registered, if you try to change your payment information on Trump's site, you will see no option to remove your credit card — only \"update\" it. Then, when you click on \"update card,\" you see a page that allows you to alter your payment information — but you cannot completely delete your credit card. You are forced to replace it with another valid card: Invalid numbers are rejected.", "One responder to the original tweet then objected to that claim, stating it was impossible to set up a recurring $1 donation:", ".@JDiamond1 You can't set up a $1.00 recurring amt.\nWhat else about this story is BS?@realDonaldTrump pic.twitter.com/kB4TalWOSE", "— ValerieNoFux (@OPFergVal) August 7, 2016", "However, it appears that it is possible to enter any amount as a recurring donation:", "Mic confirmed that if a putative donor set up an account, then it would be possible for that person to cancel a recurring donation made via Trump's web site:", "It turns out that there is a way to delete your card from the Trump campaign's system, but it seems you must have first registered an account and created a password: If you did not do so, there is no clear way to cancel your payment.", "Assuming you did create an account and have logged in, to stop your payment you must click the small gray question mark icon in the upper right corner of the donations page.", "Then you will see [a separate] screen. In order to delete your card, you must click \"manage.\"", "Then will you be redirected to the website of the Trump campaign's vendor. There you must click \"recurring plans,\" and only then can you cancel your monthly payment; notably, even after you cancel, there is still no obvious way to delete your card number without replacing it with another valid number.", "Per Mic's screenshots, that vendor was Revv, and we sent an e-mail inquiry to them to clarify whether it was possible to cancel the recurring payments some other way.", "However, even if the web site interface didn't allow for such a cancellation, the Federal Deposit Insurance Corporation (FDIC) notes that the the Electronic Fund Transfer Act (EFTA) provides for consumers to cancel unwanted recurring payments:", "If you have regular, automatic deductions from your checking account (to pay for expenses such as insurance premiums or utility bills), the EFTA allows you to stop those payments. First, notify the vendor. Next, tell your bank about your request at least three business days before the money is scheduled to be transferred. Your notice to the bank may be oral, but the institution may require you to provide a written follow-up within 14 days to ensure that no additional payments are made. If you fail to provide a written follow-up, the bank is no longer responsible for stopping future payments.", "Stopping an automatic, recurring payment on a credit card is different. Start by putting in your request with the vendor. But if the vendor continues to charge your credit card, contact your card issuer. You'll have 60 days to dispute the charge, starting when the card issuer sends you the statement with the charges.", "While it appears to be atypically difficult to cancel a recurring donation to the Trump campaign, it is certainly not impossible, as individuals who create an account can do so via the web interface. Overall, it seemed the problem related more to the interface of a third-party vendor (Revv) to whom the Trump campaign had outsourced donations and not to the campaign itself.", "Dennin, James.   \"Donald Trump's Campaign Website Won't Let Some Cancel Recurring Donations.\"\r\n    Mic.   4 August 2016.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]