["About this rating", "In early 2021, a series of online advertisements claimed that yesteryear's movie and TV stars today work \"9 to 5\" day jobs. We previously reported on such misleading ads about actresses Cameron Diaz and Amanda Bynes. A third celebrity to pop into the mix was the star of the television program \"CSI: Miami.\" An ad claimed that David Caruso \"now works 9 to 5.\"", "David Caruso \"now works 9 to 5,\" a false online advertisement claimed.", "Not only was the ad baseless, but it also led to a story that never ended up mentioning the actor. There was no indication that Caruso \"now works 9 to 5\" after purportedly making upwards of $375,000 per episode on \"CSI: Miami.\" The series aired new episodes from 2002-2012.", "When actors stop appearing in movies and on television, readers might see wild rumors about why they left the business. For example, one ominous headline read: \"The Real Reason We Don't Hear From David Caruso Anymore.\"", "However, \"the real reason\" some actors stop appearing in roles is often quite simple. Perhaps they decided to spend more time parenting, or they retired from the business. And that's just what Caruso did.", "After retiring from acting, he opened an art gallery for several years. Further information about his personal life was not publicly available.", "Meanwhile, readers who clicked the ad landed on a lengthy slideshow article on the Definition.org website.", "These Celebrities Turned to Normal, Everyday Jobs After Their Fame Ran Out", "Fame has been described by many as the American dream, a way to escape the humdrum of everyday work life by excelling in a glamorous field like film or sports. However, in most cases, fame is fleeting. And when this happens, celebrities are forced to reenter the workforce with the rest of us. Case in point: These 11 celebrities who worked normal jobs after their fame ran out. This list is made up of television actors, movie stars, and even an NBA Hall of Famer, all of whom slipped back into normal lives and normal jobs after they left the spotlight.", "Be sure to SHARE this list with all of the pop culture fanatics in your life, as they’ll surely be interested to see what these former stars are doing now.", "The article featured not \"11 celebrities\" but rather 24 people who purportedly had to \"turn to normal, everyday jobs after their fame ran out.\"", "Some of the pages appeared to be a bit misleading. For example, retired movie star Gene Hackman made the list. However, the story mentioned nothing of the Oscar-winning actor now working a day job.", "Actress Julia Styles appeared on the first page of the story. Despite her picture being the masthead of the article, she was never mentioned on any of the 49 pages.", "In addition to Caruso never even appearing in the story, a picture of Julia Styles was also used as clickbait on the article's first page. Her name was never mentioned on any page.", "While Caruso might be best known for his work on \"CSI: Miami,\" he also acted in the television series \"NYPD Blue.\" His major motion picture roles included parts in \"First Blood,\" the first movie in the \"Rambo\" series, as well as \"An Officer and a Gentleman,\" \"Twins,\" and \"Proof of Life.\"", "In sum, there was no indication that Caruso \"now works 9 to 5\" after being \"forced to reenter the workforce.\"", "Snopes debunks a wide range of content, and online advertisements are no exception. Misleading ads often lead to obscure websites that host lengthy slideshow articles with lots of pages. It's called advertising \"arbitrage.\" The advertiser's goal is to make more money on ads displayed on the slideshow's pages than it cost to show the initial ad that lured them to it. Feel free to submit ads to us, and be sure to include a screenshot of the ad and the link to where the ad leads.", "Jordan Liles is a Senior Reporter who has been with Snopes since 2016.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]