["About this rating", "On Jan. 7, 2021, a day after a pro-Trump mob stormed the U.S. Capitol in Washington, D.C., a picture started circulating on social media that supposedly showed damage done to the Oval Office:", "This is not a genuine photograph of a desecrated Oval Office, and the picture predates the riot. It should also be noted that the Oval Office is located in the White House, not the Capitol. While the Capitol was vandalized during the riot, no damage was done to the White House.", "The above-displayed picture has been circulating online since at least November 2020 when it was shared on social media along with messages mocking U.S. President Donald Trump in the wake of his election loss to President-elect Joe Biden.", "This image was created by Nick den Boer, an animator, director, and digital artist who posts on social media under the handle @smearballz. This image, along with three others depicting a tarnished Oval Office, was originally posted on Twitter on Nov. 8, 2020, (the day after Biden was declared the winner of the presidential election) along with the caption: \"Aftermath.\"", "Another set of similar images depicting a trashed Oval Office was posted to @Smearballs Instagram page in November 2019. Den Boer explained to us that the above-displayed images are all 3D models of the Oval Office.", "While this is a digital creation that does not depict any actual damage done to the Oval Office, the Capitol was truly vandalized during a mob riot that included the deaths of five people.", "NBC News reported:", "Hundreds of President Donald Trump's supporters swarmed the U.S. Capitol on Wednesday, leaving the halls of Congress with broken windows, vandalized walls and ransacked offices.", "Among the wreckage were pieces of broken furniture, battered doors and heaps of trash littering the hallway floors. A thick film of dust and tear gas residue remained throughout the building that contains the Senate and the House of Representatives.", "Stolen and damaged items were reported in elected officials' offices, including the wood and gold placard above House Speaker Nancy Pelosi's office.", "Updated [8 January 2021]: Article updated to credit the original artist.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]