["By Rem Rieder", "Posted on October 12, 2020", "In an interview with Fox News’ Sean Hannity, President Donald Trump falsely claimed that the state of Michigan is “closed,” specifically and falsely mentioning churches and schools.", "In fact, Michigan Gov. Gretchen Whitmer, a Democrat and a frequent target of Trump, lifted the state’s stay-at-home order on June 1. The vast majority of the state’s businesses are open with some restrictions, as are churches and schools, although some of the latter are teaching remotely.", "Trump’s comments came on the day the federal government charged six men with conspiring to kidnap Whitmer. The governor’s coronavirus restrictions had triggered vehement disapproval and led to demonstrations by armed protesters at the state Capitol in Lansing in April and May.", "Trump, Oct. 8: And she keeps her state closed, although we just won the big case, as you know, to open up Michigan, because what she’s doing is a horrible thing to the people. The churches are closed. The schools are closed, and the whole state is closed.", "Trump returned to the theme at a virtual telerally he held for Michigan voters two days later.", "Trump, Oct. 10: Uh, your governor has to open up her state. We, uh, as you know brought suit, and now. … And she lost the suit on a constitutional basis. Get your kids back to school. Uh, we’re rounding the turn on the pandemic. And we’ve done a really good job on it, and you’ll see that very soon when the vaccines start coming out, and the final therapeutics.", "Whitmer issued her stay-at-home order on March 23 in an effort to stem the state’s rising tide of COVID-19 cases. The order told residents to stay home, although there were a number of exemptions, and said that nonessential workers should not report to work and telework if possible. Whitmer lifted the order on June 1, although some businesses — including gyms, hair salons and theaters — remained shuttered. Whitmer has issued several orders on the subject.", "A number of other restrictions have remained in effect, including limits on crowd size at gatherings. But some have been lifted. For example, last month Whitmer issued an executive order allowing movie theaters and bowling alleys to reopen effective Oct. 9, although with stringent restrictions on crowd size. (Gyms and salons had reopened earlier, in June.)", "The New York Times, which monitors what’s open and what’s closed in all 50 states during the pandemic, lists nearly everything as open in Michigan, including retail stores, industries and houses of worship. The only thing it lists as shut down is indoor service at bars.", "But even that is no longer the case. According to the Michigan Department of Health & Human Services on Oct. 9: “There are no longer bar closures, but bars may only serve alcohol to gatherings seated at tables.”", "As is true in many states, the situation in Michigan schools is a mixed bag, often dependent on local conditions. Some districts have students in class, while others have opted for remote learning. And some schools that opened up had to close in the face of flare-ups of COVID-19.", "In August, Whitmer and legislative leaders reached a bipartisan agreement under which local school districts would determine their plans for reopening.", "As for places of worship, a few days after issuing her initial stay-at-home order in March, Whitmer added language stating that “[a] place of religious worship is not subject to penalty” for exceeding restrictions on crowd size.", "Despite the exemption, a group of churches filed a suit in May claiming Whitmer’s order violated religious freedom. The lawsuit sought to further exempt worshippers traveling to services from being subject to penalties. Two days after filing the suit, the churches put it on hold after Whitmer added language saying the exemption applied not just to places of religious worship but also to people attending and traveling to and from the services.", "The situation in Michigan was complicated on Oct. 2 when the Michigan Supreme Court struck down as unconstitutional the 1945 law that Whitmer had relied on in issuing her emergency orders on COVID-19. Undeterred, Whitmer blasted the narrow 4-3 decision by the court’s four Republican justices. Whitmer noted that the decision would not go into effect for 21 days. After that, she said, the rules on masks and crowd size would continue “under alternative sources of authority that were not at issue in today’s ruling.”", "After the ruling, Michigan Attorney General Dana Nessel, like Whitmer a Democrat, said Oct. 4 that she would no longer enforce Whitmer’s emergency orders through criminal prosecutions. A statement issued by her press secretary, Ryan Jarvi, also said: “However, her decision is not binding on other law enforcement agencies or state departments with independent enforcement authority. It’s her fervent hope that people continue to abide by the measures that Governor Whitmer put in place — like wearing face masks, adhering to social distancing requirements and staying home when sick — since they’ve proven effective at saving lives. … We can respect both the court’s decision and the advice of medical experts by continuing with these important measures voluntarily.”", "In the wake of the ruling, the Michigan Department of Health & Human Services, citing authority not covered by the state Supreme Court ruling, issued an emergency order replicating several aspects of Whitmer’s orders. They include requiring wearing masks at indoor and outdoor gatherings; limiting the size of crowds at indoor and outdoor gatherings, with some exceptions; and requiring bars to close indoor common areas. The crowd-size limits mirror those Whitmer had imposed and also exempt religious services.", "For indoor gatherings of between 10 and 500 people, crowd size is restricted to 20% of normal capacity. Outdoor gatherings of between 10 and 1,000 people are allowed at venues with fixed seating at up to 30% of normal capacity and at 30 people per 1,000 square feet at venues without fixed seating.", "Whitmer came under fire from Trump in April over her coronavirus restrictions. The president took to referring to the first-term governor, who was interviewed as a possible Democratic vice presidential nominee, as “‘Half’ Whitmer” and ”the woman in Michigan.” On April 17, he tweeted, “LIBERATE MICHIGAN!”", "After news of the kidnapping plot against Whitmer surfaced, the governor said Trump was “complicit” because the president hadn’t sufficiently condemned white supremacist groups. Trump campaign official Jason Miller fired back by assailing Whitmer for “the fact that she wakes up every day with such hatred in her heart towards President Trump.”", "Rhetoric aside, Michigan is not “closed,” as Trump claimed.", "Editor’s Note: Please consider a donation to FactCheck.org. We do not accept advertising. We rely on grants and individual donations from people like you. Credit card donations may be made through our “Donate” page. If you prefer to give by check, send to: FactCheck.org, Annenberg Public Policy Center, 202 S. 36th St., Philadelphia, PA 19104.", "Swing State Watch is an occasional series about false and misleading political messages in key states that will help decide the 2020 presidential election.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here for more.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]