["Facebook posts which have racked up thousands of ‘likes’ invite entrepreneurs to apply for a grant from Uganda’s Ministry of Finance, Planning and Economic Development. But a ministry spokesman told AFP that “scammers” were behind the posts, which were published by a fake account.", "The posts, which we’ve archived here and here, were published on a Facebook account called ‘Ministry of Finance, Planning and Economic Development, Uganda’. They claim to be offering $31.4 million worth of grants to ‘all deserving entrepreneurs and farmers’ in Uganda as part of a ministry scheme in partnership with the World Bank and the Global Environment Facility (GEF), a Washington-based organisation which helps fund environmental projects.", "The posts contain a link asking applicants to fill in their personal details.", "Fake account", "However, the Facebook page is fake and designed to look like the finance ministry’s official Facebook page. Below are two screenshots, showing the fake page (left) and the Ugandan finance ministry's official page (right), which we found by following a link on the ministry’s website.", "Although the two pages look almost identical, a few simple clues help to distinguish the official page from the fake. Firstly, the ministry’s genuine Facebook page has thousands more likes than the fake one. We can also use Facebook’s ‘Page transparency’ tab, which you can access on the pages’ timelines, to find out when the pages were created and who manages them.", "Below is a screenshot showing details of the fake Facebook page (left), which reveal it was created on September 19, 2019 and is managed in Kenya. On the right, transparency information for the ministry’s actual Facebook page says it was created on October 12, 2011 -- years before the fake page -- and is managed in Uganda.", "It seems Uganda’s finance ministry is well aware of people pretending to represent it. On its website, the ministry has published a warning that it ‘has no grant funding programm (sic) for small and medium entreprises’.", "‘Scammers’", "Contacted by AFP, finance ministry spokesman Jimmy Mugunga said “‘scammers” were behind the false reports.", "\"It's been more than a year since this started but it has persisted. It's not correct. We have issued a warning about it,\" he told us by phone.", "He said that if the ministry was setting up a grant programme, it would publish statements and press releases rather than a Facebook post.", "‘No such initiative’", "The fake posts claim that Uganda’s finance ministry has ‘partnered’ with the World Bank and Global Environment Facility (GEF) to offer the grants. However, the World Bank confirmed it had no involvement in any such project.", "“I can confirm that we have no such initiative running in Uganda,” a World Bank spokesperson in Uganda told AFP by email. “It is a fake website and the Ministry of Finance has already alerted the authorities about the fraudulent Facebook page.”", "We have reached out to the GEF for a comment and will update this post with any further information.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]