["U.S. Rep. Maxine Waters, D-Calif., has advocated for gun control on Twitter, but she didn’t tweet this message that was shared on Facebook on Feb. 20.", "\"Every single gun owner I have talked to has told me, ‘As soon as I walked out of that gun store, I felt a killer growing inside of me.’\" reads the screenshot of a tweet from @MaxinePWaters. \"When will we acknowledge there is no such thing as a responsible gun owner?\"", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Below the screenshot is a graphic with these words, \"I guess we are just making s--- up now.\"", "I guess we are!", "Waters has two verified Twitter accounts. @RepMaxineWaters is her account for her work as a representative, and it features the same user photo as the account featured in the Facebook post. @MaxineWaters is her account for her congressional campaigns.", "We searched both accounts for the words in the Facebook post and came up empty.", "@MaxinePWaters, the account in the Facebook post, has been suspended for violating Twitter’s rules.", "But back in 2018, Snopes fact-checked another such tweet from the account that was fooling people. Snopes then reported that @MaxinePWaters has no connection to the lawmaker.", "We rate this Facebook post False.", "Facebook post, Feb. 20, 2020", "Maxine Waters tweet, Aug. 4, 2019", "Maxine Waters congressional Twitter account, visited Feb. 20, 2020", "Maxine Waters campaign Twitter account, visited Feb. 20, 2020", "@MaxinePWaters account, visited Feb. 20, 2020", "Snopes, Is this Maxine Waters #GunControlNow tweet real? Feb. 20, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]