["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Calling on House members this month to approve federal aid for victims of Hurricane Sandy, Rep. Rodney Frelinghuysen offered his colleagues a national lens to view the destruction: the damaged area accounts for about 10 percent of the nation’s economy.\n\nThe Republican congressman made that point during a Jan. 15 debate that ended with the GOP-controlled House signing off on roughly $50 billion in emergency aid for Sandy victims.\n\nThe bulk of that funding was based on an amendment sponsored by Frelinghuysen to provide about $33 billion in additional aid. In his speech on the House floor, the congressman argued that providing the disaster relief made economic sense.\n\n\"Mister Chairman, the area damaged by Hurricane Sandy represents roughly 10 percent of our nation's economy,\" said Frelinghuysen (R-11th Dist.). \"It makes good sense, economic and fiscal, to get our region back on its feet as soon as it can.\"\n\nSteve Wilson, a senior policy adviser to Frelinghuysen, told us the statement was in reference to the combined gross domestic product, or GDP, in New York, New Jersey and Connecticut.\n\nWe found that the combined GDP in those three states was about $1.875 trillion in 2011, marking about 12.5 percent of the national GDP, according to figures from the U.S. Bureau of Economic Analysis. The 2011 figures represent the most recent data available.\n\nBut that roughly 12.5 percent figure doesn’t fully support Frelinghuysen’s statement.\n\nThe congressman referred to \"the area damaged by Hurricane Sandy,\" but the combined GDP applies to the entirety of those three states. In other words, Frelinghuysen’s figure includes parts of those states that were not damaged in the storm, including most of New York.\n\nThe U.S. Bureau of Economic Analysis does not release GDP estimates at the county level, so we can’t measure the combined GDP for the specific counties damaged in the storm. The bureau releases GDP’s by metropolitan statistical area, but they can’t be viewed as a percentage of the national GDP.\n\nIn response to our findings, Wilson argued in an e-mail that \"areas of New Jersey, New York and Connecticut far beyond Sandy’s ‘bullseye’ were deeply affected by the storm.\"\n\n\"Two and a half million people in New Jersey alone lost power, many for two weeks, as did large and small businesses, municipal and county governments. A crippling fuel shortage forced the imposition of odd-even gasoline rationing,\" Wilson said. \"New Jersey Transit, which serves tens of tens of thousands of commuters, ground to a halt. As a result, residents of undamaged areas were unable to get to their place of employment.\"\n\n\"To ignore these facts is to underestimate Sandy’s devastating effects on residents up and down New Jersey, New York and Connecticut,\" Wilson added.\n\nAbout three months since Hurricane Sandy made landfall near Atlantic City, the Democrat-led Senate on Monday approved the roughly $50 billion in emergency aid, and President Barack Obama signed the bill on Tuesday.\n\nEarlier in January, Obama signed a bill passed by Congress to provide $9.7 billion for the National Flood Insurance Program to assist Sandy victims.\n\nOur ruling\n\nDuring a Jan. 15 debate over approving federal aid for Hurricane Sandy victims, Frelinghuysen said on the House floor that \"the area damaged by Hurricane Sandy represents roughly 10 percent of our nation's economy.\"\n\nBut the congressman’s figure applies to a territory much larger than what was damaged in the storm. The statistic represents the combined gross domestic product in all of New York, New Jersey and Connecticut, and thus includes areas that were untouched by Sandy.\n\nWe rate the statement Mostly True.", "To comment on this ruling, go to NJ.com.", "C-SPAN, House Debate on Hurricane Sandy Relief, Jan. 15, 2013\n\nThe Star-Ledger, House signs off on full $50.7B Hurricane Sandy aid package, Jan. 15, 2013\n\nCongressman Rodney Frelinghuysen’s website, Frelinghuysen Measure Advances Hurricane Sandy Relief, Jan. 15, 2013\n\nCongressman Hal Rogers’ website, Rogers Praises House Passage of Emergency Legislation to Aid Victims of Hurricane Sandy, Jan. 15, 2013\n\nTHOMAS, House Roll Call Votes, accessed Jan. 28-30, 2013\n\nU.S. Bureau of Economic Analysis, Gross Domestic Product by State, accessed Jan. 28-30, 2013\n\nE-mail interview with Steve Wilson, senior policy adviser to Congressman Rodney Frelinghuysen, Jan. 23-24 and 30, 2013\n\nPhone and e-mail interviews with Ralph Stewart, spokesman for the U.S. Bureau of Economic Analysis, Jan. 28 and 30, 2013\n\nPolitiFact New Jersey, With Hurricane Sandy aid still pending, U.S. Sen. Robert Menendez says $60 billion was approved 10 days after Hurricane Katrina, Jan. 3, 2013\n\nAssociated Press, U.S. Senate approves $50B Sandy aid package, Jan. 28, 2013", "White House, Statement by the Press Secretary on H.R. 152, Jan. 29, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]