["About this rating", "Rumors are surging in the wake of George Floyd's death and resulting protests against police violence and racial injustice in the United States. Stay informed. Read our special coverage, contribute to support our mission, and submit any tips or claims you see here.", "On May 29, 2020, as protests grew in Washington, D.C., over the killing of a black man, George Floyd, at the hands of a police officer in Minneapolis, U.S. President Donald Trump was taken to a secure White House bunker due to concerns for his safety. Secret Service agents decided to move him after chants from protesters in nearby Lafayette Park could be heard in the White House, keeping him there for an hour. According to The Associated Press, this was one of the highest security alerts in the White House complex since the 9/11 terrorist attacks.", "The tweet in question appears to have been posted on May 31, 2020, and was shared by many users, including a comedian. The tweet's language implies it was sent from the bunker.", "This tweet appears to be fake, or a joke. It has not appeared on the president's timeline, and there is little indication that it was posted and deleted. Also, Trump could not have tweeted this from the bunker on May 31 because he was only there for an hour on May 29. The New York Times also reported on the timing of his tweets, suggesting he went silent around the time he was moved to the bunker:", "Businesses far away from the White House boarded up to guard against vandalism, and Mayor Muriel E. Bowser ordered an 11 p.m. curfew. The White House turned off at least some of its exterior lights.", "Mr. Trump remained cloistered inside, periodically sending out Twitter messages like “LAW & ORDER!” until the evening, when he went quiet. While some aides urged him to keep off Twitter, Mr. Trump could not resist blasting out a string of messages earlier in the day berating Democrats for not being tough enough and attributing the turmoil to radical leftists.", "Trump was presumably moved to a secure room under the East Wing of the White House. The room was described by former first lady Laura Bush in her book, where she was taken during the Sept. 11, 2001, terrorist attacks, according to the Washington Post:", "“I was hustled inside and downstairs through a pair of big steel doors that closed behind me with a loud hiss, forming an airtight seal,” she wrote. “I was now in one of the unfinished subterranean hallways underneath the White House, heading for the PEOC, the Presidential Emergency Operations Center, built for President Franklin Roosevelt during World War II. We walked along old tile floors with pipes hanging from the ceiling and all kinds of mechanical equipment. The PEOC is designed to be a command center during emergencies, with televisions, phones, and communications facilities.”", "She describes being taken to a small conference room with a large table. The National Archives later released photos of members of the George W. Bush administration in that room that day.", "Another multi-level bunker was also reportedly built under the White House after the 9/11 attacks, though it is not clear if Trump was taken here. The Washington Post assumes that this newer facility has remained unoccupied since it was built. According to Gizmodo:", "The bunker was used by White House staff after the September 11 attacks in 2001, and there’s no indication that it’s been used in the 19 years since. As far as we know, President Barack Obama never used the underground bunker despite widespread protests in D.C. during his tenure organized by the so-called Tea Party.", "In sum, due to the discrepancy between the dates Trump was actually in the bunker and the date of the tweet, as well as the fact that the tweet does not appear to have come from his actual Twitter account, we rate this claim as \"False.\"", "Baker, Peter and Maggie Haberman.   \"As Protests and Violence Spill Over, Trump Shrinks Back.\"\r\n   The New York Times.   31 May 2020.", "Beaumont, Peter.   \"Trump fled to bunker as protests over George Floyd raged outside White House.\"\r\n   The Guardian.   1 June 2020.", "Bump, Philip.   \"What we know about the White House’s secret bunkers and tunnels.\"\r\n   The Washington Post.   1 June 2020.", "Novak, Matt.   \"What Does the White House's Underground Bunker Look Like?\"\r\n   Gizmodo.   31 May 2020.", "The Associated Press.   \"Trump Took Shelter in White House Bunker as Protests Raged.\"\r\n   31 May 2020.", "Nur Nasreen Ibrahim is a reporter with experience working in television, international news coverage, fact checking, and creative writing.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]