["About this rating", "As a trade war between the United States and Canada continued to escalate in June 2018, hyperpartisan social media pages started sharing a meme with the claim that it uses an actual quote spoken by Canada's prime minister, Justin Trudeau:", "\"We don't need US farmers anymore, we have grocery stores.\"", "This quote was completely invented — apparently from whole cloth — in order to paint Canada's leader as ignorant and give bots and  trolls fodder with which to criticize the international community in defense of President Donald Trump's escalating trade war.", "This quote seemingly originated in a thread on QAnon.news, a web site dedicated to a bizarre right-wing conspiracy theory dealing in everything from \"PizzaGate\" to the \"Illuminati\" to the \"Deep State,\" and which bears a suspicious resemblance to the hall-of-mirrors style of Kremlin disinformation apparently aimed at weakening the relationships between the United States and its allies. Vice provides a brief summary of the QAnon conspiracy theory:", "Who or what is QAnon? Just asking that question sucks you into a world that's like Pizzagate on bath salts, a galaxy-brained, 4chan-bred conspiracy theory that has apparently convinced an alarming number of adults that all kinds of preposterous things are true.", "[...]", "Wielding the plausible-enough-sounding details and sprawling shadow government plot of a lesser Dan Brown novel, Q began slowly painting a picture of a reality far different from the one we live in. The resulting QAnon conspiracy theory states that Trump is not under investigation by Robert Mueller. Instead, Trump is merely playing the part of hapless conspiratorial criminal while covertly helping the special counsel pursue their true quarry: Barack Obama, Hillary Clinton, John Podesta, and all the other liberal boogeymen. (It gets a LOT crazier than that, but that's the core plot.)", "The phrase attached to Justin Trudeau was originally posted as a joke by someone completely unrelated to the prime minister. That attribution came later, when another user suggested that the phrase was \"meme material\":", "Conspiracy-minded forums of this ilk constantly push users to spread memes containing disinformation on the internet in order to \"wake up the normies.\" This thread was no different. One post read in part:", "Meme and Meme and Meme some MOAR! Your memes are what's waking up the normies.\nHit them hard, from all angles, with every meme you have, RT others tweets. KEEP GOING!\nBe your own tweet storm army.", "Sure enough, within a few days of this thread images containing a picture of Justin Trudeau and the fictional quote appeared; true to form, the usual suspects began pushing the fake quote as real:", "Regardless of what one might think of Canadian trade policies, it is safe to assume that Canada's political leader understands that grocery stores get their products from outside sources.", "Nearly identical smears have been used to target other politicians. So far, we've come across at least two other memes which placed this fabricated quote into the mouths of Democratic politicians Alexandria Ocasio-Cortez and Stacey Abrams:", "Caffier, Justin.   \"A Guide to QAnon, the New King of Right-Wing Conspiracy Theories.\"\r\n    Vice.   12 June 2018.", "Wiseman, Pau.   \"President Trump Struck the First Blow on Trade. The World Is Starting to Hit Back.\"\r\n    Time.   21 June 2018.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]