["About this rating", "In December 2018, a photograph went viral on Twitter that depicted a so-called \"mummified dinosaur\" discovered in 2011 in Alberta, Canada.  The specimen was said to be approximately 110 million years old:", "#Canada discovered a mummified dinosaur from approx 110 million years ago, finally unearthed https://t.co/F8pBZx9JLI pic.twitter.com/ENFUiQDifv", "— CoolPics (@CoolPics) December 25, 2018", "Other tweets proffered different images of the same dinosaur, as well as links to articles on NationalGeographic.com and Smithsonianmag.com detailing the discovery:", "\"Mummified\" Armored Dinosaur Makes Its Debut https://t.co/o3jyo8fSGX via @SmithsonianMag", "— JM Firecloud (@JMFirecloud) December 24, 2018", "The photographs are real. Taken at the Royal Tyrrell Museum of Paleontology in Drumheller, Alberta, they document a fossilized specimen of a plant-eating dinosaur from the Cretaceous period, described in a June 2017 article in National Geographic as follows:", "The remarkable fossil is a newfound species (and genus) of nodosaur, a type of ankylosaur often overshadowed by its cereal box–famous cousins in the subgroup Ankylosauridae. Unlike ankylosaurs, nodosaurs had no shin-splitting tail clubs, but they too wielded thorny armor to deter predators. As it lumbered across the landscape between 110 million and 112 million years ago, almost midway through the Cretaceous period, the 18-foot-long, nearly 3,000-pound behemoth was the rhinoceros of its day, a grumpy herbivore that largely kept to itself. And if something did come calling—perhaps the fearsome Acrocanthosaurus—the nodosaur had just the trick: two 20-inch-long spikes jutting out of its shoulders like a misplaced pair of bull’s horns.", "NationalGeographic.com offers a 3-dimensional, virtual tour of the nodosaur fossil, which is considered remarkable by paleontologists because it's the best preserved specimen of its kind ever discovered:", "At first glance the reassembled gray blocks look like a nine-foot-long sculpture of a dinosaur. A bony mosaic of armor coats its neck and back, and gray circles outline individual scales. Its neck gracefully curves to the left, as if reaching toward some tasty plant. But this is no lifelike sculpture. It’s an actual dinosaur, petrified from the snout to the hips.", "The more I look at it, the more mind-boggling it becomes. Fossilized remnants of skin still cover the bumpy armor plates dotting the animal’s skull. Its right forefoot lies by its side, its five digits splayed upward. I can count the scales on its sole. Caleb Brown, a postdoctoral researcher at the museum, grins at my astonishment. “We don’t just have a skeleton,” he tells me later. “We have a dinosaur as it would have been.”", "When the nodosaur died, its 18-foot-long carcass was apparently washed into an inland sea, scientists say, where it sank to the bottom and was eventually petrified inside and out by the minerals in the water and sediment covering it. The location (no longer covered by water) is now a mining site in what are known as the Athabasca oil sands.", "In media interviews, researchers participating in both the excavation and preservation of the find described the specimen as \"mummified.\" One of those scientists was Don Brinkman, director of preservation and research at the Royal Tyrrell Museum, who characterized it in remarks to the New York Times as \"basically a dinosaur mummy.\"", "\"Mummy\" is a word not often applied to dinosaur fossils, however, a fact that prompted confusion and debate in online discussions about the exhibit. One such conversation took place on Reddit.com, where a user objected in noting that \"No, it's fossilized not mummified. The difference is that the soft tissues got fossilized as well, instead of just the skeleton.\"", "Another user replied to say: \"Well, in order to get to this state it would have first become mummified and then fossilized. The reason soft tissue is so rarely preserved is because it relies on natural \"mummification\" in some sort of anoxic environment to prevent decay over the time fossilization takes.\"", "We reached out to some of the scientists at Tyrrell for clarification on their use of the term but did not receive a response by press time. Our own research suggests that the explanation above is essentially correct, however. In paleontological terms, mummification occurs when the soft tissues of a specimen are preserved under conditions that arrest the normal process of decomposition before fossilization takes place. We tend to associate mummification with extremely dry conditions, but it can also take place in moist environments inhospitable to scavengers and microbes, as paleontologist Caleb Brown explained in May 2017:", "By the time the armored carcass arrived in the ocean, the decomposition process would have begun—trillions of bacteria breaking down its cells and releasing noxious gases. Its body would have started to inflate like a great, stinky flesh balloon, buoying it along on the warm shallow sea. Bloat and float, marine biologists call it. The putrid hot pocket would continued on its merry way, until eventually, something caused it to explode.", "“At some point, it would have burst and sank rapidly,” Brown said. “We know that because we have this impact crater preserved where it was found.”", "After smashing unceremoniously into the seafloor, the deflated nodosaur was probably buried under a thick layer of mud, protecting it from scavengers. Low oxygen levels at the bottom of the ocean could have also impeded decomposition. Eventually, the beast became petrified through and through, hard minerals replacing its squishy soft tissues. Although according to Brown, the soft bits don’t seem to be entirely gone.", "A fossilized dinosaur that underwent a similar process of underwater mummification was discovered in North Dakota in 2006. It was said at the time to be one of only a handful of mummified dinosaur fossils known to exist, and that remains true today, according to Brown:", "Brown emphasized that the conditions which led to this nodosaur becoming petrified whole are extremely unusual. More unusual still is humans happening to stick their shovels in precisely the right spot to find such a creature. But he doesn’t doubt there are more petrified beasts of the Cretaceous out there, swallowed whole by the Earth by some strange combination of death and physics.", "Andrews, Travis M.   \"'Rare as Winning the Lottery': New Dinosaur Fossil So Well-Preserved It Looks Like a Statue.\"\r\n    The Washington Post.   12 May 2017.", "Daley, Jason.   \"Spectacularly Detailed Armored Dinosaur 'Mummy' Makes Its Debut.\"\r\n    Smithsonian.   15 May 2017.", "Greshko, Michael.   \"The Amazing Dinosaur Found (Accidentally) by Miners in Canada.\"\r\n    National Geographic.   June 2017.", "Lee, Christopher.   \"Scientists Get Rare Look at Dinosaur Soft Tissue.\"\r\n    The Washington Post.   3 December 2007.", "Smith, Craig S.   \"'Dinosaur Mummy' Emerges from the Oil Sands of Alberta.\"\r\n    The New York Times.   12 May 2017.", "Stone, Maddie.   \"How Does a 110-Million-Year-Old Dinosaur Still Have Its Skin?\"\r\n    Gizmodo.   15 May 2017.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]