["About this rating", "In late December 2020, a social media post went viral that stated houses with five-pointed stars adorning their exteriors indicate that the home's residents are \"swingers,\" a term sometimes used to mean couples that swap sexual partners.", "So this morning, my mom was trying to pull Xmas gift ideas out of us. I mentioned a metal star for the exterior of my house (like in the photo). I was sad when the sellers didn't leave it lol.\nMy sister tells me it's a \"swingers code\" to attract other couples. WHA?\nGoogle confirms.\nI had NO idea this was a thing!!", "Naturally I'm noticing all the houses with stars now and can't help but wonder.\nI see you, you filthy animals", "We didn't find any evidence to support the claim that \"swingers\" put five-pointed stars outside their homes to attract potential \"swinger\" partners. What we did find was an article published by the news and entertainment site Distractify, which traces the \"swingers\" star rumor back to a 2007 post on the StrippersOnline message board.", "The stars, namely the five-pointed metal ones that appear on some houses, are more widely known as barn stars. Sometimes they're called \"Amish barn stars.\" They do have a signifance, but it's not that the home's inhabitants are swingers. Ontario, Canada-based, news outlet The Voice reported the stars are most often spotted on homes of, and bear a special significance, for Pennsylvania Dutch families. The Pennsylvania Dutch are an American cultural group that emigrated from southern Germany to the U.S.", "The Pennsylvania-based local newspaper The Morning Call reported that what the stars mean may vary according to whom you ask, but broadly speaking, they are seen as bringing good luck or protection. Some even attribute different meanings to whatever color the star may be painted.", "Anyone can readily find a barn star for purchase with a simple Google search — they are fairly common decorations, particularly in places like Pennsylvania. And no, you won't be putting up a bat signal for itinerant swingers.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]