["About this rating", "A dubious Facebook \"satire\" page invoked former First Lady Michelle Obama's name in a 24 June 2018 post trying to paint the L.L. Bean outdoors gear company as being biased against gun owners.", "The post, by America's Last Line of Defense, displayed a company storefront alongside the following caption:", "L.L. Bean's largest stockholder is Michelle Obama.\nLast week the CEO, Hammond C. Heis, announced that no registered gun owner will be employed by their company.", "Like everything else the site publishes both on its Facebook page and its regular web page, the complaints are fabricated. The company's actual CEO is Stephen Smith. It is also a privately-held company, meaning that it has no stockholders at all.", "While LLOD called for a boycott of L.L. Bean in its post, it actually did face one in January 2017, after United States President Donald Trump revealed that Linda Bean — the granddaughter of company founder Leon Leonwood Bean and a member of its board of directors — had lent him her support. The younger Bean had donated to a political action committee backing Trump's presidential bid.", "\"L.L.Bean does not endorse political candidates, take positions on political matters, or make political contributions,\" executive chairman Shawn Gorman said in a statement. \"Simply put, we stay out of politics. To be included in this boycott campaign is simply misguided.\"", "While Gorman asked that L.L. Bean not be targeted by the \"Grab Your Wallet\" campaign, the company remains listed on the boycott effort's web site.", "In March 2018, however, the company did take a gun-related action when it instituted a policy stating that gun buyers at L.L. Bean stores must be at least 21 years old.", "Bhasin, Kim. \"L.L. Bean Faces Boycott for Family Member Donation to Trump PAC.\"\r\n    Washington Post, accessed via chicagotribune.com. 10 January 2017.", "Reuters. \"L.L. Bean Joins Kroger, Walmart in Raising Minimum Age for Gun Sales.\"\r\n    2 March 2018.", "Arturo Garcia is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]