["A video of a white saree-clad woman surrounded by a crowd of people, including a purported police officer and a reporter is viral on social media with the claim that the woman is TMC candidate from Ulluberia Sajda Ahmed who is saying that she will not allow Ram naam and Hari naam in West Bengal and will provide shelter to Rohingyas. From the Facebook account of one Pranab Das, the video has nearly 25,000 views.", "TMC candidate of Ulluberia Sajda Ahmed announces that Harinam and Ramnam and Marxism will not be allowed in West Bengal and Rohingyas will be given shelter in West Bengal.", "Posted by Pranab Das on Friday, 10 May 2019", "It is widely shared by individual users on Facebook with the caption – “TMC candidate of Ulluberia Sajda Ahmed announces that Harinam and Ramnam and Marxism will not be allowed in West Bengal and Rohingyas will be given shelter in West Bengal.”", "The same video has also been shared with a slightly changed caption – “ममता के नेता और सरकार… Must watch….Trinamul leader KAKOLI GHOSH DASTIDAR supports ROHINGYA Muslims unabashedly. Police also openly supports herSays, will not allow RAM naam, Hari naam to be chanted. Openly threatens Reporter calling for cancellation of his licence. Where is West Bengal heading to….Shame on us.” While the alleged TMC candidate’s name in the earlier caption was Sajda Ahmed, she was called Kakoli Ghosh Dastidar in this one.", "Must watch…. Trinamul leader KAKOLI GHOSH DASTIDAR supports ROHINGYA Muslims unabashedly Police also openly supports her Says, will not allow RAM naam, Hari naam to be chanted. Openly threatens Reporter calling for cancellation of his licence. Where is West Bengal heading to….Shame on us", "Posted by Manoj Choudhary on Saturday, 4 May 2019", "In the over 2-minute clip, the alleged reported asks, “Didi, you are saying that you will let them stay here. But what will happen to the citizens of West Bengal?” To this, the woman responds, “People from West Bengal will stay as they do and these people will also stay as they want to. How do you get the courage to ask such questions?” The crowd begins to cheer for her. “Allah is there. Allah is watching. Allah will protect them. I am here and my brothers and sisters will stay here,” says the woman, adding that she will not tolerate Ram naam, Hari naam and communist chants.", "When questioned about the security of West Bengal citizens in case of terrorist infiltration, the woman answers that she will handle whatever happens to the people, then asks the purported cop to take away the reporter’s license. “I will not let Centre’s conspiracy prevail,” she says amidst the anchor’s “waah Didi waah” statements of condemnation. The woman further tells the people that she will give him Rs 2 per kg rice, Aadhaar card and cycles, among other things.", "The video is viral with two different captions. While the first one claims that the woman in the clip is TMC Ulluberia candidate Sajda Ahmed, the other one alleges that she is TMC politician Kakoli Ghosh Dastidar. While the Trinamool Congress does have politicians by those names, their facial features do not match those of the woman from the video.", "As evident from the photo montage below, Kakoli Ghosh Dastidar looks contrastingly different from the woman in the video. A similar distinction cannot be made in case of Sajda Ahmed, however, there is a slight difference in the shape of her nose and that of the unidentified woman. Furthermore, their spectacle frames are different.", "As the entire conversation between the woman and the purported cop and reporter is in Bengali, social media users who do not know the language have little at their disposal. However, the one clue that can be picked up from the video is the reporter constantly addressing the woman as ‘didi’, a word commonly used for West Bengal Chief Minister Mamata Banerjee. Furthermore, it is also unlikely that a police officer accedes to being shot on camera while acting at the behest of a politician as the cop in the video does. The whole spectacle seemed a little out of proportion.", "This video was earlier debunked by Boomlive and is actually a part of a street play. The woman dressed in a white saree played the role of CM Banerjee. A longer version of the video was found on YouTube and was uploaded in March last year. It drew over 1.4 million views.", "The actor who played the role of the reporter says at about 2:40 minutes, “You saw all the promises our honourable Chief Minister made to them. If this state’s or the country’s security is at risk due to Rohingya infiltration, who will take the responsibility?”", "The man referred to the woman who was similarly dressed as Mamata Banerjee as ‘honourable Chief Minister’, which makes it clear that the people in the video were a part of a play.", "Since the start of the 2019 Lok Sabha elections, West Bengal and the state’s Chief Minister Mamata Banerjee have been a constant target of misinformation.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]