["By Angelo Fichera", "Posted on August 7, 2020", "A viral video on Facebook claims to show a “campaign ad” for President Donald Trump that was “banned” by Facebook. There’s no evidence the video — showcasing audio from Trump’s 2020 State of the Union address — was “banned,” or that it’s an ad from the Trump campaign.", "Facebook recently removed a video posted by President Donald Trump’s reelection campaign in which Trump claimed that children are “virtually immune” to COVID-19. The platform said it violated a policy on COVID-19 misinformation that can lead to physical harm. (As we’ve explained, while children rarely become seriously ill from COVID-19, they can get sick.)", "A viral post now being shared by thousands, however, is erroneously claiming to show a Trump “campaign ad” that Facebook has “banned.” There is no evidence it was “banned” or removed, or that it is an ad from the campaign.", "“President Trump campaign ad being banned by Facebook,” the video meme reads.", "The post, uploaded in late June, has more than 187,000 shares — and remains live, undercutting the assertion that the underlying video has been “banned” by the platform. It’s been viewed more than 4 million times.", "The supposed “ad” runs about 3:45 seconds and features audio from the end of Trump’s 2020 State of the Union address.", "The video depicts Trump offering an optimistic view of the country by discussing its history: It pairs photos and video clips with Trump’s speech as he talks about America’s “heroes” and “legends” such as Thomas Edison, President Abraham Lincoln and Harriet Tubman, among many others.", "“America is the place where anything can happen. America is the place where anyone can rise,” Trump says. “And here, on this land, on this soil, on this continent, the most incredible dreams come true.”", "The start of the video shows a small text reading “@StormIsUponUs.” We found an Instagram account using that handle that posted the video following the State of the Union in February. The video is still live and available; Instagram is owned by Facebook.", "There are also other uploads of the video with the title “The Best Is Yet To Come!” on YouTube and Facebook — the latter of which refers to it as “Trump’s new ad.”", "We did not find instances of the video being advertised by the Trump campaign in the Facebook Ad Library (which includes ads that have been taken down).", "Trump and his campaign have put out other videos using the phrase the “best is yet to come” that are still on Facebook. The phrase also was part of a Trump Super Bowl ad and an ad showcasing his July 4 speech (which uses some similar imagery — and the same footage when referring to the Wright brothers — as the viral Facebook video).", "Facebook has, as we said, at times removed content posted by the Trump campaign that it said violated different policies.", "In another example, the platform took down campaign ads earlier this year that instructed users to “RESPOND NOW” to an “Official Congressional District Census.” The ads were not for the U.S. Census — and instead went to a campaign website — and Facebook said the ads would be taken down to “prevent confusion around the U.S. Census.”", "But it’s not true that the video in question, highlighting a portion of Trump’s 2020 State of the Union address, was a “campaign ad” that was “banned” by the platform.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Facebook has no control over our editorial content. Our previous stories can be found here.", "Glazer, Emily and Janet Adamy. “Facebook Removes Trump Campaign Ads, Citing Census Interference Policy.” Wall Street Journal. 5 Mar 2020.", "“Interview: Donald Trump Calls In to Fox and Friends for an Interview.” Factbase. 5 Aug 2020.", "Kang, Cecilia and Sheera Frenkel. “Facebook Removes Trump Campaign’s Misleading Coronavirus Video.” New York Times. 5 Aug 2020.", "McDonald, Jessica. “What Science Says About Children, COVID-19 and School Reopenings.” FactCheck.org. 24 Jul 2020.", "Moore, Mark. “Trump pledges ‘best is yet to come’ in Super Bowl campaign ad.” New York Post. 30 Jan 2020.", "“Remarks by President Trump at South Dakota’s 2020 Mount Rushmore Fireworks Celebration | Keystone, South Dakota.” White House. 4 Jul 2020.", "“Remarks by President Trump in State of the Union Address.” White House. 4 Feb 2020.", "Rosen, Guy. “An Update on Our Work to Keep People Informed and Limit Misinformation About COVID-19.” Facebook. 16 Apr 2020.", "Team Trump (@officialteamtrump). Facebook Ad Library. Accessed 7 Aug 2020.", "Trump, Donald (@DonaldTrump). Facebook Ad Library. Accessed 7 Aug 2020.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]