["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "With protests continuing in Ferguson, Mo., following the shooting of an unarmed teenager, police have rolled out an arsenal of weapons, vehicles and riot gear to help quell any unrest in the St. Louis suburb.", "While local officials say they’re trying to maintain safety and protect property, the sight of police officers in combat gear has sparked a national conversation about whether the police need to be outfitted with military-grade equipment.", "HBO television host John Oliver took aim at the militarization of civilian police forces in his Sunday night show, Last Week Tonight, that aired August 17.", "Oliver said federal funding for anti-terrorism efforts has been doled out on such a massive scale that even Keene -- with fewer than 30,000 residents -- secured a military-grade truck for its police department.", "\"This has happened on such a scale that it’s enabled small towns like Keene, N.H., to apply for a BearCat, a military-grade armored personnel truck, which they needed because, as their application argued, ‘the terrorism threat is far-reaching and often unforeseen,’ and cited as a possible target their annual Pumpkin Festival.\"", "He mused that the armored vehicle would be an effective deterrent for pumpkin smashers.", "\"Good luck easily out-maneuvering that, teenagers with baseball bats!\" he said.", "We wondered whether Oliver was playing straight with the facts, even as he played the episode for laughs. Did the Keene Police Department really cite a terrorism threat at the Pumpkin Festival when it asked for federal money?", "We checked with Oliver’s staff, but they’re on a two-week break and unable to respond.", "First, some background on the Pumpkin Festival. It’s held each year in October and draws as many as 70,000 people to downtown Keene. It is best known for the city’s ongoing attempts to set the world record for the most lit jack-o’-lanterns in one place.", "So what does an iconic New England fall festival have to do with armored vehicles and terrorism?", "Keene’s city council accepted a federal grant in 2012 to purchase the armored personnel carrier, named a \"BearCat\" by its manufacturer. At the time, a city councilor called the $285,933 vehicle a \"poster child of waste.\"", "The BearCat hit the streets on Nov. 20, 2012, after a contentious debate among Keene residents about its necessity. Funding came from the U.S. Department of Homeland Security through a grant managed by the New Hampshire Department of Safety.", "During public meetings leading up to the purchase, it appears there was little conversation about the threat of terrorism in southern New Hampshire. The discussion centered mainly around how the vehicle would be deployed during routine law enforcement procedures, such as evacuating residents during a flood or policing the campus of Keene State College.", "\"The original reason for filing the grant application was to acquire the piece of equipment in case there was some kind of crisis -- some kind of emergency that required the use of that type of equipment,\" said Keene Mayor Kendall Lane, who was serving on the city council at the time.", "He said in his recollection, the BearCat has been deployed only twice since it was acquired. In both instances, police were dealing with potentially armed subjects.", "Lane said Keene didn't cite the Pumpkin Fest as the only reason to get the BearCat, and for that reason, he believes Oliver’s bit was a little misleading.", "\"It was humorous, but you know, the implication was that the Pumpkin Fest attracts a few hundred people in a rural part of America that would never be subject to a terrorist act. It was humorous. It was funny, but it was miscast.\"", "By our reading, though, Oliver is correct that the Keene Police Department’s written application for federal funds focused mainly on terrorism -- aligning with the aims of the Department of Homeland Security.", "Keene’s Pumpkin Festival is among several annual events that draw large crowds and are \"susceptible to terrorist attacks,\" the application states.", "Keene Police Chief Kenneth Meola also mentioned the threat of terrorism during a meeting with Keene State College students in February 2012.", "\"Do I think al-Qaeda is going to target Pumpkin Fest? No, but are there fringe groups that want to make a statement? Yes, and we should prepare for that,\" he said. \"It is a target in the New Hampshire region.\"", "Jim Massery, government sales manager for the Massachusetts company that manufactures the vehicles, also alluded to the threat of terrorism during an interview with Huffington Post.", "\"We don’t know what the terrorists are thinking,\" said Massery, of Lenco Armored Vehicles. \"No one predicted that terrorists would take over airplanes on Sept. 11. If a group of terrorists decide to shoot up a shopping mall in a town like Keene, wouldn't you rather be prepared?\"", "While the Department of Homeland Security perceived a significant enough threat in Keene to authorize funds for the BearCat, Oliver isn’t the only commentator who has second-guessed the decision.", "U.S. Sen. Tom Coburn, R-Okla., a member of the Committee on Homeland Security and Governmental Affairs, detailed Keene's vehicle purchase in his 2012 report on misguided and wasteful spending in terror-prevention grant programs.", "The American Civil Liberties Union also devoted a section of its comprehensive June 2014 report on the militarization of American police departments to Keene’s BearCat.", "\"Not even Keene city officials believed that the city actually needed the BearCat to thwart terrorism,\" the ACLU report reads. \"To explain why the police included the word ‘terrorism’ on their application for federal funding for this purchase, a city council member said, ‘Our application talked about the danger of domestic terrorism, but that’s just something you put in the grant application to get the money. What red-blooded American cop isn’t going to be excited about getting a toy like this? That’s what it comes down to.’\"", "Our ruling", "Oliver said the Keene Police Department cited its annual Pumpkin Festival as a potential target for terrorism when it applied for grant money to buy an armored personnel truck.", "Keene’s mayor says the city had a variety of reasons for seeking the BearCat, but Oliver was correct to state that the city cited the Pumpkin Festival as a possible target for terrorists. We rate Oliver’s claim True.", "HBO, Last Week Tonight with John Oliver segment on Ferguson, Mo., and police militarization, Aug. 17, 2014", "PundiFact, \"In segment on Ferguson, John Oliver says SWAT raids are up 1,400 percent,\" Aug. 18, 2014.", "Keene Equinox, \"Life of Keene BearCat examined further,\" Feb. 29, 2012.", "New Hampshire Union Leader, \"BearCat brouhaha revs up Keene,\" Feb. 22, 2012.", "Huffington Post, \"Police 'Tank' Purchase Riles New Hampshire Town,\" Feb. 16, 2012.", "Keene Sentinel, \"BearCat foes out in force,\" Feb. 10, 2012.", "Office of U.S. Sen. Tom Coburn, \"Safety at Any Price,\" December 2012.", "American Civil Liberties Union, \"War Comes Home: The Excessive Militarization of American Policing,\" June 2014.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]