["Democratic presidential candidate Joe Biden speaks at the Constitution Center in Philadelphia on Sept. 20, 2020. (AP)", "• According to the Supreme Court website, the justices have scheduled five days of oral arguments in October and two more in November before the polls close.", "Two days after the death of Supreme Court Justice Ruth Bader Ginsburg, Democratic presidential nominee Joe Biden gave a speech at the National Constitution Center in Philadelphia. In it, he argued that Ginsburg’s seat should not be filled in a rush, just weeks before a presidential election.", "In the speech, Biden said the Constitution \"was designed to give voters one chance, one chance to have their voice heard in who serves on the court. And by the way, there’s no court session between now and the end of this election.\"", "The second sentence was seemingly an additional argument for slowing down the process. It seemed to be an ad-lib, since it didn’t appear in the prepared remarks sent out by his campaign.", "But it was incorrect.", "On its website, the Supreme Court lists five days of oral arguments scheduled for October: the 5th, 6th, 7th, 13th and 14th. It also lists oral arguments for Nov. 2 and Nov. 3. Nov. 3 is Election Day.", "Among the scheduled oral arguments are:", "• Tanzin vs. Tanvir, a religious freedom case.", "• Google LLC vs. Oracle America Inc., a copyright protection case between Silicon Valley giants.", "• Torres vs. Madrid, a Fourth Amendment seizure case.", "• Pereida vs. Barr, a case about the definition of a crime for purposes of deportation.", "• Jones vs. Mississippi, a juvenile sentencing case.", "The Biden campaign did not respond to an inquiry for this article.", "Biden said, \"There's no court session between now and the end of this election.\"", "That’s disproven by the Supreme Court’s own website, which lists five days of oral arguments in October and two more in November before the polls close.", "We rate the statement False.", "Joe Biden, remarks at the National Constitution Center, Sept. 20, 2020", "Supreme Court, calendar for October, accessed Sept. 21, 2020", "Oyez.org, Tanzin vs. Tanvir, accessed Sept. 21, 2020", "ScotusBlog, Google LLC vs. Oracle America Inc., accessed Sept. 21, 2020", "ScotusBlog, Torres vs. Madrid, accessed Sept. 21, 2020", "ScotusBlog, Pereida vs. Barr, accessed Sept. 21, 2020", "ScotusBlog, Jones vs. Mississippi, accessed Sept. 21, 2020", "NBC News, \"'Constitutional abuse': Biden challenges Senate Republicans in blistering Supreme Court speech,\" Sept. 20, 2020", "CNN, \"Biden falsely claims Trump campaign only asked him for Supreme Court list after Ruth Bader Ginsburg died,\" Sept. 20, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]