["About this rating", "Fears over the presence of a chemical known as trisodium phosphate (or tribasic sodium phosphate; TSP) in cereals like Lucky Charms and Cheerios have been circulating on social media sites and message boards for years. While uncontroversially used as an additive in cereal since at least the 1950s, a popular picture highlighting Lucky Charms' ingredients was ultimately able to generate a recent bout of panic about its use:", "The issue here is not whether these cereals contain TSP — they (and many other food items) do. The issue, similarly, is not whether TSP is used as a cleaning product — it is. The issue, instead, is whether or not a chemical used as a cleaning product can also be used safely as a food additive — it can.", "An apt comparison for a number of reasons is the chemical sodium bicarbonate. This compound is used in heavy-duty cleaning, as an agent to de-tarnish silver, and even to extinguish fires. Sodium bicarbonate, however, is better known as baking soda, and it is instrumental as a leavening agent (something that makes dough rise) when baking, among other things, chocolate chip cookies.", "TSP, too, can be used as a leavening agent, as both sodium bicarbonate and TSP react with acidic compounds present in dough to release carbon dioxide (creating air bubbles that cause the dough to rise). More relevant, but related to the same underlying chemistry, is the fact that both TSP and sodium carbonate can serve as buffering agents, which resist changes in pH.", "In terms of food science, buffers are added to counter changes to pH caused by the addition of more acidic elements during the production of a food item. This helps to maintain texture and lengthen that product’s shelf-life. In terms of cleaning, an alkaline buffer like TSP is efficacious because it can retain a high pH—a useful trait for removing grime—even when it is diluted in water. More important, however, TSP’s use as a food buffering agent and its use as an industrial cleaning agent involve vastly different scales.", "When sold as an industrial product for heavy-duty cleaning or paint-removal, TSP generally comes as a water soluble powder that, when mixed as indicated for cleaning, produces a high pH comparable to bleach. A typical solution for heavy duty cleaning is ½ cup of TSP dissolved in 2 gallons of water — equivalent to about 300 grams of TSP. This is a massive amount, considering that a regular box of Cheerios (all ingredients included) contains just over 300 grams of food in total.", "That higher amount, in part, gives TSP the chemical properties needed to act as a reliable cleaning agent while also imparting a modicum of physical risk, both attributable to its high pH. But at the amounts found in food as an additive, there is no impact on human health whatsoever. Even if it were found in higher concentrations in cereal, TSP’s risk to humans  would not be through its inherent toxicity or carcinogenicity, but by upsetting the balance of other minerals in your body such as calcium, as described by the FDA:", "It is the opinion of the Select Committee that the Ca:P ratio of the diet is important, especially if it varies substantially from 1:1 owing to the relatively high intake of phosphorus. [...] In laboratory animals and presumably in man, nutritional secondary hyperparathyroidism and bone resorption may be induced when the diet furnishes an otherwise adequate amount of calcium but excessive levels of phosphorus.", "This would be a fine place to point out that sodium bicarbonate, as well, can cause health problems up to and including a stomach rupture if an extreme and unrealistic amount is consumed. At the amounts found in food, though, both TSP and sodium bicarbonate are perfectly safe, as the FDA concludes:", "None of the [approved sodium phosphate additives are] intrinsically harmful and their use in foods does not present a hazard when the total amount of phosphorus ingested and the intakes of calcium, magnesium, vitamin D, and other nutrients are satisfactory. The current use of calcium phosphates in food processing is without harmful effects on the health of consumers and, in some instances, may be advantageous.", "Because representing a phosphate salt as a paint thinner is a rhetorical device used to sow scientifically uninformed fears about a commonly used food additive without any concern for scale or mechanism, and because the compound itself presents no reasonable risk to humans, we rank this claim as false.", "National Research Council (U.S.).   \"The Use of Chemical Additives in Food Processing.\"\r\n    National Academies, 1956.", "Encyclopedia Britannica.   \"Leavening Agent\"\r\n    Accessed 22 May 2017.", "UNC Eshelman School of Pharmacy.   \"Buffers and Buffer Capacity.\"\r\n    Accessed 22 May 2017.", "INCHEM.   \"Phosphoric Acid and Phosphate Salts.\"\r\n    Accessed 22 May 2017.", "U.S. Food and Drug Administration.   \"Phosphoric Acid and Phosphate Salts.\"\r\n    1975", "INCHEM.   \"Sodium Bicarbonate.\"\r\n    Accessed 22 May 2017.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]