["About this rating", "A variety of coverage options are available, and monthly costs vary according to plans selected. Consumers at certain income levels are not eligible for subsidies and pay more.", "The majority of consumers won't be affected by the hike due to a tax credit, and most people covered by Obamacare get the tax credit which offsets costs.", "On 24 October 2016, health insurance broker Tyler McClosky created a phenomenon on Facebook when he posted a screen shot of what it would cost for a family of four with a total household income of $98,000 in Lee County, Florida, to buy insurance on the Affordable Care Act's marketplace:", "We were able to recreate McClosky's viral post using the shopping tool at healthcare.gov and the same data he entered (two non-smoking parents with a combined income of $98,000 and two 8-year-old children in Lee County, Florida):", "But data sent by a Department of Health and Human Services official pointed out that 81 percent of families of that size on an Obamacare plan have household incomes of less than $48,000. So the average family currently subscribing to Obamacare would not be paying nearly as much as the image above depicts in their out-of-pocket premium costs. We entered the same data but changed the income to $48,000 here:", "McClosky created the post on 24 October 2016, the same day a report by the Department of Health and Human Services was released detailing an average 25 percent increase in costs to the Affordable Care Act (Obamacare) customers:", "Across states using the HealthCare.gov platform, the median increase in the second-lowest cost silver plan premium is 16 percent, while the average increase is 25 percent.", "This figure varies based on locale. For instance, a table compiled by the Kaiser Family Foundation shows that people in Phoenix, Arizona will have a 145 percent premium increase, but a tax subsidy will mean a 40-year-old, non-smoking Phoenix resident with a $30,000 annual income will not have to pay any more than last year (which is roughly $207 a month, depending on the plan selected).", "According to data sent by the Department of Health and Human Services (HHS), a majority of consumers covered by the ACA (85 percent) qualify for tax credits that keep pace with premium increases, so many won't see much of an impact on their out-of-pocket costs.", "But McClosky was addressing people whose income disqualifies them from that assistance. He told us he used the $98,000 annual income as an example because that is the threshold at which households of four with two children do not qualify for tax credit assistance (you qualify if you make up to 400 percent of the federal poverty line). He said he created the post because he wanted to raise awareness about what it costs to insure a family in which each adult is making an annual salary of $44,000, and neither has access to employer-based health care — a fairly common situation in the United States.", "His concern, he said, is that only consumers who qualify for a tax subsidy can afford insurance under ACA. If their incomes are too high to qualify for assistance, they may simply go without. While the number of uninsured Americans dropped under ACA, as of 2015, 28.5 million people still lack coverage. Per the Kaiser Family Foundation:", "Even under the ACA, many uninsured people cite the high cost of insurance as the main reason they lack coverage. In 2015, 46% of uninsured adults said that they tried to get coverage but did not because it was too expensive. Many people do not have access to coverage through a job, and some people, particularly poor adults in states that did not expand Medicaid, remain ineligible for financial assistance for coverage. Some people who are eligible for financial assistance under the ACA may not know they can get help, and others may still find the cost of coverage prohibitive. In addition, undocumented immigrants are ineligible for Medicaid or Marketplace coverage.", "Eric Seiber, associate professor of health services management and policy at Ohio State, said that the health care system in the United States is the most expensive in the world, and costs have steadily increased over the years. Despite its name, the Affordable Care Act doesn't actually address the cost of health care itself:", "The ACA is not health care reform. It’s health insurance reform. It really doesn’t do that much about affordable care or patient protection beyond the subsidies and Medicaid.", "People's perception that their wages have been flat is an effect of compensation increases going to cover rising healthcare costs instead of into their paychecks, Seiber said.", "McClosky, who sells health and life insurance plans in Florida, said that the Affordable Care Act has had the effect of diminishing competition among carriers. For instance, Lee County residents can only purchase Blue Cross Blue Shield. Prices in Miami-Dade are lower than in Lee County, because there are more carriers competing with each other.", "McClosky says insurance carriers have been squeezed by part of the mandate which requires them to spend 80 to 85 percent on claim payouts and health care quality improvement. He pointed to Assurant, a 123-yea-old insurer that specialized in individual and small business plans. They could not survive under the ACA and filed for bankruptcy in 2015.", "Health care is a source of roiling political debate for years. While the cost of health plans under Obamacare will go up an average 25 percent as of 1 November 2016, the majority of consumers won't experience much change in their out-of-pocket costs when open enrollment starts for 2017, because the tax credits will buffer that increase. Further, as the New York Times pointed out, many Americans are shielded from the immediate costs of health care by employer-based insurance or the public programs:", "These increases really matter only for those who buy their own insurance. Most people are unaffected by the rate increases because they get their insurance through an employer or are covered through government programs like Medicare, Medicaid or the Department of Veterans Affairs.", "Only a small fraction of Americans who have insurance buy individual policies. There are about 10 million people in the Obamacare markets and around an additional seven million who buy health plans outside the marketplace, according to Obama administration estimates. The published rate increases apply only to people who shop in the markets, but premiums are expected to go up sharply for the other plans as well.", "However, as McClosky's post makes clear, whether people notice it or not, American health care costs are high — and not everyone can qualify for available assistance.", "Kaiser Family Foundation. \"2017 Premium Changes and Insurer Participation in the Affordable Care Act’s Health Insurance Marketplaces.\"\r\n  25 October 2016.", "ASPE Research Brief. \"Health plan choice and premiums in the 2017 health insurance marketplace.\"\r\n  24 October 2016.", "Abelson, Reed, and Sanger-Katz, Margaret. \"A Quick Guide to Rising Obamacare Rates.\"\r\n  The New York Times. 25 October 2016.", "Boulton, Guy. \"Milwaukee-based Assurant Health to be sold off or shut down.\"\r\n  Milwaukee Journal Sentinel. 28 April 2015.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]