["About this rating", "Across the United States, protests took place through May and June 2020 against the deaths of Black people at the hands of police, spurred by the death of George Floyd, an unarmed Black man in Minneapolis. Law enforcement agencies have increasingly relied on the use of tear gas as a method of controlling protesters and crowds. Authorities, for instance, used tear gas in Washington, D.C., to clear protesters from the area of a church that U.S. President Donald Trump walked to for a photo opportunity.", "Snopes readers have asked us whether tear gas is banned for use in warfare. Tear gas — deemed a \"Riot Control Agent\" according to the U.S. Centers for Disease Control and Prevention (CDC) — is indeed banned by the 1997 international Chemical Weapons Convention (CWC) for use by nation states in warfare. The CWC, to which the U.S. is a signatory, uses the phrase \"Riot Control Agents\" in its text. According to Article 1, \"General Obligations,\" the law states that, \"Each State Party undertakes not to use riot control agents as a method of warfare.\"", "However, the law does not stop domestic law enforcement officers in individual nations from using tear gas as a method of riot control on streets and in other spaces in their respective countries. The law states:", "\"Purposes Not Prohibited Under this Convention\" means:", "...(d) Law enforcement including domestic riot control purposes.", "The logic behind the distinction, according to one report, is that once riot control agents were used as a weapon by nations in war, the fight could escalate to include more dangerous chemical weapons, like nerve gas. The American Civil Liberties Union (ACLU) has called this decision \"controversial\" and cited numerous examples in which the organization says U.S. law enforcement officers have used tear gas both excessively and indiscriminately in protests.", "Some background on the CWC: The U.S. ratified it in 1993, but it didn't go into effect until 1997. According to Encyclopaedia Britannica, tear gas was first used in World War I for chemical warfare, but because its effects were short-lasting, domestic law enforcement authorities began to use it to disperse mobs and rioters.", "\"Riot Control Agents\" are defined in the convention as, \"Any chemical not listed in a Schedule, which can produce rapidly in humans sensory irritation or disabling physical effects which disappear within a short time following termination of exposure.\"", "Tear gas has a number of effects on people, according to the CDC, including causing extreme irritation to the area of contact for a period of time (usually 15 to 30 minutes). Also:", "Long-lasting exposure or exposure to a large dose of a riot control agent, or tear gas, can have the following effects, according to the CDC:", "In June 2020, a number of cities in the U.S. proposed bans, or moratoriums, on tear gas use as a method of crowd dispersal by law enforcement, amidst fears that the chemical irritants used in the gas will make bodies more vulnerable to the COVID-19 coronavirus disease. As noted above, tear gas can cause long-term harm, including making people more susceptible to pneumonia, influenza, and other illnesses.", "In sum, the use of tear gas, deemed a \"riot control agent\" by national and international health agencies, is banned in warfare by the international Chemical Weapons Convention but not for domestic riot control purposes. We therefore rate this claim \"True.\"", "Encyclopaedia Brittanica. \"Tear gas.\" \r\n   Accessed 8 June 2020.", "Centers for Disease Control and Prevention.   \"Facts About Riot Control Agents Interim document.\"\r\n   Accessed 8 June 2020.", "Dakwar, Jamil.   \"Government Use of Tear Gas Is Illegal in War. It Should Be Illegal Here, Too.\"\r\n   ACLU.   2 January 2018.", "Gjelten, Tom.   \"Peaceful Protesters Tear-Gassed To Clear Way For Trump Church Photo-Op.\"\r\n   NPR.   1 June 2020.", "Johnson, Gene.   \"Some American Cities Reconsider Use of Tear Gas, Police Tactics Amid Widespread Protests.\"\r\n   The Associated Press.   7 June 2020.", "Organization for the Prohibition of Chemical Weapons.   \"Chemical Weapons Convention.\"\r\n   Accessed 8 June 2020.", "Stone, Will.   \"Experts Say Police Use Of Tear Gas Is 'Irresponsible' Amid Pandemic.\"\r\n   NPR.   7 June 2020.", "Song, Lisa.   \"Tear Gas Is Way More Dangerous Than Police Let On—Especially During the Coronavirus Pandemic.\"\r\n   Mother Jones.   8 June 2020.", "Tompkins, Al.   \"There are many types of ‘tear gas.’ Here’s how to tell the difference.\"\r\n   Poynter.   4 June 2020.", "Nur Nasreen Ibrahim is a reporter with experience working in television, international news coverage, fact checking, and creative writing.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]