["About this rating", "Voting in the 2020 U.S. Election may be over, but the misinformation keeps on ticking. Never stop fact-checking. Follow our post-election coverage here.", "On Nov. 5, 2020, a Facebook group named Stop The Steal was created in the aftermath of U.S. Election Day. There were several Facebook Groups called Stop The Steal already, the most prominent of which was removed by Facebook on Nov. 5 after violent rhetoric filled its feed. The name referred to U.S. President Donald Trump's false assertion that the 2020 U.S. presidential election was overrun with fraud and being \"stolen\" from the American people.", "In answer to reader queries we've received, yes, it is true that one of the many Stop The Steal Facebook groups was renamed Gay Communists for Socialism. The group was created on Nov. 5, 2020. At 10:09 a.m. Eastern time on Nov. 6, group admin Jasper Q Tarber — which might be a fake name — changed the group's cover photo and changed its name at the same time. The group had three other admins: Sarma Va Ravula, which may also be a fake account, Patrick J McGuire, and Andrew Joseph.", "The group's membership of more than 64,000 people was likely made up of mostly Trump supporters. When the name change occurred, they did not react favorably.", "Thousands of Trump supporters left the group within the first four hours after its name changed from Stop The Steal to Gay Communists for Socialism.", "Word spread on Twitter that the group's name had changed, and supporters of former Vice President Joe Biden, Trump's Democratic challenger, appeared to flood in to both post and comment with the intent of trolling the remaining Trump supporters.", "The group remained active for several days, but was later removed by Facebook.", "We've removed several clusters of activity for using inauthentic behavior tactics to artificially boost how many people saw their content. That includes a Group that was originally named 'Stop the Steal' which later became 'Gay Communists for Socialism' and misled people about its purpose using deceptive tactics.", "For a short period of time, instead of being filled with debunked conspiracy theories about the 2020 election, the group had been full of trolling and rainbow flags.", "This story was updated on Nov. 13, 2020, to reflect that Facebook had removed the group.", "Jordan Liles is a Senior Reporter who has been with Snopes since 2016.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]