["The upcoming second Senate impeachment trial of former President Donald Trump is a major security concern for Washington, D.C., and the U.S. Capitol, according to a Jan. 25 Instagram post that states the National Guard will remain in the city out of an abundance of caution.", "The contents of the post, \"Thousands Of National Guard Troops Will Remain In Washington D.C. For Impeachment Trial⁠,\"are pulled from a Jan. 25 blog entry on Polialert.com, a \"Civics 101\" and political news source, according to the blog's Instagram profile page. The meme features a picture of a group of unidentified troops in fatigues guarding the Capitol.", "A member of the guard said they wanted to avoid another incident like the Jan. 6 attack on the Capitol, according to the post caption.", "\"Deployments have been extended in several #NationalGuard units. 'We are not going to allow any surprises again,' a Guard said, referring to the events that took place at the Capitol on January 6,\" the caption states.", "The post also references an apparent Politico story about a retainer of 5,000 National Guard troops in the nation's capital from the start of the trial, scheduled for Feb. 8, through mid-March.", "A representative for Poli Alert offered no further information in response to a request for comment from USA TODAY.", "Nearly 26,000 troops were deployed for President Joe Biden's inauguration, USA TODAY reported.", "\"According to Politico, no official justifications, threat reports, or any explanation for the extended missions has been given,\" the caption reads.", "Congress impeached then-President Trump on Jan. 13 for inciting his supporters to attack the Capitol during a special congressional joint session to certify Biden the winner of the 2020 election.", "Additional concerns surround March 4, the date when some QAnon conspiracy theorists falsely believe Trump will be inaugurated for a second time despite having lost the election to Biden, according to the claim. QAnon relies on a belief that high profile members of the Democratic Party will be exposed as child sex-traffickers in a mass-arrest event known as \"The Storm.\"", "More:Fact check: No basis for claims that President Joe Biden's inauguration was faked", "The Instagram post accurately cited a Jan. 24 Politico story about National Guard troops remaining to protect the Capitol throughout the impeachment trial. Some statements in the post caption were copied from the article, and the absence of named sources is also reflected in the Politico piece.", "\"Former President Donald Trump’s upcoming Senate impeachment trial poses a security concern that federal law enforcement officials told lawmakers last week requires as many as 5,000 National Guard troops to remain in Washington through mid-March, according to four people familiar with the matter,\" Politico reported.", "However, the claim leaves out some details, such as the fact that most National Guard troops will volunteer to remain in the city.", "\"Several National Guard units have seen their deployments extended involuntarily, though a majority of Guardsmen remaining in Washington will do so on a volunteer basis,\" according to Politico.", "The post also quotes the number of troops at around 5,000, but closer to 7,000 will stay to provide riot security near the beginning of February. Two-thousand troops will be transferred out of D.C. around Feb. 8, Politico reported.", "A Jan. 25 report by The Associated Press about the retainer of National Guard troops throughout the Senate impeachment trial confirmed details stated in the claim and reported by Politico.", "\"The Guard Bureau said that the number of Guard members in D.C. is less than 20,000 as of Sunday. All but about 7,000 of those will go home in the coming days. The Guard Bureau said that the number of troops in D.C. would then continue to decline in the coming weeks to about 5,000. They are expected to stay in D.C. until mid-March,\" the AP reported.", "USA TODAY has debunked another claim stating Biden's Jan. 20 inauguration was fake and that Trump will be inaugurated again on March 4.", "We rate this claim TRUE, based on our research. Some 5,000-7,000 National Guard troops will remain in Washington, D.C., from early February to mid-March to safeguard the city and the U.S. Capitol during Trump's Senate impeachment trial. Though some details were missing, the Instagram post accurately referenced a Politico piece about the deployment.", "The Associated Press contributed to this story", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook."]