["A video of a woman caught by a mob that interrogates her on suspicions of child-kidnapping has emerged on social media. It has been shared with the claim that gangs of Rohingya Muslims are on a prowl to lift children at night.", "Posted by Kirar Manoj Dhakad on Friday, 19 July 2019", "In the video, one among the mob says that the woman was caught red-handed attempting to kidnap a child in Bareli [Madhya Pradesh]. He points at the father of the child who alleges that the woman had entered his house and ran outside when she was caught.", "The message accompanying the video says, “सावधान भोपाल में 15 से 20 लोगों कीअलग अलग रोहिग्या मुस्लिमो की टोली आई है उनके साथ बच्चे और महिलाएं हैं और उनके पास हथियार भी है और 2 बजे आधी रात को और किसी भी वक्त आते हैं और बच्चे की रोने की आवाज आती है कृपया दरवाजा ना खोले प्लीज इसको आप सारे ग्रुप में शेयर करें। भोपाल पुलिस C.S.P. Send to all group plz. (Beware gang of 15-20 Rohingya Muslims are on a prowl. Women and children also accompany these gangs. They come at night around 2 am and a child’s wailing can be heard. Do not open the doors. Please share it with your group. City Superintendent of Police, Bhopal police.)", "Alt News took hints from the video and performed a keyword search on Google. We came across a compilation article by Patrika listing recent mob attacks in Madhya Pradesh sparked by child-kidnapping rumours. One among them was described similar to the incident depicted in the video. According to the report, an inebriated woman had mistakenly entered a person’s house in Bareli [Raisen district] on the night of July 19. Falsely suspecting her to be a child-kidnapper, a mob beat her up. The woman was later admitted to a hospital after the police intervened.", "The incident was also reported by Dainik Bhaskar.", "Alt News contacted Bareli police to corroborate the set of event. We sent the video to the area police inspector who confirmed that it depicts the same incident. “The woman was heavily intoxicated and was already getting treated in a hospital. After a minor scuffle with the hospital staff, she fled the place and the police was later informed that she was found by a mob that suspected her of being a child-kidnapper. The police rescued her and put her back in the hospital. She was later united with her family,” the PI informed.", "A video of a drunk woman falsely accused of being a child-kidnapper is floating on social media to fuel false rumours. The same narrative – Rohingya Muslims are on a prowl to abduct children – has also been used to promote similar rumours. Alt News recently debunked a video where a mentally-challenged man was thrashed and interrogated by a mob in Raisen, MP. A photograph of a sex racket gang arrested by MP police was also floating as Rohingya Muslim child-kidnappers. Similar rumours were viral last year as well.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]