["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Maryland Attorney General Brian Frosh (left) and District of Columbia Attorney General Karl Racine announce a lawsuit against President Trump over conflicts of interest with his businesses in June in Washington. (AP)", "A misleading viral headline on Facebook suggests that a judge has given the thumbs-up for President Donald Trump to face a subpoena in a case related to his private businesses.", "\"Breaking: federal judge grants permission to subpoena Trump,\" stated a Nov. 29 headline on news.groopspeak.com.", "Facebook users flagged the post as being potentially fabricated, as part of the social network’s efforts to combat fake news. While the headline is wrong, it is based on an actual ruling by a judge. We sent a message to the website but did not get a reply.", "The article linked to a Nov. 29 article in the Washington Post about a federal judge’s ruling in a lawsuit brought by two Democratic attorneys general against Trump. The lawsuit alleges that Trump violated anti-corruption clauses in the Constitution because he benefits financially from his hotel, resort and golf properties.", "The emoluments clause of the Constitution says that no officer of the United States can accept gifts, titles or emoluments (salary) from a foreign government, without permission from Congress.", "On Nov. 28, U.S. District Court Judge Peter J. Messitte ruled that that D.C. Attorney General Karl A. Racine and Maryland Attorney General Brian E. Frosh can serve subpoenas requiring Trump-owned companies to preserve documents.", "The Post described the decision as \"a small advancement\" in the case.", "We read Messitte’s two-paragraph decision and saw nothing that addressed Trump himself being subpoenaed. Here is the main part:", "\"It is hereby ordered that the parties shall be permitted to serve subpoenas on third-parties for the sole purpose of preservation of documents,\" the judge wrote.", "We asked a spokeswoman for the Maryland attorney general if the ruling stated that the plaintiffs could subpoena Trump.", "\"No, it only relates to preservation of documents,\" Raquel Coombs said.", "Robert Marus, a spokesman for the D.C. Attorney General, told PolitiFact that the ruling allows the plaintiffs to serve document preservation subpoenas on the Trump-owned companies in preparation for moving to the discovery phase of the lawsuit against President Trump.", "\"Those entities are not parties to this litigation, which means they would not normally be required to preserve documents. However, their records may be relevant to the case, which is why we asked the court for special permission to subpoena them to preserve these documents,\" Marus wrote.", "Parties to litigation -- in this case Trump in his official capacity -- do not have to be subpoenaed to preserve documents, Marus said.", "A spokeswoman for the U.S. Justice Department pointed to a court document filed on behalf of Trump in which the defendant argued that while a motion to dismiss is pending there shouldn’t be any discovery.", "For the record, a sitting president can be subpoenaed, said Berkeley Law Dean Erwin Chemerinsky.", "\"Richard Nixon had documents subpoenaed, and the Supreme Court upheld this,\" he told PolitiFact.", "A headline stated that a \"federal judge grants permission to subpoena Trump.\" A federal judge made a ruling about the preservation of documents in a case, but the subpoenas pertain to third-parties, not Trump individually.", "We rate this headline False.", "News.groopspeak.com, \"BREAKING: Federal Judge Grants Permission To Subpoena Trump,\" Nov. 29, 2017", "Facebook, Groopspeak, Accessed Dec. 4, 2017", "Washington Post, \"Maryland, D.C. get subpoena power in Trump emoluments suit,\" Nov. 29, 2017", "Bloomberg, \"Trump Firms Must Save Records for AGs' Emoluments Lawsuit,\" Nov. 29, 2017", "Maryland Attorney General, Emoluments lawsuit, Accessed Dec. 4, 2017", "U.S. District Court, The District of Columbia and the State of Maryland vs Donald J. Trump P, in his official capacity as President of the United States of America Document 64, (Accessed via PACER) Nov. 28, 2017", "U.S. District Court, The District of Columbia and the state of Maryland vs Donald J Trump in his official capacity as President of the United States of America Document 43, Oct. 25, 2017", "PolitiFact, \"Trump lawyer: Foreign dignitaries staying in a Trump hotel doesn't violate Constitution,\" Jan. 13, 2017", "PolitiFact, \"Obstruction of justice, presidential immunity, impeachment: What you need to know,\" May 17, 2017", "Interview, Berkeley Law Dean Erwin Chemerinsky, Dec. 4, 2017", "Interview, Raquel Coombs, spokeswoman for Maryland Attorney General Brian E. Frosh, Dec. 4, 2017", "Interview, Robert Marus, spokesman for D.C. Attorney General, Dec. 4, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]