["About this rating", "On 26 February 2018, the Alex Jones conspiracy trolling network Infowars.com reported that an emergency responder to the Valentine's Day mass shooting at Marjory Stoneman Douglas High School in Parkland, Florida said they were \"told to stand down\" instead of going inside the building and saving lives. The headline reads, in part, \"Parkland First Responder: I Was Told to Stand Down.\"", "The article reads in part:", "A first responder to the Parkland school shooting claims he was told to stand down and not enter the building to recover victims, which he believes would have saved lives.", "Speaking to a WSVN Miami News 7 reporter, an emergency medical responder who was one of the first at the scene said law enforcement did not follow mass casualty event protocols.", "The story is based solely on a tweet composed by Miami-based WSVN reporter Brian Entin, who documented his conversation with an emergency medical services (EMS) responder. The medic expressed frustration about being forced to wait outside the high school where seventeen people were fatally shot while law enforcement secured the scene:", "\"Everything I was trained on mass casualty events says they did the wrong thing.\" I spoke with a seasoned emergency medical responder who was one of the first to the Stoneman shooting. He doesn't want me using his name for fear he will get fired. Here are his exact quotes. @wsvn pic.twitter.com/t9trsOEaek", "— Brian Entin (@BrianEntin) February 24, 2018", "The medic never says he was told to \"stand down,\" but instead said he believed that police should have been bringing the injured people out for treatment or allowed EMS to enter the building sooner. It is common practice for EMS providers to wait for law enforcement to give them the green light before entering an active crime scene.", "Although local law enforcement has been heavily criticized for their response to the 14 February 2018 school shooting and questions have been raised about whether they did enough to prevent loss of life, the nebulous \"stand down\" order is a familiar theme in conspiracy theories about disastrous incidents.", "For example, after a deadly white supremacist rally in Charlottesville, Virginia on 12 August 2017, the fake news site YourNewsWire published a bogus story reporting police had been given such an order. Although Charlottesville police were slammed and their response cited for failing to effectively counter violence, there is no evidence an official \"stand down order\" was ever given. A similar theme was present in conspiracy theories about the 2012 deadly attack on the U.S. consulate in Benghazi, Libya. Although it was widely reported a \"stand down order\" was given to the consulate security team, no evidence of such an order exists.", "Infowars.com and its coterie of ranting Internet trolls have been the focus of news stories in the weeks after the Parkland shooting as culprits who spread conspiracy theories after mass shootings that enable the stalking and harassment of victims and survivors. Video platform YouTube has penalized Infowars for spreading false rumors that the teenagers who survived the Parkland shooting are \"crisis actors.\"", "Menegus, Bryan. \"YouTube Terminates Account of InfoWars Bureau Chief.\"\r\n  Gizmodo. 2 March 2018.", "Brown, Seth. \"Alex Jones’s Media Empire Is a Machine Built to Sell Snake-Oil Diet Supplements.\"\r\n  New York Magazine. 4 May 2017.", "Basu, Zachary. \"Infowars Receives Second Strike From YouTube Over Parkland Conspiracy.\"\r\n  Axios.com. 27 February 2018.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]