["About this rating", "In April 2018, actor Channing Tatum and his wife, actor and dancer Jenna Dewan Tatum, announced plans to separate after nine years of marriage.", "In an era of celebrity hoaxes, the news was greeted with skepticism by some of our readers. It's true. On 3 April, the pair published a joint statement on their respective Instagram accounts that confirmed their impending separation:", "Hey world! So... We have something we would like to share. First off, it feels odd that we have to share this kind of thing with everyone, but it's a consequence of the lives we've chosen to lead, which we also happen to be deeply grateful for. We're living in an incredible moment in time, but it's also a time where truth can easily get distorted into \"alternative facts\" ;) So we want to share the truth so you know that if you didn't read it here then it's most certainly fiction.", "We have lovingly chosen to separate as a couple. We fell deeply in love so many years ago and have had a magical journey together. Absolutely nothing has changed about how much we love one another, but love is a beautiful adventure that is taking us on different paths for now. There are no secrets nor salacious events at the root of our decision -- just two best friends realizing it's time to take some space and help each other live the most joyous, fulfilled lives as possible. We are still a family and will always be loving, dedicated parents to Everly. We won't be commenting beyond this, and we thank you all in advance for respecting our family's privacy. Sending lots of love to everyone, Chan&Jenna.", "The couple, who starred together in the 2006 movie Step Up, were married in 2009. They have one daughter, Everly, who was born in 2013.", "Wihlborg, Ulrica.  \"Inside Channing Tatum and Jenna Dewan's Malibu Wedding.\"\r\n  People.  12 July 2009.", "Bull, Sarah; Sheridan, Emily.  \"And Baby Makes Three! Channing Tatum and Wife Jenna Confirm Birth of Daughter Everly.\"\r\n  Daily Mail.  4 June 2013.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]