["About this rating", "Some social media users encountered a tweet in February 2019 supposedly sent by Congresswoman Alexandria Ocasio-Cortez's press team, a post labeling Hoda Muthana, an Alabama woman who traveled to Syria and married an Islamic state fighter, as \"more of a hero then our veterans\":", "This message was not posted by Rep. Ocasio-Cortez or anyone associated with her team. The Twitter account @AOCpress is actually a parody account that publishes political satire.", "@AOCpress identifies itself as \"parody\" and \"satire\" in its Twitter bio:", "Hoda Muthana joined ISIS at the age of 20 and had a child with an ISIS fighter. Now, aged 24, she says that she regrets joining the terrorist group and wants to return to the United States.  Here's an excerpt from a report filed on her by NPR:", "Muthana was 20 years old when she told her family she was going to Turkey for a university event. She then made her way to Syria and joined ISIS, became romantically involved with multiple ISIS fighters, had a child with one of them, and allegedly spent several years urging attacks on America.", "Now Muthana wants to come home. The 24-year-old regrets falling in with the terrorist group that brainwashed her online, a lawyer for the family told NPR's David Greene on Morning Edition.", "\"People are saying she betrayed this country, she shouldn't be able to come back home,\" Hassan Shibly said. But Mothana was a \"vulnerable young woman who was brainwashed and manipulated by these criminal masterminds. They took advantage of her and used her, and she deeply, deeply resents them. She deeply regrets it.\"", "Muthana's attempt to come back to the United States drew the attention of President Trump, who tweeted on 20 February 2019 that he had instructed Secretary of State Mike Pompeo not to allow her back into the U.S.:", "I have instructed Secretary of State Mike Pompeo, and he fully agrees, not to allow Hoda Muthana back into the Country!", "— Donald J. Trump (@realDonaldTrump) February 20, 2019", "We searched Ocasio-Cortez's Twitter feed (found at @AOC not @AOCpress) and did not turn up any comments related to Muthana.", "Clark, Dartunorro and Abigail Williams.   \"Trump Says He Will Not Readmit Alabama Woman Who Joined ISIS.\"\r\n    The Washington Post.   20 February 2019.", "Schwartz, Matthew.   \"Alabama Woman Who Joined ISIS Can't Come Back, Trump Says.\"\r\n    NPR.   21 February 2019.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]