["“The banks have a bail-in program that leaves anyone with money in the bank paying the debt of the country if anything goes sideways,” claims a Facebook post popular on Canadian social media. The author of the post, which was subsequently shared as a screenshot, goes on to suggest that this is due to new legislation.", "Following the 2008 financial crisis that required the bailout of several US and European banks, Canada introduced new mechanisms meant to avoid a similar scenario. The regulation introduced to the Canadian financial system in 2016 allows for the bail-in of certain banks, but it is not related to paying the country’s sovereign debt.", "Six large banks, also known as domestic systemically important banks, were given the power to convert their long-term debt into common shares. Should one of these banks be found to be non-viable or on the verge of failure, the Canadian Deposit Insurance Corporation (CDIC), a crown corporation in charge of ensuring Canadians do not lose their savings if a bank fails, can take temporary control of the bank and authorize the conversion of certain bonds into shares for the banking institution.", "The capital generated by the conversion of these bonds would be used to recapitalize the bank, which could return to private control upon reestablishing stability. The investors who buy those specific long-term bonds do so knowing that they could be used to recapitalize the bank, and would thus bear the cost of the bank’s failure.", "The bail-framework, which came into force in September 2018, does not allow for the conversion of deposits such as checking and savings accounts.", "“Bail-in reinforces that bank creditors and shareholders are responsible for banks’ risks - not the taxpayer or depositors,” Anna Arneson, a spokesperson for the Department of Finance, told AFP in an email.", "In the event of a banking failure in Canada, CDIC protects eligible deposits up to $100,000 per account per banking institution, so long as the bank is a member of CDIC.", "Checking and savings accounts, Registered Retirement Savings Plans (RRSPs) and Tax-Free Savings Accounts (TFSAs) are among the types of deposits protected by CDIC. However, in the case of RRSPs and TFSAs, financial products like stocks, bonds, or mutual funds are not protected, Mathieu Larocque, spokesperson for CDIC, told AFP in an email.", "In the event of a banking failure, Canadian savers with more than $100,000 in an account protected by CDIC would be reimbursed $100,000 by CDIC, and would have to file a claim with the banking institution for the remainder, Larocque told AFP. The CDIC websites provides Canadians with this tool to calculate how much of their savings are protected.", "Although Canadian banks were spared by the 2008 financial crisis, banking failures have occurred in Canada in the past. Forty-three CDIC member institutions have failed since the crown corporation’s creation over fifty years ago.", "Most recently, Calgary-based Security Home Mortgage Corporation went bankrupt in 1996. According to a CDIC book on the insurer’s history, 2,600 Canadians had deposited $42 million in the Mortgage Corporation, of which all but $10,000 were insured. All insured deposits were paid back within three weeks.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]