["By D'Angelo Gore", "Posted on December 14, 2020", "Facebook posts have repeated a false claim about a “one in a quadrillion” chance that President-elect Joe Biden received more votes than President Donald Trump in Georgia, Michigan, Pennsylvania and Wisconsin. Experts told us the claim misuses a questionable statistical analysis that made implausible assumptions about the 2020 election.", "A failed lawsuit seeking to have the U.S. Supreme Court invalidate election results in four battleground states that Biden won makes false claims about the improbability of Biden’s victory. At least one of those claims is now being repeated on Facebook.", "“For President Trump To Be Ahead As Far As He Was At 3am In Mich,Penn,Wisconsin,And Georgia, And For The Vote To Swing As Much As It Did In Biden’s Favor, The Mathmatical Probability Of That Happening In Just ‘One’ State Alone Is, 1 And 1 Quadrillion!!,” one of those posts reads. “And The Probability Of That Happening In 4 States Simultaneously is: 1,000,000,000,000,000 To The 4Th Power. So,The ‘False’ And ‘Baseless’ Election Fraud You Blindly Scream About Is 100% True!!”", "Minus the typos, that’s nearly identical to a claim made in a lawsuit Ken Paxton, the Republican attorney general of Texas, filed in the U.S. Supreme Court on Dec. 7.", "The court filing says: “The probability of former Vice President Biden winning the popular vote in the four Defendant States — Georgia, Michigan, Pennsylvania, and Wisconsin — independently given President Trump’s early lead in those States as of 3 a.m. on November 4, 2020, is less than one in a quadrillion, or 1 in 1,000,000,000,000,000. For former Vice President Biden to win these four States collectively, the odds of that event happening decrease to less than one in a quadrillion to the fourth power.”", "White House Press Secretary Kayleigh McEnany promoted the claim on social media and repeated it on Sean Hannity’s Fox News show.", "The court filing says the claim is based on an expert declaration written by economist Charles J. Cicchetti. But that’s not exactly what Cicchetti wrote in his analysis of election results in Georgia, Michigan, Pennsylvania and Wisconsin.", "Instead, Cicchetti said he tested whether the ballots counted in those states until 3 a.m. on Nov. 4 were from a similarly random pool of voters as the ballots counted in the hours and days after. He also tested whether Biden’s performance in those states was statistically similar to Hillary Clinton’s in 2016.", "In both cases, his analysis, not surprisingly, showed they were not. We know that Biden outperformed Clinton. And we know ballots states counted on and after Election Day weren’t from a random pool of voters: Some states counted mail-in ballots before Nov. 3, while others were still counting them days later. Democrats were more likely to vote by mail.", "“I reject the hypothesis that the Biden and Clinton votes are similar with great confidence many times greater than one in a quadrillion in all four states,” Cicchetti wrote. “The degree of confidence is even greater for rejecting the hypothesis that the early morning after election tabulations and the subsequent tabulations were drawn from the same population of all voters.”", "His declaration does argue that had Biden’s support been similar to Clinton’s, and had ballots counted before and after 3 a.m. on Nov. 4 come from similar populations of Biden and Trump voters, then Biden’s win would be highly improbable. But that doesn’t actually show Biden had a “one in a quadrillion” chance of victory in those states.", "“I think the Texas [attorney general] intentionally misrepresented what Cicchetti said,” Justin Ryan Grimmer, a Stanford University professor of political science, told us in a phone interview. “The Texas AG took the Cicchetti analysis to a conclusion that I don’t think Cicchetti says at all in his analysis.”", "We contacted Cicchetti to ask if that was the case, but did not get a response.", "In a Twitter thread about Cicchetti’s analysis, Grimmer wrote: “Cicchetti never tries to compute the probability of Biden winning. Instead, he implausibly assumes Biden and Clinton have identical support or that early- and late-tabulated votes are randomly sampled. His probabilities teach us very little about the true chance of Biden winning.”", "Cicchetti wrote that Biden’s win required further scrutiny because Trump’s apparent election night lead in those swing states vanished as more ballots were counted after 3 a.m. the following morning. For example, he said, “The Georgia reversal in the outcome raises questions because the votes tabulated in the two time periods could not be random samples from the same population of all votes cast.”", "But we know they weren’t, and Cicchetti mentioned the reason why in his declaration.", "“I am aware of anecdotal statements from election night that some Democrat strongholds were yet to be tabulated. There was also some speculation that the yet-to-be counted ballots were likely absentee mail-in ballots. Either could cause the latter ballots to be non-randomly different than the nearly 95% of ballots counted by 3AM EST,” he said.", "That’s exactly what was reported to have happened.", "As of around 8 a.m on Nov. 4, Trump still had a lead in Georgia of roughly 117,000 votes. But about 200,000 absentee and mail-in ballots had yet to be counted, according to the state’s Republican secretary of state, Brad Raffensperger. The majority of those outstanding ballots were from Fulton, DeKalb and Cobb counties, and Biden ended up winning all three counties with nearly 73%, 83% and 56% of the vote, respectively.", "The fact that Trump lost his lead as more ballots were counted was not unexpected.", "“We knew there would be a ‘blue shift’ when [vote-by-mail] ballots were tabulated because Trump discouraged his supporters from voting by mail, resulting in a larger fraction of the VBM ballots having votes for Biden,” Philip B. Stark, professor and associate dean of mathematical and physical sciences at the University of California Berkeley, said in an email. “We knew that would happen. Cicchetti tests whether the in-person votes are like the VBM votes. They are not, but that’s not surprising and not a sign of fraud. People who voted in person are not a random sample of voters. They are disproportionately Trump supporters. People who voted by mail are not a random sample of voters. They are disproportionately Biden voters. All this is what was expected.”", "That’s supported by a post-election survey conducted by the Pew Research Center, which found that 67% of Trump supporters said they voted in person compared with 58% of Biden supporters who said they voted by absentee or mail-in ballot.", "In Pennsylvania, for example, registered Democrats returned mail ballots at nearly three times the rate of Republicans.", "We also know that, due to the COVID-19 pandemic, millions more Americans voted by mail in 2020 than in 2016. And state laws in Georgia, Michigan, Pennsylvania, and Wisconsin prevented election officials in those states from counting mail-in ballots before Election Day. That contributed to those votes being counted and reported later than votes that were cast in person on or before Nov. 3.", "“As many have pointed out, this analysis exploits the fact that Democratic counties reported their results later, primarily due to their larger size and large number of mail ballots, which Republican state legislatures prevented election officials from preparing for counting in advance of Election Day,” said Michael McDonald, a political science professor at the University of Florida who runs the United States Elections Project.", "We previously wrote that Biden overtook Trump in Wisconsin early in the morning on Nov. 4 “when Milwaukee reported its roughly 170,000 absentee votes, which were overwhelmingly Democratic,” according to the Milwaukee Journal Sentinel. And Biden, on the strength of absentee ballots from large counties, including Wayne, Oakland, Macomb and Kent, took the lead from Trump in Michigan at about 9 a.m. that same day, local news outlets reported.", "It wasn’t until Nov. 6 that Biden went ahead of Trump in the vote count in Georgia and Pennsylvania — again as more mail-in ballots from heavily Democratic areas were counted.", "As for the Clinton and Biden comparison, Cicchetti’s declaration says that he finds “the increase of Biden over Clinton is statistically incredible if the outcomes were based on similar populations of voters supporting the two Democratic candidates.”", "But his analysis showed that Biden and Clinton didn’t have similar levels of support. As we’ve written before, Biden outperformed Clinton in every state — not just swing states – both by the number and the percentage of votes.", "“The populations of voters are not the same in the two elections, so the test based on a binomial distribution argument is not well-defined or properly applicable,” Walter Mebane, a professor of political science and statistics at the University of Michigan, explained in an email. “As a simple descriptive matter it doesn’t tell anything we didn’t know upon observing that Biden received a higher percentage of the votes cast in 2020 than Clinton did of the votes cast in 2016,” Mebane said of Cicchetti’s analysis.", "In another email, Paul Gronke, a professor and director of the Early Voting Information Center at Reed College, told us: “Dr. Cicchetti’s analysis is naive and is being misused.”", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "Texas v. Pennsylvania, et al. No. 22O155. Supreme Court of the U.S. 7 Dec 2020. (Motion to expedite filed by plaintiff Texas.)", "Office of Texas Attorney General Ken Paxton. “AG Pax­ton Sues Bat­tle­ground States for Uncon­sti­tu­tion­al Changes to 2020 Elec­tion Laws.” Press release. 8 Dec 2020.", "Grimmer, Justin, professor of political science at Stanford University. Email and phone interviews with FactCheck.org. 10 Dec 2020.", "Gronke, Paul, professor and director of the Early Voting Information Center at Reed College. Email interview with FactCheck.org. 10 Dec 2020.", "Stark, Philip, professor and associate dean of mathematical and physical sciences at the University of California Berkeley. Email interview with FactCheck.org. 9 Dec 2020.", "Mebane, Walter, professor of political science and statistics at the University of Michigan. Email interview with FactCheck.org. 9 Dec 2020.", "McDonald, Michael, professor of political science at the University of Florida. Email interview with FactCheck.org. 9 Dec 2010.", "Pew Research Center. “Sharp Divisions on Vote Counts, as Biden Gets High Marks for His Post-Election Conduct.” 20 Nov 2020.", "U.S. Elections Project. “Pennsylvania Early Voting Statistics.” 20 Nov 2020, accessed 14 Dec 2020.", "National Conference of State Legislatures. “VOPP Table 16: When Absentee/Mail Ballot Processing and Counting Can Begin.” 1 Oct 2020, accessed 11 Dec 2020.", "Robertson, Lori, et al. “Trump’s Wild, Baseless Claims of Illegal Voting.” FactCheck.org. 6 Nov 2020.", "Spangler, Todd. “Biden goes ahead of Trump in Michigan as vote count continues in state’s largest counties.” Detroit Free Press. 4 Nov 2020.", "Roth, Cheyna. “Biden takes lead over Trump in Michigan.” Mlive.com. 4 Nov 2020.", "“Nov. 6 highlights: Ballot counting continues in presidential race.” NBCNews.com. 6 Nov 2020, accessed 10 Dec 2020.", "“Biden holds growing lead over Trump in Pa.; legal fight over late-arriving mail ballots continues; it may take days to finish counting Philly ballots.” Philadelphia Inquirer. 6 Nov 2020, accessed 10 Dec 2020.", "Martin, Jonathan, and Glueck, Katie. “Biden Pulls Ahead in Key States as Anxious Nation Awaits Winner.” New York Times. 5 Nov 2020, accessed 10 Dec 2020.", "Morris, Jason, and Bruer, Wes. “200,000 ballots left to be counted in Georgia, secretary of state says.” CNN.com. 4 Nov 2020, accessed 10 Dec 2020.", "“Live Updates | Georgia vote count continues.” 11Alive.com. 4 Nov 2020, accessed 10 Dec 2020.", "“Former Vice President Joe Biden takes lead in Pennsylvania voting.” CNBC.com. 6 Nov 2020.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]