["Social media users are sharing a viral image of what purports to be a breaking news report that claims Joe Biden has resigned as president-elect.", "The claim appears as a screenshot of an alleged article from FOX Atlanta, published on Jan. 1 with the headline \"President Elect Biden steps down as President Elect.\" The post claims his resignation came \"after consulting with his family and legal team due to an unspecified health issue.\"", "\"I have no idea if this is true. But if it is, are you surprised? I've been saying this for nearly a month,\" wrote one user along with the claim in a Jan. 1 post that has hundreds of shares. That Facebook user has not returned USA TODAY's request for comment.", "The Facebook page Underground Patriot also shared the claim, which has over 1,000 shares. In a Facebook message to USA TODAY, Underground Patriot said its source for the article disappeared and that the page is looking to verify the claim through other sources.", "Fact check: No, Joe Biden's brother-in-law does not own Dominion Voting Systems", "The claim is false, and there are no reports or evidence that Biden is stepping down as president-elect because of \"unspecified health issues.\"", "The image has been altered to appear as an authentic news report, as a search of key words included in the post results in no matches on Fox Atlanta's site. Biden's official Twitter, Instagram, Facebook and official transition website all have no mentions or statements of him planning to step down as president-elect.", "Fact check:Over 159 million people voted in the US general election", "In a December 2019 medical assessment, Dr. Kevin O'Connor of George Washington University said Biden \"is a healthy, vigorous, 77-year-old-male, who is fit to successfully execute the duties of the Presidency.\" The report also states that Biden does not smoke or drink and works out five days per week.", "Biden got vaccinated against COVID-19 in December and will soon need another round of the vaccinations developed by Pfizer-BioNTech in January, USA TODAY reported.", "Congress will meet on Jan. 6 to certify Biden's win, and Biden and Vice President-elect Kamala Harris will both be sworn in on Jan. 20, USA TODAY reported.", "USA TODAY reached out to the Biden transition team and Fox Atlanta regarding the claims.", "Fact check:These 5 election statistics do not discredit Joe Biden's victory", "The claim that Biden is stepping down as president-elect is FALSE, based on our research. There are no reports or evidence of him stepping down and the image in the post has been altered to appear as an authentic news report.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook."]