["AIMIM chief and MP from Hyderabad, Asaduddin Owaisi recently claimed at a political rally that the India Gate in New Delhi has the names of over 95,000 freedom fighters inscribed on it, of which 65 percent of the names (61,945, according to the claim) are of Muslims. The video of Owaisi’s speech is posted below, and the relevant portion can be viewed from 1:19 to 2:18 minutes.", "Owaisi can be heard saying, “Mr Modi, on India Gate, so many peoples’ names have been written, freedom fighers, the names of 95300 people have been written, those whose names are mentioned had fought against the British…you will be pleased to know that out of the 95,300, 61945 names are of Muslims. 65% of the names are of Muslims.” (translated from Hindi).", "Alt News found that this precise claim has been circulating on social media platforms since 2018, and has been posted and/or shared thousands of times. Several individual users on both Twitter and Facebook have shared this message, which has also been posted on some pages and groups.", "A variant of this message states, “There are 95,300 names of freedom fighters on India Gate, of which Muslims are 61,395, Sikh- 8050, Backward- 14,480 Dalit: 10,777 Upper caste- 598 Sanghi- 00. These shameless people call Muslims as traitors and say Dalits and backwards looted the country. Look at the reality, blind fools.”", "दिल्ली के इंडिया गेट पर कुल 95,300 स्वतंत्रता सेनानियों के नाम है… – मुसलमान : 61395 – सिख : 8050 – पिछड़े : 14480 – दलित : 10777 – सवर्ण : 598 – संघी : 00 :- और कुछ बेशर्म लोग मुसलमानों को गद्दार कहते हैं, जबकि खुद उनका इतिहास अंग्रेजों की मुखबिरी करते गुजरी है।", "— Torab Niazi (@Torab_Niazi) October 13, 2018", "The above tweet was posted in October 2018, and has been retweeted over 1200 times. The same claim, posted on a Facebook fan page of student leader Shehla Rashid named I am with Shehla, has been shared over 6600 times.", "इंडिया गेट पर कुल 95,300 स्वतंत्रता सेनानियों के नाम अंकित हैं, उनमें से 61,395 मुसलमान हैं और संघी चिल्लाते हैं कि ‘मुसलमान’ गद्दार हैं।", "Posted by I am with Shehla on Saturday, October 13, 2018", "The same has been circulated on WhatsApp in the form of an infographic.", "In essence, there are two claims made by Asaduddin Owaisi and social media users.", "1. India Gate is a monument that commemorates the freedom fighters of the Indian struggle for independence", "2. There are 95,300 names inscribed on it, of which 61,945 names are of Muslims.", "The first part of the claim i.e India Gate is a tribute to the freedom fighters of India’s struggle for political independence, is patently false. The monument was built to honour the sacrifices of Indian soldiers who laid down their lives fighting for the British imperial army in World War I (1914-1918). The source of this information is India Gate itself, where the years 1914 and 1918 are inscribed in Roman numerals.", "As can be seen in the picture above, MCMXIV (1914) can be seen to the left of the word INDIA, whereas MCMXIX (1918) can be seen to its right. The text inscribed in capital letters below the word INDIA encapsulates the geographical sweep of the war:", "TO THE DEAD OF THE INDIAN ARMIES WHO FELL AND ARE HONOURED IN FRANCE AND FLANDERS MESOPOTAMIA AND PERSIA EAST AFRICA GALLIPOLI AND ELSEWHERE IN THE NEAR AND THE FAR-EAST AND IN SACRED MEMORY ALSO OF THOSE WHOSE NAMES ARE HERE RECORDED AND WHO FELL IN INDIA OR THE NORTH-WEST FRONTIER AND DURING THE THIRD AFGHAN WAR", "This general information is also available on the website of Delhi Tourism. The foundation stone of India Gate was laid in 1921.", "The second part of the claim i.e the monument has over 95,000 names inscribed on it with 65% of the names being Muslim, too is false. Information regarding casualties inscribed on the memorial is available on the website of the Commonwealth War Graves Commission, an organisation which “honours the 1.7 million men and women of the Commonwealth forces who died in the First and Second World Wars” through maintenance of memorials, cemeteries and archival records. The Commonwealth of Nations is a political grouping of over 50 member states, almost all of which were erstwhile territories of the British empire in its heyday.", "According to the commission, the number of identified casualties is 13, 216. The names of each of those honoured at the memorial are also available on the website. Moreover, it may be noted that these names are not classified on the basis of caste, religion etc. Thus, the social media claim is false. The ‘About Us’ section of the CWGC categorically states, “There should be no distinction made on account of military rank, race or creed”, as one of its principles. Acknowledging the stellar role played by Indians in the war, the website states, “The CWGC commemorates some 74,000 who lost their lives while serving with Indian forces between 1914 and 1921. Many were cremated in accordance with their faith and their names are inscribed on memorials which can be found from Brighton to Basra, Cape Helles on Gallipoli, to Egypt and eastern Africa.”", "It may however be noted that there is a discrepancy in the number of casualties referred to- The Delhi Tourism website claims this number is 13,516 whereas according to CWGC, the total number of identified casualties is 13, 216. In either case, it is nowhere close to the figure of 95,300.", "It may be noted over here that the total number of Indian casualties in World War I exceeded 70,000. India Gate is one of several memorials dedicated to those who lost their lives in the war.", "In conclusion, the claim that names of 95,300 freedom fighters have been inscribed on India Gate, of which 61,945 are Muslim, is false. India Gate is a monument that commemorates the fallen Indian soldiers of World War 1. Moreover, no distinction has been made on the basis of caste and/or religion with regard to these names.", "Donate Now", "Arjun Sidharth is a writer with Alt News. He has previously worked in the television news industry, where he managed news bulletins and breaking news scenarios, apart from scripting numerous prime time television stories. He has also been actively involved with various freelance projects. Sidharth has studied economics, political science, international relations and journalism. He has a keen interest in books, movies, music, sports, politics, foreign policy, history and economics. His hobbies include reading, watching movies and indoor gaming.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]