["A disturbing video clip in which an elderly couple can be seen beaten, pushed and jostled into a van by uniformed personnel, has been shared on social media. The video has been shared with a message in Kannada which says that police in Pakistan brutally beat up elderly Hindu couples, adding that human rights organisations are nowhere to be seen when minorities in Pakistan are treated in this manner. The text is as follows:", "ಪಾಕಿಸ್ತಾನದಲ್ಲಿ ಪೊಲೀಸರು ವಯೋವೃದ್ಧ ಹಿಂದೂ ದಂಪತಿಗಳಿಗೆ ಕ್ರೂರವಾಗಿ ಥಳಿಸುತ್ತಿದ್ದಾರೆ ಪಾಕಿಸ್ತಾನದಲ್ಲಿ ಅಲ್ಪಸಂಖ್ಯಾತರನ್ನು ಈ ರೀತಿ ಪರಿಗಣಿಸಬಹುದೇ ಎಲ್ಲಿ ಸತ್ತಿದೆ ಮಾನವ ಹಕ್ಕುಗಳ ಸಂಸ್ಥೆ… ಇದೇ ಭಾರತದಲಾಗಿದ್ದಾರೆ ಯಾವ ರೀತಿ ಕೂಗಾಡುತ್ತಿದ್ದರು? #ನಾಚಿಕೆಗೇಡಿನ_ಕೃತ್ಯ (“In Pakistan police brutally beat up elderly Hindu couples, minorities in Pakistan can be treated like this: Where is the Human Rights organisation? What was it like being in India? #Shameful_function”- approximate translation).", "ಪಾಕಿಸ್ತಾನದಲ್ಲಿ ಪೊಲೀಸರು ವಯೋವೃದ್ಧ ಹಿಂದೂ ದಂಪತಿಗಳಿಗೆ ಕ್ರೂರವಾಗಿ ಥಳಿಸುತ್ತಿದ್ದಾರೆ ಪಾಕಿಸ್ತಾನದಲ್ಲಿ ಅಲ್ಪಸಂಖ್ಯಾತರನ್ನು ಈ ರೀತಿ ಪರಿಗಣಿಸಬಹುದೇ ಎಲ್ಲಿ ಸತ್ತಿದೆ ಮಾನವ ಹಕ್ಕುಗಳ ಸಂಸ್ಥೆ… ಇದೇ ಭಾರತದಲಾಗಿದ್ದಾರೆ ಯಾವ ರೀತಿ ಕೂಗಾಡುತ್ತಿದ್ದರು? #ನಾಚಿಕೆಗೇಡಿನ_ಕೃತ್ಯ", "Posted by CA Kiran Jayaram Acharya on Wednesday, September 25, 2019", "The above post has been shared close to 500 times. The video from this post has been viewed over 14,000 times so far. The one-minute long video clip has also been shared on WhatsApp, again with text in Kannada.", "Alt News broke the video into several frames using the Invid tool. Reverse-searching one of the frames with specific key words, Alt News found a news report on the website of the Pakistani news outlet Geo TV which pertained to this incident. The report was dated November 22, 2017 and titled, ‘Elderly couple tortured by Multan police seek justice’.", "While the claim that the video is from Pakistan is true, the other claim, that the elderly couple seen in the video is Hindu, is false. The Geo TV report states, “The elderly couple who was tortured by police staged a protest on Wednesday hoping for justice. Muhammad Idrees and Naseem Bibi, were thrashed by the police outside the office of Multan Development Authority for demanding compensation for the 500 acre land the authority bought from them on Monday (November 20).” The names of the elderly couple are Muhammad Idrees and Naseem Bibi.", "A video from 2017 shot in Multan, Pakistan has been shared with the false claim that an elderly Hindu couple was mistreated by police.", "Donate Now", "Arjun Sidharth is a writer with Alt News. He has previously worked in the television news industry, where he managed news bulletins and breaking news scenarios, apart from scripting numerous prime time television stories. He has also been actively involved with various freelance projects. Sidharth has studied economics, political science, international relations and journalism. He has a keen interest in books, movies, music, sports, politics, foreign policy, history and economics. His hobbies include reading, watching movies and indoor gaming.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]