["About this rating", "On 8 December 2017, the \"America's Last Line of Defense\" web site published an article reporting that the daughter of U.S. Senator Chuck Schumer (D.-NY) had recently spoken out about her father's supposed affair with one of her high school classmates:", "Things just keep getting worse for the Democrat party. As Republicans like Roy Moore are being exonerated left and right, Democrats are falling like dominoes to accusations of sexual assault. The latest may be the worst.", "Chuck Schumer, the holier-than-thou Democrat who has repeatedly called for Judge Roy Moore to drop out of the Senate race over bogus sexual assault charges, may be facing a sex scandal of his own. Schumer’s daughter, Lisa, has come forward to admit that her father was quite the ladies man ... to her high school cheerleader friends:", "“My dad is being a hypocrite and that’s why I’m speaking out. When I was in high school he dated my best friend Rebecca and even got her pregnant twice. He paid for her abortions twice and spent a ton of money onn her at Steak and Shake and Victoria’s Secret. She fell in love with him and he broke her heart. My Mom paid her to be quiet and go away. Three years later she committed suicide.”", "The girl in question may not be able to testify in court, but her diaries, which could be admitted as a dying declaration, are apparently very detailed. Lisa Schumer says her friend’s mother entrusted her with the secret, telling her to keep it a secret forever if she could. Lisa says she “was very concerned that her daughter’s name would be dragged through the mud.”", "The story is set to break on Reuters and Breitbart first thing in the morning, according to Fred Bernswallow.", "There was no truth to this story: Senator Schumer does not have a daughter named Lisa (his daughters are Jessica and Alison), and neither Reuters nor Breitbart (nor any other real news organization) has published a report on this subject. Nonetheless, many readers mistook it for a genuine news account:", "You have to be kidding me...", "BREAKING: Chuck Schumer’s Daughter Breaks Her Silence About Her Dad’s Affair With A High School Cheerleader - https://t.co/n4RJEpFaQg via @Shareaholic", "— Franken Harpo (@FrankenHarpo) December 9, 2017", "This story originated with (and was exclusive to) \"America's Last Line of Defense,\" a junks news site that specializes in spreading political information under the guise of proffering \"satire.\" The site's disclaimer notes that all its content is fictional:", "America’s Last Line of Defense is a whimsical playland of conservative satire.", "Everything on this website is fiction. It is not a lie and it is not fake news because it is not real. If you believe that it is real, you should have your head examined. Any similarities between this site’s pure fantasy and actual people, places and events are purely coincidental and all images should be considered altered and satirical.", "On 12 December 2017, reports emerged about an attempt to frame Schumer in a sex scandal, one involving forged documents. The Senator reported the alleged to plot to law enforcement, according to the news web site Axios.", "Eagleton, Flagg.   \"Chuck Schumer’s Daughter Breaks Her Silence About Her Dad’s Affair with a High School Cheerleader.\"\r\n    America's Last Line of Defense.   8 December 2017.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]