["About this rating", "During the third and final presidential debate on 19 October 2016, social media users began tweeting up a storm claiming Hillary Clinton \"leaked\" classified information by revealing details about the United States' nuclear response protocols, specifically that the timeframe between a presidential order and a launch of nuclear weapons was four minutes:", "This is actually true, @StateDept @TheJusticeDept @DeptofDefense, @CENTCOM, do you job, she just slipped #DebateNight pic.twitter.com/7qu3qPSpW7", "— MicroSpookyLeaks™ (@WDFx2EU7) October 20, 2016", "The exchange in question occurred during a debate over diplomatic relations with Russia and allegations that the Russian government had attempted to interfere in the 2016 election. Moderator Chris Wallace asked Donald Trump whether he \"condemn[ed] any interference by Russia in the American election,\" to which Trump answered in the affirmative. The discussion then turned to nuclear weapons (at the 33-minute mark in the clip below), a subject which Hillary Clinton contended showed her opponent to be unsuitable for the presidency:", "CLINTON: I — I find it ironic that he's raising nuclear weapons. This is a person who has been very cavalier, even casual about the use of nuclear weapons. He's...", "TRUMP: Wrong.", "CLINTON: ... advocated more countries getting them, Japan, Korea, even Saudi Arabia. He said, well, if we have them, why don't we use them, which I think is terrifying ... But here's the deal. The bottom line on nuclear weapons is that when the president gives the order, it must be followed. There's about four minutes between the order being given and the people responsible for launching nuclear weapons to do so. And that's why 10 people who have had that awesome responsibility have come out and, in an unprecedented way, said they would not trust Donald Trump with the nuclear codes or to have his finger on the nuclear button.", "At 8:35 PM on 19 October 2016, Clinton published a tweet on the same subject, stating that a president's decision to use nuclear weapons \"can take as little as four minutes\" (from order to launch) suggesting that the window she referenced was somewhat fluid:", "When the president gives the order to launch a nuclear weapon, that’s it. The officer has to launch. It can take as little as four minutes. — Hillary Clinton (@HillaryClinton) October 20, 2016", "Most of the people tweeting that Clinton had \"leaked\" classified information by mentioning this window cited no specific information substantiating that to be true (or explaining how they themselves could know and openly discuss information that was supposedly classified).", "If the information were indeed classified, confirming it with any government agency would prove difficult, for obvious reasons.  An alternative method of determining whether Clinton inadvertently disclosed classified information about nuclear protocols would be to verify if that information was already publicly known and open discussed.  Indeed, on 5 August 2016 Foreign Policy magazine published an article about that very subject with a subhead that openly proclaimed it:", "The piece had been inspired by (an unsubstantiated) rumor spread by MSNBC host Joe Scarborough suggesting that Donald Trump appeared interested in having the United States use nuclear weapons. The article's author cited a book \"Walter Slocombe wrote nearly 30 years ago\" as well as a contemporaneous \"nuclear timeline\" examining whether nuclear \"launch under attack\" was \"feasible.\" Based on discussion that occurred during the MSNBC segment about the steps leading up to the use of nukes, the article focused on the \"timeline\" of nuclear events based on an anecdote from 1979:", "All those steps leave something like eight minutes from the first call to the White House to the last moment at which the president can act.", "Much of those eight minutes is lost to the task of informing the president. The first call to the White House isn’t to the president, of course. It is to a person designated by the president for this task. (Well, probably the military assistant to that person — another minute ticks off the clock.) In November 1979, that person was Zbigniew Brzezinski — then-President Jimmy Carter’s national security advisor and father to Mika, who was sitting next to Scarborough, solemnly shaking her head at the idea of Trump with the bomb.", "You should really watch Zbig tell the story, though the bottom line is that he recalled having only three minutes to decide whether or not to inform the president,  after which the president had four minutes to decide whether or not to retaliate. At the end of his three minutes, Brzezinski’s military assistant called back to tell him it was a false alarm — someone had left a training tape running. Brzezinski went back to bed. He never woke his wife, by the way. He decided that if it was a Soviet nuclear attack, it was better to let her die in her sleep.", "(At this point the substance of the claim diverges slightly, from holding that it takes four minutes to launch nuclear weapons once the President has given the order to do so, to holding that the President has four minutes to decide whether to launch nuclear weapons once he's been informed that a nuclear attack on the U.S. is imminent.)", "Internet chatter from 2015 also described \"four minutes\" as an old Cold War rule of thumb for the timeframe between first detection of incoming nuclear missiles and those missiles' hitting their targets.", "Most articles on the subject published prior to the debate referenced (as Clinton's tweet appeared to do) a windows of roughly between four to 12 minutes in which a sitting President must decide to launch a nuclear attack:", "Although [nuclear response protocol] remains shrouded in secrecy, we actually know a great deal about it, beginning with the president’s first task of opening the “nuclear suitcase” in an emergency to review his nuclear attack options ... Let us say the president is awakened in the middle of the night (the proverbial 3 a.m. phone call) by his or her top nuclear adviser and told of an incoming nuclear strike. Since the flight time of missiles fired from launch stations in Russia or China to the White House is 30 minutes, and 12 minutes or less for missiles fired from submarines lurking in the Western Atlantic Ocean (Russian subs historically favor a patrol area to the west of Bermuda), the steadiness and brainpower of the commander in chief in such circumstances are serious questions indeed.", "This call has never happened, but if it ever does, the situation would be as stressful and dangerous as things ever get inside the Oval Office. The closest we came to such a call occurred in 1979, when the consoles at our early warning hub in Colorado lit up with indications of a large-scale Soviet missile attack. President Jimmy Carter’s national security adviser, Zbigniew Brzezinski, received back-to-back calls in the middle of the night informing him of the imminent nuclear destruction of the United States ... Just before he picked up the phone to call Carter, Brzezinski received a third call, this time canceling the alarm. It was a mistake caused by human and technical error. A training tape simulating an all-out Soviet attack had inadvertently slipped into the actual real-time attack early warning network. The impending nuclear holocaust was a mirage that confused the duty crew. (They were fired for taking eight minutes instead of the required three minutes to declare their degree of confidence that an attack against North America was underway.)", "How would a President Trump behave under such duress, informed of the attack and the imminent destruction of the nation’s capital and himself? He would have only a few minutes to consider the reliability of the attack report and decide whether and how to retaliate. If the attack is real, and he hesitates, a president will likely be killed and the chain of command decapitated, perhaps permanently.", "Among the people weighing in after the debate were who were able to assess the rumor and rate it was nuclear security expert Joe Cirincione, who issued two tweets about the controversy — one explicitly stating that Clinton did not disclose classified information and another reiterating that the information was already widely known and often cited:", "No, @HillaryClinton did not reveal any secret about how quickly we can launch ?. This is widely known, often cited. https://t.co/3z2VQEUlDm", "— Joe Cirincione (@Cirincione) October 20, 2016", "Another example of public expert citation of the dangerously fast, 4-5 minute launch times of our nuclear missiles. https://t.co/y1xTTu6K4X", "— Joe Cirincione (@Cirincione) October 20, 2016", "Blair, Bruce.   \"What Exactly Would It Mean to Have Trump’s Finger on the Nuclear Button?\r\n    Politico.   11 June 2016.", "Blake, Aaron.   \"The Final Trump-Clinton Debate Transcript, Annotated.\"\r\n    Washington Post.   19 October 2016.", "Lewis, Jeffrey.   \"Our Nuclear Procedures Are Crazier Than Trump.\"\r\n    Publication Name.   5 August 2016.", "Nuclear Threat Initiative.   \"Is Launch Under Attack Feasible?\"\r\n    publication date   4 August 2016.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]