["By Jessica McDonald", "Posted on December 26, 2018", "Since the National Climate Assessment dropped on Black Friday, members of the Trump administration have inaccurately attacked the report for lacking transparency and factual basis, and for focusing on an “extreme” climate scenario. The EPA has also suggested — without evidence — that the Obama administration “pushed” the “worst-case scenario.”", "The report — which is the product of 13 federal agencies and more than 300 governmental and non-governmental experts — is legally required to be produced by the U.S. Global Change Research Program, or USGCRP, which issued its first assessment in 2000. It details how climate change is already affecting the country, from increased temperatures and flooding to more frequent hurricanes and large wildfires. It also looks at potential future consequences on the environment, infrastructure, human health and the economy.", "President Donald Trump has largely dismissed the report. When asked about the assessment, the president has minimized the impact of human activity on climate change and made unrelated claims regarding the cleanliness of U.S. air and water, as we’ve written previously.", "But more specific critiques came from administration officials and White House representatives.", "For example, White House Deputy Press Secretary Lindsay Walters released a statement to us that downplayed the report by claiming it “is largely based on the most extreme scenario,” adding, “we need to focus on improving the transparency and accuracy of our modeling and projections.” She also noted that the next climate assessment “gives us the opportunity to provide for a more transparent and data-driven process that includes fuller information on the range of potential scenarios and outcomes.”", "Many of these talking points were reprised by White House Press Secretary Sarah Sanders during a White House briefing on Nov. 27, when she said the report “is based on the most extreme modeled scenario,” is “not based on facts” and is “not data-driven.” Instead, she said, the report is “based on modeling, which is extremely hard to do when you’re talking about the climate.”", "In an interview with the NBC affiliate in Sacramento, California, on Nov. 27, Interior Secretary Ryan Zinke also referenced the scenarios, saying “it appears they took the worst scenarios and they built predictions upon that.” He added, “It should be more probability.”", "Zinke, who has since resigned, also said “there is some concern within the USGS” about the climate report, referring to the U.S. Geological Survey, without providing any evidence.", "Finally, acting Environmental Protection Agency head Andrew Wheeler said at a Washington Post Live event on Nov. 28 that he “wouldn’t be surprised if the Obama administration told the report’s authors, ‘Take a look at the worst-case scenario for this report.’” The EPA press office then doubled down on Wheeler’s speculation, issuing a press release that said the Obama administration “pushed” the “worst-case scenario'” and citing the Daily Caller’s reporting as proof of such manipulation.", "These claims, however, are false, exaggerated or unsubstantiated:", "Because the claims clustered around these four themes, we’ll address each of them in more detail in the sections below.", "As for Zinke’s comment that there is “concern within the USGS” about the climate report, there is no evidence to support his statement.", "U.S. Geological Survey representatives did not respond to our inquiries, but the USGS is one of the key agencies that was responsible for creating the report. In fact, nearly two dozen USGS scientists served as authors, contributing to 10 of the 29 chapters. And Virginia Burkett, USGS chief scientist for climate and land use change, is part of the leadership of the U.S. Global Change Research Program.", "The report is organized into four main sections, the first tackling “national topics” such as water, agriculture, air quality and coastal effects. For each issue, the authors describe existing climate change impacts as well as those that could be on the horizon. For example, on temperature, the authors explain that annual average temperatures in the contiguous U.S. have increased by 1.8 degrees Fahrenheit since the beginning of the last century. Over the next few decades, temperatures are expected to rise to an increase of 2.5 degrees, regardless of future emissions. And by the end of the century, the increase could be anywhere between 3 and 12 degrees, “depending on whether the world follows a higher or lower future scenario.”", "The next section takes a closer look at 10 specific regions of the country, each of which faces different challenges because of variation in geography, climate and population. For example, the Northeast is already seeing less distinct seasons that “adversely impact” tourism, farming and forestry, while the Southeast is already vulnerable to flooding and the Southwest has seen more intense wildfires and droughts.", "A third section discusses mitigation strategies — approaches that reduce greenhouse gas emissions, and therefore limit the amount of climate change — and adaptation strategies, which refer to methods of reducing the risk of climate change, for example, by elevating homes threatened by flooding. The mitigation chapter, in particular, has been frequently cited in the press, because it goes into the possible economic impacts of climate change, which the report says could amount to “hundreds of billions of dollars” by 2100 under a higher emissions scenario.", "Finally, a fourth section is devoted to a series of appendices, including explanations of how the report was put together and what kind of information was used. We’ll be coming back to these, because they contain a lot of the nitty-gritty details that demonstrate the report’s transparency and data-driven approach.", "Wheeler, Zinke, Sanders and Walters each criticized the National Climate Assessment for using or being “based” or “largely based” on a scenario they variously described as “worst-case” or “the most extreme.” They’re referring to a scenario known as RCP8.5, which is the highest of the four scenarios most frequently used by scientists to do climate projections.", "But a quick skim of the National Climate Assessment reveals that the document does not rely on this single scenario. Figures often feature at least two scenarios, and sometimes include a third.", "“Not every statement has every RCP scenario in it,” said Katharine Hayhoe, a climate scientist and director of the Climate Science Center at Texas Tech University, and an author of the report, in a phone interview. But, she said, there are “dozens of examples” where multiple RCPs are used.", "Indeed, the report itself says it focused on RCP8.5 as a “higher” scenario with more warming, and RCP4.5 as a “lower” scenario with less, while also including other scenarios, such as the “very low” RCP2.6. We’ll return to the specifics on this decision later. RCPs were used in the fifth and most recent climate assessment from the Intergovernmental Panel on Climate Change, or IPCC, which is part of the United Nations.", "And of course, none of the scenarios are relevant to the many statements in the report about the climate change effects that have already happened, such as the fact that the U.S. has already become warmer by about 1.8 degrees Fahrenheit over the last century, or that, because of sea level rise, multiple communities are now five to 10 times more likely to have high tide flooding than in the 1960s.", "It’s worth pausing here to understand what RCPs are in the first place, because they can be easily misinterpreted.", "RCP stands for “representative concentration pathway,” and each numbered scenario refers to the total amount of radiative forcing — essentially the amount of climate change — that would occur by the year 2100, relative to pre-industrial times. RCP8.5, then, is a pathway that assumes that by the turn of the next century, the Earth will have added an extra 8.5 watts per square meter to its energy balance.", "By focusing on radiative forcing, the RCP system avoids making specific assumptions about emissions, population growth, or economic and technological development.", "“For any one radiative forcing trajectory, there are theoretically an infinite number of socioeconomic and emission scenarios to get you there,” said Richard Moss, a visiting senior research scientist at Columbia University’s Earth Institute, in a phone interview. He helped formulate the RCP approach.", "But there are certain trajectories that are consistent with the various RCPs, and these are often used to describe them. For example, RCP8.5 is consistent with a future in which fossil fuels continue to dominate, there is no climate policy to speak of, and there is high population growth and low — but not zero — technological development. RCP4.5, in contrast, does include climate policies, such as a price put on emissions, and there is less population growth and more technological development. In RCP2.6, more stringent mitigation policies are in place and emissions peak and turn negative by the beginning of the next century.", "The RCP system may be less straightforward than a basic emissions scenario, but Moss said scientists developed RCPs because it allowed them to be more flexible and do climate modeling more quickly than before.", "In 2007, an independent group of climate scientists selected four RCPs that represented the wide range in the scientific literature and were well-spaced apart: 2.6, 4.5, 6.0 and 8.5.", "A larger issue with RCPs is that they aren’t intended to be forecasts of what will happen, even though that’s exactly what the public often interprets them to be.", "“They’re not predictions, they’re what-if exercises,” said Moss. Many people assume scientists are offering forecasts on the most likely scenario, he said, but the “point is specifically not to say what is most likely.”", "Scientists, then, want to use a range of scenarios that give a solid idea of where we might be headed, while at the same time, not overselling any particular one.", "The other angle is that scientists use scenarios for risk assessment. And as Moss explained, “you don’t choose a middle scenario” for that. You choose a high scenario to describe the potentially bad outcomes that “may have low probability but high consequence.”", "As for RCP8.5 itself, Moss and Hayhoe both said it’s inaccurate to call the scenario the “worst” or a “worse-case.” Hayhoe said it was a very deliberate choice on the authors’ parts to call RCP8.5 the “higher” scenario, to contrast with the RCP4.5 “lower” scenario. In the report, these are often used together.", "In chapter four of the earlier volume of the climate report, the authors note that RCP8.5 “is not intended to serve as an upper limit on possible emissions” (see section 4.2.1).", "Moss and Hayhoe also said climate modeling might be missing certain elements that could make RCP8.5’s projections too low.", "Finally, there is the fact that, of late, the Earth seems to be following RCP8.5. The climate report explains that the “observed acceleration in carbon emissions over the past 15–20 years has been consistent with the higher future scenarios (such as RCP8.5).” It goes on to say that while emission rates began to slow in 2014, and even approach zero growth in 2016, preliminary data in 2017 suggest a return to an increasing rate of emissions. Separately, reports released in early December indicate 2018 is also headed toward a higher emission rate. This doesn’t mean 80 years down the line the Earth is likely to still be following RCP8.5, but it is plausible.", "Andrew Wheeler, the acting EPA chief, suggested on Nov. 28 that the Obama administration told the climate assessment authors to use the highest scenarios. In a Washington Post Live interview, Wheeler said he “wouldn’t be surprised if the Obama administration” directed authors to the “worst-case scenario.”", "Later that day, the EPA press office wrote in a press release that Wheeler “was right” when he made that statement, adding, “In fact, the Obama administration did just that.” The press release was titled “Fact-Check: Obama Administration Pushed ‘Worst-Case Scenario’ In Climate Assessment.”", "It’s true that the scenarios were selected at a time when Obama was in office, but that is not evidence that the administration pushed for a higher scenario. As we’ve just explained, RCP8.5 was in standard use at the time.", "In the press release, the EPA pointed to reporting by the Daily Caller, a conservative website, which wrote that a May 2015 memo proved Wheeler’s the point. The website also wrote that the memo contradicted John Holdren, Obama’s director of the Office of Science and Technology Policy, or OSTP, who told Politico that he did not choose the authors of the report and was not involved in scenario selection.", "In an email to us, Holdren also denied playing a role in the report’s approach. “The insinuations out there that I or some other senior official was behind it [scenario selection] are absolutely false,” he said.", "The memo, which is unsigned, does not show that the Obama administration pushed for certain scenarios. The memo lays out the rationale for using a range of scenarios, and for focusing on the RCP8.5 and 4.5 for impact assessments. “For assessments of impacts, vulnerability, and adaptation responses,” the memo states, “NCA4 will focus on RCP 8.5 as a high-end scenario and RCP 4.5 as a low-end scenario. Other scenarios (e.g., RCP 2.6) may be used in addition where instructive, such as in analyses of mitigation issues,” adding that “using a low-end and a high-end scenario will facilitate communications of assessment findings.”", "The memo goes on to explain that the choice of these two main RCPs was made in part to “maintain continuity and consistency” not only with other major climate assessments, such as the IPCC reports, but also to previous National Climate Assessments. Two earlier editions of the assessment, for example, used an older set of scenarios that are roughly equivalent to RCP4.5 and RCP8.5. (The memo doesn’t mention this, but this includes the second climate assessment published in 2009, which would have largely been developed during the Bush administration.)", "Many of these points are also made in the climate assessment itself, such as in the report guide and in the third appendix. The report also cites the memo — something you would not expect if it contained proof of political meddling.", "The choice of using RCP8.5 and 4.5 is not limited to various climate assessments. A literature search with both terms, for instance, reveals dozens of papers that are premised on the very same comparisons. Moss, for his part, said the decision to focus on RCP4.5 and 8.5, was “very reasonable.”", "In a statement to us, White House Deputy Press Secretary Lindsay Walters said that “we need to focus on improving the transparency and accuracy of our modeling and projections” and that the next climate assessment “gives us the opportunity to provide for a more transparent and data-driven process.”", "The climate report, however, is by design a transparent document. The creation process included repeated opportunities not only for scientists in and out of the government to make changes, but also for the public to comment.", "Each draft and outline was subject either to an interagency review, technical review by a National Oceanic and Atmospheric Administration-funded group at North Carolina University or an outside review.", "The third draft, for example, was released to the public for three months, during which time the National Academies of Sciences, Engineering, and Medicine also reviewed it. Chapter authors were then “required to respond to each and every comment” and to update their sections accordingly. Review editors made sure the responses were adequate. All of the feedback, along with the responses, is available online.", "With transparency in mind, scientists also included “traceable accounts” at the end of chapters to document the evidence base and uncertainties for each “key message.” These provide explanations of why authors came to the conclusions that they did, as well as a description of the confidence or likelihood for that message.", "“The traceable accounts go into excruciating detail,” said Hayhoe. “It’s hard to imagine anything more transparent.”", "The final claim we’ll address is the notion that the National Climate Assessment isn’t “based on facts,” or isn’t “data-driven,” as Sanders said.", "This is false. As is clear from the extensive reference lists for each chapter, the report is fact-based. The report describes its many sources this way.", "NCA4, November 2018: The findings in this report are based on an assessment of the peer-reviewed scientific literature, complemented by other sources (such as gray literature) where appropriate. In addition, authors used well-established and carefully evaluated observational and modeling datasets, technical input reports, USGCRP’s sustained assessment products, and a suite of scenario products. Each source was determined to meet the standards of the Information Quality Act.", "In the second appendix, the report goes into even more detail about its sources, noting that the “vast majority” are from the peer-reviewed scientific literature. In the rare circumstance that information didn’t come from the literature or the government, authors evaluated the quality of the source by asking a few key questions, such as how important the source is to the topic, and whether it is objective and publicly available. NOAA also checked that all sources met its guidelines.", "Sanders claimed that climate modeling is “an extremely complicated science that is never exact.” She repeated the idea again, after saying that the administration would like to see something “more data-driven,” adding, “it’s based on modeling, which is extremely hard to do when you’re talking about the climate.”", "Part of what Sanders is saying is absolutely correct. “She’s right climate modeling is very complex,” said Hayhoe.", "But just because modeling is difficult doesn’t mean it’s not based on data, or that climate models are unreliable. This misrepresents how climate modeling works and what we know about its performance.", "Climate models essentially are sets of equations that incorporate what scientists know about the fundamental physics, chemistry and biology of Earth systems. To make projections about the future, researchers first make the problem more manageable by divvying up the Earth’s atmosphere and surface into smaller chunks, or grid cells. Then they run the models for each cell over a set period of time, allowing neighboring cells to interact with one another. That data is recorded, and then repeated until a researcher reaches a target year. In this iterative fashion, scientists develop maps of varying resolution that show how the climate might change under certain scenarios.", "There are, of course, uncertainties associated with modeling. Scientists are well aware of this and don’t claim to have everything figured out. In fact, they know they’re missing some of the more complex interactions. But Hayhoe said it’s precisely because of this that scientists are “more concerned, not less.”", "“We know that there are processes not included that would make sea level rise faster and greater,” she said. “We’re so conservative — unless we totally understand something, we don’t put it in the model.”", "This point is also made in the climate assessment.", "“While climate models incorporate important climate processes that can be well quantified, they do not include all of the processes that can contribute to feedbacks, compound extreme events, and abrupt and/or irreversible changes, including key ice sheet processes and arctic carbon reservoirs,” the report reads. “The systematic tendency of climate models to underestimate temperature change during warm paleoclimates suggests that climate models are more likely to underestimate than to overestimate the amount of long-term future change; this is likely to be especially true for trends in extreme events.”", "Contrary to Sanders’ insinuation, complexity isn’t a reason to doubt the projections, although no one should view them as certainties. If anything, it’s a reason to think they could be on the low side.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]