["About this rating", "In 2014, Tamir Rice, a 12-year-old Black boy, was shot and killed by police for holding a fake toy gun. In August 2020, 17-year-old Kyle Rittenhouse walked by police officers after he allegedly shot and killed two people but was not apprehended, even as bystanders tried to alert police. He drove back to his home town and was arrested the next day.", "It isn’t clear what Rittenhouse did after he went home.", "On Aug. 24, 2020, a white police officer in Kenosha, Wisconsin, was captured on cellphone video shooting Jacob Blake, a Black man, multiple times as he tried to enter his vehicle. Demonstrations against police brutality erupted in Kenosha on Aug. 25, in reaction to Blake's shooting. These protests spiraled into chaos when white, armed agitators appeared on the streets. Some, like teenager Kyle Rittenhouse, were accused of shootings.", "Memes emerged online comparing law enforcement's treatment of Rittenhouse — who is white — to that of Tamir Rice — a Black boy shot and killed by police in 2014 after his toy gun was mistaken for a real one.", "Snopes readers shared versions of these posts with us and asked us to look into their accuracy. While the two scenarios are glaringly different, especially in their outcomes, most of the claims aligned with the facts in each case.", "On Nov. 22, 2014, 12-year-old Rice was fatally shot by a police officer in Cleveland, Ohio. Rice had been playing in a park and posing with a toy gun that fired plastic pellets, according to The New York Times.", "Police received a 911 call that day that there was a \"guy in here with a pistol.\" But the caller’s complete message that the gun was \"probably fake\" and the person holding the gun was \"probably a juvenile\" was never conveyed to the officer involved in the shooting.", "Within seconds of arriving at the park, the police officer shot Rice in the abdomen at point-blank range. The officer later said that he warned the boy three times to raise his hands, a claim many have doubted.", "On Aug. 25, 2020, footage showed 17-year-old Rittenhouse firing at protesters with an AR-15-style firearm after being chased in Kenosha. He was not legally old enough to wield an assault rifle in that state.", "Video footage showed police tossing bottles of water to Rittenhouse and other armed white people, telling them: \"We appreciate you guys.\" This occurred shortly before the shootings he was later implicated in.", "After Rittenhouse allegedly shot three people (two fatally), The New York Times reported that \"police vehicles remained stationary during the gunfire.\" Rittenhouse then walked with his hands up towards the police, while bystanders called out to them that he had just shot people. But the police drove by without stopping in order to assist victims.", "Rittenhouse then drove to his home town of Antioch in Lake County, Illinois, about 20 miles from Kenosha. We can't confirm if Rittenhouse went home to sleep, but according to reports, he was arrested the next day — on Aug. 26 — at his mother's house.", "He was charged with two counts of reckless intentional homicide and one count of attempted reckless intentional homicide. He was also charged with reckless endangerment and possession of a deadly weapon by a person under the age of 18, according to a criminal complaint. At the time of writing this, Rittenhouse was being held in a juvenile facility in Illinois, while authorities planned to extradite him to Wisconsin.", "While the majority of the statements presented in the meme are accurate, the contexts are very different. We also could not prove what Rittenhouse did when he returned to his home town before getting arrested. We thus rate this claim as \"Mostly True.\"", "Armus, Teo.   \"Kyle Rittenhouse Was Fixated on Supporting Police Before Deadly Shooting in Kenosha.\"\r\n   The Washington Post.   27 August 2020.", "Baca, Stacy, Rob Elgas, and Alexis McAdams.   \"Antioch Teen Kyle Rittenhouse Appears in Court on Murder Charges for Kenosha Protest Shooting, Lawyers Say he Acted in Self-Defense.\"\r\n   ABC7 Chicago.   28 August 2020.", "BBC News.   \"Kyle Rittenhouse Charged Over Wisconsin Protest Deaths.\"\r\n   28 August 2020.", "Clerk of Circuit Court, Kenosha County.   \"State of Wisconsin vs. Kyle H. Rittenhouse.\"\r\n   27 August 2020.", "Cleveland 19 News.   \"Tamir Rice: Timeline.\"\r\n   10 July 2015.", "Hinkel, Dan.   \"Kyle Rittenhouse Charged with Murder in Kenosha Shootings That Killed 2; Jacob Blake Handcuffed to Hospital Bed, Uncle Says.\"\r\n   Chicago Tribune.   28 August 2020.", "Lee, Jessica.   \"Was Kenosha Corrections Building Destroyed in Protests?\"\r\n   Snopes.   27 August 2020.", "Lutz, Tom.   \"Kenosha: Fears Rise that Trump Visit Could Inflame Tensions Amid Protests.\"\r\n   The Guardian.   30 August 2020.", "Palma, Bethania.   \"Did Kenosha Police Give Water to Teen Charged With Double Homicide?\"\r\n   Snopes.   31 August 2020.", "St. Clair, Stacy, Christy Gutowski, Robert McCoppin, and Angie Leventis Lourgos.   \"What We Know so Far about Kyle Rittenhouse, the 17-year-old Accused of Murder After Fatal Kenosha Protest Shootings.\"\r\n   Chicago Tribune.   26 August 2020.", "The Washington Post.   \"Law Enforcement Thank and Offer Water to Kyle Rittenhouse, Later Charged with Protest Shooting.\"\r\n   27 August 2020.", "Vielmetti, Bruce.   \"What to Know about Wisconsin's Open-Carry Laws, Self Defense and More in Kenosha Protest Shootings.\"\r\n   Milwaukee Journal Sentinel.   26 August 2020.", "Willis, Haley, Muyi Xiao, Christiaan Triebert, Christoph Koettl, Stella Cooper, David Botti, John Ismay, and Ainara Tiefenthäler.   \"Tracking the Suspect in the Fatal Kenosha Shootings.\"\r\n   The New York Times.   27 August 2020.", "Correction [Sept. 1, 2020]: A previous version of this article incorrectly stated that Jacob Blake died after being shot by police. He was left paralyzed, but did not die.", "Nur Nasreen Ibrahim is a reporter with experience working in television, international news coverage, fact checking, and creative writing.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]