["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "The General Assembly recently took strides to change how Virginia draws its political maps, despite opposition from most black delegates.", "It passed a proposed constitutional amendment that would create a commission of citizens and lawmakers to draw congressional and state legislative districts. The process has long been in the sole hands of the legislature, leading to charges of gerrymandering.", "Although the resolution unanimously passed the Senate and cleared the House on an 83-15 vote, 11 of 14 black delegates voted against it. Several said the proposed amendment - which must approved by the legislature again next before it’s put to voters - offers no guarantee of black representation on the redistricting commission. They also complained that black legislators weren’t included in negotiations between the House and Senate that ironed out the final version of the redistricting resolution.", "That brought Del. Chris Jones, R-Suffolk, to his feet. Jones, who is white, has been a  delegate for 21 years. He urged passage of the resolution and said Republicans, during two decades of controlling the House, have a strong record empowering black delegates.", "\"Republicans have had more African-Americans on key committees than when the Democrats were in control,\" he said.", "We wondered if Jones is right.", "Background", "Jones told us the \"key committees\" he was referring to are the budget-writing House Appropriations Committee, and the Commerce and Labor Committee, which controls business regulations. The House has an informal rule that no member can serve on both. Jones is chairman of the Appropriations Committee.", "We also spoke Del. Lamont Bagley, D-Richmond, chairman of the Virginia Legislative Black Caucus. He agreed with Jones’ definition of \"key committees.\"", "The last time Democrats controlled the 100-seat House was 1997, when there were 52 Democrats, 47 Republicans and one independent. This year, Republicans have 51 seats; Democrats, 49.", "The party in power chooses the speaker, who controls all committee assignments. Delegates lobby to serve on prestigious panels and committee chairmen often urge the speaker to assign certain lawmakers to their groups. The final decision, however, rests with the speaker.", "In 1997, the speaker was Tom Moss, a Democrat from Norfolk. This year, it’s Kirk Cox, a Republican from Colonial Heights.", "It’s important to note that the number of black delegates has increased. In 1997, there were 10; now there’s 14. If strict proportionality was a House rule (which it’s not), then blacks would have occupied 10 percent of each committee’s seats in 1997, and 14 percent this year.", "Numbers", "In 1997, three black lawmakers served on the 22-member Appropriations Committee, which was roughly proportional to their House membership. This year, six black members  are on the panel - double their proportion in the House.", "In 1997, two black legislators served on the Corporations, Insurance and Banking Committee - which became the Commerce and Labor Committee. This year, four are on the panel. That’s one more than they would have under proportionality.", "A side note: In 1997, Democrats didn’t have today’s informal rule that no one serves on both Appropriations and Commerce and Labor. One black legislator - the late William Robinson Jr., D-Norfolk - served on both panels. In other words, only four of 10 black delegates had seats on a key committees.", "This year, 10 of 14 black delegates sit on a key committee.", "Other House committees", "Here are the minority breakdowns of the other House committees in existence since at least 1997, although they do not influence this fact-check. We list the year, the number of blacks on the panel, and the number of seats on the committee.", "We asked Bagby, chairman of the Black Caucus, if he had concerns about minority committee appointments in the House. \"No arguments there,\" he said.", "The Senate", "We wanted to give you the state Senate numbers, although they, too, don’t count in this fact-check.", "Partisan control of the chamber, unlike the House, has fluctuated this century. The last time Democrats controlled the 40-member Senate was 2011. There were five black senators then, the same number as today.", "In the budget-writing Finance Committee, minority members fell from 3 of 15 in 2011 to 2 of 16 this year.  The 15-member Senate Commerce and Labor Committee rose from two blacks in 2011 to three this year.", "Here are the other Senate committee breakdowns:", "Our ruling", "Jones said,  \"Republicans have had more African-Americans on key committees than when the Democrats were in control.\" He later said he was referring to the House  Appropriations Committee and the Commerce and Labor Committee - a delineation that the chairman of the Black Caucus agrees with.", "There were three black members of Appropriations in 1997 - the last time Democrats controlled the House. Now there are six. There were two black legislators serving on the committee that became Commerce and Labor; now there’s four.", "We need to consider that the number of black delegates in the 100-member House rose from 10 in 1997 to 14 today. In other words, while black representation in the House rose by 40 percent during that span, it increased by 100 percent on Appropriations and 50 percent on Commerce & Labor.", "So Jones’ claim holds up. We rate it True.", "Del. Chris Jones, Floor speech, Feb. 23, 2019 (5:21:11 mark on video).", "Interview with Jones, Feb. 28, 2019.", "Interview with Del. Lamont Bagley, March 1, 2019.", "Legislative Information Service, 1997 session, 2019 session, accessed Feb. 28, 2019.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]