["About this rating", "An item about a child supposedly named \"Le-a\" began circulating on the Internet in early October 2008.", "A school teacher friend sent this to me. This is a child's name!", "\"Le - a\"", "How would you pronounce this as a child's name???", "Leah?? NO", "Lee - A?? NOPE", "Lay - a?? NO", "Lei?? Guess Again.", "Are you resorting to tongue clicks yet??", "It's pronounced \"Ledasha\" oh yes...you read it right. The dash is not silent.", "This child attends a school in Livingston Parish. (Louisiana)", "Her mother is irate because everyone is getting her name wrong. SO, if you see something come across your desk like this please remember to pronounce the dash. When the mother was asked about the pronunciation of the name, she said \"the dash don't be silent.\"", "While the unusually named child in versions circulated back then was almost always said to attend \"a school in Livingston Parish (Louisiana),\" we encountered one stray version that stated \"This child attends a school in Richland County, Georgia\" and another that said \"This child attends a school in Detroit, MI.\"", "The closing line of the anecdote (\"the dash don't be silent\") positions the person who bestowed the moniker as African-American through its phrasing in African American Vernacular English (AAVE), also known as Ebonics: Such use of \"don't be\" in place of \"isn't\" is particular to AAVE.", "<!--\nInterestingly, according to a 2006 census estimate only about 7.2% of the racial makeup of the Louisiana parish where \"Le-a\" is said to live (Livingston) was African-American. If the story was concocted for the purpose of making a disapproving point about a presumed penchant among one segment of the population for its naming children in wildly unorthodox fashion, it's curious that the tale was set in a Louisiana parish that is predominantly non-black.\n-->", "The racist and disapproving aspect of this item is clearly expressed in comments appended to many versions, such as \"And we let these people vote!\" and \"They live among us, they vote, and they breed!\":", "As to whether there is such a child, despite our hearing from dozens and dozens of readers who have claimed to us a girl bearing such a name was in their class or was in a class taught by a relative or acquaintance of theirs, we've yet to find documentation of anyone's bearing a name of \"Le-a\" that is pronounced \"Ledasha\" (or any other way).", "What we have found through searching online Social Security databases (which are not complete repositories of information and thus aren't the final say in the matter) showed that while there were more than 4,000 \"Lea\"s, there weren't any \"Le-a\"s. For what it's worth, references in various news stories document that \"Ledasha\" (fully spelled out, not in a \"Le-a\" form) has indeed been used as a girl's name.", "While the original e-mail quoted above dated from early October 2008, the first online appearance of the \"Ledasha\" story we've found so far is at least a month older. In that 5 September 2008 entry from ClayTravis.net, \"Ledasha\" spelled her name with an apostrophe:", "Kerry writes:", "\"My bro in law just told me a fantatic apostrophe story. Friend owns an indoor swim complex. Little girl came in for lessons and spelled her name Le'a. His friend called roll and pronounced Lea like the princess. She got attitude and said its Ladasha ... true story.\"", "As to the use of symbols within (or in place of) names, while such practice is rare, it is not unknown.", "<!--\n\n-->", "In 1993, recording artist Prince changed his name to an orthographic representation he dubbed \"Love Symbol\" and styled himself \"The Artist Formerly Known as Prince\" before reverting in 2000 to his original name. And the author of the 2008 book The Fortune Cookie Chronicles renders her name as Jennifer 8 Lee.", "Symbols and letters can be combined to form words that are easily pronounceable based on the understood sounds assigned to various symbols: The male name \"Matt\" could be rendered as \"M@\" for instance, with most people easily working out how to say it. However, such a system of creative (or \"kre8tiv\") spellings has some drawbacks, which we'll highlight by looking at how those factors would affect a name like \"Le-a\":", "In the ten years since we first published this article, we've heard from hundreds of people who have claimed that they knew a student, classmate, patient, neighbor, co-worker -- or relative thereof -- named \"Le-a,\" yet the existence of any person actually so named remains elusively undocumented.", "Lee, Renee.   \"E-Mail Lands Oak Ridge North Official in Hot Water.\"\r\n    Houston Chronicle.   23 August 2007.", "Thomas, Bill.   \"Hurricane Latonya? Hurricane Names Raise a Warning.\"\r\n    The Hill.   23 July 2003.", "Whitt, Richard.   \"Worker Fired Over Racist E-Mail.\"\r\n    The Atlanta Journal-Constitution.   28 September 2005   (p. B4).", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]