["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "During Monday’s Republican presidential debate in Manchester, N.H., moderator John King drilled former House Speaker Newt Gingrich, R-Ga. on one of the most divisive issues on Capitol Hill: taxes on the wealthy.\n\n\"Mr. Speaker, if you look at a poll in the Boston Globe just the other day, 54 percent of Republican voters in this state say they're willing to have higher taxes on the wealthy to help bring down the deficit. Are they wrong?\" the CNN anchor asked.\n\nGingrich responded that the real issue is whether raising taxes on higher-income Americans would create jobs. He then responded with striking claim about the recovery that followed the 1981-1982 recession, for which Gingrich and others credit the president at the time, Ronald Reagan.\n\n\"The Reagan recovery, which I participated in passing, in seven years created for this current economy the equivalent of 25 million new jobs, raised federal revenue by $800 billion a year in terms of the current economy, and clearly it worked,\" Gingrich said. \"It's a historic fact.\"\n\nReagan’s signature policy was a cut of the top individual income tax rate from 50 percent to 28 percent and the top corporate tax rate from 46 percent to 34 percent. It took effect in phases until fully in place in 1988.\n\nThe recovery under Reagan was especially strong, but politicians and economists debate whether Reagan’s tax breaks, which were passed by a Democratic-controlled Congress,  were the cause.\n\nGingrich is hardly alone among Republicans who have used Reagan’s record to bolster their argument that tax cuts can improve the economy. We checked similar claims by U.S. Senator Saxby Chambliss of Georgia and U.S. Rep. Joe Walsh of Illinois, one of several new House members elected with tea party support.\n\nWe called a Gingrich spokesman for more information on how the candidate came up with his numbers. He did not give an immediate response.\n\nFirst off, we’ll note that Gingrich was elected to Congress in 1978, so it’s fair to say that he \"participated in passing\" the Reagan legislative agenda. (King was slightly off about the Boston Globe poll -- it showed 56 percent support for a tax increase, not 54.)\n\nWe'll address Gingrich's claim in two parts, with the one about jobs first.\n\nJob creation statistics come from the Bureau of Labor Statistics, a federal agency. To get the net number of jobs created during a given period of time, you subtract the number of jobs held nationally at the starting point from the number of jobs held at the ending point.\n\nSo the first question is, what are the starting and ending points? Since Gingrich was talking about a \"recovery,\" we figured it would be fair to start the clock at the low point of the jobs picture. We’ve chosen January 1983 as what we think is a reasonable start date, and then picked January 1989 as the closing date, since that’s when Reagan left office. That leaves us with a nice, clean six-year period.\n\nCareful readers will note that this is not the seven years that Gingrich suggested. However, we think it’s the best way to measure Gingrich’s underlying point, and as it turns out, it doesn’t alter the outcome much.\n\nUsing the BLS data, we found that the number of employed Americans grew from almost 89 million in January 1983, the start of the \"Reagan recovery,\"  to more than 107 million in January 1989, an increase of 18.2 million or about 20 percent..\n\nBut we still need to adjust this figure to fit Gingrich’s description -- that is, the equivalent number of jobs the Reagan-era recovery would have produced for America today.  We adjusted the 18.2 million increase in jobs to account for the fact that today's labor force is 31 percent bigger and came up with 24 million jobs -- quite close to the 25 million Gingrich cited in the debate.\n\nSo score one for Gingrich. What about the money figure?\n\nFor this, we looked at the historical tables for federal revenue produced by the Office of Management and Budget. We also used the period of 1983 to 1989, though the figures in the OMB table refer to fiscal years rather than calendar years, so the timing is not exact.\n\nBetween fiscal year 1983 and fiscal year 1989, federal revenue climbed from about $600.6 billion to $991.1 billion. That’s an increase of $390.5 billion over the period.\n\nAs we did with the jobs number, we’ll adjust this increase to fit the current size of federal receipts. We found that revenue has increased by 2.73 times since the mid-1980s. Adjusting for the increase in revenues since the mid-1980s, it works out to slightly less than $1.1 trillion.", "But there’s one more step -- Gingrich had said that federal revenues had increased by today’s equivalent of $800 billion per year. So if you divide the $1.1 trillion number by the six years it covered, you get roughly $178 billion per year -- well below the $800 billion figure Gingrich cited.\n\nSo on tax revenues, the actual amount is far lower than what Gingrich claimed.\n\nWhere does this leave us? Gingrich got very close on the jobs number, but he was way off on the revenue figure. We’ll call it Half True.", "UPDATE: After we published our article, Gingrich's camp got back to us. R.C. Hammond, a spokesman, said that \"Newt meant over $800 billion over the recovery, not annually.\" Because misstatements do not protect speakers from a low rating on the Truth-O-Meter, our rating stands.", "CNN.com, debate transcript, June 13, 2011,\n\nBureau of Labor Statistics, main index page for \"Employment, Hours, and Earnings from the Current Employment Statistics survey (National),\" accessed June 14, 2011\n\nBureau of Labor Statistics, main index page for \"Labor Force Statistics from the Current Population Survey,\" accessed June 14, 2011\n\nOffice of Management and Budget, \"Table 1.1 — Summary of Receipts, Outlays, and Surpluses or Deficits: 1789–2016,\" accessed June 14, 2011\n\nPolitiFact, \"Rep. Joe Walsh said that every time we've cut taxes, revenues have gone up, the economy has grown,\" April 19, 2011\n\nPolitiFact, \"Chambliss makes case for tax cuts, citing Reagan and Bush,\" April 15, 2011", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]