["The Facebook post on November 21, 2018 has been retweeted 5,750 times, and shows over 1,300 reactions.", "The claim depicts German President Frank-Walter Steinmeier and links to an article, which has no byline, and reads:", "“... the most important thing, is that Germany will not invest in South Africa as long as the discrimination of BEE (Black Economic Empowerment) has not been ‘scraped’.The German delegation proposed that black ownership requirements be relaxed for new foreign investors and for further investments by companies already in the country.”", "There are no quotes or named sources cited in the article, which can been seen here, on this website and on Facebook posts here and here.", "BEE was introduced in a bid to overcome the dire economic inequalities that were a legacy of the apartheid era and to broaden participation in the economy, explains the South African Business Review journal.", "Via a direct message on his verified Twitter account, the German Ambassador to South Africa, Martin Schäfer, told AFP the claim was “not true”.", "He also tweeted the following on November 27, 2018.", "To whoever spreads fake news about plots to end German investments:\n\n\t\tNo phone call, not with BMW CEO, not with Berlin, not with @CyrilRamaphosa\n\n\t\tAll lies, sorry to say!\n\n\t\tTrue is:\n\t\tVisit by German President to South Africa last week greatly invigorated good bilateral relations pic.twitter.com/0I2WAfRN7S", "A spokeswoman at the German embassy in Pretoria added to AFP: \"German companies are well aware of the rightful expectations in S.A. to contribute to economic and social transformation.", "“Thus, whilst not everyone might be happy with each and every facet of transformation including BBBEE, there is great understanding amongst the German business community that investments in South Africa come with social corporate responsibilities.”", "“There is no instruction or guideline to withhold investment in South Africa; to the contrary, we wish South Africa to prosper and we encourage German companies to play their part in that.\"", "Broad-Based Black Economic Empowerment (B-BBEE) is the second phase of BEE, which aims to increase the number of black people that own, manage, control and are employed in South Africa’s economy.", "The contentious claim is partially copied from a press article published on November 20, 2018.", "A European Union (EU) discussion paper published in September 2018 does speak to concerns around black ownership requirements but proposed “constructive engagement with the SA government” -- and does not cite “scrapping” the policy.", "“EU supports continued economic transformation in South Africa through B-BBEE. The benefits of the B-BBEE, however, should be better understood through evidence-based analysis”, reads the paper.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]