["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Clay Pell, the grandson of former U.S. Sen. Claiborne Pell is inaugurating his political career by making a run for Rhode Island governor. Part of the challenge of getting hired for the job -- as in any job -- is showing you have the right experience.", "The issue came up during Pell’s Feb. 2 appearance on the WPRI-TV WPRI-12 program \"Newsmakers.\"", "In response to a question from host Tim White about his lack of political experience, Pell, a Democrat, argued that he has administrative experience, citing a previous post at the U.S. Department of Education.", "White noted that, as governor, Pell would have to deal with an $8.5 billion-budget.", "\"What’s the biggest budget you’ve ever managed?\" White asked.", "\"The budget I managed at the Department of Education was more than $60 million,\" Pell said. \"The International and World Language Education budget, which I oversaw, was more than $60 million.\"", "There's no doubt that Pell served as a deputy assistant secretary in that program. The education department issued a news release announcing his appointment and The Providence Journal published a story when he got the job.", "But did he really manage a $60-million budget? And for how long?", "When we contacted Pell's campaign, spokesman Bill Fisher sent us a link to the budget of the Office of Postsecondary Education.", "He said Pell oversaw the $70.2 million appropriation for international education and foreign language studies, along with the $2.2 million set aside for the Fund for the Improvement of Postsecondary Education. Total: $72.4 million. Pell had said the budget was \"more than $60 million.\"", "We also contacted the Department of Education directly, where spokesman Jim Bradshaw sent us to the same spreadsheet. He directed us to lines 579 to 583 -- the $70.2 million figure. We asked if the $2.2-million line item (line 586) applied as well, as Fisher reported, but Bradshaw didn't get back to us on that.", "When we went back to the Department of Education again to double-check Pell’s role, we received an email from Martha Kanter, now a senior fellow at the Steinhardt Institute of Higher Education Policy at New York University, who was the under secretary of education during Pell's tenure.", "While deputy assistant secretary, she said, \"he [Pell] oversaw and managed the U.S. Department of Education’s International and Foreign Language Education budget.\"", "Seventy million dollars is chump change compared with the $8.5 billion or so that Rhode Island is expected to spend in the next fiscal year. But when Pell says the portion of the Department of Education budget he oversaw was over $60 million, he is correct.", "But there’s another important element to this claim, which Pell didn’t mention in his TV interview: Pell only held the job from April 16, 2013 through Oct. 18, 2013, according to the education department. In other words, he was overseeing the budget for six months, at the most.", "If he had been there for a full year so he was implementing the bulk of his budget, we would rate his claim True. But he only actually administered a portion of that budget. That makes his claim technically accurate, but lacking an important mitigating factor.", "We rate the claim as Mostly True.", "(If you have a claim you’d like PolitiFact Rhode Island to check, email us at [email protected]. And follow us on Twitter: @politifactri.)", "WPRI.com, \"Newsmakers 1/31/2014: Clay Pell,\" accessed Feb. 4, 2014", "ProvidenceJournal.com, \"Clay Pell moves from White House post to U.S. Dept. Ed.\" May 7, 2013", "GovDelivery.com, \"The International and Foreign Language Education (IFLE) Office Welcomes Clay Pell, Deputy Assistant Secreatary,\" (sic), June 27, 2013, accessed Feb. 6, 2014", "Ed.gov, \"Office of Elementary and Secondary Education (OESE) budget,\" 2014 appropriation, accessed Feb. 6, 2014", "Interview and emails, Bill Fischer, spokesman, Clay Pell, Feb. 6-7, 2014", "Emails, Jim Bradshaw, press officer, U.S. Department  of Education, Feb. 7, 2014; Martha Kanter, senior fellow, Steinhardt Institute of Higher Education Policy, New York University, Feb. 10-12, 2014; and Jane Glickman, press officer, U.S. Department of Education, Feb. 18, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]