["About this rating", "A New York woman's online account led to the Skechers shoe company's pulling (at least for the moment_ a line of childrens' shoes after she posted photographs of what she called second-degree burns suffered by her 9-year-old son.", "In her 26 June 2018 post, which was shared several hundred times on Facebook, Sherry Foster said that her son Peyton had received 2nd-degree chemical burns from his Skechers lightable shoes because \"apparently when they get wet the batteries release a chemical causing children's feet to burn\":", "We contacted Sherry Foster seeking comment without receiving a response, but she said in one interview that her son had waited a day before telling her that his feet were hurting, and that they subsequently sought medical care:", "The day it happened, he came home and said \"My feet hurt.\" They were a little bit red, I didn't think anything of it -- maybe that they were cold from playing in the water. The next day he came home and was really complaining. That's when we decided, okay, what do we do, so we took him to the doctor. [The doctor had] seen it one other time, that's what gave it away. He had second degree chemical burns.", "Her son, Foster said, was expected to make a full recovery, but the experience has left him afraid to wear shoes. The shoes have been identified as a pair of Sketch Rayz, part of the S-Light line of shoes with soles that light up.", "Skechers sent a statement to news outlets saying that their products \"are rigorously tested for safety,\" and that Foster's account was the first incident of its type to be reported to them:", "Notwithstanding, when Ms. Foster's Facebook post was brought to our attention Friday, June 29, we immediately contacted her, inquired about her son, and asked her to send us the shoes so we can determine whether the shoes contributed to her son's injuries. Ms. Foster has agreed to send us the shoes, and we will continue our investigation. Despite the lack of any other similar reported incidents, we are taking this complaint very seriously and giving it the highest priority.", "Skechers also sent us a separate statement on 25 July 2018 saying:", "Testing on the actual pair hasn't begun. Though Ms. Foster agreed to send the pair in question, we have not received them after multiple follow ups. While we have no reason to believe that our shoes caused the incident, we are hoping for Ms. Foster’s cooperation so we can investigate this thoroughly and promptly. In the meantime, we are commissioning tests of similar styles, and are continuing to give this the highest priority.", "While the S-Line shoes are still visible on the company's website, a listing for the Sketch Rayz says they are \"out of stock or no longer available\":", "A Skechers spokesperson told us that those shoes have been \"sold out for some time.\"", "McCloskey, Jimmy.   \"Boy, 9, Horrifically Burned After Light-Up Shoes Leak Acid Over His Feet.\"\r\n    Metro.    3 July 2018.", "Levy, Lauren.   \"Mom Shares Urgent Warning After Boy's 'Cool' Shoes Give Him Chemical Burns.\"\r\n    Cafemom.   2 July 2018.", "Update [25 July 2018]: Added comments from Skechers.", "Arturo Garcia is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]