["About this rating", "On June 5, 2019, Politico reported that Democratic U.S. House Speaker Nancy Pelosi — who at that time was resisting calls within her party for the House to launch an impeachment inquiry against President Donald Trump — had stated of the president during a meeting with senior Democrats that, “I don’t want to see him impeached, I want to see him in prison\":", "Speaker Nancy Pelosi told senior Democrats that she’d like to see President Donald Trump “in prison” as she clashed with House Judiciary Chairman Jerry Nadler in a meeting over whether to launch impeachment proceedings.", "Pelosi met with Nadler (D-N.Y.) and several other top Democrats who are aggressively pursuing investigations against the president, according to multiple sources. Nadler and other committee leaders have been embroiled in a behind-the-scenes turf battle for weeks over ownership of the Democrats’ sprawling investigation into Trump.", "Nadler pressed Pelosi to allow his committee to launch an impeachment inquiry against Trump -- the second such request he’s made in recent weeks only to be rebuffed by the California Democrat and other senior leaders. Pelosi stood firm, reiterating that she isn’t open to the idea of impeaching Trump at this time.", "“I don’t want to see him impeached, I want to see him in prison,” Pelosi said, according to multiple Democratic sources familiar with the meeting. Instead of impeachment, Pelosi still prefers to see Trump defeated at the ballot box and then prosecuted for his alleged crimes, according to the sources.", "Afterwards, a meme began on social media stating that former Harvard Law School professor Alan Dershowitz, who self-identified as a \"liberal Democrat,\" had declared he was \"appalled at\" Pelosi for \"weaponizing the criminal justice system\":", "Dershowitz did offer the response to Pelosi's reported comment, as quoted in the meme, during an appearance on Fox News' \"The Ingraham Angle.\" The meme omitted several sentences from the middle and ending of Dershowitz's response, although without substantively changing the gist of his remarks:", "However, Dershowitz's reaction didn't seem to correspond to the context of what Pelosi had reportedly said.", "The House Speaker, according to Politico, didn't assert — as Dershowitz suggested — that she wanted or expected Trump, while a sitting president, to be simply thrown in prison without his having been charged with any crime or afforded due process. As reported by Politico, Pelosi's viewpoint at the time was that she \"prefers to see Trump defeated at the ballot box and then prosecuted for his alleged crimes,\" and her remark about \"want[ing] to see him in prison\" was not a public declaration but rather a comment she allegedly made in a private meeting with Democratic leaders that was subsequently leaked.", "Garcia, Victor.   \"Nancy Pelosi Should Be 'Ashamed of Herself.'\"\r\n    Fox News.   7 June 2019.", "Caygle, Heather.   \"Pelosi Tells Dems She Wants to See Trump ‘In Prison.’\r\n    Politico.   5 June 2019.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]