["About this rating", "U.S. Vice President Mike Pence's August 2018 announcement of plans for the creation of a sixth branch of the U.S. military dubbed \"Space Force\" drew mixed reactions from pundits, politicians, and Trump administration supporters and critics. Retired astronaut Mark Kelly was one of those who supposedly chimed in on the issue, as reflected in a meme circulated by social media users that quoted him as opining that the proposed Space Force was a \"dumb idea\":", "This is a genuine quote from Mark Kelly, who flew several missions on NASA's Space Shuttle from 2001 to 2011. The wording was taken from a tweet the former astronaut posted in June 2018 shortly after President Trump directed the Pentagon to \"begin the process necessary to establish a space force as the sixth branch of the armed forces\":", "This is a dumb idea. The Air Force does this already. That is their job. What’s next, we move submarines to the 7th branch and call it the “under-the-sea force?” https://t.co/S1urOuJBe6", "— Mark Kelly (@ShuttleCDRKelly) June 19, 2018", "Kelly elaborated on his position in an interview with MSNBC which took place shortly after Vice President Pence's announcement, saying that he stood by his \"dumb idea\" remark and that a Space Force would be redundant:", "Former astronaut Mark Kelly on President Trump's \"Space Force\" effort: \"The only person that I’ve heard say this is a fantastic idea is the Commander in Chief, the President of the United States. Everybody else says it’s redundant, its wasteful.\" https://t.co/5WNNuWy4v4 pic.twitter.com/e1c5uocTgv", "— MSNBC (@MSNBC) August 9, 2018", "Michael Dodge, an assistant professor in the Department of Space Studies at the University of North Dakota, noted Space.com that while other branches of the military (such as the U.S. Air Force) also started out as sectors of larger branches, the existence of the Air Force Space Command (AFSPC) would not necessarily be redundant because it would \"free up the Air Force to focus on what it does best\":", "President Donald Trump's administration is pushing to form a U.S. Space Force, a new military branch, but how would that agency differ from the Air Force Space Command, which already oversees much of the country's defense assets in space?", "The early version of the U.S. Air Force existed as the U.S. Army Air Corps, an aerial warfare sector of the U.S. Army. But as planes continued to advance technologically and find their way into mainstream travel, \"Congress decided they needed to have a new branch of the military,\" Dodge said. The country needed a branch that could \"address issues unique to this domain.\" The Air Force became the fifth branch of the U.S. armed forces in 1947.", "The Space Force would essentially serve the same purpose, but for space. Dodge said it would \"free up the Air Force to focus on what it does best,\" as the new branch addressed issues unique to space.", "Dodge noted that this space-oriented, sixth military branch makes the most sense now. \" [O]ur assets are so critical in outer space and everything that we do is so dependent on outer space that we need a new force capable of focusing on that domain by itself,\" he said.\"", "Another former astronaut, Buzz Aldrin, offered a different reaction to the new military branch. The Apollo 11 Lunar Module Pilot was in attendance in June 2018 when President Trump announced his intention to create a Space Force and later tweeted that the idea was \"one giant leap\" in the right direction:", "One giant leap in the right direction. #SpaceForce https://t.co/3ZAvB2Oex4", "— Buzz Aldrin (@TheRealBuzz) August 10, 2018", "Davenport, Christian.   \"Pence Details Plan for Creation of Space Force in What Would be the Sixth Branch of the Military.\"\r\n    The Washington Post.   9 August 2018.", "Gohd, Chelsea.   \"Trump Wants a Space Force — But We Have an Air Force Space Command.\"\r\n    Space.com.   10 August 2018.", "Greshko, Michael.   \"Would a U.S. Space Force Be Legal? Get the Facts.\"\r\n    National Geographic.   9 August 2018.", "Stewart, Phil.   \"Going Where No President Has Gone Before, Trump Wants Space Force by 2020.\"\r\n    Reuters.   9 August 2018.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]