["A video has been viewed tens of thousands of times in Facebook posts that claim that it shows “the situation for Muslim women in India right now”. The claim is false; the video -- which has been previously debunked by AFP Fact Check -- actually shows students throwing water over each other at an initiation event at a university in Sri Lanka.", "The video was posted to Facebook here on August 7, 2019, where it has been viewed more than 22,000 times.", "The posts have a caption saying: \n\t“The situation of Muslims women in india right now .\n\tWhere is Muslim Ummah, where is Peacekeepers. \n\tOur sisters are put to disgrace mercilessly, they hurting thier faith .\n\t#PrayForKashmir \n\t#KashmirBleedsUNsleeps \n\t#HumanRightsWatch”", "Below is a screenshot of the post:", "The video was also posted on August 7, 2019, on Facebook here, where it has been viewed 19,000 times, alongside an identical claim.", "The video has also been shared in other Facebook posts, for example here and here, which claim it was filmed in Kashmir and depicts the harassment of Muslim women by Indians. The captions in both posts say: “This is how Muslims girls are been treated in Kashmir by Hindus.”", "AFP previously debunked this exact same footage on March 15, 2019, after it was published and viewed extensively alongside false claims that it showed members of a Hindu nationalist group in India torturing Muslim women.", "The footage was actually taken at a university initiation event in eastern Sri Lanka.", "A Facebook page called Lanka Sun News shared the same video here on February 24, 2019, accompanied by claims it showed a “ragging” or initiation incident at the Eastern University in Vantharumoolai, in eastern Sri Lanka.", "The Tamil-language text in the caption accompanying the video states: “Please watch this, and share this... Sri Lankan Eastern”.", "Tamil language is spoken in the southern Indian state of Tamil Nadu and in Sri Lanka.", "A journalist from AFP’s Colombo bureau analysed the footage and found that the people in the misleading clip can be heard speaking Sri Lankan Tamil language.", "At one point in the video, a person can be heard asking their friends to splash water at them, saying: “Fetch it and splash it.”", "The video also received coverage from Puthithu, a news website run by Sri Lankan Tamils living abroad, in a report published on February 24, 2019.", "The news site said it had confirmed with Eastern University students that the video was filmed on their campus.", "Translated from Tamil, the Puthithu report’s headline reads: “Condemnation of attacks against eastern uni female students.”", "A translated version of the article reads in part: “A video of a large number of female students being chased by some male students and dousing them with water has gone viral on Facebook. The senior students of the university have behaved this way towards the freshman students, said those who wrote about the video. Puthithu has confirmed with students of the Eastern University that the incident took place at the university.”", "Below is a translated screenshot of the Puthithu report:", "AFP analysed the location of the video and cross-referenced it with images from the Eastern University in Vantharumoolai.", "A video on the official YouTube channel for the Eastern University in Sri Lanka shows a road lined with trees at 0:39.", "The scene also shows burqa-clad women walking along the road. The road and surrounding trees on the campus correspond with the terrain seen in the misleading video shared on Facebook and Twitter.", "Below is a screenshot from the official university video (L) next to a screenshot from the misleading video (R):", "These scenes also correspond with a street level photo on Mapillary tagged to a location on the Eastern University campus.", "Here is a screenshot from Mapillary of the university campus:", "Here is the location on Mapillary.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]