["The report was published online here. The text, written in both English and Filipino, translates in part as: \"FAKE CIGARETTE that is spreading corona virus has reached the Philippines. / The Bureau of Customs has raided three warehouses in Meycauayan City, Bulacan. To stop the proliferation of locally made fake cigarettes and smuggled fake cigarettes in the Philippine market\".", "Meycauayan is a city located just north of Manila, the Philippine capital.", "The report adds that the “full story” about the cigarettes spreading coronavirus can be viewed in the embedded video. The video, which purports to be a broadcast from ABS-CBN News, plays for about three seconds before prompting viewers to share the report on social media to continue watching.", "Below is a screenshot of the misleading report:", "The same link was published on Facebook here on March 9, 2020.", "Below is a screenshot of the misleading post:", "The same report was also shared on Facebook here and here. A similar claim was shared alongside stills from the video on YouTube here.", "The claim is false; the video clip is being shared in a misleading context.", "Keyword searches on seizure operations conducted in Meycauayan City found that the footage was originally published on May 31, 2018 on the Facebook account for the Philippines Bureau of Customs.", "The three-second clip embedded in the misleading report corresponds to the four-second to seven-second mark in the agency’s Facebook live video.", "Below is a screenshot comparison of the video in the misleading page (L) and the customs bureau video (R):", "The customs bureau operation was also reported on May 31, 2018 by several Philippine media outfits, including GMA News here and the state-run Philippine News Agency here.", "The coronavirus first emerged more than a year later in late December 2019 in the Chinese City of Wuhan. The virus has since infected more than 110,000 people and killed at least 4,000 people worldwide, AFP reported here on March 10, 2020.", "The Philippines has 33 confirmed COVID-19 cases as of 4pm on March 10, the Department of Health reported.", "The website which published the misleading report is not a reputable news site. The report lacks a byline, basic information about its publishers, and uses a URL that appears to mimic the news organization CNN.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]