["By Eugene Kiely and Lori Robertson", "Posted on April 24, 2019", "Special counsel Robert Mueller’s report concluded that “[t]he Russian government interfered in the 2016 presidential election in sweeping and systematic fashion” — contrary to Jared Kushner’s claim that Russia’s effort amounted to little more than “a couple Facebook ads.”", "The report details how the Russians “carried out a social media campaign that favored presidential candidate Donald J. Trump and disparaged presidential candidate Hillary Clinton,” and “conducted computer-intrusion operations against entities, employees, and volunteers working on the Clinton Campaign and then released stolen documents” to damage the Democratic presidential nominee’s campaign.", "It also lays out how eager the Trump campaign was to use the stolen material to its political advantage, even after the Department of Homeland Security and the Office of the Director of National Intelligence issued a joint public statement on Oct. 7, 2016, “that the Russian Government directed the recent compromises of e-mails from US persons and institutions, including from US political organizations.”", "Although investigators “did not establish” the Trump campaign “conspired or coordinated” with Russia’s “election interference activities,” Mueller’s report said “the [Trump] Campaign expected it would benefit electorally from information stolen and released through Russian efforts.”", "Kushner, the president’s son-in-law and adviser, made his comments during an interview at the Time100 Summit (starting at the 3:57 mark). He said the “investigations and all of the speculation” over the past two years “has had a much harsher impact on our democracy than a couple Facebook ads.”", "Kushner, April 23: And quite frankly, the whole thing is just a big distraction for the country. You look at what Russia did, you know, buying some Facebook ads to try to sow dissent and do it, it’s a terrible thing. But I think the investigations and all of the speculation that’s happened for the last two years has had a much harsher impact on our democracy than a couple Facebook ads. I think they said [Russians] spent about $160,000. I spent $160,000 on Facebook every three hours during the campaign. Now if you look at the magnitude of what they did and what they accomplished, I think the ensuing investigations have been way more harmful to our country.", "Kushner downplays the extensive social media influence campaign the Russians waged to help elect his father-in-law and ignores entirely the Russian cyberattack on Clinton and her supporters that was designed to undermine Clinton’s campaign.", "Here we recap what the Mueller report said about Russia’s election interference efforts.", "The FBI’s counterintelligence investigation of Russia began in late July 2016 — a few days after WikiLeaks began releasing emails that had been stolen from the Democratic National Committee. The investigation was sparked by a tip it received from a foreign government official who learned from George Papadopoulos, a Trump foreign policy adviser, “that the Trump Campaign had received indications from the Russian government that it could assist the Campaign through the anonymous release of information that would be damaging to Hillary Clinton,” according to the Mueller report.", "The federal investigation uncovered a sophisticated hacking operation by two units of the Main Intelligence Directorate, or GRU, which is responsible for intelligence collection for the Russian military. One unit was responsible for developing a “specialized” malware, while the other unit “conducted large-scale spearphishing campaigns,” according to the Mueller report.", "The targets, of course, were the DNC, the Democratic Congressional Campaign Committee and Clinton’s presidential campaign committee.", "The scope of the hacking operation: Beginning in March 2016, the GRU “hacked the computers and email accounts of organizations, employees, and volunteers supporting the Clinton Campaign, including the email account of campaign chairman John Podesta,” the report said. The GRU gained access to 29 DCCC computers and more than 30 computers on the DNC network, including the DNC email server and shared file server.", "“In total, the GRU stole hundreds of thousands of documents from the compromised email accounts and networks,” the report says.", "The groups behind the release of the stolen documents: The GRU publicly released emails and documents stolen from the Democrats “through two fictitious online personas that it created — DCLeaks and Guccifer 2.0 — and later through the organization WikiLeaks,” the report said.", "The Washington Post reported on June 14, 2016, that hackers had gained access to DNC servers — the first public disclosure of a cyberattack on a U.S. political committee.", "A day later, Guccifer 2.0 — a “[f]ictitious online persona operated by the GRU” — took credit in a blog post for hacking the DNC computers and released a few documents, including the Democratic Party’s 200-page opposition research report on Donald Trump. Guccifer falsely attributed the DNC hack “to a lone Romanian hacker.”", "“The main part of the papers, thousands of files and mails, I gave to Wikileaks. They will publish them soon,” Guccifer 2.0 says in its blog post.", "Julian Assange, the founder of WikiLeaks, opposed Clinton’s candidacy. The Mueller report said that Assange, in November 2015, “wrote to other members and associates of WikiLeaks that ‘[w]e believe it would be much better for GOP to win … Dems+Media+liberals woudl [sic] then form a block to reign in their worst qualities. . . . With Hillary in charge, GOP will be pushing for her worst qualities., dems+media+neoliberals will be mute . … She’s a bright, well connected, sadisitic sociopath.'”", "The timing of the public release of the stolen documents: According to the Mueller report, “The release of the documents was designed and timed to interfere with the 2016 U.S. presidential election and undermine the Clinton Campaign.”", "About five weeks after Guccifer 2.0 took credit for hacking DNC servers, WikiLeaks released more than 20,000 stolen DNC emails and other documents. (It would eventually release more than 44,000 DNC emails and 17,000 attachments, WikiLeaks says on its website.) The first drop came on July 22, 2016 — three days before the Democratic National Convention in Philadelphia.", "The timing proved damaging to party unity, and Clinton’s attempts to use the convention to woo supporters of her top rival, Sen. Bernie Sanders. The released documents embarrassed party officials who were seen as working behind the scenes at the DNC to undermine Sanders’ campaign, and forced the DNC chairwoman, Debbie Wasserman-Schultz, to resign on the eve of the convention.", "The timing was no coincidence.", "The Mueller report said WikiLeaks sent a direct message on Twitter to Guccifer 2.0 on July 6, 2016, seeking information that would disrupt the DNC convention and Clinton’s attempts at unity. “[I]f you have anything hillary related we want it in the next tweo [sic] days prefab le [sic] because the DNC is approaching and she will solidify bernie supporters behind her after,” WikiLeaks wrote to Guccifer 2.0.", "“[W]e think trump has only a 25% chance of winning against hillary … so conflict between bernie and hillary is interesting,” WikiLeaks wrote.", "On Oct. 7, 2016, WikiLeaks began releasing emails “the first set of emails stolen by the GRU from the account of Clinton Campaign chairman John Podesta.” Those emails were released “less than an hour” after the Washington Post published a 2005 video that caught Trump on a hot mic during a filming of “Access Hollywood” bragging about grabbing and kissing women because “when you’re a star, they let you do it.”", "Trump campaign’s use of stolen documents: In downplaying Russia’s interference in the election, Kushner ignored the campaign’s interest in the stolen documents and Trump’s extensive use of them to his advantage.", "“The Trump Campaign showed interest in WikiLeaks’s releases of hacked materials throughout the summer and fall of 2016,” the Mueller report said.", "After DNC emails were released in July, Trump tweeted, “The Wikileaks e-mail release today was so bad to Sanders that it will make it impossible for him to support her, unless he is a fraud!” At the same time, Paul Manafort, Trump’s campaign manager, told Gates that he “wanted to be kept apprised of any developments with WikiLeaks,” according to the Mueller report.", "“According to [Deputy Campaign Chairman Rick] Gates, by the late summer of 2016, the Trump Campaign was planning a press strategy, a communications campaign, and messaging based on the possible release of Clinton emails by WikiLeaks,” the report said.", "The report also said that Trump and “other Campaign advisors privately sought information [redacted] about any further planned WikiLeaks releases.”", "Donald Trump Jr., exchanged direct messages on Twitter with WikiLeaks, expressing interest in any new document dumps. On Oct. 3, 2016, Trump Jr. asked WikiLeaks: “What’s behind this Wednesday leak I keep reading about?” WikiLeaks did not respond, at least not on Twitter. Four days later, WikiLeaks released Podesta’s emails.", "After the first set of Podesta’s emails was released, Trump took to Twitter on numerous occasions to draw attention to the stolen documents and away from the “Access Hollywood“ video. Here are some of his tweets, which also came days after the U.S. intelligence community identified Russia as the source of the hacked emails:", "Oct. 11, 2016: “I hope people are looking at the disgraceful behavior of Hillary Clinton as exposed by WikiLeaks. She is unfit to run.”", "Oct. 12, 2016: “Very little pick-up by the dishonest media of incredible information provided by WikiLeaks. So dishonest! Rigged system!”", "Oct. 16, 2016: “We’ve all wondered how Hillary avoided prosecution for her email scheme. Wikileaks may have found the answer. Obama!”", "In the closing weeks of the campaign, WikiLeaks became a big part of Trump’s closing argument against Clinton.", "On Oct. 21, 2016, Manafort — who had left the campaign at this point — “sent Kushner an email and attached a strategy memorandum proposing that the Campaign make the case against Clinton ‘as the failed and corrupt champion of the establishment’ and that ‘Wikileaks provides the Trump campaign the ability to make the case in a very credible way — by using the words of Clinton, its campaign officials and DNC members,'” according to the Mueller report.", "Trump often read from the stolen emails and other documents at his campaign rallies.", "In many cases, Trump distorted the facts to fit his campaign message that Clinton supports “open borders,” would harm Medicare and Social Security, was soft on terrorism, and was too cozy with big banks. (Read our item “Trump Twists Facts on WikiLeaks” for more information on how Trump distorted the facts on those and other topics.)", "“In sum, the investigation established that the GRU hacked into email accounts of persons affiliated with the Clinton Campaign, as well as the computers of the DNC and DCCC. The GRU then exfiltrated data related to the 2016 election from these accounts and computers, and disseminated that data through fictitious online personas (DCLeaks and Guccifer 2.0) and later through WikiLeaks,” the Mueller report said. “The investigation also established that the Trump Campaign displayed interest in the WikiLeaks releases.”", "Russia’s Internet Research Agency, an online propaganda operation, began social media operations in the United States as early as 2014, creating social media accounts using fictitious personas.", "In the 2016 campaign, “Some IRA employees, posing as U.S. persons and without revealing their Russian association, communicated electronically with individuals associated with the Trump Campaign and with other political activists to seek to coordinate political activities, including the staging of political rallies,” the report said. “By the end of the 2016 U.S. election, the IRA had the ability to reach millions of U.S. persons through their social media accounts.”", "The figures cited on the reach and amount of these social media accounts are significantly greater than “a couple Facebook ads,” as Kushner said.", "Mueller report: Multiple IRA-controlled Facebook groups and Instagram accounts had hundreds of thousands of U.S. participants. IRA-controlled Twitter accounts separately had tens of thousands of followers, including multiple U.S. political figures who retweeted IRA-created content. In November 2017, a Facebook representative testified that Facebook had identified 470 IRA-controlled Facebook accounts that collectively made 80,000 posts between January 2015 and August 2017. Facebook estimated the IRA reached as many as 126 million persons through its Facebook accounts. In January 2018, Twitter announced that it had identified 3,814 IRA-controlled Twitter accounts and notified approximately 1.4 million people Twitter believed may have been in contact with an IRA-controlled account.", "Much of the material in the report on the structure of the IRA and its social media operations is redacted, due to “harm to ongoing matter.” In February 2018, the special counsel indicted 13 Russian nationals and three Russian entities, including the IRA. The group was funded by Yevgeniy Viktorovich Prigozhin, who was sanctioned by the U.S. in December 2016 and has reported ties to Russian President Vladimir Putin, and companies he controlled.", "According to the indictment, the IRA’s monthly budget was more than $1.25 million (U.S. dollars) by September 2016.", "The U.S. social media operation was known as the “Translator” internally at the IRA, the Mueller report said. It included the creation of social media pages falsely claiming to be associated with U.S. political groups or mimicking them. For instance, the IRA Twitter account @TEN_ GOP suggested it was affiliated with the Tennessee Republican Party. “More commonly,” the Mueller report said, “the IRA created accounts in the names of fictitious U.S. organizations and grassroots groups and used these accounts to pose as anti-immigration groups, Tea Party activists, Black Lives Matter protestors, and other U.S. social and political activists.”", "The operation was aimed at supporting Trump’s candidacy and opposing Clinton. One of the directions to IRA operators included: “Main idea: Use any opportunity to criticize Hillary [Clinton] and the rest (except Sanders and Trump – we support them).”", "As for Facebook ads, the IRA bought more than 3,500 of them, not just “a couple,” spending about $100,000, the special counsel’s report said, attributing those figures to Facebook.", "The special counsel said the IRA bought its first known ad backing Trump’s campaign on April 19, 2016 — an ad for an Instagram account called “Tea Party News” encouraging people to help “‘make a patriotic team of young Trump supporters’ by uploading photos with the hashtag ‘#KIDS4TRUMP.'” The IRA bought dozens of ads supporting the Trump campaign in the months that followed, “predominantly through the Facebook groups ‘Being Patriotic,’ ‘Stop All Invaders,’ and ‘Secured Borders.'” Other bogus Facebook groups created by the IRA included: “Black Matters,” “LGBT United” and “United Muslims of America.” These accounts “attracted hundreds of thousands of followers.”", "On Twitter, the IRA created fake accounts and also automated bot accounts to spread its content. One IRA account — @march_for_trump — promoted rallies in support of the campaign. The IRA would organize rallies by direct messaging followers, asking them to attend, and finding a real U.S. person to agree to serve as the coordinator of the event. The special counsel’s office identified “dozens” of such rallies, the first of which was a “confederate rally” in November 2015. Some rallies attracted just a few people, but others attracted hundreds. The Trump campaign actually posted on its Facebook page about an IRA-organized rally in Miami in August 2016.", "One poster for IRA-organized rallies in Pittsburgh and Philadelphia used an image of a now-deceased West Virginia coal miner with the words, “Miners For Trump, Bring Back Our Jobs.”", "The bogus social media accounts were realistic enough to fool some U.S. media outlets, which quoted tweets they thought were from real U.S. people, and well-known figures who retweeted or responded to these accounts, including former Ambassador Michael McFaul, Fox News’ Sean Hannity, Trump informal adviser Roger Stone and Michael Flynn Jr., son of the campaign’s foreign policy adviser and later national security adviser in the administration.", "The IRA also had interactions with the Trump campaign. On “multiple occasions, members and surrogates of the Trump Campaign promoted–typically by linking, retweeting, or similar methods of reposting–pro-Trump or anti-Clinton content published by the IRA through IRA-controlled social media accounts,” the report said. For instance, posts from that @TEN_GOP Twitter account were cited or retweeted by Donald J. Trump Jr., Eric Trump, Kellyanne Conway, Brad Parscale and Michael T. Flynn.", "Also, there were “a few instances” in which IRA employees asked members of the campaign for help with rallies the IRA had organized. The Mueller report concluded: “While certain campaign volunteers agreed to provide the requested support (for example, agreeing to set aside a number of signs), the investigation has not identified evidence that any Trump Campaign official understood the requests were coming from foreign nationals.”", "Kushner equates the Russian interference effort to “a couple Facebook ads” and $160,000. But as the Mueller report makes clear, it was a sophisticated, yearslong hacking and social media effort to influence an election.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]