["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Rep. Ted Deutch, D-Fla., claimed mass shootings increased substantially after an assault weapons ban expired in 2004.", "The Democratic lawmaker represents the Parkland, Fla., community, where on Valentine’s Day a 19-year-old man killed 17 people at Marjory Stoneman Douglas High School. Authorities say the gunman who’s been charged with 17 counts of premeditated murder used an AR-15 rifle.", "\"Let's be clear, mass shootings went up 200 percent in the decade after the assault weapons ban expired,\" Deutch said during a Feb. 21 CNN town hall with survivors of the mass shooting.", "We’ve fact-checked several claims about gun control since the shooting and wondered if this one was true.", "At least one researcher found a significant increase in mass shootings since the assault weapons ban expired. But overall, experts caution against pegging an increase solely to the ban’s expiration, and told us Deutch’s claim is based on a flawed analysis.", "A federal law from 1994 to 2004 banned the manufacture of 19 military-style assault weapons, assault weapons with specific combat features, \"copy-cat\" models, and certain high-capacity ammunition magazines of more than 10 rounds. Congress did not renew the ban once it expired in September 2004.", "What happened next?", "Advocates on both sides of the gun debate often point to the same report assessing the ban published in 2004 for the U.S. Justice Department.", "One key takeaway: The report said it was premature to make a definitive conclusion about the ban’s impact. It said there had been mixed results in reducing criminal use of the banned guns and magazines.", "If the ban were to be renewed, it might reduce the number of gunshot victims, but the effect would likely be \"small at best and possibly too small for reliable measurement,\" the report said.", "If the ban lapsed, the report said, it would be possible for new assault weapons to be used in mass murders.", "Former President Bill Clinton made a similar point as Deutch in 2013 when he said, \"Half of all mass killings in the United States have occurred since the assault weapons ban expired in 2005, half of all of them in the history of the country.\" The Washington Post Fact Checker awarded the claim Three Pinocchios.", "The fact-check found that Clinton was exaggerating research from Grant Duwe, director of research and evaluation at the Minnesota Department of Corrections.", "Why is that relevant? Deutch’s office cited commentary posted on The Century Foundation, a left-leaning think tank, as support for his statement about a 200 percent increase in mass shootings. The commentary criticizes the Fact Checker article for missing the big picture behind Clinton’s point.", "Part of the Century Foundation commentary said:", "\"If we look from September 2004 all the way back to 1900 (104 years), as the Washington Post lays out, there were 118 mass shootings. That breaks down to 1.13 mass shooting incidents per year, on average, from 1900 to 2004. In the eight years since the assault weapons ban has expired, there have been 28 mass shooting events. That equals an average of 3.5 a year — an increase of over 200 percent.\"", "But several experts, including Duwe, pointed out flaws in that examination and consequently, in Deutch’s relay of that information.", "\"This claim is, at best, very misleading for a few reasons,\" Duwe told PolitiFact Florida in an interview.", "For starters, to arrive at a 200 percent increase, the claim actually has to go back to 1900, and not the decade after the ban’s expiration that Deutch cited.", "\"The assault weapons ban was only in effect from 1994 to 2004, and that is the relevant period to compare with the period after 2004 if one is making a claim about the impact of the assault weapons ban,\" said Gary Kleck, David J. Bordua emeritus professor of criminology and criminal justice at Florida State University.", "It’s also important to factor in population size changes, experts said.", "In an October piece for Politico, Duwe noted that \"since the mid 2000s, the incidence of mass public shootings on a per capita basis has been a bit higher than it was in the preceding 10 years.\"", "But the rates over the past 10 years were not higher than in the late 1980s and early 1990s, Duwe said.", "\"If you have more shootings after the ban but also have a larger population, then when the numerator and denominator are increasing, the outcome number stays the same,\" said Jaclyn Schildkraut, an expert on mass shootings research and an assistant professor of public justice at the State University of New York at Oswego.", "Nonetheless, mass public shootings have become deadlier over the last decade, as the number of victims shot and killed has increased since the expiration of the assault weapons ban, Duwe said.", "It’s also worth noting that there isn’t an universally accepted definition for mass shootings.", "Deutch’s office said their definition for mass shooting involved an individual with a firearm who targets four or more victims with intent to kill, not including the perpetrator.", "Duwe defined mass public shooting more narrowly as any incident in which four or more victims are killed with a gun within a 24-hour period at a public location in the absence of other criminal activity (robberies, drug deals, gang \"turf wars\"), military conflict or collective violence.", "Louis Klarevas, who teaches at the University of Massachusetts-Boston and has also written about mass shootings, told us his research generally supports Deutch's claim.", "Klarevas examined incidents before, during and after the assault weapons ban when six or more people were shot and killed.", "• 1984 to 1994: 19 incidents", "• 1994 to 2004 (ban is in effect): 12 incidents", "• 2004 to 2014: 34 incidents", "That shows a 183 percent increase of incidents in the decade after the ban, compared to the years during the ban.", "However, several experts also cautioned against concluding that an increase in mass shootings would be solely tied to the expiration of the assault weapons ban.", "A critical question in the assessment of the assault weapons ban would be how often assault weapons, however defined, were used in mass shootings, said Gregory Koger, a professor of political science at the University of Miami.", "\"I do not expect the effect of a ban to be instantaneous, nor to end when the ban ends,\" Koger said. \"If there are a certain number of assault weapons in circulation when the ban goes into effect and these weapons are removed from circulation over time (say, if they are destroyed, become ineffective, or are seized by the police), then the effect of a sales ban increases over time.\"", "If gun manufacturers find a way around the ban, its effects decrease over time, Koger said, adding that once a ban is lifted, \"its effects may linger to the extent that it decreased the supply of assault weapons in circulation.\"", "Among other factors also worth considering is media coverage of mass shooters, which Adam Lankford, a criminology professor at the University of Alabama, said rewards perpetrators with fame and can lead to copycat effects.", "\"Although firearms availability is the primary reason why the United States has more public mass shooters than other countries, media coverage of perpetrators may largely explain why the United States has seen more public mass shooters and deadlier incidents over time,\" Lankford said.", "Deutch said, \"Mass shootings went up 200 percent in the decade after the assault weapons ban expired.\"", "Researchers of mass shootings told us the analysis Deutch relied on is flawed because it did not adjust for population changes and used irrelevant data points for comparison.", "Trends in the incidence and severity of mass public shootings on a per capita basis also show that the rate per 100 million is similar now to that of the 1980s and early 1990s, an expert told us.", "A separate analysis found an 183 percent increase in mass shootings where six or more people were killed in the decade after the ban, compared with the 10-year ban period. But experts caution against inferring that an increase is due only to the ban’s expiration.", "Deutch’s claim contains an element of truth but ignores critical facts that would give a different impression. We rate it Mostly False.", "CNN, Transcript: Stoneman students' questions to lawmakers and the NRA at the CNN town hall, updated Feb. 22, 2018", "Email interview, Rep. Ted Deutch’s press secretary Jason Attermann, Feb. 22, 2018", "Report to the National Institute of Justice, United States Department of Justice, An Updated Assessment of the Federal Assault Weapons Ban: Impacts on Gun Markets and Gun Violence, 1994-2003, June 2004", "The Century Foundation, The Assault Weapons Ban: Did It Curtail Mass Shootings?, Jan. 11, 2013", "Washington Post, Fact Checker column on former president Bill Clinton claim about assaul weapons ban, 2013", "Politico Magazine, Mass Shootings Are Getting Deadlier, Not More Frequent, Oct. 4, 2017", "Washington Post, It’s time to bring back the assault weapons ban, gun violence experts say, Feb. 15, 2018, The real reason Congress banned assault weapons in 1994 — and why it worked, Feb. 22, 2018", "Violent Crime Control and Law Enforcement Act of 1994, U.S. Department of Justice Fact Sheet", "Phone interview, Jaclyn Schildkraut, an expert on mass shootings research and an assistant professor of public justice at the State University of New York at Oswego, Feb. 22, 2018", "Email interview, Gary Kleck, David J. Bordua emeritus professor of criminology and criminal justice at Florida State University, Feb. 22, 2018", "Email interview, Grant Duwe, director of research and evaluation at the Minnesota Department of Corrections, Feb. 22, 2018", "Email interview, Adam Lankford, a criminology professor at the University of Alabama, Feb. 22, 2018", "Email interview, Gregory Koger, a professor of political science at the University of Miami, Feb. 22, 2018", "Email interview, Louis Klarevas, University of Massachusetts—Boston, Feb. 22, 2018", "PolitiFact, Fact-checking a misleading post on ID requirements for buying guns, voting, Feb. 22, 2018", "PolitiFact, Florida Gov. Rick Scott made it illegal for doctors to talk to patients about guns, TV ad says, Feb. 22, 2018", "PolitiFact, What we know about mass shootings, Feb. 14, 2018", "PolitiFact Wisconsin, Mostly False: 18 U.S. school shootings so far in 2018 and 18 in rest of the world over past 20 years, Feb. 15, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]