["Multiple Facebook posts, including this post published on March 13, 2019. It has been shared more than 200 times. It shows a series of photos of meats, dead pig, and a man and woman in hospital, alongside a text image that claims infected pork from Vietnam has arrived in Malaysia.", "The post’s caption states: “The Vietnamese pork virus has arrived in Johor Bahru, Malaysia. Don't eat barbecue pork and buy raw pork. Remember, remember to pay more attention to the virus pork and the imported Malaysian A8 brand suckling pig and C1 brand suckling pig! !\"", "Below is a screenshot of the misleading post:", "The same photos were shared in this Facebook post with a similar claim.", "The same images were posted here on Facebook on June 13, 2019, alongside a similar claim, but the photos were subsequently deleted from the post.", "The claim is false; Malaysia halted pork imports from Vietnam in January 2019.", "Malaysian authorities have said here that Malaysia has not imported any live pig or pork products from Vietnam since January 23, 2019.", "Translated to English, the Department of the Veterinary Services’ notice reads: “The Department of Veterinary Services. Following the outbreak of the African Swine Fever, the Department of Veterinary Services have made restrictions for the importation of live pigs and pig products (including canned products) from a few countries.”", "It also lists details of the restrictions:", "Below is a screenshot of the document:", "The images in the misleading posts also do not show infected pork in Malaysia in 2019.", "The first picture of the two men looking over and taking pictures of the dead pig was previously shared in this October 1, 2015 , Vietnamese-language media report from Thai Nguyen Online. The headline states: “Authorities caught restaurant using sick pigs to roast for sale\". The report refers to an investigation in the northeastern Vietnamese province of Thái Nguyên.", "Below is a screenshot of the article:", "A reverse image search on Google for the photo of raw, infected meat, shown below, found the image appeared as a stock image in this blog post dated June 27, 2013, about flatworms.", "Another reverse image search of the close-up image of cooked meat, shown below, found it used as a stock image in this article published on March 9, 2019, on a Vietnamese website about pork tapeworm infections.", "The misleading posts also contain separate images of a man and a woman in a hospital setting.", "A reverse image search on Google found that the photos have circulated in Vietnamese-language social media since at least 2018. This January 9, 2018, post on Facebook shared the photos of the man and the woman.", "The first two sentences of the lengthy Vietnamese-language caption reads: “Urgent, we need to share this post urgently. There are two people infected in Ha Giang area.”", "The post says that the two people fell sick after eating pig blood at a house-warming ceremony on Tuesday, January 2, 2018, and the man had been diagnosed with streptococcus infection.", "This YouTube video of Ha Giang TV, dated January 18, 2018, shows the same man on a hospital bed. It is titled: “Alert on the infection caused by pig streptococcus in Ha Giang on January 11, 2018.”", "Below is a screenshot of the video:", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]