["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Milwaukee Police Chief Edward Flynn answers media questions on after an 11-year-old girl was critically injured after being shot shortly before 7 p.m. May 21 Wednesday on a school playground. JS photo.", "Milwaukee County Sheriff David A. Clarke Jr. hasn’t declared himself a candidate for mayor or county executive, but he continues to expand his critique of Milwaukee Mayor Tom Barrett and County Executive Chris Abele.", "After at least 12 people were wounded and three died in shootings during the city’s \"Ceasefire Week,\" Clarke ripped Barrett as a do-nothing mayor in the face of stubbornly high poverty and joblessness, then labeled Abele a know-nothing on crime strategies.", "The sheriff, who stands for re-election later this year, added a statistical layer to his reaction to the shootings in a statement to reporters.", "\"This uptick in violence is not new. It has been going on since 2010. The only period of calm we get is when winter sets in,\" the statement said. \"The reason crime and violence rise in the summer is NOT due to the hot weather, leading to short tempers, like so many think. It rises in summer months because you have more human interaction due to more people being on the streets enjoying what little summer we have.\"", "There’s little doubt about summer being too short.", "But is \"violence\" up since 2010, with the only let up in the winter?", "To get at the question, we examined the trend in homicides, non-fatal shootings and the broader violent-crime index by the Federal Bureau of Investigation. That index  includes homicide, forcible rape, robbery and aggravated assault.", "Homicides", "After a sharp drop in 2008 and 2009, homicides were at their lowest count since the 1980s. Then they jumped in 2010 from 72 to 95.", "The figure fell in 2011, but rose in 2012 and 2013, when 105 were recorded. That put the total back to where it was in 2007, shortly before Chief Edward Flynn was sworn in as Milwaukee’s chief.", "Of the 31 total zip codes that make up the City of Milwaukee, the majority of homicides last year occurred in four, the Milwaukee Homicide Review Commission reported -- 53212 (14%), 53204 (14%), 53209 (13%) and 53206 (11%).", "Milwaukee saw a surge of of 33 homicides in just two months in 2013, August and September.", "Non-fatal shootings", "The trend is similar to homicides, but not identical. The number of people wounded by firearms dropped 35 percent between 2006, when it was 621, and 2010, when the figure was 400. But the total has risen three straight years starting in 2011, reaching 532 last year.", "As in homicides, it’s overwhelmingly the case that the victims are African-American men, according to the commission.", "Overall violent Crime", "Total violent crime has risen 21 percent since 2011 -- 1,300 more violent crimes were reported in 2013 compared to 2011. Most of that increase came in aggravated assaults.", "Milwaukee Police data shows that in every violent crime category the 2013 totals are higher than the 2010 totals.", "And for the most part, the upward trend has been consistent since 2010, though the uptick in overall violent crime began more recently, in 2012.", "\"We were as frustrated as the rest of the community was with the increase in violent crime in 2013 over 2012,\" Police Chief Edward Flynn told reporters in March 2014.", "In contrast, the much larger category of property crime has fallen six straight years, and total crime (violent and property added together) in five of six, according to the department.", "Seasonal variation", "The other part of Clarke’s claim was that crime and violence rises in the summer, with winter the \"calm\" period.", "Criminologists have debunked some other seasonal crime explanations, such as the full moon effect. So we wondered if the numbers back it up.", "Homicide Review Commission reports and data show a seasonal difference is real, though winter is far from \"calm.\"", "The ugly business of homicide certainly doesn’t close up shop in the colder months. In 2013, the months of December, January and February saw 20 of the year’s 105 homicides.", "But, the commission noted in 2014 that, \"Generally, in years past, the number of homicides increases during the summer months.\"", "Typically, about 30 percent of annual homicides occur in June, July and August, our analysis of commission data showed.", "In non-fatal shootings, in both 2012 and 2013 the number of incidents generally increased during the summer months of June through September, the commission reported.", "\"Specifically, in 2013, 262 nonfatal shootings occurred in June through September,\" the commission reported. In those four months, nonfatal shootings accounted for 49 percent of such incidents in all of 2013.", "Why?", "As Clarke said, it’s not just the abstract fact of sinking temperatures.", "Alcohol consumption and arguments are more common in the hotter months, noted Stephen Hargarten, director of the Injury Research Center at the Medical College of Wisconsin.", "\"We do know weather has an effect, both ways,\" Hargarten said. \"It has a limited effect but some effect.\"", "Our rating", "Clarke said Milwaukee has seen \"an uptick in violence\" since 2010, and \"the only period of calm we get is when winter sets in.\"", "Violent crime rates have roller-coastered in recent years, but Clarke’s observations about the trend since 2010 is on target. His observation about a winter \"calm\" period is a bit of a stretch, but it’s certainly calmer than the hot days of summer.", "We rate his claim Mostly True.", "Update: an earlier version of this item incorrectly stated that Sheriff Clarke faces re-election in November 2014. He would first have to clear an expected August 12 primary challenge to reach the November 4 general election.", "CBS 58 News, \"Sheriff David Clarke issues statement about gun violence in Milwaukee,\" May 19, 2014", "Milwaukee Homicide Review Commission, Published Articles and Data Reports", "Interview with Stephen Hargarten, Professor and Chair, Department of Emergency Medicine, and Director, Injury Research Center, Medical College of Wisconsin, May 21, 2014", "Research assistance, Pamela Koleas, Milwaukee Police Department staff, Homicide Review Commission, May 21, 2014", "Interview with Lt. Mark Stanmeyer, spokesman, Milwaukee Police Department, May 21, 2014", "Milwaukee Homicide Review Commission, \"2013 Data Report, Homicides and Non-fatal shootings,\" revised March 18, 2014", "Milwaukee Homicide Review Commission, \"2012 Data Report, Homicides and Non-fatal shootings,\" 2013", "Milwaukee Homicide Review Commission, \"2011 Data Report, Homicides and Non-fatal shootings,\" 2012", "Milwaukee Homicide Review Commission, \"2010 Data Report, Homicides and Non-fatal shootings,\" 2011", "Milwaukee Journal Sentinel, \"Mayor Barrett says Milwaukee tackling violence on \"every single front,’ \" May 19, 2014", "Milwaukee Journal Sentinel, \"2013 MIlwaukee data show violent crime up, overall crime down,\" March 20, 2014", "MIlwaukee Police Department, Office of Management Analysis and Planning, \"2007-2013 Crime in the City of Milwaukee,\" March 12, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]