["“Black woman embracing Apartheid legacy in art,” reads a Facebook post sharing the image of Madonsela and de Klerk. “From today onwards, i have lost all respect for Thuli Madonsela & strongly believe she is lost and needs serious help,” it continues. We’ve archived the post here.", "However, a reverse image search quickly indicates that the photo has been doctored -- it leads to the original version of the photo, as seen in a November 2017 article by Afrikaans newspaper Rapport. “Mystery: Who is the lady in orange, white and blue?” reads the headline.", "As reported in a previous debunk by AFP Fact Check, the Rapport article explains that the original photo was taken at a year-end event for members of the Advertising Media Association of Southern Africa (AMASA) on November 15, 2017.", "The theme of the party was “Nothing is taboo in media in 2017” and the dress-code, similarly, was “As Taboo As Possible”.", "AFP spoke to the man pictured in the original, Ruan Lottering, when we debunked an earlier version of the photo back in April. He explained that the woman’s outfit was a joke.", "\"I had a quick chat with her and I can promise you, she's not supportive of the old regime or the old flag or nothing like that and neither am I,\" said Lottering, whom we tracked down online via the Rapport article.", "\"She did it as a joke and I saw the joke about it and that's why we took the photo,\" he added.", "We’re still trying to track down the woman in the photo to hear her side of the story -- if you know her, you can get in touch here.", "Searching Facebook for photos including the search term “Madonsela de Klerk” led us to a post from February 1, 2016 published by the FW de Klerk Foundation’s official Facebook page. It shows de Klerk presenting Madonsela with an award for her public service.", "If the picture looks familiar to you, that’s because you’ve already seen these faces. Whoever doctored the “apartheid dress” image simply mirrored the awards photo and cut out the faces to fit them into the other one.", "South Africa adopted a new flag at the end of apartheid in 1994, and the earlier flag became synonymous with the apartheid regime. Today, it is often used by white supremacists both in South Africa and abroad.", "As reported by AFP on August 21, a Johannesburg court made a landmark ruling barring the unjustified display of the old flag, saying such gestures amounted to \"hate speech\" and \"harassment\".", "Judge Phineas Mojapelo said that any gratuitous display of the old flag was \"racist and discriminatory\".", "\"It demonstrates a clear intention to be hurtful, to be harmful and incite harm and it in fact promotes and propagates hatred against black people,” he said.", "De Klerk, the last president of the apartheid era, released Nelson Mandela in 1990 after 27 years in prison. South Africa had become a pariah regime, under economic sanctions and increasingly isolated on the world stage.", "The two politicians worked together to bring an end to the policy of racial segregation, with de Klerk serving as deputy when Mandela became president in 1994.", "De Klerk’s participation in the transition led to him being awarded a joint Nobel Peace Prize with Mandela in 1993.", "After stepping down as vice-president in 1996, de Klerk set up his foundation in 1999 to defend the constitution, with a focus on the rights of white minority Afrikaners and the Afrikaans-speaking “coloured” community.", "Madonsela served as South Africa’s public protector -- a role enshrined in the constitution which involves investigating potential wrongdoing in state affairs -- from 2009 to 2016.", "During her time in office, she often faced accusations that she protected “white monopoly capital” in her investigations into corruption allegations surrounding former president Jacob Zuma -- see this AFP report.", "She tweeted in 2017 that claims that she defended white interests were trying to deflect attention from the allegations of state capture -- systemic corruption -- against Zuma.", "If in doubt that #WMC Campaign seeks to deflect attention from #StateCapture, note how trolls promptly divert #StateCapture dialogue to #WMC", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]