["About this rating", "In March 2016, a rumor began circulating on social media claiming that Disneyworld was replacing the Twilight Zone-themed \"Tower of Terror\" ride with a Frozen-based Elsa's Ice Castle:", "IF DISNEY TAKES DOWN THE TOWER OF TERROR FOR ELSA'S CRUSTY ASS KNOCK OFF VERSION OF THE LION, THE WITCH, AND THE WARDROBE ICE CASTLE, IM OUT", "— mads (@maddy_mirabal) April 1, 2016", "The earliest version we could find on Twitter was dated early on 1 April 2016 (or late on 31 March 2016, depending on time zone). Few included supplementary links with the rumor, enabling it to traverse Twitter and Facebook as speculative buzz.  The popularity of Frozen and age of the Twilight Zone attraction lent the rumor some plausibility.", "While the rumor looked at first to be a possible April Fools' joke, that didn't appear to be the case upon further digging:", "The text on the above-reproduced blog post read:", "Tower of Terror to be Removed, Replaced With Elsa’s Ice Castle", "Disney announced earlier today that the once-beloved attraction will be demolished and replaced by Elsa’s Ice Castle, featured in the popular movie, Frozen.", "Disney CEO Bob Iger commented, “I just wanna be rad and hip with the times, coolio?”", "Demolition is expected to begin later this year. (x).", "Comments on that post were almost universally negative, as was commentary on Twitter and other social media platforms. But right next to the post in question was a prominent (if small) disclaimer that's difficult to miss when viewing the original in its entirety:", "Its text read:", "All news presented is fake. Parody account, not affiliated with the Walt Disney Company.", "The parody post claiming that \"Tower of Terror\" was to be replaced with \"Elsa's Ice Castle\" might have become suddenly popular because of actual events.  A different older attraction -- Epcot's Maelstrom -- was closed on 5 October 2014; in its place, the park built \"Frozen Ever After\" (a Frozen-themed ride) with a spring 2016 launch date.", "Smith, Thomas.   \"First Look: ‘Frozen Ever After’ At Epcot.\"\r\nDisney Parks Blog.   9 June 2015.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]