["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "People visit Rålambshovsparken Park in Stockholm, Sweden, on April 18, 2020. Sweden has reported a sharp spike in COVID-19 deaths, and authorities have advised the public to practice social distancing, but no widespread lockdown has been imposed. (AP)", "The rate of confirmed coronavirus cases is rising faster in Sweden than in Norway and Denmark, and Sweden has a higher death rate.", "Differences such as how much testing is being done from one country to another can make comparisons difficult.", "Attacked by the coronavirus, superpowers such as the United States retreated into lockdown, deeming it the smartest way to stop the spread of the disease.", "Sweden, which hasn’t been in a shooting war in two centuries, faced the enemy by arming its citizens mostly with guidelines, not stay-at-home orders.", "That strategy, according to a widely circulated Facebook post, has been as effective as the shutdown policy adopted by two of Sweden’s neighbors.", "\"Sweden has zero lockdown\" but \"is in no worse shape than Denmark or Norway, which are currently experiencing full lockdown,\" the post claims.", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "On key data points, each of which has limitations, Sweden is faring worse than Denmark and Norway.", "Sweden has a population of 10 million people, nearly nine out of 10 of whom live in urban areas. As we reported in a fact-check comparing Sweden with Italy, Spain and the United Kingdom, Sweden has imposed no lockdown and no quarantines, although gatherings of more than 50 people are banned. Elementary schools, bars, restaurants and businesses are still open, though with social distancing and other safety measures encouraged. What’s happening in Sweden seems like something closer to life as most Americans remember it before much of the country was shut down.", "The idea in Sweden is to essentially pursue herd immunity — let the virus spread as slowly as possible while sheltering the elderly and the vulnerable until much of the population becomes naturally immune, or a vaccine becomes available.", "In contrast, Denmark and Norway closed their restaurants and ski slopes and told all students to stay home. Norway required most people returning from abroad to enter a two-week quarantine and limited groups outdoors to no more than five people. Denmark closed its borders, sent public workers home with pay and encouraged all other employees to work from home.", "Here are some of the major metrics on how Sweden (which also borders Finland) compares with Denmark and Norway. We’re including the United States for informational value.", "The figures are from Our World in Data. That research organization is funded by philanthropists Bill and Melinda Gates and is led by Max Roser, who is director of the Oxford Martin Programme on Global Development at the University of Oxford.", "All data are as of April 19, the date of the Facebook post.", "Confirmed infection rate: Sweden rising faster", "Sweden has a higher confirmed infection rate than Denmark and Norway. The measure is the total number of confirmed COVID-19 cases per million people.", "United States: 2,220.79", "Sweden: 1,368.61", "Norway: 1,288.27", "Denmark: 1,250.3", "The differences among Sweden, Norway and Denmark are not significant, Jennifer Kates, director of global health and HIV policy at the Kaiser Family Foundation, told PolitiFact.", "But the total number of confirmed cases is increasing faster in Sweden than in Norway and Denmark — even though Sweden is doing less testing per 1,000 people than Norway and Denmark.", "Anders Tegnell, the epidemiologist who is credited with developing Sweden’s COVID-19 strategy, says infection rate is an unreliable measure of how a country is doing.", "\"The recorded infection rate depends hugely on the number of tests performed and what indications for testing that are used,\" Tegnell, the director of the Swedish Public Health Agency, told PolitiFact for a previous fact-check.", "Helen Jenkins, a Boston University professor of biostatistics, also told us she wouldn’t rely on that measure because of how much testing varies among countries.", "One way to compare COVID-19 deaths is the ratio of confirmed deaths to confirmed cases. Sweden’s is more than twice as high as Denmark’s and more than five times higher than Norway’s.", "Sweden: 10.93%", "United States: 5.29%", "Denmark: 4.78%", "Norway: 2.12%", "Even though this case fatality rate is commonly discussed, during an outbreak it is a poor measure of the true risk of death, Our World in Data says. That’s because the rate relies on the number of confirmed cases, and many cases are not confirmed. And it relies on the total number of deaths; and with COVID-19, some people who are sick will die soon but have not yet died.", "Another measure is COVID-19 deaths per million people. Again, Sweden’s is higher than Denmark’s and Norway’s.", "Sweden: 149.61", "United States: 117.55", "Denmark: 59.74", "Norway: 27.3", "This per-capita death rate \"is a better measure of the severity of the issue,\" Kates said. Per capita case rates may, or may not, include everyone who needs to be tested, but not everyone who gets infected will get sick or die, she said. And deaths reported are less dependent on testing capacity than cases.", "Tegnell has said Sweden’s death toll \"is not a failure for the overall strategy,\" but rather \"a failure to protect our elderly who live in care homes.\"", "Overall, Jenkins cautioned against drawing conclusions on comparing the three countries, given that the outbreak is still unfolding.", "\"This is not over yet; in fact, it’s just starting,\" she told PolitiFact. \"Hard to judge the full impact of lockdown or not right at the moment.\"", "Another expert, Paul Franks, a genetic-epidemiology professor at Lund University in Sweden, wrote on April 23 that studies indicate that \"we should soon expect infections and deaths in Stockholm,\" Sweden’s largest city, \"to drop substantially in the coming weeks.\"", "Peter Callerfelt, 43, who owns a recruiting consulting business in Stockholm, said he believes it’s too soon to judge Sweden’s policy. He appreciates that he and his wife can still commute to their offices, where they are almost completely isolated from co-workers, and that their daughter can still go to kindergarten.", "Callerfelt told PolitiFact that Sweden's policy is set by the country's health experts, not elected officials, and that citizens respond to the experts' recommendations. He wonders whether people in Norway and Denmark would comply with a second shutdown if their countries reopened and then the virus reappeared, whereas Sweden has more flexibility.", "\"If this is not enough, you can still have the ace left and say, OK, now we’re doing a total lockdown. In the other countries, they have nothing left to play,\" Callerfelt said.", "A Facebook post claims that amid the COVID-19 pandemic, Sweden has no lockdown and \"is in no worse shape than Denmark or Norway,\" which are in lockdown.", "It goes too far to say Sweden has no lockdown, in that gatherings of more than 50 people are prohibited.", "The claim has an element of truth in that Sweden has roughly the same number of confirmed cases per million people as Denmark and Norway. But it’s misleading to say that Sweden is doing no worse. The total number of confirmed cases is increasing at a faster rate in Sweden than in Norway and Denmark — even though Sweden is doing less testing per 1,000 people than Norway and Denmark. Moreover, Sweden has higher death rates.", "For a statement with some truth that ignores critical facts that would give a different impression, our rating is Mostly False.", "Facebook, post, April 19, 2020", "Email, Kaiser Family Foundation senior vice president and director of global health & HIV policy Jennifer Kates, April 27, 2020", "Email, Dr. David Hamer, expert on infectious diseases, global health and medicine professor at Boston University, April 25, 2020", "Email, Boston University professor of biostatistics Helen Jenkins, April 26, 2020", "PolitiFact, \"Fact-checking Sweden’s COVID-19 infection rate without shutdown,\" April 24, 2020", "Wall Street Journal, \"Inside Sweden’s Radically Different Approach to the Coronavirus,\" March 30, 2020", "Our World in Data, \"Total number of confirmed COVID-19 cases per million people,\" April 19, 2020", "Our World in Data, \"Total COVID-19 tests per 1,000 people,\" April 19, 2020", "Our World in Data, \"Total confirmed COVID-19 cases: how rapidly are they increasing?,\" April 19, 2020", "Our World in Data, \"Case fatality rate of the ongoing COVID-19 pandemic,\" April 19, 2020", "Our World in Data, \"Total confirmed COVID-19 deaths per million people,\" April 19, 2020", "The Conversation, \"Coronavirus: why the Nordics are our best bet for comparing strategies,\" April 3, 2020", "The Conversation, \"Coronavirus: are we underestimating how many people have had it? Sweden thinks so,\" April 23, 2020", "New York Times, \"In the Coronavirus Fight in Scandinavia, Sweden Stands Apart,\" March 28, 2020", "Our World in Data, \"What do we know about the risk of dying from COVID-19?,\" March 25, 2020", "New York Daily News, \"Sweden claims coronavirus success after keeping country open, says herd immunity imminent,\" April 19, 2020", "Kaiser Family Foundation, \"COVID-19 Coronavirus Tracker,\" accessed April 27, 2020", "Interview, Stockholm, Sweden, resident Peter Callerfelt, April 27, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]