["By Saranac Hale Spencer", "Posted on March 27, 2020", "A viral meme suggests that children hospitalized with COVID-19 in the U.S. and U.K. can’t be visited by a parent. Hospital policies have become generally more restrictive, but pediatric patients are still allowed visits by at least one parent.", "A meme circulating on social media implores people to stay home in order to reduce the spread of the novel coronavirus. The message it’s trying to send is right, but the alarmist claims it makes are wrong.", "The meme says: “[I]f your child gets this virus their going to hospital alone in a van with people they don’t know to a room they don’t know to be with people they don’t know You will be at home without them in their time of need Think about it Stay in.”", "It was shared on March 24 by a Facebook page called This is England and was then shared by several other British Facebook pages before it began to circulate on American accounts.", "We are focusing on one of the claims — the implication that there is a mandatory policy to separate parents from children who are hospitalized for COVID-19. That isn’t true in either country.", "Guidance from the Royal College of Pediatrics and Child Health in the U.K. says:", "Many hospitals in the U.K. have eliminated patient visitation, except for children, who are allowed to have a parent or “carer” visit.", "Guidance is similar in the U.S., with details varying from state to state and hospital to hospital.", "In New York, which currently has the most cases of COVID-19 in the country, the state Department of Health recommended that hospitals suspend visitation except in cases where the visitor is essential to the care of the patient. One major hospital system, NewYork-Presbyterian, has used that guidance to end visitation, with some exceptions, including for pediatric patients who may have one visitor.", "In the state of Washington, which had the first confirmed case in the U.S., the hospitals run by the University of Washington have suspended all regular patient visits. But patients under 18 are allowed to have visits from a parent or guardian.", "Similar policies are in effect in other areas, too, including the hospitals of the Ohio State University and the University of Kentucky.", "While the novel coronavirus can sicken people of any age, it is worth noting that those most at risk for becoming severely ill and requiring hospitalization are elderly people and those with underlying health conditions.", "Between Feb. 12 and March 16, no patients under 19 years old were admitted to an intensive care unit in the U.S. for treatment of COVID-19, according to the Centers for Disease Control and Prevention.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "World Health Organization. “Live from WHO Headquarters – coronavirus – COVID-19 daily press briefing 25 March 2020.” YouTube. 25 Mar 2020.", "Royal College of Pediatrics and Child Health. COVID-19 – guidance for paediatric services. Last modified 26 Mar 2020.", "New York State Department of Health. “Health Advisory: COVID-19 Guidance for Hospital Operators\nRegarding Visitation.” 18 Mar 2020.", "Centers for Disease Control and Prevention. “Severe Outcomes Among Patients with Coronavirus Disease 2019 (COVID-19) — United States, February 12–March 16, 2020.” 26 Mar 2020.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]