["An image of birds like peacocks and parrots eating grains from the ground is circulating on social media. It is being claimed that the image was shot at the Ooty-Coimbatore highway. The same image has been shared with the different captions identifying the location as Ooty-Coimbatore road, BHU campus, Pune, Chandigarh, and Kolhapur. One Facebook user Jeevan Amrit posted the image with the message, “Ooty-Coimbatore roads have been occupied by original owners. Love to see this scene. Now we are understanding what damage we did to nature till now.” The post has been shared more than 4,200 times so far.", "A website called Prokerala also published this photo with the claim that it was shot in the campus of Kolhapur’s Shivaji University during the nationwide lockdown.", "Alt News has received several requests on its official Android application to fact-check this image.", "Alt News performed a reverse image search of the image on the Russian search engine Yandex and found a tweet by handle @AyazBuriroPPP. The same image was posted by the handle on September 4, 2019. The user claimed the image to be from Sindh, Pakistan. Thus, it is clear that the image is at least one-year-old and not a recent one.", "However, it is uncertain that the image is from Pakistan. With a Google reverse image search, we found a fact-check report by NewsMeter. According to the report, an Instagram user named Vama Amav posted the image on June 29, 2019. The user identified the image to be from Chandigarh.", "However, a comparison of the image posted by the Instagram user and the viral image clearly shows that both are not the same. The sitting position of the peacocks in both images is different but the background of the location has many similarities. You can see the difference in both images in the comparison posted below.", "Upon finding that the location in both images looks the same, we contacted Vama Amav on Instagram. Vama informed that while she didn’t click the viral image, the location seen in the image is Chandigarh’s Chhatbir Zoo which she has visited.", "The September 2019 tweet makes it clear that the image was definitely not shot during the on-going nationwide lockdown. However, we couldn’t independently verify if the image is from Chandigarh or not. Earlier as well, an image of deers from Japan’s Nara Park was shared with the claim that they sat on the Ooty-Coimbatore highway after the lockdown was imposed in India.", "Donate Now", "Kinjal Parmar holds a Bachelor of Science in Microbiology. However, her keen interest in journalism, drove her to pursue journalism from the Indian Institute of Mass Communication. At Alt News since 2019, she focuses on authentication of information which includes visual verification, media misreports, examining mis/disinformation across social media. She is the lead video producer at Alt News and manages social media accounts for the organization.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "Amid the ongoing Israel-Palestine conflict, media outlet Times Now put out a report claiming that…", "A 45-second video clip is being shared widely on social media where a group of…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…"]