["About this rating", "In conjunction with the ongoing conspiracy theory holding that rings of \"Hollywood elites\" are engaged in the sex trafficking of minors to pedophiles, a meme started to circulate via social media purportedly documenting the case of a sex offender who won an appeal of his conviction by arguing that \"pedophiles are a persecuted minority\":", "This was yet another example of a meme that presented some truthful information but was nonetheless deliberately misleading through its failure to provide context for that information.", "As explained in the underlying news article referenced in the meme, the pictured man is Gary Wolchesky, who in 2016 was convicted of first-degree aggravated sexual assault and related child pornography charges and was sentenced to 46 years in prison. Wolchesky argued (unsuccessfully) during his trial that “pedophiles are a persecuted minority, and that the New Jersey Code of Criminal Justice wrongfully makes this conduct a crime.”", "It is true that in January 2020 Wolchesky received a favorable ruling from an appellate panel. However, he didn't \"win\" an appeal of his conviction, and that ruling had nothing to do with the court's reconsidering the merits of Wolchesky's already rejected argument at trial that pedophiles are victims of discrimination, as the meme falsely suggests. Rather, the appeal was granted on narrow grounds related to Wolchesky's constitutional right to a speedy trial — seven years elapsed between his 2009 arrest and the commencement of his trial in 2016, and a lower court was ordered to examine that issue:", "The legal victory was not based on what the court called the defendant’s “unusual” strategy of promoting pedophilia but on the constitutional right to a speedy trial.", "The now-31-year-old Gary Wolchesky was first arrested in 2009 but it took seven years before his trial started.", "In a 44-page decision released Jan. 28, a three-judge appellate panel said that part of this delay was the fault of Wolchesky, who insisted on representing himself. But part of the delay also was the result of the investigation and new charges that were later added on.", "The appellate decision said that seven years was a “substantial period of time, one that requires scrutiny.” The decision orders a lower court to examine in order determine whether any delays in the trial attributed to prosecutors were legitimate.", "The appellate decision dismissed Wolchesky’s other points of appeal concerning the fairness of the trial and the sentencing, arguing that any errors in evidence, comments by prosecutors or jury instruction were “minimal” considering that he “chose to place his sexual predisposition with respect to young boys before the jury as the foundation of his defense strategy.”", "“The child victims in this case presented compelling evidence of the harm defendant inflicted by befriending them, confusing them and ultimately inducing them to engage in perverse sexual acts,” the decision says.", "In short, no legal \"precedents\" related to pedophilia are being set by this case, for \"Hollywood\" or anyone else — just the continued application of the Sixth Amendment's guarantee that \"the accused shall enjoy the right to a speedy and public trial.\"", "Bichao, Sergio.   \"‘Pedophiles a Persecuted Minority’? NJ Predator’s Theory Rejected, Appeal Granted.\"\r\n    WKXW.   1 February 2020.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]