["The 23-second video was published here on Twitter on June 13. It has been viewed more than 20,000 times.", "The post's traditional Chinese-language caption translates to English as: “Breaking: Tanker truck explosion on highway in Daxi, Wenling, Zhejiang!”", "The video was shared alongside similar claims on Facebook here and here; on Twitter here and here; and on YouTube here and here.", "A tanker truck did explode on a highway in Wenling on June 13, killing at least 19 people and injuring over 170, as AFP reported here.", "However, the claim about the footage is false.", "Reverse image and keyword searches found that the video in fact shows an accident that occured in Italy in 2018.", "Similar footage was published on Twitter here on August 7, 2018, by Polizia di Stato, one of the national police forces of Italy. In the tweet, the police reported that the accident involved a vehicle that was \"transporting flammable substances.\"", "The footage in the misleading post corresponds to the Twitter video between the 11- and 34-second marks.", "#bologna #BorgoPanigale Le immagini della dinamica del grave incidente che ha coinvolto anche un mezzo che trasportava sostanze infiammabili. Indagini in corso #PoliziaStradale pic.twitter.com/aS8NKxTaoA", "Below are screenshot comparisons of the video in the misleading post (L) and the footage from Polizia di Stato (R):", "The accident was widely reported on by international and Italian media; for example here and here by Italian newspapers Corriere della Sera and La Provincia di Lecco.", "AFP also published the police video along with other footage from the blast here.", "The stretch of highway where the accident occured, which is just outside the northern Italian city of Bologna, can be seen here on Google Street View.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]