["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Democrats in Trenton scoffed when Gov. Chris Christie unveiled a proposal to cut income taxes by 10 percent, saying property taxes are more of a burden for New Jersey residents.\n\nAssembly Speaker Sheila Oliver (D-Essex) reiterated that point during a recent radio interview.\n\n\"In New Jersey our constituents want to see the Legislature and the governor focus on cutting the property taxes. The average New Jerseyan pays close to $8,000 a year and that is just average,\" Oliver told Steve Adubato Jr. on WOR-AM on April 19.\n\n\"The proposal to cut income taxes by 10 percent, if you took a family with an average income of $50,000 -- which, by the way, $57,000 is the mean in our state -- that would provide $80 over a three-year period in the pockets of a New Jersey family. That is not anything of significance. We say that won't buy a bag of groceries for a working-class family,\" Oliver said.\n\nWe previously checked a statement about potential savings from the governor’s income tax cut proposal. It’s true a couple with a taxable income of $50,000 would pay about $80 less in income taxes under Christie’s plan.\n\nBut is Oliver right that the average family in New Jersey lives on $57,000 a year?\n\nWe should note that economists generally prefer median income to mean income, since the mean income can be skewed by extremes, such as very high-income earners.\n\nRobert Bernstein, a spokesman for the U.S. Census Bureau, said since the mean can be distorted \"it's not a good reflection of the situation there. Median is better.\"\n\nThe median income is the amount in the middle when a series of numbers are ordered smallest to largest.\n\nBy either measure, Oliver is wrong.\n\nThe mean family income in New Jersey was $106,125 in 2010, according to the most recent data available from the American Community Survey, a yearly national assessment conducted by the U.S. Census Bureau. The median family income, according to the same survey, was $82,427.\n\nTom Hester Jr., a spokesman for the Assembly Democrats, told us Oliver meant to refer to the annual average wage in New Jersey, not the average family income.\n\nThere’s a significant difference between the two.\n\nThe annual average wage is calculated by determining the total amount of wages paid out in a year and dividing by all the workers covered by the state’s unemployment insurance system who got a paycheck.\n\nThe figure is \"based on workers employed at New Jersey companies, those workers may or may not be New Jersey residents,\" Brian Murray, a spokesman for the New Jersey Department of Labor and Workforce Development, said in an e-mail.\n\nAccording to a state labor department report released in 2011, the annual average wage in New Jersey was $56,385 in 2010.\n\nOur ruling\n\nOliver said, \"$57,000 is the mean [income] in our state\" for a family.\n\nThat’s not true. The mean family income in New Jersey in 2010 was $106,125 and the median income, a measure less influenced by very high-income earners, was $82,427.\n\nWe rate Oliver’s statement False.", "To comment on this story, go to NJ.com.", "WOR-AM, Interview with Assembly Speaker Sheila Oliver, April 19, 2012\n\nEmail interview with Tom Hester Jr., spokesman for New Jersey Assembly Democrats, April 19 & 23, 2012\n\nInterview with Robert Bernstein, spokesman for the U.S. Census Bureau, April 24, 2012\n\nNew Jersey Labor Market Views, Annual Average Wage in 2010 Rebounds From First Decline, Sept. 6, 2011\n\nU.S. Census Bureau, 2010 American Community Survey 1-Year Estimates: New Jersey, accessed April 19, 2012\n\nU.S. Census Bureau, 2010 American Community Survey 3-Year Estimates: New Jersey, accessed April 19, 2012\n\nU.S. Census Bureau, 2010 American Community Survey 5-Year Estimates: New Jersey, accessed April 19, 2012\n\nU.S. Census, Income: Frequently Asked Questions, accessed April 19, 2012\n\nU.S. Census Bureau, Current Population Survey definitions and explanations, accessed April 24, 2012\n\nNew Jersey Department of Labor and Workforce Development, Exclusions from Covered Employment, accessed April 23, 2012\n\nEmail interview with Brian Murray, spokesman for New Jersey Department of Labor and Workforce Development, April 23, 2012\n\nPolitiFact New Jersey, Lou Greenwald claims governor’s proposed income tax cut benefits millionaires more than middle-class families, Jan. 22, 2012\n\nPolitiFact Texas, Rick Perry says members of Congress with half their pay would still make $38,000 more than typical family, Nov. 30, 2011\n\nPolitiFact Texas, Lloyd Doggett says tax cut for richest Americans exceeds annual income of average Central Texas families, Jan. 7, 2011\n\nPolitiFact, Barack Obama says payroll tax cut has boosted average family income by $1,000, Sept. 6, 2011", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]