["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Kaleb-Wolf Torres in a Shriners fundraising commercial. Screenshot via YouTube.", "Kaleb-Wolf Torres, who frequently appears in commercials for Shriners Hospitals for Children, is alive.", "Social media posts confused Torres with another boy named Kaleb who died.", "Shriners Hospitals for Children patient ambassador Kaleb-Wolf De Melo Torres is known for his appearances in publicity campaigns and fundraising commercials for the hospital network.", "But false rumors spreading on social media say the young spokesperson, who has osteogenesis imperfecta, or brittle bone disease, has died.", "\"RIP Kaleb,\" says a Feb. 25 post says, \"Kaleb died 7 a.m. Wednesday after spending more than three years in hospice care at his South Whitehall Township home. He was 12.\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The post includes an image of Torres and a description identifying him as a Shriners Hospital spokesman and patient. But it’s not true. Torres is alive and well.", "\"We are happy to report that Kaleb is doing very well,\" Shriners said in an emailed statement. \"The story you may have heard or read involves another child with the same name and spelling and is not associated with Shriners Hospitals for Children. Online, our well known Kaleb’s story became confused with the other child. We are currently working to dispel this rumor and appreciate your help in doing so.\"", "The other child the hospital was referring to is Kaleb Holder, who died Feb. 19, 2021, in South Whitehall Township, Pa., the Morning Call in Allentown, Pa., reported. The 12-year-old had a progressive neurological disorder.", "Torres lives in Montreal.", "On Feb. 27, Shriners shared a new video of Torres on its Twitter account that shows him dancing and wishing its chairman, Jim Smith, a happy birthday.", "Kaleb is so excited to be the FIRST to wish Imperial Potentate Jim Smith a Happy Birthday, he sent us this video today to share! Join Kaleb by sharing this video and using the hashtag #HappyBirthdayJim ￼ pic.twitter.com/48If6wk54d", "A social media post claims that Shriners patient ambassador Kaleb Torres recently died.", "This isn’t true. The post confuses Torres with another boy, also named Kaleb, who died.", "We rate it False.", "Facebook post, Feb. 25, 2021", "YouTube, Shriners Hospitals \"Best Part of My Day\", May 5, 2020", "Twitter, Shriners Hospitals post, Feb. 27, 2021", "Morning Call, Lehigh County’s ‘little sheriff’ dies after battle with terminal brain disease, Feb. 19, 2021", "Email interview, Mel Bower chief marketing officer at Shriners Hospitals for Children, March 1, 2021", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]