["In the aftermath of the Congress party’s victory in the recently concluded assembly elections, a video of Congress President Rahul Gandhi has been shared widely on social media. The video, in which two separate clips have been juxtaposed, attempts to bring out the supposed duplicity of Gandhi on the issue of loan waiver for farmers.", "It may be noted that in the run-up to the polls, the Congress President had promised a farm loan waiver within 10 days of being elected to power. The same statement, made at a Congress rally constitutes one of the two videos, while the other is of the press conference held by the Congress President after the verdict was announced.", "The above post by the Facebook page Jay Purvanchal has been viewed over two million times so far. There are more than a million views on a facebook page India272+. It has also been shared widely on Twitter.", "Union Minister Smriti Irani was among those who retweeted it.", "The second video clip begins with Rahul Gandhi saying, “Loan waiver is not a solution” (translated). This has been projected by certain sections on social media as a u-turn by Rahul Gandhi after having explicitly promised a farm loan waiver on an immediate basis. The video has gone viral.", "At the press conference, Rahul Gandhi was asked about the issue of farm loan waiver and whether the Congress party would make this issue its poll plank in the 2019 general election. Responding to the question, Gandhi replied, “Loan waiver is a supporting step. It is not a solution. The solutions would be complex, it would be to support them, build infrastructure, provide access to technology and frankly, the solution is not easy. It is challenging and we will do it, but we will have to work with farmers and the people of the country, and we will do it.” (translated)", "In the above video, the relevant portion is from 22:26 to 23:24. Rahul Gandhi had not said anywhere that the Congress party will not provide loan waiver to farmers as has been alleged. The clip which has been shared was conveniently clipped to provide a false picture.", "Donate Now", "Arjun Sidharth is a writer with Alt News. He has previously worked in the television news industry, where he managed news bulletins and breaking news scenarios, apart from scripting numerous prime time television stories. He has also been actively involved with various freelance projects. Sidharth has studied economics, political science, international relations and journalism. He has a keen interest in books, movies, music, sports, politics, foreign policy, history and economics. His hobbies include reading, watching movies and indoor gaming.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]