["Social Media Coordinator of Jharkhand Pradesh Congress Sevadal Rameez Raza shared a video on Twitter with the claim that a BJP Bihar leader who appeared in public wearing a mask of PM Modi was chased by people who screamed: “rapist, leave India”.", "Its an “Epic Beizzati” Of BJP Leader in Bihar 🤣", "बिहार में भाजपा के एक नेता जब मोदी जी का “मुखौटा” लगाकर पहुंचें तो जनता ने उन्हें भगाते हुए कहा", "“बलात्कारी भारत छोड़ो”", "Epic‌ Slogan Must watch 😆😆🤣#BJPRajJungleRaj pic.twitter.com/fb32Ysjrj5", "— Rameez Raza (@RameezINC) October 11, 2020", "The clip is circulating against the backdrop of upcoming Bihar elections and the alleged gang-rape of a Dalit woman in Hathras by upper-caste men.", "The same video was posted on Facebook page ‘Vinay dubey_FC‘. It has been shared over 1,000 times.", "बिहार में भाजपा का नेता मोदी जी का मुखोटा लगाकर पहुंचा तो लोगो ने भगा दिया", "बिहार में भाजपा का नेता मोदी जी का मुखोटा लगाकर पहुंचा तो लोगो ने भगा दिया", "Posted by Vinay dubey_FC on Sunday, October 11, 2020", "The clip is massively viral on Twitter and Facebook with the identical claim.", "Alt News performed a Google search with simple Hindi keywords ‘मोदी मुखौटा भाजपा नेता (Modi mask BJP leader)’ and we found several news articles.", "According to a Dainik Bhaskar report, the incident happened in Indore, MP on October 2, 2020. A BJP worker attempted to garland Mahatma Gandhi’s statue on Regal square on the revolutionary’s 151st birth anniversary wearing PM Modi’s mask. He was allegedly beaten up by several congress members.", "The incident was reported by many other news organisations including Free Press Journal which said, “Reportedly, the congressmen got aggressive after seeing a BJP worker, Laxminarayan Sharma, who came to attend the event dressed like prime minister Narendra Modi and wearing a mask of PM Modi…The Congressmen were protesting near Gandhi’s statue on the Hathras gang-rape incident and were provoked by the BJP worker, Sharma, after which the incident took place. However, police interfered in the matter and rescued Sharma from the place and dispersed the crowd.”", "A video from MP where a BJP worker was chased and manhandled by Congress workers on the occasion of Gandhi Jayanti was falsely linked with Bihar elections. Furthermore, it was falsely claimed that he was driven away by the public.", "Donate Now", "Aqib is monitoring and researching mis/disinformation at Alt News", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]