["An article by The Christian Post, which we've archived here, has racked up more than 369,000 shares on Facebook since it was published in July 2018. '''Pure Genocide': Over 6,000 Nigerian Christians Slaughtered, Mostly Women and Children', the headline reads.", "Clashes between sedentary farmers and nomadic Fulani herders have claimed around 7,000 lives over the past five years in Nigeria's fertile, central Middle Belt region, driven by demand for water and access to land in a country with a surging population.", "In addition to this, the Middle Belt lies on the border between Nigeria’s predominantly Muslim north and mainly Christian south, as AFP explains here in a report from June 2019.", "'Church leaders in Nigeria have said that Christians are experiencing ‘pure genocide’ as 6,000 people, mostly women and children, have been murdered by Fulani radicals since January', the article claims.", "The information was shared by other pro-Christian websites, including Dublin-based Catholic Ireland in an article from July 2018 and American site Coptic Solidarity in an article from March 2019 which has been shared over 1,000 times on Facebook.", "The articles cite a press statement by 'church denominational heads in Plateau and Christian Association of Nigeria in Plateau State' from June 28, 2018. The statement was published following a series of attacks in largely-Christian central Nigeria, pitting mainly-Muslim Fulani herders against Christian farmers in Plateau, Benue, and Nasarawa states.", "Following one of the clashes, the Christian group released a statement claiming 'the renewed attacks on Christian communities and churches across Nigeria and particularly in the middlebelt of the country where over 6,000 persons mostly children, women and the aged have been maimed and killed in night raids by armed Fulani herdsmen have necessitated our outcry'.", "The statement signed by Reverend Soja Bewarang, chairman of the Denominational Heads Plateau and Christian Association of Nigeria (CAN), Plateau State, also claimed that 'the perpetrators are being deliberately allowed to go scot free'.", "AFP tried to contact Reverend Soja Bewarang but has not received a response.", "'It is even more worrisome that these huge numbers of over 6000 deaths in 2018 alone have been recorded in various attacks, especially in the northern and middle belt states of Benue, Plateau, Taraba, Adamawa, Kaduna, Kwara, Borno, Zamfara and other states when the country is not in a state of war,' it says.", "CAN said 'what is happening in Plateau state and other select states in Nigeria is pure genocide' but does not specifically state that 6,000 Christian were killed in the violence, as claimed by the widely-shared articles.", "The mention of '6,000' was in relation to 'various attacks' in 'Benue, Plateau, Taraba, Adamawa, Kaduna, Kwara, Borno, Zamfara and other states'. Four of the states mentioned -- Kaduna, Kwara, Borno and Zamfara -- are traditionally Muslim states.", "Churches have indeed been attacked and many Christians have been killed in the Middle Belt region, where the mainly Muslim north meets the largely Christian south. In one of such attacks, 86 people were reportedly killed. By contrast, CAN claims in its press statement that 238 people died in the same attack.", "While police regularly publish death tolls following clashes between farmers, they do not record the religion of people killed. We therefore cannot say for sure how many Christians died in the violence.", "According to Nigerian Security Tracker, run by US-based Council on Foreign Relations (CFR), there were less than 2,000 deaths recorded in Nigeria in the first six months of 2018, by sectarian actors, including the Fulani herders.", "The organisation bases its data on 'weekly surveys of Nigerian and international media', it says.", "The International Crisis Group, a non-profit, non-governmental organisation which works to ‘prevent deadly conflict’  estimates that herder-farmer violence in Nigeria claimed over 1,300 lives in the first six months of 2018 (not Christians only). No evidence shows that 6,000 Christians were killed by the Fulani herders from January to June, 2018.", "Previous social media posts have claimed that 60,000 Christians were killed by by Fulani herders from 2001, but AFP found no evidence to support the claim.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]