["The photo was shared in this Facebook post on May 12, 2020.", "The post’s Hindi-language caption translates to English as: “Telangana government is distributing free gifts to Muslims during Ramzan. They didn’t do the same during Hindu festivals.”", "Telangana is a state in south India, governed by chief minister Kalvakuntla Chandrashekar Rao.", "Ramzan is another word for Ramadan, the ninth month of the Islamic calendar, recognised as the holy month of fasting.", "The image was shared alongside a similar claim here and here on Facebook, and here and here on Twitter.", "The claim is false; the photo has circulated in media reports since at least 2015. The Telangana state government has said it will not hold its annual Ramadan gifting event while the nationwide coronavirus lockdown is in place.", "A reverse image search on Google found the same photo published in this July 9, 2016 report by the Indian news website Aajtak.", "The Hindi-language headline translates to English as: “Telangana government to distribute gifts to nearly 2 million poor Muslim families in Ramadan”.", "It reads, in part: “The Telangana government has made special preparations to make this Ramadan memorable for the poor Muslims of the state. The government will distribute gifts to 1.95 poor Muslim families of the state.”", "The event was also reported by other local media, including The Hindu here and iChowk.in here.", "This year, chief minister Kalvakuntla Chandrashekar Rao announced there will be no such packages distributed to Muslims for Ramadan, as the nationwide lockdown over the novel coronavirus continues.", "At the one-hour 39-minute mark of this video posted to the Telangana local government’s official Facebook page on May 5, 2020, he says: “As people will touch the bags with their hands and there is a chance for coronavirus to spread, government will not be distributing Ramzan gifts for this year.”", "Telangana has also previously distributed ‘gifts’ in a similar manner to mark other religious festivals, such as Christmas and Bathukamma, the Hindu festival of flowers.", "Local media reports from 2019, including this article by the Times of India and this by Hindustan Times shows hundreds aid packages were distributed on Christmas and Bathukamma celebrations by the state government that year.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]