["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A passers-by uses a mobile device near a vote today sign outside a polling place during early in-person general election voting, Oct. 28, 2020, Wellesley, Mass. (AP)", "Massachusetts does not require everyone to show a government-issued photo ID in order to vote, but there are some instances when people will be asked to show identification before voting.", "A video circulating on social media ignores that voting or attempting to vote under someone else’s name is not permissible, it is illegal.", "The video also implies that the absence of an ID requirement at polls is conducive to voter fraud. There's no evidence of widespread impersonation fraud in places that lack photo ID requirements.", "A video posted on TikTok seeks to cast doubt in the integrity of elections in Massachusetts by claiming that people can vote for other voters as long as they have their information.", "A woman in the video said she went to vote in a primary election (she doesn’t specify when), that she’s a registered independent from Boston. \"Not once,\" she says, did people at the polling station ask her for identification. She says she was told she didn’t need an ID because she was already registered to vote.", "\"Now here’s my deal. I have two sisters that look a little like me, what’s stopping me right now from throwing on a mask, changing my clothes and going back out there to vote two more times in my favor?\" said the woman in the video. \"So basically, anybody can go vote for anybody so long as they have their information. We are worried about voter mail-in fraud. They're not even checking IDs at the polling stations.\"", "PolitiFact reached out to the Massachusetts state office that oversees elections for data on instances of voter fraud as described in the TikTok. Debra O’Malley, a spokesperson for Massachusetts Secretary of State William F. Galvin, told PolitiFact she was not aware of any in-person voter impersonation cases in Massachusetts.", "O’Malley said there are certain circumstances in which voters may be asked for identification, but it is not required to be a photo ID. Acceptable types of ID include a recent utility bill or any other printed identification which contains the voter's name and address.", "The secretary of state’s website says people may be asked to show identification when they check in at a polling station for any of the following reasons:", "Voting for the first time in Massachusetts in a federal election;", "Inactive voter;", "Casting a provisional or challenged ballot;", "The poll worker has a reasonable suspicion that leads them to request identification.", "There is a police officer in every polling place to help enforce the election laws, O’Malley said.", "While Massachusetts doesn't have a photo ID requirement for voting, \"there's no evidence of widespread impersonation fraud in jurisdictions that lack photo ID requirements,\" said Nicholas O. Stephanopoulos, a professor at Harvard Law School whose expertise includes election law.", "A person would also be committing a crime if they assert someone else’s identity to vote, Stephanopoulos said. An attempt to impersonate a voter could also be detected if that other person has already voted, or the crime could be caught once the actual voter goes to the polls, he said.", "Massachusetts law says that \"whoever votes or attempts to vote in any name other than his own, or knowingly casts or attempts to cast more than one ballot at one time of balloting; or whoever votes or attempts to vote otherwise illegally, shall be punished by a fine of not more than ten thousand dollars or by imprisonment for not more than five years, or both.\"", "News21, a student reporting project based at Arizona State University's Walter Cronkite School of Journalism, in 2012 analyzed 2,068 alleged election-fraud cases since 2000. The study found that in-person voter impersonation was \"virtually nonexistent.\"", "The National Conference of State Legislatures says there are 36 states that have laws requesting or requiring voters to show some form of identification at the polls, 35 of which are in force in 2020.", "A video posted on TikTok claimed that in Massachusetts, \"anybody can go vote for anybody so long as they have their information. … They're not even checking IDs at the polling stations.\"", "Massachusetts does not require that everyone show an ID in order to vote, but there are some instances when people will be asked to show an ID before voting.", "The video ignores that voting or attempting to vote under someone else’s name is not permissible, it is illegal. The video also implies that the absence of an ID requirement at polls is conducive to voter fraud. An election law expert said there's no evidence of widespread impersonation fraud in places that lack photo ID requirements.", "The statement contains an element of truth but ignores critical facts that would give a different impression. We rate it Mostly False.", "This fact check is available at IFCN’s 2020 US Elections #Chatbot on WhatsApp. Click here, for more.", "TikTok video, posted Sept. 1, 2020", "Email interview, Debra O’Malley, a spokesperson for Massachusetts Secretary of State William Galvin, Oct. 29, 2020", "Email interview, Nicholas O. Stephanopoulos, a professor at Harvard Law School whose expertise includes election law, Nov. 2, 2020", "Massachusetts Secretary of State website, Identification Requirements", "Massachusetts Legislature, Chapter 56: VIOLATIONS OF ELECTION LAWS", "News21, Comprehensive Database of U.S. Voter Fraud Uncovers No Evidence That Photo ID Is Needed, Aug. 12, 2012", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]