["The images have been posted repeatedly on Facebook, for example here, and on Twitter here on July 7, 2019, where it was retweeted more than 3,000 times before it was removed.", "The Indonesia-language tweet says: “Photos of Indonesian women wearing hijab, circa 1700, neatly stored at the Leiden Library, the Netherlands, taken long before Kartini was born.”", "“Kartini” is a reference to Indonesian national hero Raden Ajeng Kartini, born in 1879. Kartini, who did not wear a hijab, was an “important symbol for the Indonesian independence movement and for Indonesian feminists”, according to Encyclopedia Britannica.", "Below is a screenshot of the misleading tweet:", "The four images do show women in Indonesia -- but they were not taken “circa 1700”.", "The first photographic process — heliography — was invented around 1824 by Nicéphore Niépce.", "Manual and online searches of Dutch and Indonesian photographic archives established that the images in the misleading posts were taken between 1900 and 1956.", "The first photo shows a wedding ceremony in the Indonesian region of Lampung, circa 1900. It is archived here by Leiden University in the Netherlands.", "The Dutch-language title says: “A wedding ceremony according to Lampung Pepadon custom in Lampong District”.", "Lampung Pepadon is a reference to a traditional community in Indonesia’s Lampung province.", "Two of the other images used in the misleading post are in the online archive of the Nationaal Museum van Wereldculturen, an ethnographic museum in the Netherlands.", "One of the images, which shows a number of women posing for the camera, is titled: “Group portrait of standing and sitting Malay women from Payakumbuh”. It was taken in 1900, according to this information on the museum website.", "The third photo has a Dutch-language title, “Portrait of Panglima Polem’s wife and sister.”", "Its caption says: “In May and June 1903, the Korps Marechaussee captured the mother of Aceh resistance leader Panglima Polim, as well as two of his wives, his sister and some other family members.”", "“Korps Marechaussee” was a special force created by the Dutch in April 1890 to combat the Acehnese guerilla fighters. Panglima Polim, or Polem, was a noble title in the era of the Aceh Sultanate.", "The last of the four photos used in the misleading post shows people in a market on Sumbawa Island in Indonesia in 1956.", "It is stored here in the digital collection of the University of Wisconsin-Milwaukee, in the United States.​", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]