["A statement which is attributed to India’s first Prime Minister Jawaharlal Nehru has circulated online for the past few years. According to this quote, Nehru had said, “I am English by education, Muslim by culture and Hindu merely by accident”. Among those who claimed that Nehru had said this include BJP IT cell head Amit Malviya who had tweeted this in 2015.", "By education I am an Englishman, by views an internationalist, by culture a Muslim and a Hindu only by accident of birth. – #Nehru", "— Amit Malviya (@amitmalviya) November 14, 2015", "Recently, in a debate on Republic TV in September 2018, national BJP spokesperson Sambit Patra had made the same claim. The video is posted below.", "There are several versions of this quote shared on social media, with subtle variations. In an article published in The Indian Express in March 2018 in which he reviewed a book by Shashi Tharoor, Dalit scholar Kancha Ilaiah Shepherd had claimed that Nehru had said these words. The quote has also been referred to by the website www.india.com in an article which showed the ‘grey side of India’s first PM’.", "The same has been alleged by a viral poster stamped with ShankhNaad, which has given a reference to this quote- the work of a retired bureaucrat, V Sundaram. Alt News searched and found a blog which contained this write-up titled Cry for a Hindu Nation. Here too, Jawaharlal Nehru has been credited with these words.", "Alt News searched for this quote online and came across an article by the fake news website Postcard News, which had used the quote in the title itself. The article was published on February 25, 2018. Apart from Postcard News, Alt News found that a number of blogs too had referred to this quote.", "On further probing, we found a reference to this remark in the book The Nehrus: Motilal and Jawaharlal by B R Nanda, who was a writer and the biographer of Mahatma Gandhi, apart from books on both Motilal Nehru and Jawaharlal Nehru. According to Nanda, it was N B Khare, a leader of the Hindu Mahasabha who had described Nehru as ‘English by education, Muslim by culture and Hindu by an accident of birth’.", "Nanda has also referred to this quote in another book, Motilal Nehru, in which he attributes this quote to a ‘critic’ who had referred to ‘Motilal’s son’ in these words. Congress MP Shashi Tharoor in his book Nehru: The Invention of India alludes to this quotation, once again quoting Hindu Mahasabha leader N B Khare. This is further corroborated by disgraced journalist and former minister M J Akbar who The Quint has quoted as saying, “The president of Hindu Mahasabha in 1950, NB Khare was only repeating an old story when he called Jawaharlal Nehru “English by education, Muslim by culture and Hindu by accident”.", "Both the sources presented above refer to this quotation as having been made by N B Khare and NOT Jawaharlal Nehru. Khare began his politics with the Congress party and had served as a member of the viceroy’s executive council. Khare was also elected to the Constituent Assembly of India which was tasked with framing the Constitution. In 1949, he joined the Hindu Mahasabha and served as its president till 1951.", "Alt News decided to dig deeper to find out the source of this misinformation. In the process, we came across Rafiq Zakaria’s A Study of Nehru, published in 1959. The work is a compilation of commentaries on Nehru by numerous eminent political personalities from India and abroad. One of the contributors to this volume is none other than N B Khare.", "On page 215 of the volume, Khare’s write-up, titled The Angry Aristocrat is a critique of Jawaharlal Nehru. Here, he has claimed that Nehru in his autobiography had said that he (Nehru) is English by education, Muslim by culture and Hindu by an accident of birth.", "Alt News searched for this statement in Jawaharlal Nehru’s autobiography. Interestingly, it is nowhere to be found. Presented below is an excerpt from the autobiography in which Nehru ruminates about ‘Muslim culture’, arguing that the term signifies not a monolithic culture but a syncretic tradition that developed over the course of centuries of cultural exchange.", "“But what is this ‘Muslim culture’? Is it a kind of racial memory of the great deeds of the Arabs, Persians, Turks, etc.? Or language? Or art and music? Or customs? I do not re-  member any one referring to present-day Muslim art or Muslim music. The two languages which have influenced Muslim thought in India are Arabic and Persian, and especi- ally the latter. But the influence of Persian has no element of religion about it. The Persian language and many Persian customs and traditions came to India in the course of thousands of years and impressed themselves powerfully all over north India. Persia was the France of the East, sending its language and culture to all its neighbours. That is a common and a precious heritage for all of us in India.”", "This leads us to conclude that the first reference to this alleged remark by Jawaharlal Nehru was made in 1959 by none other than N B Khare, who is credited by scholars for having made this remark about Nehru.", "Jawaharlal Nehru was the president of the Indian National Congress in 1929, the same year the organisation passed a historic resolution demanding ‘purna swaraj’ or complete independence from British rule. At this session held in Lahore, in his presidential address, Jawaharlal Nehru had spoken about the need for shunning religious dogmatism, and flayed the idea of nationhood based on religion.", "Referring to his birth as a Hindu, Nehru had said, “I was born a Hindu but I do not know how far I am justified in calling myself one or in speaking on behalf of Hindus. But birth still counts in this country and by right of birth I venture to submit to the leaders of the Hindus that it should be their privilege to take the lead in generosity. Generosity is not only good morals, but is often good politics and sound expediency. And it is inconceivable to me that in a free India the Hindus can ever be powerless.”", "Jawaharlal Nehru has been incessantly vilified on social media, where fake quotes and shared photoshopped images to malign him. Earlier, a ‘letter’ falsely claimed to have been written by Nehru calling Subhas Chandra Bose a “war criminal” was widely shared. In 2017, photograph of Nehru with his sister Vijayalakshmi Pandit was posted by BJP IT cell head Amit Malviya to insinuate philandering. There are numerous such instances chronicled by Alt News.", "Nehru’s political ideology and his legacy is anathema to the right-wing social media network. From rumours over his genealogy to his relationship with Subhas Chandra Bose, his education policy and his equation with the RSS, among other things, India’s first prime minister remains a compelling figure in the annals of politics more than five decades after his death.", "Donate Now", "Arjun Sidharth is a writer with Alt News. He has previously worked in the television news industry, where he managed news bulletins and breaking news scenarios, apart from scripting numerous prime time television stories. He has also been actively involved with various freelance projects. Sidharth has studied economics, political science, international relations and journalism. He has a keen interest in books, movies, music, sports, politics, foreign policy, history and economics. His hobbies include reading, watching movies and indoor gaming.", "What’s in a name? Apparently, a lot, if social media trends and raging political discourses…", "As Karnataka is set to go to the polls in two months’ time, all parties…", "The Qutub Minar is a UNESCO world heritage site in South Delhi. The name literally…", "On February 21, external affairs minister S Jaishankar gave an interview to ANI journalist Smita…", "An image of an apparently ancient sculpture is viral with the claim that it was…"]