["By Jessica McDonald", "Posted on April 9, 2020", "Falsely citing “studies,” President Donald Trump has suggested that there are few novel coronavirus cases in “malaria countries” because of the use of the antimalarial drug hydroxychloroquine. But no such studies exist, and the drug is not widely used for malaria in much of the world.", "Trump has aggressively promoted hydroxychloroquine for weeks, despite limited evidence at this point that it is safe or effective to treat COVID-19, the disease caused by the novel coronavirus. And he has latched on to indications it could be working — even if the basic facts undermine his argument.", "“It is extremely unlikely that relatively low rates of the [coronavirus] infection in sub-Saharan Africa are related to the use of chloroquine or hydroxychloroquine,” Michigan State University malaria researcher Terrie Taylor told us, also referring to a similar malaria drug Trump has pushed as a COVID-19 treatment. “Neither has been the first-line treatment for malaria illness for many years.”", "Trump first suggested hydroxychloroquine was behind other nations’ low COVID-19 counts in a March 23 coronavirus press briefing. “And countries with malaria have had a interesting thing happen,” he said. “They take this particular drug — it’s a very powerful drug — and there is very little semblance of the virus in those countries. And there are those that say because this drug is very prevalent because of the malaria.”", "He broached the idea again in another press briefing on April 4 after falsely claiming that “people with lupus,”  who also take hydroxychloroquine to treat symptoms of their disease, “aren’t catching this horrible virus.”", "As we have written, it’s not yet known whether lupus patients taking the drug are less susceptible to infection with the new virus. But it’s clear that being on the drug is not a panacea. Registry data from early April show that a quarter of patients with rheumatic diseases who have contracted COVID-19 were already taking hydroxychloroquine.", "Trump, April 4: And there’s also other studies, you know, with the malaria, that the malaria countries have very little — people that take this drug for malaria, which is very effective for malaria — that those countries have very little of this virus. I don’t know. You’re going to check it out.", "As we did with Trump’s lupus remarks, we did check it out. We could find no studies that back his claim, and experts we consulted were also unaware of any such studies. The White House did not respond to our request for more information.", "It’s nevertheless true that many countries where malaria is common, including much of sub-Saharan Africa, haven’t reported a lot of COVID-19 cases — at least not yet.", "Global tallies from the World Health Organization show that the day Trump made his latest remarks, the African region had fewer than 5,500 confirmed coronavirus cases and only 170 deaths, out of more than 1 million cases and nearly 57,000 deaths worldwide. As of April 8, the count had risen to more than 7,600 cases and 326 deaths.", "Malaria, which is caused by a parasite that is transmitted to humans by mosquitoes, occurs in other places, dictated in large part by climate and season. But as the WHO says, the African region has a “disproportionately high share of the global malaria burden,” including 93% of all cases and 94% of deaths in 2018. On April 4, only 680 COVID-19 cases had been reported in the six African nations that collectively account for more than half of the world’s malaria cases.", "There’s little reason, however, to think that’s because of chloroquine or hydroxychloroquine, for the simple fact that few people in malaria-prone countries are taking the drugs.", "Chloroquine was once the go-to drug for malaria treatment in Africa, Taylor explained, but is no longer because the malaria parasite evolved and developed resistance to the drug. Hydroxychloroquine, which is a slightly modified version of chloroquine that is generally considered to be safer, suffers from the same problem; Taylor said it never has been a first-line malaria treatment in Africa.", "“WHO and the various national malaria control programmes across the continent all recommend artemisinin-based combination therapy (ACT) for the first line treatment of uncomplicated malaria,” Taylor said in an email from Malawi, a small landlocked country in southeastern Africa. “There are a number of different approved combination drugs, and each country has made its own policy recommendations — but no African country recommends that malaria patients receive chloroquine now.”", "Chloroquine, she added, “has virtually disappeared from many of these countries.”", "In Malawi, where Taylor is doing research, getting chloroquine is “actually quite difficult,” she said, because it’s been withdrawn from the national formulary and is “only available by special request.”", "Miriam Laufer, a malaria researcher and pediatric infectious disease specialist at the University of Maryland, told us that chloroquine is “still available in the private sector in some countries, like Nigeria, but it is not used routinely for treatment of malaria and is not part of national treatment policies.”", "Laufer agreed with Taylor that it would be extremely unlikely that the low numbers of COVID-19 cases in sub-Saharan Africa would be due to the use of these drugs.", "Ric Price, a professor of global health at the Menzies School of Health Research in Australia, also told us it was “highly implausible” that antimalarials were responsible for the lower COVID-19 counts in countries with malaria.", "“You would have to have enough of the population being treated for malaria,” he said in an email, “and residual levels of the drug staying in the blood for weeks to provide protection against the virus.”", "While chloroquine is still used to treat malaria in some countries to target a different species of parasite that largely remains sensitive to the drug, Price said only a tiny fraction of the populations in those countries would be on the medication for malaria treatment — and “almost no one” would be taking drugs for prevention.", "Price calculated that at best, less than 0.5% of those populations would have taken chloroquine at some point in the past year.", "Then there is the issue of timing and dosing of chloroquine. “It hangs around for a few weeks in blood,” Price said, “but will only provide protection from malaria for a week (max 4 weeks).”", "Even if chloroquine is effective against COVID-19, far fewer than 0.5% of the population would have taken the drug at the right time to be protected. And as Price noted, lab studies suggest that compared with malaria, much more of the drug is needed to have any effect on the virus, so the amounts people might have taken are “highly unlikely to have any impact.”", "The WHO also has cautioned that the dosages for malaria are different than those being explored for COVID-19.", "“In the context of the COVID-19 response, the dosage and treatment schedules for chloroquine and hydroxychloroquine that are currently under consideration do not reflect those used for treating patients with malaria,” the WHO website says. “The ingestion of high doses of these medicines may be associated with adverse or seriously adverse health outcomes.”", "Finally, while current maps of the coronavirus pandemic might make it look like much of Africa is escaping relatively unscathed, many are bracing for a surge.", "“I’m pretty confident that COVID-19 is going to become an important epidemic in Africa,” said Peter Hotez, a professor and dean of the National School of Tropical Medicine at Baylor College of Medicine, in a phone interview. “It’s just that there hasn’t been much monitoring and testing.”", "Price also suspects testing will be a problem. “I very much doubt we will see any of the real picture of Covid19 in poor malaria endemic countries,” he said, “because they will be testing a tiny fraction of [the] number.”", "The WHO, which has been worried since the start of the outbreak about the damage the virus might inflict on Africa’s weaker health systems, issued a press release on April 7 noting that the virus “was slow to reach the continent compared to other parts of the world,” but that “infection has grown exponentially in recent weeks and continues to spread.” The continent’s first case was identified on Feb. 14 in Egypt, nearly a month after the first U.S. case.", "The dearth of cases — if in fact real, and not due to a lack of testing — could stem from a variety of factors, including differences in international travel or possibly even the climate.", "As we’ve previously explained, there is some precedent for virus transmission to wane as it becomes hotter and more humid, although it’s not known yet if this applies to the novel coronavirus, or SARS-CoV-2. A recent summary of the latest research on the topic from the National Academies of Sciences notes that in the lab, SARS-CoV-2 seems to survive less well under higher temperatures and humidity levels, but it’s less clear whether that has any impact on virus transmission in the real world — and countries currently in “summer” climates have still seen the virus spread.", "If climate does turn out to be important for this virus, the very conditions that allow malaria to flourish could help limit the extent of the outbreak in certain countries.", "Experts, however, caution against coming to any premature conclusions. “The potential explanations for why sub-Saharan Africa is lagging behind other countries vis-a-vis COVID19 are fueling LOTS of conversations and speculation,” said Taylor.", "Only time and more testing, plus “some epidemiological rigor,” she said, will tell.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]