["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "In the race for state Supreme Court, the Wisconsin Republican Party has attacked Judge Rebecca Dallet and given support to Judge Michael Screnock. (Rick Wood/Milwaukee Journal Sentinel)", "In what is nominally a nonpartisan state Supreme Court campaign, the Wisconsin Republican Party is supporting Sauk County Circuit Judge Michael Screnock, who is backed by conservatives.", "With the April 3, 2018, election drawing near, the party attacked Milwaukee County Circuit Judge Rebecca Dallet, who is supported by liberals.", "On billboards in Milwaukee, Green Bay and Eau Claire that were announced March 12, 2018, the GOP claimed:", "\"Hypocrite Rebecca Dallet took money from attorneys with over 100 cases before her.\"", "Dallet has taken campaign contributions from lawyers who have cases before her -- which is not uncommon and is not prohibited by the state Judicial Commission.", "But the thrust of the GOP’s claim -- that Dallet is a \"hypocrite\" because she took the contributions -- misfires.", "The money", "The billboards refer to more than 100 cases, with roughly three-quarters of them that were pending when Dallet received campaign donations from lawyers on those cases. Other cases cited either had not yet been filed or had been closed.", "The largest donation was $2,500 from attorney Howard Sicula in June 2017. He had a wrongful death case pending in Dallet’s court at the time.", "Now to the thrust of the GOP’s claim.", "Dallet a ‘hypocrite’?", "The billboard refers viewers to an anti-Dallet state GOP website. It cites comments Dallet made at a Jan. 22, 2018 Federalist Society Supreme Court debate.", "Dallet began by saying: \"So, I do recuse myself when there is any appearance that it’s not going to be fair.\"", "The GOP contends that statement means Dallet is a hypocrite because she took campaign contributions from lawyers who had cases before her.", "But the rest of Dallet’s statement makes it clear she didn’t pledge not to take campaign contributions from lawyers, but rather that she would recuse herself from cases in which her husband’s law firm was involved. She also drew a contrast with the first campaign of state Supreme Court Justice Michael Gableman, who decided not to seek reelection.", "Here’s the rest of Dallet’s statement during the debate:", "My husband works for Husch Blackwell, a larger firm, and I made the decision to remove myself from any case that they handle. That is not required by our ethics rules … but I decided that the better course of action, so that it is fair to everyone involved, is to just recuse myself from all those cases ….", "This is not about contributions from attorneys to our campaigns; that is allowed by our ethics rules. And certainly if it was an extreme amount, that would be something that the judge would have to look at.", "What we’re talking about with our recusal rules, that is the issue that I’ve been talking about, is the fact that when a party is in front of the case (judge) and that party has spent money -- significant amount of money, massive amounts of money, like the $2.25 million spent on Justice Gableman’s campaign -- how can anyone look at that and think that that’s fair?", "Dallet also referred to recusing herself from cases involving her husband’s firm in January 2018 at a candidates event and in an interview.", "Although it does not bear on the rating of this fact check, it’s worth noting that the Wisconsin State Journal reported in early March 2018 that Dallet presided over at least one case involving attorneys from her husband’s law firm; and that Dallet recused herself from three recent cases on her docket involving attorneys from the firm after being asked about them by the newspaper.", "Our rating", "The state Republican Party says Dallet is a \"hypocrite\" because she \"took money from attorneys with over 100 cases before her.\"", "Dallet has received campaign donations from lawyers who had cases in her court -- something that is common in judicial campaigns and allowed by state judicial ethics rules.", "But on the hypocrite part of the GOP’s statement, Dallet did not pledge that she would not accept contributions from lawyers who had cases before her. Rather, her pledge was to recuse herself from cases in which her husband’s law firm was involved.", "For a statement that contains only an element of truth, our rating is Mostly False.", "Wisconsin Republican Party, billboard, March 12, 2018", "Email, Wisconsin Republican Party spokesman Alec Zimmerman, March 19, 2018", "Interview, Rebecca Dallet campaign spokeswoman Gillian Drummond, March 22, 2018", "DoubleTalkDallet.com, accessed March 12, 2018", "Facebook, Supreme Court candidates event (20:00), Jan. 29, 2018", "YouTube, Wisconsin Eye interview of Rebecca Dallet, Jan. 30, 2018", "YouTube, video (33:50) of Federalist Society Supreme Court debate, Jan. 22, 2018", "Wisconsin State Journal, \"Supreme Court candidate stayed on case despite saying she would step away,\" March 2, 2018", "Wisconsin Republican Party, Judicial Commission complaint, March 15, 2018", "Wisconsin Circuit Court Access Program, Howard Sicula case, accessed March 21, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]