["About this rating", "A video purportedly showing an amazing fireworks demonstration given in China has been circulating online since January 2013, when it was uploaded to YouTube by user Mediabyjj.  The video supposedly shows fireworks manufactured in China's Hunan province (\"the world’s capital of fireworks\") exploding in a panoply of brilliant colors and shapes for a 2013 New Year's celebration and creating a pyrotechnic display that \"has never been equaled in the West\":", "This video of a 2013 Fireworks Show in China is a treat for the eyes.", "Less than 2 minutes in length but with shapes that I've never seen before.", "This Hunan Province town is where fireworks were invented and the show has never been equaled in the West.", "What many viewers who shared (and were awed by) the video failed to notice was that its uploader plainly stated he had digitally created the entire show himself:", "I hope you all had a pleasant party celebrating the dawning of a new year. We all made it, safe and sound, to the year 2013, and I wanted to continue the party by sharing this fireworks display I created & actualized. It took me a little over a week to complete, and I am very happy with the outcome. All of the shells are custom-made by me, and I take huge pride in the handiwork that went into bringing them to life. I hope you all enjoy the show. :)", "The music choice used for this display is Thomas Bergersen's (Two Steps From Hell) \"Heart of Courage.\" Truly a great musical arrangement.", "The great software used to mastermind a production like this is FWSim.", "FWSim, the platform used to create this video, is a fireworks simulation software package:", "FWsim Pro is a fireworks show design and simulation software, designed for fireworks companies and semiprofessional pyrotechnicians. It offers 3D graphics, an easy-to-use show designer, and a powerful effects editor. FWsim Pro has been developed in cooperation with European fireworks companies, and is under active development.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]