["About this rating", "Banks was convicted of rape in 2002 and served five years in prison as part of a plea agreement before his accuser recanted and he was set free.", "Banks served five years and two months in prison, not six years. The woman involved in the case did not recant on Facebook, but she did attempt to contact Banks through the social media web site.", "Southern California football player Brian Banks was a rising star in 2002 when his career was abruptly derailed by a rape charge that sent him to prison.", "Banks entered into a plea agreement after a former high school classmate of his told a grueling story about Banks' having dragged her into a stairwell and raped her — an accusation which she  recanted years later:", "Banks still doesn’t know her reasoning for selling him down the river when she knew they never had sex and there was no DNA trace on her underwear. Maybe it was the $1.5 million she collected from the Long Beach school system, claiming it was an unsafe environment (the city is trying to recoup $2.6 million from her now). Banks thinks maybe Gibson was afraid her older sister, who went to the same high school, would find out she made out with him and tell her mother. Or that he would brag to friends. Maybe she thought he would just be suspended. He doesn’t think she was trying to put him in jail. He also thinks perhaps a school security guard saw her leaving the stairwell with him, asked what she was doing and if she wanted to do it.", "“Oh well, then he raped you,” Banks surmises the guard said.", "“We don’t really know what the truth really is as to why she lied,” Banks says. “I never really got a clear reason.”", "The ordeal garnered national attention (and became the subject of a feature film), but a meme circulating online misrepresents several details of the rare circumstances surrounding his wrongful imprisonment for a purported sexual assault:", "It is true that Banks was considered a strong football prospect as a student at Long Beach Polytechnic High School before he was arrested and charged in 2002 for allegedly raping a classmate, Wanetta Gibson. Banks was convicted after taking a plea agreement calling for him to serve five years in prison and another five in probation, as well as registering as a sex offender.", "However, there are discrepancies between his case and the story promoted by the meme; for instance, Gibson did not \"confess on Facebook\" that she fabricated the allegation. However, she did use the social media platform to contact Banks in 2011. The two met face-to-face with a private investigator present, at which point she admitted to fabricating the accusation against him.", "Banks -- who had by that point already served five years and two months in prison, rather than the \"six years\" listed in the meme -- enlisted the aid of an advocacy group, the California Innocence Project. CIP managing attorney Michael A. Semanchik told us via e-mail that for five months, the group collected evidence, included statements from both Gibson and her friends demonstrating that her allegations had been invented.", "Semanchik added that Gibson subsequently admitted in person to prosecutors that she had lied, leading to the charges against Banks being dismissed in March 2012. Banks' status as a sex offender was also rescinded. He went on to play professional football in the United Football League and National Football League before going on to work for the NFL itself. He has also been a visible supporter of the California Innocence Project.", "In June 2013, Gibson was ordered by a Los Angeles Superior Court judge to repay the $1.5 million settlement awarded to her from a separate lawsuit against the Long Beach Unified School District, as well as an additional $1.1 million in fees. Gibson had sued the district claiming that it was unsafe for her as a result of being attacked by Banks.", "While Gibson fabricated her account of being assaulted, research shows that such instances are rare; a 2012 report by the National Sexual Violence Resource Center (NSVRC) found that while false reports make up between 2 and 10 percent of total rape reports, 63 percent of sexual assaults are not reported to authorities. NSVRC spokesperson Laura Palumbo told us this can create more issues for those who have been sexually assaulted:", "The prevalence of false reporting of sexual violence is low, yet still when survivors come forward, many face scrutiny or encounter barriers. When the rare case of a false report is misrepresented as a common occurrence, this creates additional barriers for victims coming forward. Misconceptions about false reporting rates have direct, negative consequences and can contribute to why many victims don't report sexual assaults.", "Banks himself has voiced support for sexual assault survivors. In June 2016 he criticized the fact that Stanford University student Brock Turner only received a six-month sentence for rape:", "I would say it's a case of privilege. It seems like the judge based his decision on lifestyle. He's lived such a good life and has never experienced anything serious in his life that would prepare him for prison. He was sheltered so much he wouldn't be able to survive prison. What about the kid who has nothing, he struggles to eat, struggles to get a fair education? What about the kid who has no choice who he is born to and has drug-addicted parents or a non-parent household? Where is the consideration for them when they commit a crime?", "In December 2017, he said that assault survivors seeking justice \"should have the opportunity to do so.\" He also said that had the statue of limitations not expired for Gibson's perjury, he would have pressed charges against her:", "Part of my life was taken away because of her. But more importantly, you have to go after people like this because a person such as herself makes it harder for a woman who is raped to come forward confidently and share their story and hope something is done about what happened to them. They should be able to expect to be believed.", "Banks appeared on the Oxygen network in January 2018 as a co-host for the true crime show Final Appeal. He also co-produced a movie based on his case, slated for release in 2018.", "Kandel, Jason.   \"Woman Who Falsely Accused Brian Banks of Rape Ordered to Pay $2.6M.\"\r\n    KNBC [Los Angeles].   15 June 2013.", "Powers, Ashley.   \"A 10-Year Nightmare Over Rape Conviction Is Over.\"\r\n    Los Angeles Times.   25 May 2012.", "Myers, Gary.   \"Former Football Star Brian Banks, Who Served Five Years in Prison for Rape He Didn't Commit, Disgusted by Brock Turner Ruling.\"\r\n    [New York] Daily News.   6 June 2016.", "Wills, Cortney.   \"Wrongfully Convicted Athlete Brian Banks Speaks Out in Support of Alleged Sexual Assault Victims.\"\r\n    The Grio.   19 December 2017.", "National Sexual Violence Resource Center.   \"False Reporting Overview.\"\r\n    Accessed 2 February 2018.", "CBS Los Angeles.   \"Wrongly-Accused of Rape, Brian Banks' Life Becoming a Movie.\"\r\n    17 November 2017.", "Arturo Garcia is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]