["Recent social media posts claim businessman and former basketball star Earvin “Magic” Johnson Jr. donated blood to fight COVID-19. Users online have raised their eyebrows, some entertained and some concerned about how Johnson's HIV-positive status may affect blood donation recipients.", "Those commenters need not worry because the post was a joke and is not true.", "“Earlier today, NBA legend Magic Johnson donated some of his blood to the Red Cross to help people in underprivileged communities deal with COVID-19,” reads the widely shared image.", "The Twitter user, Barry McCockiner, told USA TODAY his tweet \"was an obvious joke\" and \"not real.\" McCokiner later removed the tweet and called it a \"troll tweet\" in a Feb. 15 Twitter thread.", "While McCockiner may have had satirical intentions, that wasn't abundantly clear to all social media users who shared screenshots of the tweet. Some of these screenshots were altered to appear as if it was tweeted by Sports Center, however, McCockiner's Twitter handle, @UltraWeedHater, is still visible.", "\"Well folks, if they are allowing HIV positive people to give blood, I'm out. I hope I don't need blood any time soon,\" one Facebook user captioned the screenshot.", "Fact check:Photo of Joe Biden with stacks of executive orders on Resolute desk is altered", "USA TODAY reached out to several accounts that shared the claim for comment.", "The image in the posts comes from the 2012 documentary “Endgame: AIDS in Black America.”", "Johnson appeared in the documentary and discussed his diagnosis and how it affected his sports career. Johnson has been living in the public eye with HIV since he announced he’d contracted the virus and retired from the Los Angeles Lakers in 1991.", "The image was pulled from a scene in which Johnson’s doctor, Dr. David Ho, conducted medical tests and discussed his treatment, NPR's \"Fresh Air\" reported in 2012. He was not donating blood for transfusion or participating in a blood drive.", "More:Fact check: Masks encouraged on federal lands if distancing isn't possible", "Both the meme and the tweet attribute the claim to the Red Cross’ Twitter feed, however, the Red Cross has never tweeted about Johnson.", "The Red Cross does not accept blood donations from HIV-positive donors because the virus can be transmitted through blood.", "Fact check:Heavily edited viral image of sun's surface wasn't taken by NASA", "“You should not give blood if you have AIDS or have ever had a positive HIV test, or if you have done something that puts you at risk for becoming infected with HIV,” its website says.", "This claim is not unique. In 2013, a widely circulated post with the same image claimed Johnson was donating blood to leukemia and lymphoma patients. Snopes rated this claim false in 2015.", "USA TODAY contacted Magic Johnson Enterprises for comment.", "HIV-positive, entrepreneur and former NBA star Earvin \"Magic\" Johnson did not donate blood to the Red Cross to help communities affected by COVID-19. The Twitter user that originally posted the baseless claim confirmed it was a joke. However, it has since spread from social media accounts unaware of its original satirical intentions. We rate this claim FALSE, because it is not supported by our research.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook."]