["About this rating", "In April 2019, an article positing that Taylor Swift had humiliated a fan for wearing a Trump shirt at one of her concerts was published by dailyworldupdate.us, one of the many websites in \"Last Line of Defense\" network of junk news sites:", "The younger millenial generation loves Taylor Swift. From her popular hits “Shake it Off”, “You Ain’t My President”, and “The Lamb Lies Down on Broadway” to her sometimes racy on-stage antics, the young songstress has become an American pop icon as quickly as her last name. She’s also made no secret of her liberal values, but now, she may have pushed it a little too far.", "“She asked me where I got my shirt, and I told her at Spencer’s at the mall. She laughed and told everybody that i should have used my allowance to buy drugs instead. Everybody laughed. Then she said the next song was for me and they did that old ‘Stupid Girl’ song. Everybody was laughing and I cried. I don’t like her no more. Can I be on the Fox channel next?”\nAlthough that website carried a disclaimer and multiple satire tags, the article was later picked up and republished by a number of other disreputable websites without any indications of its origins.\nWe found verbatim copies of this article published on America 2020 Review, Seattle Media Daily, Harley and the Davidsons, Conference Scene, and Fight for America. None of those websites carried a disclaimer labeling the article as a work of fiction.\nThis article was also picked up and promulgated by dozens of social media accounts:\n\nWe can't definitively say why these accounts all started sharing this piece of fake news about Swift, but the following message from the \"DanAconda\" account makes it seem like the intent was simply to sow division:\nTaylor Swift Humiliates Fan Wearing Trump Shirt Onstage\nOver her now, just like all the rest.\nThem or us.", "“She asked me where I got my shirt, and I told her at Spencer’s at the mall. She laughed and told everybody that i should have used my allowance to buy drugs instead. Everybody laughed. Then she said the next song was for me and they did that old ‘Stupid Girl’ song. Everybody was laughing and I cried. I don’t like her no more. Can I be on the Fox channel next?”", "Although that website carried a disclaimer and multiple satire tags, the article was later picked up and republished by a number of other disreputable websites without any indications of its origins.", "We found verbatim copies of this article published on America 2020 Review, Seattle Media Daily, Harley and the Davidsons, Conference Scene, and Fight for America. None of those websites carried a disclaimer labeling the article as a work of fiction.", "This article was also picked up and promulgated by dozens of social media accounts:", "We can't definitively say why these accounts all started sharing this piece of fake news about Swift, but the following message from the \"DanAconda\" account makes it seem like the intent was simply to sow division:", "Taylor Swift Humiliates Fan Wearing Trump Shirt Onstage", "Over her now, just like all the rest.", "Them or us.", "Daily World Update.   \"Taylor Swift Humiliates Fan Wearing Trump Shirt Onstage.\"\r\n    18 April 2019.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]