["About this rating", "In December 2020, a Tumblr post went viral about actor Misha Collins' interning at the White House during U.S. President Bill Clinton's administration and writing of an op-ed article in defense of Monica Lewinsky. This, in turn, led to unfounded, untrue, and silly speculation that the actor had once had an affair with the former president. The \"sex scandal\" angle of this rumor is simply the result of overactive imaginations, but it is true that Collins once interned at the White House.", "The above-displayed screenshot was widely shared on social media, however, the original Tumblr post contained two additional bullet points that attempted to stop the spread of false claims concerning an affair between Collins and Clinton:", "Sorry to ruin the fun, but I feel like the “misha fucked bill clinton” joke overshadows the actual story, which is that Misha is just a good dude who stood up for Lewinsky when the rest of the nation was treating her as a laughing stock.", "Imaginary sex scandal aside, it's true that Collins interned at the White House. The former \"Supernatural\" star, who was born Dmitri Krushnic, interned at the White House for about four months circa 1994. Collins has publicly discussed his internship a few times in the past. For instance, at the \"BosCon\" conference in Boston, Massachusetts, in 2011 he told a story about how he was once tasked with writing official correspondence letters during his internship. At another conference, Collins told a story about how he used to steal security passes:", "While the first portion of this video involves a humorous (and possibly incriminating) story from Collins, he touches on a more relevant topic at the end of this clip when he notes that Clinton was often viewed and treated as if he were a celebrity.", "Collins discussed this idea at length in an article he wrote for Baltimore Sun a few weeks after news broke about Clinton having an affair with White House intern Monica Lewinsky in January 1998. Collins (who used his birth name Dmitri Krushnic for the article) wrote that while Lewinsky was often painted as \"infatuated\" and \"star struck\" with the president, these descriptions could have been applied to any number of other interns.", "Thu, Jan 29, 1998 – Page 113 · The Baltimore Sun (Baltimore, Maryland) · Newspapers.com", "Here are a few excerpts from the story:", "Shorty before Monica Lewinsky began her White House internship in 1995, I completed a four-month-long internship there. Since news broke last week about allegations of a sexual affair between Ms. Lewinsky and President Clinton, I've intently followed the story, and reflected on my White House memories.", "At least one element of the unfolding story seems misleading. In attempting to find clues about Ms. Lewinsky's behavior to determine whether they suggest an affair, the media have reported that sources describe Ms. Lewinsky as \"infatuated\" with the president, \"star struck\" and even \"a stalker.\"", "[...]", "I contend that the description of her behavior could fit any number of young interns. To varying degrees, the vast majority of White House interns and volunteers thrived on their brushes with Mr. Clinton.", "When I first arrived at the White House, I recall watching two young male interns surreptitiously climb out of a first-floor window into the Rose Garden and make a beeline to the South Lawn, where they pushed their way through a small crowd of foreign dignitaries to get next to Mr. Clinton; one smiled broadly while the other intern snapped a not-so-candid photo of his pal with the commander in chief.", "[...]", "The chance to tell your friends that you had seen the president jogging or that he had patted you on the shoulder or that you had received a Christmas card from the first family is the stuff that White House intern dreams are made of.", "If Monica Lewinsky had not seemed like a star-struck, infatuated stalker who hung around the West Wing every chance she got, then it would be fair to say her behavior in the White House was suspicious.", "Collins truly interned at the White House during the Clinton administration, and after the Clinton-Lewinsky scandal broke he truly published an opinion piece in the Baltimore Sun in which he defended Lewinsky against some \"misleading\" descriptions of her in the news media. These tidbits have led to jokes and some silly speculation about Collins and Clinton having an affair, some of which has been peddled by Collins himself. When the internet caught wind of these rumors in 2011, Collins posted the following message on Twitter:", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]