["By Robert Farley", "Posted on August 22, 2019", "President Donald Trump has claimed no fewer than seven times over the past three years — including at a recent rally in New Hampshire — that he won Michigan’s “man of the year” award. But there’s no evidence that he did.", "We scoured news archives and searched the internet, and came up empty. Other media outlets have looked into it too, with a similar lack of results. And Trump’s campaign isn’t commenting.", "This is what we did find: It appears that Trump is referring to a 2013 dinner hosted by a county Republican Party organization, which presented him with token gifts – including a statuette of Abraham Lincoln. But a former Republican congressman who organized the dinner said Trump did not receive an award, and the group has never given out “man of the year” awards.", "The boast is politically expedient; Michigan is a key swing state in presidential elections. When referencing the award, Trump often notes he was the first Republican presidential candidate to win Michigan since 1988. Trump also often mentions his narrow win in Michigan as critical to his upset victory.", "“For many many years nobody won Michigan as a Republican,” Trump said at the rally in New Hampshire on Aug. 15. “But I used to complain and you know I just — I’d go there and I’d say, they’re stealing your car business. I go, for years. In fact, five or six years before I even thought about running, for whatever reason they named me ‘man of the year’ in Michigan. I said, ‘How come?’ I didn’t even understand it myself. But I was named ‘man of the year.’ I wasn’t even political. That was years before I did this. But I was always complaining that our car business is being stolen.”", "As we said, it’s a claim Trump has made repeatedly for years, according to searchable records of Trump’s public comments archived by Factba.se.", "The earliest mention we could find was during a campaign speech Trump made two days before the election, on Nov. 6, 2016, in Sterling Heights, Michigan.", "“I’ve been fighting for the car industry for years,” Trump said. “I was honored five years ago, ‘man of the year’ in Michigan. That was a great honor for me. And during my speech, all I talked about is what Mexico and these other countries are doing to us, and especially what they’re doing to Michigan. That’s all I talked about. And I was criticized. They said, ‘Donald, speak about something else.’ I said, ‘No, what’s happening is horrible. What’s happening is terrible.’ One of the main reasons I ran for president is to stop it.”", "In one speech in Washington, Michigan, on April 28, 2018, Trump changed the award to Republican of the Year in Michigan.", "Trump, April 28, 2018. We have many, many car companies, you see what’s going on. Toyota, many companies are opening up in Michigan. The cars are coming back to Michigan. The plants are coming back, they’re being expanded. And by the way, do you remember about six years ago, I wasn’t even running and they gave me an award, The Republican of the Year. I guess they probably, maybe they knew what was gonna happen. I don’t know. I wasn’t running, long time ago. And I made a speech in Michigan thanking them for the award, saying, ‘How horrible. How did you let this happen where all of these plants closed, move to Mexico, they build the cars in Mexico, they sell them across the border, no tax, we lose the jobs, we lose the taxes, we lose everything. How did anybody let this happen?’ Guess what? Not happening anymore, folks.", "As we said, we could not find any such award bestowed on Trump (and neither could other news outlets, including CNN, Newsweek and HuffPost).", "We found that in 2014, the Somerset County Republican Organization in New Jersey honored Trump with the group’s “Republican of the Year” award. Trump’s award came after he developed Trump National Country Club in Bedminster, which is located in Somerset County. He also snagged Time magazine’s 2016 Person of the Year, and the Republican Party of Sarasota in Florida awarded Trump the organization’s “Statesman of the Year” in 2012.", "But Trump’s comments about the Michigan “man of the year” award are specific to that state.", "When boasting about the award, Trump usually mentions that he was given the award for speaking out about how U.S. auto jobs were foolishly being lost to Mexico. We reached out to the White House press office, which in turn referred us to Trump’s campaign. A spokesman at the campaign, however, declined to comment.", "But in mid-August, a former Republican congressman from Michigan stepped forward to correct the record.", "Former Rep. Dave Trott said Trump is referring to the Oakland County Republican Party’s Lincoln Day Dinner in 2013. Trott, who was chairman of the dinner, invited Trump to speak at the event. In an interview with Michigan Live, Trott recalled that Trump delivered a “rambling speech touching every topic under the sun.” Afterward, the organization presented Trump with a statuette of Abraham Lincoln, a framed copy of Lincoln’s Gettysburg Address and a tie, Trott said. But there was no award, he said.", "“I was the organizer and chair of that, and we weren’t handing out Man of the Year awards and never have,” Trott told the Detroit News. “That’s not part of the club’s mission.”", "Trott said he made the connection to the 2013 Lincoln Day Dinner because Trump referenced the “man of the year” award during a CEO roundtable in Ypsilanti, Michigan, on March 15, 2017. Trott, then-a congressman was in attendance, and Trump thanked him when discussing the award.", "“And I want to thank you Dave [Trott],” Trump said. “It’s true about about five or six years ago, I was given the ‘man of the year’ in Michigan. And I made a speech. I didn’t know I’d be doing this. I didn’t know I’d be running for president. I made a speech, I said, ‘Your car industry is being stolen from you.'”", "“Is that right?” Trump said, gesturing to Trott.", "Trott can be heard in the video responding, “Great speech.”", "Trump then continued, “And I spoke about it. And I think the people of Michigan never forgot that speech. And that’s why we’re here. And I want to thank you for your support. You were amazing, for a long time. Thank you, David.”", "Trott has since soured some on Trump. Trott said divisive comments made by Trump were a “factor” in his decision not to seek reelection in 2018.", "At the time of the roundtable, Trott told the Detroit News he didn’t immediately correct Trump, “Because I sure wasn’t comfortable correcting him in front of a group of automotive CEOs. It maybe would’ve been embarrassing to him. Maybe not. I don’t know. It would have been to me. I just nodded and said it was a great speech and pivoted to that. Which it was. The speech was very well-received.”", "“But now that I’m out of Congress,” Trott, an attorney, told CNN. “I feel comfortable correcting the story.”", "The context of Trump’s comments at the roundtable in Ypsilanti lends credence to the idea that Trump believes he received an award at the Lincoln Day Dinner in Michigan in 2013 — an event at which Trott says Trump was not awarded Michigan’s “man of the year.”", "Trump’s claim is vague enough — he hasn’t provided an exact year or the name of the organization that supposedly honored him — that it makes it nearly impossible to entirely disprove. But the responsibility to back-up political claims rests with the politicians who made them, and in this case, neither the White House nor Trump’s presidential campaign has provided any information on the president’s boast. If any such proof ever emerges, we’ll update our story.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]