["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Donald Trump", "Continuing his post-election barrage of misinformation, President Donald Trump revived a previously debunked voter fraud claim about Wisconsin on Twitter.", "He shared a chart Nov. 18, 2020, showing a jump in the number of votes for Democrat Joe Biden about 3:30 a.m. Nov. 4, the morning after the election. He added this commentary:", "\"Look at this in Wisconsin! A day AFTER the election, Biden receives a dump of 143,379 votes at 3:42AM, when they learned he was losing badly. This is unbelievable!\"", "Sigh.", "This jump is actually very believable — and was entirely expected.", "An array of similar claims surfaced in the days after the election, most based on errant assumptions around a chart from FiveThirtyEight.com that showed a sharp uptick in Biden votes in the wee hours of Nov. 4.", "A conservative website trumpeted this as \"Voter Fraud in Wisconsin.\" One widely shared Facebook post called it a \"ballot dump,\" while another referred to the votes as being \"found.\" Trump also asserted Nov. 4 that his lead in key states \"started to magically disappear as surprise ballot dumps were counted.\"", "Those claims led to unanimous debunking from an array of fact-checking organizations, including USA TODAY, PolitiFact, AFP and Reuters.", "But since Trump has raised the issue yet again, with a slightly different chart, let’s review why this claim is absurd.", "That 3:30 a.m. change simply shows the time when the City of Milwaukee reported its absentee ballot results.", "This wasn’t surprising because:", "Milwaukee is a longtime Democratic stronghold. In 2016, Hillary Clinton won the city of Milwaukee 77%-18%.", "We knew well before the election that Democrats were much more likely than Republicans to vote absentee. Polling showed 81% of the people planning to vote absentee in Wisconsin supported Biden.", "We knew it was going to take a long time to count the absentee ballots, leading them to be reported later.", "Those absentee votes — a total of 170,000 in Milwaukee — were reported together because Milwaukee and 38 other Wisconsin communities used a central count location. Other communities counted absentee ballots at the polling places and reported them earlier along with their in-person vote totals.", "The ballots took that long to process at central count because Wisconsin law bans clerks from tallying absentee ballots before Election Day. Clerks from both parties have pushed for years for a change in state law, but Republicans who run the Legislature refused to address the matter.", "As a result, Claire Woodall-Vogg, the executive director of the Milwaukee Election Commission, said months before the election she didn’t expect to finish that count until the early morning hours of Nov. 4.", "And that’s exactly what happened.", "From 3:26 to 3:44 a.m. in The Associated Press election reporting stream, the vote for Biden jumped by 149,520 (9.2% of Biden's total votes) and Trump's vote jumped by 31,803 votes (2% of his total votes). Milwaukee County accounted for nearly all of that jump.", "The fact that Trump was \"ahead\" before that batch was reported —  as highlighted in Trump’s tweet —  is immaterial. At that point all the votes hadn’t been counted yet.", "It would be like trying to end a football game when your favorite team is ahead after the third quarter.", "So Trump’s number may be roughly right. But his explanation of what it means is completely wrong.", "Trump said Nov. 18 that Wisconsin received a \"dump\" of Biden votes, asserting this is \"unbelievable\" and evidence of fraud.", "But it’s just evidence of someone who doesn’t understand the vote counting process in Wisconsin.", "That jump in Biden votes is when Milwaukee reported its 170,000 absentee ballots all at once. We knew long before the election this group would be reported late together and would weigh heavily in Biden’s favor.", "We rate this claim Pants on Fire!", "Donald Trump, tweet, Nov. 18, 2020", "Instagram post, Nov. 4, 2020", "FiveThirtyEight.com, tweet, Nov. 4, 2020", "Donald Trump, tweet, Nov. 4, 2020", "Marquette University Law School Poll, New Marquette Law School Poll finds Biden holding a steady lead over Trump in Wisconsin, Aug. 11, 2020", "PolitiFact Wisconsin, Split in voting methods puts COVID, mail center stage in Wisconsin, Oct. 10, 2020", "USA TODAY, Fact check: That spike in the Wisconsin vote tally was expected and legitimate, not fraud, Nov. 4, 2020", "PolitiFact, Social media post falsely claims Wisconsin 'found' 112,000 votes at 3 a.m., Nov. 4, 2020", "Milwaukee Journal Sentinel, Biden declared winner in Wisconsin with 20,000 vote margin; Trump campaign vows request for recount, Nov. 4, 2020", "Milwaukee Journal Sentinel, Wisconsin likely won't have presidential results on election night, Sept. 17, 2020", "Milwaukee Election Commission, November 8, 2016 - Fall General Election", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]