["About this rating", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "At the end of 2020, critics of government-imposed lockdowns on U.S. businesses and schools to prevent the spread of COVID-19 circulated posts alleging a new study found people who tested positive for the virus but did not show symptoms were not contagious.", "The posts framed the alleged research as evidence that rules on social distancing in public spaces, such as restaurants and schools, were unnecessary given the assumption that symptomatic COVID-19 patients would stay home to rest, regardless of lockdown measures.", "Around the same time, a website, LifeSiteNews, published the following headline supposedly reporting similar findings of a separate study out of Wuhan, China: \"Asymptomatic transmission of COVID-19 didn't occur at all, study of 10 million finds.\"", "Numerous Snopes readers contacted us to investigate the validity of the purported research and to determine whether scientists indeed concluded asymptomatic or presymptomatic COVID-19 patients did not transmit the virus to others.", "Firstly, we will summarize the scope and objectives of both research projects. Researchers with doctorate degrees in biostatistics from the University of Florida, University of Washington, and Seattle's Fred Hutchinson Cancer Research Center authored the Dec. 14 analysis to which conservative commentator Tomi Lahren refers in the above-displayed tweet criticizing lockdown restrictions.", "Rather than conducting physical experiments or observing themselves, the scientists compiled 54 already-existing studies, including more than 78,000 people for their conclusions.", "But here's a widely misrepresented element of the research: The studies to which the scientists referred did not look at how the virus spreads from person to person in public settings. Rather, the research interrogated how, or to what severity, members of the same household pass the virus to each other. The report obtained by Snopes via the American Medical Association's JAMA Network read:", "The World Health Organization China Joint Mission reported human-to-human transmission in China largely occurred within families, accounting for 78% to 85% of clusters in Guangdong and Sichuan provinces. [...]", "The household secondary attack rate characterizes virus transmissibility. Studies can collect detailed data on type, timing, and duration of contacts and identify risk factors associated with infectiousness of index cases and susceptibility of contacts. Our objective was to estimate the secondary attack rate of SARS-CoV-2 in households and determine factors that modify this parameter.", "In other words, it was a false characterization of the report, no mater its findings, to frame it as proof of how the virus spreads in any setting other than homes.", "That mischaracterization aside, however, the claim that no asymptomatic or presymptomatic patient passed the virus on, or that the research proved that only symptomatic COVID-19 patients perpetuated the pandemic, were the most egregious errors in the claim casting doubt on lockdowns.", "By analyzing the dozens of studies, the scientists concluded symptomatic patients carried the highest risk of spreading the virus to other people, yet a small number of people appeared to have caught the virus from patients without symptoms. The report read:", "We found significantly higher secondary attack rates from symptomatic index cases than asymptomatic or presymptomatic index cases, although less data were available on the latter. The lack of substantial transmission from observed asymptomatic index cases is notable. However, presymptomatic transmission does occur, with some studies reporting the timing of peak infectiousness at approximately the period of symptom onset.", "The finding's emphasis on the lack of data on the particular matter (comparing symptomatic transmission spread with the rate of other patients) matched a Nov. 18 analysis by scientist journalist Bianca Nogrady in Nature Communications. It said:", "Now, evidence suggests that about one in five infected people will experience no symptoms, and they will transmit the virus to significantly fewer people than someone with symptoms. But researchers are divided about whether asymptomatic infections are acting as a ‘silent driver’ of the pandemic.", "Nonetheless, public health officials urged all people to wear masks and practice social distancing until scientists learn more about how respiratory droplets containing the virus spread among all types of infected people.", "The World Health Organization (WHO) stresses on its website that all infected people — regardless of whether they show symptoms — can spread COVID-19. \"While someone who never develops symptoms can pass the virus to others, it is still not clear how frequently this occurs and more research is needed in this area,\" WHO stated at the time of this report.", "Meanwhile, the Centers for Disease Control reported on Nov. 20 that scientists estimated asymptomatic or presymptomatic patients accounted for more than 50% of the virus' transmissions.", "Now, let us look at the Nov. 20 study cited in the article on LifeSiteNews, which describes itself as a pro-life news site for Catholics. We found the original version of the paper via the scientific journal Nature Communications.", "Per that edition, two dozen scientists looked at how the virus did or did not impact 9,899,828 Wuhan residents between May 14 and June 1 — more than a month after the government lifted its lockdown to curb the outbreak. According to WHO, the city's restrictions were the strictest in the world, prohibiting all traveling, monitoring out-and-about residents at checkpoints at road junctions, and requiring everyone to self isolate.", "That said, it was a misrepresentation of the study's findings — no matter what they were — to frame them as applicable to the United States, where a patchwork of county and state governments issued a range of policies to contain the virus. For examples, a portion of local jurisdictions implemented mandatory stay-at-home orders (the closest lockdowns to Wuhan's), while others issued advisories or recommendations for people to avoid unnecessary traveling or did nothing of the sort. Additionally, some of those restrictions remained in effect as of this report.", "The scientists found that, of Wuhan's roughly 10 million residents, the vast majority did not test positive for COVID-19. Of the approximately 300 people who did test positive, none displayed any symptoms.", "Then, using tracing technology, the research group analyzed the health conditions of 1,174 people who spent time with the 300 asymptomatic or presymptomatic patients. No one within that group of some 1,200 people tested positive.", "In sum, while the studies proved the rate of transmission between presymptomatic or asymptomatic COVID-19 patients appeared to be lower than that of symptomatic patients, the research did not confirm that infected people carry no risk of spreading the virus. In fact, public health officials say all COVID-19 patients, regardless of whether they show symptoms, are contagious. For those reasons, we rate this claim \"False.\"", "Jessica Lee is Snopes' Senior Assignments Editor with expertise in investigative storytelling, media literacy advocacy and digital audience engagement.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]