["About this rating", "On and around Feb. 16, 2021, Texans across the state were dealing with a deadly arctic blast that brought below-freezing temperatures and knocked power out for millions of residents struggling to keep warm.", "Amid this desperation and chaos, Mayor Tim Boyd of Colorado City, a small city in the western portion of the state, shared a belligerent Facebook post telling residents that in his opinion, they should be fending for themselves instead of expecting the government to use their tax dollars to help them through the disaster.", "Boyd has deleted the Facebook post — and we couldn't locate his Facebook page — but local TV news stations caught it and took screenshots, which were shared widely on social media:", "The full text of Boyd's original post read:", "No one owes you or your family anything; nor is it the local governments responsibility to support you during trying times like this! Sink or swim, it’s your choice! The City and County, along with power providers or any other service owes you NOTHING! I’m sick and tired of people looking for a damn hand out! If you don’t have electricity you step up and come up with a game plan to keep your family warm and safe. If you have no water you deal with out and think outside of the box to survive and supply water to your family. If you were sitting at home in the cold because you have no power and are sitting there waiting for someone to come rescue you because your lazy is direct result of your raising! Only the strong will survive and the weak will parish [sic]. Folks, God Has given us the tools to support ourselves in times like this. This is sadly a product of a socialist government where they feed people to believe that the FEW work and others will become dependent for handouts. Am I sorry that you have been dealing without electricity and water; yes! But I’ll be damned if I’m going to provide for anyone that is capable of doing it themselves! We have lost sight of those in need and those that take advantage of the system and mesh them into one group!! Bottom line, quit crying and looking for a handout! Get off your ass and take care of your own family!", "Bottom line - DON’T BE A PART OF A PROBLEM, BE A PART OF THE SOLUTION!", "In a follow-up post shared by TV news station KTXS, Boyd stated that in light of the backlash against his comments, he resigned as mayor. He also said he didn't file paperwork to run again and added, \"Please understand if I had it to do over again I would have just kept my words to myself and if I did say them I would have used better wording and been more descriptive.\"", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]