["MSNBC anchor Alison Morris came under fire this week after allegations that she used a racial slur on air while covering the tragic Kobe Bryant helicopter crash.", "During her report on Jan. 26, Morris flubbed the word \"Lakers,\" leading some people to believe she stuttered the N-word. A Change.org petition calling for Morris’ resignation has received more than 145,000 signatures as of Jan. 29.", "And now a blog post has gone viral on Facebook with a false headline that claims Morris was fired over the incident: \"MSNBC Reporter allegedly fired over racial slur while reporting on TV￼.\" The headline has been viewed by more than 13.8 million people on Facebook as of Jan. 29.", "The story was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "This isn’t accurate –– Morris has not been fired. She apologized on Twitter, saying the flub was an accident and not a racial slur.", "You can listen to the video yourself below.", "OMG!!!!!MSNBC ANCHOR USES THE \"N\" WORD WHEN REFERRING TO THE L.A. LAKERS ON LIVE BROADCASTMSNBC Reporter, Alison Morris on \"LIVE WITH ALISON MORRIS\" @ 12:19pm, SUNDAY JAN 26, 2020 actually referred to the L.A. LAKERS as \"THE LOS ANGELES NI@%#*$\" pic.twitter.com/vozhmUzfFJ", "The blog post, published on a Wordpress page called \"Peterson Breaking News of Trenton,\" displays a photograph of Morris –– and while the headline claims she was fired –– the story doesn’t mention it.", "The article only talks about the viral flub and Morris’ subsequent apology on Twitter:", "Earlier today, while reporting on the tragic news of Kobe Bryant’s passing, I unfortunately stuttered on air, combining the names of the Knicks and the Lakers to say “Nakers.” Please know I did not & would NEVER use a racist term. I apologize for the confusion this caused.", "We found no credible report claiming Morris has been fired. MSNBC has not released a statement about the incident or a change in Morris’ employment. The cable channel did not respond to a request for comment.", "Without evidence, this claim rates False.", "Archive.org, PetersonBreakingNewsofTrenton, MSNBC Reporter allegedly fired over racial slur while reporting on TV￼, Jan. 27, 2020", "Twitter, Alison Morris tweet, Jan. 26, 2020", "NBC 4, More than 100K sign petition for MSNBC anchor to be fired after racial slur allegation, Jan. 28, 2020", "CheatSheet.com, Kobe Bryant: Did MSNBC's Alison Morris Call His Team the N-Word?, Jan. 29, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]