["About this rating", "On 16 October 2016, Twitter user \"@randygdub\" claimed that he worked for the United States Postal Service (USPS) in Columbus, Ohio, and enjoyed \"ripping up\" absentee ballots cast for Donald Trump:", "i love working at the post office in Columbus, Ohio and ripping up absentee ballots that vote for trump", "— raandy (@randygdub) October 16, 2016", "The tweet went viral and provoked significant outrage, prompting several web sites to inaccurately report that a USPS employee was \"caught\" ripping up Trump ballots.  The person who tweeted this was not a confirmed postal worker, much less caught in the act. Many people in the angry camp apparently did not view the rest of @randygdub's tweets, which are inconsistent and apparently published solely to cause controversy:", "i am a Black man for trump. that's right libs, we do exist pic.twitter.com/TXx9lX7kM4 — raandy (@randygdub) October 12, 2016", "eat shit stupid baby pic.twitter.com/iD2xvOgtG8", "— raandy (@randygdub) October 4, 2016", "The user posted no proof of employment with USPS or any organization, nor was his story particularly plausible:", "@CassandraRules That person is part of \"Weird Twitter.\" They're lying and don't actually work at a post office. — Ian Miles Cheong (@stillgray) October 17, 2016", "We contacted the Franklin County Board of Elections and the Ohio Secretary of State's Elections division and asked about the mailing format of Ohio's absentee ballots. They told us that Ohio's absentee ballots are enclosed in not one but two secrecy envelopes, making it impossible for postal workers to identify \"Trump votes\" without opening envelopes:", "Nevertheless, @USPSHelp was deluged with complaints. A representative confirmed that the Postal Service investigated and determined that \"Raandy\" was most likely not an employee:", "The Postal Service has completed an initial investigation of the mentioned tweets and does not believe these tweets were made by a postal employee. However, the Postal Service will continue to monitor this situation and if it is determined that the individual making the tweets is a postal employee and there is substantiated evidence of mail being tampered with or destroyed , then the Postal Service will take appropriate corrective action to address the situation. Thank you ^cmm", "Although many web sites framed the claim to suggest that a USPS employee had been caught ripping up ballot envelopes which contained Trump votes, the claim appeared on social media without any proof to substantiate it.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]