["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "As the Florida legislature neared the finish line this spring, some legislators were in a hurry to increase the speed limit on major highways to 75 mph. But there was plenty of debate about whether the state should put on the brakes.", "SB 392 cleared the Senate, but the House was split during its April 30 debate, with many arguing that the bill was moving too fast. House sponsor Rep. Matt Caldwell, R-Lehigh Acres, waved off opponents, disputing concerns that the higher speed posed a danger. (The legislation eventually passed 58-56.)", "\"I have yet to see any incontrovertible proof that speed, in and of itself, is the contributing factor to increasing fatalities,\" he said.", "We wondered: Is speed alone a factor in higher car crash fatalities? Let’s take this claim for a test drive.", "Pedal to the metal", "The first thing to note about the legislation is that it doesn’t decree an increase in the current 70 mph limit. Rather, Caldwell said, it allows the Florida Department of Transportation the ability to raise limits as high as 75 if they deem that advisable under the right conditions.", "So how do engineers determine the proper speed limit? They use something called the 85th percentile rule, a widely accepted formula that dictates the safest speed is the one at which 85 percent of drivers travel. (You can read more about the 85th percentile rule here.)", "Caldwell said that considering the speeds at which most Floridians travel, and given normal conditions (sunny, dry roads, etc.), 75 was an acceptable limit. And he argued that raising the speed alone was not going to increase fatalities.", "\"There’s certainly a huge correlation between speed and accidents,\" he told PolitiFact Florida. \"The real question is whether that’s the real cause of accidents.\"", "Factoring in more factors", "We checked with the National Highway and Transportation Safety Administration and the Florida Department of Highway Safety, which both referred us to the Florida Highway Patrol, since they’re the ones who would have to deal with future increases in state speed limits.", "Public affairs officer Steve Gaskins said the FHP had reached out to other states that increased their speed limits and didn’t find a dramatic impact impact on the number of fatal crashes.", "Gaskins said there were three other factors that caused crashes:", "-- Impairment (drunken or drugged driving)", "-- Distraction (texting, talking, putting on makeup, etc.)", "-- Aggressiveness (swerving, road rage and so on)", "Russ Rader, the vice president of communications of the Insurance Institute for Highway Safety, said it was wrong to discount the effects of speed on a crash. He pointed specifically to a 2002 study that said 23 states that raised limits to 70 or 75 mph ended up with 35 and 38 percent more deaths per million vehicle miles traveled, respectively.", "But Rader acknowledged while speed is a problem, it’s not usually the only problem in fatal accidents.", "\"Crashes rarely have a solo cause. But higher speeds exacerbate other factors,\" he said. \"It’s clear from decades of research that when speed limits go up, crash risk goes up, and the crashes that happen are more likely to be deadly.\"", "The Council of State Governments in 2013 noted that while lawmakers and researchers can agree higher speeds cause more deadly accidents because of the physics involved, \"Intense debate still surrounds the idea that speed-limit hikes alone make roadways more dangerous.\"", "The National Highway Traffic Safety Administration reported last year that the number of speeding-related deaths through 2011 has been dropping steadily, but maintained a steady 31 or 32 percent of total fatal accidents over several years.", "Michael Knodler, associate professor at the University of Massachusetts Amherst College of Engineering, agreed that blaming speed increases alone is a difficult way to frame a public safety discussion.", "\"This is certainly something up for debate. If you backed me into a corner I could defend either case,\" he said.", "Speed variance is a much more pertinent issue in fatal accidents, he said. If the speed limit is 70 and everyone’s going 90, for example, the difference in the speed among cars is the dangerous factor.", "Knodler did stop short at Caldwell’s use of \"incontrovertible,\" though, saying the concrete physics of increased speed proves that speed does cause more fatalities in accidents.", "Those two concerns -- differences in speed and the effects of higher speeds on the severity of accidents -- still don’t mean more fatal accidents will happen, University of Kentucky transportation engineering professor Reginald Souleyrette told PolitiFact Florida.", "Souleyrette worked on a 2005-10 study of Iowa’s move to increase their speed limit to 70. Initial findings showed there was a slight increase in fatal and serious accidents, but in the long run crash rates went down.", "\"If what the representative implies is true, there should be no speed limit at all. … He is correct if he is implying that we should set ‘appropriate’ speed limits. There is no magic safe speed,\" Souleyrette said.", "Our ruling", "Caldwell said he had \"yet to see any incontrovertible proof that speed, in and of itself, is the contributing factor to increasing fatalities.\"", "Traffic studies and experts agree that higher speeds can lead to more fatalities in accidents, which makes Caldwell’s use of the word \"incontrovertible\" suspect. But opinions diverge when discussing whether higher speeds are the cause of those fatal accidents.", "Speed is no doubt a factor in accidents, but it’s rarely considered the factor leading to fatal crashes.", "We rate his statement Half True.", "Tampa Bay Times, \"Divided Florida House okays 75 mph speed limit,\" April 30, 2014", "National Highway Traffic Safety Administration, \"The Effect of Increased Speed Limits in the Post-NMSL Era,\" February 1998", "National Highway Traffic Safety Administration, \"An Analysis of Speeding-Related Crashes: Definitions and the Effects of Road Environments,\" February 2009", "Insurance Institute for Highway Safety, \"Relation of Speed and Speed Limits to Crashes,\" June 2005", "National Highway Traffic Safety Administration, \"Traffic Safety Facts, 2011 Data,\" April 2013", "Council of State Governments, \"States Raise Speed Limits while Safety Debate Continues,\" June 21, 2013", "PolitiFact Wisconsin, \"Robin Vos says higher speed limits on rural interstates have proven safe in nearby states,\" Sept. 1, 2013", "Time, \"End of the road for speed traps?,\" Sept. 2, 2013", "KSL TV, \"Studies show higher speed limits do not increase accidents,\" Sept. 5, 2013", "South Florida Sun-Sentinel, \"Raise speed limits on long, open roads,\" Dec. 2, 2013", "Insurance Institute for Highway Safety, Speed Q&A, accessed May 5, 2014", "Federal Highway Administration, \"Speed Concepts: Informational Guide,\" accessed May 5, 2014", "Federal Highway Administration, \"The Safety Impacts of Differential Speed Limits on Rural Interstate Highways,\" accessed May 5, 2014", "National Motorists Association, \"The Effects of Raising and Lowering the Speed Limit,\" accessed May 5, 2014", "Federal Highway Administration, \"Methods and Practices for Setting Speed Limits: An Informational Report,\" accessed May 6, 2014", "Federal Highway Administration, \"Federal Policy on Speeding,\" accessed May 7, 2014", "Iowa Department of Transportation, \"Evaluation of Iowa’s 70 mph Speed Limit,\" December 2010", "Interview with Matt Caldwell, Florida state representative, May 5, 2014", "Interview with Steve Gaskins, Florida Highway Patrol public affairs officer, May 5, 2014", "Interview with Russ Rader, Insurance Institute for Highway Safety spokesman, May 5, 2014", "Interview with Michael Knodler, University of Massachusetts Amherst College of Engineering associate professor, May 8, 2014", "Interview with Reginald Souleyrette, University of Kentucky College of Engineering professor, May 9, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]