["Madagascar's president made headlines in April when he unveiled a herbal tea, marketed as Covid-Organics, that he touts as a powerful remedy against the novel coronavirus.", "AFP Fact Check recently debunked allegations that Rajoelina had accused the WHO of offering a $20 million bribe to poison the infusion.", "Now a new claim has emerged about the president urging fellow Africans to quit the Geneva-based health agency.", "A Facebook post claiming Rajoelina \"called on all African Nations to quit the World Health Organization\" has been shared more than 600 times since it was published on May 15, 2020.", "\"Africa has found a medicine against Coronavirus but Europe thinks they have a monopoly of intelligence as such they are refusing to acknowledge it,\" the post quotes him as saying.", "\"The Malagasy president says, Europe created organizations with the desire for Africans to remain dependent on them,\" it adds.", "Other Facebook posts archived here, here and here have shared the claim.", "Rajoelina has widely distributed Covid-Organics in his Indian Ocean island nation and exported it to many parts of Africa.", "The drink is derived from artemisia -- a plant with proven anti-malarial properties -- and other indigenous herbs. The remedy was developed by the state-run Malagasy Institute of Applied Research but has not been tested internationally.", "The World Health Organization pointed to the lack of scientific studies to support the Madagascan tonic.", "\"We would caution and advise countries against adopting a product that has not been taken through tests to see its efficacy,\" the WHO's Africa Director Matshidiso Moeti said in a press briefing on May 7.", "In a separate statement, the WHO said it recognised that \"traditional, complementary and alternative medicine has many benefits\" and played an important part in providing care to African populations.", "However, it said that artemisia -- which has proven effective in treating malaria -- \"should be tested for efficacy and adverse side effects\".", "\"Africans deserve to use medicines tested to the same standards as people in the rest of the world,\" it said.", "Madagascar has recorded 488 cases of COVID-19, including two deaths, according to an AFP tally on May 25, 2020.", "Contacted by AFP Fact Check on May 14, Madagascar’s presidency rejected the comments attributed to Rajoelina.", "\"The presidency of Madagascar formally denies all these allegations. Since the launch of the Covid-Organics remedy, many words have been falsely attributed to President Andry Rajoelina. We firmly condemn these false quotes,\" presidency spokeswoman Lova Ranoramoro said.", "AFP Fact Check also found no evidence of Rajoelina calling on other African states to leave the WHO in news reports or on social media, where he posts regular updates.", "In an interview on May 11, 2020 -- days before the claims started circulating on Facebook -- Rajoelina criticised the WHO for refusing to endorse his remedy.", "\"If it wasn't Madagascar, and if it was a European country that had actually discovered this remedy, would there be so much doubt? I don't think so,\" he told France 24 and Radio France Internationale (RFI).", "\"I think the problem is that (the drink) comes from Africa and they can't admit... that a country like Madagascar... has come up with this formula to save the world.\"", "\"No country or organisation will keep us from going forward,\" he said.", "However, he did not threaten to pull Madagascar out of the WHO or call on other African states to leave the UN body.", "Rajoelina and the WHO have since confirmed they were engaged in talks to collaborate in the fight against the pandemic.", "On May 21, Rajoelina hailed a \"successful exchange\" with WHO chief Tedros Adhanom Ghebreyesus and said the UN agency would sign a confidentiality clause for the formulation of Covid-Organics.", "Successful exchange with @DrTedros who commends #Madagascar’s efforts in the fight against #Covid19.@WHO will sign a confidentiality clause on the formulation of the #CovidOrganics and will support the clinical observations process in #Africa. pic.twitter.com/SCZZRDKheV", "Ghebreyesus tweeted that he and the Madagascan leader had \"agreed that solidarity is key to fighting the pandemic and keeping the world safe\".", "Good call with @SE_Rajoelina, President of #Madagascar, about the #COVID19 situation in his country. We discussed how to work together on therapeutics research and development. And we agreed that solidarity is key to fighting the pandemic and keeping the world safe.", "Several African nations including Tanzania and Nigeria have expressed interest in the remedy.", "South Africa’s Health Minister Dr Zweli Mkhize pledged to help Madagascar to scientifically test the herbal remedy.", "Madagascar herbs: We received a call from the government of Madagascar, who asked for help with scientific research.Our scientists would be able to assist with this research.We will only get involved in a scientific analysis of the herb. We are not at that point yet.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]