["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Democratic presidential candidate Sen. Amy Klobuchar, D-Minn., center speaks during a Democratic presidential primary debate, Wednesday, Nov. 20, 2019, in Atlanta. (AP", "Minnesota Sen. Amy Klobuchar trotted out statistics at the November Democratic presidential candidates’ debate — suggesting sweeping majorities oppose some of the abortion and reproductive health care policies backed by the Trump administration.", "\"Over 70% of the people support Roe vs. Wade. Over 90% of the people support funding for Planned Parenthood, and making sure women can get the health care they need,\" Klobuchar said.", "Those are large numbers for one of the nation’s most polarizing issues. So we decided to take a look and found that Klobuchar was correct in expressing public opinion on Roe vs.Wade, but overstated support for Planned Parenthood funding.", "Roe v. Wade", "On 70% supporting Roe vs. Wade, Klobuchar’s statistic holds up.", "An NPR/PBS NewsHour/Marist poll from this past June found that 77% of Americans wanted Roe vs. Wade upheld — though within that group, some support expanding circumstances in which abortion is legal, and others would like more restrictions. (The landmark court ruling is the basis for a women’s right to an abortion.)", "Another poll, conducted in 2018, found a similar figure: 71% of respondents told NBC/Wall Street Journal pollsters that they opposed overturning the legal standard.", "Funding Planned Parenthood", "We couldn’t find any specific polling evidence for Klobuchar’s 90% statistic of support for Planned Parenthood. In fact, we found evidence indicating the support here is lower.", "A majority of Americans do want the government to fund the network of clinics, which provides abortions but also many other health care services to mainly low-income women. This takes two forms: Planned Parenthood can bill government health plans for non-abortion services — since federal law blocks taxpayer dollars from paying directly for abortions — and means Planned Parenthood clinics are eligible for funding from the federal Title X program, which supports low-income women’s access to contraception.", "Right now, Planned Parenthood is not accepting any Title X funding because the Trump administration has banned the program’s grantees from referring patients for abortions.", "Polling from this past April by the Kaiser Family Foundation found that 73% believe \"the government should continue paying Planned Parenthood for non-abortion services provided to people on Medicaid.\" (Kaiser Health News is an editorially independent program of the foundation.)", "A January 2017 poll by Quinnipiac found a lower figure: 62% opposed cutting off government funding to Planned Parenthood. When respondents learned that those dollars didn’t fund abortion, support went up to 80%.", "Klobuchar’s campaign highlighted polling by progressive polling group PerryUndem. The poll does reference opposition of 90% against something related to defunding Planned Parenthood, but it’s different than what Klobuchar said.", "The question refers to adults who opposed an agenda that \"includes defunding Planned Parenthood,\" but also includes steps such as nominating Supreme Court Justices who expressly oppose abortion. Even PerryUndem found that, on the specific issue of of defunding Planned Parenthood, 70% of respondents expressed opposition.", "Those are significant numbers for what has long been a lightning rod of the culture wars. But they aren’t the statistic Klobuchar cited.", "Our ruling", "Klobuchar cited two statistics at the debate: More than 70% of Americans support Roe vs. Wade, and more than 90% support funding Planned Parenthood.", "Both these ideas appear to have majority support. But we couldn’t find compelling evidence for the 90% figure — polls focused on this particular issue suggest support is somewhat lower.", "With one of these statistics correct, and the other based on a different, broader polling question, we rate this claim Half True.", "Email exchange with Klobuchar for President campaign staff, Nov. 20, 2019.", "KHN, \"HHS Finalizes Rule Seeking To Expel Planned Parenthood From Family Planning Program,\" Feb. 22, 2019.", "KFF, \"Public Opinion on Women’s Health and Preventive Care,\" Oct. 4, 2019.", "KFF, \"KFF Poll: Public Opinion and Knowledge on Reproductive Health Policy,\" May 3, 2019.", "FiveThirtyEight, \"Many Republicans Don’t Like Planned Parenthood — But They Don’t Mind Birth Control,\" Aug. 28, 2019.", "NPR, \"Poll: Majority Want To Keep Abortion Legal, But They Also Want Restrictions,\" June 7, 2019.", "PerryUndum, \"PerryUndum Gender Equality Report,\" Jan. 17, 2017.", "Quinnipiac University Poll, \"Use A Scalpel, Don't Amputate Obamacare, U.S. Voters Tell Quinnipiac University National Poll; Voters Oppose Fund Cut For Planned Parenthood 7-1,\" Jan. 27, 2017.", "The Wall Street Journal, \"Record 71% of Voters Oppose Overturning Roe v. Wade,\" July 23, 2018.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]