["About this rating", "On 1 January 2018, the Patriot Post published an article reporting that former First Lady Michelle Obama had been arrested by DC Metro police following a 911 call over her acting “unpredictably violent”:", "Michelle Obama was taken into custody by the DC Metro police Monday evening around 9 PM, according to a clerk inside the 9th Street booking station. Police scanner logs from the time confirm that 4 cruisers were sent to the Obama mansion after a 911 call from a “young girl,” presumably Sasha Obama.", "There is no official record of an arrest yet, but preliminary reports say that Michelle Obama was “unpredictably violent” and that she was definitely taken from the home in handcuffs.", "The next day, the reaganwasright.com web site posted a follow-up story reporting that Michelle's husband, former president Barack Obama, was injured by his wife but would not be pressing domestic abuse charges:", "Michelle Obama had herself a little fit of rage last night that woke the elite neighborhood surrounding their Washington, DC mansion. Michelle was so loud and so violent that the Secret Service almost ended up in a firefight with Metro PD. This morning, after having the night to cool off on a bench in a downtown police precinct, Michelle went home without being charged.", "The DC Metro Police say they have no comment as no actual arrest was made and no report was filed. The neighbors now say it was nothing more than a family squabble. Our source on the scene last night told us that Obama had to get between armed Secret Service agents and angry police and that he was “bleeding pretty steadily” from a couple of wounds. Michelle was allegedly brought kicking and screaming to a waiting cruiser.", "None of this was true. Both reports originated solely with the Patriot Post and reaganwasright.com, two sites that are part of a network of fake news sites which deal in political clickbait trolling and falsely label themselves as \"satire\":", "Potatriot Post is a whimsical playland of conservative satire.", "Everything on this website is fiction. It is not a lie and it is not fake news because it is not real. If you believe that it is real, you should have your head examined. Any similarities between this site’s pure fantasy and actual people, places, and events are purely coincidental and all images should be considered altered and satirical.", "Eagleton, Flagg.   \"Barack Obama Won’t Press Charges Against Michelle for Domestic Abuse.\"\r\n    reaganwasright.com.   2 January 2018.", "Eagleton, Flagg.   \"Michelle Obama Arrested for Domestic Violence.\"\r\n    Patriot Post.   1 January 2018.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]