["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A viral blog post claims that a man who won the lottery was arrested \"for getting $224,000 worth of manure dumped on his former employer’s property.\" Published on World News Daily Report, the post claims that a 54-year-old Clarendon Hills, Ill., resident named Brian Morris bought over 20,000 tons of manure after winning $125 million at Powerball Multi-state lottery two weeks before.", "This story was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.) The post received over 2.3 million interactions and had been shared over 285,000 times, CrowdTangle data show.", "While Clarendon Hills is a village in DuPage County in Illinois, there’s little else of the post that’s true.", "The post features a mugshot of a man laughing as he holds up a placard from the Clarendon Hills Police Department that shows his booking number.", "A search for the image shows the photo isn’t of a man named Brian Morris. The photo is of Ronald Searl, who was arrested in 2014 for driving under the influence, according to WGN9.", "Another photo included in the World News Daily Report post is of two police officers. A Chicago Tribune article published May 16, 2018, notes that the photo depicts Clarendon Hills Police Chief Paul Dalen and recently-retired police chief Boyd Farmer.", "World News Daily Report notes in a disclaimer at the bottom of the website that readers should take their posts with a grain of salt:", "\"World News Daily Report assumes all responsibility for the satirical nature of its articles and for the fictional nature of their content. All characters appearing in the articles in this website – even those based on real people – are entirely fictional and any resemblance between them and any person, living, dead or undead, is purely a miracle.\"", "PolitiFact has found World News Daily Report’s stories false before.", "However, the hoax did make a real impact. According to the Chicago Tribune, the post had been circulated throughout the Clarendon Hills community, and the police department received some calls inquiring about it in May.", "\"I guess it is humor to a certain extent, but people need to read to the bottom and find out it’s not a real news story,\" Village President Len Austin told the Chicago Tribune at the time. \"The problem these days is that people see a headline online and jump to conclusions.\"", "A viral World News Daily Report post claims that a lottery winner was arrested for dumping $200,000 of manure on his former boss’ lawn. While pulling photos from real news stories, the site itself admits that the article is satire.", "We rate this claim Pants on Fire!", "World News Daily Report, \"Lottery winner arrested for dumping $200,000 of manure on ex-boss' lawn,\" accessed Nov. 2, 2018", "Chicago Tribune, \"Fake news in Clarendon Hills: How a satirical story about manure duped thousands of readers,\" May 16, 2018", "WGN9, \"Man arrested for DUI laughs in mug shot,\" July 11, 2014", "Chicago Tribune, \"Westmont village manager charged with DUI: cops,\" July 11, 2014", "Village of Clarendon Hills website, accessed Nov. 2, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]