["Stone pelting and violence occurred between two groups in Ujjain, Madhya Pradesh on Friday (December 25) afternoon. According to reports, Hindu groups in Ujjain were carrying out a rally to collect donations for the construction of Ram Mandir. When the rally was passing through a Muslim-majority area, people from the Muslim community began stone-pelting. They claimed that inflammatory comments were made by Hindus participating in the rally thus, sparking the tension. However, the district administration refuted claims of inflammatory sloganeering.", "In the backdrop of this, a 25-second video is being widely shared on social media where a huge crowd with saffron flags can be seen. People are claiming that this video is from Ujjain where Hindus gathered in a show of unity a day after the stone-pelting incident. (Archive link)", "कल जहा #पथराव किया गया था #उज्जैन मे” ये आज का #दृश्य है ये #हिन्दूओं की 💪 pic.twitter.com/QHKiBvLrWh", "— सुनीता हिन्दू (@Sunitaa101) December 27, 2020", "Similarly, many Facebook users have shared the video with identical captions suggesting that it is from Ujjain.", "We did a reverse image search on multiple keyframes of the viral video and found a Youtube video uploaded on April 13, 2019. Its title reads, “Gulbarga Ram navami 13_04_2019 New History create” and the location mentioned is Quadri Chowk.", "A white mosque can be spotted in the background. We looked for Quadri Chowk on Google Earth and found the same mosque, Bargah-e-Quadri Chaman. It is located in Karnataka’s Kalaburagi which is also known as Gulbarga. The mosque can be spotted at 16 seconds in the video. Several other images of the mosque can be found on Google Images.", "Furthermore, the white building seen in the video can also be seen on Google Earth.", "While Alt News waa unable to verify the date of the video, it is certainly not recent and was shot in Karnataka. The claim that Hindus groups in MP took out a unity procession after the stone-pelting incident of December 25 is false.", "Donate Now", "A journalist and a dilettante person who always strives to learn new skills and meeting new people. Either sketching or working.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]