["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "In this Friday, Dec. 5, 2014, file photo, Kirk Douglas poses for a portrait in Beverly Hills, Calif. Douglas turned 101 on Dec. 9, 2017. (AP)", "A death hoax has been circulating for months that actor Kirk Douglas died.", "\"Legendary actor Kirk Douglas dead, 4 days before his 101st birthday,\" stated a headline by Your Action News 3 which has circulated since December.", "Facebook users flagged the post as being potentially fabricated, as part of the social network’s efforts to combat online hoaxes. We found no evidence that the famous movie star had died.", "The fake story said that Douglas died of natural causes and that his family released a statement saying he \"went comfortably and was in no pain\" and \"lived a long and prosperous life that people only dream of.\"", "In 2014, People magazine accidentally published the actor’s obituary on its website.", "\"DO NOT PUB Kirk Douglas Dies\" the headline read. The magazine removed the obit from it's website after reports about the premature obit circulated on social media. Many news organizations pre-write obits of famous people.", "We searched for mainstream news reports about Douglas and found no reports that he had died. When Douglas turned 101 in December, the Daily Gazette in Schenectady, N.Y., where the actor’s sister lives quoted the actor’s niece Marilyn Gordon.", "\"Uncle Kirk is doing great,\" Gordon said. \"They're going to have a big party for him (Saturday).\"", "Douglas survived a helicopter crash in 1991 and a stroke in 1996.", "\"I never, ever thought I would live to be 100. That’s shocked me, really. And it’s sad, too,\" he said in a 2017 interview.", "We sent an email to Your Action News 3 and did not get a reply. Our fact-checking friends at Snopes have debunked other death hoaxes by the same website about Morgan Freeman, Bob Barker, and George Zimmerman.", "Douglas is still alive, despite a fake story that said he was dead. We rate this story Pants on Fire.", "Your Action News 3, \"Legendary actor Kirk Douglas dead, 4 days before his 101st birthday,\" Dec. 5, 2017", "The Daily Gazette, \"Kirk Douglas turns 101, will celebrate with party,\" Dec. 9, 2017", "Belleville News Democrat, \"Is Kirk Douglas from the Golden Age of Hollywood dead?\" Feb. 8, 2018", "The Hollywood Reporter, \"Top 10 Kirk Douglas Films Worth Watching,\" May 31, 2012", "Los Angeles Times, \"Douglas Hurt in Fatal Air Crash,\" Feb. 14, 1991", "The Guardian, \"Kirk Douglas: ‘I never thought I’d live to 100. That’s shocked me,’\" Feb. 12, 2017", "Huffington Post, \"People Magazine Accidentally Publishes Kirk Douglas Obit,\" Dec. 1, 2014", "Snopes, \"Kirk Douglas Death Hoax,\" Dec. 7, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]