["An Idaho congressional race has become a key battleground in the face-off between establishment and anti-establishment Republicans.", "In an attempt to tar its rival with an ideology-bending linkage, Defending Main Street is trying to tie Bryan Smith, the Tea Party challenger to GOP Rep. Mike Simpson, to — of all people — House Democratic leader Nancy Pelosi of California.", "\"Meet the DC insider launching misleading attacks about Mike Simpson,\" the ad says.", "Then, the ad plays a clip of Club for Growth president Chris Chocola saying, \"The person I respect the most in Washington might surprise you: It’s Nancy Pelosi.\"", "The narrator continues: \"His group spends more money trying to defeat Republicans than defeating Democrats. … And while personal injury attorney Bryan Smith and his financial backers help Pelosi, Mike Simpson is Nancy Pelosi’s worst nightmare.\"", "(Not to be outdone, Smith’s supporters are also trying to tie Simpson to Pelosi. We looked at that ad separately.)", "In this fact-check, we’ll review Club for Growth’s record in recent campaigns and see whether the ad accurately portrays what Chocola said about Pelosi.", "What is the Club for Growth?", "The Club for Growth has supported candidates who are focused on lowering taxes and easing regulations.", "The club has frequently ruffled feathers within the Republican establishment by endorsing primary challengers to GOP incumbents and by pushing Republicans further to the right in order to head off intra-party competition. For example, in Indiana’s 2012 primary, the club supported Richard Mourdock over longtime Republican Sen. Richard Lugar (Mourdock won the primary but lost the general election). Last year, the club strongly backed the government shutdown to defund Obamacare.", "In this campaign cycle, they’ve pumped more than $100,000 into Idaho to help Smith oust Simpson in the primary, according to the Center for Responsive Politics.", "In the ad, Defending Main Street says the Club for Growth spends more money fighting Republicans than Democrats. They have spent quite a bit — $11.5 million since 2011— running ads against Republicans. That’s about 55 percent of $21 million they’ve spent in the last four years.", "But the money spent against Republicans wasn’t in general elections to help Democrats, it was in primaries where Republicans had conservative challengers.", "They’ve also spent more than $5 million attacking Democrats and about $4.5 million running ads supporting Republicans.", "So it’s true that the group has challenged Republicans, but typically by boosting one Republican against another in GOP primaries.", "Respecting Pelosi", "And how about that quote from Club for Growth president Chris Chocola, a former GOP congressman from Indiana?", "The clip is taken from an American Enterprise Institute discussion called \"Tea party vs. establishment: Who is helping the right, and who is hurting it?\" (Chocola was debating Steve LaTourette, who helped create Defending Main Street.)", "Chocola was defending Club for Growth’s support for Sen. Ted Cruz, R-Texas, and like-minded conservatives in the House and Senate who last year pushed Congress to defund Obamacare even at the risk of a government shutdown.", "Here’s the transcript of Chocola’s remarks::", "\"The person I respect the most in Washington my surprise you: It’s Nancy Pelosi. The reason I respect Nancy Pelosi is because she had a historic job. She was the first woman speaker of the United States House of Representatives. And she woke up for 40 years saying, ‘I want to pass nationalized health care.’ And she got the job that she could get it done, and during the process she realized that public opinion polls never get close to 50 percent approval. ...", "\"But she got it done and she knew it would jeopardize her historic job. She could lose her job over doing what she believed. But she found a way to do it. Because she believed in it so strongly, it’s the law today. Is there a Republican you can think of that is willing to risk their job to do what they think is right? Is there a policy that they’re willing to fight on? … If you don’t like the tactic of Ted Cruz going to the floor and doing a filibuster, what’s yours? What’s your tactic besides surrender? Is it better fight, make a point and lose, or just surrender, making no point?’\"", "The full context makes it clear that what Chocola admired about Pelosi was her tactical ability  -- her singleminded willingness to pursue her goals in the face of great risks -- and not the substance of what she was fighting for. Chocola didn’t support Pelosi’s policies or Obamacare, but instead wished Republicans would follow her example and take firm stances to pass their priorities.", "And that’s a very different impression than one would get from the ad.", "The moderator of the debate, AEI fellow and Washington Examiner columnist Tim Carney, told PolitiFact that he never took Chocola’s statement to mean he had love for Pelosi.", "\"Main Street's ad struck me as totally misleading,\" Carney said. \"Chocola was clearly saying Republicans need to be as dedicated to their conservative beliefs as Pelosi is to her liberal beliefs. The Main Street ad clearly implies Chocola is a buddy of Pelosi, which was not at all the nature of his remarks.\"", "Our ruling", "There’s some truth to the claim that the Club for Growth tries to defeat Republicans. One of the club’s key strategies has been to put its money in Republican primaries in order to support the most aggressively conservative candidates. This means taking on some Republicans — but also supporting others.", "Meanwhile, Chocola clearly said what the ad said he did, but the ad takes that remark wildly out of context. Chocola was expressing admiration for Pelosi’s Machiavellianism, not supporting her political agenda. The statement contains some element of truth but ignores facts that would give a different impression, so we rate it Mostly False.", "Defending Main Street ad, \"Pelosi’s worst nightmare,\" April 17, 2014", "Center for Responsive Politics, Club for Growth Outside Spending Summary 2012, accessed May 6, 2014", "Center for Responsive Politics, Club for Growth Outside Spending Summary 2014, accessed May 6, 2014", "The Hill, \"Club for Growth pushes McConnell over health law shutdown threat,\" July 24, 2013", "Club for Growth, Candidate profiles: Bryan Smith, accessed May 6, 2014", "Washington Post, \"Club for Growth backs Rep. Simpson’s primary opponent,\" July 10, 2013", "Politico, \"Inside the Club for Growth's art of war,\" April 7, 2014", "Politico, No apologies from Club for Growth, Dec. 12, 2012", "American Enterprise Institute, \"Tea party vs. establishment: Who is helping the right, and who is hurting it?\" March 5, 2014", "Email interview with Tim Carney, American Enterpise Institute Fellow and Washington Examiner columnist, March 5, 2014", "Email interview with Patrick Rooney with the Republican Main Street Partnership, May 2, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]