["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Hillary Clinton at the University of Pittsburgh.", "President Donald Trump invoked the city of Pittsburgh to justify his decision to withdraw the U.S. from the Paris climate agreement. \"I was elected to represent the citizens of Pittsburgh, not Paris,\" Trump said Thursday in the White House Rose Garden.", "The reaction from Pittsburgh’s mayor, Bill Peduto, was swift. He tweeted, \"Fact: Hillary Clinton received 80% of the vote in Pittsburgh. Pittsburgh stands with the world & will follow Paris Agreement @HillaryClinton.\" At a press conference in Pittsburgh with local reporters Thursday, Peduto repeated this claim: \"The people of Pittsburgh voted for Hillary Rodham Clinton, 80 percent.\"", "Peduto’s spokesperson Timothy McNulty said Friday the mayor got the number \"off the top of his head\" and noted the numbers weren’t that different.", "During an appearance on CNN late Thursday, Peduto qualified his earlier statement: \"The city of Pittsburgh voted for Hillary Clinton with nearly 80 percent of the vote. [Trump] may be talking about all of western Pennsylvania, but it’s a far cry from being Pittsburgh.\" And while on \"Hardball with Chris Matthews\" on MSNBC, Peduto again stuck with the same claim: \"Actually in Pittsburgh, Hillary Clinton won with nearly 80 percent of the vote.\"", "Did Clinton win the city by that majority?", "Almost. Allegheny County election records show that Clinton won 75 percent of the vote in the city of Pittsburgh, while she won 56 percent of the vote county-wide. We calculated Clinton’s vote total using precinct-level data published by the county through the Western Pennsylvania Regional Data Center.", "Our ruling", "Trump said he was elected to represent people from Pittsburgh, not Paris, when explaining why he decided to withdraw the U.S. from a global climate deal. Pittsburgh’s mayor, Bill Peduto, responded by tweeting that Hillary Clinton received 80 percent of the vote in Pittsburgh. Clinton received 75 percent of the vote. That’s pretty close; Clinton did win the city by an overwhelming number.", "We rate this statement Mostly True.", "Allegheny County, 2016 General Election Official Results, accessed June 2, 2017", "Interview on CNN’s \"The Situation Room with Wolf Blitzer,\" June 1, 2017", "Interview on MSNBC’s \"Hardball with Chris Matthews,\" June 1, 2017", "Email interview with Timothy McNulty, spokesman for Mayor Bill Peduto, June 2, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]