["The collage was shared more than 100 times after being posted here on Facebook on September 7, 2020.", "The photo at the top shows a trash-filled beach next to an image of former Philippine President Benigno Aquino III. Tagalog text overlaid in the image states: \"NO ONE COMPLAINED\".", "The photo at the bottom shows a clean beach alongside an image of current President Rodrigo Duterte, with Tagalog text that reads: \"BOMBARDED WITH COMPLAINTS\".", "The post’s Tagalog caption reads: \"07 September 2020 / WHY DID ERIN TAÑADA NOT COMPLAIN WHEN MANILA BAY WAS A GARBAGE DUMP?\"", "Tañada, a former legislator and member of the opposition Liberal Party, is among those who criticised a recent government announcement that proposed the development of an artificial white sand beach in Manila Bay.", "The collage was also shared alongside a similar claim here, here, here and here on Facebook; and here, here and here on Twitter.", "The claim, however, is false.", "Photo of trash-filled beach", "The first photo, which shows a beach strewn with rubbish, was not taken during the Aquino III presidency.", "A reverse image search on Google traced the photo to this Philippine Star report that states it was taken in the aftermath of a September 2018 typhoon.", "Aquino III left office in 2016 and was succeeded by Duterte, as AFP reported here.", "Below is a screenshot comparison showing the first image in the misleading posts (L) and the Philippine Star photo (R):", "The same photo also circulated in another misleading collage, which was debunked by AFP here.", "Photo of clean beach", "The second photo of a clean beach was also not taken following the September 2020 announcement of a proposed white sand beach at Manila Bay.", "Reverse image and keyword searches found the photo has circulated since at least February 2019 in multiple posts about a Manila Bay clean-up; for example on Facebook here, on Reddit here and on Imgur here.", "Below is a screenshot comparison showing the second image in the misleading posts (L) and the February 2019 Facebook photo (R):", "Photos not from same location", "Moreover, the photos were not taken at the same location at Manila Bay.", "The first photo corresponds to this Google Maps street view imagery of the Manila Baywalk, a seaside promenade overlooking Manila Bay. The Manila Baywalk is where the government said it would develop the proposed artificial white sand beach.", "Meanwhile, the second photo was taken here at Baseco beach, more than three kilometres northwest of the site of the proposed project.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]