["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Cooking inside over fires like this is responsible for indoor air pollution in poor countries. (UN Foundation)", "Emphasizing the need to bring clean fuel to the world’s poor, James Rockall, CEO of the World LPG Association, recently said that \"more (people) die of indoor air pollution than malaria, HIV/AIDS and tuberculosis combined.\"", "Rockall’s statement showed up in a tweet from Stanford Energy, a research group at Stanford University, after he spoke there May 9.", "Rockall confirmed that he did make this claim, and we decided to check it out.", "Public health researchers have known for some time that in many poorer nations, fumes from dirty cooking stoves pose a health threat.", "Rockall’s group represents the interests of the liquified petroleum gas industry, but that self-interest aside, there’s no question that gas burns more cleanly than wood or coal.", "Rockall told us he got his numbers from the World Health Organization. He took a 2016 report on deaths from indoor air pollution and compared that to 2015 estimates of death from HIV/AIDS, malaria and tuberculosis.", "The indoor air pollution deaths, however, were based on 2012 data.", "To keep the comparison fair, we looked at 2012 mortality estimates for HIV/AIDS, malaria and tuberculosis. We consulted three different sources -- UNAIDS, WHO and the Global Burden of Disease Study -- and used the highest available estimate.", "Here’s what the numbers show:", "Deaths in 2012", "HIV/AIDS", "1.6 million", "Malaria", "0.8 million", "TB", "1.3  million", "Total", "3.7  million", "Indoor air pollution total", "4.2  million", "As you can see, the total mortality from the three diseases comes to 3.7 million in 2012, less than the 4.2 million people estimated to have died from diseases attributable to indoor air pollution.", "Rockall used different underlying estimates to reach a total of 2.9 million deaths due to the three diseases. Our total is higher, but we found no estimates from any source that undercut his basic point.", "Deaths from indoor air pollution are higher than the sum of deaths from the world’s major leading infectious diseases.", "Counting deaths from indoor air pollution is more complicated than tracking deaths from HIV/AIDS, malaria and tuberculosis.", "Mark Wilson, professor of epidemiology at the University of Michigan, said it is easier to identify someone who has HIV/AIDS, malaria and tuberculosis.", "\"Much more difficult is defining how one dies from indoor air pollution because it will never be the sole immediate cause of death,\" Wilson said. \"Rather, a variety of physiological, immunological and toxicological processes would compromise someone’s health, such that the cause might be defined as some sort of respiratory insufficiency, asthma, heart disease, etcetera.\"", "The WHO study made various assumptions to link diseases such as lung cancer, pneumonia, stroke, chronic obstructive pulmonary disease and ischemic heart disease to indoor air pollution.", "Rockall said more people die of indoor air pollution than HIV/AIDS, tuberculosis and malaria combined.", "We compared 2012 estimates of indoor air pollution deaths to a range of estimates for the three infectious diseases for 2012 and later.", "No matter how we did it, the deaths due to indoor air pollution trumped those due to HIV/AIDS, malaria and tuberculosis combined.", "But an epidemiologist offered the caveat that the indoor air pollution study relied on assumptions that introduce a greater chance of uncertainty than counts of deaths from the leading infectious diseases.", "For that reason, we rate this statement Mostly True.", "World Health Organization, Household air pollution and health", "World Health Organization, Mortality from Household Air pollution", "World Health Organization, Global Tuberculosis Report - 2013, 2013", "UNAIDS, 2013 report on the Global AIDS epidemic, 2013", "The Lancet, 2013 Global Burden of disease study, Dec. 17, 2014", "Global Health Observatory, Number of Malaria deaths, 2015 data", "Global Health Observatory, number of deaths due to HIV, 2015 data", "Global Health Observatory, TB cases and death, 2015 data", "World Health Organization, World Malaria Report, 2013", "World Health Organization, TB Mortality Data, 2015", "World Health Organization, Top 10 causes of death globally, February 2016", "Email interview, Mark Wilson, professor of Epidemiology, School of Public Health, University of Michigan, May 12, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]