["On November 29, Kiran Bedi, Lt Governor Pudducherry, shared a video of a bird claiming that it took 19 photographers and 62 days to capture the bird. The text of her tweet, “In Tamil it is called Suraga bird. It took 19 photographers 62 days to capture this video. Share the video of this unusual bird. I recvd this. Am Sharing it further as recvd.” The tweet was shared over 2,000 times and liked more than 6,700 times.", "In Tamil it is called Suraga bird. It took 19 photographers 62 days to capture this video. Share the video of this unusual bird. I recvd this. Am Sharing it further as recvd. pic.twitter.com/eYZBjXKZfP", "— Kiran Bedi (@thekiranbedi) November 29, 2019", "She also shared the same post on Facebook which was shared more than 450 times and liked over 1,300 times. Many people have shared the same video on social media.", "Alt News did a reverse image search on Google of a screenshot from video and found a report by News 18 which states that the bird is the Lyrebird from Australia. This video has been viral on social media since early October and covered by news outlets like ABC Adelaide and The Indian Express.", "According to the News 18 report, the video was upload by the Facebook page ‘Four Finger Photography’ on September 30, 2019. Alt News found the page which had shared the same video on September 29, 2019. The description along with the video suggested that it was shot at Adelaide Zoo in Australia. Neither any news reports nor ‘Four Finger Photography’ claimed that it took “19 photographers (and) 62 days” to capture the video.", "Amazing Lyrebird sing ❤️🇦🇺👌👍 Four Finger Photography Copyright © 2019 Australia 🇦🇺", "Please Like my page if would like to see more videos and photos 🙂", "YouTube videos and subscription https://www.youtube.com/user/daciavalbamakoba", "Posted by Four Finger Photography on Sunday, 29 September 2019", "Alt News spoke to Miklos Nagy, the owner of ‘Four Finger Photography’. Nagy confirmed that it was he who had shot the video at Adelaide Zoo. Two years ago, Adelaide Zoo had uploaded a video of the Lyrebird on their Facebook page. According to Encyclopedia Britannica, “Lyrebird, (genus Menura) is either of two species of Australian birds (family Menuridae, order Passeriformes) named for the shape of their tail when spread in courtship display. The name also aptly suggests a musician.”", "Alt News also spoke with Tamil Nadu-based bird enthusiasts to authenticate whether the term ‘Suraga’ is used to describe the Lyrebird in Tamil. M.Yuvan, a bird enthusiast from Madars Naturalist Society, said, “Tamil names exist for birds found in Tamil Nadu/Peninsular India. Lyrebird is Australian, therefore, it is unlikely to have a Tamil name.” Another Tamil Nadu-based bird enthusiast, Soundararaj Subbian, currently a member of Coimbatore Nature Society, added, “To my knowledge, there is no Tamil name for it.” Therefore, it seems extremely unlikely that ‘Suraga’ is the Tamil equivalent for Lyrebird.", "The video shared by Kiran Bedi is a cropped version of the video posted by ‘Four Finger Photography’ and is been circulating on social media with a false narrative that “it took 19 photographers and 62 days to shoot this video.” The original video was shot by an Australia-based photographer Miklos Nagy who holds the copyright for ‘Four Finger Photography’.", "In the past, we have compiled various instances of Kiran Bedi falling for inauthentic posts viral on WhatsApp and sharing them on her social media accounts.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]