["About this rating", "In the spring of 2019, the Christian conservative website Freedom Project prompted concern among some readers by reporting that a public school district in California was \"teaching pedophilia\" as a sexual orientation.", "On 17 April, the site published an article with the headline \"Pedophilia Being Taught as 'Sexual Orientation' in California Schools.\" The article continued:", "Government school officials in California think it is “really important” to teach children about pedophilia and pederasty in the classroom because it is a “sexual orientation.” That is according to a top official for California's Brea Olinda School District, who admitted to parents that it was being done — and that it would continue, despite the outrage. The implications are mind-blowing.", "The stunning admission came after a parent-information meeting last month for the Brea Olinda Unified School District (BOUSD). Stephanie Yates, founder of Informed Parents of California, asked school officials why they were “teaching pedophilia in school to 9th graders.” But instead of a denial that such an atrocity was taking place, a top school official confirmed it was happening and acted like there was nothing wrong with it.", "“This is done because we are talking about historical perspectives of how gender relations and different types of sexual orientations have existed in history,” said BOUSD Assistant Superintendent of Curricula Kerrie Torres in a matter-of-fact way, sounding almost oblivious to how the bombshell might sound to normal people.", "The report centered around a short clip showing an exchange between Yates and Torres, which can be viewed below:", "That clip was taken from a longer video, posted to the \"Informed Parents of California\" Facebook group. The 43-minute video was recorded on 21 March at a public information evening for parents in the Brea, California, school district, on the subject of the Healthy Youth Act. The full video can be watched here.", "California lawmakers passed the Healthy Youth Act, as we have outlined previously, in 2015, creating a new K-12, sex-education curriculum that remained in place as of April 2019.", "The law requires school districts across California to implement instruction for students related to reproductive health, sex education, personal safety, prevention of HIV and other sexually transmitted infections, child and adolescent growth, as well as programming on relationships, families, gender identity and sexual orientation.", "Each school district must devise its own curriculum, including specific reading materials and classroom presentations, provided the content is in keeping with the requirements of the Healthy Youth Act, including the requirement that all instructional material must be \"age-appropriate.\"", "On the subject of sexual orientation, the text of the legislation states: \"Instruction and materials shall affirmatively recognize that people have different sexual orientations and, when discussing or providing examples of relationships and couples, shall be inclusive of same-sex relationships.\" The legislation does not mention pedophilia (sexual activity between an adult and child) or pederasty (sexual activity between a man and a boy).", "The full 43-minute video shows a 21 March presentation given by Brea Olinda Unified School District (BOUSD) Assistant Superintendent Kerrie Torres, which provided attending parents with information about how the district was implementing the requirements of the Healthy Youth Act, and what the BOUSD curriculum entailed.", "Around 25 minutes into the video, Yates interrupted Torres' presentation to ask about the curriculum's component on sexual orientation, and whether parents could withdraw their children from it (a subject we have previously examined in greater detail). Yates said:", "\"... I'm just wondering, because you did give me this Powerpoint presentation that actually goes through the history of the LGBTIQ [lesbian, gay, bisexual, transgender, intersex, questioning], that talks about the practice of pederastery [sic], which is pedophilia specific to boys and men. ... You said you don't teach anything inappropriate, but you're teaching, normalizing pederastery [sic].\"", "Yates' interruption was cut short, but after Torres' presentation, Yates once again confronted the BOUSD official with claims that the curriculum was 'normalizing anal sex' and 'teaching pedophilia in school.' The following exchange ensued:", "Yates: Answer me why you're teaching pedophilia in school, to ninth-graders.\nTorres: Teaching what?\nYates: Pedophilia. Pederastery [sic]. Right here.\nTorres: Pederastery [sic]... this is done because we are talking about historical perspectives of how gender relations and different types of sexual orientations have existed in history. So this is something --\nUnidentified voice: So sex between a man and a boy is a sexual orientation?\nTorres: -- something that's occurred in history and this is really important for us to include.\"", "At no point did Torres state that the school district was endorsing the practice of pederasty or pedophilia, nor even that the curriculum described pederasty as a discrete sexual orientation — the core of the claim made by Freedom Project in its subsequent report, which falsely described Torres' remarks as a \"stunning admission.\"", "In reality, Yates was referring to an outdated version of the BOUSD Healthy Youth Act curriculum that mentioned pederasty in a section about LGBT history, but neither endorsed the practice nor described or presented it as a discrete, legitimate sexual orientation.", "BOUSD's ninth-grade, health-education curriculum contains a component (Section 4.8) entitled \"Introduction to Sexual Orientation,\" which includes a slideshow that teachers are intended to present to students. One of the slides relates to \"LGBTIQ in History,\" and traces prominent milestones in LGBT history, including references to homosexuality in Ancient Rome and China.", "As of April 2019, the current version of that slide did not contain any reference to pederasty. However, an earlier version contained the following bullet point:", "\"The practice of pederasty (an older upper class man would make a young free boy his partner and become his mentor) is mentioned in Homer’s Iliad [the Ancient Greek epic poem], and is evidenced to have existed at least 4500 years ago in ancient Egypt.\"", "In a statement, a spokesperson for the school district told us that the previous reference to pederasty was removed from Section 4.8 of the ninth-grade, health-education curriculum in the fall of 2018. \"After careful review of the curriculum, the district determined it [the bullet point] posed more questions than answers,\" the spokesperson wrote.", "The description of pederasty in the original BOUSD presentation is accurate, and in tracing the history of same-sex relationships in various societies, it would be perfectly relevant to mention the Ancient Greek custom whereby older men imposed a sexual relationship on much younger males, typically teenage boys.", "Although modern-day observers would view such a practice as predatory, abusive and criminal, it was widely practiced and accepted in Ancient Greek society. As such, it would appear relevant for inclusion in a brief summary of prominent milestones and trends in LGBT history, while bearing in mind the clear distinction between same-sex relationships, as such, and child sexual abuse. Yates did not make that distinction when she confronted Torres for allegedly 'normalizing anal sex' and 'teaching pedophilia,' suggesting a moral equivalence existed between consensual, same-sex sexual relations and child sexual abuse.", "The BOUSD presentation, which is outdated anyway, did not endorse pederasty or present it approvingly, nor did it describe pederasty or pedophilia as a discrete sexual orientation.", "Similarly, BOUSD official Torres did not state, in her videotaped exchange with Yates, that pederasty was its own sexual orientation, or that BOUSD endorsed or approved of pederasty or pedophilia or taught students that sexual activity between men and boys was acceptable in any way.", "Thus Freedom Project author Alex Newman was inaccurate in claiming, during a widely shared Facebook video, that Torres had said of pedophilia \"this is a sexual orientation.\" In reality, she said no such thing.", "In fact, after concerns were raised at an earlier public meeting on 21 March, Torres added a slide to her presentation for that evening that explicitly stated \"We do not teach pedophilia.\"", "Taking the foregoing facts into account, we issue a rating of \"false\" for the claim that Brea Olinda Unified School District was \"teaching pedophilia as a sexual orientation.\"", "Newman, Alex.  \"Pedophilia Being Taught as 'Sexual Orientation' in California Schools.\"\r\n    Freedom Project.  17 April 2019.", "MacGuill, Dan.  \"Are California Parents Barred From Withdrawing Their Children From Sex Education.\"\r\n    Snopes.com.  30 April 2018.", "California Legislature.  \"Assembly Bill No. 29 -- Pupil Instruction: Sexual Health Education.\"\r\n    1 October 2015.", "Brea Olinda Unified School District.  \"9th Grade Health Curriculum -- 4.8 Introduction to Sexual Orientation.\"\r\n    Accessed 26 April 2019.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]