["In a post rapidly gaining traction on Facebook, a user warns that if not \"stopped,\" the Social Security Administration will soon eat into the fund to provide benefits for some immigrants.", "\"SOCIAL SECURITY ADMIN plans to pay SS benefits to ILLEGALS from your SS TRUST FUND! Must be STOPPED!” the March 3 post reads. It has been shared over 2,300 times.", "The creator of the post, Connie M. Giordano, said that a group called the Seniors Coalition sent her a letter with this claim.", "It makes sense why there may be concern about excess demands on the Social Security fund: It provides 1 in 4 Americans with 90% of their income or more, and over 50% of income for half of all seniors, according to the Center on Budget and Policy Priorities. But experts have predicted that with the aging of baby boomers, the fund could run out of its reserves by 2034, leaving beneficiaries with smaller monthly payments.", "However, the claim is baseless.", "Far from draining Americans’ Social Security resources, immigrants who are in the U.S. illegally contribute much more to the program than they claim each year. Though there are ways they can claim benefits through illegitimate or expired Social Security numbers, that practice is not widespread.", "In addition, there are no proposed changes, either from the Social Security Administration or the Biden administration, that would change the way the agency allocates its funds to workers in the country illegally.", "Fact check:Yes, people experiencing homelessness are eligible for the stimulus", "First, here's a reminder on how Social Security works.", "This claim uses the word “trust fund” to refer to Social Security benefits. But the program would best be described as a cross between a federal assistance program and a retirement, life and disability insurance plan, not as a trust fund.", "The program ensures a supplemental income for American wage earners during retirement, as well as a safety net from which they can draw if they become unemployed due to disability.", "It is similar to a pension in the sense that Social Security benefits, including disability benefits, are roughly proportional to the funds a person has paid in Social Security taxes during their working life. (The calculations are complicated, but retirement benefits are based on the average of your earnings from the 35 years during which you made the highest indexed income.) However, Social Security is a \"pay-as-you-go\" program; this means younger workers’ current contributions go into the pool from which retiree benefits are drawn, rather than those payments remaining untouched until now-younger workers retire, as in a private pension or \"trust fund.\"", "Only those who have paid payroll taxes on their earnings and earned a sufficient number of work credits can claim benefits.", "To qualify for a retirement payment, a person must have earned at least 40 work credits, which is equivalent to 10 years of work or more, depending on income. To qualify for disability benefits, one must have at least 20 credits.", "Evidence shows that money that Americans have paid into Social Security isn’t going to people in the country illegally, and that, in fact, those immigrants are contributing a surplus to the fund. In addition, policy states that if workers who entered the U.S. illegally are claiming benefits, they earned them through U.S. payroll taxes that they and their employers paid on their income.", "Workers who aren’t paid in cash must use a Social Security number, whether it is a made-up number, a number they received from a visa they overstayed, or that of a relative or friend. Bothworker and employer must pay taxes on that number. The Social Security Administration accepts such contributions, regardless of their legitimacy.", "Many immigrants who are paid under the table also contribute to Social Security through an Individual Taxpayer Identification Number because it helps them demonstrate a good tax history when applying for legal status; ITINs account for $9 billion in state and local income taxes annually.", "Because a large number of immigrants who are in the US illegally pay into Social Security this way but cannot claim benefits, they create a net surplus. The most recent data, in an in-depth analysis by the Social Security Administration, found that they contributed as much as $13 billion in 2010, while only claiming about $1 billion in benefits. Each year, this net surplus grows.", "How do they claim benefits? First of all, it is possible for workers to use fabricated Social Security numbers or those from overstayed visas to claim benefits. Secondly, if a formerly undocumented worker gains legal status, they can claim the benefits they earned while undocumented if they provide proof.", "Those instances are rare. Wrote Chief Actuary Stephen Goss in the 2013 report, “The requirement to document ownership of reported taxable earnings in the past is a high hurdle, and meeting this requirement seems to be more the exception than the rule.” That report is the most recent information USA TODAY could locate.", "Regardless, this loophole has gotten the attention of Republican lawmakers: Congressman Mo Brooks, R-Ala., introduced the “No Social Security for Illegal Aliens Act of 2020” in opposition to this policy in January 2020. The bill died in Congress.", "The “planned” Social Security policy changes to which the post refers are not clear; neither the Biden administration nor the Social Security Administration has recently announced changes to Social Security policy regarding immigrants.", "A false claim about Biden and Social Security benefits surfaced during the 2020 campaign when a Trump campaign ad that aired last September in battleground states.  “Joe Biden tried to cut Social Security and Medicare for decades. … Now Biden’s promising your benefits to illegal immigrants,” the ad claimed.", "However, Biden’s only proposed change to either of these programs that involves immigrants in the US illegally does not involve using taxpayer dollars. The Biden-Sanders Unity Task Force said those workers should be able to “purchase unsubsidized coverage in the ACA marketplaces.” As for Social Security policy, Biden’s promised plan would increase survivor and retiree benefits for some by taxing earnings over $400,000, but it would not change policies in place that prevent undocumented immigrants from benefiting from the program.", "The claim that the Social Security Administration will soon pay \"your\" benefits to immigrants in the country illegally may refer to the fact that under Biden's U.S. Citizenship Act of 2021, the U.S. would create a path to citizenship for several million qualified members of this group. However, experts state that creating legal pathways to citizenship would increase the tax contributions of immigrants who were formerly residing in the U.S. illegally by roughly $2 billion.", "We rate this claim FALSE. Immigrants in the country illegally cannot legally claim Social Security benefits, even though they are responsible for billions in tax payments to the fund annually. There are no proposed plans, neither from the Biden administration nor the Social Security Administration, to change this.", "White House Press Release, Jan. 20, Fact Sheet: President Biden Sends Immigration Bill to Congress as Part of His Commitment to Modernize our Immigration System"]