["About this rating", "A few days after Kobe Bryant's sudden and tragic death in January 2020, a quote ostensibly uttered by the NBA legend circulated on social media, including via the Facebook page of the liberal site Occupy Democrats.", "The full quote reads: \"A #potus whose name alone creates division and anger. Whose words inspire dissension and hatred can't possibly 'Make America Great Again.'\"", "This was a genuine quote from Bryant. The basketball star posted this message to his Twitter account in September 2017, an apparent reference to U.S. President Donald Trump whose campaign slogan was \"Make America Great Again.\"", "At the time, Trump was calling on NFL team owners to fire any players who protested during the National Anthem. The commander-in-chief had also just disinvited the Golden State Warriors basketball team from visiting the White House after star player Stephen Curry said he was not interested in attending the traditional event:", "Trump's comments drew the ire of several NBA stars. Lebron James and Draymond Green, for instance, both responded to Trump:", "While Bryant did not specifically name Trump in his tweet, he commented amid a controversy involving the current occupant of the White House, and he invoked Trump's campaign slogan. About a month after posting this message, Bryant was asked during a news conference if he would attend an event at Trump's White House. Bryant responded: \"I wouldn't go. Simple. No.\"", "Belson, Ken and Julie Davis.   \"Trump Attacks Warriors’ Curry. LeBron James’s Retort: ‘U Bum.’\"\r\n    New York Times.   23 September 2017.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]