["About this rating", "Ingrid Newkirk, the president and co-founder of People for the Ethical Treatment of Animals (PETA), is one of the most high-profile animal rights activists of the past few decades.", "She is also a controversial figure, frequently attracting criticism over the group's famous publicity stunts and advertising campaigns, but also for allegations of cruelty and hypocrisy over PETA's policy on euthanizing animals in their care.", "Against that background, in November 2018 a meme containing four separate statements attributed to Newkirk on the subject of killing and caring for animals gained popularity on Facebook, as posted by the Florida Greyhound Association:", "\"I would go to work early, before anyone got there, and I would just kill the animals myself...I must have killed a thousand of them, sometimes dozens every day.\"", "\"Euthanasia is the kindest gift to a dog or cat unwanted and unloved.\"", "Ingrid Newkirk, PETA President and Co-Founder.", "PETA IS NOT ABOUT SAVING ANIMALS", "\"We do not advocate right to life for animals.\"", "\"We are not in the home finding business. Our service is to provide a peaceful and painless death to animals who noone wants.\" Ingrid Newkirk, PETA President.", "The meme was no longer publicly available, as of 16 November.", "\"I must have killed a thousand of them, sometimes dozens every day\": MISSING CONTEXT", "This is an authentic quotation by Newkirk, taken from a 2003 interview she gave to the New Yorker magazine. However, the meme presents it without proper context, grossly misrepresenting the full sense of her remarks.", "In the relevant section of the article, Newkirk was outlining how she first became an animal rights activist, after dropping off some abandoned kittens at an animal shelter near her home in Maryland, only to find, to her profound shock, that they were immediately euthanized. She switched careers from studying to become a stockbroker to working in that very shelter, but she became even more dismayed by what she claimed was the treatment of animals there, setting her on a path to founding PETA:", "What she saw at the shelter affected her profoundly. \"I went to the front office all the time, and I would say, 'John is kicking the dogs and putting them into freezers.' Or I would say, 'They are stepping on the animals, crushing them like grapes, and they don't care.' In the end, I would go to work early, before anyone got there, and I would just kill the animals myself. Because I couldn't stand to let them go through that. I must have killed a thousand of them, sometimes dozens every day. Some of those people would take pleasure in making them suffer. Driving home every night, I would cry just thinking about it. And I just felt, to my bones, this cannot be right. I hadn't thought about animal rights in the broader sense. Not then, or even for a while after. But working at that shelter I just said to myself, 'What is wrong with human beings that we can act this way?'\"", "It's true that Newkirk did once recount having euthanized many animals every day during a certain period of her life, but the quotation included in the meme left out some important context: spurred into action by a desire to care for vulnerable animals, Newkirk was working at an animal shelter where her colleagues allegedly mistreated the animals very badly and put them down without proper reverence. It was in this context that she took it upon herself to euthanize the animals.", "The meme also selectively excerpted from Newkirk's remarks, leaving out the line \"Because I couldn't stand to let them go through that.\"", "\"Euthanasia is the kindest gift to a dog or cat unwanted and unloved\": UNPROVEN", "We were not able to verify that this is an authentic, direct quotation from Newkirk, despite its having been widely shared online as such for around a decade. The earliest instance of it we could find was from a June 2005 editorial in the newsletter of the Best Friends Animal Society. There, the statement was not attributed to Newkirk as a direct quotation but rather as a summary of her alleged remarks.", "The context of the article was the high-profile arrest on charges of animal cruelty of two PETA employees in North Carolina, after they were caught disposing of the corpses of euthanized dogs and cats in garbage bins. (The two employees were later acquitted of animal cruelty but fined for improperly disposing of the corpses.) This is how the Best Friends Animal Society reported on the arrests in June 2005:", "Since these two people will be going to trial, it would be inappropriate for us to comment on their particular situation. However, we can certainly comment on the policies of PETA and their public remarks and actions. PETA runs some very effective campaigns and we support much of what they have done to help bring an end to some of the worst abuses of animals in laboratories, factory farms, at sporting events, and fur farms. But in the area of companion animals, we have some fundamental disagreements.", "At a press conference following the arrest of those two employees, PETA president Ingrid Newkirk said that PETA believes euthanasia is the kindest gift to a dog or cat unwanted and unloved. We simply couldn't disagree more. The kindest gift to a homeless animal is a good home. The kindest gift to an unloved dog or cat is a loving, caring place to go.", "The Best Friends editorial did not link to any video or transcript of the press conference, and we were unable to find any source material which would support this characterization of Newkirk's remarks. A spokesperson for PETA told us in a statement: \"We don't have a source for this quote.\"", "Furthermore, other newspapers and agencies did cover PETA's response to the arrests (including a 17 June 2005 press conference), but none of their reports included Newkirk's professing her belief that euthanasia was \"the kindest gift\" for an unwanted animal. For example, the Associated Press reported:", "Dumping the bodies of dead dogs and cats in the garbage is wrong, but the president of People for the Ethical Treatment of Animals said Friday that animal cruelty charges against two employees won't stick. \"It's hideous,\" Ingrid Newkirk, president of the animal rights group, said of the dumping. \"I think this is so shocking it's bound to hurt our work.\"", "But she told a news conference there was no indication of \"pain or suffering\" among the 18 animals that police in Ahoskie, N.C. found in a shopping center garbage bin or the 13 found in a van registered to PETA. The animals received lethal injections, Newkirk said.", "While we could not find proof of Newkirk saying euthanasia was the \"kindest gift\" for an unwanted animal, it's clear that she, PETA, and some other animal rights activists and veterinarians do support a policy of putting down animals who would otherwise face severe neglect or cruelty, or for whom a stable home or space in a shelter cannot be found.", "On their web site, PETA explains their policy:", "More than 6 million animals are handled by animal shelters in the United States each year. Even though some are reclaimed or adopted, nearly 4 million unwanted dogs and cats are left with nowhere to go. Shelters cannot humanely house and support all these animals until their natural deaths—they would be forced to live in cramped cages or kennels for years, lonely and stressed, and other animals would have to be turned away because there would not be room for them.", "Turning unwanted animals loose to roam the streets is not a humane option. If they don’t starve, freeze, get hit by a car, or die of disease, they may be tormented and possibly killed by cruel juveniles or picked up by dealers who obtain animals to sell to laboratories.", "Because of the high number of unwanted companion animals and the lack of good homes, sometimes the most humane thing that a shelter worker can do is give an animal a peaceful release from a world in which dogs and cats are often considered “surplus” and unwanted. PETA, The American Veterinary Medical Association, and The Humane Society of the United States concur that an intravenous injection of sodium pentobarbital administered by a trained professional is the kindest, most compassionate method of euthanizing animals. The American Humane Association considers this to be the only acceptable method of euthanasia for cats and dogs in animal shelters.", "This policy is vehemently opposed by other animal rights activists who strongly support what are known as \"no-kill\" shelters, where animals are only euthanized if they face irreversible pain or illness. This philosophical conflict has given rise to something of a schism between animal rights activists, and PETA's failure to adopt a universal \"no-kill\" approach at their animal shelters has attracted fierce criticism.", "\"We do not advocate right to life for animals\": CORRECT ATTRIBUTION", "The source of this quotation is a postcard published online by Nathan Winograd, an animal rights activist and long-standing, outspoken critic and opponent of PETA and Ingrid Newkirk. The postcard, dated December 1994, was addressed to Winograd and has the insignia of PETA on it as well as that of Newkirk. The postcard contains the following message:", "Mr Winograd --\n1. We do not advocate \"right to life\" for animals\n2. There are always exceptions.", "A spokesperson for PETA acknowledged that the postcard was authentic and had been written and sent by Newkirk:", "Ms. Newkirk was apparently answering Nathan Winograd's claim that all animals have the right to life, no matter what condition they're in. PETA's is a \"shelter of last resort,\" which takes in animals who are dying, broken, injured, and otherwise unwanted and whom the \"no-kill\" shelters will not accept, providing them with a merciful release.", "\"We are not in the home finding business\": MISATTRIBUTED", "This is an authentic quotation, but a spokesperson for PETA told us that it has been falsely attributed to Ingrid Newkirk. The remarks were taken from a letter that Daphna Nachminovitch, now a senior vice-president at PETA, sent to officials in Northampton County, North Carolina, in 2005 after the aforementioned arrest of two PETA employees on animal cruelty charges.", "At the time, PETA had contracts with Northampton and Bertie counties to assist with euthanizing unwanted animals, but officials severed links with the organization when the corpses of more than 30 animals were found dumped in garbage bins in the town of Ahoskie.", "The Virginian-Pilot newspaper attributed the remarks in question to Newkirk in a 20 July 2005 report:", "PETA started picking up animals in northeastern North Carolina in 2001 when a caller informed the group of poor conditions in shelters, according to a written apology PETA president Ingrid Newkirk sent to Bertie County officials. Bertie and Northampton County officials and one Ahoskie veterinarian who said he gave PETA three healthy cats that were found dead in Ahoskie on June 15 said they believed that adoptable animals would find new homes, while sick, injured and wild animals would be euthanized.", "In an apology letter to Northampton County officials, Newkirk wrote that dumping animals in trash bins \"is wrong and in violation of PETA policy.\" PETA typically puts down animals in Norfolk and cremates the carcasses, Newkirk said in a June 17 press conference. \"We are not in the home finding business, although it is certainly true that we do find homes from time to time for the kind of animals people are looking for,\" Newkirk wrote to Northampton County officials. \"Our service is to provide a peaceful and painless death to animals who no one wants.\"", "Although Newkirk sent apology letters to Bertie and Northampton officials, both counties cut ties to PETA pending the trials of Cook and Hinkle. The counties are now euthanizing animals without help from PETA.", "PETA told us that the letter to Northampton County was sent by Nachminovitch, not Newkirk, and provided a more extensive excerpt from it:", "As Ms. Gay will tell you, the animals we've picked up were already scheduled for euthanasia, having been held the required 72-hour timeframe. We are not in the home finding business, although it is certainly true that we do find homes from time to time for the kind of animal people are looking for, but not for the animals who are sick, injured, old, aggressive, and so on—the majority that are turned in to, or picked up by, Mr. Person. Our service is to provide a peaceful and painless death to animals who no one wants.", "So the fourth quotation included in the meme did not actually originate with Ingrid Newkirk, although it was written by one of her colleagues. Perhaps more important, it was not intended as a comprehensive summary of PETA's entire mission, but rather as a more nuanced description of the organization's specific function in contracting with Northampton County, North Carolina, during the mid-2000s.", "Stephey, M.J.   \"Outrageous PETA Stunts.\"\r\n    Time.   11 November 2009.", "McWilliams, James.   \"PETA's Terrible, Horrible, No Good, Very Bad History of Killing Animals.\"\r\n     The Atlantic.   12 March 2012.", "Specter, Michael.   \"The Extremist.\"\r\n    The New Yorker.   4 April 2003", "Best Friends Animal Society.   \"PETA Kills Animals? The Best Friends View.\"\r\n    24 June 2005.", "Associated Press.   \"Two PETA Employees Arrested in N.C. Animal-Cruelty Case.\"\r\n    17 June 2005.", "Associated Press.   \"PETA Workers Cleared of Animal Cruelty.\"\r\n    2 February 2007.", "Lindsey, Sue.   \"PETA Workers Charged in Dead-Animal Dumping.\"\r\n    Associated Press.   18 June 2005.", "PETA.   \"Euthanasia: The Compassionate Option.\"\r\n    Accessed 16 November 2018.", "Winograd, Nathan J.   \"Killing Animals: PETA's Open 'Secret.'\"\r\n    HuffPost.   18 October 2017.", "Winograd, Nathan J.   \"PETA: \"We Do Not Advocate 'Right to Life' for Animals.\"\r\n    NathanWinograd.com.   Accessed 16 November 2018.", "Freeman, Darren.   \"Hearing Date for Employees of PETA Reset for Aug. 16.\"\r\n    The Virginian-Pilot.   20 July 2005.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]