["The 25-second video was shared here in a Facebook post on September 14, 2019, and has been viewed more than 39,000 times.", "A caption in Hindi alongside the video in the misleading Facebook post translates to English as: \"See, today how these cops at the Gaur Police Station are terrorising in the name of inspecting vehicle documents. They dragged and hit a vehicle owner today near Gaur Police Station in Basti district on September 14. Necessary action needs to be taken against the culprits immediately.\"", "The Indian government raised traffic fines and increased penalties for improper vehicle licensing as part of the Motor Vehicles Act, which came into force on September 1, 2019, as reported here by Indian media.", "Below is a screenshot of the misleading Facebook post:", "The video has also been shared elsewhere alongside the same claim, for example here, here and here on Facebook, and here, here and here on Twitter.", "However, the claim is false; the video is actually from 2017 and, according to local media reports, shows the policemen in Basti district of the north Indian state of Uttar Pradesh beating up an alleged criminal.", "At 00:02 seconds in the video, a red and blue colored sign is seen in the background with the words \"Police Station Gaur, District Basti\" written in Hindi, confirming where the incident took place.", "Below is a screenshot of the video with the sign circled by AFP:", "A Google keyword search led to this video report published on November 14, 2017, on the official YouTube channel of a Hindi-language news outlet Samachar Plus.", "Below is a comparison of a screenshot from the video in the misleading post (L) and one from Samachar Plus (R):", "“Horrifying Face of UP Police: Video Cops Beating Man In Basti,” reads a caption alongside the video report.", "“The policemen dragged the man inside the police station and beat him up brutally. The man is accused of creating a public nuisance,” the anchor in the video report says in Hindi.", "UP Police stands for Uttar Pradesh Police.", "English news channel Times Now also published a video report on the incident on its Facebook page here on November 14, 2017.", "The caption alongside the video report reads:", "“The UP policemen were caught on camera dragging and thrashing a man outside police station in Basti district. The man was allegedly drunk, his wife pleaded to cops to leave him but they continue to beat him up. Instead of booking the man under relevant sections of IPC or locking him up, cops chose to physically thrashed him in public. This drama continued for some time till the senior officers within the police station intervene. Watch the extremely shocking visuals.\"", "The local Basti district police have issued a clarification over the recent misleading claims concerning the footage here on their verified Twitter account, which is shown below:", "उक्त वीडियो वर्ष 2017 का है न कि वर्तमान समय का है । यह घटना काफी पुरानी है ,वीडियो को देखने से वर्दी शीतकालीन है जबकि वर्तमान समय में ग्रीष्मकालीन वर्दी धारण की जा रही है यह घटना न ही किसी वाहन चेकिंग की है ।", "“The above video is not a recent one, it is from 2017. This is an old incident as it shows policemen in winter uniform while we’re wearing summer uniform at present. This incident is also not related to any vehicle checking,” reads the Hindi statement.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]