["By Sean Carlin", "Posted on June 5, 2020", "Some viral social media posts misleadingly suggest that piles of bricks are being staged ahead of the protests over the death of George Floyd to incite violence. We reviewed five social media posts making such claims and found no evidence of staging. In many cases, the bricks had been delivered for construction projects, or had been at the sites for some time.", "Cities and communities throughout the U.S. have experienced protests and unrest since George Floyd, a black man, died after a white police officer knelt on his neck during an arrest in Minneapolis on May 25.", "The protests and clashes between police and demonstrators have spurred memes and social media posts to misleadingly claim that large piles of bricks have been deliberately placed near the locations of planned protests in several cities to incite more violence.", "But we found no evidence of such staging. In many cases, news reports and officials in several cities have said that the pallets of bricks were delivered for construction projects or have been at those locations for some time — and were not placed there for protesters.", "Here’s what we found:", "Frisco, Texas: Social media users circulated photos of bricks ahead of a demonstration on June 1 in Frisco. The post has this comment on the top: “Brick Pallets in Frisco, TX for rioters/Antifa.” One post that recirculated the image garnered more than 1,600 shares.", "But police told the Associated Press that the bricks were a 10-minute walk from where the protesters would be marching, and were left there by a homeowners association for a construction project.", "Dallas, Texas: A photo posted on Facebook showed a pile of bricks near the site of protests in Dallas, and questioned where they came from. One commenter asked, “Who put this pallet of bricks here? Where is the FBI and news media???”", "But a Google search of the area revealed that the bricks have been there, near a construction site, since at least February, NBC News reported.", "Dallas Police spokesman Carlos Almeida told us in an email that officers are sent to verify reports that bricks have been dropped off, and if such reports were accurate the officers would stay on the scene until the bricks can be removed.", "“At this time, we have nothing to confirm that any bricks were intentionally left for use at protests,” Almeida said.", "Norfolk, Virginia: A Facebook user posted photos of a pile of bricks at an intersection in Norfolk with the caption, “Stay woke people!! They are putting bricks out for you to destroy” property.", "But Norfolk city spokeswoman Lori Crouch told us in an email that the brick pavers seen in the photo were placed there by a contractor who was working on a gas line. The pavers had been in the street and were pulled out for the work. The contractor has since removed them from the area until they can be put back in the street, Crouch said.", "Los Angeles: A video from Los Angeles posted on social media depicts what appear to be crates of rocks along the street in front of a Jewish center, Chabad of Sherman Oaks. The caption on the post asks, “Who is organizing all of these riots? Do you think this is really just a coincidence?”", "The center responded to the video, saying the crates — actually gabions, cages filled with rocks and used for civil engineering and landscaping — are security barriers that have been there for nearly a year. The center temporarily removed the rocks from the crates to alleviate concerns that they could be used to incite violence.", "Boston: Police were seen on video in an alley in Boston unloading bricks from a vehicle in what users speculated was for some nefarious reason. A Facebook comment on the video said, “Now we see who starts the riots and looting and blame it on others.”", "However, Northeastern University police released a series of tweets on June 2 saying their officers were the people seen in the video. According to the department, the officers found a damaged brick sidewalk while on patrol on June 1 and collected the loose bricks because they posed a safety hazard.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "Almeida, Carlos. Spokesman for Dallas, Texas, Police Department. Email to FactCheck.org. 3 June 2020.", "Crouch, Lori. Spokeswoman for city of Norfolk, Virginia. Email to FactCheck.org. 4 June 2020.", "Dupoy, Beatrice. “Bricks in Frisco, Texas, left for construction, not protest.” Associated Press. 1 June 2020.", "“George Floyd death: More large protest in US but violence falls.” BBC News. 3 Jun 2020.", "Price, Matthew. Bodo, Lorand. “Viral rumors about bricks meant to encourage protest shown to be false.” NBC News. 1 June 2020.", "Silverman, Craig. “People Say Pallets Of Bricks Are Showing Up Near Protests All Over The US. The Truth Is More Complicated.” BuzzFeed News. 5 Jun 2020.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]