["The photo was published in here in an online article on July 7, 2017, by a website called “Science Vibe.”", "It shows a map of the Pacific ocean and contains a superimposed text at the bottom which reads: “Courtesy of J. Churnside”.", "The online article's headline states: “Fukushima’s Astronomical Radiation Is Off The Charts… Even Now”.", "Below is a screenshot of the misleading post:", "Strong tsunami waves triggered by a magnitude-9.0 earthquake that rocked eastern Japan on March 11, 2011, swamped power supplies at the Fukushima Daiichi nuclear plant, causing reactor meltdowns that released radiation, according to this AFP report. The earthquake and tsunami left some 18,500 people dead or missing in the country.", "Science Vibe also posted the link on its Facebook page on July 8, 2017, where it has been shared more than 1,800 times. Science Vibe also shared the same link again on its Facebook page on November 6, 2019, here, where it has been shared more than 600 times.", "The same link was shared on Twitter here on November 7, 2019 with a similar claim.", "The claim is false. The photo has been used in a misleading context; the map shows projections made by a scientist from the US National Oceanic and Atmospheric Administration (NOAA) of where marine debris from the 2011 tsunami in Japan could circulate.", "A reverse image search on Google and subsequent keyword searches found this edition of Mariners Weather Log magazine published in December 2011 by the U.S. National Weather Service.", "The image appears on page 8, in a chapter titled, “Marine Debris”, written by NOAA marine debris program coordinator Carey Morishige.", "Below is a screenshot of the image in the magazine:", "The article's first paragraph states: “Of all Earth’s natural hazards, tsunamis may be among the most infrequent, but they pose a major threat to coastal populations, particularly in the seismically active Pacific Ocean. The tragedy of the March 11, 2011 earthquake and subsequent tsunami in Japan could have far-reaching effects to areas like the U.S. West Coast and Hawai‘i. As the tsunami receded from land in northern Japan, it washed much of what was in the inundation zone into the ocean. Heavier materials sank closer to shore while buoyant materials made up debris fields that were seen briefly in satellite imagery and aerial photos of the waters surrounding Japan.”", "The image's caption states: “NOAA has run a model using OSCURS (Ocean Surface Current Simulator). The results are shown here. Map courtesy of J. Churnside and created through Google.", "“Year 1 = red; Year 2 = orange; Year 3 = yellow; Year 4 = light blue; Year 5 = violet”.", "The same image also appears in several other reports about marine debris from the 2011 tsunami, for example the PBS report here, the Oregon State University blog post here, and the Alaska Ocean Observing System post here.\n\t \nJames Churnside, the NOAA scientist credited with creating the map, told AFP on November 7, 2019, in an email that the image relates to marine debris, not radiation.", "Churnside said: “This is a projection of where the marine debris would be likely to circulate after the earthquake and tsunami. It has nothing at all to do with radiation from that event.”", "An interactive version of the NOAA marine debris projections has been published here.", "Below is a screenshot of the interactive map:", "NOAA also has an online page here about marine debris from the 2011 Japan tsunami.", "An FAQ item in the page reads: “Is the tsunami marine debris radioactive?”", "NOAA’s answer reads: “NOAA is not actively involved in monitoring radiation related to Fukushima, however the EPA continues to monitor air and the FDA is testing fish. Some marine debris has been tested by the states, including items known to be from the tsunami, and no radioactive contamination above normal was found.”", "“EPA” refers to the US Environmental Protection Agency, “FDA” refers to the US Food and Drug Administration.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]