["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Kurt Russell attends a ceremony honoring her and Kurt Russell with stars on the Hollywood Walk of Fame on May 4, 2017, in Los Angeles. (AP)", "A story on Facebook said that actor Kurt Russell \"falls into the rare category of celebrities who isn’t crying over Hillary Clinton’s loss\" and doesn’t feel a need to announce his political opinions.", "Russell said that \"the last thing I like to watch is entertainers or actors get political,\" according to an article on Twentyeightmay, a pro-Donald Trump website. The story said that Russell showed Trump’s \"famous foes that it’s time to shut up about our president.\"", "Facebook flagged this story as part of its efforts to combat false news and misinformation on Facebook's News Feed. (Read more about our partnership with Facebook.)", "The website uses actual quotes by Russell but omits when he actually said them, creating a false connection to Trump.", "The Twentyeightmay story includes this quote by Russell:", "\"This is a business that’s heavily promulgated by people who have a politically liberal bent. I don’t begrudge them that. I’m a libertarian; frankly, I think my liberalness goes far beyond theirs in a lot of ways.\"", "The story said that Russell made those comments in response to Meryl Streep’s comments at the Golden Globes. But Streep’s criticism of Trump for imitating a disabled reporter occurred at the awards ceremony in January 2017 while that quote by Russell was published in September 2016 in an interview with Stephen Whitty, a freelance critic at the time for The New Jersey Star-Ledger.", "Whitty told PolitiFact that Russell \"was talking, very generally, about being a libertarian or conservative in Hollywood\" and that he didn’t recall him ever mentioning any candidate by name.", "The twentyeightmay story also said that Russell recently said: \"The last thing I like to watch is entertainers or actors get political.\"", "Russell did make that statement, but that was on The View in December 2015 when Whoopi Goldberg asked him about his recent comments that he believed gun control laws wouldn’t deter terrorists. At the time he made statements about gun control, he was discussing his upcoming movie The Hateful Eight, directed by Quentin Tarantino.", "\"The last thing I like to watch is entertainers or actors get political. It's just something I can't stand watching. So having said that, no, I was asked, I was asked to put it in context somehow with this movie. You know, my personal feeling is that there's a big difference between fantasyland and reality. Fantasyland is what we do. You're either writing something, writing a song, writing a book, doing a movie, doing a television show. That's fantasyland. And that’s where that stuff belongs.\"", "Russell continued, saying that people have different opinions about how to deal with terrorism and he talked about his views on why the Founding Fathers included the Second Amendment.", "We were unable to find any contact information on the twentyeightmay website.", "A story by the Twentyeightmay website said that actor Kurt Russell said that celebrities shouldn't \"get political\" when it comes to Donald Trump.", "This is a case of using an actual quote by an actor but taking it out of context to create a false impression.", "Russell said in a December 2015 interview on The View, \"The last thing I like to watch is entertainers or actors get political.\" But the Twentyeightmay story portrayed Russell’s quotes as an attack on Trump, and that wasn’t the case. The story didn’t make it clear when Russell made these statements.", "We rate this statement Mostly False.", "Twentyeightmay, \"Kurt Russel Just SHOWED Overpaid Celebs It’s Time To Shut Up About Trump – Hits Them Where It Hurts!\" June 23, 2018", "New Jersey Star-Ledger, \"Kurt Russell on 'Deepwater Horizon,' Hollywood and more,\" Sept. 2e, 2016", "YouTube, Meryl Streep’s Golden Globes speech, Jan. 9, 2017", "YouTube, The View, Dec. 18, 2015", "New York Times, \"Meryl Streep’s Golden Globes speech,\" Jan. 9, 2017", "PolitiFact, \"Donald Trump says Hillary Clinton is 'wrong' to say he mocked a disabled reporter,\" Oct. 20, 2016", "Interview, Stephen Witty, freelance critic, June 25, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]