["The misleading footage has been shared repeatedly on Facebook, for example here where it has been viewed more than 150,000 times since it was posted March 3, 2019.", "The clip, which is six minutes 23 seconds in length, shows a room full of people, some of whom are holding sheets of paper in the air. Some people can be heard shouting profanities in Indonesian against the KPU, a reference to Komisi Pemilihan Umum, Indonesia’s general election commission.", "Below is a screenshot of the misleading post:", "The post’s caption translates to English as: “Members of KPU office in Medan are cheating by perforating the ballots in favour of the candidate number 01. While doing this, they were caught red-handed by supporters of the candidate number 02. Please do watch the activities of every KPU chapter…. It has been really clear which candidate the commission is siding with.. While ideally the commission must remain neutral as an election organiser... Beware…”", "The “01” refers to Widodo’s ballot number, while “02” refers to the number assigned to his sole challenger in the upcoming election, Prabowo Subianto.", "The announcement by the KPU on the ballot numbers for the upcoming polls can be seen here on its official website.", "The misleading video has also appeared on YouTube, for example here where it has been viewed more than 1,000 times since it was posted March 2, 2019, with a title saying: “Medan’s KPU chapter has cheated by perforating the ballots in favour of candidate number 01, being caught red-handed by supporters of the 02.”", "The footage in the misleading posts actually shows a June 2018 incident in North Tapanuli, a regency within North Sumatra province, not Medan, which is the capital of the same province.", "In the misleading video, at 1:48, Indonesian writing can be seen on the interior wall of the building in the clip which says: “General Election Commission Office of North Tapanuli regency”.", "Below is a screenshot of the wall, with the writing circled in red:", "Members of the North Tapanuli Regency General Election Commission can be seen standing in front of the same wall in this article from Indonesian news site sumawa.com published on July 12, 2018.", "Here is a screenshot of the article:", "Through a series of keyword searches, AFP found the exact same footage as is used in the misleading posts had been published on YouTube on June 27 and June 28, 2018.", "The footage can be seen on YouTube, for example, here, here, and here:", "The captions on the original videos claim they show people at North Tapanuli’s KPU office confronting officials after allegedly finding irregularities in a regional election to select its regent.", "Indonesian media reports at the time, for example this Jawa Pos article published on June 28, confirm there was an incident at North Tapanuli KPU in which locals protested against alleged electoral fraud between June 27 and 28, 2018.", "The headline on the Jawa Pos report translates to English as: “Clash breaks out as locals occupy KPU office in North Tapanuli”.", "The translated report says: “Locals occupied on Thursday June 28 the office of KPU in North Tapanuli. They did that as they alleged there had been fraud in the latest regent election.", "“The action started on Wednesday, June 27, evening. But until Thursday, June 28, afternoon, the locals still refused to leave the KPU office.”", "Indonesian news site tempo.co also reported on the same incident here.", "On June 27, 2018, neither Widodo nor Subianto had officially announced they would run in the presidential election.", "The North Tapanuli protest also happened three months before Widodo and Subianto were assigned their ballot numbers in the election. Here is a report which confirms the announcement in the The Jakarta Post.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]