["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Former Senate Majority Leader Harry Reid speaks during a lecture series at the University of Nevada-Reno on April 3, 2018. (AP)", "President Donald Trump famously said, \"When someone attacks me, I always attack back … except 100x more.\" Trump appears to have stuck to this approach with former Senate Democratic leader Harry Reid of Nevada.", "In an interview with CNN, Reid said that George W. Bush, a Republican, was a much better president than Trump. \"There's no question in my mind that George Bush would be Babe Ruth in this league that he's in with Donald Trump,\" Reid said, adding, \"Donald Trump wouldn't make the team.\"", "Trump fired back via Twitter on Feb. 25: \"Former Senator Harry Reid (he got thrown out) is working hard to put a good spin on his failed career. He led through lies and deception, only to be replaced by another beauty, Cryin’ Chuck Schumer. Some things just never change!\"", "Former Senator Harry Reid (he got thrown out) is working hard to put a good spin on his failed career. He led through lies and deception, only to be replaced by another beauty, Cryin’ Chuck Schumer. Some things just never change!", "Trump is entitled to his opinion of Reid’s tenure, which included 12 years as Senate Democratic leader (eight of them as majority leader) and 30 years as a senator overall.", "But he’s wrong to say that Reid \"got thrown out.\" (The White House did not respond to an inquiry.)", "Reid announced that he would not seek another term in March 2015, when he was 75.", "He released a farewell video in which he cited the after-effects of an exercise injury that nearly blinded him in one eye.", "Reid pledged to serve out his term in the Senate as well as his term as the Democratic leader, which at the time meant the minority leader. He fulfilled both promises, leaving the Senate in January 2017. This means that neither the voters of Nevada nor the members of his caucus forced him out of his seat or out of his leadership post.", "\"There is no way to characterize Reid’s departure as being ‘thrown out,’\" said Steven S. Smith, a political scientist at Washington University of St. Louis.", "Jon Ralston, a longtime Nevada journalist, was one of many observers to call out Trump’s assertion about Reid.", "Ralston tweeted, \"Whatever you think of Prince Harry: 1. He did not get thrown out. 2. He may be the most influential senator in NV history. 3. Why not at least be creative and thank him for the nuclear option?\" The last point refers to Reid’s decision to eliminate filibusters for lower-court judicial appointments, which Republicans later expanded to Supreme Court nominations.", "Whatever you think of Prince Harry:1. He did not get thrown out. 2. He may be the most influential senator in NV history. 3. Why not at least be creative and thank him for the nuclear option? https://t.co/3Xb3Pq1Paq", "Trump said Reid \"got thrown out.\" However, Reid declined on his own to run for another term, at a time when his health — in his mid-seventies — had become a concern. Reid ended up retiring on schedule in January 2017, after completing his term in the Senate and his tenure as Democratic leader.", "We rate the statement Pants on Fire.", "Donald Trump, tweet, Feb. 25, 2019", "Jon Ralston, tweet, Feb. 25, 2019", "CNN, \"Harry Reid wishes for George W. Bush again 'every day,'\" Feb. 25, 2019", "New York Times Magazine, \"Harry Reid Has a Few Words for Washington,\" Jan. 2, 2019", "Politico, \"Reid Retiring,\" March 27, 2015", "Email interview with Steven S. Smith, political scientist at Washington University in St. Louis, Feb. 25, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]