["About this rating", "Healthcare reform has been a perennial political project in American politics, from the presidencies of Franklin D. Roosevelt and those of Richard Nixon through Bill Clinton, Barack Obama, and now Donald Trump. Both those for and against the concept of the United States' adopting a universal health care system often use comparisons between the U.S. and other countries to advocate for their positions, as exemplified by a 20 April 2018 post on the \"U.S. Democratic Socialists\" Facebook page featuring a widely-shared meme purportedly outlining the main features of the Japanese healthcare system:", "We examine this meme point-by-point below:", "1. 100 percent of Japanese have health insurance.", "This is basically true. Japan has universal health care, which means that everyone who lives there (except undocumented immigrants and short-term visitors) can access affordable care and is required by law to be covered by some form of insurance. For the most part, residents do this through two kinds of insurance, which are administered by the government: employment-based health insurance, and National Health Insurance (known as \"Kokumin Kenko Hoken\").", "However, Japan's aging population, low birth rate, and economic stagnation have placed a burden on the country's universal health care system, so reforms to that system are under way.", "2. Costs are half of what is spent for healthcare in the United States.", "By the two most commonly-used metrics, this is about right.", "A country's health spending is most often measured in a couple of ways: the percentage of gross domestic product (GDP) spent on healthcare, and healthcare spending per capita (the total amount spent on health care divided by the number of people living in the country).", "According to 2016 data published by the Organisation for Economic Co-operation and Development (OECD), the United States spends 17.2 percent of its GDP on healthcare, by far the highest proportion among developed countries. Japan spends 10.9 percent of its GDP, about two-thirds the relative amount the United States does.", "In 2016, total healthcare spending in the United States worked out to be $9,892 per person per year, again by far the highest level in the developed world. In Japan that figure was $4,519 per person, which is less than half than the United States spends.", "3. Japanese can choose their own doctors and see them twice as often as Americans", "Japan has what is known as a \"free access\" system, which means — as the meme correctly states — that for the most part patients can use whichever doctors and hospitals they choose.", "According to the Health and Global Policy Institute, patients should get a referral letter before presenting at larger hospitals. This is partly because the free access system can sometimes mean individuals with only minor ailments present at hospital emergency rooms, creating a backlog for patients in more urgent need of care.", "Japanese people visit doctors even more than twice as often Americans do, at least according to OECD data. Figures from 2011 (the most recent year for which a direct comparison is possible) show that United States residents averaged four doctors' consultations per person that year in the United States, while in Japan the figure was more than three times higher, at 13 doctors' consultations per person that year. (In 2014, that figure was 12.7 doctors' visits per person per year in Japan.)", "4. Japanese have the world's longest life expectancy and the second lowest infant mortality.", "This is true. According to United Nations data, a Japanese person born in 2014 could expect to live, on average, until the age of 83.6, the highest life expectancy figure of more than 200 countries. (Children born in Hong Kong can expect to live to 84, but Hong Kong is a territory of China, not a sovereign nation.)", "Research has shown that the relatively healthy diet and lifestyle of Japanese people, as well as good healthcare, plays a significant role in their longevity.", "United Nations data also show that in 2013, the most recent year for which data are available, Japan had the joint second-lowest rate of infant mortality in the world, defined as the number of children who died under the age of one for every 1,000 live births. With 2.1 infant deaths per 1,000 live births, Japan was ranked second, along with Finland and just behind Iceland and Luxembourg.", "5. 95 percent of Japanese healthcare is not-for-profit.", "It's not clear what this claim means, so we can't really evaluate its accuracy. Does this mean 95 percent of healthcare providers operate on a not-for-profit basis? That 95 percent of procedures are performed on a non-profit basis? That 95 percent of all health care expenditures relates to not-for-profit providers?", "We do know that by law, hospitals in Japan cannot operate for profit, with the exception of large for-profit companies who build hospitals for their own employees. According to an analysis by Ryozo Matsuda, a health policy expert at Ritsumeikan University in Kyoto, 80 percent of hospitals are privately run. Facilities that provide care for elderly and disabled people (e.g., nursing home care, respite care, home care) can operate for profit, and according to Matsuda, most do.", "6. The government sets all fees for medical services and drugs.", "That's true. More specifically, the fees are set by a government-appointed body called the Central Social Insurance Medical Council. A 2016 study in the journal Risk Management and Healthcare Policy described the system as \"a uniform fee schedule at national level,\" noting that \"All providers, no matter whether private or public, share the same prices for their medicines, devices, and services under this nationwide fee schedule.\"", "Ministry of Health, Labor and Welfare (Japan).   \"Overview of Medical Service Regime in Japan.\"\r\n    Accessed 25 April 2018.", "Reich, Michael R. and Kenji Shibuya.   \"The Future of Japan's Health System -- Sustaining Good Health with Equity at Low Cost.\"\r\n    The New England Journal of Medicine.   5 November 2015.", "Otake, Tomoko.   \"April 1 Marks Start of Japan's New Medical Fees and Processes.\"\r\n    Japan Times.   13 February 2018.", "Dumé, Bel.   \"Unlocking the Secrets of Longevity in Japan.\"\r\n    Scientific American.   12 July 2016.", "Matsuda, Ryozo.   \"The Japanese Health Care System.\"\r\n    The Commonwealth Fund.   October 2016.", "Zhang, Xing and Tatsuo Oyama.   \"Investigating the Health Care Delivery System in Japan and Reviewing the Local Public Hospital Reform.\"\r\n    Risk Management and Healthcare Policy.  18 March 2016.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]