["About this rating", "The 2016 U.S. presidential election pitting Republican candidate Donald Trump against Democratic candidate Hillary Clinton was one of the most contentious in American history, capped off by the denouement that although Clinton received nearly 3 million more votes than Trump did, she lost the election because she failed to capture the requisite number of votes under the U.S. electoral college system.", "Both sides attempted to spin this unusual outcome in their favor, with one popular item reposted by conservative pundits such as Allen B. West in a since-deleted  article asserting that Trump had received more votes than Clinton did in a whopping 3,084 out of the 3,141 counties in the U.S.:", "There are 3,141 counties in the United States.", "Trump won 3,084 of them.\nClinton won 57.", "There are 62 counties in New York State.", "Trump won 46 of them.\nClinton won 16.", "Clinton won the popular vote by approx. 1.5 million votes.", "In the 5 counties that encompass NYC, (Bronx, Brooklyn, Manhattan, Richmond & Queens) Clinton received well over 2 million more votes than Trump. (Clinton only won 4 of these counties; Trump won Richmond)", "Therefore these 5 counties alone, more than accounted for Clinton winning the popular vote of the entire country.", "These 5 counties comprise 319 square miles.\nThe United States is comprised of 3, 797,000 square miles.", "When you have a country that encompasses almost 4 million square miles of territory, it would be ludicrous to even suggest that the vote of those who inhabit a mere 319 square miles should dictate the outcome of a national election.", "Large, densely populated Democrat cities (NYC, Chicago, LA, etc) don’t and shouldn’t speak for the rest of our country.", "That claim was woefully wrong.   Although Donald Trump did win the popular vote in a significantly larger number of counties than Hillary Clinton did, the margin was not so one-sided.  Vote tallies by county differ depending on the standards used, but an Associated Press tally of the actual ratio pegged it at 2,626 to 487, not 3084 to 57:", "The Associated Press finds that Clinton won 487 counties nationwide, compared with 2,626 for President-elect Donald Trump.", "The AP considers parishes in Louisiana as counties in election tallies. Washington, D.C., and Alaska have a single statewide reporting unit. Virginia's count includes 95 counties and 38 independent cities.", "TIME magazine put the county total at 2,649 to 503 in favor of Trump (noting that they had counted Alaska’s 40 state districts as counties instead of its 20 “boroughs”).", "The flawed claim about Trump's winning 3,084 out of 3,141 counties was fairly clearly based on a misunderstanding of a 15 November 2016 Breitbart article.  That article did not hold that Donald Trump had won county-wide popular votes by a 3084 to 57 margin, but rather that if one excluded all the votes in 57 particular counties from the national total and only counted votes in the remaining 3084 counties, Donald Trump would have won the national popular vote by a 7.5 million votes:", "Donald Trump won an overwhelming 7.5 million popular vote victory in 3,084 of the country’s 3,141 counties or county equivalents in America’s heartland.", "Fifty-five point seven million out of the 109.3 million Americans who cast their ballots in those counties voted for Trump, while only 48.1 million voted for Hillary Clinton, according to the latest county by county election results reported at Politico. The remaining 5.4 million voted for other candidates.", "Trump’s 7.5 million popular vote landslide in America’s heartland, a resounding 7 point victory in those 3,084 counties over Clinton, 51 percent to 44 percent, gave him a 306 to 232 Electoral College landslide.", "The point of the Breitbart article was that Democratic support in national politics tends to be strongly concentrated in smaller, densely-populated urban areas, while Republican support tends to be more broadly spread across larger, sparsely-populated geographic areas:", "Hillary Clinton, in contrast, had an 8.2 million vote margin in a narrow band of 52 coastal counties and five “county equivalent” cities stretching from San Diego to Seattle on the West Coast and Northern Virginia to Boston on the East Coast. That narrow band included two major cities -- Washington, D.C and Baltimore, Maryland -- included in the five “county equivalent” cities, and three major cities -- Philadelphia, New York, and Boston -- which are included in the 52 counties.", "Clinton received 70 percent of the 18.4 million votes cast in these 52 elite coastal counties. Donald Trump, in contrast, received only 25 percent of the vote in these counties. The remaining 5 percent went to other candidates.", "Many other news outlets, such as TIME, made the same point: \"[T]he majority of [Trump's] counties have small populations, even if they are geographically larger than average. By TIME’s calculations, Trump’s territory accounts for 75.6% of the nation’s land mass, not including water. And yet, he lost the popular vote by nearly 3 million votes, since Clinton won most high-population, urban areas that take up less space but house many more people.\"", "The disparity of population vs. geographic area in voting patterns is not fairly reflected in maps that show vote tallies by geographic area (the first image below) but is much more apparent in cartograms that show regional vote tallies weighted by population density (the second image below):", "What is the import of this \"bimodal divide\" in voting patterns?  Is it the case, as Allen B. West adjured, that \"Large, densely populated Democrat cities (NYC, Chicago, LA, etc) don’t and shouldn’t speak for the rest of our country?\"  That last point is a subjective issue, but we would note that:", "a)  County (and city) voting totals are of no relevance in presidential elections; only state-wide voting totals count.", "b)  The President of the United States is democratically elected to work for the benefit of all the people who live in the United States, not to represent geography.", "c)  The legislative branch of the U.S. federal government was specifically established over 200 years ago to address this \"bimodal divide\" by employing a bicameral system in which one chamber (the House of Representatives) represents states based on population, while the other chamber (the Senate) represents all states equally, regardless of population.", "Leahy, Michael Patrick.   \"Donald Trump Won 7.5 Million Popular Vote Landslide in Heartland.\"\r\n    Breitbart.   15 November 2016.", "Newman, M.E.J.   \"Maps of the 2016 US Presidential Election Results.\"\r\n    University of Michigan.   November 2016.", "Politico.   \"2016 Presidential Election Results.\"\r\n    Updated 22 November 2016.", "The New York Times.   \"Presidential Race Results [by State].\"\r\n    Updated 29 November 2016.", "USGS.gov.   \"Geographic Names Information System FAQ.\"\r\n    Accessed 2 December 2016.", "Wilson, Chris.   \"Here's the Election Map President Trump Should Hang in the West Wing.\"\r\nTIME.   17 May 2017.", "Hickford, Michele.   \"These Numbers Should SHUT UP Liberals About the Electoral College Once and for All.\"\r\n    AllenBWest.com.   29 November 2016.", "Associated Press.   \"Trending Story That Clinton Won Just 57 Counties Is Untrue.\"\r\n    6 December 2016.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]