["By Angelo Fichera", "Posted on May 10, 2019", "Q: Did the comedian Steve Harvey author a post in support of President Donald Trump circulating on social media?", "A: No. It was written by an anonymous, 80-year-old American, according to the conservative website that first published it in 2016.", "Did Steve Harvey make the following statement?", "HOW I FEEL ABOUT TRUMP ~ by Steve Harvey…", "A viral rant that gives props to President Donald Trump and likens immigrants in the country illegally to raccoons repeatedly has appeared in various corners of the internet since early 2016.", "But in its most recent iteration, the writing has found popularity by wrongly attributing it to the comedian and radio and TV host Steve Harvey.", "Social media posts sharing the pro-Trump message and invoking Harvey’s name and image have earned tens of thousands of shares on Facebook.", "Titled “HOW I FEEL ABOUT TRUMP,” the piece describes a scenario in which a basement is full of “hundreds” of raccoons — a problem that that no exterminator “can handle.” But, it says, “one guy … guarantees to get rid of them.” It suggests that other potential shortcomings don’t matter — whether he “smells” or “swears,” or “if he’s an alcoholic,” or “how many times he’s been married.”", "“Yes, he’s a bit of a jerk; Yes, he’s an egomaniac; but we don’t care!” it says of Trump. “The country is a mess because politicians suck, the Republicans and Democrats can be two-faced and gutless, and illegals are everywhere.. We want it all fixed!”", "Some users who commented on the posts that were attributed to Harvey praised the entertainer’s supposed prose. “Mr. Harvey speaks and thinks with common since [sic],” one user wrote. But Harvey didn’t write it.", "Harvey officially endorsed Hillary Clinton for president on his radio show in March 2016. He did meet with Trump in January 2017 to discuss housing issues, but last year Harvey called Trump “one of the most immoral presidents we’ve ever had in my lifetime.”", "The writing about raccoons actually appears to have originated as part of a submission to the conservative website 100percentfedup.com, which published it in March 2016 — before Trump officially clinched the Republican nomination for president. The website wrote that “this letter was sent to 100% FED Up! by an anonymous author,” who was only identified as an “80 year old American.”", "The letter also was republished on the well-known conspiracy theory website InfoWars two days later.", "After that, it took on a life of its own.", "In April 2016, an honorary co-chair of Trump’s presidential campaign in New York invoked the same analogy in a radio interview, saying, “It doesn’t matter what kind of person is the exterminator, OK? They want the raccoons out of the basement.”", "In February 2018, the deputy mayor of a New Jersey town posted the piece on Facebook, prompting an outcry that led to his resignation.", "Then, in September 2018, the post again drew attention — when the Republican candidate for Pennsylvania governor, Scott Wagner, recited parts of it while addressing his supporters, referring to it as “the raccoon story.” Democrats condemned the tale as racist, the Philadelphia Inquirer reported, and a Wagner spokesman told the newspaper that Wagner had read the account “in an email that had been sent to him.”", "Online deceptions have long leveraged celebrities in an attempt to make political points: We’ve debunked false claims about Miley Cyrus, Kurt Russell and Jennifer Aniston, among others.", "In this case, there may be an explanation for the erroneous attribution. A search of public posts on Facebook for “Steve Harvey” and “HOW I FEEL ABOUT TRUMP” shows that one user who posted the text on Facebook in January — earning some 160,000 shares — had something in common with the TV host: His name on the platform is also Steve Harvey. But it is not the account for the comedian.", "Some who posted the same text after it went viral did so with a credit that reads, “COPIED FROM STEVE HARVEY.”", "Dai, Dawn. “Steve Harvey Talks Donald Trump & The Importance Of Voting.” SteveHarveyFM.com. 19 Oct 2018.", "“DEAR RNC: An Everyday American Writes A Letter To Explain The Trump Phenomenon.” 100percentfedup.com.", "“Donald Trump Addresses Republican National Convention.” Video. C-SPAN. 21 Jul 2016.", "Jensen, Elizabeth. “NPR Interview Takes An Inflammatory Turn.” NPR. 21 Apr 2016.", "Seidman, Andrew. “Scott Wagner, Republican nominee for governor, shares story about ‘raccoon’ infestation, invasion.” The Philadelphia Inquirer. 20 Sep 2018.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]