["The claim was published on Facebook here by a New Zealand-based user on October 25, 2020. It has been shared more than 250 times.", "The Facebook post claims an “update from the CDC” released the “actual cause” of the country’s 220,000 Covid-19 deaths were:", "“88,208 - pneumonia & influenza \n\t “17,799 - chronic respiratory disease\n\t “26,365 - respiratory distress syndrome\n\t “44, 261 - hypertensive disease \n\t “23,275 - heart disease\n\t “28,000 - cardiac arrest”", "The Facebook post’s caption reads: “That explains the numbers!”", "The claim was also shared by other Facebook users hundreds of times here, here, here and here.", "The claim, however, is misleading.", "The numbers used in the post appear to have been taken from this CDC data table published on October 21. It is labelled: “Conditions contributing to deaths involving coronavirus disease 2019 (COVID-19)”.", "The data in the table was compiled by the US National Center for Health Statistics (NCHS), which has been tracking the deaths associated with Covid-19 and providing updates on the CDC website.", "A CDC spokesperson told AFP that contrary to the claim made in the Facebook post, the data referenced does not show the “actual cause” of the US’ Covid-19 deaths.", "“Table 3 shows a list of co-morbidities (complications of COVID-19 and other conditions the person had that contributed to death) that were listed on the death certificates along with COVID-19,” the spokesperson said in an email on October 28.", "“The co-morbidities reported in the table reflect important complications caused by COVID-19 (e.g., acute respiratory distress, pneumonia) as well as pre-existing comorbidities (e.g., heart disease, hypertension, diabetes, COPD) that may increase the chance of severe illness or death.”", "NCHS Chief of Mortality Statistics Robert Anderson previously told AFP that it is rare for someone to die solely from Covid-19. Researchers track comorbidities because it helps experts understand who is vulnerable to diseases, he said.", "“You've got things like acute respiratory failure caused by Covid-19, or pneumonia caused by Covid-19. Covid-19 is the underlying cause of death, because it caused pneumonia, which caused the person to die,” Anderson said.", "“We want the sequence of events, we want that causal pathway [that led to the death], and most certifiers [who write death certificates] understand that. So they're going to report ‘pneumonia due to Covid-19’.”", "AFP Fact Check has debunked more than 670 false and misleading claims about the novel coronavirus here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]