["The photo was posted here on Facebook on November 15, 2020. It has been shared more than 2,500 times.", "The photo is overlaid with text that reads: \"The Vice President visited in our place here in Itogon. She brought a lot of Cameramen. But she did not bring relief goods.. For the evacuess [sic]\".", "It is captioned: \"Is this the leader you want?. Everything is just a dream. Vice President x Vlogger\".", "The photo circulated in the aftermath of Typhoon Vamco, which hit the Philippine island of Luzon in November 2020, leaving more than 320,000 people stranded in evacuation centers.", "Robredo visited the heavily-inundated Cagayan province in the country’s northeast after Typhoon Vamco hit, as reported by AFP here.", "Multiple keyword searches on Google, however, found no news reports to indicate she visited the municipality of Itogon, located in the separate province of Benguet.", "Social media users appeared to believe the photo in the misleading posts was recent. One person wrote: \"And without social distancing ,faceshield and face mask, the v.p. is very stupid\".", "The same photo was shared alongside a similar claim on Facebook here, here and here.", "The claim is misleading.", "A Google reverse image search, followed by keyword searches, found the same photo in this September 28, 2018 Facebook post, published by a regional branch of the state-run Philippine Information Agency.", "The photo is captioned, in part: “Vice President Leni Robredo visited the command post at 070, Ucab in Itogon, Benguet where she saw the ground zero and the eroded portion of a mountain that killed more than 50 individuals during the height of typhoon Ompong last week.”", "Below is a screenshot comparison of the photo in the misleading posts (L) and the photo in the PIA Facebook post (R):", "The photo also corresponds with this photo, posted on Facebook on September 28, 2020 by Philippine media organisation News5, in a report about the same landslide in Itogon.", "Robredo also responded to the misleading posts in this November 23, 2020 Facebook post. Her statement reads, in part: “FAKE NEWS ALERT. This picture was taken on September 28, 2018 following a landslide in Itogon, Benguet.”", "Below is a screenshot of her Facebook post:", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]