["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Sen. Bernie Sanders said during a Democratic presidential debate in Flint, Mich., that government officials have added insult to injury by charging citizens astronomical utility rates for lead-tainted water.", "An audience member who lives in Flint asked both Sanders and Democratic primary opponent Hillary Clinton what they would do to help Flint’s residents regain their trust in government. Sanders called the state response \"a disgrace beyond belief\" and said that if he were president, the federal government would take over when a state is incapable of resolving such a crisis. The first place he would start is with dealing with the high price of water.", "\"What is absolutely incredible to me is that water rates have soared in Flint,\" Sanders said on March 6, 2016. \"You are paying three times more for poison water than I am paying in Burlington, Vt., for clean water.\"", "HELP US RAISE $15,000 TO HIRE AN EXTRA FACT-CHECKER", "With all the problems with Flint’s water supply, we wondered if it was accurate that Burlington pays one-third the price for service. We learned Flint did indeed have exorbitantly high rates for water that was poisoned with lead, but the numbers have recently dropped from the level Sanders is citing.", "Rate debate", "The water crisis emerged after Gov. Rick Snyder appointed an emergency manager to oversee policy decisions in Flint, a majority African-American city ravaged by poverty following a drastic decline in the manufacturing industry.", "With the power to overrule local officials, then-emergency manager Michael Brown enacted a 35 percent water rate increase to shore up utilities in 2012 (remember this, because we’re coming back to it). Officials opted in April 2013 to stop getting water from the Detroit Water and Sewerage Department and join a new pipeline project called the Karegnondi Water Authority.", "But the pipeline to bring water from Lake Huron wasn’t finished. While the infrastructure was being built, the city began drawing water from the Flint River in April 2014.", "At this point, it was already apparent water was exceptionally expensive in Flint. In June 2014, the Flint Journal reported that the city charged $35 more per month for water and sewer service than the next-highest rates in Genesee County.", "The Flint River’s corrosive water leached lead from pipes into the city’s supply. After months of complaints from residents, the national media started exposing the issue in the second half of 2015. (You can read a detailed review in our story here.)", "We didn’t hear back from the Sanders campaign about his statement. But at least one source has said Flint had the highest residential water rates in the country.", "Food & Water Watch, an environmental nonprofit that advocates for public utility ownership, surveyed average annual water rates for the 500 largest systems in the United States. They found that in January 2015, Flint’s average water bill was $910 per year.", "Unfortunately, that doesn’t include Burlington (population 42,000), but we can still compare it to Flint’s 100,000 or so residents by looking at the two city’s water rates.", "If you’ve ever read your own water bill, you know sussing out how you get charged is a little perplexing. But all you really need to know is that Food & Water Watch came up with their total by measuring the cost of the average household’s annual drinking water use, which is about 60,000 gallons per year. That translates to about 8,021 cubic feet, and utilities often use cubic feet to set their rates.", "Food & Water Watch also included meter charges that utilities may bill their customers. Flint customers were charged at least $22.90 for a typical home meter, but Burlington Public Works doesn’t charge a meter fee. Both cities’ water departments confirmed the rates we’re using.", "Just to further complicate things: Do you remember that 35 percent emergency rate increase from 2012? A judge ruled in August 2015 that the increase had to be rolled back because the city misused $15.7 million in water funds to settle a lawsuit. The city also must repay those millions.", "Because of the relatively recent change, we decided to compare Burlington and Flint both before the judge’s ruling and after:", "City", "Residential rate per 100 cubic feet", "Water meter charge", "Average annual bill for 8,021 cubic feet", "Flint, January 2015", "$7.92", "$22.90", "$910", "Flint, after August 2015 ruling", "$6.19", "$17.88", "$770", "Burlington", "$4.00", "$0", "$321", "Flint’s residential water rates used to essentially be twice Burlington’s at the start of 2015, but were about 55 percent higher after the judge ruled the rates rolled back. Neither one of those figures is three times as much as Burlington, like Sanders said.", "But that hefty meter fee makes a big difference. We’re including it because you had to pay it if your house in Flint had water service, raising your bill significantly.", "When we look at average annual bills from January 2015, Sanders’ 3-to-1 comparison is pretty close. But after August, Flint customers were paying a little more than twice as much as Burlington residents.", "Our ruling", "Sanders said, \"You are paying three times more for poison water than I am paying in Burlington, Vt., for clean water.\"", "Going back to January 2015, we find that’s the case, as long as we include both water rates and water meter charges in Flint. But after a judge rolled Flint’s rates back in August 2015, people there are paying a little more than twice as much as people in Burlington.", "His numbers are no longer entirely accurate, but Sanders has a point that Flint’s water bills are gallingly expensive. We rate his statement Mostly True.", "Washington Post, \"Transcript: The Democrats’ debate in Flint, annotated,\" March 6, 2016", "City of Flint emergency manager, Order No. 31, May 30, 2012", "Flint Journal, \"Flint emergency manager's budget proposal would cut 36 cops, 19 firefighters,\" April 30, 2014", "Flint Journal, \"Flint monthly water and sewer bills highest in Genesee County by $35,\" June 1, 2014", "Flint Journal, \"Judge orders Flint to cut water rates 35 percent in sweeping injunction,\" Aug. 7, 2015", "CNN, \"How tap water became toxic in Flint, Michigan,\" Jan. 13, 2016", "PolitiFact, \"Who's to blame for the Flint water crisis?,\" Feb. 15, 2016", "Detroit Free Press, \"Flint residents paid America's highest water rates,\" Feb. 17, 2016", "Food & Water Watch, \"The State of Public Water in the United States,\" Feb. 16, 2016", "Flint Journal, \"Flint's built-in water rate increase of 6 percent won't fly, say some on City Council,\" Feb. 25, 2016", "Huffington Post, \"Flint Residents To Get Lower Water Bills,\" Feb. 26, 2016", "CNN, \"Flint paid highest water bills in 2015, survey finds,\" Feb. 27, 2016", "Food & Water Watch, \"Survey of the 500 Largest Community Water Systems,\" January 2015", "Interview with Mary Grant, Public Water for All campaign director, March 7, 2016", "Interview with Peggy Kahn, University of Michigan-Flint political science professor, March 7, 2016", "Interview with Jessica Lavalette, Burlington utility billing administrator, March 7, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]