["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "An election personnel examines a ballot as vote counting in the general election continues at State Farm Arena on Nov. 4, 2020, in Atlanta. (AP)", "As election workers continue to count mail ballots in Georgia, a tweet that falsely claims tens of thousands of mail ballots in Atlanta may be invalidated has gone viral.", "\"40,000 rejected vote by mail ballots in DeKalb County need to be cured by Friday or they will be tossed (mismatch signature, etc.), verify your ballot status,\" says the Nov. 4 tweet, which was shared more than 39,000 times before it was deleted.", "DeKalb County covers a swath of eastern metropolitan Atlanta that overwhelmingly voted for Hillary Clinton in 2016. As of 5 p.m. EST on Nov. 4, an estimated 11% of votes remained to be counted there, and the Associated Press has yet to call Georgia for either President Donald Trump or former Vice President Joe Biden.", "Several readers sent us the tweet and we’ve seen similar claims on Instagram, so we wanted to check it out.", "The post is inaccurate — the DeKalb County Board of Registration and Elections has debunked it.", "(Screenshot from Twitter)", "\"Voters: there is incorrect info circulating regarding the number of DeKalb ballots that need to be cured by Friday,\" the board said in a Nov. 4 tweet. \"Currently, there are approximately 200 ballots that need to be cured and each voter is being contacted via phone or overnight mail.\"", "Jessica Huseman, a reporter who covers voting rights and election administration for ProPublica, offered more context in a tweet.", "\"This county had 170,856 mail ballots requested — 40K rejected would be insanely high for Georgia, which rejected only 1 percent of ballots during the primary,\" she said. \"The secretary of state's office tells me they expect around 3,000 rejections across the whole state.\"", "The confusion could stem from a statement that Georgia Secretary of State Brad Raffensperger gave to reporters on the morning of Nov. 4.", "\"We have about 200,000 ballots left to be counted,\" he said. \"With the absentee ballot process, and there are also about 40,000 to 50,000 early votes that need to be counted. Every legal vote will be counted.\"", "The tweet is inaccurate. We rate it False.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more.", "Instagram post, Nov. 4, 2020", "The New York Times, Georgia Election Results, Nov. 4, 2020", "The New York Times, \"Tracking Which News Outlets Have Called the Presidential Race in Each State,\" Nov. 4, 2020", "Politico, 2016 Georgia Presidential Election Results", "Tweet, Nov. 4, 2020", "Tweet from the DeKalb County Board of Registration and Elections, Nov. 4, 2020", "Tweet from Jessica Huseman, Nov. 4, 2020", "WSB-TV, \"LIVE UPDATES: Gwinnett officials say no new totals until adjudication finished,\" Nov. 4, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]