["About this rating", "On Aug. 26, 2020, 17-year-old Kyle Rittenhouse was arrested and charged with first-degree intentional homicide after he allegedly shot three people — killing two — during a protest the night prior in Kenosha, Wisconsin. In the aftermath of the fatal shooting, which took place at a protest in response to an incident involving a white police officer shooting a Black man named Jacob Blake several times in the back, social media was flooded with information about the identity of the shooter. One of the most viral claims was that Rittenhouse had once attended a rally for U.S. President Donald Trump:", "This is a genuine still from a Trump rally held in Des Moines, Iowa on Jan. 30, and the encircled person appears to be Rittenhouse.", "BuzzFeed News was the first outlet to draw attention to this video. Here's a brief clip from the C-Span video showing Rittenhouse just to the right of the podium behind President Trump:", "https://www.c-span.org/video/?c4902881&newClip", "Identifying a person in a crowd from a few frames is difficult and unreliable. In fact, similar rumors have circulated that ended up being false, such as the claim that Derek Chauvin, the white Minneapolis officer involved in the death of a Black man named George Floyd, was praised by Trump during a rally in 2019. In this case, however, there's additional supporting evidence.", "As noted by Buzzfeed News, Rittenhouse also shared a video from this rally on his since-deleted TikTok page. That video was simply captioned, \"Trump Rally!\"", "The law enforcement–obsessed 17-year-old who was charged with shooting and killing two people and injuring another in Kenosha, Wisconsin, during protests for Jacob Blake appeared in the front row at a Donald Trump rally in January.", "Kyle Howard Rittenhouse’s social media presence is filled with him posing with weapons, posting “Blue Lives Matter,” and supporting Trump for president. Footage from the Des Moines, Iowa, rally on Jan. 30 shows Rittenhouse feet away from the president, in the front row, to the left of the podium. He posted a TikTok video from the event.", "The alleged Kenosha shooter appeared to have two TikTok accounts and a Facebook page. While these social media pages have since been deleted, screenshots show that Rittenhouse posted in support of conservative causes such as Blue Lives Matter. A brief TikTok bio on one account, for instance, contained the phrases \"Trump 2020\" and \"Blue Lives Matter\":", "When White House senior adviser Kellyanne Conway, who recently announced that she was stepping down from her position, was asked about Rittenhouse's attendance at a Trump Rally, she said:", "\"We’re not responsible for the private conduct of people at our rallies any more than … all the crazy people who have been involved with the Obama/Biden campaigns or other things.\"", "Trump 2020 campaign spokesperson Tim Murtaugh also released a statement, saying:", "\"President Trump has repeatedly and consistently condemned all forms of violence and believes we must protect all Americans from chaos and lawlessness. This individual had nothing to do with our campaign and we fully support our fantastic law enforcement for their swift action in this case.\"", "Mihalopoulos, Dan.   \"Kenosha Shooting Suspect Fervently Supported 'Blue Lives,' Joined Local Militia.\"\r\n    NPR.   27 August 2020.", "Willis, Haley, et al.   \"Tracking the Suspect in the Fatal Kenosha Shootings.\"  \r\n  The New York Times.   27 August 2020.", "Mathers, Matt.   \"Kyle Rittenhouse: What We Know About Teenager Who ‘Killed Two’ at Jacob Blake Protests.\"\r\n    Independent.   27 August 2020.", "Johnson, Annysa; Johnson, Mark; Shelbourne, Talis.   \"What We Know About the Victims of the Kenosha Protest Shooting that Killed Two Men and Injured Another.\"\r\n   Milwaukee Journal Sentinel.   27 August 2020.", "Hall, Ellie, et al.   \"The Kenosha Shooting Suspect Was In The Front Row Of A Trump Rally In January.\"\r\n    Buzzfeed.   26 August 2020.", "St. Clair, Stacy, et al.   \"What We Know So Far About Kyle Rittenhouse, the 17-Year-Old Accused of Murder After Fatal Kenosha Protest Shootings.\"  \r\n  Chicago Tribune.   26 August 2020.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]