["The misleading post was published here on Facebook on September 29, 2019.", "Below is a screenshot of the misleading Facebook post:", "The post includes a photo of Pakistan’s Prime Minister Imran Khan.", "The text above the photo states: “American senator Tony Booker said: “If he is selected then it might be the best selection ever, and if he is elected then Pakistanis are the most wise nation in the world.””", "Khan, a former international cricket player, has faced allegations that he became his country’s prime minister in 2018 after a rigged election, which he denies.", "The same photo has been published on Facebook here, here and here; and on Twitter here, here and here with a similar claim.", "It was also shared in a Whatsapp group, as shown in the screenshot below:", "The claim is false; there is no US senator with the name of “Tony Booker”, according to the official website of the United States Senate.", "Below is a screenshot of search results under the surname ‘Booker’:", "US Senator Cory Booker -- a representative from New Jersey and candidate in the Democratic primary race for the presidency -- has the same surname as the senator mentioned in the misleading post. Cory Booker’s middle name is Anthony, according to this US Congress directory.", "But this online search of press releases published on Booker's website as well as a search on Booker’s Twitter account here did not retrieve any results for a statement about Prime Minister Khan.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]