["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "After big primaries in California and New Jersey on June 7, Donald Trump -- the presumptive Republican presidential nominee -- painted a picture of a nation in crisis.", "\"Hard to imagine what's happened to our country,\" Trump said. \"America is being taken apart piece by piece … just rapidly auctioned off to the highest bidder. We're broke. We're broke. (Our debt is) $19 trillion, going quickly to $21 trillion. Our infrastructure is a disaster. Our schools are failing. Crime is rising. People are scared. The last thing we need is Hillary Clinton in the White House or an extension of the Obama disaster.\"", "Critics will take issue with some of those assertions, such as the idea that the United States is \"broke\" -- something we’ve rated False previously.", "But the line from Trump’s remarks that leapt out at us was this one: \"Crime is rising.\" Our previous research has shown that’s not so. So we took a closer look. (Trump’s campaign did not respond to an inquiry.)", "We looked at two broad categories of crime -- violent crime and property crime -- that are frequently cited by experts as catch-all categories. Violent crimes include murder, rape, robbery and aggravated assault, while property crimes include burglary, larceny and motor vehicle theft.", "We turned to FBI data. Such data is submitted voluntarily by local law enforcement agencies, and thus is not perfectly comprehensive. But it is one of two data sets that is generally considered the best available for answering this question.", "First, we looked at the trend for violent crime and found that it has been falling on an almost uninterrupted basis since the early 1990s. The data below shows violent crime per 100,000 population from 1993 to 2014, the last full year for which data is available.", "Next, we looked at property crime data. It showed the same pattern:", "We also looked at the other widely used data set -- the National Crime Victimization Survey, collected by the Justice Department.", "Here, the trend looks quite similar:", "Finally, we asked two criminologists to make sure we weren’t missing something. As it happens, James Alan Fox, the interim director of the School of Criminology and Criminal Justice at Northeastern University, was watching Trump’s speech and noticed the comment as well.", "\"He is incorrect,\" Fox said. \"There are some spikes in homicide and shootings in certain cities, yet other cities continue to experience low rates. As a nation, we are far better off than anytime for the past several decades. Crime rates are low, and there is no consistent and reliable indication that things are getting worse.\"", "\"Mr. Trump is wrong if he is talking about overall crime and even violent crime,\" agreed University of Maryland criminologist Raymond Paternoster. Any possible upward swing in the past year or so wouldn’t show up in the data currently available, he said.", "Our ruling", "Speaking generally about the state of the country, Trump said, \"Crime is rising.\"", "If you look at overall violent and property crimes -- the only categories that would seem inclusive enough to qualify as \"crime,\" as Trump put it -- he is flat wrong. In fact, crime rates have been falling almost without fail for roughly a quarter-century. We rate his claim Pants on Fire.", "UPDATE, July 5, 2016: After we published our article, the American Enterprise Institute, a conservative think tank, published a blog post critiquing our analysis. The post cited preliminary figures for 2015 that show crime rising.", "Our fact-check acknowledged the point made in the post, although this data is preliminary and subject to revision. Two criminologists we checked with before publication warned us that such data may not be indicative of a real trend.", "In addition, while the preliminary data shows spikes in crime rates in some cities, Trump’s statement was broad, without qualifiers, and it came amid comments that painted an overarching image of a nation in decline. Trump didn’t say that crime was rising \"recently\" or \"in recent months\" or \"over the past year\" or \"in some places.\"", "Ultimately, we find that Trump’s sweeping rhetoric about a nation in decline and beset by crime ignores the overall trend of violent and property crime rates over the past 25 years, which is that they have fallen, consistently and significantly. We stand by our rating of Pants on Fire.", "https://www.sharethefacts.co/share/8e5c3910-a384-4b3e-8872-742cd9e7c9d5", "Vox.com, \"Donald Trump actually read his victory speech from a teleprompter. Here’s the transcript,\" June 7, 2016", "FBI, \"Crime in the United States 2014,\" Table 1, by Volume and Rate per 100,000 Inhabitants, 1995–2014", "FBI, \"Crime in the United States 2012,\" Table 1, by Volume and Rate per 100,000 Inhabitants, 1993–2012", "Bureau of Justice Statistics, Crime Victimization 2014, August 2015", "Email interview with James Alan Fox, interim director of the School of Criminology and Criminal Justice at Northeastern University, June 8, 2016", "Email interview with Raymond Paternoster, University of Maryland criminologist, June 8, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]