["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Virginia will go to pot next year if Gov. Ralph Northam has his way.", "The Democrat says he will have legislation introduced this winter that would make Virginia the 16th state - and the first in the South - to legalize marijuana. One of his main reasons, he says, is to end a racial injustice.", "\"People of color and those of not, they use marijuana at the same rate. People of color are three times more likely to get arrested and convicted,\" he said during a Nov. 20 radio interview on WAMU in Washington.", "We fact-checked his statement.", "Marijuana use by race", "The first part of Northam’s claim, that Black and white people use pot at the same rate essentially holds up, according to a 2018 national survey on drug use by the U.S. Department of Health and Human Services:", "18% of Black respondents and 17% of whites said they had used marijuana during the last year;", "12% of Black respondents and 10% of whites said they had used it in the last month.", "A 2017 survey by HHS showed showed nearly identical results:", "17% of Black respondents and 16% of whites said they had used marijuana during the last year;", "12% of Black respondents and 10% of whites said they had used it in the last month.", "In Virginia, the 2018 survey found 7% of Black respondents and 6% of whites said they had used marijuana in the last month; 12% of Black respondents and 11% of whites said they had used it in the last year.", "Marijuana arrests", "Reports show a racial discrepancy in marijuana-related arrests in Virginia and across the nation.", "The Virginia General Assembly’s watchdog agency - the Joint Legislative Audit and Review Commission (JLARC) - issued a draft report in November  with data on the state’s pot arrests from 2010 through 2019. It found 1 people per 1,000. In other words, Black people in Virginia were 3.5 times more likely than white people to be arrested for marijuana.", "That’s very similar to findings in a study issued by the American Civil Liberties Union on April 20, 2020. The study said Black peoples were 3.4 times more likely than white people to be arrested in Virginia for marijuana crimes in 2018. Virginia ranked 27th among 49 states that provided data to the ACLU, which wants marijuana to be legalized (Florida did not cooperate).", "Nationally, Black people were 3.6 times more likely than white people to be run in for marijuana between 2010 and 2018, according to the ACLU. .", "JLARC found that, from 2015 through 2019, Black people were more likely than white people to be arrested for marijuana in each of 88 Virginia localities from which there was enough data to draw a conclusion. The largest discrepancy was in Carroll County, where Black people were 40.4 times more likely than white people to be run in for pot.", "In Hanover County, Black people were 14.8 times more likely than white people to be arrested for marijuana. The racial disparity was 6.4 times higher for Black people in Richmond, 5.2 times higher in Henrico County, and four times higher in Chesterfield County.", "According to JLARC, Virginia averaged 22,000 marijuana arrests a year during the last decade. \"The vast majority...have been for possession of small amounts of marijuana,\" the agency wrote. \"There were about 10 times as many arrests for marijuana possession as for distribution or other marijuana offenses.\"", "Marijuana convictions", "JLARC found that Black people in Virginia were four times more likely than white people to be convicted on marijuana charges from 2010 to 2019. Four Black people per thousand were found guilty, compared to one white person per thousand.", "According to JLARC, 58% of all state marijuana arrests in 2018 resulted in convictions, the vast majority of them winding up with \"fines, court fees and driver license suspensions.\" Forty percent of the cases were dismissed by prosecutors or judges, and 2% resulted in not-guilty verdicts.", "JLARC found Black people were more likely to be prosecuted on pot charges in each of 83 localities where there was enough data to draw a conclusion.", "Our ruling", "In his bid to legalize pot in Virginia, Northam said, \"People of color and those of not, they use marijuana at the same rate. People of color are three times more likely to get arrested and convicted.\"", "Surveys show Black people and white people do use pot at just about the same rate in Virginia. But Black people are 3.5 times more likely than white people to get arrested in Virginia for marijuana offenses, and four times more likely to get convicted.", "If anything, Northam has slightly understated his case, but we don’t usually penalize for that. We rate his statement True.", "Gov. Ralph Northam, WAMU interview, Nov. 20, 2020 (9:29 mark).", "Northam, \"Governor Northam Announces Support for Legalizing Adult-Use Marijuana in Virginia,\" Nov. 16, 2020.", "U.S. Department of Health and Human Services, \"2018 National Survey on Drug Use and Health,\" Tables 1,26B and 1.27B, accessed Nov. 30. 2020.", "Joint Legislative Audit and Review Commission, \"Key Considerations for Marijuana Legalization,\" Nov. 16, 2020.", "American Civil Liberties Union, \"A Tale of Two Countries: Racially Targeted Arrests in the Era of Marijuana Reform,\"  April 20, 2020.", "Email from Alena Yarmosky, Northam press secretary, Dec. 1, 2020.", "Interview and emails with Mark Gribbin, Chief legislative analyst for the Joint Legislative Audit and Review Commission, Dec. 2, 2020.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]