["Twitter user Deepak Shukla recently shared an alleged tweet by the BJP announcing an alliance with the All India Majlis-e-Ittehadul-Muslimeen (AIMIM) for next year’s West Bengal assembly elections. In the recently concluded Bihar assembly elections, Asaduddin Owaisi-led party won five seats. The user posted a screenshot of the alleged tweet and wrote, “Ittehad-e-Bharatiya Janata Muslimeen.” (Archive link)", "इत्तेहाद-ऐ-भारतीय जनता मुसलमीन। 😌😌😌 pic.twitter.com/ejTLJWRjDk", "— Deepak Shukla (@Deep4IND) November 22, 2020", "It was also shared by a Facebook user.", "An alliance between the BJP and AIMIM is a massive political development which would’ve been covered by the media had it been true. However, neither did we find any media reports nor the tweet in question. We also looked through BJP’s deleted tweets on Politwoops, a repository of deleted tweets by prominent handles. No such tweet was found on the website.", "There are also other discrepancies in the screenshot.", "– The username of BJP’s Twitter handle is written as ‘@ BJP4india’, while the official Twitter handle has ‘BJP4India’, i.e, ‘I’ is not small.", "– The time in the viral tweet is mentioned as ‘P.M.’ whereas the Twitter format is ‘PM’.", "– Below the viral tweet, the words ‘Twitter for Web’ is also visible. However, a quick look through the BJP’s Twitter account establishes that it usually tweets from Twitter Wed App or Twitter Media Studio.", "– A closer look reveals that the ‘comment’ option looks slightly different, it is more rounded than the one in the official Twitter app.", "– The text of the viral tweet and the profile picture of the account are not aligned in a straight line.", "We compared the morphed tweet with a genuine tweet from BJP’s official handle.", "A few days ago, similar false claims of a nexus between the BJP and AIMIM chief Asaduddin Owaisi went viral on social media. Photos of Home Minister Amit Shah with West Bengal Chief Minister Mamata Banerjee were shared to claim the duo is planning a conspiracy before the state elections. Prior to this, a 2016 video of Delhi Chief Minister Arvind Kejriwal went viral with claims about a ‘secret deal’ between Owaisi and BJP for Bihar elections.", "Donate Now", "A journalist and a dilettante person who always strives to learn new skills and meeting new people. Either sketching or working.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]