["About this rating", "Since at least August 2019, the viral content website CarNovels advertised a viral story about fishermen on a crab fishing boat, an iceberg, and an animal.", "The online advertisement was hosted by the Taboola advertising platform and bore the headline, \"Fishermen Think They Found A Seal Floating On An Iceberg, Then They Take A Closer Look.\" A variation of the ad claimed: \"Fishermen See Animal On Iceberg, But Then Look Closer.\" The ad also included an image that was posted by one of the boat's crew members:", "Another variation of the ad read: \"Fishermen Are Surprised After Seeing What's Sitting On Iceberg.\" Once readers clicked on the ads, they landed on an 80-slide story with the headline: \"These Fishermen Noticed Something Unbelievable Atop An Iceberg… What Was It?\" It detailed the story of a fishing boat crew that found an Arctic fox on an iceberg.", "We were a bit surprised to find that this story about the fishermen (and one fisherwoman) finding an animal on an iceberg was true. The crew was from South Labrador in Canada. On Dec. 9, 2020, we reached out to one of the crew members, Alan Russell, who told us that the use of the word \"unbelievable\" was \"perfect.\"", "Yes it took us by surprise for sure. Me and my father fished our entire life and never seen anything like it!", "May never see it again.", "We've seen far too many misleading stories that similarly appeared in online advertising, so it was refreshing to find a genuine tale.", "In July 2018, a crew of fishermen and a fisherwoman in a crab fishing boat named the Northern Swan approached an iceberg with an animal on it. They first thought it might be a seal but when they got closer they realized it was an Arctic fox. They found the Arctic fox on the iceberg 4.5 miles (7 kilometers) offshore. They couldn't be sure how it got there.", "Courtesy: Alan Russell", "CBC, the Canadian Broadcasting Corporation, reported:", "Alan Russell of St. Lewis said his ship was about seven kilometres offshore when they spotted something on a nearby iceberg.", "\"We seen something on the ice. Wasn't sure what it was,\" Russell told CBC's Labrador Morning. \"So we got up closer to it. It was a little fox, Arctic fox. And he wasn't very big. He was soaking wet, and the gulls was trying to pick at him.\"", "The crew tried to pull him from the mushroom-shaped iceberg tip, but the skittish fox wouldn't let them close. So they used the boat to knock the ice pan down and fished the fox from the water with a net.", "\"He was in pretty hard shape because it was so cold in the water,\" said Russell.", "Courtesy: Alan Russell", "People.com also reported that Mallory Harrigan, Cliff Russell, and Alan Russell were on the boat. After the Arctic fox left the iceberg, they scooped him up after he had grown tired from swimming.", "Courtesy: Alan Russell", "The crew could tell that the Arctic fox hadn't eaten in quite a while, so they fed him vienna sausages and water.", "The frozen fellow ended up being pretty tame once he realized they were there to help him.", "\"A friend of ours later told us that an Arctic fox should have brown fur this time of year,\" Harrigan tells PEOPLE. \"The fact that his coat was still mostly white was an indicator of how long he had been out there, which may have been weeks.\"", "It was fortunate the Northern Swan happened to find the stranded animal. Harrigan says there was an unusual amount of ice this year and they had been trying to avoid it.", "\"The winds had also changed southwest, so if we hadn't found him when we did, he would've only drifted farther out to sea.\"", "Courtesy: Alan Russell", "The Dodo also reported on the story, saying that the crew gave the Arctic fox an \"old doghouse\" on William's Harbour. As of 2018, he lived on a small island.", "National Geographic published that Arctic foxes can survive incredibly cold temperatures:", "The Arctic fox is an incredibly hardy animal that can survive frigid Arctic temperatures as low as –58°F in the treeless lands where it makes its home. It has furry soles, short ears, and a short muzzle—all-important adaptations to the chilly clime. Arctic foxes live in burrows, and in a blizzard they may tunnel into the snow to create shelter.", "It's possible that the Arctic fox was following a polar bear to eat leftover scraps, a characteristic mentioned by National Geographic. However, CBC reported that Alan Russell, who was on the boat, \"figures the fox was probably looking for food on solid sea ice and then got caught when it broke up.\"", "In July 2020, Harrigan addressed the whereabouts of the Arctic fox, two years after they first rescued him. An Instagram commenter asked if there were any recent photos, and Harrigan answered: \"Unfortunately no! We were hoping he was going to stick around for a while but believe it or not he went right back into the water and swam off to another island! He was spotted in a nearby community shortly after this happened back in 2018, but we haven't seen any foxes since!\"", "In sum, yes, a crew of fishermen and one fisherwoman rescued an animal from an iceberg. It turned out to be an Arctic fox.", "Snopes debunks a wide range of content, and online advertisements are no exception. Misleading ads often lead to obscure websites that host lengthy slideshow articles with lots of pages. It's called advertising \"arbitrage.\" The advertiser's goal is to make more money on ads displayed on the slideshow's pages than it cost to show the initial ad that lured them to it. Feel free to submit ads to us, and be sure to include a screenshot of the ad and the link to where the ad leads.", "On Nov. 11, 2021, this story was update with a new ad variation.", "Jordan Liles is a Senior Reporter who has been with Snopes since 2016.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]