["About this rating", "Since at least January 2021, actor Anthony Hopkins was featured in an online advertisement about the height of Hollywood celebrity men. The ad read: \"Some of the Shortest Men in Hollywood Today.\"", "Readers who clicked the online ad were led to a 95-page story on Cleverst.com. Its headline read: \"These Short Male Celebrities Remind Us That Height Doesn't Matter In Hollywood.\" The lengthy article began with a picture of actor Dave Franco, who is purported to be 5 feet 7.", "We clicked \"next page\" 95 times until we realized we had clicked \"next article\" at the end. Hopkins didn't even show up in the story.", "Anthony Hopkins' height is listed at 5 feet 9 on various sources, including on his IMDb page. The actor is anything but \"short.\"", "Hopkins is perhaps best known for his work in the 1991 classic, \"The Silence of the Lambs.\" He won the best actor Oscar for playing the role of the terrifying cannibal, Hannibal Lecter.", "The long story of \"short male celebrities\" also featured a 6-feet-tall Vin Diesel, a 5 feet 10 Jason Statham, and 5 feet 9 actors Robert Downey Jr. and Tom Hardy. This was hardly a list of \"some of the shortest men in Hollywood today.\"", "The Cleverst.com story appeared to be a strategy known as advertising \"arbitrage.\" The goal was to make more money on ads that were displayed on all 95 pages than it cost to display the original Hopkins clickbait picture. The Hopkins photograph lured the readers. Readers then clicked \"next page\" in a search for Hopkins, who never appeared.", "The business and technology blog Margins defined \"arbitrage\" as \"leveraging an inefficient set of systems to make a riskless profit, usually by buying and selling the same asset.\" They also called it \"the mythical free lunch that economics tells us does not exist.\"", "The same strategy employed for Hopkins' height was used by other advertisers in the past who placed an ad about Pierce Brosnan's net worth. The ad claimed that \"Pierce Brosnan's final net worth left his family in tears.\" Not only was Pierce Brosnan still alive, but he also did not appear in the lengthy slideshow story that resulted.", "Snopes debunks a wide range of content, and online advertisements are no exception. Misleading ads often lead to obscure websites that host lengthy slideshow articles with lots of pages. It's called advertising \"arbitrage.\" The advertiser's goal is to make more money on ads displayed on the slideshow's pages than it cost to show the initial ad that lured them to it. Feel free to submit ads to us, and be sure to include a screenshot of the ad and the link to where the ad leads.", "Jordan Liles is a Senior Reporter who has been with Snopes since 2016.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]