["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "U.S. Rep. Sean Casten. | Rich Hein/Sun-Times", "In a recent campaign email, U.S. Rep. Sean Casten repeated a talking point often used by Democrats about how little time remains to turn the tide on climate change.", "\"Most climate scientists agree that we only have less than a decade to turn things around or else we’ll be stuck with a 'worst case scenario' including rising sea levels, devastating droughts, and worsening famines,\" read the email, which was attributed to Casten.", "Casten, a former clean-energy entrepreneur who flipped Illinois’ west suburban 6th Congressional District for the Democrats in 2018, isn’t the first politician to contend the planet faces a hard deadline on climate change. Prominent Democrats, including presidential candidate Beto O’Rourke and U.S. Rep. Alexandria Ocasio-Cortez, made similar claims earlier this year that were contradicted by scientists in fact-checks by The Associated Press and CNN.", "Casten’s claim and others like it trace back to a 2018 report by the United Nations Intergovernmental Panel on Climate Change (IPCC).", "That report said nations must take \"unprecedented\" actions to reduce emissions, which will need to be on a significantly different trajectory by 2030 in order to avoid more severe impacts from increased warming. However, it did not identify the hard deadline Casten and others have suggested. In part, that’s because serious effects from climate change have already begun.", "The panel predicted that if warming continues at its current rate global temperatures are likely to reach 1.5 degrees Celsius (2.7 degrees Fahrenheit) above pre-industrial levels between 2030 and 2052. If temperatures exceed 1.5 degrees, the report cautioned, the planet will face greater disruptions, some of which \"may be long-lasting or irreversible.\" To keep temperatures from rising above that temperature, the report stated with high confidence that carbon dioxide emissions would need to start dropping \"well before 2030\" and be on a path to fall by nearly half by 2030.", "Following the report’s release last October, a popular narrative began to emerge that there were only 12 years left to act in order to avoid the most extreme consequences of climate change. But experts say that conclusion overstates the report’s findings, which drew on the work of hundreds of scientists.", "James Skea, co-chairman of the IPCC report and a sustainable energy professor at Imperial College London, told The Associated Press in March that the panel \"did not say we have 12 years left to save the world.\"", "We followed up with Skea, who confirmed the panel has not published any work since then that supports the hard deadline Casten suggested.", "In response to our inquiry, a spokesperson for Casten’s campaign sent us several sources, two of which focused on the IPCC report. One of them, a recent article from InsideClimate News, explained the timeline for reducing emissions laid out by the IPCC does not mean 2030 is the threshold for climate disaster.", "Framing it as a hard deadline is \"more of a messaging tool than a physical science reality,\" said Daniel Swain, a climate scientist at UCLA and the National Center for Atmospheric Research’s Center for Climate and Weather Extremes, who was quoted in the piece.", "\"The next decade is indeed a critical window in which to achieve enough technological, economic and policy momentum toward a carbon-neutral world while minimizing societal disruption,\" he told us. \"But on the other hand there's no geophysical cliff at the end of the decade that makes all our efforts moot if we don't make it all the way.\"", "Duke University climate researcher Drew Shindell, a lead author of the IPCC report’s chapter on mitigation, told us the panel indeed found that \"if we are not on a greatly different path by 2030 than our current trajectory we cannot keep within the 1.5 [degree Celsius] warming target.\"", "\"But we won't necessarily face a 'worst-case scenario' if we don't act in less than a decade as acting during the 2030’s is still better than waiting until say the 2040’s, so there's always an even worse case,\" he said.", "Shindell and others also pointed out that serious effects of global warming, including rising sea levels and worsening droughts, are challenges we already face today and will continue to grow regardless.", "Casten said that \"most climate scientists agree that we only have less than a decade to turn things around or else we’ll be stuck with a ‘worst case scenario’ including rising sea levels, devastating droughts, and worsening famines.\"", "A 2018 UN climate report determined a significant decrease in carbon emissions by 2030 is necessary in order to keep global temperatures from rising 1.5 degrees Celsius above pre-industrial levels in years to come, and to mitigate even more severe effects of a warming planet.", "Experts told us action taken to decrease emissions in the next decade will be critical. However, they said it’s an oversimplification to suggest we face a hard deadline of a decade to address climate change before crossing a threshold into climate disaster.", "We rate Casten’s claim Mostly True.", "MOSTLY TRUE — The statement is accurate but needs clarification or additional information.", "Click here for more on the six PolitiFact ratings and how we select facts to check.", "Campaign email, Casten for Congress, Aug. 18, 2019", "\"AP FACT CHECK: O’Rourke on climate, Trump on ‘no collusion,’\" The Associated Press, March 16, 2019", "\"Fact-checking Trump, AOC climate claims,\" CNN, Jan. 24, 2019", "Report: Understanding Global Warming of 1.5 °C, United Nations Intergovernmental Panel on Climate Change, 2018", "Email interview: James Skea, sustainable energy professor at Imperial College London, Aug. 29, 2019", "Email interview: Chloe Hunt, Casten spokesperson, Aug. 28, 2019", "\"What Does '12 Years to Act on Climate Change' (Now 11 Years) Really Mean?,\" InsideClimate News, Aug. 27, 2019", "Email interview: Daniel Swain, climate scientist at the University of California Los Angeles’ Institute of the Environment and Sustainability, Aug. 29, 2019", "Email interview: Drew Shindell, professor of climate sciences at Duke University, Aug. 29, 2019", "Email interview: Scott Denning, professor of atmospheric science at Colorado State University, Aug. 28, 2019", "Email interview: Kate Marvel, climate scientist at NASA, Aug. 29, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]