["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "If Wisconsin prison inmates who get released don't have a ride from family or friends, are they simply left outside the prison gates?", "Does Wisconsin leave just-released inmates stranded outside the prison gates?", "State Sen. Kathleen Vinehout, an Alma Democrat who is running for governor, painted that picture in a May 1, 2018, interview with Earl Ingram, a liberal radio talk show host on WRRD-AM in Milwaukee.", "Saying she wants to provide better substance abuse and mental health services in prisons because so many inmates suffer from those problems, Vinehout declared:", "These folks need help. They need the ability to be able to deal with their addiction and the health care they need to heal from their mental health issues. And instead, the state doesn’t even give them a bus ticket to get home, let alone help them re-integrate into their community.", "We thought we should check the bus ticket claim.", "No evidence from Vinehout", "Ingram seemed startled. He followed up by asking: \"You mean to tell me, when a person gets out of prison, the state doesn’t even give them a bus ticket to get home?\"", "Vinehout responded vaguely, alluding to legislative hearings on prisons from years earlier. \"Well, we heard a lot of stories,\" she replied \"I have to give\" state Sen. Lena Taylor, D-Milwaukee, \"credit for my education about what’s happening in our prison system.\"", "When we asked Vinehout’s campaign spokesman for evidence to back Vinehout’s claim, we were told she was simply relating what others had told her, \"not talking on her authority.\"", "But in the interview, Vinehout stated the claim as fact.", "And she didn’t backtrack on it when she was asked the follow-up question.", "Other prison-related fact checks:", "39 percent of violent criminals return to prison? Mostly True.", "Probationers do new crimes but don't get probation revoked? Half True.", "State policy", "The state describes its policy on releasing inmates this way:", "Transition from incarceration to community is carefully planned collaboratively by both institution and community corrections staff, coordinated with inmates and community stakeholders and developed in full consideration of the concerns of victims.", "State Department of Corrections spokesman Tristan Cook told us that transition planning with a social worker and, if necessary, probation staff begins three months before an inmate’s release. That includes transportation from the prison. If an inmate doesn’t have transportation from family or friends, the department will provide a ride or a bus ticket, he said.", "It’s worth noting that inmates generally are returned to the county where the crime was committed -- which may or may not be where they lived or now have family.", "Dameon Payton told us the state gave him a bus ticket back to Milwaukee when he was released in March 2018. He said he knew other inmates who were transported by the state.", "Like us on Facebook. Follow us on Twitter: @PolitiFactWisc", "But in practice …", "There are some exceptions, according to non-profit groups that help transition inmates.", "Andre Brown, an employment specialist at Project Return in Milwaukee, estimated that his agency gets calls twice a month from inmates who need rides. He said his agency provides them bus tickets.", "Linda Ketcham, executive director of Madison Area Urban Ministry, said her agency has never received calls like those. Inmates who will be supervised on extended supervision get a ride or a bus ticket from the Department of Corrections, she said. But released inmates who do not go on extended supervision are on their own to arrange transportation, she said.", "The Rev. Jerry Hancock, director of prison ministry for First Congregational Church of Christ in Madison, said in some cases the Department of Corrections drops inmates at the Capitol Square in Madison.", "Our rating", "Vinehout says Wisconsin \"doesn't even give\" released prison inmates \"a bus ticket to get home.\"", "She did not provide any evidence and her claim certainly is not the state’s policy, or general practice.", "What we found is that the state typically provides a ride, or a bus ticket, to released inmates. But occasionally, there are inmates without transportation who get a bus ticket from a non-profit agency.", "Vinehout’s statement has only an element of truth and ignores critical facts that would give a different impression. That’s our definition of Mostly False.", "WRRD-AM, Earl Ingram interview (32:10) of Kathleen Vinehout, May 1, 2018", "Email, Kathleen Vinehout campaign spokesman Greg Leaf, May 7, 2018", "Interview, Wisconsin Department of Corrections spokesman Tristan Cook, May 7, 2018", "Interview, WISDOM executive director David Liners, May 7, 2018", "Interview, Project Return employment specialist Andre Brown, May 7, 2018", "Interview, former prison inmate Dameon Payton, May 7, 2018", "Interview, WISDOM Rev. Jerry Hancock, director of prison ministry for First Congregational Church of Christ in Madison, May 7, 2018", "Wisconsin Department of Corrections, \"Reentry: A Bridge To Success -- 2017 – 2018 Business Plan,\" September 2017", "Interview, Madison Area Urban Ministry executive director Linda Ketcham, May 15, 2018", "Interview, New Song Prison Ministries administrator Brian Cain, May 15, 2018", "Racine Vocational Ministry program coordinator Heather Bennett, May 15, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]