["“Minor child rapists are also human, do they have no human rights. This Hindutva Government is bringing ordinance for death to child rapists just to hang muslims in larger numbers. Muslims aren’t safe in India anymore”. This quote has been ascribed to journalist Rana Ayyub. A tweet with this quote was posted by an account @repubIicTv. The tweet was later deleted, and so was the account.", "Among those who shared this alleged quote included filmmaker Ashoke Pandit, who later deleted it.", "This quote had gone viral on social media in 2018 itself. On Facebook, the quote was shared thousands of times by users. For instance, the page Yogi Adityanath ki Sena (@YogiGKP) which has over 425,000 followers and is a popular page with the right-wing posted this quote translated in Hindi on April 22. Since then, it has been shared more than 10,500 times. It has also been posted on the public group WE SUPPORT REPUBLIC.", "On Twitter, Ayyub was slammed for her ‘views’, particularly by right-wing users.", "अरे बेशर्म @RanaAyyub 60 साल तक बलात्कार पर कोइ कड़ा कानून नही बना लेकिन तब इन बामपंथी पत्रकारों के मुह से एक शब्द भी नही फूटा,आज जब मोदी सरकार ने बलात्कार के खिलाफ एक कठोर कानून बना दिया ह तो इनको ये बर्दाश्त नही हो रहा और तो और बोल रहे है इस कानून मुसलमान के खिलाफ ह #थू💦 pic.twitter.com/VmFObIRNdc", "— Rajinikanth (@rajinikanthoff) April 23, 2018", "The tweet was from the parody account of Republic TV, whose original Twitter handle is @Republic. Original accounts are distinguished by a blue tick. This quote was picked up and widely circulated in an organised manner across various social media platforms. Ayyub herself in a Facebook post clarified that she had not made any such statement and that it was from a spoof account of the news channel.", "The enormity of the fake news problem in India. This tweet has gone viral on whats app/ facebook/ twitter. My phone is…", "Posted by Rana Ayyub on Sunday, April 22, 2018", "While it is argued that such quotes are only for fun as they are posted from parody accounts and need not be taken seriously, the fact that a large majority of social media users consider them to be true and end up perpetuating them makes a compelling case for social media platforms like Twitter to devise mechanisms wherein there is clear visual indication so as to not confuse users and help them distinguish real accounts from fake ones.", "Donate Now", "Arjun Sidharth is a writer with Alt News. He has previously worked in the television news industry, where he managed news bulletins and breaking news scenarios, apart from scripting numerous prime time television stories. He has also been actively involved with various freelance projects. Sidharth has studied economics, political science, international relations and journalism. He has a keen interest in books, movies, music, sports, politics, foreign policy, history and economics. His hobbies include reading, watching movies and indoor gaming.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]