["By Lori Robertson, D'Angelo Gore and Jessica McDonald", "Posted on July 24, 2019", "While former special counsel Robert S. Mueller reiterated in congressional testimony what he said in his voluminous report on the investigation into Russian interference in the 2016 presidential campaign, politicians reiterated some claims about the inquiry and its findings.", "Mueller testified before the House judiciary and intelligence committees on July 24. A redacted version of the special counsel’s 448-page report had been released three months earlier, on April 18. It concluded that “[t]he Russian government interfered in the 2016 presidential election in sweeping and systematic fashion,” detailing the hacking and social media operations involved, as we’ve explained before.", "The report said the “investigation established multiple links between Trump Campaign officials and individuals tied to the Russian government.” It “did not establish that the Campaign coordinated or conspired with the Russian government in its election-interference activities.” See our April 18 story “What the Mueller Report Says About Russian Contacts” for more on that.", "On the issue of potential obstruction of justice by President Donald Trump, the report “found multiple acts by the President that were capable of exerting undue influence over law enforcement investigations, including the Russian-interference and obstruction investigations,” but it “did not draw ultimate conclusions about the President’s conduct,” Mueller wrote, because investigators refrained from making a prosecutorial judgment. As he repeated in his congressional testimony, Mueller wrote in the report that an opinion issued by the Office of Legal Counsel finding that a sitting president couldn’t be indicted factored into the decision to not weigh in on prosecution. For more on the “key events” the report examined regarding  obstruction, see “What the Mueller Report Says About Obstruction.”", "Attorney General William P. Barr told Congress in a March 24 letter that the Department of Justice wouldn’t bring charges against Trump, concluding that “the evidence developed during the Special Counsel’s investigation is not sufficient to establish that the President committed an obstruction-of-justice offense.”", "For an overview of key moments during the Russia investigation, see our timeline of the probe.", "Let’s take a look at some repeated claims made during and about Mueller’s testimony.", "Claim: “President Trump cooperated fully with the investigation.” — Republican Rep. Mike Johnson, during the hearing", "The facts: The Mueller report contradicts that. It said after Trump learned that he was being investigated regarding obstruction, he engaged in “public attacks on the investigation, non-public efforts to control it, and efforts in both public and private to encourage witnesses not to cooperate with the investigation.” The president also didn’t fully cooperate with the special counsel’s requests for an interview.", "Trump declined requests for an in-person interview, and the special counsel sought an interview for “more than a year,” getting written responses in late November 2018 that included more than 30 “does not ‘recall’ or ‘remember’ or have an ‘independent recollection’” answers. Mueller’s team considered a subpoena, but ultimately didn’t pursue it.", "For more, see: “What the Mueller Report Says About Obstruction,” April 18 and “Barr’s Testimony, In Context,” May 2", "Claim: “Today the director outlined in powerful words how Russia intervened massively in our election, systematically in a sweeping fashion. How, during the course of that intervention, they made multiple approaches to the Trump campaign, and far from shunning that foreign involvement in our election, the Trump campaign welcomed it, made full use of it, put it into its communications and messaging strategy and then lied about it.” — Democratic Rep. Adam Schiff, in a post-hearing press conference", "Mueller “found that Trump would and did benefit from Russia’s help and that the campaign welcomed that help.” — Democratic Rep. Jerrold Nadler, in a post-hearing press conference", "The facts: The Mueller report found mixed results on whether the Trump campaign “welcomed” Russian interference. It said that campaign officials were “receptive” to offers of Russian assistance in some cases but “shied away” in other instances.", "The report said it found “multiple links between Trump Campaign officials and individuals tied to the Russian government. Those links included Russia offers of assistance to the Campaign. In some instances, the Campaign was receptive to the offer, while in other instances the Campaign officials shied away.” For example, Russians attempted to have Trump visit Russia during the campaign, but they were rebuffed, according to the Mueller report.", "And in the end, the investigation “did not establish that the Campaign coordinated or conspired with the Russian government in its election-interference activities.”", "The Democrats’ misleading claim is the opposite of one Trump made in June, when he said the campaign had “rebuffed” Russia.", "For more, see: “What the Mueller Report Says About Russian Contacts,” April 18 and “Video: Trump Misleads on ‘Rebuffed’ Russian Offers,” June 14", "Claim: “448 pages [of the Mueller report] — the owner of Fusion GPS that did the Steele dossier that started all this — he’s not mentioned in there.” — Republican Rep. Steve Chabot, during the hearing", "The facts: The “dossier,” a series of memos compiled by former British intelligence officer Christopher Steele on supposed contacts between Russian officials and members of the Trump campaign, is not what “started” the Russia investigation.", "Volume I of the Mueller report clearly says: “In late July 2016, soon after WikiLeaks’s first release of stolen documents, a foreign government contacted the FBI about a May 2016 encounter with Trump Campaign foreign policy advisor George Papadopoulos. Papadopoulos had suggested to a representative of that foreign government that the Trump Campaign had received indications from the Russian government that it could assist the Campaign through the anonymous release of information damaging to Democratic presidential candidate Hillary Clinton. That information prompted the FBI on July 31, 2016, to open an investigation into whether individuals associated with the Trump Campaign were coordinating with the Russian government in its interference activities.”", "Dueling House intelligence committee memos from Democrats and Republicans also agree it wasn’t the dossier that triggered the FBI investigation.", "For more, see: “Dossier Not What ‘Started All of This,'” March 27", "Claim: “Among other things, the FBI used dossier allegations to obtain a warrant to spy on the Trump campaign.”  — Republican Rep. Devin Nunes, in his opening statement", "The facts: The Department of Justice and FBI used the Steele dossier in its application for a court order to conduct electronic surveillance on Carter Page, a former foreign policy adviser to the Trump campaign. But Page had already left the campaign when the bureau made its first request before the Foreign Intelligence Surveillance Court. The FBI filed its request sometime in October 2016, and a redacted version of the application refers to Page as a “former” adviser. Page departed from Trump’s campaign at the end of September that year.", "For more, see: “Q&A on the Nunes Memo,” Feb. 7, 2018", "Claim: “In the Paul Manafort case alone, you recovered as much as $42 million — so that the cost of your investigation to the taxpayers approaches zero.”  — Rep. Nadler, during the hearing", "The facts: As part of his plea deal, Manafort forfeited an estimated $42 million to $46 million in real estate and cash holdings. Mueller’s investigation doesn’t yet have a final price tag, but at the end of September 2018, the cost was $25.2 million. Assuming expenses continued at a similar clip over the last nearly six months of the probe, the total would be approximately $34 million. That would theoretically put the net total in the black, but the funds brought in by asset forfeitures don’t go directly to the investigation. As our fact-checking colleagues at PolitiFact noted, the forfeiture money goes into the Department of Justice Assets Forfeiture Fund, a general fund that the attorney general is allowed to use to pay “any necessary expenses associated with forfeiture operations” or to cover “certain general investigative expenses.”", "For more, see: “Trump’s Campaign Kickoff Claims,” June 19", "Claim: “It has been reported that Robert Mueller is saying that he did not apply and interview for the job of FBI Director (and get turned down) the day before he was wrongfully appointed Special Counsel. Hope he doesn’t say that under oath in that we have numerous witnesses to the interview, including the Vice President of the United States!” — Trump, in a tweet, July 24", "The facts: When asked during the hearing about his May 16, 2017, meeting with Trump at the White House, Mueller did say, “My understanding was I was not applying for the job. I was asked to give my input on what it would take to do the job.”", "Former White House Chief Strategist Steve Bannon also has said that Mueller did not come to the White House for a job interview. In an interview with investigators, the Mueller report says, “Bannon recalled that the White House had invited Mueller to speak to the President to offer a perspective on the institution of the FBI. Bannon said that, although the White House thought about beseeching Mueller to become Director again, he did not come in looking for the job.”", "And in a June 2018 MSNBC interview, Bannon said Mueller was there to “give advice on the type of person that we should select to be FBI director.”", "For more, see: “Debunking Mueller’s ‘Conflicts,’” April 19", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]