["The photo was published in a Facebook post here on April 11, 2019 and has been shared more than 3,200 times.", "The photo appears to show Pakistani Prime Minister Imran Khan (left) dining with Indian Prime Minister Narendra Modi (right):", "This is Khan’s official Twitter account. This is Modi’s official Twitter account.", "The post’s Hindi language caption translates to English as: “The one with the green cap looks a little familiar.”", "In the photo, Modi is seen on the right-hand side wearing a green skullcap.", "The image was also posted on Facebook here and on Twitter here with an identical caption.", "A reverse image search on Google found the image has been doctored from this photo, which was posted on Twitter on July 6, 2015.", "Below is a screenshot of the post:", "The caption states: “#PTI Chief Imran Khan with wife Reham Khan, at Sehri in #Karachi via @Samarjournalist”.", "The photo show Khan dining with his then-wife Reham Khan. This is her official Twitter account.", "The couple divorced in October 2015 after ten months of marriage. Here is an October 30, 2015 article on their marriage published by the Guardian newspaper.", "Pakistani television channel Dunya also posted this video on July 6, 2015, which contains the same photo.", "Below is a screenshot of the image in the video:", "The caption states: “Imran Khan, Reham devour sehri at Faisal Vawda’s residence.”", "“Faisal Vawda” refers to Pakistani politician Faisal Vawda. This is his official Twitter account, on which he refers to himself as the Federal Minister for Water Resources.", "The photo of Modi in the misleading posts was doctored from this photo published by The Indian Express newspaper on November 13, 2013.", "Below is a screenshot of the image:", "Indian news site The Quint published this fact check report about the same photo on April 14, 2019.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]