["About this rating", "The scene appeared to be dramatic. A picture showed a crashed UFO, perhaps an alien spacecraft, surrounded by military and government officials. The craft resembled the shape of a flying saucer. It appeared in an online advertisement:", "The ad read: \"[Gallery] 40+ Wild Photos That the Government Has Declassified.\" Readers who clicked the ad were led to a slideshow article on the Daily Forest website. The story lasted 80 pages.", "The picture from the ad did not show up in the lengthy article. It was nothing more than a still frame from 2016's \"The X-Files: The Event Series.\" A video from 20th Century Studios documented the creation of the alien UFO crash:", "The headline on Daily Forest read: \"Check Out These Fascinating Government Classified Photos.\" However, the article appeared to contain nothing but interesting photographs. None of them appeared to have been classified or declassified in the past.", "For example, one of the pictures showed NASA astronauts practicing a water landing. Its caption read: \"In June 1966, the Apollo 1 crew practices water egress procedures with a full-scale boilerplate model of the spacecraft\":", "Photo via NASA", "The list also featured a publicly available picture from 2015. It depicted a radio telescope under construction in China:", "Photo by Visual China Group via Getty Images", "A third example from the lengthy article was a photograph of the late U.S. Sen. John McCain. It showed the moment he was captured during the Vietnam War on Oct. 26, 1967. At the time, he was known as Lt. Cmdr. John McCain III:", "Senator John McCain is pulled out of a Hanoi lake by North Vietnamese Army soldiers and civilians on October 26, 1967.(Photo By Getty Images)", "The picture had not been classified. In fact, the Los Angeles Times printed the photograph just two days after he was captured.", "In sum, the ad that claimed to lead to \"40+ Wild Photos That the Government Has Declassified\" was nothing more than clickbait. The story lasted 80 pages and the photographs hadn't been classified or declassified. Further, the article didn't explain the alien UFO crash picture that readers clicked in the first place.", "Snopes debunks a wide range of content, and online advertisements are no exception. Misleading ads often lead to obscure websites that host lengthy slideshow articles with lots of pages. It's called advertising \"arbitrage.\" The advertiser's goal is to make more money on ads displayed on the slideshow's pages than it cost to show the initial ad that lured them to it. Feel free to submit ads to us, and be sure to include a screenshot of the ad and the link to where the ad leads.", "Jordan Liles is a Senior Reporter who has been with Snopes since 2016.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]