["By Angelo Fichera", "Posted on January 11, 2019", "A false narrative spread on Facebook claims Rep. Rashida Tlaib was “caught on film trying to attack someone.” The photo in question is actually from a 2016 Trump campaign event she protested.", "Democratic Rep. Rashida Tlaib, a freshman congresswoman from Michigan, has made headlines in her first few days in office.", "But she did not, as a false narrative spread on Facebook claims, get “caught on film trying to attack someone who called her out.”", "“[T]his is who they elected a psychopath who needs to be restrained from attacking some person in the public?” the posts continue.", "That erroneous assertion has in recent days circulated alongside a photo of Tlaib being forcefully moved by two men in suits.", "Reverse image searches show that photo is actually from August 2016 — when Tlaib was among 14 protesters kicked out of a Detroit Economic Club event for heckling then-presidential candidate Donald Trump. The photo appeared on the website of the Michigan-based Arab American News, for example, on Aug. 11, 2016.", "We could find no evidence to support the contention that she was “trying to attack someone.”", "Tlaib’s communications director, Denzel McCampbell, emailed us the following statement from the congresswoman: “The photo is from when I was joined by 12 other women who asked a question of then-candidate Trump during his speech in Detroit. We were all individually removed from the event. My question was, ‘Have you ever read the U.S. Constitution?'”", "In an interview with CNN last year, Tlaib called the act “the most American thing I could ever do.”", "Tlaib, one of the first two Muslim women elected to Congress in 2018, has been the target of misinformation before.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on the social media network.", "Burke, Daniel. “Michigan Democrat likely to be first Muslim woman elected to Congress.” CNN. 8 Aug 2018.", "Harb, Ali. “Tlaib: I protested Trump’s speech for my children.” The Arab American News. 11 Aug 2016.", "Wisely, John. “Economic Club accuses Trump protesters of fraud.” Detroit Free Press. 10 Aug 2016.", "McCampbell, Denzel, communications director for Rep. Rashida Tlaib. Statement emailed to FactCheck.org. 11 Jan 2019.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]