["About this rating", "As the coronavirus pandemic struck the U.S. in spring 2020, states planned to expand voting by mail ahead of the November presidential election as a safer alternative to in-person polling places. Right-wing media and groups have continued to highlight alleged instances of voter fraud in numerous forms over the last few years, and regardless of the veracity behind their claims, this time was no different. U.S. President Donald Trump heavily criticized the use of mail-in ballots, arguing it would result in voter fraud.", "A similar claim emerged from a report that more than 19,000 fraudulent driver's licenses had been seized by U.S. Customs and Border Protection (CBP) at Chicago O’Hare International Airport from early 2020 until June 30. Conservative websites latched onto this story and shared the same post, arguing that the fraudulent licenses would be used to enable record numbers of illegally cast votes through mail-in ballots. One article on the conservative website of David Harris Jr., said:", "Fake ID’s have been around for decades, made by local criminals, but the timing for these IDs coming out of China at the same time Democrats are demanding no ID required universal mail-in voting, should send up red flags everywhere.", "If the progressives are successful, the mail-in ballot system might produce millions of illegally cast votes for Democratic candidates on November 3rd, 2020!", "Snopes readers asked us to investigate claims that these fake driver’s licenses could result in millions of illegally cast votes for Democrats in the November election. But the answer was not as obvious, nor as definitive, as these articles claimed.", "The airport's CBP confirmed that it seized a total of 19,888 counterfeit U.S. driver's licenses from the beginning of 2020 to June 30 in a Chicago airport. The majority of these shipments arrived from China and Hong Kong. The licenses were for various people in different states, and largely for college-aged students.", "Some licenses shared the same image, but with different biographical data. In a news release, the CBP said fraudulent documents like these often “lead to identity theft, worksite enforcement, critical infrastructure protection, fraud linked to immigration-related crimes.\"", "But while reports of the fraudulent documents were accurate, a CBP spokesperson told Snopes that officials had “no evidence” that these fake IDs could be used by individuals to register to vote, and added they were “not able to speculate on this hypothetical situation.”", "The CBP was also concerned that bar codes — which contain a digital record of an individual's personal information —  on fake Michigan IDs had been made in such a sophisticated manner that they could successfully pass through a scanner at an establishment such as a bar or restaurant.", "The spokesperson told us:", "The fake IDs flooding the market today are so sophisticated that they are fooling high tech scanners [...] In regards to the bar code on the back, during the manufacturing process, the machine readable zone on the reverse of the license is encoded with the same information on the face of the license, ensuring a positive check should the license be scanned at a bar. Bar codes are easy to make with off the shelf software.", "Snopes reached out to the Michigan secretary of state, which manages the voting process, regarding concerns over these IDs. Their spokesperson, Tracy Wimmer, highlighted that reproducing a real person's license, with the exact signature and bar code information was \"virtually impossible,\" and voters were validated through many avenues, including contacting the department of state to verify photographs and the driver's license number. A voter's signature must also match the signature the government has on file when they apply for a ballot. Wimmer told us:", "The data elements all need to match between the Qualified Voter File (Ed. Note: also known as the voter registration database maintained by the secretary of state) and license/ID in order for a ballot to be issued plus signatures must match. If a person provides fake document information when registering to vote, the Qualified Voter File would not accept the information and it would require additional review. Because there is no requirement to show a Michigan driver’s license or State ID on Election Day to vote, it is not clear why an individual would use a fake document for that purpose. However, poll workers are trained to issue a provisional ballot if a voter shows ID that leaves the voter’s identity in question.", "She added that they were not concerned about the possibility that such licenses could be used for voter fraud. We highlight the likelihood of such licenses making it through the registration process across the country in more detail in the next section.", "Given that it is difficult to prove whether these falsified documents were intended to be used for a future event — the November election, for example — we assessed the likelihood that such documents could even pass muster in the voter-registration process.", "In order to vote in the U.S. elections, all citizens have to register in every state — with the exception of North Dakota — with online registrations available in 39 states and the District of Columbia. According to the U.S. Election Assistance Commission (EAC), in order to register by mail, first-time voters have to present some form of ID, which could include driver's licenses, or paperwork proving their residence. Individuals registering online to vote may also need some form of state-issued ID.", "The registration information is validated by the state by comparing information provided in the registration forms by each individual against the information provided when the individual received a driver’s license or other state-issued ID. According to the National Conference of State Legislatures (NCSL):", "The signature already on record with the state becomes the signature on record for voting. When the information does not match, the application is sent to officials for further review or action.", "A spokesperson for the National Association of Secretaries of States (NASS), a body comprised of secretaries of states who carry out election administration for different states, told Snopes that individuals attempting to vote using a fake driver’s license or state ID would be flagged, since they wouldn’t match the state’s Department of Motor Vehicles (DMV) records.", "Voter ID laws vary by state, with a total of 36 states requesting or requiring some form of identification at the polls, 35 of which are applying these laws in 2020, with the exception of North Carolina. Other states use other methods at the polls, including most frequently verifying voters' signatures with ones they have on file. Many argue that these ID laws prevent in-person voter impersonation, even though examples of this kind of fraud are extremely rare.", "Thus, it appears to be highly unlikely that the information on a fake license would match exactly with all the other information the government has on file for individuals.", "The above claim posited that these fake licenses would result in millions of votes for Democrats through mail-in ballots, an argument that is both far-fetched and difficult to prove in advance of the election. Voting by mail and absentee ballots have stringent verification procedures that are similar to those used in the registration process.", "A NASS spokesperson told us that for mail voting, signature matches, driver's license numbers, and other identifiers must match with voter-registration records already on file. Security mechanisms also help prevent double-voting. For example, ballot envelopes are barcoded for individual voters, with election officials only accepting one ballot per voter.", "Snopes has previously covered how unlikely it is for fraud to occur through mail-in voting.", "We looked for past examples of fraudulent driver’s licenses actually being used in the voting process and found a 2008 case from Colorado. We were not able to find examples of election officials being fooled by such licenses, however.", "During the 2008 presidential election, a small group of people provided fake license numbers, and officials found voter-registration forms signed by “Rip Van Winkle” and other dubious applicants:", "In summary, we were unable to determine if fake documents were intended to be used in a voter-fraud operation in the U.S., as some people claimed online. But given the security measures in place, and the lack of cases of such fraud occurring, it is highly unlikely that fake IDs could be used to plant false votes. That said, given how little we know definitively ahead of the election, we rate this claim as “Unproven.”", "Al Jazeera English.   \"Trump Says COVID-19 Aid Stalled Over Funds for US Postal Service.\"\r\n   13 August 2020.", "Ballotpedia.   \"Voting in North Dakota.\"\r\n   Accessed 17 August 2020.", "Brennan Center for Justice.   \"Debunking the Voter Fraud Myth.\"\r\n   31 January 2017.", "Das, Arun Kristian.   \"Shipments of Nearly 20,000 Fake Driver's Licenses Seized at Chicago Airport.\"\r\n   Fox10 Phoenix.   29 July 2020.", "Electionlab.mit.edu.   \"Michigan's Election Landscape.\"\r\n   Accessed 19 August 2020.", "Feldman, Max.   \"10 Voter Fraud Lies Debunked.\"\r\n   Brennan Center.   27 May 2020.", "Lee, Jessica.   \"Do Mail-In Ballots Increase Risk of Voter Fraud?\"\r\n   Snopes.   26 May 2020.", "Mueller, Karin Price.   \"Bamboozled: What the Bar Codes on Your Driver's License Reveal About You, and Why it Matters.\"\r\n   NJ.com.   29 March 2019.", "National Conference of State Legislatures.   \"Online Voter Registration.\"\r\n   23 July 2020.", "National Conference of State Legislatures.   \"Voter Identification Requirements: Voter ID Laws.\"\r\n   9 July 2020.", "National Conference of State Legislatures.   \"Voting Outside the Polling Place: Absentee, All-Mail and other Voting at Home Options.\"\r\n   10 July 2020.", "USA.gov.   \"How to Register to Vote.\"\r\n   Accessed 17 August 2020.", "U.S. Customs and Border Protection.   \"Over 19K Fraudulent IDs Seized by CBP Officers in Chicago.\"\r\n   27 July 2020.", "U.S. Election Assistance Commission.   \"National Voter Registration Act.\"\r\n   Accessed 18 August 2020.", "Nur Nasreen Ibrahim is a reporter with experience working in television, international news coverage, fact checking, and creative writing.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]