["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Sarah Palin, the former governor of Alaska, urged her supporters to oppose Democratic plans for health care reform on her Facebook page.", "\"As more Americans delve into the disturbing details of the nationalized health care plan that the current administration is rushing through Congress, our collective jaw is dropping, and we’re saying not just no, but hell no!\" wrote Palin in  a note  posted Aug. 7, 2009.", "She said that the Democrats plan to reduce health care costs by simply refusing to pay for care.", "\"And who will suffer the most when they ration care? The sick, the elderly, and the disabled, of course. The America I know and love is not one in which my parents or my baby with Down Syndrome will have to stand in front of Obama's 'death panel' so his bureaucrats can decide, based on a subjective judgment of their 'level of productivity in society,' whether they are worthy of health care. Such a system is downright evil.\"", "We agree with Palin that such a system would be evil. But it's definitely not what President Barack Obama or any other Democrat has proposed.", "We have read all 1,000-plus pages of the Democratic bill and examined versions in various committees. There is no panel in any version of the health care bills in Congress that judges a person's \"level of productivity in society\" to determine whether they are \"worthy\" of health care.", "Palin's claim sounds a little like another statement making the rounds, which says that health care reform would mandate counseling for seniors on how to end their lives sooner. We rated this claim  Pants on Fire  ! The truth is that the health bill allows Medicare, for the first time, to pay for doctors' appointments for patients to discuss living wills and other end-of-life issues with their physicians. These types of appointments are completely optional, and AARP supports the measure.", "Palin also may have also jumped to conclusions about the Obama administration's efforts to promote comparative effectiveness research. Such research has nothing to do with evaluating patients for \"worthiness.\" Rather, comparative effectiveness research finds out which treatments work better than others.", "The health reform bill being considered in the House of Representatives says that a Comparative Effectiveness Research Center shall \"conduct, support, and synthesize research\" that looks at \"outcomes, effectiveness, and appropriateness of health care services and procedures in order to identify the manner in which diseases, disorders, and other health conditions can most effectively and appropriately be prevented, diagnosed, treated, and managed clinically.\"", "The idea here, which Obama and his budget director Peter Orszag have discussed many times, is to make it easier for doctors, health care workers, insurance companies and patients to find out which treatments are the most effective, as determined by clinical studies and other research.", "Obama has said he believes a comparative effectiveness commission should advise health care workers, not require them to follow certain treatments.", "\"I actually think that most doctors want to do right by their patients. And if they’ve got good information, I think they will act on that good information,\" Obama said during an interview with the  New York Times  on April 28, 2009.", "He also specifically addressed end-of-life care for seniors, discussing the last week of his grandmother's life in 2008, and how her family and doctors decided on treatment for her.", "\"It is very difficult to imagine the country making those decisions just through the normal political channels,\" Obama said. \"And that's part of why you have to have some independent group that can give you guidance. It's not determinative, but I think has to be able to give you some guidance. And that's part of what I suspect you'll see emerging out of the various health care conversations that are taking place on the Hill right now.\"", "And in fact, the House bill states in the section creating the Comparative Effectiveness Research Center and an oversight commission, \"Nothing in this section shall be construed to permit the Commission or the Center to mandate coverage, reimbursement, or other policies for any public or private payer.\" In other words, comparative effectiveness research will tell you whether treatment A is better than treatment B. But the bill as written won't mandate which treatment doctors and patients have to select.", "Palin's statement seems extreme, but other Republicans, like Newt Gingrich, are backing her up. \"You're asking us to trust turning power over to the government, when there clearly are people in America who believe in establishing euthanasia, including selective standards,\" Gingrich said in an interview on  This Week with George Stephanopolous  on Aug. 9, 2009.", "We've looked at the inflammatory claims that the health care bill encourages euthanasia. It doesn't. There's certainly no \"death board\" that determines the worthiness of individuals to receive care. Conservatives might make a case that Palin is justified in fearing that the current reform could one day morph into such a board.", "But that's not what Palin said. She said that the Democratic plan will ration care and \"my parents or my baby with Down Syndrome will have to stand in front of Obama's 'death panel' so his bureaucrats can decide, based on a subjective judgment of their 'level of productivity in society,' whether they are worthy of health care.\" Palin's statement sounds more like a science fiction movie (  Soylent Green  , anyone?) than part of an actual bill before Congress. We rate her statement Pants on Fire!", "Sarah Palin on Facebook,  Statement on the Current Health Care Debate  , Aug. 7, 2009", "U.S. Government Printing Office,  HR 3200  (health care reform legislation), July 14, 2009", "Speaker of the House Web site,  Section-by-Section Analysis of HR 3200  , July 14, 2009", "New York Times,  After the Great Recession (interview with President Barack Obama on health care)  , April 28, 2009", "Brookings Institution,  Implementing Comparative Effectiveness Research: Priorities, Methods and Impact  (Remarks from White House budget dirctor Peter Orszag), June 9, 2009", "ABC News,  This Week with George Stephanopoulos transcript  , Aug. 9, 2009", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]