["The six images were posted here on Facebook on August 10, 2020. The post has been shared more than 8,100 times.", "The post also includes a text graphic; a statement from the Malaysian Meteorological Department; and the department’s map of Peninsular Malaysia.", "The post’s Malay-language caption translates to English as: “Allah is the greatest… No Wonder the Weather Is Weirdly Hot.… There Is An Eruption of Sumatra’s Sinabung Volcano… We’re At The End of Time Now… There Are Many Signs of Doomsday… Are We Aware Or Not???”", "The text graphic states: “Smoke and ashes from the Sinabung volcano is expected to enter Malaysian airspace starting tonight.”", "Mount Sinabung is a volcano located in Indonesia’s North Sumatra province.", "Mount Sinabung erupted on August 10, 2020, emitting a massive amount of ash and smoke 5,000 metres (16,400 feet) into the air. It plunged local communities into darkness with a thick layer of debris, according to an AFP report here.", "The images also appeared in other Facebook posts here, here and here with a similar claim.", "The claim is misleading; most of the images show an arcus cloud formation in Indonesia's Aceh province.", "The natural phenomenon in Aceh was reported by CNN Indonesia here.", "First photo", "The first photo shows a huge grey cloud of smoke in the sky. A reverse image on Google, followed by a keyword search on Google and Twitter, found the video was posted here on Twitter on August 10, 2020.", "Sinabung meletus kembali #sinabung#sinabungmeletus#tanahkaro#BMKG @infoBMKG @bmkg pic.twitter.com/IC8aGtQVYG", "The Indonesian-language tweet translates to English as: “Sinabung erupted again”.", "The eruption of Sinabung was also reported by the Indonesian media here and here.", "Second photo", "The second photo shows a huge cloud over a number of houses.", "A reverse image search followed by a subsequent keyword search on Google found the photo was taken from this clip. It was uploaded to Twitter on August 10, 2020, by Arief Arbianto, whose bio says he lives in Aceh.", "Mohon doanya Kota Meulaboh baik2 saja. Pemandangan awan pagi ini di atas kota Meulaboh, Aceh Barat. pic.twitter.com/gU4jTSa7Zo", "Translated to English, the caption reads: “Please pray that Meulaboh City will be alright. This morning's view of clouds over the city of Meulaboh, West Aceh.”", "One day later, on August 11, 2020, Indonesia’s Meteorology, Climatology, and Geophysical Agency (BMKG) released this statement explaining the phenomenon.", "Translated to English, the Indonesian-language statement is titled: “Weather Phenomenon of Clouds Shaped Like a Tsunami in the Aceh Region August 10, 2020”.", "The statement further says: “Scientifically in the field of meteorology, the cloud phenomenon is called the Arcus cloud… the feature of the Arcus cloud can be found between the Cumulonimbus and Cumulus clouds. An arcus cloud is a general occurrence although the frequency is rare, it has a low cloud base height, and their formation horizontally extends as if they were waves.”", "The statement goes on to say: “The existence of this cloud is purely a cloud formation phenomenon that occurs due to dynamic conditions of the atmosphere and has nothing to do with the potential for earthquakes or tsunamis or mystical things.”", "Below is a screenshot comparison of the second photo in the misleading post (L) and the Twitter video (R):", "Third photo", "The third photo shows a huge cloud over a road and a dirt field.", "A reverse image search followed by a subsequent keyword search on Google found that the photo was taken from this clip, which was posted on the Twitter account of Jakarta-based Radio Elshinta on August 10, 2020.", "(Thread)\n\t\tFenomena alam awan hitam di sekitar Aceh Barat dan Nagan Raya viral di Media Sosial. Awan yg menyerupai gelombang air laut ini diduga terjadi pagi hari tadi (10/8). Ini penjelasan Kepala Bidang Diseminasi Informasi Iklim dan Kualitas Udara BMKG, Hari Tirto Jatmiko: pic.twitter.com/FCfO2gFxsT", "The Indonesian-language tweet, translated to English, partly reads: “The natural black cloud phenomenon around West Aceh and Nagan Raya has gone viral on Social Media. It is believed the cloud which looks like sea waves occurred this morning (August 10).”", "Below is a screenshot comparison of the third photo in the misleading post (L) and the Twitter video (R):", "Fourth photo", "The fourth photo shows a huge cloud over the sea.", "A reverse image search followed by a subsequent keyword search on Google found that the photo was taken from this footage, which was posted on August 10, 2020, by another Aceh-based Twitter user.", "Awan columonimbus melanda pengairan Aceh barat selatan semoga tdk terjadi hal hal yg tdk kita inginkan. pic.twitter.com/FeufGHvCVF", "Its Indonesian-language caption translates to English as: “Cumulonimbus cloud over the waters of southwestern Aceh hopefully things that we don’t want won't happen”.", "Below is a screenshot comparison of the fourth photo in the misleading post (L) and the Twitter video (R):", "Fifth and sixth photos", "The fifth photo shows a huge cloud over a mosque while the sixth photo depicts a cloud in the background overlooking a road.", "A reverse image search followed by a keyword search on Google found the two photos originated from this footage, which was posted on August 10, 2020, by a Twitter user based in Aceh.", "Diambil pukul 09.35 WIB Kab. Aceh Barat, Meulaboh. Cr. (Sw temen)\n\n\t\tTadi mendung sama angin di daerah aku, gelap banget sumpah. Terus pas ujan sama badai nya reda bentuk awan nya kekgini, kek air laut gak sih? Mirip gelombang tsunami. Tapi cantik MasyaaAllah :'). pic.twitter.com/ylS6AUK3hw", "The Indonesian-language caption partly says: “Taken at 9:35 am Indonesian Western Time, West Aceh regency, Meulaboh”.", "Below is a screenshot comparison of the fifth and sixth photos in the misleading post (L) and the Twitter video (R):", "The mosque seen in the footage is the Great Mosque Baitul Makmur Meulaboh.", "The Arcus cloud formation in Aceh on August 10, 2020, was also reported by different Indonesian news outlets, including Kompas.com and CNN Indonesia.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]