["One of the misleading posts was published here on Facebook on January 8, 2021. It has been shared more than 100 times.", "The purported quote shown next to the image of Judith Collins, leader of the New Zealand National Party, reads: “Actually, he’s a damn sight better than any of the other Presidents that have been there before him, including those that you admire, Miss Ardern.”", "The text under the quote reads:  “Judith Collins on Donald Trump.”", "Several Facebook users appeared to believe the quote is genuine and posted critical comments in response. They described the remark as “disgusting”, while berating Collins as “dumb” and “most dangerous woman”, among other pejoratives.", "The purported quote was also shared hundreds of times on Facebook here, here, here and here.", "The posts, however, misquote Collins. They misrepresent what Collins said during a debate against Prime Minister Jacinda Ardern on September 30, 2020. The debate was hosted by New Zealand media outlet Newshub. It was published on the site's YouTube channel here.", "Collins' remarks were given in response to a question from Patrick Gowe, the debate's moderator, about whether Trump was a “dangerous influence on the world”.", "At the YouTube video’s one-hour, 23-minute and 10-second mark, Collins responds by agreeing with Ardern that New Zealand has to find ways to work with foreign leaders. She then adds: “He [Trump] has actually done some quite recent stuff with Israel and UAE and so actually that's better than war, don't you think? He hasn’t been ready to rush into war”.", "The statement refers to the Israel-United Arab Emirates Normalization Agreement, which was signed by the UAE foreign minister, Israeli Prime Minister Benjamin Netanyahu and President Trump at the White House on September 15, 2020.", "At the video’s one-hour, 23-minute and 23-second mark, Ardern then retorts: \"It is a worry when the best thing you can say is at least we haven't had war”.", "Collins responds: \"Well actually it's a damn sight better than any of the other presidents that have been there before, including those you admire Ms Ardern. Actually, I think keeping away from war is a good thing.”", "The quote graphic shared on Facebook replaces “it’s a damn sight better” with “he’s a damn sight better” and omits the final clause of Collin’s reply. The misquote misrepresents the original context, making it appear that Collins was praising Trump generally and not speaking specifically about his administration's Middle East policy.", "The graphic’s attribution, which reads “Judith Collins on Donald Trump”, also misleads readers as it ignores the fact that Collins was speaking solely about Trump’s involvement in brokering the Israel-UAE Normalization Agreement.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]