["About this rating", "On 4 February 2017 the satirical Laughing in Disbelief reported that Vice President Mike Pence planned to create a \"Department of Anti-Witchcraft\" to safeguard religious liberty:", "The Trump administration is working hard to satisfy the voters who put them into power. In that spirit, Vice President Mike Pence is promising Americans he will establish the Department of Anti-Witchcraft (DAW). The handbook of the DAW will be the gold standard of anti-witchery, the 1490 classic the Malleus Maleficarum (The Hammer of Witches).", "The Department of Anti-Witchcraft is yet another sign Mike Pence is large and in charge when it comes to his belief religious liberty is America’s number one domestic and foreign concern. The Vice President plans that DAW will protect vital Judeo-Christian interests wherever they are threatened.", "Reports state that there were discussions inside the administration whether to publicly say that the DAW will protect vital US Judeo-Christian interests. However, President Trump stepped in and pointed out that Judeo-Christian interests are American ones.", "The new federal department is planned to interface with all other federal law agencies (FBI, NSA, ATF, and ZZTop). The Director of DWA will be given powers to train all existing and future agents in the skills needed to combat the Devil and his lickspittles.", "While Laughing in Disbelief is part of the Patheos network of religion-themed blogs, the reference to ZZTop as a \"federal law agency\" was one of many clues as to Laughing in Disbelief's satirical nature. The first sentence in the story also links to a disclaimer which explicitly states:", "Have you clicked a link to a story and you’re here?\nThe story you are reading is satirical. The post may have links to real events that the satire is based on, but the Laughing in Disbelief article is fake.\nThere are winks to readers in each piece besides the link(s) to this page that I humbly offer as hints that the story in question is satirical.\nMaybe there is someone in the story who has a name derived from canard?\nPerhaps the people in the post are named after Confederate generals or Nazis?\nThe article starts out seemingly sane and then spirals into absurdity?\nAll of these, my friends, are signs that the story is a Poe.", "Now go back to reading and have a laugh.", "Arturo Garcia is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]