["About this rating", "A few days after former United States President Donald Trump took office in 2017, he signed an executive order that aimed to fulfill his campaign promise to \"drain the swamp\" in Washington, D.C., by banning former officials from lobbying.", "In the wee hours of Trump's final day in office, he revoked his own executive order.", "Executive Order 13770, entitled \"Ethics Commitments by Executive Branch Appointees,\" was signed by Trump on Jan. 28, 2017. Here's an excerpt from that executive order:", "Section 1. Ethics Pledge. Every appointee in every executive agency appointed on or after January 20, 2017, shall sign, and upon signing shall be contractually committed to, the following pledge upon becoming an appointee:", "“As a condition, and in consideration, of my employment in the United States Government in an appointee position invested with the public trust, I commit myself to the following obligations, which I understand are binding on me and are enforceable under law:", "“1. I will not, within 5 years after the termination of my employment as an appointee in any executive agency in which I am appointed to serve, engage in lobbying activities with respect to that agency.", "While Executive Order 13770 received some criticism at the time — NPR reported that it was very similar to previous executive orders signed by former presidents Barack Obama and Bill Clinton — it was largely seen as an attempt to fulfill Trump's campaign promise to \"drain the swamp.\"", "At around 1 a.m. on Jan. 20, 2021, the final day of Trump's presidency, Trump issued an executive order to revoke the executive order he signed in 2017. That order reads in part:", "Section 1. Revocation. Executive Order 13770 of January 28, 2017, “Ethics Commitments by Executive Branch Appointees,” is hereby revoked, effective at noon January 20, 2021. Employees and former employees subject to the commitments in Executive Order 13770 will not be subject to those commitments after noon January 20, 2021.", "The Associated Press reported:", "President Donald Trump, in one of his final acts of office, released current and former members of his administration from the terms of their ethics pledge, which included a five-year ban on lobbying their former agencies.", "The ethics pledge was outlined in one of Trump’s first executive orders, signed on Jan. 28, 2017, as part of his campaign pledge to “drain the swamp.” It required Trump’s political appointees to agree to the lobbying ban, as well as pledge not to undertake work that would require them to register as a “foreign agent” after leaving government. Trump’s order authorized the attorney general to investigate any breaches of the ethics pledge and to pursue civil suits if necessary.", "This was not the first time an executive order has been revoked. Sitting presidents frequently revoke the executive orders signed by their predecessors. However, presidents have rarely revoked their their own executive orders.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]