["About this rating", "Kenneth Glasgow, who is reportedly Rev. Al Sharpton's half-brother, was arrested and charged with murder; although he spoke at a local March for our Lives rally in Alabama, he wasn't a scheduled speaker.", "Glasgow is accused of driving the car when his passenger opened fire on a woman, killing her; Glasgow isn't accused of firing the weapon, but under Alabama law a person is considered equally culpable for a crime if they are proven to have the \"intent to promote or assist the commission of the offense.\"", "On 26 March 2018, 52-year-old Kenneth Glasgow was arrested for murder in Dothan — a city in southeast Alabama — after police say a passenger in the car he was driving opened fire on a woman in another car and killed her. Two days before his arrest, Glasgow, a community activist, pastor, and reportedly the half-brother of civil rights activist Rev. Al Sharpton, had participated in a local \"March for Our Lives\" protest as part of a nationwide movement against gun violence.", "The story went viral, perhaps due to the juxtaposition of Glasgow's participation in the anti-gun violence rally combined with the fact he is reportedly related to Sharpton. An inaccurate post on Facebook that also spread far and wide claimed, \"Al Sharpton's half brother, an anti gun activist, shoots a person in the head, killing them instantly yesterday. CNN silent.\"", "As is often the case, reality is more nuanced than a clickbait headline can convey. Glasgow and his organization, The Ordinary People Society (TOPS), participated in the March for Our Lives rally on 24 March 2018 in Alabama's Wiregrass region; Glasgow was not an organizer, but he did make an impromptu speech. March for Our Lives Wiregrass organizer Kailee Maciulla told us:", "He did speak on stage but was not scheduled to — our speakers were Tabitha Isner, Audri Scott Williams and Ambrosia Starling along with several students. So while he wasn't scheduled to speak he did in fact come on stage unscheduled and unplanned. He had nothing to do with organizing the march — that was me and several other community members including students. [...] As a member of the community whose family has been the victim of gun violence myself... this crime and whatever Glasglow's participation was is absolutely heartbreaking for me as it pertains to the victim, Breunia Jennings and her family.", "The night after the march, police were called to the scene of a homicide at about 10:50 P.M., where they found Breunia Jennings, 23, shot to death. Jamie Emmanuel Townes, 26, was arrested and charged with capital murder. As the local newspaper the Dothan Eagle reported, Glasgow is not accused of shooting Jennings; Townes allegedly asked Glasgow to drive him around and look for his stolen car. Townes allegedly opened fire on Jennings because he believed she was the car thief — a claim Jennings mother says is not true.", "Glasgow was charged with capital murder due to an Alabama law which holds that a person is legally accountable for a crime committed by another, if:", "(1) he procures, induces, or causes such other person to commit the offense; or (2) he aids or abets such other person in committing the offense; or (3) having a legal duty to prevent the commission of the offense, he fails to make an effort he is legally required to make.”", "According to the Eagle, which sent a reporter to Glasgow's first court hearing on 27 March 2018, Glasgow questioned why he was being charged with the same crime as Townes, saying:", "I don't know why I am facing capital murder charges. I'm not responsible for what someone else does. He just asked me for a ride to take him to look for his car.", "According to Houston County, Alabama jail records, both Glasgow and Townes are both being held with no bond. Glasgow could potentially be released on bond if the charges against him are reduced, the Eagle reported. We were unable to reach Dothan police for further details despite multiple phone calls.", "Wise, Jeremy. \"Kenneth Glasgow's Capital Murder Charge Based on Alabama's Complicity Statute.\"\r\n  The Dothan Eagle. 26 March 2018.", "Forehand, Michele W. \"Kenneth Glasgow Makes First Appearance in Court, Questions Capital Murder Charges Against Him.\"\r\n  The Dothan Eagle. 27 March 2018.", "Harress, Christopher. \"Al Sharpton's Half-Brother Questions Capital Murder Charge.\"\r\n  AL.com. 29 March 2018.", "WTVY. \"March for Our Lives Organizers Say Glasgow Arrest Troubling.\"\r\n  27 March 2018.", "Bedard, Paul. \"Al Sharpton’s Half-Brother Charged in Murder After Marching Against Guns.\"\r\n  Washington Examiner. 27 March 2018.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]