["By Eugene Kiely", "Posted on September 14, 2017", "In promoting his plan to overhaul of the nation’s tax system, President Donald Trump claimed “the rich will not be gaining at all with this plan.” But the tax proposal his administration outlined in April would heavily benefit high-income taxpayers, and Trump hasn’t revealed any changes to it.", "Trump made his remarks prior to a Sept. 13 meeting with members of Congress from both parties. In discussing “our tax proposal,” the president said he wanted to cut the corporate tax rate from 35 percent to 15 percent and lower individual income taxes.", "“And the rich will not be gaining at all with this plan,” Trump added, promising instead that his plan would benefit the “middle class.”", "Of course things may change, but the Trump administration released a one-page outline in April that included these major tax changes:", "In July, the nonpartisan Tax Policy Center estimated the impact of a “Trump-like plan.” Howard Gleckman, a senior fellow at the tax center, wrote that middle-income households (those earning between $50,000 and $86,000) would see an average tax cut of about $1,900 or about 3 percent. But the top 1 percent (those earning more than $732,000) would get an average tax cut of $270,000 or nearly 18 percent, and the top 0.1 percent would see a 20 percent tax cut.", "“Forty percent of the benefits would go to the top 1 percent,” Gleckman wrote.", "The Tax Policy Center analysis comes with the big caveat that the administration did not at the time — and has not since — provided enough details for a more precise estimate.", "Treasury Secretary Steven Mnuchin has said that the administration supports ending all “loopholes,” except those for home mortgages and charitable giving — so the Tax Policy Center analysis takes that into account. But the administration has not specified income ranges for the proposed income tax brackets, so the center’s analysis had to estimate where the three proposed brackets might begin and end.", "Also, the administration is in discussions with Republican leaders that will likely result in changes to Trump’s tax plan.", "For example, the New York Times has reported that the administration is considering leaving the top bracket at 39.6 percent, rather than cutting it to 35 percent.", "Also, House Speaker Paul Ryan has said that cutting the corporate tax rate to “the mid to low 20s” is more “achievable” than 15 percent. But at the Sept. 13 meeting, Trump repeated that “we want a 15 percent rate.”", "“We’re looking at a 15 percent rate,” Trump said. “And we want a 15 percent rate because that would bring us low — not by any means the lowest — but it would bring us to a level where China and other countries are. And we will be able to compete with anybody. Nobody will be able to touch us. So we would like to see 15 percent.”", "Roberton Williams of the Tax Policy Center told us there is “no evidence” that Trump and Republican leaders will abandon “all of the tax cuts that benefit the rich” in Trump’s plan. He added that any effort to merely scale back the tax plan will still benefit the wealthy.", "“Retaining the 39.6% top individual tax rate would limit tax savings for high-income people but they would still benefit from the cuts in lower rates. And any cut in the corporate tax rate would disproportionately favor the rich — they bear most of the burden of that tax and any cut would help them. Just because the rate cut would be smaller doesn’t mean they wouldn’t benefit — they’d just benefit less,” Williams said in an email.", "“And I’ve seen nothing to indicate that the plan would retain either the estate tax or the AMT, two things that hit higher-income households hardest,” Williams added.", "Gleckman, of the Tax Policy Center, ended his July analysis of the Trump-like plan by writing: “While we don’t know what tax plan the president will propose in the coming months, it would have to look very different from what we’ve seen so far to avoid adding trillions of dollars to the debt and heavily skewing its benefits to the highest-income households.”", "In an email, Gleckman told us that nothing has changed since then.", "“In sum,” Gleckman said, “Trump would have to radically restructure what he’s proposed in the past for it to not benefit high-income households.”", "FactCheck.org Rating:", "Read More", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]