["About this rating", "In early January 2020, as bushfires continued to devastate millions of acres on the eastern coast of Australia, various news outlets and social media personalities spread misinformation about the number of people criminally charged with arson in those fires.", "The unprecedented fires, which have killed at least 24 people, have destroyed 1,400 homes and killed millions of animals; the fires have been facilitated by extreme weather linked to climate change, like drought and a prolonged wildfire season in Australia, which has also been experiencing extreme heat. The fires are so powerful they are creating their own weather and are expected to continue burning for months to come.", "But some, including Alex Jones' conspiracy site InfoWars that spreads climate change denialism, falsely reported that \"nearly 200 people\" were arrested in Australia for \"deliberately\" starting bushfires.", "That would be a distortion of the facts. Police in New South Wales released a statement disclosing that since Nov. 8, 2019, 183 people, including 40 juveniles, have been charged with 205 bushfire-related offenses. Of the 183, 24 people have been charged with deliberately setting fires. According to police, of the 183, another \"53 people have had legal actions for allegedly failing to comply with a total fire ban,\" and an additional \"47 people have had legal actions for allegedly discarding a lighted cigarette or match on land.\"", "Local press reports indicate that not all of the people charged committed acts that contributed to the raging brushfires. For example, a man in the Sydney suburb of Wallacia was fined for lighting a fire to make a cup of tea. That blaze was extinguished by firefighters. Another man was cited for lighting a fire to cook food in the town of Tarro. That fire was also put out by responding crews.", "Jason Wilson, a columnist and journalist for The Guardian, wrote, \"Sadly, arsonists exist among us, and are always a factor in bushfires. The number of arrests is being highlighted across right wing media in order to muddy the waters and avoid discussing the real reason that bushfire season is longer and more dangerous.\" Wilson pointed to a statement by a fire captain fighting the fires, who said crews are seeing fires the likes they've never seen before, and the evidence that climate change is driving them is \"overwhelming.\"", "Lutz, Ota. \"NASA's Eyes on Extreme Weather.\"\r\n  Jet Propulsion Laboratory. 18 October 2019.", "Rice, Doyle. \"Climate Change Has Australian Wildfires 'Running Out of Control,' Experts Say.\"\r\n  USA Today. 6 January 2020.", "Knaus, Christopher. \"Bots and Trolls Spread False Arson Claims in Australian Fires 'Disinformation Campaign.'\"\r\n  The Guardian. 7 January 2020.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]