["About this rating", "Less than a week after a photograph of migrants fleeing tear gas at the U.S.-Mexico border attracted attention online, another image captured at a different port of entry stirred unpleasant historical references.", "The latter photograph, depicting three migrants with numbers written on their forearms, was published as part of a 30 November 2018 report by Yahoo News on migrants seeking asylum at the El Paso, Texas, border crossing.", "Yahoo senior editor Dylan Stableford also posted the picture on his own Twitter page, amplifying its visibility online:", "Lorena and her two children hold out their arms to show the numbers they were given to be on a list of migrants seeking political asylum in the United States. (Photo: Adria Malcolm for Yahoo News) pic.twitter.com/JZjB7oXBiE", "— Dylan Stableford (@stableford) November 30, 2018", "While the photograph is legitimate, it is unclear exactly who wrote the numbers on these people's arms, with Yahoo reporting that:", "According to various advocates and others who observed the situation on the bridges over the summer, it was volunteers with the Mexican Red Cross who first created a waiting list to help maintain order within the encampments as asylum seekers waited for their turn to cross. The list was then transferred to the Casa del Migrante along with the asylum seekers when they were forced to move there in November. Accounts vary on when, exactly, and with whom the practice of tracking migrants with numbers on their arms originated, but it has now become a part of the process for all who wish to seek asylum at one of the U.S. ports of entry in El Paso.", "At least two Jewish news outlets that picked up Yahoo's story, the Times of Israel and the Jewish Telegraphic Agency, remarked in their own reporting that the numbers, while reportedly written in marker, resembled the tattoos forced onto prisoners in 1940s concentration camps:", "We contacted the Mexican Red Cross and the National Migration Institute (the Mexican federal agency in charge of immigration oversight) seeking comment but did not hear back prior to publication. Casa del Migrante, a shelter in Ciudad Juarez, Mexico, that provides assistance to migrants, did not respond to multiple phone calls.", "Dickson, Caitlin.   \"Take a Number: Migrants, Blocked at the Border, Wait Their Yurn to Apply for Asylum.\"\r\n    Yahoo News.   30 November 2018.", "The Times of Israel.    \"Migrants Wait at US Border with Numbers Written on Their Arms.\"\r\n    2 December 2018.", "Jewish Telegraphic Agency.    \"ID System for Asylum Seekers in Mexico Recalls Holocaust Tattoos.\"\r\n    3 December 2018.", "Arturo Garcia is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]