["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Missouri Rep. Dave Griffith, R-Jefferson City, proposed a bill that would require the establishment of more veterans treatment courts in Missouri.", "\"Every county in the state of Texas has a veterans court,\" he said in a Feb. 12 judiciary committee hearing on veterans treatment courts.", "According to previous Missourian reporting, Griffith, vice chairman of the Veterans Committee and former Green Beret of the U.S. Army 8th Special Forces Group, said that more veteran treatment courts would make it easier for veterans to reach a court, because some have to drive \"a great deal of a distance\" to follow their program every day.", "According to Justice for Vets, veterans treatment courts are special courts that provide an alternative to incarceration, offering programs to help veterans in the criminal justice system because of substance abuse or mental health disorders get the help and treatment they need.", "We decided to take a closer look at Griffith’s statement, to check if each county in the state of Texas has a veterans treatment court.", "When we asked Griffith about his claim, he said he was referring to what he learned from talking with the administrative assistant of the Gonzales County judge in Texas.", "Griffith said he was deployed to assist following Hurricane Harvey in the fall of 2017. He worked worked in three counties including Gonzales County.", "\"I talked with the judge and his administrative assistant,\" Griffith said. \"His assistant informed me that every county in the state of Texas has a veterans court.\"", "We reached out to Gonzales County to find out more.", "County Judge C. Patrick Davis took over from Judge David Bird at the beginning of the year.", "Davis referred us to Chapter 124 of the Texas Government Code, untitled Veterans Treatment Court Program. But neither this passage of the Texas law nor the judge provided any comment on the number of veterans treatment courts in Texas.", "According to Texvet, treatment courts are available to veterans across 39 counties in Texas. There are 254 counties in Texas, far more than any other state. Texvet is an initiative of Texas A&M University, which connects veterans and their families to resources and services.", "When we informed Griffith about our research, he said he didn't have any reason not to believe what the assistant told him. He told us he didn’t check if every county in Texas has a veterans court but still thinks it’s true.", "He clarified: \"Perhaps she was just talking about the counties that were surrounding San Antonio and the counties around there. But I took it as every county in the state had a veterans court.\"", "According to Veterans Treatment Courts: 2015 Survey Results, a new report by the Justice Programs Office at American University’s School of Public Affairs, Texas had 17 veterans treatment courts programs as of July 2016. According to the same survey, Michigan had the most at 22.", "According to the National Center for State Courts, the U.S. Department of Veterans Affairs counted 461 veteran-focused court programs in the U.S. as of June 30, 2016.", "Holly Shive, communications coordinator for TexVet, and David B. Tucy, Gonzales Veterans County service officer, did not respond to requests for comment.", "Griffith said, \"Every county in the state of Texas has a veterans court.\"", "Based on data for veterans courts, Texas does not have anywhere near 254 veterans courts, the number of counties in the state. We rate the claim False.", "Interview, Dave Griffith, R-Jefferson City, March. 15.", "Email Exchanged with Judge Patrick C. Davis, Gonzales County Judge, from April. 11th to April 18th, 2019.", "Calls and Emails sent to Holly Shive, Communications Coordinator for TexVet, from April. 9th to April 18th, 2019", "Calls and Emails sent to David B. Tucy, Gonzales Veterans County Service Officer, from April. 9th to April 18th, 2019", "Justice for Vets, What is A Veterans Treatment Court?, accessed on Feb. 17, 2019.", "TexVet, Veteran Treatment Courts in Texas, accessed on Feb. 17, 2019.", "The Columbia Missourian, Lawmaker wants to see more veterans treatment courts in the state, accessed on Feb. 17, 2019.", "The Texas Tribune, Why does Texas have so many counties? A history lesson, accessed on Feb. 17, 2019.", "Justice Programs Office (JPO) at American University’s School of Public Affairs,", "Veterans Treatment Courts: 2015 Survey Results, accessed on April. 13, 2019.", "National Center for State Courts, Veterans Courts Resource Guide, accessed on April. 15, 2019.", "U.S. Department of Veterans Affairs, Veterans Court Inventory 2016 Update, accessed on April. 13, 2019.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]