["About this rating", "President Donald Trump's reported request to create a grand military parade caused controversy in early 2018, with critics condemning the idea as \"authoritarian.\" Others urged tolerance of the plan, pointing out that previous U.S. presidents such as John F. Kennedy and Gen. Dwight D. Eisenhower had included troops and weaponry in their inaugural parades.", "Against this background, a widely shared meme emerged in February 2018 containing a purported quotation from General Eisenhower which would lend support to those critical of Trump's proposed parade:", "This statement appears to be not quite a direct quotation by Eisenhower, but rather a paraphrasing of the general-turned-president's position on military parades, which originated in remarks made by the renowned presidential historian Michael Beschloss.", "In an interview with NPR's \"All Things Considered\" broadcast on 7 February 2018, Beschloss pointed out that previous Commanders-in-Chief had held military parades as recently as 1991. However, he noted a distinction between victory parades celebrating  national triumphs and inaugurations and the possibility of such a parade's taking place under President Trump outside of those circumstances:", "During the inaugural parades for Harry Truman, all the way up to John Kennedy, you had tanks, you had Pershing and Nike missiles and things like this, and at the end of many of our wars — from [the] Civil War, World War I and II, [the] Gulf War — you would have parades in Washington and sometimes in New York.", "But to have a parade like this in Washington without an event like that, that's a little bit outside our tradition.", "During the Cold War, Eisenhower's aides suggested to him that the United States should emulate and rival the grand military parades frequently held at that time by the Soviets. Eisenhower rejected the proposals, according to Beschloss: \"Eisenhower said 'Absolutely not. We, the United States, are seeking peace, we are the pre-eminent power on earth. For us to try to imitate what the Soviets are doing in Red Square would make us look weak.'\"", "However, Eisenhower was not entirely opposed to military rallies. After the end of World War II, in August 1945, the general even joined Josef Stalin in Moscow for a victory parade at Red Square. And as we've mentioned, Ike's inaugural parade in 1953 featured troops marching in formation, as well as a display of weaponry.", "Several historians we spoke to told us \"Ike\" would indeed have been opposed to a show of military strength that was not linked to a specific military victory or some other special national occasion.", "None of the experts we consulted knew of a specific conversation between Eisenhower and his staff in which he rejected the idea of a Soviet-style military parade, and we were unable to pinpoint any such proposal or conversation in a number of books about the 34th president.", "We were also unable to contact Michael Beschloss, in order to clarify the origins of his remarks about Eisenhower's stance on the prospect of a military parade.  However, Beschloss' comments don't appear to be a direct quotation from Eisenhower, but rather a statement of Ike's views on the subject. In an email, Ohio University historian Chester Pach told us he concurred with Beschloss's interpretation.", "Pach, who is co-author of The Presidency of Dwight D. Eisenhower, told us the general would have responded negatively to any proposal to hold a Soviet-style military rally: \"My guess is that Eisenhower would have rejected that advice if he got it. He wasn’t someone invested in pomp and circumstance. He knew that power had to be effective in ways other than elaborate displays of military might.\"", "Jaffe, Greg and Philip Rucker.   \"Trump's 'Marching Orders' to the Pentagon: Plan a Grand Military Parade.\"\r\n    The Washington Post.   6 February 2018.", "DeVega, Chauncey.   \"Trump's Military Parade: Straight Out of the Fascist Playbook.\"\r\n    Salon.   8 February 2018.", "Calamur, Krishnadev.   \"Trump Wants a Military Parade -- So What?\"\r\n    The Atlantic.   7 February 2018.", "St. Claire, Adrienne et al.   \"Trump Wants Pentagon to Stage Military Parade Down Pennsylvania Avenue.\"\r\n    NPR.   7 February 2018.", "Atkinson, Brooks.   \"Eisenhower and Stalin Review Parade of 40,000 in Red Square.\"\r\n    The New York Times.   12 August 1945.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]