["About this rating", "In April 2019, local and national news outlets reported that Democrats in the New York State Assembly had voted to block legislation that would have expanded a state program offering tuition assistance to members of Gold Star families (spouses and dependents of service members killed or disabled in the line of duty).", "In most cases, the coverage also noted that a week earlier, the same committee had announced the appropriation of $27 million in tuition aid for Dreamers (the children of undocumented immigrants).", "That information was widely disseminated in online outrage pieces bearing headlines such as \"NY Dems block bill expanding college tuition for Gold Star families after approving $27M in tuition.\"", "Republican legislators reacted to the sequence of events by questioning the Democrats' priorities, as reported by Syracuse.com:", "New York lawmakers refused to advance a bill that would have provided free college tuition to the families of all military personnel from the state who were killed in the line of duty.", "The Assembly’s Higher Education Committee voted 15 to 11 to hold the bipartisan bill, effectively ending its chances of making it to a floor vote this session.", "The move comes a week after lawmakers passed a $175 billion state budget that included $27 million to provide college tuition aid for undocumented immigrants.", "Some Central New York lawmakers said it was outrageous to block a bill that would likely cost in the hundreds of thousands of dollars to help children of military members who died for their county.", "Calling the committee's actions \"disgraceful,\" Republican Assemblyman Gary Finch said: \"Soldiers who lay down their lives and make the ultimate sacrifice represent the best of us. The children they love so dearly deserve access to the opportunity and promise that is the hallmark of this country. I can’t imagine what’s in your heart when you vote 'no' on a bill like this.\"", "New York State Assembly Bill A2991 (also known as the \"Hawley bill\") proposed expanding the state's Military Enhanced Recognition Incentive and Tribute (MERIT) scholarship program -- which already provides tuition and other assistance to family members of military personnel killed or disabled while engaged in (or training for) hostilities -- to include family members of those killed or disabled in non-combat situations. A Republican co-sponsor of the bill said fewer than 500 New York college students would be eligible for the assistance under the provisions of the bill.", "The Democrats who voted to shelve the bill said they weren't opposed to the idea of expanding aid to more families of fallen service members, but rather held the legislation back due to budget considerations. Democratic Assemblyman John T. McDonald III explained as follows in an opinion piece published in the Times Union:", "The committee moved to hold the bill due to the fact that it is an issue that is more appropriately addressed in the context of state budget discussions. The effect of the Hawley bill would significantly change the current program and would increase eligibility to the point where additional funding would be necessary. Therefore, there are very likely significant costs attached to the proposal that were not appropriated for in the 2019-20 enacted state budget.", "The members who voted to hold the bill in committee were not voting against the bill, the issue, or the concept. Instead I believe further discussion is needed on how we fund the bill, rather than advancing a bill that does not have funding attached to it, which would be a disservice to those who may not be as familiar with the state budget process.", "Gov. Andrew Cuomo, a Democrat, expressed his full support for the legislation, as did some other Democratic lawmakers in the state capital. \"We have a moral obligation, a social obligation to help those families who lost their provider, their loved one, in service to this nation,” Cuomo said in a television interview. “So, I would support providing free college tuition to SUNY schools for the children of people who were lost in service to the military.\"", "Cuomo said he believed the bill could still pass during the current legislative session. “It requires a legal change, but I would support that legal change, and we have many more weeks of legislative action,\" he said.", "A compromise bill co-sponsored by Republicans and Democrats in mid-April would have expanded the MERIT program, but wasn't set to go into effect until April 2020, at the beginning of the state's fiscal year. Cuomo said it wasn't soon enough and announced a plan on April 17 to shift funds from other programs to immediately grant tuition assistance to family members of all New York military members who were killed while performing any official duties.", "Betz, Bradford.   \"NY Dems Block Bill Expanding College Tuition for Gold Star Families After Approving $27M in Tuition Aid for Illegal Immigrants: Report.\"\r\n    Fox News.   12 April 2019.", "Campbell, Jon.   \"New York to Expand Gold Star Family Scholarship Amid Controversy, Andrew Cuomo Says.\"\r\n   Democrat & Chronicle.   17 April 2019.", "Madison, Samantha.   \"Local Officials Support Military Scholarship Bill.\"\r\n    Times Telegram.   12 April 2019.", "McDonald, John T.   \"Funding College for Gold Star and Military Families -- Clarifying Misinformation.\"\r\n    Times Union.   10 April 2019.", "Weiner, Mark.   \"Cuomo Supports Free SUNY Tuition for NY Gold Star Children.\"\r\n    Syracuse.com.   11 April 2019.", "Weiner, Mark.   \"NY Assembly Blocks Free College Tuition for More Gold Star Families.\"\r\n    Syracuse.com.   9 April 2019.", "Weiner, Mark.   \"NY Assembly Democrats Defend Blocking Bill to Help Gold Star Families.\"\r\n    Syracuse.com.   10 April 2019.", "New York State Assembly.   \"Approved SFY 2019-20 Budget Includes $27 Million for the Jose Peralta New York State DREAM Act.\"\r\n   31 March 2019.", "New York State Higher Education Services Corporation.   \"Military Enhanced Recognmition Incentive and Tribute - MERIT Scholarship.\"\r\n   Accessed 12 April 2019.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]