["By Saranac Hale Spencer", "Posted on March 7, 2018", "Q: Is Ivanka Trump being fired from the White House?", "A: No. That rumor comes from a headline posted on a group of questionable websites.", "The Trump administration was marked by unusually high staff turnover in its first year — the highest of the last six presidents, according to a report from the Brookings Institution.", "But President Donald Trump’s daughter, Ivanka Trump, has been a steady presence in the White House since the beginning. After initially serving in an informal capacity for the first two months, she took the formal title of “first daughter and advisor to the president” in March 2017.", "Recently, a story has been circulating on Facebook with the headline: “BREAKING: Ivanka Trump Is Finally Being FIRED From The White House — And It Has Trump In A RAMPAGE!”", "But there is no breaking news about Ivanka Trump leaving the White House. Facebook users flagged the story as potentially false. The headline is false, but most of the story is based on a CNN story detailing tension in the White House over Ivanka Trump’s role.", "The story with the false headline originated on a group of websites that go by the name of The Political Voice. There are at least five identical sites with that name that ran the story.", "It also ran on a pair of sites called Realtime Politics — which look very similar to The Political Voice — and on a site called Bernie Believers, which is registered to an owner in Macedonia. The other sites are registered through a company that hides the identity of the owner.", "The Political Voice and Realtime Politics use a lot of click-bait headlines — like “JUST IN: Donald Trump Just Got Hit With Some VERY Bad News About His Finances – And He’s Furious!” — that are attached to stories based on coverage from legitimate news sources. In that case, it was a story about Trump dropping from No. 544 to No. 766 on Forbes’s list of billionaires.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to help identify and label false stories flagged by readers on the social media network.", "Dunn Tenpas, Kathryn. “Why is Trump’s staff turnover higher than the 5 most recent presidents?” The Brookings Institution. 19 Jan 2018.", "Executive Office of the President. Annual Report to Congress on White House Office Personnel. 30 Jun 2017.", "Murray, Sara, et. al. “Exclusive: FBI counterintel investigating Ivanka Trump business deal.” CNN. 2 Mar 2018.", "Zeleny, Jeff, et. al. “Ivanka Trump’s South Korea trip fuels White House tension.” CNN. 27 Feb 2018.", "“BREAKING: Ivanka Trump Is Finally Being FIRED From The White House — And It Has Trump In A RAMPAGE!” The Political Voice. 27 Feb 2018.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]