["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Interior Secretary Ryan Zinke touted the Trump administration’s efforts on reducing gasoline prices and, in the process, beefing up Americans’ disposable income.", "\"As good as the tax bill is, when America pulls up to a pump, and they fill their car up, under the previous administration it was 2 bucks, 4 bucks, 6 bucks, $100 to fill a car,\" Zinke said at the conservative CPAC conference on Feb. 23. \"American energy has delivered. Now it's $60. That’s $40 you have in your pocket — every American that would fill up at a pump station — that you wouldn’t have.\" (The comment is around the 7:20 mark in this C-SPAN video.)", "Have gas prices fallen?", "It’s possible to come up with a 40 percent decline — but the decline came under President Barack Obama, not President Donald Trump.", "According to the federal Energy Information Administration, the peak gasoline price under Obama was $3.96 a gallon in mid May 2011. The low price under Trump was $2.33 — the week he was inaugurated in 2017.", "That’s a 40 percent decline, but the drop came entirely on Obama’s watch.", "For the final two and a half years of Obama’s tenure, the average gallon of gas went no higher than $3.50. It hit a low of $1.73 in February 2016, lower than at any point in the Trump presidency.", "Under Trump, the price at the pump has trended upward. From $2.33 at Trump’s inauguration, it rose to $2.56 in mid February 2018. That’s an increase of almost 10 percent.", "Here’s the full data for gasoline prices under Obama and Trump:", "Probably not on gasoline prices so far, experts say.", "Most of the ramp-up in oil production that benefited consumer prices occurred during what critics have derided as Obama's \"war on fossil fuels,\" said Severin Borenstein, a professor of business administration and public policy at the University of California-Berkeley's Haas School of Business.", "He added that Trump policies on drilling may make a difference going forward. \"To the extent that looser environmental regulations allow greater oil production in the future, that will increase downward pressure on oil prices, and gasoline prices,\" Borenstein said.", "Still, the future price drops from Trump policies may not be massive. \"Increased oil production in the United States has put some downward pressure on crude prices, though that is hardly the only factor in the decline of gasoline prices,\" he said.", "The Interior Department did not get back to us.", "Zinke said, \"Under the previous administration it was … $100 to fill a car. American energy has delivered. Now it's $60. That’s $40 you have in your pocket … that you wouldn’t have.\"", "The only 40 percent drop in the recent data occurred on Obama’s watch, meaning that Trump’s policies couldn’t have influenced it. On Trump’s watch, the price of gasoline has actually risen by 10 percent.", "We rate the statement False.", "Ryan Zinke, remarks at the CPAC conference, Feb. 23, 2018", "Energy Information Administration, gasoline price historical data, accessed Feb. 26, 2018", "Washington Examiner, \"Ryan Zinke credits Trump with US oil boom, lower fuel prices,\" Feb. 23, 2018", "Email interview with Severin Borenstein, professor of business administration and public policy at the University of California-Berkeley's Haas School of Business, Feb. 26, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]