["About this rating", "On Dec. 19, 2019, the Twitter account operated by the 2020 reelection campaign for U.S. President Donald Trump tweeted a misleading message claiming that House Majority Whip James Clyburn (D-S.C.), had called for the president to be hanged.", "The comment Clyburn purportedly made was in regards to news that the U.S. House of Representatives had on the previous day voted to impeach Trump, but that Speaker Nancy Pelosi would not be sending the articles of impeachment to the Republican-dominated U.S. Senate for trial without assurances the process would be fair:", "But that's not what Clyburn said, as would be clear to any viewer who simply watched the video embedded in the tweet.", "According to a CNN transcript of the exchange between Clyburn and CNN \"New Day\" host John Berman, Clyburn was using a figure of speech to describe a trial with a pre-ordained outcome, not literally calling for Trump's hanging:", "BERMAN: Why the delay, Congressman?", "CLYBURN: Well, the delay is made necessary because the majority leader [Mitch McConnell] of the Senate has made it very clear that he's not going to be impartial. He's not going to be fair. He will collude, if you please, with the White House, at least the White House's attorneys, to decide how he will go forward. Why would the speaker of the House step into that without trying to determine exactly what the majority leader plans to do?", "So I applaud her for this. In fact, I was one of the ones arguing that this ought to be the case. And until we can get some assurances from the majority leader that he is going to allow for a fair and impartial trial to take place, we would be crazy to walk in there knowing he set up a kangaroo court.", "BERMAN: How long are you willing to wait?", "CLYBURN: As long as it takes. Even if he doesn't come around to committing to a fair trial, keep those articles here. So keep it as long as it takes. If you know and he's told you what he's going to do, let's give him a fair trial and hang him. It's the reverse of that.", "Clyburn was referencing comments made by Senate Majority Leader Mitch McConnell (R-Ky.), who had publicly said he didn't plan to approach impeachment hearings with impartiality, stating: \"The House made a partisan political decision to impeach. I would anticipate we will have a largely partisan outcome in the Senate. I'm not impartial about this at all.\"", "Another way to understand Clyburn's quote would be if he said, \"McConnell is telegraphing what he's going to do, and it's like [McConnell is saying] 'Let's give him a fair trial and hang him,' except it's the reverse of that.\"", "Because Clyburn was not literally calling for Trump to be hanged but was instead likening the potential trial in the Senate to an already-made decision by jurors to exonerate an accused person regardless of the evidence presented, we rate this claim \"False.\"", "Fandos, Nicholas.   \"Timing of Trump Impeachment Trial in Limbo as Pelosi Holds Out for Assurances.\"\r\n    The New York Times.   18 December 2019.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]