["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A French study of 20 COVID-19 patients indicates the drug might help treat the coronavirus.", "But it is no “100% cure.” U.S. health officials stress the evidence is only anecdotal and that much more study is needed.", "Along with sheltering in place, social distancing and  immunocompromised, you can add this word to the lexicon of COVID-19: chloroquine.", "The drug \"could be a game changer\" in the fight against the new coronavirus, President Donald Trump has said, raising hopes as the nation ramped up its lockdown.", "This post shared on Facebook went even further. It virtually screams of a miracle antidote, claiming:", "\"Huge! Results From Breaking Chloroquine Study Show 100% Cure Rate For Patients Infected With The Coronavirus.\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "There is a new French study that indicates chloroquine might help. But even its authors acknowledged the study is small and the findings are preliminary. And Dr. Anthony Fauci, the most visible U.S. government expert on coronavirus, said evidence for chloroquine is only anecdotal and much more research is needed.", "Chloroquine tablets are available in the United States by prescription only, sold under the brand name Aralen, as well as generic.", "The medicine is prescribed to prevent or treat malaria; it is often taken by Americans before they travel to countries where malaria occurs.", "Another prescription tablet, hydroxychloroquine, sold under the brand name Plaquenil and as a generic, also can be used to prevent malaria, although it is more of an arthritis medicine.", "The claim on Facebook repeated a headline from, and linked to, an article on TeaParty.org from the Gateway Pundit.", "The Gateway Pundit, a conservative website, published its article on March 19, 2020, the same day as the Facebook post.", "It turns out, the headline goes further than the article does, although the article has its own problems.", "The article reported on an interview Fox News talk show host Laura Ingraham did three days earlier with Gregory Rigano about a chloroquine study.", "The article said a study Rigano co-authored found that \"COVID-19 patients who took hydroxy-chloroquine were found free of the disease in six days,\" and that the drug also \"could act as a preventative.\" There are several things about this that are inaccurate.", "The article said Rigano is co-author of the study. But Rigano tweeted it and is not listed as a co-author.", "The article identified Rigano as a doctor, but he is not. Rigano’s website identifies him as a lawyer in Melville, N.Y., whose \"experience includes advancing various pharmaceutical assets through laboratory, animal, formulation, manufacturing, clinical trials (Phase I - III) as well as commercialization.\"", "Rigano’s website also says he is an adviser to a drug program at the Stanford University School of Medicine. But Stanford denied in a WIRED article that Rigano is an adviser.", "Unlike the headline, the article does not state there is a 100% cure for coronavirus.", "As for the French study itself, it does indicate chloroquine has some promise for treating the coronavirus.", "The authors included researchers from universities in France and Vietnam. They reported a few days before the article was published on their study of 20 people in France with COVID-19. They concluded that the use of chloroquine sped up healing, and the effect was reinforced by adding azithromycin, an antibiotic.", "Six of the patients were treated with both hydroxychloroquine and azithromycin. After six days, all six were \"virologically cured.\"", "But U.S. government experts quickly put the possibilities for chloroquine in perspective.", "The day after the article was published, Trump and other federal officials held a news conference about the coronavirus. A reporter posed a question about chloroquine to  Fauci, who has served as director of the National Institute of Allergy and Infectious Diseases since 1984. The question referred to a coronavirus news conference the previous day, when Trump had spoken positively about chloroquine. In his answer, Fauci made reference to the U.S. Food and Drug Administration.", "Here was the exchange:", "Reporter: \"Dr. Fauci, it was explained yesterday there has been promise with hydroxy-chloroquine, this potential therapy for people who are infected with coronavirus. Is there any evidence to suggest that, as with malaria, it might be used as a prophylaxis against COVID-19?\"", "Fauci: \"The answer is no. And the evidence that you’re talking about, John, is anecdotal evidence. So, as the commissioner of FDA and the president mentioned yesterday, we’re trying to strike a balance between making something with a potential of an effect to the American people available, at the same time that we do it, under the auspices of a protocol that would give us information to determine if it’s truly safe and truly effective. But the information that you’re referring to specifically is anecdotal. It was not done in a controlled, clinical trial. So, you really can’t make any definitive statement about it.\"", "The FDA also tempered expectations, saying in a news release is is working closely with other government agencies and academic centers that are studying chloroquine \"to determine whether it can be used to treat patients with mild-to-moderate COVID-19 to potentially reduce the duration of symptoms, as well as viral shedding, which can help prevent the spread of disease. Studies are underway to determine the efficacy in using chloroquine to treat COVID-19.\"", "Based upon limited data, chloroquine or hydroxychloroquine are currently recommended for treatment of hospitalized COVID-19 patients in several countries, according to the U.S. Centers for Disease Control and Prevention.", "A Facebook post claimed results from a chloroquine study show a \"100% cure rate for patients infected with the coronavirus.\"", "The French study of the drug on 20 patients with COVID-19 indicates it could help with treatment, but it is no sure cure. U.S. health experts stress the results are preliminary and much more research is needed.", "We rate the claim False.", "Facebook, post, March 19, 2020", "TeaParty.org, \"Huge! Results From Breaking Chloroquine Study Show 100% Cure Rate For Patients Infected With The Coronavirus,\" accessed March 20, 2020", "YouTube, Laura Ingraham interview (transcript) of Dr. Greg Rigano, March 16, 2020", "C-SPAN, video (38:00) of coronavirus news conference, March 20, 2020", "RiganoLLC.com, \"Gregory J. Rigano,\" accessed March 20, 2020", "WIRED, \"Chloroquine May Fight Covid-19—and Silicon Valley’s Into It,\" March 19, 2020", "New York Times, \"With Minimal Evidence, Trump Asks F.D.A. to Study Malaria Drugs for Coronavirus,\" March 20, 2020", "Mediterranee Infection, \"Hydroxychloroquine and azithromycin as a treatment of COVID-19: results of an open-label non-randomized clinical trial,\" March 18, 2020", "U.S. Food and Drug Administration, news release, March 19, 2020", "U.S. National Institutes of Health, \"AIDS info,\" Sept. 11, 2018", "U.S. Centers for Disease Control and Prevention, \"Medicines for the Prevention of Malaria While Traveling — Chloroquine,\" accessed March 21, 2020", "U.S. Centers for Disease Control and Prevention, \"Medicines for the Prevention of Malaria While Traveling Hydroxychloroquine — Plaquenil),\" accessed March 23, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]