["A quote attributed to Priyanka Chaturvedi claims that the Congress spokesperson said, “पेट्रोल डीजल महंगा होने की वजह से मोदी सरकार सोलर एनर्जी के इस्तेमाल को बढ़ावा दे रही है। इससे थोड़े दिनों में सूरज ठंडा पड़ जाएगा और हर तरफ अँधेरा छा जाएगा| (Modi government is promoting the use of solar energy as the price of diesel and petrol has increased. Because of this, the Sun will become cold and there will be darkness everywhere.)”", "The quote ends with a question – “ये कांग्रेसी जन्मजात ही पागल होते है या कांग्रेस ज्वाइन करने के बाद पागल होते हैं? (Are Congressi mad since birth or after joining Congress?)”", "From a Facebook page ‘मिशन 400+ (साथ है तो अभी जुड़े)’, the post has 4,000 shares.", "The quote has been circulated on WhatsApp as well.", "The graphic was created by a Facebook page ‘The Fearless Indian’ on April 6. It received over 700 shares.", "‘The Fearless Indian’ is run by Devang Dave, who describes himself as the national convenor of IT and social media at the youth wing of the Bharatiya Janata Party, BJYM.", "The quote ascribed to Priyanka Chaturvedi could not be located in any media reports. Alt News contacted the Congress spokesperson who informed that the quote was fake. “This shows the desperation of BJP pages and BJP-supporting pages to create a false narrative,” she said.", "Chaturvedi has often been targetted on social media in a similar fashion. Earlier, a false and provocative quote on Kashmir encounter was attributed to her. The Congress spokesperson and her daughter were, last year, threatened on social media over a fake quote.", "Other Congress leaders have also found themselves in the crosshairs of manufactured statements accredited to them. A clipped video of Ashok Gehlot was used to claim that the Rajasthan CM said that generating electricity will remove energy from water. Earlier, a statement made by Rahul Gandhi (‘Aloo ki factory’) had been subjected to similar treatment following which the Congress president was ridiculed incessantly.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]