["Jeremy \"Spike\" Cohen, the 2020 Libertarian Party vice presidential nominee, has sparked outrage against President Joe Biden on social media with claims that his administration labeled Libertarians terrorists.", "\"A silver lining to the Biden administration labeling Libertarians terrorists is that the CIA will probably start giving us money and weapons now,\" Cohen wrote in a Jan. 22 Facebook post.", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "There is no evidence that the Biden administration has labeled members of the Libertarian Party or people with libertarian views terrorists.", "While Biden referred to the rioters who attacked the Capitol on Jan. 6 as \"domestic terrorists,\" he did not single out libertarians in the roughly 20-minute speech he delivered Jan. 7.", "In his inaugural address, Biden singled out domestic terrorism and white surpremacy as threats the nation \"must confront\" and \"defeat.\" He did not mention libertarians in that address or insinuate libertarians were terrorists.", "Cohen told PolitiFact that he based his post — which he described as \"pretty tongue-in-cheek\" — on a statement made by former CIA director John Brennan during an MSNBC interview.", "Cohen claimed that Brennan, who served under President Barack Obama, said the new administration would be investigating domestic terrorists — including Libertarians.", "In another Facebook post, Cohen referred to the MSNBC video more directly.", "\"It's been less than 24 hours into the new administration, and the former head of the CIA is already on national TV saying that the Biden administration will move with ‘laser-like focus’ on... libertarians,\" Cohen wrote.", "But the video does not substantiate what Cohen claimed.", "Here’s what Brennan said:", "\"I know looking forward that the members of the Biden team, who have been nominated or have been appointed, are now moving in laser-like fashion to try to uncover as much as they can about what looks very similar to insurgency movements that we’ve seen overseas. Where they germinate in different parts of the country, and they gain strength, and it brings together an unholy alliance, frequently, of religious extremists, authoritarians, fascists, bigots, racists, nativists — even libertarians.\"", "Brennan did not say the Biden administration would target libertarians. Brennan does not hold a position within the Biden administration.", "Nick Shapiro, former deputy chief of staff to Brennan at the CIA, told PolitiFact that Brennan's comments in the interview referred to government efforts to find and charge people involved in the attack on the U.S. Capitol on Jan. 6. \"He said 'even libertarians,' since many self-identified libertarians acknowledged their participation in the disgraceful events of 6 January. He was not referring to the Libertarian Party,\" Shapiro said.", "Cohen told PolitiFact that he did not have any proof that Biden himself had labeled Libertarians terrorists.", "Cohen claimed the Biden administration labeled Libertarians \"terrorists.\"", "There is no evidence of this. The claim was based on a misinterpretation of a statement made by a former CIA director who holds no official position in the Biden administration.", "We rate this claim False.", "UPDATED, Jan. 22, 7:26 p.m.: This article was updated to include comment from a spokesperson for Brennan.", "Facebook post, Jan. 22, 2021", "Facebook post, Jan. 21, 2021", "Email interview with Spike Cohen, Jan. 22, 2021", "NBC News, \"Biden slams Capitol rioters as ‘domestic terrorists’: ‘Don't dare call them protesters,’\" Jan. 7, 2021", "NPR, \"Biden Says Capitol Attack Was 'Culmination' Of Trump's Assaults On Democracy,\" Jan. 7, 2021", "WhiteHouse.gov, \"Inaugural Address by President Joseph R. Biden, Jr.,\" Jan. 20, 2021", "Ballotpedia, \"Spike Cohen,\" accessed Jan. 22, 2021", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]