["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Two weeks before the 45th anniversary of Earth Day, Tia Nelson, executive secretary of the Wisconsin Board of Commissioners of Public Lands, was again the topic of a contentious meeting of the agency’s board.", "It’s been that way for several months at the obscure public lands agency, which is overseen by three board members -- Attorney General Brad Schimel, state Treasurer Matt Adamczyk, both Republicans, and Secretary of State Douglas La Follette, a Democrat.", "The 10-employee agency is in charge of managing some of the state's public land and operates a trust that provides funding for school libraries and makes loans to municipalities and school districts. The board has been suggested as a potential source of bonds to help finance a new Milwaukee Bucks arena.", "Since Adamczyk won election in November 2014, he has raised questions about Nelson’s performance and her background as an environmentalist. He requested years of her phone and travel records and unsuccessfully tried to get her fired at the March 3, 2015 meeting.", "Schimel and La Follette voted down a motion by Adamczyk to remove Nelson, daughter of Earth Day founder Gaylord Nelson.", "Tia Nelson’s performance came up again at the April 7, 2015 board meeting, and not long after the meeting NextGen Climate, a group that says its aim is to bring \"climate change to the forefront of American politics,\" posted an item on its blog saying Nelson had been muzzled by the public lands board.", "The group said Nelson had been banned from \"engaging in global warming or climate change\" work on state time and compared the action to a move in Florida to block state workers from using the term \"climate change.\"", "Did the board really order Nelson -- and other agency employees -- not to talk about climate change on state time?", "Some background", "In 2007-’08, Nelson was tapped by then-Gov. Jim Doyle, a Democrat, to co-chair a state global warming task force. During that time she also held her position at the public lands agency. Not long after the global warming report was issued, Nelson traveled to Washington, D.C., to testify about climate change at a congressional hearing and discussed the report in other settings.", "Adamczyk has called her task force work theft of the state’s time and also criticized Nelson and La Follette for recently attending a land commissioners’ conference in Phoenix.", "At the April 7 meeting, Nelson defended herself and said she served on the task force at the request of Doyle. She said she hasn't actively worked on global warming since the task force disbanded.", "\"I have never lobbied on climate change on state time in the entire 10 years I've been at the board of commissioners,\" she said.", "After her comments, Adamczyk asked for approval of a resolution to \"prohibit staff from engaging in global warming or climate change work while on BCPL time.\" Adamczyk and Schimel voted in favor, La Follette voted no.", "We contacted Nelson and she declined to discuss the board’s action -- or climate change.", "She did note she was going to be on vacation April 22, which is Earth Day, giving a talk about her father at his alma mater, San Jose State University.", "Our rating", "The advocacy group NextGen Climate says Nelson, daughter of the founder of Earth Day, is under orders not to discuss global warming on state time. That’s indeed the wording of the resolution approved 2-1 by the agency’s board. We rate the statement True.", "Wisconsin Global Warming Task Force report, 2008", "Board of Commissioners of Public Lands agenda, April 7, 2015", "Milwaukee Journal Sentinel, \"State board bans workers from discussing global warming,\" April 8, 2015", "Milwaukee Journal Sentinel, \"Bucks announce game-changing $1 billion arena package,\" April 8, 2015", "The Guardian, \"Republicans try to prevent Wisconsin official from working on climate change,\" April 7, 2015", "The Capital Times, \"Board of Commissioners of Public Lands bans staff from climate change work\" April 8, 2015", "NexGen Climate, \"Wisconsin Republicans seek Florida-style moratorium on climate change,\" April 8, 2015", "Florida Center for Investigative Reporting, \"In Florida, officials ban term ‘climate change,’\" March 8, 2015", "Gaylord Nelson and Earth Day", "State of Wisconsin Board of Commissioners of Public Lands", "State of Wisconsin Board of Commissioners of Public Lands meeting minutes", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]