["The photo was published here on Twitter on January 30, 2020. It has been shared more than 900 times.", "The post’s caption reads: “We’ve been playing with cats for a very long time indeed. Fragment from ancient Egypt.”", "The image was also published here, here and here on Facebook, and here, here, here, here and here on Twitter, and here on Tumblr alongside a similar claim.", "The claim, however, is false.", "A keyword search on Google found a very similar photo published here on an online shop named Down Under Pharaoh.", "Below is a screenshot comparison of the misleading post (L) and the photo on the online shop (R):", "The product description reads: “A painted relief sculpture and a replica Bast statue that I designed for my cat when she was alive. The relief is a piece that is a more personal art work created in an Egyptian style to commemorate my last and most special cat.”", "An Instagram account associated with the online shop also shared images here and here on Instagram on August 17, 2017 of the same carving.", "A spokesperson for Down Under Pharaoh also addressed the claim in the misleading posts here on Instagram. The post states the sculptor crafted this piece of artwork more than 20 years ago.", "In response to the misleading post, the Down under Pharaoh told AFP in an email dated October 5, 2020: “The art was made out of love and sorrow and when people refer to it as a fake or real, well that is a subjective viewpoint. Fake is an aggressive and insulting word for this piece which is actually my most loved work.”", "The misleading post was also debunked by online myth-busting site HoaxEye here on April 17, 2020.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]