["About this rating", "Thalidomide was a “miracle drug” commonly prescribed in the 1950s to treat an assortment of ailments, including nausea in pregnant women. The therapeutic was not rigorously tested in large human populations and was pulled from the market less than a decade after its introduction because it caused malformations in newborns.", "Thalidomide was not “rapidly approved” using comparable approval requirements necessary in 2020 for the COVID-19 vaccine. Furthermore, thalidomide is not a vaccine, and does not provide a possible case study for long-term safety and efficacy concerns related to the two-dose coronavirus immunization.", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "After a 91-year-old British woman became the first person to receive the COVID-19 vaccination in December 2020, claims made in social media posts compared the immunization to thalidomide, a \"miracle drug\" commonly prescribed around the world in the 1950s to treat a variety of ailments, from morning sickness to the common cold.", "But the miracle was short-lived. With less than a decade on the global pharmaceutical market, thalidomide was taken off the shelves when it was found to cause malformations and congenital defects in infants born to women who had been prescribed the drug.", "And because thalidomide was prescribed before rigorous long-term testing proved its safety in a variety of populations — including pregnant women — some are quick to point out that the \"Thalidomide Tragedy\" could prove as a precedent for health effects to come in the wake of the COVID-19 global vaccinations.", "But does a decades-old medical catastrophe set the stage for possible health impacts caused by the COVID-19 vaccine? Experts say no.", "\"There is no fair comparison,\" said Dr. Ruth Blue, secretary to the board of trustees of the Thalidomide Society, in an email to Snopes.", "While it is true that thalidomide was marketed in some countries in 1957 to treat nausea and insomnia in pregnant women, and withdrawn five years later due to malformations in newborns, thalidomide was an often daily therapeutic drug aimed at treating symptoms and not an immunization to prevent viral infections and spread.", "\"Thalidomide was developed in the late 1950s and early 1960s and was prescribed to pregnant women to ease morning sickness, anxiety, insomnia, and a host of other complaints. It had not been properly tested in already and non-pregnant women [and] there were troubling side effects of the drug,\" Blue said. \"Vaccines are tried and tested science, they do not work the same way that thalidomide did.\"", "Furthermore, thalidomide was not approved in the U.S. until decades after the tragedy, and only after healthcare experts studied the long-term safety and efficacy effects of the therapeutic. Ironically, the thalidomide tragedy led to the long-term, multi-phased approval process required by regulatory agencies around the world.", "Cases of severe thalidomide-induced phocomelia. Public Domain", "Thalidomide was originally marketed as a sedative and first introduced in Germany in the 1950s. Because the over-the-counter medicine was advertised as a safe drug for all users, including pregnant women and children, it was eventually used in at least 46 countries by 1960. The cure-all was marketed under a number of names including Distaval, Asmaval, Forte, Tensival, Valgis, and Valgraine, and was used to treat an equally vast number of symptoms, from nausea in pregnant women to anxiety, colds, flu, and pneumonia. Its widespread use was largely contributed to early clinical studies involving rats — not humans — that found it was impossible to overdose on thalidomide. But it's long-term use wasn't studied until it was too late.", "By the early 1960s, it became apparent that thalidomide resulted in severe birth defects in thousands of children around the world, according to research published in the journal Toxicological Sciences. The Thalidomide Society, a United Kingdom-based support group for victims, estimates that more than 24,000 children around the world were affected with an estimated 10,000 children having been born with phocomelia, a rare congenital disorder that causes very short limbs, as well as congenital heart disease, and malformations of the inner and outer ear. It is thought that another 123,000 women experienced still-born births or had miscarriages.", "It wasn't until 1961 when Australian Obstetrician William McBride warned in a letter to the medical journal Lancet that he observed \"multiple severe abnormalities\" in babies that he had delivered and whose mothers had taken thalidomide during pregnancy. In what has now become known as the \"Thalidomide Tragedy,\" McBride's letter eventually led to a ban of the drug around most of the world in 1962.", "Screenshot/James Lind Library", "Though thalidomide was prescribed around the world, its approval was put on hold due to the U.S. Food and Drug Administration (FDA) approval requirements. Pharmacologist Dr. Frances Kelsey turned down several requests from the distributing company because she did not feel its researchers had provided clinical evidence necessary to suggest the drug was safe.", "In short, thalidomide was neither approved nor used in the U.S. until 1998. However, two unregulated \"clinical trials\" treated about 20,000 people with thalidomide before actions were taken to prevent the drug's distribution. According to a report by The New York Times detailing a 1962 FDA investigation, thalidomide was also \"casually passed doctors and family members.\" Investigators ultimately concluded that the drug manufacturer Richardson-Merrell was illegally promoting the drug before it had been approved, but did not have definitive proof to pursue further legal action.", "After more than three decades of rigorous testing, thalidomide was approved by the FDA in the U.S. for the treatment of leprosy, multiple myeloma, and other diseases, including some forms of cancer. But it still doesn't compare to the COVID-19 vaccine.", "First and foremost, thalidomide is not a two-dose vaccine. Vaccine development requires a four-phased review process to determine whether the immunization is safe and for how long it may be effective. Vaccine development can typically take several years before reaching approval, but in December 2020, the FDA issued two emergency use authorizations (EUA) for COVID-19 vaccines developed by Pfizer-BioNTech and Moderna in response to the COVID-19 pandemic.", "Even so, the agency noted in a Dec. 18 statement that a EUA does not constitute approval:", "In determining whether to issue a EUA for a product, the FDA evaluates the available evidence to determine whether the product may be effective and also assesses any known or potential risks and any known or potential benefits. If the product meets the effectiveness standard and the benefit-risk assessment is favorable, the product is made available during the emergency.", "As such, the FDA expects vaccine distributors authorized under a EUA to continue clinical trials to obtain additional safety and effectiveness information and pursue eventual approval.", "Ironically, the thalidomide tragedy marked a turning point in toxicity testing, prompting regulatory agencies to more closely examine systematic pharmaceutical testing for long-term safety and efficacy both in the prescribed patient and unborn fetuses.", "Thalidomide was not necessarily a \"fast-tracked\" drug as many of the social media posts claim. The oral tablet was not trialed at the magnitude modern pharmaceuticals and therapies are tested, and its long-term safety and efficacy were not tracked in large human populations until it was too late.", "Like vaccinations, FDA approval of a drug also requires four phases and a series of clinical trials to determine whether it is safe and effective at its prescribed use. Phase 1 typically emphasizes safety and will monitor between 20 and 80 patients — a very small sample size — to determine the drug's most frequent side effects and how the drug is metabolized and excreted.", "In the second phase, researchers will test hundreds of patients in often controlled trials to determine the effectiveness with the goal of obtaining preliminary data on whether the drugs work in people with certain conditions or diseases.", "Following Phase 2, the FDA will determine how large-scale studies will be conducted in Phase 3, at which point thousands of patients will be given the drug for data collection at a much larger scale.", "Approval then requires a number of steps that could take place over several months. Once a drug is approved, Phase 4 entails a post-marketing risk assessment that requires the FDA to continue to monitor and evaluate safety updates.", "Standard review typically takes around 10 months whereas priority review takes around six, according to the FDA.", "A pack of thalidomide from 2006 or later. Public Domain", "Because of these protocols, treatment protocols for thalidomide usage in 2020 are strict in determining whether a patient is pregnant at the time of taking the drug.", "As of this writing, thalidomide is regulated by the System for Thalidomide Education and Prescribing Safety (STEPS) program, which aims to educate patients who receive the drug about potential risks. Among other measures, women who could become pregnant must agree to undergo pregnancy testing before starting the medication, and continue to do so during the course of their therapy to prevent the risk of fetal exposure to thalidomide.", "Update [Dec. 24, 2020] This article was updated to include two unregulated clinical trials in the U.S. that treated approximately 20,000 people with thalidomide.", "Madison Dapcevich is a freelance contributor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]