["By D'Angelo Gore", "Posted on June 21, 2016", "A TV ad from a Democratic political action committee could leave voters with the false impression that Donald Trump said he “loves” war “including with nukes.” The ad uses two clips back-to-back of Trump speaking at events that were actually several months apart.", "In the ad, Trump, the presumptive Republican presidential nominee, is heard saying, “I love war, in a certain way.” After that, a clip is shown of Trump saying, “including with nukes, yes, including with nukes.” But those two statements are separate from one another, which may not be clear to those who see or hear the ad.", "When Trump said “including with nukes,” he was talking about Japan possibly needing nuclear weapons to defend itself against North Korea. He wasn’t talking about the U.S. using nuclear weapons in war.", "The ad, titled “Presidential,” comes from Priorities USA Action, a liberal super PAC supporting presumptive Democratic presidential nominee Hillary Clinton. The multimillion-dollar ad buy, set to air in eight swing states, says that Trump is “too dangerous for America.”", "Trump did say that he “loves war, in a certain way,” at a campaign rally in Iowa last year. He made the comment after he said that former Iraqi President Saddam Hussein claimed to have weapons of mass destruction as a strategy “to scare” Iran.", "Trump, Nov. 12, 2015: This is the Trump theory on war. But I’m good at war. I’ve had a lot of wars of my own. I’m really good at war. I love war, in a certain way, but only when we win.", "But Trump’s “including with nukes” comment was unrelated to that and came several months later. He said that during an April 3 interview with “Fox News Sunday” host Chris Wallace. Trump suggested that Japan might need to acquire nuclear weapons to defend against neighboring North Korea, which does possess nuclear weapons.", "Wallace, April 3: You want to have a nuclear arms race on the Korean peninsula?", "Trump: In many ways, and I say this, in many ways, the world is changing. Right now, you have Pakistan and you have North Korea and you have China and you have Russia and you have India and you have the United States and many other countries have nukes.", "Wallace: Understood.", "Trump: It’s not like, gee whiz, nobody has them.", "So, North Korea has nukes. Japan has a problem with that. I mean, they have a big problem with that. Maybe they would in fact be better off if they defend themselves from North Korea.", "Wallace: With nukes?", "Trump: Maybe they would be better off — including with nukes, yes, including with nukes.", "Wallace: And South Korea, with nukes?", "Trump: South Korea is right next door, just so you understand.", "Wallace: But that means you can have a nuclear arms race on the Korean Peninsula.", "Trump: You already have it, Chris. You already have a nuclear arms race.", "It’s clear, in that exchange, that Trump wasn’t talking about the U.S. using nuclear weapons, and he wasn’t saying that he “loves” nuclear war.", "But Trump has previously said that he wouldn’t ever rule out using nuclear weapons as president. That’s a point that Priorities USA Action spokesman Justin Barasky made in an email to FactCheck.org.", "At an MSNBC town hall in March, when asked by moderator Chris Matthews about the possibility of using nuclear weapons against the Islamic State terrorist group in the Middle East or even in Europe, Trump said that “I’m not going to take it off the table” even though “nuclear should be off the table.”", "Trump, March 30: Look, nuclear should be off the table. But would there be a time when it could be used, possibly, possibly?", "Matthews: OK. The trouble is, when you said that, the whole world heard it. David Cameron in Britain heard it. The Japanese, where we bombed them in ’45, heard it. They’re hearing a guy running for president of the United States talking of maybe using nuclear weapons. Nobody wants to hear that about an American president.", "Trump: Then why are we making them? Why do we make them? We had (inaudible).", "Matthews: Because of the old mutual assured destruction, which Reagan hated and tried to get rid of.", "Trump: (inaudible) I was against Iraq. I’d be the last one to use the nuclear weapon.", "Matthews: So can you take it off the table now?", "Trump: Because that’s sort of like the end of the ballgame.", "Matthews: Can you tell the Middle East we’re not using a nuclear weapon on anybody?", "Trump: I would never say that. I would never take any of my cards off the table.", "Matthews: How about Europe? We won’t use it in Europe?", "Trump: I — I’m not going to take it off the table.", "Matthews: You might use it in Europe?", "(LAUGHTER)", "Trump: No, I don’t think so. But I’m not taking …", "Matthews: Well, just say it. “I will never use a nuclear weapon in Europe.”", "Trump: I am not — I am not taking cards off the table.", "Matthews: OK.", "It’s not our place to say whether a potential U.S. president should or should not talk about using nuclear weapons in war. However, Trump saying that he would not rule out using nuclear weapons as president is not the same thing as saying, “I love war, in a certain way … including with nukes, yes, including with nukes.” That’s what someone might wrongly think Trump said, given the way the ad uses the two quotes one after the other.", "Barasky disagreed. “It’s obvious to anyone that these are different clips and there’s no suggestion all 5 are one statement,” he wrote in an email.", "Viewers can be the judge of that. But the two Trump quotes come in quick succession in the ad, and there’s no context given for the “nukes” comment.", "https://www.sharethefacts.co/share/7f6741f2-9b68-4613-8263-41ba028fa3d6", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]