["The 59-second video was shared in a Facebook post here on June 26, 2019.", "It was viewed more than 50,000 times and shared more than 2,500 times before it was removed.", "Below is a screenshot of the misleading post:", "The video purports to show former US president Barack Obama unveiling a photo of Prabowo Subianto, the opposition candidate during the April 2019 Indonesian presidential election.", "The Indonesian language caption translates to English as: “BARACK OBAMA on behalf of the United States, has stated the victory of PRABOWO - SANDI. Make this video viral now\n\tThank you…\n\tALLAH IS GREAT…”", "“PRABOWO-SANDI” refers to Prabowo and his running mate Sandiaga Uno.", "This is an AFP’s report about the Indonesian 2019 presidential election.", "Joko “Jokowi” Widodo was re-elected president in 2019 Indonesian election. Here is an AFP report about the polls.", "The same video was published on Facebook here and here with a similar claim, and on YouTube here and here.", "The claim is false; the footage has been doctored from a longer video which shows Obama unveiling his own portrait at an event held by the US-based Smithsonian Institution in February 2018.", "In the misleading video, the Smithsonian logo and name can be seen on the podium.", "Below is a screenshot of the podium, which AFP has circled in red (top), and a comparison with the institution’s logo seen on its website (bottom):", "Keyword searches on YouTube found this video published by CNN’s official YouTube channel on February 12, 2018. It is titled: “President Obama’s official portrait unveiled.”", "In the YouTube clip, Obama and US artist Kehinde Wiley can be seen pulling off a black cover from the portrait to reveal the image of Obama.", "Obama’s portrait can be seen at the 30-second mark in the CNN video.", "Below is a screenshot comparison of the video in the misleading Facebook post (top) and the CNN video (bottom):", "The same event can also be seen in this video published by Smithsonian’s official YouTube channel on February 12, 2018.", "The YouTube video’s title states: “Obama Portrait Unveiling at the Smithsonian’s National Portrait Gallery”.", "The video’s caption states: “The Smithsonian’s National Portrait Gallery unveils its commissioned portraits of former President Barack Obama and Mrs. Michelle Obama by artists Kehinde Wiley and Amy Sherald, respectively. Remarks by President Obama and Mrs. Obama, Smithsonian Secretary David Skorton, National Portrait Gallery Director Kim Sajet and artists Wiley and Sherald.”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]