["The claim and screenshot of the news report were published on Facebook here on January 20, 2021. The post has been shared over 8,000 times.", "Part of the post’s Tagalog caption translates to English as: “MSG… contains pig saliva but you followers of Allah still don't want to believe me and continue to use it.”", "The news report seen in the screenshot reads: “Ajinomoto, the Japanese food seasoning giant, apologised to the Muslims of Indonesia this week in several major newspapers over the use of pig enzymes.”", "The article adds that “Ajinomoto’s monosodium glutamate (MSG) contained pig enzymes had caused a storm among Muslims in Indonesia and the Indonesian Council of Ulemas (MUI), or Muslim religious leaders, had issued a fatwa (ruling) banning its consumption.”", "In Islam, the consumption of pork and products derived from pigs is forbidden.", "The news report was also shared alongside a similar claim on Facebook posts here and here.", "The posts, however, omit important context.", "A Google keyword search found the news report was published by FoodNavigator.com here on January 12, 2001, two decades ago.", "At the time, AFP also covered Ajinomoto’s use of pig enzymes and reported that the company regained its halal label in February that same year.", "Ajinomoto “has resumed production a month after a row triggered by its use of a pig enzyme in its manufacture,” AFP reported on March 2, 2001.", "“Ajinomoto’s loss of its Halal (fit for consumption by Muslims) label in late January caused an uproar in Muslim-majority Indonesia, where the flavor enhancer is used in almost every household and restaurant.”", "As of March 18, 2021, Ajinomoto’s MSG maintains its halal label in Indonesia, as seen in this document published by the Indonesian Ulema Council.", "AFP has previously debunked misinformation around halal products in Indonesia, India and Singapore; as well as misleading claims about MSG safety.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]