["On October 29, Hindustan Times published a report titled, “Russian president Putin may witness Tamil Nadu’s bull-taming sport Jallikattu in January”, which cited a top official from Tamil Nadu’s Madurai district. According to the report, the official said, “The world-famous Alanganallur (a village near Madurai) Jallikkatttu event ahead of Pongal festival attracts thousands of viewers. People from foreign countries routinely visit the spot to witness Jallikkattu. We have heard that Putin would visit the event along with the PM Modi”.", "Russian president Putin may witness Tamil Nadu’s bull-taming sport Jallikattu in Januaryhttps://t.co/MXMOiNgfuh pic.twitter.com/kohLWfQ755", "— Hindustan Times (@htTweets) October 29, 2019", "OpIndia also reported that Russian President Vladimir Putin “may attend” the popular bull-taming sport Jallikattu in January 2020. The report cited a Oneindia Tamil article as the source.", "Russian President Vladimir Putin may attend Jallikattu, the bull-taming festival, in Madurai next year https://t.co/DIFaurj0Yy", "— OpIndia.com (@OpIndia_com) October 29, 2019", "MyNation published a similar report titled, “After hosting Chinese president Xi Jinping, Tamil Nadu is all ready to host Vladimir Putin, the Russian president.”", "A few users also made the same claim on Twitter.", "Modi is putting tamil nadu and it’s culture on the world stage Wonder what some idiot tamilians who hate him will do now #TamilNadu #Jallikattu #NarendraModi #Putin pic.twitter.com/6Gh72J11ku", "— The Communal Dentist©🇮🇳 (@dr_bharathsn) October 29, 2019", "Press Information Bureau (PIB) Gujarat took to Twitter and rubbished speculations of President Putin and PM Modi attending Jallikattu in 2020.", "The tweets that PM @narendramodi and President Putin would attend Jallikattu at Madurai are fake and wrong. please don’t share fake news@PIB_India @PIBHindi #FakeNews", "— PIB in Gujarat (@PIBAhmedabad) October 29, 2019", "News agency ANI also tweeted dismissing reports of President Putin visiting Tamil Nadu along with PM Modi for the festival.", "Media reports of Russian President Vladimir Putin visiting Tamil Nadu and watching Jallikattu along with PM Modi are incorrect, no such program has been scheduled. pic.twitter.com/lkeU1G5IXg", "— ANI (@ANI) October 29, 2019", "Hindustan Times has now quietly updated its initial report without an update. The now-changed title of the story reads, “Russian president Vladimir Putin not visiting Tamil Nadu to watch Jallikattu”. You can access the cached version of the article here.", "OpIndia’s initial report was titled, “Russian Putin may attend Jallikattu, the bull-taming festival in Madurai, next year,” that was later changed to – “Reports of Russian President Vladimir Putin attending Jallikattu, the bull-taming festival, in Madurai next year false: Report”. The right-wing website added an update to its article which said, “News has now emerged that media reports of Russian President Vladimir Putin attending Jallikattu in Madurai along with Prime Minister Modi are false.”", "My Nation has now deleted its article. You can access a cached version here.", "Jallikattu is a part of the three-day-long Pongal festival where a bull is let loose on a group of people. The participants are then supposed to take control of the bull by holding on to its hump as long as they can.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]