["Some of the misleading Facebook posts -- for example this one published on September 2, 2019 -- contain a composite image.", "The top image shows a row of Buddhist statues standing in a row. The Sinhala-language text across the top photo translates to English as: “Monk statues constructed at the Muhudu Maha Viharaya through the 2013 Deyata Kirula”.", "The bottom image shows similar statues lying on the floor. The text across the lower image translates to English as: “By 2019, every single one of the statues had been razed”.", "The post has been shared almost 9,000 times.", "Below is a screenshot of the misleading Facebook post:", "Muhudu Maha Viharaya is a historic Buddhist temple located on Sri Lanka’s east coast.", "Deyata Kirula was the name of a series of exhibitions organised by the former President Mahinda Rajapaksa led government in various parts of Sri Lanka, mainly to showcase military might following the end of Sri Lanka’s three decade-long civil war.", "The post's Sinhala language caption translates to English as: “Do not despair, this is our heritage. Every single statue constructed at the Muhudu Maha Viharaya in 2013, razed by 2019. For you to understand more of anithya, vote for this government to come into power once more. When the Samadhi statue, Tholuwila statue and the Gal Vihara statue are also razed like this, you will further comprehend the meaning of anithya.”", "The term \"anithya\" refers to impermanence -- one of the three marks of existence according to Buddhist thought.", "The same photos which appear in the composite image have been shared, for example here on Facebook, with another claim that the statues were felled by Muslim extremists.", "The Sinhala language caption translates to English as: “Muhudu Maha Viharaya in Sri Lanka has fallen prey to the grasp of Muslim extremists under the patronage of the State and is deteriorating.”", "The English caption states: “The Muhudu Maha Viharaya, a historic Buddhist legacy of Sri Lanka which is being destroyed by Muslim extremists under the patronage of SL government. Maithripala Sirisena Mr. President, Are you still sleeping?”", "Maithripala Sirisena is the President of Sri Lanka.", "The post also adds a comment at the end purportedly directed at Facebook saying: \"@facebook : The photographs are real and not published for spread racism. We are Sinhalese Buddhists and these footages show how Muslim extreme activities against Buddhism. Don't post down, even if this is reported. Pleaese, raise your community voice against Muslim Extremism over the world.\"", "Below is a screenshot of the misleading Facebook post:", "The same photos have been shared alongside a similar claim here and here on Facebook and here on Twitter.", "The claim is false; the statues seen on the ground in the photograph were not attacked; multiple images of the popular tourist site in July and August 2019 show many statues standing upright.", "According to the chief monk at the temple, the statues seen on the floor in the photo were placed there ahead of being raised to complete a depiction of Buddha’s 80 Great disciples.", "Chief Monk of the Muhudu Maha Viharaya, Venerable Warakapola Indrasiri Thera told AFP by phone on September 3, 2019 that the statues were not attacked by a Muslim extremist group.", "“I can assure you the statues seen on the ground is not the result of an attack by any group,” he said.", "Some of the misleading posts claimed the statues were constructed in 2013 through funding from the Deyata Kirula, but the chief monk told AFP the construction of the statutes started in 2017.", "“Some of the 80 statues have been put up as we received approval from the Archeology Department. However, they withdrew permission abruptly so we had to halt the work until authorization is resumed to erect the remaining statues to complete the 80,” he told AFP.", "The head of the regional Archeology Department, Acting Additional Director for Ampara and Batticaloa, Mahinda Karunathilake, told AFP by phone on September 4, 2019 that there was no attack or damage to the Muhudu Maha Vihara statues seen lying on the floor.", "“The temple has been declared an archaeological reserve through a gazette and as per the regulations of the Antiquity Ordinance, permission will not be extended to carry out any new construction in locations declared as archeological reserves,” Karunathilake told AFP.", "“Therefore, permission was granted to the Chief monk only to construct a temporary building and not permanent structures. So, we had to notify the Chief monk to halt the construction of the asu maha sravaka statues as per the law,” he said.", "Below is a screenshot of the Antiquities Ordinance No 9 of 1940 regulation:", "Multiple photos posted by visitors to the site on Google maps in August 2019 show many monk statues standing upright, for example here.", "Below is a screenshot of some of the photos which show the statues standing upright:", "In this July 2019 YouTube travel video on the Muhudu Maha Viharaya, the upright statues of the monks can be seen from the five seconds to eight seconds mark. The video is embedded below.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]