["About this rating", "This legend has circulated in Great Britain at least since 1972.", "Author Douglas Adams tells the \"packet of biscuits\" tale in his 1984 novel So Long, and Thanks for All the Fish. He has since recounted it on numerous occasions, claiming it happened to him in 1976 at a station in Cambridge.", "His claim is doubted by many who point out the self-same tale was around years prior to that, but it is not impossible for events in real life to mimic those of lore. (Indeed, the actual folkloric term for such an event is ostension.) In any case, whether the incident happened to him or not, it is clear the legend did not begin with him:", "Examples:", "[Brunvand, 1986]", "An elderly woman, traveling by bus, had a layover during her journey. She purchased a package of Oreo cookies from a vending machine in the bus terminal and located a table. She placed her cookies on the table, sat down, and proceeded to read her newspaper", "She was joined by a young man, who, to her surprise, opened the package of Oreo cookies and began to eat them. The woman, saying nothing, but giving him an icy stare, grabbed a cookie. The young man, with a funny look on his face, ate another cookie. The woman again glared and grabbed another cookie. The young man finished the third cookie and offered the last to the woman.", "Completely appalled, she grabbed the cookie and the young man left. Outraged, the woman threw down her paper only to find her unopened Oreos on the table in front of her.", "[Collected on the Internet, 1994]", "A friend of my aunt was going shopping at the mall, and stopped in a snack bar to rest her feet. She bought a Kit Kat bar, a candy bar which breaks into several pieces.", "The place was crowded, so the friend was forced to share a table with a meek-looking gentleman. (That's just the way some malls are, I guess.) The expected business happened with the two of them sharing the Kit Kat, but since the Kit Kat had an odd number of pieces, she made sure she got the last one.", "The man got up without saying a word, went over to the counter and bought a couple of donuts. The friend was working herself into a rage because this guy had eaten her Kit Kat. She imagined that he had bought two donuts to give one to her in apology, and so you can imagine how she got even more angry when he had the gall to go sit by himself at a table far away from her.", "So, in the strength of her fury, she stalked over to his table, picked up one of the donuts, took a BIG CHOMP out of it, and set it back in front of him. Then she glared at him, said \"And a VERY GOOD DAY to you, too!\" and stormed out.", "She got to her car, opened up the purse to get her keys, and you know the rest.", "[Ann Landers, 1997]", "A Ferry Story", "My aunt and uncle own a business in Kamloops, B.C. Here is a true story that happened to one of the women in their office:", "The woman was taking the car ferry from Victoria to Vancouver. She sat on the deck. Beside her in an empty chair were her newspaper and her chocolate bar. A man sat next to the little pile. He picked up the chocolate bar, ate it, picked up the newspaper, read some of it, threw the candy bar wrapper away, tucked the newspaper under his arm and then walked off.", "The woman was too shocked to say anything. Having nothing to read, eat or munch on, she decided to go to the cafeteria. There, at a table, sat the man, flipping the pages of the newspaper with one hand, holding a submarine sandwich in the other. Still angry, the woman strode over to him, grabbed the sandwich out of his hand, took a big bite and then put the sandwich back in his hand. She marched off, saying nothing and not looking back.", "She then decided to go to her car. On the passenger seat were her newspaper and her chocolate bar. She had never taken them out of the car!", "Variations:", "Numerous stories about unwitting thieves abound in the realm of contemporary lore, with the \"victim turned thief\" motif appearing in such tales since the early 1900s. (Visit our Pocket(ed) Watch, Gun-Toting Grannies, and Jogger's Billfold pages for other legends of this type.)", "As folklorist Jan Harold Brunvand put it, \"All variations on the theme of unwitting theft portray a plausible situation in which we ourselves might act in such an uncharacteristic threatening manner because of a simple misunderstanding.\" In this legend, the \"plausible situation\" impels a woman one presumes would not normally make a spectacle of herself to angrily glare at a stranger, screech at him, lecture him, or even defiantly grab a food item she knows is his and tear a bite out of it.", "Because of the way the characters are presented (the woman exudes a faintly aristocratic aura while the man is described as a leather-clad punk, a foreigner, or an insolent-appearing young person), the woman's social lapse is more glaring. We forgive her outburst at the time ... but afterwards have a chance to reflect on how she handled the situation and conclude there had to have been a better way.", "Her lapse and the awareness of how she must have appeared to others serves as a caution against our taking similar action in any potentially confrontational encounter that occurs in public. We might not always have all of the facts we think we do. Moreover, even if we do have all the facts, we're going to look like a right idiot to anyone looking on.", "Sightings: Both the 1990 film The Lunch Date and the 1989 film Boeuf Bourgignon make use of this legend. In both, a well-dressed white woman goes off to fetch silverware and returns to find a Black man eating her lunch. Only after she shares her dinner with the stranger (at one point he fetches coffee for the two of them) and the man leaves does she notice her own meal sitting on another table.", "The 2010 Ian McEwan novel Solar contains an interesting sighting of the legend, where it is both related as a true story undergone by the book's protagonist and afterwards challenged by a folklorist he encounters on its basis as an urban legend of long standing.", "Denton. Lisa.   “Chewing Gum Keeps the Hearing Aids In.”\r\n    The Chattanooga Times.   30 July 1997   (p. C1).", "Kaelber, Randy.   “The Biscuit Bullet: Is It My Fault?”\r\n    FOAFTale News.   June 1996   (p. 8).", "Kreck, Dick.   “A Biscuit with Her Name on It.”\r\n    The Denver Post.   6 April 1996   (p. D8).", "McEwan, Ian.   Solar.\r\n    Toronto: Alfred A. Knopf, 2010.   ISBN 978-0-385-53341-6.  \r\n    (pp. 117-8, 119, 121-7, 154-5, 157-8, 179-80).", "Owens, Gene.   “Doughboy Gets Around.”\r\n    [Greensboro] News & Record.   11 July 1995   (Food; p. A7).", "Rose, Allen.   “Story of Biscuit Dough Explodes in My Face.”\r\n    The Orlando Sentinel.   31 May 1996   (p. D1).", "Rose, Allen.   “Biscuit Dough Makes Impact on Shopper.”\r\n    The Orlando Sentinel.   30 May 1996   (p. D1).", "Sandstrom, Karen.   “Joke Telling Done Well Gives Audience More Than Laughs.”\r\n    The Plain Dealer.   19 June 1994   (p. B5).", "Setencich, Eli.   “City Shoots First, Asks Questions Later.”\r\n    The Fresno Bee.   22 January 1996   (p. B1).", "Truly, Pat.   “The Unthinkable Is Becoming Less So Every Day.”\r\n    The [Cleveland] Plain Dealer.   19 January 1994   (p. B5).", "Venable, Sam.   “Highway Shooting Incident Turned Out to Be Poppin’ Fresh.”\r\n    The Knoxville News-Sentinel.   19 April 1998.", "Viets, Elaine.   “The Half-Baked Biscuit Bullet Story Won’t Die.”\r\n    Pittsburgh Post-Gazette.   13 December 1995   (Food; p. 3).", "Wikipedia.   \"Ostensive Definition; Ostension in Folklore.\"\r\n    Accessed 14 November 2018.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]