["About this rating", "On 1 February 2017, the web site Alternative Media Syndicate published an alarming photograph of burning tents alongside a claim that police had \"raided\" Standing Rock camps, dismantling shelters and burning what remained:", "Following our earlier report from Standing Rock on the police raid of the Last Child camp, reports began to roll in that police had taken down tipis and burned whatever remained.", "Some of the livestreaming of these incidences was blocked, but what we have been given is as follows.", "Please watch and help us get the word out.", "Appended to the Alternative Media Syndicate item was the dramatic photo reproduced above, which a reverse image search identified as a still frame from the HBO production Bury My Heart at Wounded Knee (a historical drama about Native Americans in the American West in the 1860s and 1870s).", "According to the Facebook page of prominent Dakota Access Pipeline protester Dallas Goldtooth, the claim that police were raiding and burning Standing Rock protest camps was \"fake news\":", "Native News Online also noted in response to the report that \"even [though] there was strong militarized police presence which resulted in 76 water protectors arrested, the police did not set fire to the tepees.\"", "A teleSUR news report on police activity at Standing Rock also made no mention of any camp there being set afire by police:", "Police in North Dakota arrested 76 people at Standing Rock, as the Army Corp of Engineers cleared the way for the Dakota Access Pipeline to continue construction through Native American land.", "Water protectors had set up a new camp, the Last Child Camp, and lit a sacred fire near where construction is expected to begin any day, vowing to stop the controversial pipeline which violates the sovereign treaty rights of the Standing Rock Sioux Tribe and threatens to contaminate the water supply for millions of North Dakota residents.", "Armed police used bulldozers and sound cannons to destroy the camp, put out the sacred fire, and carry out the arrests. Morton County sheriff's office spokesman Rob Keller said it was too soon to say what the protesters would be charged with.", "The Morton County [North Dakota] Sheriff's social media accounts carried a video showing them evicting \"rogue  protesters\" from what they described as \"an illegal protest camp on private property\":", "[Official Sheriff Video Feb2/2017] Rogue camp evicted https://t.co/rlc5AveEJy #NoDAPL #DAPL #StandingRock", "— MortonCountySheriff (@MortonCountySD) February 2, 2017", "Alternative Media Syndicate later replaced the image of burning shelters with a similar movie still, but did not update the claim associated with it.  The following update was added to the bottom of the article:", "Article by Screaming Wolf; original image composite created from movie Bury My Heart At Wounded Knee; used for illustrative purposes to draw the analogy to the ethnic cleansing still happening today. Image was removed after far too many people failed to read this note that it was a stock image.", "HBO Films.   \"Bury My Heart at Wounded Knee.\"\r\n    Accessed 2 February 2017.", "teleSUR.   \"Police Raid Standing Rock Last Child Camp, Arrest 76.\"\r\n    1 February 2017.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]