["About this rating", "Conspiracy theories surrounding the June 2018 suicide of Anthony Bourdain grew ever more ridiculous in the days immediately following as fake news web sites trumpeted the notion that his death was somehow connected with incurring the wrath of Hillary Clinton.", "Shortly after one such site falsely reported that Bourdain had been preparing to expose an \"elite pedophile ring\" Clinton was supposedly involved in, another — YourNewsWire.com — upped the ante by suggesting he was killed \"by Clinton operatives\" for saying Clinton was fully aware of campaign donor Harvey Weinstein's predatory sexual activities:", "Anthony Bourdain had been harassed and threatened by Hillary Clinton operatives just weeks before he was found dead in an apparent “suicide.”", "According to investigators, Mr. Bourdain was planning to expose pedophile rings connected to Hollywood and D.C. shortly before his death.", "[...]", "Newmediacentral.net reports: Back in October of 2017, CNN’s Bourdain made statements regarding Harvey Weinstein, suggesting Hillary Clinton had to know of his history of being a sexual predator. Bourdain’s girlfriend, actress Asia Argento, accused Weinstein of raping her.", "The tweet angered Hillary spokesman, Brian Fallon. He took to Twitter to tell Bourdain to “eat a scorpion.” Many other Clinton winged monkeys followed suit.", "\"It’s no secret that people who cross the Clinton’s [sic] wind up dead ... mostly from suicide,\" the article continued, invoking a decades-old, long-debunked conspiracy theory linking Bill and Hillary Clinton to the supposedly \"mysterious\" deaths of some 50 former \"associates.\"", "But apart from a displaying a series of tweets from 2017 in which Bourdain did, in fact, take Hillary Clinton to task for what he termed her \"disappointing\" initial response to the Weinstein allegations, provoking an irate response from one of her aides, the article offered no substantiation whatsoever for its central claim, namely that Bourdain's death was connected to his \"crossing\" her.", "In asserting that connection (attributed to unnamed \"investigators\"), the web site was plying its stock-in-trade — that is, blending fact, fiction, and hyperbole to weave conspiracy-drenched clickbait stories for social media consumption. Previously published YourNewsWire.com articles promoted such idiotic claims as Melania Trump hired an exorcist to rid the White House of demons, former child actor Macauley Culkin accused \"Satanic\" Hollywood executives of wearing shoes made from murdered children, and Pope Francis ordered \"white women\" to \"breed\" with Muslims.", "French authorities have confirmed that Bourdain's death in Colmar, France, where he was filming a television show, was a suicide. They found no evidence of foul play.", "Adl-Tabatabai, Sean.  \"Investigators: Anthony Bourdain Was Killed by Clinton Operatives.\"\r\n  Your News Wire.  10 June 2018.", "Greenbverg, Jay.  “Anthony Bourdain Was About to Expose an Elite Pedophile Ring Before He Died.”\r\n   Neon Nettle.  9 June 2018.", "Associated Press.  \"Anthony Bourdain Used the Belt from His Bathrobe to Kill Himself.\"\r\n  9 June 2018.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]