["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Rep. Jeff Denham, R-Calif., right, testifies on Capitol Hill in Washington, Tuesday, July 23, 2013, before the House Judiciary subcommittee on Immigration and Border Security hearing. AP file photo.", "On the day the Trump administration announced it will end the so-called Dreamer program in six months, California Congressman Jeff Denham floated the idea for a bill that could further secure the border and protect undocumented immigrants brought to the U.S. as children.", "\"This is certainly an opportunity to combine a Dreamer Act with border security,\" Denham, a Republican who represents the Modesto area, told NPR on Sept. 5, 2017. \"This is something that should have bipartisan support. The president’s already asking for border security, why wouldn’t we add a Dreamer aspect to that as well?\"", "The administration’s action affects about 800,000 undocumented immigrants brought to the country as children. Roughly a quarter of these ‘Dreamers’ live in California.", "The Obama-era program Deferred Action for Childhood Arrivals, or DACA, has allowed them to continue to live and work in the U.S. temporarily, following a vetting process.", "President Trump gave Congress six months to find a legislative solution to DACA before the administration formally ends it.", "In his interview with Rachael Martin of NPR, Denham went on to claim that a DACA/border bill shouldn’t be controversial because top Democrats have supported border security, and specifically a border wall, in years past.", "MARTIN: \"When you say border security, you’re talking about the wall? What do you mean by that?\"", "DENHAM: \"Yes, yes. Which was bipartisan back when (then) Sen. Obama, Sen. Schumer and (then) Sen. Clinton all voted for it. This used to be a very bipartisan thing before President Trump announced it. I think it can be bipartisan once again.\"", "Denham is citing votes by the Democrats in 2006 on an act that authorized a fence. It’s a claim that takes things out of context and was repeated multiple times by Donald Trump during his campaign for president and was made in April by White House budget director Mick Mulvaney.", "After he spoke with NPR, Denham repeated the idea of a combined border security and DACA bill in an interview on Capital Public Radio. In that interview, he called border security a bipartisan idea but did not directly call Trump’s wall bipartisan or reveal whether he favors that specific proposal.", "As PolitiFact has noted several times in the past, the fence voted on in 2006 was less ambitious than the ‘big, beautiful wall’ Trump has pitched over the past two years and promised Mexico would pay for.", "Here’s PolitiFact’s analysis of this topic:", "The Secure Fence Act of 2006", "The Secure Fence Act of 2006, which was passed by a Republican Congress and signed by President George W. Bush, authorized about 700 miles of fencing along certain stretches of land between the border of the United States and Mexico.", "The act also authorized the use of more vehicle barriers, checkpoints and lighting to curb illegal immigration, and the use of advanced technology such as satellites and unmanned aerial vehicles.", "At the time the act was being considered, Barack Obama, Hillary Clinton and Chuck Schumer were all members of the Senate. (Schumer of New York is now the Senate minority leader.)", "Obama, Clinton, Schumer and 23 other Democratic senators voted in favor of the act when it passed in the Senate by a vote of 80 to 19.", "Originally, the act called on the Department of Homeland Security to install at least two layers of reinforced fencing along some stretches of the border. That was amended later, however, through the Consolidated Appropriations Act of 2008, which got rid of the double-layer requirement.", "Currently, 702 miles of fencing separates the United States from Mexico, according to U.S. Customs and Border Protection.", "In this Sept. 15, 2015, file photo, a farmer passes along a borer fence that divides his property, Tuesday, in Mission, Texas. (AP Photo/Eric Gay)", "So how does that compare to Trump’s wall?", "Trump plans for the wall are vague, but here’s what we know.", "He said the wall doesn’t need to run the nearly 2,000 miles of the border, but about 1,000 miles because of natural barriers. He said it could cost between $8 billion and $12 billion, be made of precast concrete, and rise 35 to 40 feet, or 50 feet, or higher. Cost estimates by others, including this one cited by Sen. Kamala Harris, D-Calif., vary widely.", "Experts have repeatedly told PolitiFact that the differences in semantics between a wall and a fence are not too significant because both block people.", "Still, there are obvious differences between the fence and Trump’s wall proposal.", "A 2016 Associated Press report from the border described \"rust-colored thick bars\" that form \"teeth-like slats\" 18 feet high. \"There are miles of gaps between segments and openings in the fence itself,\" the report said.", "Trump criticized the 2006 fence as too modest during the 2016 campaign.", "\"Now we got lucky because it was such a little wall, it was such a nothing wall, no, they couldn't get their environmental -- probably a snake was in the way or a toad,\" Trump said. (Actually, the project didn’t face environmental hurdles; we rated that part of the claim Mostly False.)", "It’s also worth noting that the political context surrounding the 2006 vote was different, too. Democrats normally in favor of looser immigration laws saw the Secure Fence Act of 2006 as the lesser of two evils, according to a Boston Globe report that detailed the legislative process.", "Ever since Trump proposed his wall during the presidential campaign, Democrats have called it overkill and too expensive.", "Meanwhile, PolitiFact California asked Denham’s spokeswoman for evidence to support the claim. She pointed to the votes by Obama, Clinton and Schumer in 2006.", "This isn’t the first time Denham has made a puzzling claim about ‘bipartisan’ efforts in Congress. In May, he told town hall attendees that the process that led to the GOP health care bill, passed exclusively by House Republicans, was \"bipartisan.\" We found it was a poor choice of words given how little cooperation there was over the bill. Experts told us it applied only in the most bare bones sense that both Republicans and Democrats had a chance to read and scrutinize the bill in committees.", "Our ruling", "Denham recently claimed that Obama, Schumer and Clinton voted for a border wall in 2006.", "They did vote for the Secure Fence Act of 2006, which authorized building a fence along about 700 miles of the border between the United States and Mexico.", "Still, the fence they voted for is not as substantial as the wall Trump is proposing. Trump himself called the 2006 fence a \"nothing wall.\"", "PolitiFact has rated several similar claims Half True, noting they are partially accurate but ignore important context.", "Denham’s claim also gets it about half right, but leaves out key information.", "We rate it Half True.", "HALF TRUE – The statement is partially accurate but leaves out important details or takes things out of context.", "Click here for more on the six PolitiFact ratings and how we select facts to check.", "Rep. Jeff Denham, interviews on NPR and Capital Public Radio, Sept. 5, 2017", "Jessica McFaul, spokeswoman for Rep. Jeff Denham, email exchange, Sept. 6, 2017", "Congress.gov, H.R. 6061, the Secure Fence Act of 2006 (109th Congress), accessed Sept. 6, 2017", "PolitiFact, \"Donald Trump says Hillary Clinton fought for a wall between U.S., Mexico,\" Oct. 20, 2016", "PolitiFact, Fact-check: Did top Democrats vote for a border wall in 2006? April 23, 2017", "PolitiFact California, Did Congressman Jeff Denham really call the GOP health bill ‘bipartisan’ ? May 12, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]