["Amid the pandemic, there has been rampant misinformation about the use of masks to prevent the spread of COVID-19. One such example is an online article that baselessly claims WHO said healthy people do not have to wear a mask outside hospitals.", "“If you do not have any respiratory symptoms, such as fever, cough, or runny nose, you do not need to wear a medical mask. When used alone, masks can give you a false feeling of protection and can even be a source of infection when not used correctly,” the Jan. 25 article claims.", "The article was updated the next day to include information that purportedly supported the claim. The author included an advisory from WHO, issued in December that states that masks alone are insufficient to prevent COVID-19 or spreading the virus that causes it.", "The article, “WHO: You Do NOT Need To Wear A Mask,” was published by Principia Scientific International and later picked up by another blog, “rainbowwarrior2005.”", "Media Bias/Fact Check rates Principia Scientific International as a conspiracy and pseudoscience website that “promotes anti-vaccine propaganda and frequent misinformation regarding climate change.”", "In a statement to USA TODAY, Principia Scientific International CEO John O'Sullivan cited a quote from Dr. Michael Ryan, executive director of WHO's health emergencies program.", "\"There is no specific evidence to suggest that the wearing of masks by the mass population has any particular benefit. In fact, there is some evidence to suggest the opposite in the misuse of wearing a mask properly or fitting it properly,\" Ryan said at a news conference March 30.", "Ryan added that there was a \"massive global shortage\" of masks at the time and front-line health care workers most at risk should be prioritized.", "Although WHO originally suggested that health care workers, infected people and caregivers of people with COVID-19 should wear masks, the agency updated that guidance in June 2020 to include the general public.", "\"In light of evolving evidence, WHO advises that governments should encourage the general public to wear masks where there is widespread transmission and physical distancing is difficult, such as on public transport, in shops or in other confined or crowded environments,\" Director-General Tedros Adhanom Ghebreyesus said at a news conference June 5.", "WHO has not suggested healthy people should stop wearing masks. In fact, the world body recently reiterated its guidance that people continue to wear masks to prevent the spread of the coronavirus and new variants.", "“Masks are one aspect of control. One aspect of reducing the spread of this virus and they can't be used alone,” Dr. Maria Van Kerkhove, WHO’s COVID-19 technical lead, said at a news conference Jan. 22.", "She added that people should take other approaches, such as maintaining physical distancing and practicing good hand hygiene, in addition to mask-wearing. Kerkhove also said WHO recommends a three-layer mask for people who choose to wear fabric masks.", "More:Fact check: National Guard will remain in DC through Trump's impeachment trial", "Masks worn by healthy people in the general public can reduce the spread of respiratory droplets containing infectious viral particles, according to guidance issued by WHO in December.", "When asked for comment, WHO spokesperson Amna Smailbegovic sent USA TODAY links to two web pages: a Q&A page on masks and another on when and how to wear masks.", "“Masks are a key measure to suppress transmission and save lives,” the WHO website states.", "The U.S. Centers for Disease Control and Prevention also urges people to wear a mask even when they do not feel sick because asymptomatic people with COVID-19 can still spread the virus.", "Studies show that masks help reduce the spray of respiratory droplets when worn over the nose and mouth, according to the CDC.", "More:Fact check: Merck discontinues COVID-19 vaccine work over weak immune response", "Health officials are now urging people to double up on masks as new COVID-19 variants emerge from the United Kingdom, South Africa and Brazil.", "“So, if you have a physical covering with one layer, you put another layer on, it just makes common sense that it likely would be more effective,\" Dr. Anthony Fauci, the nation’s top infectious disease expert, told NBC News’ \"TODAY\" on Jan. 25. “That’s the reason why you see people either double masking or doing a version of an N95.”", "Officials said the U.K. variant, which appears to be more contagious, could also be deadlier. A variant first found in South Africa appears to be about 50% more contagious, USA TODAY reported.", "More:Fact check: Declaration that Senate cannot convict an ex-president lacks context", "The claim that the World Health Organization said healthy people do not need to wear masks is FALSE, based on our research. There is no evidence that WHO recently said this, and health officials continue to encourage people to wear masks even if they are not sick.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook."]