["About this rating", "On 18 November 2016, the cast of Broadway musical Hamilton made national news when actor Brandon Michael Dixon addressed visiting Vice President-elect Mike Pence during the show's curtain call.", "Dixon and that night's performance of Hamilton made headlines overnight when Pence was first loudly booed by several of his fellow theatergoers, and again when Dixon's plea went viral:", "You know, we have a guest in the audience this evening. Vice President-elect Pence, I see you walking out but I hope you hear just a few more moments. There's nothing to boo, ladies and gentlemen. There's nothing to boo. We're all here sharing a story of love. We have a message for you, sir. We hope that you will hear us out.", "And I encourage everybody to pull out your phones and tweet and post, because this message needs to be spread far and wide, OK?", "Vice President-elect Pence, we welcome you and we truly thank you for joining us here at Hamilton: An American Musical. We really do.", "We sir, we, are the diverse America who are alarmed and anxious that your new administration will not protect us — our planet, our children, our parents — or defend us and uphold our inalienable rights, sir. But we truly hope that this show has inspired you to uphold our American values and to work on behalf of all of us. All of us.", "Again, we truly thank you for sharing this show, this wonderful American story told by a diverse group of men and women of different colors, creeds, and orientations.", "Predictably, the events of the night were approved by many of President-elect Donald Trump's detractors, and interpreted as an insult by many of his supporters (who began using the hashtag #BoycottHamilton). The debate immediately got messy, and in the ensuing social media back-and-forth, a tweet sent by Dixon on 17 March 2012 was unearthed:", "St. Patty's day weekend is like Christmas for black dudes who like white chicks. Happy holidays boys. @reesewaters#seasonsgreetings", "— Brandon Victor Dixon (@BrandonVDixon) March 17, 2012", "Although it appeared in a time of fake tweets being commonly spread for political purposes, the tweet attributed to Brandon Victor Dixon here is real and unaltered. As of 21 November 2016, it remained accessible in his Twitter timeline.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]