["Pakistani channel 24 News HD shared the video on its YouTube channel here, where it has been viewed more than 80,000 times since it was uploaded late August 4, 2019 -- less than an hour after senior Kashmiri politician leaders said they were placed under house arrest.", "The video is headlined: \"House Arrest Syed Ali Shah Geelani Challenges To Indian Army\".", "A red text box says \"BREAKING NEWS\" as a television host says: \"The morale of house-arrest elderly Kashmir leader Syed Ali Geelani are still high. He asked Indian soldiers to open the door, the funeral of democracy of India is getting out.\"", "The video then shows footage of Jammu and Kashmir-based separatist leader Syed Ali Geelani standing behind a closed door.", "Below is a screenshot of the misleading YouTube video:", "The same video of Geelani alongside similar claims has been posted repeatedly on social media after the Indian government put Indian-administered Kashmir under an indefinite security lockdown and scrapped the state’s special status in the early hours of August 5, 2019.", "Here is an AFP report published on August 5 about the developments.", "The 45-second video video was published in this Facebook post on August  5, 2019, where it has been viewed more than 31,000 times.", "The Hindi-language caption of the post translates to English as: “Open the doors, I will not fly, The funeral of India's democracy is underway. Heart wrenching video of house arrested Senior Freedom Fighter of Kashmir Mr. Syed Ali Geelani. A big Shame on India!\n\t#kashmirSos #freeKashmir #terroristIndia”.", "Below is a screenshot of the misleading post:", "The same video was published here on August 6, 2019 on Twitter with an Urdu-language caption making a similar claim.", "Other Pakistan media organisations also shared the same video of Geelani in reports in August 2019, without stating the video was from 2018, for example here on the Facebook page for Pakistani news site The Times of Karachi.", "The claim is misleading; the video has circulated online in reports since at least April 2018.", "A reverse image search on Google using keyframes from the misleading video obtained through video verification tool InVID found this video published on the official YouTube channel for Kashmir-based English-language newspaper Greater Kashmir on April 4, 2018.", "The video’s title states: “Open the door, I won’t fly away: Geelani to police after they bolt door from outside.”", "The video in the misleading posts corresponds with the Greater Kashmir video from the 27 seconds mark to the one minute 12 seconds mark.", "Below is a screenshot comparison of the video in the misleading posts (L) and the Greater Kashmir video (R):", "Ruwa Shah, a family member of the separatist leader from Kashmir told AFP in a text message that the video was filmed in April 2018.", "\"This is an old video from April 2018, when Geelani was placed under house arrest,\" she said.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]