["By Saranac Hale Spencer", "Posted on April 23, 2019", "A popular Facebook post gives readers a false impression about the recent college admissions scandal and the cost of college for immigrants in the United States illegally.", "Where can you find an inaccurate comparison between the college admissions bribery scandal and the cost of college for immigrants in the U.S. illegally?", "Facebook.", "A meme that has been shared over 18,000 times makes this claim: “Break the law to enter college, you’re expelled and your parents go to jail. Break the law to enter the country, free college!”", "The first part of the claim is a reference to the criminal charges recently brought against 33 parents, who are accused of participating in a bribery scheme to get their children admitted to selective colleges and universities.", "It’s true that the parents are facing potential jail time, although none of them have been sentenced yet. So, it’s unclear whether or not they will actually serve time in jail.", "Also, not all of the students involved have been “expelled.” For example, the University of Southern California is handling the continued enrollment of each student who was involved on a case-by-case basis. Wake Forest University, however, is allowing a student to remain enrolled since the school determined the student wasn’t aware of the bribery, and Yale University has rescinded the offer of admission to the one student involved in the scandal. (It’s not clear what actions other colleges and universities named in the federal indictments have taken.)", "As for the part of the claim that says those who “break the law to enter the country” get “free college,” that’s even more misleading.", "In six states, immigrants in the country illegally are barred from having access to in-state tuition, according to data compiled in a recent report from the National Conference of State Legislatures. In 22 states and the District of Columbia, immigrants in the country illegally are allowed to pay in-state tuition rates, but in only 11 of those do they have access to financial aid.", "Of those 11 states, only six offer programs that cover the full cost of tuition, or fill in the gap between what students can pay and the remainder of their tuition costs, regardless of legal status. Also, the eligibility requirements for those programs differ, but are generally based on merit, age, length of residency, income, or a combination of those things.", "Here’s how the programs in those six states compare:", "In addition, there are across the country some local “promise programs,” which are either privately or publicly funded tuition-assistance programs that cover the cost of college or career programs for some students. But most of them are not available to immigrants in the country illegally.", "So, the amount that immigrants in the country illegally have to pay for college depends on the state or locality in which they live, and whether they meet the requirements of the specific scholarship or grant programs that are offered.", "Even in the areas where unauthorized immigrants can access tuition assistance programs, those programs usually don’t allow students to go to any school they choose (most apply to community colleges) and they don’t ensure a complete free ride. According to the College Board, tuition and fees account for only 20 percent of the average budget for community college students and 40 percent of the average budget for in-state students living on campus at public four-year schools.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on the social media network.", "Investigations of College Admissions and Testing Bribery Scheme. United States Attorney’s Office for the District of Massachusetts. Accessed 19 Apr 2019.", "Kircher, Madison Malone. “College Admissions Scam Fallout: What Happened to Everyone in the Scandal.” New York Magazine. 15 Apr 2019.", "Tuition Benefits for Immigrants. National Conference of State Legislatures. 16 Jan 2019.", "Boggs, Bennett. “A Promise is a Promise: Free Tuition Programs and How They Work.” National Conference of State Legislatures. Mar 2019.", "College Promise Programs in the United States. Penn Ahead — Alliance for Higher Education and Democracy. University of Pennsylvania. Accessed 22 Apr 2019.", "Average Estimated Undergraduate Budgets, 2018-19. College Board. Accessed 23 Apr 2019.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]