["The U.S. Capitol building in Washington. (AP)", "H.R. 1 includes sections on absentee voting, in-person voting, campaign finance and ethics. The House is expected to vote on the bill in March.", "A provision in the bill would allow non-incumbent candidates for federal office to use campaign funds to pay for child care, elder care or health insurance premiums.", "The bill does not change existing law that allows non-incumbent candidates to draw a salary from campaign funds. The law is rarely used by candidates.", "Members of Congress already earn six-figure paychecks. A conservative group says that a Democratic-backed bill would allow them to earn a second paycheck worth even more.", "But that’s bogus.", "The claim from Act for America pertains to H.R. 1, the For the People Act. The bill combines previous proposals that aim to make it easier to vote, and it changes campaign finance rules to help Americans who aren’t rich run for federal office. The House is expected to vote on the bill in March.", "Act for America wrote a plea for Congress to reject the bill. In a claim about proposals for the use of campaign funds, the group said that based on an estimate from the Congressional Budget Office, \"members of Congress will be able to draw a SECOND salary from that money worth an estimated $600,000 per year!\"", "This would be \"on top of the generous taxpayer-funded paychecks and perks they already give themselves!\" the group said.", "But there’s no such provision in the bill, and Act for America did not reply to our requests for evidence. After we inquired about the claims, we noticed that the webpage no longer included the $600,000 figure.", "Act for America calls itself the \"nation’s premier national security grassroots organization.\" The Southern Poverty Law Center and the Anti-Defamation League say the group is anti-Muslim.", "The Campaign Legal Center, a group that supports H.R. 1, said that there is no provision in the bill to pay lawmakers $600,000.", "\"I’ve tried to figure it out, but I can’t find anything,\" said Brendan Fischer, the center’s director of federal reform. \"There are going to be some claims about H.R. 1 that are misstatements or statements of opinion, but these claims are just made up.\"", "The Congressional Budget Office analysis of a previous version of the legislation also makes no mention of a \"second salary.\"", "A section in the bill about \"personal use services\" states that candidates can use campaign money for child care, elder care or health insurance premiums so they can campaign, but the provision does not apply to incumbents.", "The goal of this provision is to help Americans who aren’t rich to run for Congress. Many lawmakers are millionaires who have wealth and incomes above many of the residents they represent.", "Current federal law bans candidates from using campaign funds for personal use. The Federal Election Commission, which can rule on whether an expense is legitimate, has given the go-ahead in recent years for candidates to use campaign funds for child care.", "H.R. 1 doesn’t change a longstanding policy that allows non-incumbent federal candidates to use campaign funds to pay themselves a salary. The salary has to be whatever is less: the candidate’s income for the previous year or $174,000, which is what current members of Congress earn.", "In 2002, the FEC voted to allow candidates running for Congress or president to pay themselves a salary using campaign funds. When commissioner Michael Toner, a Republican, sponsored the measure, he said, \"candidates of modest means too often have been crowded out of running for office. It may allow people like blue-collar workers, schoolteachers and others who don't make six-figure salaries to run for office.''", "But candidates rarely pay themselves a salary. The Center for Public Integrity found that 22 candidates running for Congress collectively paid themselves $155,000 during the 2018 election cycle.", "FreeRoots, the hosting platform where Act for America posted its message, responded to an inquiry from PolitiFact, but did not provide any evidence that members of Congress would be able to draw a second salary worth up to $600,000.", "Act for America said H.R. 1 will allow members of Congress to draw a second salary \"worth an estimated $600,000 per year!\"", "We found nothing in the legislation that would allow members of Congress to earn a second salary. There is a provision that allows non-incumbent candidates to use campaign funds to pay for expenses such as child care so they are able to run for office.", "H.R. 1 does not change an existing policy that allows candidates to draw a salary of up to $174,000 from campaign funds. That policy doesn’t apply to those who are already in Congress.", "We rate this statement False.", "RELATED: Fact-checking misleading attacks on HR 1, Democrats’ voting rights bill", "RELATED: Claim about congressional pensions is wrong, once again", "RELATED: Fact-checking Mark Walker's video on HR 1’s campaign-finance provisions", "Act for America, Tell Congress: \"Help America, Not Yourself!\" Accessed Feb. 23, 2021", "Campaign Legal Center, H.R. 1 Fact-check: email invents false claims about ‘second salary,’ Feb. 22, 2021", "Federal Election Commission, Personal use, accessed Feb. 24, 2021", "Center for Public Integrity, You’re young and broke. Here’s how to still win a congressional seat. Dec. 10, 2018", "Center for Public Integrity, By the numbers: a 2018 money in politics index, Dec. 27, 2018", "Facebook post, Jan. 25, 2021", "Congress.gov, H.R.1 - For the People Act of 2021, Introduced Jan. 4, 2021", "Congress.gov, HR 1 For the People Act of 2019, Introduced Jan. 3, 2019", "Congress.gov, H.R.1623 - Help America Run Act, March 7, 2019", "Campaign Legal Center, The Bipartisan Origins & Impact of the For the People Act (H.R. 1/S. 1) Jan. 25, 2021", "Campaign Legal Center, For a More Accessible, Transparent and Responsive Government, CLC’s Trevor Potter Encourages Congress to Pass the \"For the People Act,\" Jan. 4, 2021", "Campaign Legal Center, How H.R. 1 Will Help Us Achieve a Government for the People, Jan. 4, 2021", "Center for Responsive Politics, Democrats prioritize campaign finance overhaul with ‘For the People Act’ Jan. 21, 2021", "HuffPost, Congress Deluged With False Attack On Voting Rights And Campaign Finance Reform Bill, Feb. 22, 2021", "Vote Mama website, Accessed Feb. 24, 2021", "New York Times, Candidates Allowed to Have Salaries From Campaigns, Nov. 26, 2002", "NPR, FEC Says That Candidates Can Use Campaign Funds For Child Care, May 10, 2018", "FEC, Advisory opinion, July 25, 2019", "FreeRoots, Email to PolitiFact, Feb. 25, 2021", "Email interview, Daniel Jacobs, spokesperson for U.S. Rep. John Sarbanes, D-Maryland, Feb. 24, 2021", "Telephone interview, Brendan Fischer, Campaign Legal Center director of federal reform, Feb. 24, 2021", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]