["About this rating", "Two successive voter ID laws in Texas imposed new requirements on voters who might have changed their last names due to marriage or divorce (an issue which primarily affects women).", "The laws do not have anything to do with birth certificates and do not require the bringing of marriage or divorce documents to the polls. The laws still allow voters to cast normal ballots after signing affidavits and marking boxes on the ballot papers labeled \"Similar Name.\"", "In the weeks leading up to the November 2018 U.S. midterm elections, reports of voter suppression and voter fraud intensified, and a years-old meme emerged which gave the impression that the state of Texas was disenfranchising women en masse:", "Texas is preventing up to 1/3 of female voters from voting.", "This means if a woman has been married, divorced and re-married then she must bring both marriage certificates and divorce documents in order to vote!", "Although we received inquiries from readers about these claims starting in August 2018, the meme itself, created by the Facebook page \"Meme GOP,\" actually first emerged in the autumn of 2013, in the lead-up to two special statewide elections in Texas.", "The meme referenced a real voter ID controversy that occurred in Texas in 2012 and 2013, but it presented some details falsely and significantly overstated the extent to which the policy in question actually impeded voters, including women, from casting their ballots.", "Background", "In 2011, Texas state legislators passed S.B. 14, a bill which required registered voters to show photo ID at polling stations. The accepted forms of ID were specified as: driver's license, election identification certificate, Texas Department of Public Safety personal ID card, military ID, U.S. citizenship certificate, U.S. passport, and a concealed handgun license.", "If a voter's name as shown on the photo ID did not exactly match the name on the voter rolls but was \"substantially similar\" in the opinion of polling station staff, the voter could cast a ballot after signing an affidavit swearing that they were the same person listed on the voter roll:", "On presentation of the documentation required under Subsection (b), an election officer shall determine whether the voter’s name on the documentation is on the list of registered voters for the precinct. If in making a determination under this subsection the election officer determines under standards adopted by the secretary of state that the voter’s name on the documentation is substantially similar to but does not match exactly with the name on the list, the voter shall be accepted for voting under Subsection (d) if the voter submits an affidavit stating that the voter is the person on the list of registered voters.", "A spokesperson for the Texas Secretary of State's office confirmed for us that election clerks were trained to look for overlaps in information, including residential addresses and dates of birth, and treat former names (for example names used in the course of marriage, divorce, or re-marriage) as \"substantially similar.\"", "What this meant was that, in principle, even voters whose last names had changed since they registered to vote could cast full ballots (as opposed to a provisional ballots) without any requirement to bring additional documentation to the polling station. The only differences in their voting experiences were that they would have to sign sworn affidavits and check a box labeled \"Similar Name\" on their ballots.", "It's possible that some voters might be discouraged from voting by these requirements (especially the requirement to sign a sworn affidavit), or that some election clerks might not be comprehensively trained in the relevant procedures, or that a confusion or delay over names might prompt a voter who was pressed for time to give up on casting a ballot.", "However, the meme was wrong in its claim that the photo ID law in place in Texas in 2013 \"prevented\" anyone (including women) from voting, or that voters were required to bring marriage or divorce documents to the polling station.", "Evolution of the policy", "Before S.B. 14 could be implemented in 2012, Texas had to obtain federal approval, under a structure set out in the 1965 Voting Rights Act, which requires certain states with a history of racial discrimination (including Texas) to get \"pre-clearance\" from the U.S. Department of Justice when implementing laws that affect the free exercise of the right to vote.", "The Justice Department denied Texas this pre-clearance, finding that the photo ID requirements in S.B. 14 would disproportionately affect the rights of voters from racial and ethnic minorities. Texas took their application for pre-clearance to the U.S. District Court for the District of Columbia, which upheld the Justice Department's decision. As a result, the new photo ID law was kept in administrative limbo for almost another year.", "In June 2013, the U.S. Supreme Court issued an important opinion in a case called Shelby County vs. Holder. Roughly speaking, the court ruled unconstitutional the formula set out in the Voting Rights Act to determine which states had to get federal pre-clearance for changes to their voting practices. Since this was the mechanism by which the Justice Department had blocked S.B. 14, the path was now clear for Texas to enforce their new voter ID laws.", "In October 2013, the provisions of S.B. 14 were used for the first time during two relatively minor statewide elections, but controversy emerged when two high-profile Texas women encountered difficulties at the polling stations due to discrepancies involving their names, as USA Today reported:", "One of those voters was state Sen. Wendy Davis, who gained national prominence in June for an 11-hour filibuster against a law restricting abortion. Davis, a Democrat who is now running for governor, opposed the voter ID law but got the affidavit procedure added as an amendment. [D]uring the state's early voting, Davis had to sign an affidavit while voting because her driver's license includes her maiden name while her voter registration does not.", "\"It was a simple procedure,\" Davis told the Fort Worth Star-Telegram. \"I signed the affidavit and was able to vote with no problem.\" But she said she worries that other women in Texas may be \"surprised\" by the requirement.", "The law doesn't apply only to women: Davis' likely opponent in the 2014 governor's race, Republican Attorney General Greg Abbott, says he will have to sign the affidavit also since the name on his driver's license is Gregory Wayne Abbott, but he is registered to vote as Greg Abbott.", "South Texas television station KIII described the experience of District Judge Sandra Watts:", "The problem came to light when a local district judge had trouble casting a ballot. \"What I have used for voter registration and for identification for the last 52 years was not sufficient yesterday when I went to vote,\" 117th District Court Judge Sandra Watts said.", "Watts has voted in every election for the last 49 years. The name on her driver's license has remained the same for 52 years, and the address on her voter registration card or driver's license hasn't changed in more than two decades. So imagine her surprise when she was told by voting officials that she would have to sign a \"voters affidavit\" affirming she was who she said she was.", "\"Someone looked at that and said, 'Well, they're not the same,'\" Watts said. The difference? On the driver's license, Judge Watts' maiden name is her middle name. On her voter registration, it's her actual middle name. That was enough under the new, more strict voter fraud law, to send up a red flag. \"This is the first time I have ever had a problem voting,\" Watts said.", "After 2013, the photo ID law went through a somewhat complicated legal saga, which is well summarized here. In 2017, the Texas state legislature passed a new photo ID law called S.B. 5, which somewhat relaxed the ID requirements and gained U.S. Court of Appeals approval in April 2018.", "A spokesperson for the Secretary of State's office confirmed to us that the procedures relating to \"substantially similar\" names had not changed under S.B. 5 and remained as they were under S.B. 14. Therefore, the meme's claims about divorce documents and birth and marriage certificates were as inaccurate about the law in October 2018 as they were in October 2013.", "The latest official guidelines for election judges and clerks in Texas outline the procedures that are relevant to voters whose last names have changed since they registered to vote:", "If the voter’s name on the precinct’s list of registered voters is not identical to the voter’s name as it appears on the acceptable form of photo identification or the supporting form of identification (if applicable), the election officer will determine, under standards adopted by the Secretary of State, if the names are “substantially similar.” If the names are substantially similar, the voter shall be accepted for voting. The voter must submit an affidavit, which is part of the combination form, stating that the voter is the person on the list of registered voters.", "A voter’s name on the presented identification form is considered substantially similar to the name on the official list of registered voters and a voter’s name on the official list of registered voters is considered substantially similar to the name on the presented identification form if one or more of the circumstances in paragraphs (1) - (4) of this subsection are present. In determining whether one or more of those circumstances are present, election workers should consider whether information on the presented identification form matches elements of the voter’s information on the official list of registered voters such as the voter’s residence address or date of birth, which may be strong indicators that the name on the presented identification form is substantially similar to the name on the official list of registered voters and vice versa if:", "3. Initial, Middle Name or Former Name: The voter’s name on the presented identification form contains an initial, a middle name, or a former name that is not on the official list of registered voters or the official list of registered voters contains an initial, a middle name, or a former name that is not on the presented identification form ...", "These guidelines have not changed since 2014, when S.B. 14 was still in place.", "Conclusion", "The 2013 meme referred to a real voter ID controversy in Texas and a 2011 law (S.B. 14) which did create certain specific requirements for voting that could disproportionately impact women because of the tradition of hanging surnames after marriage. However, S.B. 14 did not, in 2013, \"prevent\" women from voting outright, as the meme claimed. Nor did a 2017 version of the photo ID law (S.B. 5.) \"prevent\" anyone from voting outright.", "Rather, the photo ID law (in both its incarnations) meant voters whose names were different on their photo IDs than on the voter rolls could still cast ballots provided they signed sworn affidavits and checked a box labeled \"Similar Name.\"", "The meme made two more specific factual claims. First, that a \"voter card must match [a] birth certificate.\" This is inaccurate: Texas law requires that the name on a voter's photo ID must be at least substantially similar to their name as listed on the voter roll. The voter's birth certificate does not come into the equation.", "Second, the meme alleged that \"if a woman has been married, divorced and re-married then she must bring both marriage certificates and divorce documents in order to vote!\" This is also false. In order to cast a ballot (i.e. \"in order to vote\") a voter whose last name has changed need only sign an affidavit swearing that they are the same person listed on the register, and check the box on their ballot paper marked \"Similar Name.\" There is no requirement to present marriage certificates or divorce documents at polling stations.", "The Haunted Pen.   \"Lies Involving Voting in TX.\"\r\n    29 October 2013.", "Texas Legislature.   \"S.B. 14 -- An Act Relating to Requirements to Vote, Including Presenting Proof of Identification; Providing Criminal Penalties.\"\r\n    Texas Legislature.   27 May 2011.", "U.S. Department of Justice.   \"About Section 5 of the Voting Rights Act.\"\r\n    U.S. Department of Justice.   4 December 2017.", "Savage, Charlie.   \"Justice Dept. Blocks Texas on Photo ID for Voting.\"\r\n    The New York Times.   12 March 2012.", "Horwitz, Sari.   \"Texas Voter-ID Law Is Blocked.\"\r\n    The Washington Post.   30 August 2012.", "U.S. Supreme Court.   \"Shelby County vs. Holder.\"\r\n    25 June 2013.", "Moore, Martha T.   \"State Voter ID Laws Snare Women with Name Changes.\"\r\n    USA Today.   30 October 2013.", "Munson, Jonathan.   \"Voter ID Law May Cause Problems for Women Using Maiden Names.\"\r\n    KIII-TV.   31 October 2013.", "Brennan Center for Justice.   \"Texas NAACP vs. Steen.\"\r\n    Brennan Center for Justice.   21 September 2018.", "Texas Legislature.   \"S.B. 5 -- An Act Relating to Requiring a Voter to Present Proof of Identification; Providing a Criminal Penalty and Increasing a Criminal Penalty.\"\r\n    Texas Legislature.   1 June 2017.", "Fernandez, Manny.   \"Texas' Voter ID Law Does Not Discriminate and Can Stand, Appeals Panel Rules.\"\r\n    The New York Times.   27 April 2018.", "The Office of the Texas Secretary of State, Elections Division.   \"Qualifying Voters on Election Day -- Handbook for Election Judges and Clerks, 2018.\"\r\n    The Office of the Texas Secretary of State, Elections Division.   January 2018.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]