["By Angelo Fichera", "Posted on February 21, 2020", "A story circulating online misleadingly claims Stacey Abrams “boasted that Democrats can ‘jerry-rig the system and go around the Constitution’ to win the 2020 election.” Her comments about moving to a national popular vote system were not about the 2020 election or securing a Democratic victory.", "Stacey Abrams, the Democrat and former Georgia gubernatorial candidate, appeared on an episode of ABC’s “The View” that aired Feb. 17 and discussed several issues — including her voting rights organization and speculation that she could be tapped to run for vice president.", "In a clip not aired on TV but posted by the show’s official Twitter account, Abrams was asked about her opposition to the Electoral College. The question led to a discussion about an effort to shift the country to a popular-vote system without having to change the Constitution to eliminate the Electoral College.", "But a story published by the website NewsPunch.com and shared by thousands on Facebook distorts what she said by claiming, “Stacey Abrams Boasts Dems Can ‘Jerry-Rig System’ and ‘Go Around Constitution’ To Win 2020 Election.” That’s misleading.", "Abrams’ comments were not in reference to the 2020 election or about securing a victory for the Democrats in November.", "Abrams, Feb. 17: [The Electoral College] is a classist, racist system whose time has passed and we need to get rid of it.", "Joy Behar: But it’s going to be very hard to do, especially with Republicans in power.", "Abrams: And I want to be clear, I’ve been opposed to the Electoral College for a very long time. I introduced legislation when I was in the state legislature. I co-sponsored it with a Republican to eliminate the Electoral College and to do the national popular vote. Because I don’t care if it’s a Democrat or a Republican, I’m an American and my voice should count and my vote should count and I don’t need anyone to intercede.", "Behar: It requires an amendment though, it’s a big deal.", "Abrams: It does. It does. Although the National Popular Vote movement, what that would do is get each state to agree to just cast their electors based on the national vote, so we can basically jerry-rig the system and go around the Constitution. I would prefer we actually fix it at the source but, you know, I don’t have that kind of time.", "Abrams didn’t characterize the effort as a method of securing a Democratic a victory in 2020 — and she correctly made clear that the proposal isn’t new.", "The National Popular Vote movement began in 2006, according to the National Conference of State Legislatures. The initiative seeks to have states approve legislation to agree to a “National Popular Vote Interstate Compact,” pledging that the state’s electoral votes will be awarded to the presidential candidate who wins the popular vote nationwide — rather than the candidate who wins the vote in just that state. Proponents argue that the Constitution empowers states to choose how to award their electoral votes, but others claim the compact is unconstitutional.", "While 15 states and the District of Columbia have enacted such legislation since 2007, none will go into effect until the states that are part of the compact have 270 electoral votes — the minimum required to win the presidency. Abrams, as a Georgia state representative in February 2016, did indeed sponsor a bill to have the state join the compact. It was co-sponsored by several Republican colleagues, but was not passed.", "The Virginia House recently approved such legislation. If the state ultimately enacts the measure, the compact would have states worth 209 electoral votes. The compact has a July 20 deadline in order to go into effect for November’s general election — which is an unlikely scenario.", "Getting more states on board to secure the other 61 votes needed would be a “steep climb,” the Wall Street Journal editorial board recently wrote. The board opined that the path there is potentially conceivable if there is a “Democratic statehouse sweep in 2020” — meaning after the election — and even then, lawsuits would likely follow.", "The NewsPunch story also misleadingly suggests “The View” clip was deliberately hidden: “Strangely, the segment where Abrams talks about the jerry-rigging was cut from the main show,” it reads, adding that “[l]uckily, the footage surfaced on social media.” A Facebook page associated with the website also shared the story and asserted that Abrams was “caught,” calling the clip “incriminating.”", "Lauri Hogan, a spokeswoman for ABC, said Abrams’ interview was pre-taped prior to Monday and that the segment was trimmed from the final cut for timing purposes — but said, as we noted, that the clip was posted by the show’s verified Twitter account.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "“Agreement Among the States to Elect the President by National Popular Vote.” National Popular Vote. Accessed 19 Feb 2020.", "Hogan, Lauri. Spokeswoman, ABC. Phone interview with FactCheck.org. 20 Feb 2020.", "“National Popular Vote.” National Conference of State Legislatures. 27 Jan 2020.", "The View (@TheView). “.@staceyabrams explains why she says the Electoral College is a “classist racist system whose time has passed and we need to get rid of it.” Twitter. 17 Feb 2020.", "Virginia General Assembly. “House Bill No. 177, A BILL to amend the Code of Virginia by adding in Chapter 2 of Title 24.2 an article numbered 2.1, consisting of sections numbered 24.2-209.1 and 24.2-209.2, relating to the presidential electors and the Agreement Among the States to Elect the President by National Popular Vote Compact.” (as introduced 8 Jan 2020)", "Wall Street Journal Editorial Board. “Will Virginia Drop the Electoral College?” Wall Street Journal. 17 Feb 2020.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]