["“An intermediate student Priyanka Kushwaha of Gopalganj district was attacked by a Muslim boy. He intended to kill her as he brutally attacked her with a knife. Where are the people who call Islam a peaceful religion? Where are these secular animals? It is because of seculars that such incidents occur (translated),” tweeted a user named Suresh Patel along with images of a wounded woman. Patel is followed by Railway Minister Piyush Goyal’s Office and BJP Delhi spokesperson Tajinder Singh Bagga. His tweet drew over 1,700 retweets.", "#गोपालगंज जिल्ले में इंटर के #छात्रा #प्रियंका_कुशवाहा पर #मुस्लिम लड़के ने #जान से मारने की नियत से उसके #शरीर पर चाकू से #ताबड़तोड़ हमला किया#आतंकी #मुस्लिम #धर्म को शांति का धर्म बताने वाले कहा है ?? कहा है #सेक्युलर जानवर ??#सेक्युलरो की वजसे ही ऐसी घटना घटती है pic.twitter.com/6ofR1NkiGD", "— Suresh Patel (SARANG) (@SureshPatelJi) October 13, 2018", "Several other users who are followed by Goyal’s Office also circulated the images with the identical narrative (1, 2, 3).", "A parody account of journalist Sweta Singh propagated the ‘Muslim attacked Hindu girl’ as well, drawing over 300 retweets. This was also viral on Facebook with BJP worker Roshan Pandey’s post shared nearly 7,000 times. It was also circulated by Facebook pages and groups – हिन्दू राज (Hindu Raj) and 🕉हिन्दू एकता दल🕉 (Hindu ekta dal).", "Fake news website Dainik Bharat published an article titled – “Gopalganj: Priyanka Kushwaha resisted, attacked by Abdul who tried to brutally wound her (translated).” The report was shared 1,000 times from the website.", "An October 11 report in Prabhat Khabar stated that a woman was attacked by a man named Sandeep Giri on her way back home from a temple. The perpetrated assaulted her with a knife when his advances were rejected. The incident took place in Kateya, Gopalganj in Bihar.", "To corroborate the media outlet’s version, Alt News contacted Gopalganj District Magistrate IAS Animesh Kumar Parashar. He informed that the man arrested was not a member of the Muslim community and claims on social media suggesting otherwise are only an attempt to communalise the issue. “Action will be taken against the ones spreading the rumours,” said Kumar.", "As the name of the survivor and the district where the incident occurred was known, Alt News searched for a complaint that might have been lodged by the survivor. We found a copy of the FIR filed at Kateya police station on the Bihar Crime Records Bureau website.", "According to the FIR, a 23-year-old man named Sandeep Giri held the 20-year-old survivor by her wrist and harassed her when she was returning home from a temple. On resisting the assault, he attacked her with a knife. When the woman tried to escape he slit her shoulders and back. As several locals gathered to save her, the perpetrator escaped.", "Communalising a crime in order to swing the narrative against minority communities isn’t a new phenomenon. Recently, provocative media reporting falsely linked the murder of 31-year-old Ankit Garg to members of the Muslim community, leading to hate-mongering along communal lines. Earlier this year, Alt News compiled a list of 20 instances when minorities were targetted in a similar fashion to create a fear psychosis. Such propaganda is an attempt to aggravate the religious divide by exploiting the existing societal prejudice. Provocative narratives deprived of credible media sources should always be verified before furthering them online.", "[The District Magistrate of Gopalganj was inadvertently referred to as Rahul Kumar who is the former DM. Alt News spoke to Animesh Kumar Parashar who is the current DM of Gopalganj. The article has been updated with the same.]", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]