["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A man receives the first round of the Pfizer COVID vaccination in Mississippi. (AP Photo/Rogelio V. Solis)", "Moderna’s data shows that 0.5% of people had a serious adverse reaction.", "Social media posts are spreading an inaccurate claim about the safety of the Moderna coronavirus vaccine.", "With the headline, \"Do not take the vaccine,\" a video post published Dec. 6 features James Lyons-Weiler giving this dire assessment of the Moderna vaccine trial data.", "\"21% of people are having serious adverse events from this vaccine,\" Lyons-Weiler says in the video. The clip is originally from Oct. 20, when Lyons-Weiler,  head of the private group Institute for Pure and Applied Knowledge, spoke at a PA Medical Freedom press conference.", "Lyons-Weiler’s number is more than 40 times too high.", "The video has been shared widely on Facebook in the last two weeks and was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The data Moderna submitted to the U.S. Food and Drug Administration reports that out of 15,184 who received the vaccine, 82 had a serious adverse event (see page 32). That is a tiny percentage.", "\"Serious adverse effects possibly related to the vaccine were equally rare in both groups — vaccine and placebo — at about 0.5%,\" said Shiv Pillai, Harvard University’s Immunology Program director. \"There was no difference between the vaccine and placebo groups.\"", "The FDA briefing paper on the vaccine said it found no patterns to indicate that the vaccine caused these adverse outcomes.", "We reached out to Lyons-Weiler and had not heard back by the time we published. We did find reference to 21% in a preliminary safety assessment of the Moderna vaccine in November that included a higher dose (250 micrograms) than is used today (100 micrograms). Only 14 people received two doses at the higher level, and three of them — 21% — had a systemic reaction that was judged to be serious. Systemic reactions include fever, headaches and muscle pains. In this study, they were not life-threatening. No one who got the 100 microgram dose had a serious reaction. That preliminary study said that \"no trial-limiting safety concerns were identified.\"", "An FDA panel recommended the vaccine for emergency use authorization.", "A video shared on social media says that 21% of people getting the Moderna vaccine had a serious adverse reaction.", "The actual number is .5%. That was the same level for the placebo group. There is no indication the vaccine caused any of these serious events.", "We rate this claim False.", "BitChute, PA Medical Freedom press conference, Oct. 20, 2020", "U.S. Food and Drug Administration, Briefing Document Moderna COVID-19 Vaccine, Dec. 17, 2020", "New England Journal of Medicine, An mRNA Vaccine against SARS-CoV-2 — Preliminary Report, Nov. 12, 2020", "New York Times, F.D.A. Panel Endorses Moderna’s Covid-19 Vaccine, Dec. 17, 2020", "Reuters, Moderna closes in on release of COVID-19 vaccine data, Nov. 11, 2020", "Email exchange, Shiv Pillai, director, Immunology Program, Harvard University, Dec. 18, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]