["Gov. Scott Walker asserts that the margins of his 2014 re-election win bode well for his electability on a larger scale.", "As he explores a run for the White House, Scott Walker is making a case for his electability, citing the fact he has won three elections for governor in four years. But he gives particular focus to the margins in his 2014 re-election victory.", "On Feb. 26, 2015, Walker spoke at the Conservative Political Action Conference, along with a host of other Republicans who are pondering a presidential run in 2016. The same day, he did an interview with Fox News talk show host Sean Hannity.", "Hannity's first question went to Walker’s electability: \"How does a Republican win in Wisconsin because, on a presidential level, they haven't won since '84?\"", "That was the year Ronald Reagan won a second term in a landslide. Since then, the state has gone Democratic seven straight times.", "\"You've got to go big and you've got to go bold,\" Walker replied.", "He continued by describing his 2014 win for a second term, over Democrat Mary Burke:", "\"I mean, ironically, I had solid support. In fact, I think more than any Republican governor in the country, I took a higher percentage of the Republican vote this last go-around, and yet I also carried independents by 12 points.\"", "We wondered about the numbers in Walker’s claim, one he repeated several days later in an interview with Chris Wallace on \"Fox News Sunday.\"", "So, did Walker win a higher percentage of the Republican vote in 2014 than any other Republican governor?", "And did he also win independent voters by a margin of 12 points?", "2014 exit polls", "Edison Research does exit polling for five TV networks and the Associated Press. The key data for this fact check are found in the responses to this question:", "\"No matter how you voted today, do you usually think of yourself as a Democrat, Republican, independent or something else.\"", "The results showed that three incumbent Republicans won at least 95 percent of the GOP vote in gubernatorial races (the GOP incumbent who won re-election with the lowest share of the GOP vote was Sam Brownback of Kansas, at 80 percent):", "Governor", "Percentage of Republican vote", "Terry Branstad, Iowa", "97%", "Scott Walker, Wisconsin", "96%", "John Kasich, Ohio", "95%", "Two notes: Republican Greg Abbott won 96 percent of the GOP vote in winning the Texas governor's race. But he was running for an open seat. And exit polls, like any poll, have a margin of error and the difference between 96 percent and 97 percent are within the margin of error. At the same time, they are the best numbers available.", "So, Walker’s Republican support was extremely high, but not quite the highest.", "(On the other side, Walker won only 6 percent of the vote from Democrats. That 90-point partisan gap -- 96 percent of the GOP vote versus 6 percent of the Democratic vote – was the biggest of any 2014 candidate for governor in states where exit polls were done, according to the Milwaukee Journal Sentinel's Craig Gilbert, who writes The Wisconsin Voter blog.)", "As for the second part of Walker’s claim, the Wisconsin exit poll found that among voters who identified themselves as independent or something else, Walker outperformed Burke by 54 percent to 43 percent.", "That’s a margin of 11 points, one point less than what Walker claimed.", "Our rating", "Walker said that more than any Republican governor in the 2014 elections, \"I took a higher percentage of the Republican vote\" and \"yet I also carried independents by 12 points.\"", "Exit polls show both parts of the claim are slightly off. Walker’s 96 percent support from Republicans was second to Iowa Gov. Terry Branstad’s 97 percent. And among independent voters in Wisconsin, Walker led Democratic challenger Mary Burke by 11 points, not 12.", "For a statement that is accurate but needs clarification, Walker earns a Mostly True.", "To comment on this item, go to the Milwaukee Journal Sentinel’s web page.", "------", "More on Scott Walker", "For profiles and stories on Scott Walker and 2016 presidential politics, go to the Milwaukee Journal Sentinel's Scott Walker page.", "YouTube, Gov. Scott Walker \"Hannity\" interview, Feb. 26, 2015", "\"Fox News Sunday\" Gov. Scott Walker interview, March 1, 2015", "Milwaukee Journal Sentinel, \"Walker reproduces his coalition -- and victories -- from 2010 and 2012,\" Nov. 5, 2014", "Milwaukee Journal Sentinel, \"Walker would bring a unique political  history to a 2016 bid,\" Dec. 8, 2014", "NBCNews.com, 2014 exit polls, accessed March 3, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]