["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Members of The U.S. Army Band Downrange perform at the National Cherry Blossom Festival in Washington D.C. (U.S. Army)", "President Donald Trump is meeting bipartisan resistance to his plan to trim about 30 percent from the State Department and foreign aid to help pay for a big boost in defense.", "Lawmakers from both sides of the aisle on the House Foreign Affairs Committee pushed back against such hefty cuts at a March 28 hearing. They asked one witness, former ambassador Nicholas Burns, what he thought of them.", "Burns served in the administrations of Bill Clinton and both Bushes. He cautioned that \"the only place to cut in the State Department is personnel.\"", "\"You're going to have to make some cruel choices,\" Burns continued. \"The State Department is not big. As Bob Gates said when he was secretary of defense, there are about as many members of the Armed Forces marching bands as there are American diplomats.\"", "That certainly gave the trade-off between ammo and diplomacy an unusual twist. We thought we’d dig into the numbers.", "The result? This comparison is a bit off key.", "There’s no question that the Pentagon keeps thousands of musicians on hand. A fact sheet on the 2017 Defense appropriations bill said \"the Defense Department currently fields more than 130 military bands worldwide, composed of more than 6,000 musicians.\"", "In 2016, Politico reported that the total number of trombone, trumpet, keyboard and other instrument players stands at about 6,500.", "That’s a lot of Souza marches, but the State Department fields a bigger squad of diplomats. There are 8,106 Foreign Service officers, according to a State Department report. (The State Department has about another 5,700 people to support the diplomats, but they don’t do direct diplomatic work.) Still, there are a good 1,600 more diplomats than musicians.", "Among that slender subset of the population that talks about the State Department budget, this is a popular comparison.", "Burns, as he said, was citing Gates, who in turn had borrowed the line from former Secretary of State Condoleezza Rice. Although, reading Gates’ words from 2010, it sounds as if he thought Rice was speaking a bit over the top.", "\"Condi Rice used to say, 'We have more people in military bands than they have in the Foreign Service.' She was not far wrong,\" Gates said.", "Hillary Clinton used a permutation of this talking point in her 2009 confirmation hearing for secretary of state. She said \"there are more members in military bands than there are Foreign Service officers serving overseas.\" (Our emphasis.)", "All of them used the quasi-stat to underscore that Congress finds it easier to fund the Defense Department than the State Department.", "We shared our findings with Burns; he said it was helpful to know it wasn’t accurate.", "\"In any case, the Foreign Service is quite small in comparison to DOD and Homeland Security,\" he said. \"The Trump proposal to cut State/USAID by 31 percent is reckless.\"", "Making the comparison department-wide, Burns is on firmer ground. Including support staff, the State Department has about 14,000 people in the Foreign Service. The Defense Department has about 1.3 million active duty soldiers. On that scale, the 1,600 person advantage that diplomats hold over band members is a rounding error.", "For close readers, we note that Burns added the \"marching\" part. We don’t know how many military musicians walk and how many sit. From the military bands’ websites, it does seem they do a lot of marching.", "Our ruling", "Burns said that there are about as many members of military marching bands as there are diplomats. In plain numbers, there are about 6,500 military musicians and about 8,100 diplomats. So, in fact, the diplomats have about a 1,600 staff advantage.", "But in the sense that diplomats are the backbone of the Foreign Service, while musicians, as important as they might be for morale, play a lesser numerical role in defending the nation, the numbers are closer than simple math would say.", "It’s time to retune this talking point, but on balance, we rate it Mostly False.", "Congressional Quarterly, House Foreign Affairs Committee hearing, March 28, 2017", "Congressional Quarterly, Defense Appropriations for FY 2017, March 7, 2017", "Politico, The Pentagon's battle of the bands, May 22, 2016", "The Hill, Analyst: Military bands to cost Pentagon $50B over next 50 years, May 18, 2011", "Washington Post, Vast number of military bands may not be music to Gates's ears, Aug. 24, 2010", "U.S. Senate Foreign Relations Committee, Nomination of Hillary R. Clinton to be secretary of state, Jan. 13, 2009", "U.S. State Department, Facts about Our Most Valuable Asset – Our People, Sept. 30, 2016", "U.S. Defense Department, Military and Civilian Personnel by Service, December 2016", "Email interview, Nicholas Burns, professor of diplomacy and international relations, Kennedy School, Harvard University, March 31, 2017", "Email interview, Frankie Sturm, press officer, U.S. State Department, March 30, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]