["By Jessica McDonald, Eugene Kiely and D'Angelo Gore", "Posted on July 10, 2019", "In a July 8 speech dedicated to the environment, President Donald Trump made a series of misleading or false statements as he played up the U.S.’s environmental achievements, many of which predate his time as commander-in-chief.", "In remarks at the White House, the president and his top aides cast the administration’s environmental record in a positive light. “We’re making tremendous environmental progress under President Trump, and the public needs to know that,” said Environmental Protection Agency Administrator Andrew Wheeler, who was a lobbyist for coal and other energy companies.", "But many of the environmental victories Trump cited have been in the works for years or decades, such as the cleanup of Superfund sites or the court-ordered EPA regulations.", "The president spoke of “revising the past administration’s misguided regulations to better protect the environment and to protect our American workers,” without specifying the impact of his many regulatory rollbacks.", "Trump has declined to support or sought to undo many of President Barack Obama’s signature environmental policies, including the Clean Power Plan. By the EPA’s own calculations, Trump’s replacement, the Affordable Clean Energy rule, provides very few carbon emissions reductions.", "The Trump administration has also proposed freezing fuel economy standards at 2020 levels through 2026 — an action the EPA says would increase CO2 emissions by 7.4 billion metric tons by the year 2100.", "The president also did not mention that he has proposed hefty cuts to the EPA’s budget each year, most recently proposing a 31% cut in fiscal year 2020 — including a 9 percent cut, or $109 million, to the Superfund program that Trump touted in his speech.", "The president falsely claimed that his administration last year completed a record number of Superfund cleanups.", "“We’ve refocused the EPA back on its core mission,” he said, “and, last year, the agency completed more Superfund hazardous waste cleanups than any year of the previous administrations and set records in almost every year. We have done tremendous work on Superfunds.”", "But there are several other years when the agency has removed more sites from the Superfund list than it did in 2018.", "By calendar year, 2018 had 17 full site deletions; by fiscal year, which ran from Oct. 1, 2017 through Sept. 30, 2018, there were 18. When including partial deletions, the tally rises to 22 for fiscal year 2018. This is the number the EPA likes to cite, noting that it is more deletions in any year since fiscal year 2005. An EPA spokesman told us this is what the president was referring to. But the figure is not a historical record.", "In calendar year 1996, the EPA removed 45 Superfund sites, or 34 when counting by fiscal year. Fiscal years 1997 and 2001 also each had more than 30 Superfund deletions. And every calendar year between 1995 and 2001 had at least 19 deletions. In 2017, there were just three calendar year deletions and two fiscal year deletions. So far in 2019, only one site has been deleted.", "As we’ve also noted before, Superfund cleanups often take decades to complete, so it’s inaccurate for Trump to take full credit for these deletions. In fact, of the 18 fully deleted sites in fiscal year 2018, all completed physical cleanup before 2016 and only two were made ready for reuse after 2016. The ready-for-reuse stage, regional EPA spokespeople previously told us, occurs when all of the remediation is complete and what’s left is contamination monitoring and paperwork.", "Trump did not once say “climate change” in his speech. But he did tout the nation’s progress over the past nearly two decades on reducing carbon dioxide emissions — even though Energy Information Administration data show energy-related CO2 emissions were 1.9% higher in 2018 than they were in 2016.", "Trump, July 8: Since 2000, our nation’s energy-related carbon emissions have declined more than any other country on Earth.  Think of that.  Emissions are projected to drop in 2019 and 2020.  We’re doing a very tough job and not everybody knows it, and that’s one of the reasons we’re here today to speak to you.  Every single one of the signatories to the Paris Climate Accord lags behind America in overall emissions reductions.", "Trump’s statistic is accurate, but it’s misleading because it refers to an absolute reduction in emissions, rather than a percent reduction. Absolute reductions fail to account for differences in population size or starting levels of emissions, rendering international comparisons meaningless.", "The factoid may have come from the International Energy Agency, which noted in its 2018 report that despite rising in 2018, “emissions in the United States remain around their 1990 levels, 14% and 800 Mt [million metric tons] of CO2 below their peak in 2000. This is the largest absolute decline among all countries since 2000.” (Note: While IEA data shows that peak emissions were in 2000, the EIA says that milestone occurred in 2007. Either way, the drop is around 14%.)", "While impressive, more than 10 other nations participating in the Paris Agreement have posted higher percent declines. IEA data, for example, shows Denmark’s emissions fell a whopping 34% between 2000 and 2016, while the United Kingdom and France posted declines of 29% and 20%, respectively.", "Many industrialized nations taking part in the Paris Agreement have no chance of besting the U.S. on this particular bragging right. That’s because most of these nations are small relative to the U.S., and their residents already produce relatively few emissions per capita.", "In some cases, it’s not even possible. In 2000, for example, France’s total emissions couldn’t have dropped by 800 million metric tons because they were only 365 million metric tons to begin with.", "As the IEA report highlights, Trump also omits the fact that CO2 emissions rose in 2018, which the EIA attributed to “weather and continued economic growth.”", "Finally, Trump took credit for expected emissions reductions this and next year. “Emissions are projected to drop in 2019 and 2020,” he said. “We’re doing a very tough job and not everybody knows it, and that’s one of the reasons we’re here today to speak to you.”", "But according to the EIA, those drops are expected because of “milder weather … and, consequently, less energy consumption.” The agency says that even with two back-to-back declines, emissions are not projected to fall below 2017 levels.", "The president also highlighted some recent EPA regulations designed to protect children from lead exposure. The World Health Organization and the Centers for Disease Control and Prevention say there is no safe blood lead level in children.", "Trump, July 8: And for the first time in nearly 30 years, we’re in the process of strengthening national drinking water standards to protect vulnerable children from lead and copper exposure — something that has not been done, and we’re doing it.  And last month, our EPA took the first major action in nearly two decades to reduce exposure to lead-contaminated dust.", "Trump may very well be the first administration in almost three decades to substantially update the lead and copper rule, a 1991 regulation pertaining to drinking water. A proposed rule is expected in July.", "But that doesn’t tell the whole story. According to the EPA, there were revisions to the rule in 2007 “to enhance implementation in the areas of monitoring, treatment, customer awareness, and lead service line replacement.”", "And the Obama administration conducted many of the preliminary actions, including a 2016 white paper outlining potential revisions. The Trump EPA repeatedly has delayed issuing the standards.", "Trump also presents the rule on lead dust as an administrative initiative. But the lead-dust regulation was court-ordered, and health advocates say the resulting standards don’t go far enough.", "The final lead dust rule, which the EPA announced on June 21 and has yet to take effect, lowers the amount of lead dust allowed on floors and window sills in childcare centers and homes built before 1978 — the year the federal government banned lead paint in homes.", "In December 2017, the 9th U.S. Circuit Court of Appeals ordered the agency to review the standards “in light of the obvious need.”", "The lawsuit was filed during the Obama administration. But the Trump EPA fought the petition in June of 2017, and according to the decision, offered “a vague intention to issue a proposed rule in four years and a final rule in six” — a timeline the court considered “unreasonable.” The court gave the EPA 90 days to produce a proposed rule and an additional year to produce a final rule.", "The new rule lowers the hazard levels, making them more stringent. But it kept in place higher clearance levels, or the standards that would have to be met after a lead removal project. This discrepancy has activists concerned that the regulation will fail to keep kids safe, according to E&E News, an energy and environment news site.", "Trump suggested that his administration was responsible for the U.S. placing first in drinking water rankings determined by university researchers.", "“And today, the United States is ranked — listen to this — number one in the world for access to clean drinking water,” Trump said, after mentioning several things he said happened since he was elected or became president.", "The White House told us Trump was referring to the 2018 Environmental Performance Index, which scores countries based on their performances in a number of categories covering environmental health and ecosystem vitality. It is jointly produced by Yale and Columbia universities in collaboration with the World Economic Forum.", "The most recent EPI does show that the U.S. was tops in drinking water along with nine other countries. The drinking water indicator, the report says, is measured “as the proportion of a country’s population exposed to health risks from their access to drinking water, defined by the primary water source used by households and the household water treatment, or the treatment that happens at the point of water collection.”", "But America’s score is not based on anything Trump has done as president.", "The 2018 EPI report — which was published in January 2018 — says the data used for the sanitation and drinking water indicators predates the Trump administration. The EPI’s technical appendix designates 2016 as the year supporting the current scores for the drinking water category.", "Trump repeated his misleading and exaggerated claim that the Green New Deal will “cost our economy nearly $100 trillion.” As we have written, Trump is referring to a nonbinding resolution introduced in the House by Democratic Rep. Alexandria Ocasio-Cortez.", "As a “simple resolution,” Ocasio-Cortez’s measure would not cost anything. The House hasn’t taken up the resolution but, even if it passed, it would not go the Senate or to the president for his signature. It merely recognizes that climate change is a problem and calls for the U.S. to achieve net zero greenhouse gas emissions through a “10-year national mobilization.”", "In addition, the $100 trillion is a high-end, rounded up estimate that comes from a conservative nonprofit policy group and coauthored by John McCain’s chief economic adviser during the 2008 presidential campaign.", "The estimate — which actually ranges from $51 trillion to $93 trillion between 2020 and 2029 — only includes costs, and doesn’t account for economic benefits or other effects. Experts have told us that attempting to put a specific price on the resolution is misleading, since the Green New Deal is so vague.", "The Senate resolution, which was introduced by Sen. Ed Markey, failed to get a single supporter in a procedural vote taken in March.", "In claiming that his administration is “proving” that “a strong economy and a vibrant energy sector” is compatible with “a healthy environment,” the president boasted that the level for particulate matter is “six times lower here than the global average.” The U.S. level is low, but the global average he cites is skewed by high levels of dust in countries located in North Africa and the Middle East.", "Trump, July 8: One of the main [measures] of air pollution — particulate matter — is six times lower here than the global average.  So we hear so much about some countries and what everyone is doing.  We’re six times lower than the average.  That’s a tremendous number.", "The EPA told us that Trump was referring to a World Health Organization’s 2019 global air quality report on fine particulate matter, or PM 2.5, which are particles 2.5 micrometers in diameter and smaller.", "Trump has a point. “The 10 countries with the lowest national PM2.5 exposure levels were the Maldives, the United States, Norway, Estonia, Iceland, Canada, Sweden, New Zealand, Brunei, and Finland. Population-weighted PM2.5 concentrations averaged 8 µg/m3 or less in these countries,” according to the 2019 report, which was based on 2017 data.", "The global average, weighted by population, was 46 micrograms per cubic meter, or ug/m3, which is about six times higher than the U.S. level of 7.4 ug/m3. However, the report also indicates that the global average is skewed by high levels of dust — not industrial pollution — in some countries.", "“The sources responsible for PM2.5 pollution vary within and between countries and regions,” the report said. “Dust from the Sahara Desert contributes to the high particulate matter concentrations in North Africa and the Middle East, as well as to the high concentrations in some countries in western sub-Saharan Africa.”", "The regional average levels were higher than the global averages in North Africa and the Middle East (55 micrograms per cubic meter) and the western sub-Saharan Africa (59 micrograms per cubic meter). That includes countries such as Niger (94 ug/m3), Egypt (87 ug/m3) and Chad (66 ug/m3).", "By contrast, the regional average for Western Europe was just 12 ug/m3, and includes four countries — Finland, Iceland, Norway and Sweden — that had lower levels of PM2.5 pollution than the United States.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]