["The photo was shared more than 2,100 times after it was published on Facebook here on April 19, 2020. The post’s lengthy caption purports to tell “the truth about COVID-19”.", "Below is a screenshot of the misleading post:", "The post, written in a mix of Tagalog and English, reads in part: \"Do you know why there are many dead in other countries and they're mostly the elderly? It's bcoz their governments are practical. They are thinking that if the government gives proper attention and care to seniors or the elderly, at the end the effort will be useless because they are already unproductive, so they are removed from ventilators. In short euthanasia is what they're doing that's why the dead are strewn.\"", "The photo was also shared alongside a similar claim on Facebook here, here, here, here, here and here.", "The claim is false.", "Reverse image and keyword searches found the photo shared in the misleading post was taken from a November 4, 2018 episode of The Walking Dead, which is based on a zombie apocalypse and first aired in 2010.", "The scene was published here on IMDB, a US entertainment online database. It can be seen at the video’s 35-second mark.", "Below is a screenshot comparison of the photo in the misleading posts (L) and the frame in the IMDB video (R):", "The photo also corresponds to the 45-second mark of this Vimeo video, which was published by visual effects company Ingenuity Studios and explains how the strewn bodies were digitally simulated.", "COVID-19, which was first detected in the Chinese city of Wuhan in late 2019, has killed more than 165,000 people worldwide and infected some 2.4 million others as of April 20, 2020, Johns Hopkins University’s database shows.", "As of April 2020, Johns Hopkins University and the World Health Organization list the US, Italy, Spain, France and the United Kingdom among the countries with the highest number of COVID-19 deaths.", "To date, there have been no reliable media or human rights reports claiming that the governments of these countries have adopted a policy of euthanising their elderly COVID-19 patients.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]