["About this rating", "Voting in the 2020 U.S. Election may be over, but the misinformation keeps on ticking. Never stop fact-checking. Follow our post-election coverage here.", "Mail-in ballots have been the subject of criticism from U.S. President Donald Trump’s administration ahead of the November 2020 elections, as more people will use that option to cast their votes due to the COVID-19 pandemic. As the administration argued that it will lead to \"substantially\" more voter fraud — a claim we have debunked — stories about problems with mailing services are going viral on conservative media outlets.", "One particular story covered by Breitbart, Washington Examiner, and Fox News, detailed how three trays of mail, which included mail-in ballots, were found in a ditch by a highway in the state of Wisconsin in late September. Some of the headlines covering this story included: \"Mailed-in Ballots Found Tossed in Wisconsin Ditch,\" \"Trays of mail, including absentee ballots, found in a ditch in Wisconsin,\" and \"U.S. Postal Service Investigating Trays of Mail, Absentee Ballots found in Wisconsin Ditch.\"", "Snopes readers asked us to verify this story, and while we learned that the incident did take place, it's worth noting that many important details remain unknown.", "We learned that three trays of mail were found in a ditch at the intersection of two highways in Greenville, Wisconsin, on the morning of Sept. 21, 2020. We reached out to the Outagamie County Sheriff’s Office, which initially found the trays in the ditch. Lt. Ryan Carpenter, supervisor of the Criminal Investigation Division said: “The mail was supposed to be in transit to the post office. The content of the mail was mixed, but did contain several absentee ballots.”", "Their full statement:", "We do not know if the absentee ballots were completed by voters, or blank ballots on their way to the voters, nor do we know if ballots were predominant among the mail found.", "Meagan Wolfe, the director of the Wisconsin Elections Commission, said during a press conference on Oct. 1, 2020, that no absentee ballots from Wisconsin were found. She did not know, however, if these were ballots from other states.", "When we pressed the Sheriff’s department further about the contents of the absentee ballots, they added that they “did not look at the ballots specifically,” before they handed them over to the Postal Inspector. The U.S. Postal Inspection Service began investigating the circumstances that led to the assortment of mail being found in a ditch. We asked the Postal Inspector's office about the nature of the ballots in the mail, how many were found, and other details about the investigation. They said they were “unable to comment” at this time.", "The Postal Service has been under fire for various problems in the mail-in voting process. During the election primaries conducted over the summer of 2020, more than one million ballots were sent late to voters, running the risk that votes would not be returned to officials in time to be counted. While local election officials were mostly blamed for this inefficiency, the Postal Service was also taken to task. In Wisconsin, thousands of missing or nullified ballots were reported during the state’s primaries in April. In the state alone, hundreds of ballots were left unaccounted for in tubs in Milwaukee, at least 160 ballots were erroneously returned to a local election office, and almost 400 had issues with the postmarks, leading to confusion over whether they could be counted.", "At the same time, the new postmaster general Louis DeJoy, who is also a close ally to Trump, made a number of operational changes, including cost-cutting measures, that coincided with slowdowns in mail deliveries. This led to accusations from Democrats that the Postal Service was deliberately being gutted to impact the election process.", "It is accurate to report that three trays of mail — including several mail-in ballots — were indeed found in a ditch by a highway in Wisconsin and an investigation into the incident is ongoing. We thus rate this claim as “True.”", "Broadwater, Luke.   \"1 Million Primary Ballots Were Mailed Late, Postal Service Watchdog Says.\"\r\n    The New York Times.   1 September 2020.", "Corasaniti, Nick and Stephanie Saul.   \"Inside Wisconsin’s Election Mess: Thousands of Missing or Nullified Ballots.\"\r\n   The New York Times.   9 April 2020.", "Fox 11 News.   \"Mail Found in Ditch Greenville.\"\r\n    23 September 2020.", "Lee, Jessica.   \"Do Mail-In Ballots Increase Risk of Voter Fraud?\"\r\n    Snopes.   26 May 2020.", "Marley, Patrick.   \"Mail Found in Greenville Ditch Did Not Include Any Wisconsin Ballots.\"\r\n   Milwaukee Journal Sentinel.   1 October 2020.", "Olson, Kyle.   \"Mailed-In Ballots Found Tossed in Wisconsin Ditch.\"\r\n    Breitbart.   23 September 2020.", "Ortiz-Lytle, Carly.   \"Trays of Mail, Including Absentee Ballots, Found in a Ditch in Wisconsin.\"\r\n   Washington Examiner.  23 September 2020.", "Perrett, Connor.  \"The Trump Campaign is Waging an All-Out Legal War to Stop the Expansion of Vote-By-Mail in 7 Different States.\"\r\n    Business Insider.  27 September 2020.", "Rambaran, Vandana.   \"U.S. Postal Service Investigating Trays of Mail, Absentee Ballots Found in Wisconsin Ditch.\"\r\n   Fox News.  26 September 2020.", "Nur Nasreen Ibrahim is a reporter with experience working in television, international news coverage, fact checking, and creative writing.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]