["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Brad Schimel, a Republican, is the attorney general for Wisconsin. (Mike De Sisti/Milwaukee Journal Sentinel)", "Thousands of rape kits collected in Wisconsin in recent decades are now scheduled to be tested as officials seek to identify serial rapists or find leads on unsolved crimes.", "Wisconsin Attorney General Brad Schimel has agreed the work needs to be done, but he has repeatedly contested the description in news reports that the untested kits comprise a \"backlog.\" He argues the term unfairly casts his agency in a negative light.", "\"I do disagree with the term backlog because the Wisconsin crime lab is up to date with all current, pending investigations,\" Schimel said April 9, 2017 on Up Front with Mike Gousha. \"It’s not a backlog. These are things no one ever asked the state crime lab to test.\"", "Is Schimel — a Republican who is up for reelection in 2018 — right to claim the untested kits are not a \"backlog\"?", "The background", "Rape kits have accumulated over decades in police evidence rooms and hospital storage areas — both in Wisconsin and nationwide. A July 2015 USA TODAY Network investigation revealed that 70,000 rape kits were untested nationally. In Wisconsin, the figure was about 6,000.", "They include cases where victims choose not to pursue charges, defendants confessed or the issue was consent rather than identity, Schimel said in the Up Front interview.", "But, he said, authorities have realized in recent years the value in going back and testing those cases, since sex offenders typically have more than one victim.", "\"If you test that DNA, you might link that defendant to another unsolved case out there,\" Schimel said. \"So we’ve recognized the need to go back and look at these, but it’s not a backlog.\"", "The state Justice Department determined 3,800 of the untested kits would be tested, though only if the rape survivor consents. But the process hasn’t moved quickly.", "In September 2015, the department received a $4 million grant to begin testing, but it didn’t have the capacity to handle that volume in house. Instead, the private lab Bode Cellmark Forensics was hired to run the tests. The lab can process about 200 kits per month, said department spokesman Johnny Koremenos.", "But it will take about two years to test all the kits, based on figures DOJ provided. About 800 kits have been sent to Bode so far, and the testing process can take as long as six months for a single kit.", "In February 2017, Schimel said \"a few hundred\" kits had been tested, but his office acknowledged days later that only nine had been completed. Koremenos said as of early May the state crime lab had completed testing on 13 kits, and Bode Cellmark had completed 50, though DOJ was awaiting the \"formal results.\"", "Backlogs have been an issue at DOJ before. The crime lab it oversees fell far behind as DNA testing exploded in frequency in the mid-2000s, with 1,800 cases on crime lab shelves awaiting testing in 2007 when Attorney General J.B. Van Hollen took office. He hired 31 additional analysts and declared in 2010 that the backlog had been eliminated.", "Schimel has emphasized the state crime lab has kept up with testing new sexual assault evidence under his watch and rape kits didn’t become viewed as uncompleted work until state authorities shifted their perspective of it recently.", "Schimel disagreeing with himself", "Schimel’s claim that the word \"backlog\" is inaccurate runs into trouble when compared with, well, his own past statements.", "A May 2015 letter from Schimel accompanying a federal grant application referred to \"the state’s backlog of unsubmitted sexual assault kits.\" An identically worded letter seeking a similar grant in April 2016 used the phrase again, though the letter was signed that time by Bonnie Cyganek, a DOJ administrator.", "That word choice is in line with the definitions used by popular dictionaries.", "Oxford says backlog describes \"an accumulation of uncompleted work or matters needing to be dealt with,\" and Merriam-Webster says it is \"an accumulation of tasks unperformed or materials not processed.\"", "Dictionary.com uses the definition of \"a reserve or accumulation, as of stock, work, or business.\" It says the word originally described a large log placed at the back of a fire in the late 1600s and evolved over the next two centuries to figuratively mean \"something stored up for later use.\"", "Now, however, Schimel and his spokesman are saying that word is not appropriate. Koremenos said the term implies DOJ is to blame for the untested rape kits when \"this is not a DOJ shortcoming.\"", "Our rating", "Schimel says it is wrong to describe the untested rape kits as a \"backlog,\" arguing it implies blame on the department under his watch.", "But the definition of the term does not involve how or when a backlog began. The department has decided that the work should be done — a process that began slowly and is on pace to stretch out for up to two years, based on the current capacity and pace. That’s a large accumulation of uncompleted work.", "And that’s the definition of a backlog.", "The fact that Schimel himself previously used the term makes his claim not only wrong but ridiculous.", "We rate Schimel’s claim Pants on Fire.", "USA TODAY NETWORK-Wisconsin reporter Keegan Kyle contributed to this story.", "YouTube.com, Schimel pushing for stronger victims’ rights, April 8, 2017", "Letter, from Wisconsin Attorney General Brad Schimel to the U.S. Bureau of Justice Assistance, May 6, 2015", "Email exchange with Johnny Koremenos, spokesman for Attorney General Brad Schimel, April 17-May 9, 2017", "Associated Press, State Department of Justice preps for big jump in DNA testing, Nov. 24, 2014", "USA TODAY NETWORK-Wisconsin, State has tested only 9 backlogged rape kits, Feb. 2, 2017", "Oxford Dictionary, definition of backlog, accessed May 9, 2017", "Merriam-Webster dictionary, definition of backlog, accessed May 9, 2017", "Dicitonary.com, definition of backlog, accessed May 9, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]