["An image that shows a purported screenshot of an apology on The Australian website over  a report about “a link between the Melbourne COVID-19 oubreak and the Black Lives Matter protest” has been shared multiple times on Facebook. The claim is false; the reporter who bylined the original story refuted the claims on Twitter, calling it “fake”; a keyword search on the newspaper's website also yielded no results.", "The image was published here on Facebook on July 16, 2020.", "The supposed apology by The Australian reads: “Apology Black Lives Matter story, 15 July 2020.", "“Earlier today a number of News Ltd mastheads incorrectly reported that Victorian health authorities had confirmed a link between the Melbourne COVID-19 outbreak and the Black Lives Matter protest. This was incorrect and we are investigating the editorial process leading to the publishing of this story. / We unreservedly apologise.”", "The image refers to this July 15, 2020 article by The Australian, which claims a cluster of COVID-19 cases in Melbourne is linked to Black Lives Matter protests in the area.", "The image appears in other Facebook posts here, here, here, and here.", "However, the claim is false.", "Rachel Baxendale, the reporter who bylined the article, tweeted on July 15, 2020 that no such apology was issued.", "“There is a photoshopped tweet circulating which purports to be an apology from The @australian about this story. The apology is fake. The story was meticulously researched and carefully written and the facts within it have not been disputed by DHHS,” the tweet reads.", "A keyword search for the apology on The Australian website also yielded no results.", "According to this report by The Guardian and this by the media publication Mumbrella, News Limited rebranded to News Corp Australia in June 2013.", "News Corp Australia did not immediately respond to a request for comment.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]