["The photo was published here on Facebook on April 29, 2020. It has been shared more than 100 times.", "The text superimposed at the top and bottom of the image reads: “THIS IS A SUBURBAN STREET IN SYDNEY, AUSTRALIA / HOW DOES THIS IMAGE MAKE YOU FEEL?”", "Below is a screenshot of the misleading post:", "The claim circulated online as the Muslim holy month of Ramadan began in late April 2020 under unprecedented coronavirus lockdowns across the world. AFP reported the developments here on April 24.", "As of April 30, social-distancing restrictions, including the closure of places of worship, were imposed in Australia as part of a government effort to halt the spread of the novel coronavirus.", "Comments from some Facebook users on the misleading post indicated they believed the photo was taken during the lockdown restrictions in Australia.", "One person wrote: \"Where are the police??? Why aren't they handing out multiple $1300 fines here but they harassed other people on the bikes ,in there (sic) cars ,walking in the parks and recreation??????\"", "Another said: \"Friggen (sic) disgusted and ashamed to be an australian!!!! Where are the police issuing the fines??????????\"", "And one Facebook user commented: \"Not a lot of social distancing there.\"", "Below is a screenshot of some of the comments with names redacted:", "The image was previously shared on Twitter here in 2016 with a misleading claim it shows Muslims praying on a US highway.", "Both claims are misleading; the image has circulated in reports since 2013 about Muslims praying in the Australian city of Sydney.", "A Google reverse image search found the same photo published here by ABC Australia on August 8, 2013 alongside the caption: “Muslims pray in the street outside Lakemba mosque in Sydney during the festival of Eid al-Fitr to mark the end of Ramadan.”", "Below is a screenshot of the ABC Australia photo:", "The Australian National Imams Council (ANIC), which represents Imams and Islamic scholars in the country, advised people to continue social distancing during Ramadan in a statement issued on April 20, 2020.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]