["About this rating", "An individual named Marina is referenced in a handful of e-mails in WikiLeaks' Hillary Clinton e-mail archive.", "None of the mentions clearly indicate that \"Marina\" was a maid, or given access to necessarily classified material.", "The identity of the \"Marina\" referenced; whether she had access to classified material in the course of working for Clinton.", "On 6 November 2016, the New York Post published an article reporting that Democratic presidential nominee Hillary Clinton delegated administrative tasks involving classified materials to her maid, Marina Santos:", "In fact, Marina Santos was called on so frequently to receive emails that she may hold the secrets to emailgate — if only the FBI and Congress would subpoena her and the equipment she used.", "Clinton entrusted far more than the care of her DC residence, known as Whitehaven, to Santos. She expected the Filipino immigrant to handle state secrets, further opening the Democratic presidential nominee to criticism that she played fast and loose with national security.", "Clinton would first receive highly sensitive emails from top aides at the State Department and then request that they, in turn, forward the messages and any attached documents to Santos to print out for her at the home.", "The article cited no source material directly, but referenced e-mails between Clinton and aide Huma Abedin:", "“Pls ask Marina to print for me in am,” Clinton emailed top aide Huma Abedin regarding a redacted 2011 message marked sensitive but unclassified.", "In a classified 2012 email dealing with the new president of Malawi, another Clinton aide, Monica Hanley, advised Clinton, “We can ask Marina to print this.”", "“Revisions to the Iran points” was the subject line of a classified April 2012 email to Clinton from Hanley. In it, the text reads, “Marina is trying to print for you.”", "Both classified emails were marked “confidential,” the tier below “secret” or “top secret.”", "A 2012 “sensitive” but unclassified email from Hanley to Clinton refers to a fax the staff wanted Clinton “to see before your Netanyahu mtg. Marina will grab for you.\"", "The timeframe of 2012 suggested that the correspondence appeared before WikiLeaks' DNC leaks and the Podesta e-mails. That left the Clinton e-mail archive, published several months earlier in March 2016.", "Missing from the Post's piece was a lot of information necessary to determine the veracity of the claim. The \"Marina\" referenced in as many as 80 e-mails was identified in the article as Clinton's maid, but we could find no information aside from the article or references to it. Adding \"print\" to the \"Marina\" search led to 16 e-mails, six of which were sent by Clinton and ten of which were sent by others.", "Many of the hits were duplicates of the same request, such as one involving a  call between Clinton and Malawi leader Joyce Banda, which was scheduled to offer condolences on the passing of President Mutharika and congratulate the incoming president.  Aide Monica Hanley (not Clinton) twice referenced \"Marina\":", "The call is confirmed for 730am. Marina will have the call sheet, the bio and action memo for your reference ... [A sheet] did not make it with the pouch but we can ask Marina to print this and her bio for you if a 7:30am call works for both you and President Banda.", "Another of the 16 results for \"Marina\" and \"print\" was marked \"unclassified\" but it referenced a different Marina (Pisklakova-Parker), involved correspondence with media personality Tina Brown (not government business), and Clinton requested a separate person (Jill Iscol) print the e-mail. No part of it involved Clinton's purported maid printing classified material, and the contents of the document seemed an unlikely candidate for classification at any point.", "One heavily redacted e-mail began with a request from Clinton to Abedin for \"Marina to print for me in AM,\" but its contents were not retrievable. It is possible the e-mail is in fact still classified, and that Marina accessed sensitive material, but it is also possible that the document contained unclassified material — despite the e-mail's many redactions.", "Another request initiated by Clinton was a 23 May 2011 e-mail titled \"Fw: Pakistan Media Analysis, Special Saturday Edition, May 28, 2011.\" Although that document was again marked \"unclassified,\" it was not clear whether the material was sensitive or ever classified as of the request made in May 2011.", "Yet another print request involving Marina was related to a 7 October 2012 \"call sheet\" for a phone conversation between Clinton and Republican Congressman and Chair of the House Committee on Oversight and Government Reform Darrell Issa. Although it was also marked \"unclassified,\" it seemed unlikely the material was sensitive or classified.", "A second \"call sheet\" print request had to do with a discussion about Libya, but it was marked \"unclassified\" as of October 2015; the WikiLeaks release occurred in March 2016. Two other mentions of Marina involved her packing of a leather pouch (contents unknown), as well as her availability to provide help of an unspecified nature. Neither of those two hits appeared to have any relation to the printing of documents, classified or otherwise. A separate e-mail from Abedin to Clinton in June 2014 referenced a Filipino lunch, and Abedin asked if Marina could be included.", "An individual named Marina was referenced in 80 Clinton e-mails in total, 16 of which included the word \"print.\" Additional detail about Marina's full name, identity, role in Clinton's circle, or other information was not available or discernible from the context of the e-mails. \"Marina\" was on occasion tasked with printing materials for Clinton, primarily call sheets and ancillary information (such as a biography of the President of Malawi). The nature of some of the requests suggested Marina's duties outstripped those of a maid, but we were unable to locate any firm evidence that Clinton asked her maid (and/or Marina) to print classified or sensitive information.", "Sperry, Paul.   \"Clinton Directed Her Maid To Print Out Classified Materials.\"\r\n    New York Post.   6 November 2016.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]