["The video was published on Facebook on May 27, 2020. It has been viewed more than 10,000 times and shared almost 200 times.", "The three-minute 17-second video shows an empty church with photos placed on the pews.", "Below is a screenshot of the misleading post:", "The post’s Indonesian-language caption translates to English as: “The video below is a story that happened in Italy. When the church reopened, it turned out that almost all of its congregants have died due to COVID…”", "Italy has recorded more than 33,000 deaths and more than 233,000 positive COVID-19 cases as of June 2, 2020, according to this World Health Organization (WHO) tally.", "Churches in Italy reopened on May 18, 2020, after being closed for two months due to the pandemic.", "The video is also shared on Facebook with a similar claim here and here, as well as on YouTube here, here and here.", "The claim is false; the video shows a church in the US state of Mississippi that placed photos of the congregants on pews during an online Easter service in April 2020.", "A reverse image search using a keyframe from the video found it was first posted here on April 12, 2020, on the Facebook page of Salem Baptist Church, in the town of Lake in Mississippi.", "The video’s caption reads: “To our Salem family: we want to share with you the video of us surprising Bro. Larry with all your pictures for the Easter service. It was such a special, moving time. You can tell by this video how much he loves you all.", "“This video is exclusively managed by T&T Creative Media. For licensing / permission to use please contact licensing@tt-creative.com”.", "T&T Creative Media also published the video on its YouTube channel here on April 26, 2020, with a more detailed caption explaining the context of the video.", "The caption reads in part: “A beloved reverend was brought to tears when his absent congregation surprised him by thoughtfully leaving photos of themselves on their seats. With mass gatherings cancelled in the state of Mississippi, Reverend Larry Duncan was facing the sad prospect of not having anyone at his weekend service, at Salem Baptist Church, in Lake. But as he walked into the church, on April 11, Larry was met with a beautiful sight. In front of him he found 98 different photographs each depicting the face of a regular attendee.”", "Below is a screenshot comparison of the video in the misleading post (L) and the genuine video on the church’s Facebook page (R):", "The church also posted the video on its YouTube channel here on April 13, 2020.", "The church also posted a photo of the same event here on April 12, 2020.", "The display of the congregants’ photos at the church was reported here by Christian online news outlet Faithwire.com on April 14, 2020.", "The church’s online Easter service was posted here on April 12, 2020.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]