["A set of video clips showing massive waves lashing the coast has been shared on social media with the claim that the visuals represent the Marine Lines area in Mumbai. The videos have been uploaded and shared by Facebook users, and range from 12 to 18 seconds. One clip shows water splashing through the shoreline, as the people on the coast take pictures and videos. Another clip shows a person swept away by the furious tide. Yet another shows the gushing water dislodging cars on the road.", "Last night, marine lines. Mumbai", "Posted by Usha Maurya on Saturday, November 2, 2019", "The videos have also been posted on Twitter.", "Last night marine lines #Mumbai #rain #sea #nature #GlobalWarming #GlobalClimateStrike #GretaThunberg #India #danger pic.twitter.com/0nw1rgfjwW", "— BUNTYBABATV (@buntygw) November 3, 2019", "Alt News found that the video clips circulated on social media are recent, but do not pertain to Marine Lines, Mumbai. In fact, the video is not from India but from Oman.", "Alt News spotted a signboard in one of the video clips which said, ‘Al Bahri Road’.", "We then Googled ‘Al Bahri road’. According to the search result, this road is in Muscat, Oman – a fancy promenade in the capital city, not unlike the Marine Drive of Mumbai.", "Using the keywords ‘Al Bahri road’ on YouTube, Alt News found a five-minute-long video posted on October 30, 2019, titled, ‘Latest Kyarr Cyclone II Mathra Corniche Cyclone 2019 II Muscat/Oman’. This video contains the footage which has been shared on social media in the form of short clips. It is from a place on Al Bahri road called ‘Mutrah Corniche’, a seaward extension of the shore.", "It may be recalled that cyclone Kyarr had formed over the Arabian sea region in October 2019, bringing a mild storm surge and rainfall to the coastal regions of Oman. The cyclone system had subsequently weakened and ceased to be a threat. Alt News also found these video clips posted on social media by West Asian news networks.", "#إعصار_كيار بسواحل مطرح #عمان pic.twitter.com/neGkX1AzGH", "— الدروازة نيوز | Derwaza News (@DerwazaNews) October 29, 2019", "Video clips from Muscat, Oman depicting huge tidal waves lashing the coast, were shared on social media as marine lines in Mumbai. The story was earlier fact-checked by Boom.", "Donate Now", "Arjun Sidharth is a writer with Alt News. He has previously worked in the television news industry, where he managed news bulletins and breaking news scenarios, apart from scripting numerous prime time television stories. He has also been actively involved with various freelance projects. Sidharth has studied economics, political science, international relations and journalism. He has a keen interest in books, movies, music, sports, politics, foreign policy, history and economics. His hobbies include reading, watching movies and indoor gaming.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]