["About this rating", "A man was arrested in Japan in 1959 for using a false passport he created, one supposedly issued by a nonexistent country.", "The man did not hail from another dimension, he was prosecuted and sentenced by Japanese authorities, and he did not mysteriously vanish from a guarded hotel room.", "Common classes of paranormal tales are accounts of persons who have mysteriously appeared (e.g., from the past, the future, other worlds, other dimensions) and those who have mysteriously vanished (to no one knows where).  One example of this genre that has proved popular over the last few decades. the \"Mystery of the Man from Taured,\" involves both of these elements:", "The report of the man \"from a parallel universe\" who inexplicably showed up at a Tokyo airport in 1954 bearing a passport from the nonexistent country of \"Taured\" and then just as bafflingly disappeared from police custody is typically related in a number of mostly similar variant forms, such as the following account of the supposed mystery man from Taured:", "It’s July 1954; a hot day. A man arrives at Tokyo airport in Japan. He’s of Caucasian appearance and conventional-looking. But the officials are suspicious. On checking his passport, they see that he hails from a country called Taured. The passport looked genuine, except for the fact that there is no such country as Taured – well, at least in our dimension.", "The man is interrogated, and asked to point out where his country supposedly exists on a map.", "He immediately points his finger towards the Principality of Andorra, but becomes angry and confused. He’s never heard of Andorra, and can’t understand why his homeland of Taured isn’t there. According to him it should have been, for it had existed for more than 1,000 years!", "Customs officials found him in possession of money from several different European currencies. His passport had been stamped by many airports around the globe, including previous visits to Tokyo.", "Baffled, they took him to a local hotel and placed him in a room with two guards outside until they could get to the bottom of the mystery. The company he claimed to work for had no knowledge of him, although he had copious amounts of documentation to prove his point.", "The hotel he claimed to have a reservation for had never heard of him either. The company officials in Tokyo he was there to do business with? Yup, you’ve guessed it – they just shook their heads too. Later, when the hotel room he was held in was opened, the man had disappeared. The police established that he could not have escaped out of the window – the room was several floors up, and there was no balcony.", "He was never seen again, and the mystery was never solved.", "This story seems to be one that was inspired by a real-life incident, but its modern form is a greatly embellished and fantastical version of the far less sensational real story.", "A debate in the British House of Commons on July 29, 1960, on the subject of frontier formalities (i.e., the administrative process by which a person enters the territory of another country) included mention of a man named John Alan Zegrus, who was then being prosecuted in Japan for using a false passport:", "My hon. Friend may know the case of John Alan Zegrus, who is at present being prosecuted in Tokyo. In evidence, he describes himself as an intelligence agent for Colonel Nasser and a naturalized Ethiopian. This man, according to the evidence, has travelled all over the world with a very impressive looking passport indeed. It is written in a language unknown and it has remained un-identified although it has been studied for a long time by philologists.", "The passport is stated to have been issued in Tamanrosset, the capital of the independent sovereign State of Tuarid. Neither the country nor the language can be identified, although a great deal of time has been spent in the attempt. When the accused was cross-examined he said that it was a state of 2 million population somewhere south of the Sahara. This man has been round the world on this passport without hindrance, a passport which as far as we know is written in the invented language of an invented country. I would stress, therefore, that passports are not very good security checks.", "As unusual as this account may seem in our modern security-conscious era -- that a man had been successful in moving about the world using a fabricated passport issued by a made-up country and bearing writing in a nonsensical language -- it was borne out by contemporaneous reporting, such as the following August 1960 newspaper article:", "Everyone who has run into officialdom to his cost and wondered at the ridiculous questions asked of tourists will have sympathy for a man sonorously named John Allen Kuchar Zegrus.", "Mr. Zegrus wanted to travel round the world. To impress officials, he invented a nation, a capital, a people and a language. All these he recorded on a passport which he made himself. Victims of bureaucracy all over the universe will be delighted to hear that he was wonderfully received everywhere -- well, almost everywhere.", "John claimed to be a “naturalized Ethiopian and an intelligence agent for Colonel Nasser.” The passport was stamped as issued at Tamanrasset, the capital of Tuared “south of the Sahara.” Any places so romantically named ought to exist, but they don’t. John Allen Kuchar Zegrus invented them.", "Armed with this wonderful document, Mr. Zegrus travelled royally through the Middle East, accepting homage as he went. And if there were any doubters, they were invited to read a kind of proclamation beneath the national Tuared stamp. It read: \"Rch ubwaii ochtra negussi habessi trwap turapa.\" That was the clincher, but didn’t mean anything in any language.", "The gallant gesture for the individualist, unfortunately, ended with the Japanese in Tokyo. They began looking up maps. John Allen is in court, a martyr to Japanese thoroughness.", "His action takes precedence, we think, over the American citizen who flew his own plane round the world wearing his own uniform, receiving homage from all and sundry. But the more we ponder on Mr. Zegrus, the more we wish there were really a capital called Tamanrasset, in the delectable county of Tuared south of the Sahara, with a language like the one Zegrus invented. All its citizens would be blessed with John Allen’s sterling attitude towards collectors of useless information.", "A summary of a Japanese radio broadcast from December 1961 suggested that Zegrus had not only been making use of a phony passport, but he had also been passing bad checks and claiming to be an agent of both the FBI and CIA:", "The Tokyo District Court 22 December [1961] sentenced John Allen K. Zegrus, a man without nationality, to one year imprisonment for having illegally entered Japan and passing phony checks. Zegrus, self-styled American who has professedly acted as an agent for the U.S. Federal Bureau of Investigation and the Central Intelligence Agency, entered this country in 1959 on a bogus passport.", "A user with the screen name of taraiochi located and posted some Japanese newspaper articles from 1960-61 about the mystery man from Taured, who had entered Japan from Taiwan along with his Korean wife using an obviously fake passport and was arrested after cashing forged checks to cover the cost of his stay there:", "Yomiuri Shimbun\n10 August 1960", "The \"Mystery Man\" Who Tried to Smuggle Himself Into the Country", "Attempted suicide immediately after sentencing", "Fictitious nationality, fluent in 14 languages", "A mysterious foreigner of unknown nationality and background, accused of illegal entry and fraud, tried to commit suicide in front of the judge who handed down his verdict at the Tokyo District Court on April 10. The defendant, John Allen K. Zegrus (36), was sentenced by Judge Yamagishi to one year of imprisonment at his sentencing hearing in Tokyo District Court, but when the interpreter informed him of his sentence, the defendant suddenly stood up and slashed his arms with pieces of a broken glass bottle that he had hidden in his mouth. As Ziegler shouted \"I'm going to kill myself,\" three guards rushed to restrain him, and he was taken by ambulance to Kyobashi Hospital.", "Zegrus and his Korean wife entered Haneda Airport from Taipei using a forged passport on October 24 last year, but by December he was having trouble paying for his stay and cashed about ¥200,000 worth of counterfeit checks at Tokyo banks.  The forged passport Zegrus used to enter the country was handmade, and the name of the country it bore, Negusi Habesi Ghouloulouloul Esprit, was completely fictitious. The nature of the text on the passport was also unclear, defying attempts of a linguistic specialist to identify the language it was written in.", "The defendant, said to be fluent in 14 languages, told investigators that he had come to Japan on orders from an Arab-related organization and was working for a U.S. intelligence agency, but these claims were not true. The district prosecutor was hampered by the fact that the true identity and nationality of the defendant was unknown, and this mystery was not cleared up at trial.", "The passport Zegrus used was the size of a weekly magazine and was recognizable at a glance as a fake, but nonetheless the Japanese Embassy in Taipei had issued him a visa on October 17 last year, and this was the first time the defendant had entered Japan using that passport.", "The defendant's wife, 30, entered the country with him and was repatriated to South Korea on her own passport.", "Additional articles suggested Zegrus was eventually released on time served and left Japan vowing to embark upon a \"new life in a new country,\" the enigma of who he really was and where he came from unresolved (and his ultimate fate unknown).", "Over the years, this instance of an unusual but explicable fraudster -- whose story did not require the existence of additional dimensions or defy our understanding of time and space -- came to be adorned with additional contrived details (e.g., the subject's agitation over not being able to locate on a modern map a country that \"had existed for more than 1,000 years\" where Andorra is now; his unfathomable disappearance from a guarded hotel room) that transformed it from a real-life criminal immigration/fraud case into a fictional tale of a mysteriously vanished visitor from another dimension.", "Although variations in orthography and spelling in different accounts of Zegrus' exploits make matters even more confusing, we note that Tamanrasset is the name of a province and city in Algeria, and Tuareg is the name of a group of people and languages in and around the country of Algeria, it's possible Zegrus hailed from (or claimed to hail from) that region of the world.  Regardless of his precise origins, the \"mystery man from Taured\" was definitely neither an extraterrestrial nor an interdimensional, time-traveling being.", "David Mikkelson founded the site now known as snopes.com back in 1994 as a creative outgrowth of his wide-ranging interests in a variety of subjects (particularly folklo ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]