["Two videos have recently gone viral on social media. In the first, a man is seen physically abusing a girl. A user named Uma Shankar Rajput shared the clip, writing, “Shut down these madrasas which have become the dens of obscenity. Those who always offer commentary about saints are requested to speak up about this as well.” The tweet was liked 2,400 times at the time of writing. While the accompanying claim does not explicitly state where the incident took place, several believe it to be from India. Rajput, in fact, talked about the Muslim community in India after his tweet carrying the video.", "(Note: This article does not carry links to the video to preserve the girl’s identity.)", "The video has also spread to Facebook, where it has received thousands of views.", "Another video has been shared where a woman slaps an elderly Muslim man and asks him to apologise. She alleges that the man was touching her inappropriately. He can also be heard apologising later on.", "मदरसा वाले मौलवी ने चलती बस में की छेड़खानी! लड़की ने मारा जोर का थप्पड़ और माफी मंगवाई साहसी बहिन को प्रणाम pic.twitter.com/0ps0bjn0yD", "— Om Prakash Rawat (@OmPraka43229608) October 21, 2020", "This video has also made its way to Facebook. “The maulvi of a madrasa molested a girl in a moving bus! The girl gave him a tight slap and asked him to apologise,” reads the accompanying message.", "Same as earlier, those sharing the video have not clarified where the incident occurred.", "This video was revived in October 2021.", "🖕🖕🖕 इन पक्के ईमान वाले हाजी मियां ने अगली सीट पर बैठी महिला से पिछली सीट से छेड़खानी करने का प्रयास किया।लेकिन बहादुर महिला ने उल्टे इनकी ठुकाई कर दी। सच में देश में हिंदू असहिष्णुता बढ़ती ही जा रही है। बेचारी कौम बहुत ही डर गई है। 😂😂😂😂😂😂", "Posted by Kashmiri Pundit on Thursday, 7 October 2021", "This report will verify both clips separately.", "First video", "Alt News performed a reverse image using a frame from this video and came across some posts from 2018. One of these contained screenshots of the incident, where it was said that this happened in Pakistan.", "Using this information we discovered some reports by Pakistani media. A report by Geo TV dated October 10, 2018 stated that a teacher had been arrested for sexually abusing and making videos of a student in a school in Jhang, Pakistan. The report also included tweets by Pakistan’s Federal Minister for Human Rights, Shireen Mazari. These tweets provide information about the incident and the teacher’s arrest. The accused has been identified as Anwar-ul-Qamar. The incident was also covered by The Express Tribune in an article dated October 19, 2018. This article too identifies the accused as Anwar-ul-Qamar who used to teach the Quran in mosques.", "DPO Jhang has forwarded the above information. The accused Name Anwar ul Haq has been arrested by Jhang Police. The incident happend in Toba Tek Singh. Anwar has confessed his crime. The Jhang police will now hand him over to TT Singh police for registration of FIR. https://t.co/2pvv68sDg4", "— Shireen Mazari (@ShireenMazari1) October 9, 2018", "An incident of a student sexually abused in Pakistan is circulating on Indian social media with many assuming it’s from India.", "Second video", "To investigate this video, we searched the keywords “woman harassed in a bus moulvi” and found a report in Pakistan Today dated September 27, 2019. It stated, “A video of a woman slapping a man who sexually harassed her on a bus from Multan to Islamabad went viral on Thursday, with the majority of the public lauding her for the action she took.” The report mentioned that the clip was uploaded on Facebook by the woman’s friend, Zahra Nain. According to the Facebook post, the woman’s back was numb due to frequent travel, and she did not immediately realise that someone was touching her. When the culprit tried to remove her dupatta from her back, she figured what was happening. It also said that the old man, instead of apologising for his mistake, was repeatedly requesting the woman to delete the video. The Facebook post included in the article has since been deleted. However, we found a few Facebook posts from 2019 carrying the video, which mention the related incident.", "On September 26, 2019, The Express Tribune also published a report on the viral video.", "Therefore, this video also does not depict an incident from India. A few days ago, an image from Bangladesh was falsely circulated as a madrasa in India.", "Donate Now", "Priyanka Jha specialises in monitoring and researching mis/disinformation at Alt News. She also manages the Alt News Hindi portal.", "A purported video of a Muslim man beating a temple priest with a bat is…", "A picture depicting the Pakistani flag apparently bigger in size and apparently placed higher than…", "Amid the ongoing war between Israel and Hamas, a video of a fleet of cars…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "A clip featuring Pakistan men’s Cricket team captain Babar Azam is viral on social media…"]