["About this rating", "A Tulsa-based businessman running for governor of Oklahoma was the center of controversy in May 2018, when posts appeared on his campaign's Facebook page in which he appeared to call for disabled people in receipt of government benefits to be euthanized or left to \"starve and die.\"", "Christopher Barnett, who runs several small businesses in Oklahoma and is running as a Republican on platform of free speech and cuts to public spending, has claimed that his account was hacked and denies personally writing the posts. On 13 May 2018, a Facebook user posted a series of screenshots of posts from the \"Chrisforgov\" Facebook page, which has since been suspended:", "In one post, Barnett's account posted a poll which asked: \"Should a person be required to apply for 2 jobs a week if receiving Food stamps and take any job offered to them to gain employment and if they refuse, they lose their food stamps?\"", "In another post, someone wrote: \"The ones who are disabled and can't work ... why are we required to keep them up? Sorry but euthanasia is cheaper and doesn't make everyone a slave to the government.\"", "In a third post, written in response to another user's comment (which isn't shown) the following was posted from Barnett's account:", "...I firmly believe we should have assisted suicide in the US. I also ask the legitimate question of why should we have to keep up people who cannot contribute to society any longer? Obviously, I'm not saying the Government should put these people down, I'm just saying that we shouldn't keep them up. If they can take care of themselves without Government assistance, great. If not, let them starve and die. Easy as that.", "Yet another post, captured by the Oklahoma City television station KFOR, proclaimed:", "As the next Mayor of Oklahoma, I'm going to enact a mandatory nationwide lottery that euthanizes 1 out of every 100 people in the world. This will be the only Government program that is truly 100% equal to everybody. The lottery will take place once every year. On the years the lottery doesn't take place, we will have a purge where all crimes will be legal for 12 hours.", "In an e-mail, Barnett denied ever having written any of these posts:", "Our Facebook page was recently compromised, we have been the victims of some very sick people.  There is no truth to me running for \"Mayor of Oklahoma\" as there is no such thing. I have never advocated for killing anyone, despite what has been put out there.  I do not want to euthanize poor people, sick people, or people on Government assistance.", "Christopher's husband, George Barnett (also known as Trey), was an administrator of the campaign page and reportedly had his personal Facebook accounts suspended as well.", "In a statement posted on his campaign web site, Chris Barnett wrote that he had received \"thousands of death threats\" in the days after the screenshots were posted. He told us he and his husband had hired a \"24/7 security detail\" to keep them safe and had placed \"armed guards\" outside their businesses as well.", "In response to our questions, Barnett told us he does not support involuntary euthanasia in any circumstances, but he does support assisted suicide (due to the experience of \"watching [his] father die from cancer\"), and does believe governments have a duty to prevent the deaths of people who are disabled, cannot work, or cannot pay for food.", "Barnett also told us he had reported the alleged hacking of his account to both Facebook and law enforcement. When asked which agency he reported the hacking to, he replied, \"Our security team is handling that.\" He also said he had reported the alleged death threats to law enforcement but again did not specify which agency.", "Without evidence of a hack, or proof that Barnett personally wrote the statements published on his campaign page, we cannot determine what was the true source of the controversial posts.", "Barnett is clear about whom he suspects to be responsible for the alleged hacking of his Facebook account, as well as most of the purported death threats. In an e-mail, he told us: \"This was a very well played move by someone, likely from the University of Tulsa or the law firm of Hall Estill...\"", "Representatives for both the university and the law firm told us they were unable to respond to any of Barnett's allegations due to ongoing litigation. We asked Barnett to provide proof of the death threats and evidence to support his claim that they had \"mostly\" come from the University of Tulsa and the Tulsa-based law firm Hall Estill, as well as his claim that \"Democrats have promised to assassinate [him] if [he] is elected.\"", "Barnett told us \"this is a security matter that we cannot discuss,\" but added that he hoped to be able to publish evidence of the purported threats at a later date. Barnett is suing both the University of Tulsa and Hall Estill in federal court as part of a messy, years-long legal saga which began with a production of The Glass Menagerie, a delayed dinner date, and — somewhat fittingly — a series of Facebook posts.", "'Christopher Blackstone'", "Trey Barnett was a theatre major at the University of Tulsa in September 2014, and he was a lighting designer on a production of the classic Tennessee Williams play The Glass Menagerie. On the night of 27 September, he accompanied faculty and fellow students to the on-campus theater to continue work on the production, which was scheduled to open two weeks later.", "Some students arrived late, however, which delayed the start of their work and ultimately caused Trey Barnett to be late in meeting Christopher Mangum (then his fiancé) for dinner, Senior Vice Provost Winona Tanaka would later recount. (To avoid confusion, we're going to refer to Christopher Barnett using his maiden name for the remainder of the article, even though the couple were married in December 2014.)", "That night, Mangum vented his frustration in a post on Barnett's Facebook page, criticizing the chair of the theatre department for not taking \"better control\" of her students, denouncing one theatre professor as \"unqualified,\" and musing that \"TU really needs to fire\" her, as well as attacking a theatre student for being \"morbidly obese\" and \"giving alcohol to underage minors.\"", "This wasn't the first time that Mangum had posted scathing criticisms of the University of Tulsa's theatre program on social media.", "In March 2014, under the pseudonym \"Christopher Blackstone,\" he accused a second theatre professor of being \"corrupt\" and having an affair while she was on a theatre trip to Ireland with Barnett, seven other students, and Mangum himself. The following month, he once again posted to his fiancé's Facebook page, accusing the theatre department of being \"quite careless and extremely disorganized\" in its supervision of a class project involving painting the walls of an off-campus building.", "These postings came to a head in September when figures within the theatre program filed complaints against Trey Barnett. The following month university officials decided Barnett had breached the school's harassment policy by not removing his fiancé's posts from his Facebook page, despite repeated requests.", "The University of Tulsa suspended Trey Barnett until January 2016, by which time the student who was the target of some of Mangum's attacks was expected to graduate. Barnett was also barred from finishing his theatre degree, which he was close to completing, meaning that if he did return to the university in 2016 he would have to effectively start his studies from scratch with a new major.", "The suspension garnered coverage from Inside Higher Ed and drew condemnation from the Foundation for Individual Rights in Education (FIRE), who wrote: \"Punishing someone for the speech of a friend or relative might be par for the course in a dictatorship, but it has no place on our nation’s college campuses.\"", "In January 2016, Barnett filed a lawsuit against the school in Tulsa County District Court, alleging breach of contract, a violation of his right to due process, negligence (for allegedly failing to conduct a proper investigation) and intentional infliction of emotional distress. He is demanding more than $75,000 in damages in a case which was still before the court as of May 2018. The university has denied almost every factual claim made by Barnett. The school is represented in that case by the law firm Hall Estill.", "'The Lies of Susan'", "At the same time, the couple were engaged in a separate battle with another local educational institution — Tulsa Community College (TCC). In early 2015, a few months after Trey Barnett's suspension from the University of Tulsa, Mangum contacted TCC with a request to rent its theater for a play called \"The Lies of Susan,\" which Barnett was going to put on.", "This appears to have set off red flags among TCC and University of Tulsa faculty, according to e-mails released later. The head of the university's theatre department, whose complaint about Barnett paved the way for his suspension, is named Susan Barrett. Her husband, Bill Carter, works in the theatre department at TCC.", "\"Wow, now you are 'art,'\" a University of Tulsa colleague wrote to Barnett in July 2015. In an email sent to us, Mangum acknowledged that his husband's former department head was \"going to be the inspiration for the main character.\"", "The couple never got the space, and the play was never performed, but the story did not end there. In July 2015, Mangum filed an open records request with TCC, asking for any and all email correspondence between TCC faculty member Bill Carter and his wife, University of Tulsa professor Susan Barrett.", "The college sent him some emails, but not all of them, withholding messages of a personal or private nature. From there, Mangum's requests mushroomed.", "He asked the college for a copy of any contract it had with a local attorney; consistently disputed the search fees charged to him; and requested all emails held on TCC's servers containing the words \"nigger,\" \"terrorist,\" \"queer,\" \"fag\" and \"fagot\" [sic], in order to \"see if discrimination and racism\" were taking place at the college.", "When Mangum found out that the woman in charge of records requests at TCC also worked for the city's water and sewage authority, he then filed a records request with the city of Tulsa, asking for all emails sent to or from her email address, later noting that they would \"answer more of [his] questions about the city's drinking water.\"", "In July 2017, two years after his first open records request, Mangum sued TCC, asking Tulsa County District Court for a declaration that TCC's policy on records requests was a violation of the Oklahoma Open Records Act, as well as an injunction ordering the college to end its allegedly narrow interpretation of the law. As of May 2018, that case was also pending.", "\"This does NOT make me feel safe\"", "On 4 January 2018, the lawsuit took a dramatic turn — one which would spawn yet another legal battle, provoke troubling questions about Mangum's behavior, and prompt a sharp escalation in his allegations against the University of Tulsa and attorneys at Hall Estill.", "That morning, Mangum was taken out of court by Sheriff's deputies and detained for a short period, before being released and returned to the courtroom. In transcripts, Oklahoma Assistant Attorney General Jeb Joseph, who is representing TCC in the open records case, explained that his office had received information about possible \"threats\" made by Mangum:", "Agents from our office at the Attorney General's office had communications this morning, it's my understanding, with the sheriff's office here in Tulsa...We have — the Attorney General's office — been informed by counsel in another case, that is tangentially related to this one, involving the same or similar plaintiffs, that in that case, the plaintiff has made physical and verbal and written threats to counsel in that case,...and/or people involved in that litigation.", "We asked Mangum whether this was true, or if he had ever said or done anything, even as a joke, which could have been interpreted as a threat. He responded, \"No.\" We could find no record of him ever having been prosecuted for making threats or engaging in intimidation or harassment.", "However, court records and e-mails sent between members of the Tulsa theatre community reveal a pattern of behavior that some of Mangum's legal adversaries clearly found concerning.", "During Trey Barnett's litigation against the University of Tulsa, Mangum started a web site called UniversityofTulsaLawsuit.com, which he promoted by sending thousands of leaflets to local residents, and even taking out billboard advertisements bearing the web site's name. In September 2017, he told local news web site Tulsa World that the billboards were costing him $7,500 a month.", "On the web site, Mangum posted documents from the couple's ongoing lawsuits, but also launched relentless personal attacks on almost everyone involved in each case. He called University of Tulsa administrators and attorneys from their law firm Hall Estill \"Nazis\" and \"racists,\" claiming they were members of the Ku Klux Klan and \"hate gay people.\"", "\"I think that these people are worse than Adolf Hitler,\" Mangum wrote of Hall Estill attorneys. In a series of bizarre postings, he lashed out at the appearance and even personal hygiene of his legal adversaries, calling one University of Tulsa professor a \"cat lady\" whose \"house smelled of cat urine and feces,\" and labelling one attorney at Hall Estill \"morbidly obese,\" writing that \"the man smelled like big macs during the court hearing.\"", "Mangum took to posting the home addresses and names of relatives of Hall Estill attorneys, as well as figures from the University of Tulsa and TCC. He took photos of opposing attorneys from inside the courtroom and posted them online, in one instance posting a photograph of a Hall Estill attorney and a woman Mangum identified as his wife.", "He made deeply personal comments and allegations about the purported criminal history of one attorney's wife and daughter. In one instance, he even posted about the death of that attorney's son, writing that \"karma is a bitch,\" and \"he is dead because of you.\"", "In an email sent in response to our enquiries, Mangum defended these postings, saying \"it shows how ridiculous it sounds to make someone responsible for something they have no control over,\" and likened this to Barnett's suspension from the University of Tulsa over comments Mangum had made. He told us he posted this type of content because he is \"defending [himself] against their attacks and trying to bring the truth to light.\"", "\"People choose to read my website and they choose to get upset because they do not like the content. I've not done anything illegal,\" he added.", "Mangum told us he posted various home addresses as a \"demonstration of how transparency works,\" and defended his repeated descriptions of his adversaries as \"Nazis\" and \"little Hitlers,\" saying: \"To take away someone’s rights and try to take away their livelihood because of who they are is exactly what the Nazis did.\"", "Mangum is an avowed gun lover and owns several firearms. In the midst of several bitter legal disputes, some of his public pronouncements on that subject have clearly caused concern to those he and his husband are suing. In April 2015, while engaged in a dispute over renting theatre space from TCC, he mused on Facebook about his desire to purchase an AR-15 semi-automatic rifle, and buy a safe for all his guns. \"Does that make me a terrorist or a radical or a threat to society?\" he asked, adding that he was looking for \"something powerful.\"", "A few months later, a University of Tulsa theatre professor highlighted the Facebook posts in an e-mail to department chair Susan Barrett, which was later disclosed under Mangum's open records requests. The professor said she was \"concerned\" by them, writing, \"While there was no explicit threat, this does NOT make me feel safe,\" and adding: \"I don't think [the University of Tulsa] will do a thing until Chris comes in with that big gun and mows us all down.\"", "In February 2015, the same professor asked Barrett for a security guard to be assigned to the theatre building, citing her concerns about Mangum.", "On UniversityofTulsaLawsuit.com, Mangum later posted a photograph of himself holding an AR-15 rifle and carrying a holstered handgun:", "When asked why he had posted a photograph of himself holding firearms on a web site devoted to a lawsuit that had no connection to gun rights, Mangum told us he was only using the picture \"to show who the author [of the posts] is\" and that others had \"put meaning behind it.\"", "Although Mangum was only briefly taken out of court for questioning by a sheriff's deputy in January 2018, he saw the episode as proof of a conspiracy between the University of Tulsa, Hall Estill, the Oklahoma Attorney General's office, and the Tulsa County Sheriff's office to silence and intimidate him in the context of the ongoing litigation. The next day, he filed yet another lawsuit, this time accusing the university, the law firm, and two particular attorneys of unlawful seizure, false imprisonment, civil conspiracy and other charges relating to the January courtroom incident.", "The case was sent to federal court in February, where both the university and the law firm have rejected almost every factual claim made by Mangum, and argued for his suit to be thrown out. As of May 2018, the case is still before the U.S. District Court for the northern district of Oklahoma.", "The \"false imprisonment\" lawsuit marked a striking escalation in the couple's contentious history with the University of Tulsa and its law firm, Hall Estill. In May 2018, those allegations reached a new peak of seriousness when Mangum accused them of hacking into his gubernatorial campaign Facebook page, posting inflammatory comments on his behalf, and then sending him hundreds of death threats.", "The Republican primary in the Oklahoma gubernatorial election is scheduled for 26 June 2018. Mangum is unlikely to feature among the contenders in a ten-way race which — as of May — was led by Lieutenant Governor Todd Lamb, former Oklahoma City Mayor Mick Cornett, and businessman Kevin Stitt.", "Stewart, Sarah.  \"Gubernatorial Candidate Says He's Received Death Threats Over Social Media Comments He Didn't Make.\"\r\n  KFOR-TV.  15 May 2018.", "Tanaka, Winona.  \"Memorandum Decision -- Barret v. Barnett Harassment Case.\"\r\n  University of Tulsa via the Foundation for Individual Rights in Education.  24 October 2014.", "New, Jake.  \"Suspended for Spouse's Statements?\"\r\n  Inside Higher Ed.  13 February 2015.", "Perrino, Nico.  \"U. of Tulsa Suspends Student for Someone Else's Facebook Post.\"\r\n  Foundation for Individual Rights in Education.  12 February 2015.", "Barnett, George W.  \"Petition -- Barnett v. the University of Tulsa.\"\r\n  Tulsa County District Court (Oklahoma.)  13 January 2016.", "Barnett, Christopher.  \"Petition -- Barnett v. Tulsa Community College.\"\r\n  Tulsa County District Court (Oklahoma.)  7 July 2017.", "Vicent, Samantha.  \"Couple With Lawsuit Against TU Using Billboards, Postcards to Spread Message About the Case.\"\r\n  Tulsa World.  16 September 2017.", "Barnett, Christopher.  \"Petition -- Barnett v. Hall Estill et al.\"\r\n  Tulsa County District Court (Oklahoma.)  5 January 2018.", "Casteel, Chris.  \"Poll Shows Three-way Tie in GOP Gubernatorial Primary.\"\r\n  NewsOK.com.  25 April 2018.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]