["Multiple Facebook posts published in the last 12 months, for example, this one which has been shared more than 3,500 times since it was posted July 23, 2018, contain the misleading image.", "\"Information issued in the interest of women,\" says that post’s Hindi-language caption says, translated to English.", "Below is a screenshot of the misleading post:", "The image contains two pictures – one of a woman holding her hand out apparently in fear and another of Indian Prime Minister Narendra Modi – alongside text in Hindi which translates as:", "“Very important information: Issued in the interest of women traveling alone during the night.\"", "“Whenever you travel alone during the night in an auto or taxi then send an SMS of the vehicle registration number to this number 9969777888.", "\"You will immediately receive an acknowledgment that your vehicle is under GPRS observation, thanks. Share this message as much as possible, who knows who the next victim could be. Very important.”", "The mobile number 9969777888 is an Indian phone number registered in Mumbai city in the western state of Maharashtra, according to this tracking website.", "According to this dictionary definition, GPRS stands for General Packet Radio Service, which is “a telecommunications system providing very fast internet connections for mobile phones”.", "Mumbai Police did launch a helpline service for women in the city using the same number in 2014; however, it was closed three years later and is not currently in service.", "The Mumbai scheme was called “Travel Safe When Alone” and was launched on March 8, 2014, as reported by major Indian newspapers at the time, for example, the Times of India here and the Indian Express here.", "Below is a screenshot of the Indian Express report:", "The phone number stated in both the Times of India and Indian Express reports is the same given in the misleading post.", "Mumbai Police discontinued the service in 2017 due to low rates of usage, according to this news report published on the website of local newspaper Mid Day on March 2, 2017.", "Mumbai Police spokesperson SP Manjunath Singe confirmed to AFP that the helpline is not currently in use.", "“The helpline is not active and has been stopped,” he told AFP in a phone call on June 14, 2019.", "Similar misleading messages are circulating across social media claiming the service has been launched by police services in different Indian cities.", "Those messages have been termed fake by Bengaluru City police here on their official Twitter account on June 1, 2018 and here by the Delhi Police on their official Twitter account on March 31, 2016.", "The Begnaluru City police tweet is embedded below:", "Fake message is floating on Whatsapp regarding this number as BCP’s Women Helpline. The number does not belong to BCP\n\n\t\tPeople are requested not to believe or share this fake message. Stringent action will be taken against those who create and spread fake messages on social media pic.twitter.com/cG7Ky81dqd", "The picture on the left in the misleading Facebook post detailed above is this Getty Images stock photograph by John Sommer, while the picture on the left matches a headshot of Prime Minister Modi shared on his verified Facebook page here.", "Below is a screenshot of both the images:", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]