["Social media users have been sharing a picture of President Ramnath Kovind with Home Minister Amit Shah with the claim, “Ahmedabad: Modi government honours Sardar Patel by renaming the stadium after itself. On the same day, Home Minister Shah honoured President Kovind by making him walk outside of the red carpet while himself walking on it… Only the BJP can show this much respect.”", "This Facebook post by user Rani Rajesh amassed over 6,200 shares at the time of writing.", "Lawyer and activist Deepika Rajawat also shared the photo on Twitter. Her post had been retweeted over 800 times at the time of writing.", "Another user named Ishrat Khan posted the image and wrote “This is the president of the country walking outside of the red carpet to allow His Majesty Modi and the villainous Amit Shah to walk on it. We are blessed to have found such a selfless president.” Her post racked up more than 300 retweets.", "This claim regarding President Kovind walking outside of the red carpet for Amit Shah is viral on Facebook and Twitter.", "This slideshow requires JavaScript.", "We noticed the NDTV watermark on the photo. Based on this, we performed a keyword search on YouTube and found the NDTV broadcast carrying the viral screenshot. This video centers around the recent name change of Motera Stadium to Narendra Modi Stadium. Uploaded on February 24, 2021, the visuals seen in the screenshot appear at the 3:11 mark. The clip was taken at the inauguration of the stadium when President Kovind and the Home Minister arrived for the Bhoomi pujan ceremony.", "DD News did a live telecast of the entire event. This video is over 1 hour and 40 minutes long. At the beginning of the video, we see that President Kovind is walking in the middle of the carpet and Amit Shah is guiding him as he walks alongside. After the Bhoomi Pujan, the two leaders move towards the stage where the President walks off the carpet for a few moments. Gujarat Governor Acharya Devvrat and Minister of State for Sports Kiran Rijiju were also present at the occasion. Furthermore, the leaders come on stage one after the other at the 11:00 mark. The President arrives at 14:4 and the other leaders stand up to pay their respects. A screenshot of a brief moment from the entire program was circulated to suggest that Amit Shah was walking on the red carpet while the President was walking outside of it.", "The viral claim that the President was disrespected is false.", "Donate Now", "A journalist and a dilettante person who always strives to learn new skills and meeting new people. Either sketching or working.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]