["Thousands of troops are expected in D.C. to protect Joe Biden’s presidential inauguration; an increase in security is due to threats of potential violence, especially after a mob rioted the Capitol earlier this month.", "But the photo shared on Facebook shows National Guard troops at the Lincoln Memorial in June, during protests for racial justice.", "D.C. National Guard troops stood on the steps of the Lincoln Memorial over the summer observing people protesting the killing of George Floyd. Now, an image from that time is being shared on Facebook suggesting it shows soldiers protecting the inauguration of President-elect Joe Biden.", "\"If you need 10,000 armed soldiers to protect you’re (sic) inauguration from the people, then you probably weren’t elected by the people,\" said text over the image of a row of National Guard troops standing on the steps of the Lincoln Memorial.", "The Jan. 15 post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "About 20,000 National Guard troops are expected in D.C. for Biden’s inauguration, but the image shared on Facebook is not from this month’s security preparations. It was taken June 2, 2020 and showed troops at the Lincoln Memorial and matches an image credited to ABC News’ Martha Raddatz. Raddatz posted a similar photo on Twitter that day as well as a video on her Instagram account that showed the scene.", "A similar photo was taken by a Getty Images photographer that day with the caption, \"Members of the D.C. National Guard stand on the steps of the Lincoln Memorial as demonstrators participate in a peaceful protest against police brutality and the death of George Floyd, on June 2, 2020 in Washington, DC.\" The protest was among many that took place across the country as demonstrators called for racial justice and end to excessive use of force by police after Floyd, a Black man, was killed by a white Minneapolis police officer.", "The Facebook post also ignores the context of the heightened security for Biden’s inauguration — on Jan. 6 a mob of President Donald Trump’s supporters, some armed, stormed the U.S. Capitol as lawmakers gathered to certify Biden’s electoral win.", "FBI Director Christopher Wray on Jan. 14 said law enforcement was \"seeing an extensive amount of concerning online chatter… about a number of events surrounding the inauguration.\"", "\"We’re concerned about the potential for violence at multiple protests and rallies planned here in D.C. and at state Capitol buildings around the country in the days to come that could bring armed individuals within close proximity to government buildings and officials,\" Wray said during the Jan. 14 briefing on inauguration security.", "Biden beat Trump in the 2020 presidential election. Biden got more than 7 million votes than did Trump, and also won the Electoral College votes 306-232. Election officials and courts have rejected Trump’s false and baseless claims about widespread election fraud and irregularities.", "A Facebook post suggests that a photo shows armed soldiers protecting Biden’s inauguration.", "Thousands of troops are expected in D.C. to protect Biden’s inauguration; an increase in security is due to threats of potential violence, especially after a mob rioted the Capitol earlier this month. But the photo shared on Facebook shows National Guard troops at the Lincoln Memorial in June, during protests for racial justice.", "We rate the post Mostly False.", "Facebook post, Jan. 15, 2021, archived link", "PolitiFact, How we know Joe Biden won the 2020 presidential race, Nov. 13, 2020", "PolitiFact, A day of crisis at the US Capitol, fact-checked, Jan. 6, 2021", "Twitter, @MarthaRaddatz tweet, June 2, 2020", "Twitter, @VeraMBergen tweet, June 2, 2020", "NPR, About 20,000 National Guard Members To Deploy For Inauguration, Officials Say, Jan. 13, 2021", "Getty Images, photos of National Guard in D.C. in January 2021; photo of D.C. National Guard at the Lincoln Memorial, June 2, 2020", "PolitiFact, Photo shows National Guard at Lincoln Memorial, not the Capitol, Jan. 8, 2021", "FBI.gov, FBI Director Christopher Wray’s Remarks at Briefing on Inauguration Security, Jan. 15, 2021", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]