["About this rating", "State election officials publicly acknowledged that a returned ballot was recorded for a man named William Bradley, who had died in 1984.", "The ballot was recorded in error due to its being confused with one submitted by a similarly-named relative and was not part of a fraudulent attempt to cast a vote using the identity of a dead person.", "Voting in the 2020 U.S. Election may be over, but the misinformation keeps on ticking. Never stop fact-checking. Follow our post-election coverage here.\n\nIn the days following the Nov. 3, 2020, U.S. general election, widely distributed social media posts claimed that dead (or possibly dead) voters had received and returned absentee ballots in a number of states, implying that election fraud may have occurred at the voter level.", "One such allegation was the claim that a vote was recorded after having been cast by a Michigan man named William Bradley ... who had died in 1984 at the age of 82.", "Several versions of the same claim were shared across  social media platforms. For example, President Donald Trump’s son and campaign surrogate, Donald Trump, Jr., promoted a tweet posted by the account for the\n(unsuccessful) Republican U.S. Congressional candidate Anna Paulina Luna of Florida:", "For those who don’t believe in voter fraud.", "This is nuts. William Bradley a 118 year old dead person apparently voted via absentee ballot in Wayne County Michigan. Bradley died in 1984. How long has this scam been going on?", "Similar allegations were presented and published by right-wing online activist Austin Fletcher, who uses the moniker “Fleccas”; Ryan Fournier, the co-founder of the Students for Trump; and the British pro-Brexit campaign Leave.EU. Social media users insinuated that the error suggested more widespread voter fraud had occurred in multiple states:", "On Twitter, the Michigan secretary of state responded directly to Fletcher’s claim, stating simply that the allegation was “misinformation”:", "Snopes was first alerted to this rumor on Nov. 5, and in the days since then we have investigated the veracity of the claim at the urging of our readers. While it is true that a vote was recorded in the Michigan state election system by the now-deceased Bradley, election officials have publicly stated that it was done in error and was not a form of fraud.", "In short: The Bradley screenshots are real, but they were highly misleading due to being provided without full context.", "Many states such as Michigan have implemented online voting tracking systems which are available to the voters so that they may track their registration statuses and whether their ballots have been counted. A search in this system for “William Bradley,” born in March 1902 residing in the postal code 48207, returned a response that read, “Yes, you are registered!” and our search also indicated that Bradley’s returned absentee ballot was received on Oct. 2:", "(A note on the website also stated that Bradley is on the permanent absentee voter list and will be sent an application for every election. Due to the COVID-19 pandemic, vvote-by-mail applications were mailed to every registered voter in Michigan, although that still would not explain why Bradley's completed ballot was reportedly received in October.)", "A cross-reference with the U.S. Social Security Death Index showed a man by the same name with a birthdate of March 4, 1902, and residing in the same ZIP code area passed away in June 1984:", "A search for a Michigan resident in Wayne County under the name of William Bradley returned another Michigan resident registered at the same ZIP code, although he was born in 1959, not 1902.", "In an interview with PolitiFact, the younger Bradley told the fact-checking site that he had received an absentee ballot for both himself and his deceased father, but he threw the latter out. Daniel Baxter, a consultant for the Detroit Department of Elections, sent the publication a statement explaining that the son's ballot had been mistakenly logged as that of his dead father:", "No ballot for the 118-year-old Mr. Bradley was ever requested, received or counted. A man with a nearly identical name requested a ballot and voted properly in both the primary and general elections. When his ballot was initially logged, however, it was incorrectly attributed to the William Bradley born 118 years ago through a clerical error.", "This phenomenon occurs because identical names can sometimes be incorrectly recorded on voting rolls, both at the point of registration and throughout the ballot-recording process.", "The Help America Vote Act (HAVA) was passed in 2002 in an effort to reform the nation’s voting process, including centralizing statewide voter lists. According to the Open Election Data Initiative, a nonpartisan government initiative to streamline election data, a voter list is a “detailed record of every person who is registered and eligible to vote,” but these voter lists are not always accurate.", "Snopes spoke with John Fortier, a political scientist with expertise in mail-in voting at the MIT Election Data and Science Lab, who said that statewide voter lists are not perfect, though they are improving. During the 2000 general election, just seven states had statewide computerized voter databases.", "“Truthfully, in many places, the voter registration lists were a local concern — one county might have their list on paper or in files, and this is because we started voting a long time before computers,” said Fortier.", "Following the passage of HAVA, states centralized county voter registration lists into a computerized database, and although regular checks are conducted for individuals who have moved out of state or have died, it remains possible that a person who died two decades before the system integration began could have been missed. Although Fortier said that the Bradley incident is “surprising” and “troubling,” it does not indicate that widespread voter or election fraud is taking place throughout the system.", "“We don’t have evidence that this is a widespread problem with lots of people falling into this category, but that doesn’t mean we need to condone it,” said Fortier. “Do we see lots of cases where we know dead people are voting? No. Could we improve? Yes.”", "But even in the event of such a clerical error, the Michigan Secretary of State wrote in a statement shared online, safeguards are in place to ensure that such illegitimate ballots are rejected:", "Ballots of voters who have died are rejected in Michigan, even if the voter cast an absentee ballot and then died before Election Day. On rare occasions, a ballot received for a living voter may be recorded in a way that makes it appear as if the voter is dead. This can be because of voters with similar names, where the ballot is accidentally recorded as voted by John Smith Sr when it was actually voted by John Smith Jr; or because of inaccurately recorded birth dates in the qualified voter file; for example, someone born in 1990 accidentally recorded as born in 1890. In such scenarios, no one ineligible has actually voted, and there is no impact on the outcome of the election. Local clerks can correct the issue when it is brought to their attention.", "While room for improvement may remain, occasional clerical errors do not mean that the system is a failure. For example, Michigan has a number of mechanisms in place to ensure election security, including its improved qualified voter file system. This custom-built system is used by election officials to “efficiently and effectively maintain the state’s registered voter list” with multifactor authentication and continuous monitoring. The system automatically registers all citizens who apply for driver’s licenses or identification cards to help keep voter rolls up to date.", "Madison Dapcevich is a freelance contributor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]