["Dominion Voting Systems, which maintains voting systems in 28 states, became the center of false claims alleging voter fraud following Joe Biden’s projected victory in the 2020 presidential election,", "The latest claim surrounding Dominion Voting Systems purports to show the company’s alleged logo as a red ballot going into a red box and a blue ballot coming out along with the slogan “changing how people vote.”", "“That pretty much says it all about our voting machines in Georgia,” wrote one user on Nov. 21. \"Wonder how much money our elected officials that purchased this voting system got as kickbacks? 30 pieces of silver?”", "Other users shared a similar version of the photo, with a list above the claimed logo. It reads: \"'Dominion,' a word that is the opposite of freedom and democracy. ‘Changing the way people vote’ Literally changing votes. The actual logo is a ‘red’ vote going in, and coming out is a ‘blue vote,’ They put it right in our faces.\"", "None of those versions accurately represent the company's logo or slogan.", "USA TODAY reached out to the Facebook users for comment.", "Fact check: Pennsylvania mail-in ballot claim mixes primary, general election data", "The current logo on Dominion Voting Systems’ website and archived versions of the site reveal that the graphic is fake and does not show the company's authentic logo.", "Dominion's logo, which is visible on the top left-hand corner of its website and on LinkedIn, does show a red ballot going into a red ballot box, however, there is no blue ballot coming out, as claimed.", "Another image on Dominion's product page shows that its slogan is \"Accurate. Reliable. Transparent.\"", "Archived versions of Dominion Voting Systems' website from November 2016 and January 2017 show that the logo and slogan have remained the same over the years.", "Kay Stimson, vice president of government affairs for Dominion Voting Systems, told Check Your Fact that the posts are a doctored image of the company logo and that the purported slogan has never been used by the company.", "Fact check: The warrant for Joe Biden's arrest circulating online is from a fake court", "The logo claim follows baseless allegations of fraud surrounding voting equipment and Dominion Voting Systems that have been debunked by USA TODAY.", "The claim that Dominion deleted votes for President Donald Trump and switched them to Biden is false.", "\"Dominion Voting Systems categorically denies false assertions about vote switching issues with our voting systems,\" the company said in a statement. \"Vote deletion/switching assertions are completely false.\"", "Claims that Dominion Voting Systems closed down and its executives are \"on the run\" in the aftermath of the election have also been debunked by USA TODAY.", "Posts linking Dominion Voting Systems and Democrats such as House Speaker Nancy Pelosi and Sen. Dianne Feinstein have been found to be misleading.", "Fact check: Fairness Doctrine only applied to broadcast licenses, not cable TV like Fox News", "The claim that Dominion Voting Systems' logo shows a red ballot box with a blue ballot coming out and its slogan is \"changing the way people vote\" is FALSE, based on our research. Archived and current versions of the logo show that the company's actual logo is a red ballot going into a red ballot box, suggesting the image in posts online is a doctored version of the authentic logo. A spokesperson for the company has also denied the claim.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more."]