["About this rating", "In late December 2019, social media users circulated a meme with an ominous quote attributed to Democratic Virginia Gov. Ralph Northam.\n\nNortham never made the above statement. The quote appears to be derived from an incendiary Dec .13, 2019, blog post by white supremacist blogger and radio show host Hal Turner. In the blog post, Turner claimed to be privvy to information about secret orders issued by Northam to a small group of staffers but provided no information about his source:", "The Governor of Virginia has allegedly ordered a small cadre of staffers to begin the process for determining how to cut off electricity, telephones/ FAXES, Cellular phones AND DATA, as well as the Internet, in areas where he plans to send Virginia National Guard Troops to forcibly seize guns when the Democrat legislature convenes in January!", "The order was allegedly given to a very small and trusted group of staffers, some of whom it turns out, do not agree (at all) with this idea.", "Turner has a track record of spreading inflammatory misinformation. And in 2010 he was sentenced to 33 months behind bars for threatening federal judges in response to their rulings that upheld handgun bans in Illinois. In an email he sent us on Dec. 31, 2019, Turner, who had allegedly been paid by the FBI to inform the agency on domestic terrorism, told us his source was a staffer in the Virginia governor's office who requested anonymity for fear of retaliation.", "Northam's spokeswoman, Alena Yarmosky, stated in an email that Northam never made the comment attributed to him in the above meme, and never told staffers to plan raids on Virginians who didn't turn over their guns. \"People who spread lies like this should be ashamed of themselves,\" Yarmosky stated.", "Turner's Dec. 13 blog post appears to be a reaction to the fact that for the first time in a generation, Democrats starting in January 2020 will control the state-level government in Virginia after electoral gains in November 2019 elections.", "That could mean Democrats will pass proposed gun regulations, such as \"universal background checks, re-instating a one gun per month law, and a red flag law aimed at reducing the risk of someone in crisis hurting themselves or others.\" In an interview on CNN in November 2019, Northam stated he would also reintroduce legislation banning bump stocks and high-volume magazines.", "In reaction to that news, some red-leaning local governments in Virginia have declared themselves to be \"second amendment sanctuaries,\" to which Virginia Attorney General Mark Herring responded, \"When the General Assembly passes new gun violence legislation, they [the laws] will be followed, and they will be enforced.\"'", "Virginia lawmakers stating that they plan to enforce the law isn't the same thing as threatening to cut power and lines of communication, then kill those who don't surrender guns. Northam did not make the comment attributed to him in the social media meme above, and we found no evidence that Virginia legislators were planning such an extreme action. We therefore rate this claim \"False.\"", "Konsmo, Sarah. \"Virginia Attorney General Says Proposed Gun Laws Will Be Enforced Despite Opposition.\"\r\n  WUSA.20 December 2019.", "Anti-Defamation League. \"Hal Turner Gets 33-Month Prison Sentence for Making Death Threats.\"\r\n  22 December 2010.", "Duster, Chandelis. \"Virginia Governor Says He Will Reintroduce Gun Control Measures aAter Dems Take Over State Government.\"\r\n  CNN. 6 November 2019.", "Associated Press. \"Blogger Accused of Threatening U.S. Judges Was Reportedly Paid by F.B.I.\"\r\n  29 November 2009.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]