["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "U.S. Rep. Connie Mack IV, R-Fort Myers, has been the target of attacks for missing votes while campaigning for Senate this year.\n\nIn a debate against his Democratic opponent Sen. Bill Nelson on Oct. 17, 2012, Mack defended himself by saying that his career voting record was on par with Nelson’s.  Mack started in Congress in 2005, while Nelson served in the House between 1979 and 1990 and then joined the Senate in 2001.\n\nHere’s what they said at the debate:\n\nNelson: \"Speaking of votes why don’t you explain how you don’t show up to work? Why don’t you explain how this year you have one of the worst voting records. I have missed one vote this year. You have missed 178....\"\n\nMack: \"As far as my voting record, Senator, you should be straight with people. I’ve got a 94 percent voting record.  You’ve got a 92 percent voting record.\"\n\nWe will fact-check Mack’s claim that he’s got \"a 94 percent voting record\" for his career in Congress, while Bill Nelson has \"a 92 percent voting record.\"\n\nMissed votes in 2012\n\nThis fight over voting records started earlier in the debate when Nelson claimed that he only missed one vote while Mack missed 178, which meant he has \"one of the worst voting records.\" We ruled that claim Mostly True; we’ll briefly recap our findings.\n\nGovTrack.us tracks missed votes for members of Congress using voting information from the official websites of the U.S. House of Representatives and Senate. It shows that for the first three quarters of this year, Mack missed 178 votes. Nelson’s one missed vote this year was to confirm the nomination of a federal judge in Illinois, which passed 86-1 on May 14.\n\nMack’s missed votes for this year put him in 13th place for members of Congress who have missed the most votes during the past two years, according to the New York Times’ Inside Congress database.\n\nBut it’s no surprise that Mack missed more votes than Nelson this year. While Nelson had token primary opposition, Mack faced serious primary challengers.\n\nIn July, Mack campaign spokesman David James said that Mack missed votes \"to make sure Mitt Romney won the Florida presidential primary in January, something Connie's constituents felt very strongly about when it comes to invoking the change we need in Washington.\"\n\nMissed votes throughout career\n\nLooking at sheer vote numbers isn’t an apples-to-apples comparison because the House takes more votes than the Senate.\n\nSo we also looked at the percentage of missed votes for Mack’s tenure and Nelson’s Senate tenure.\n\nFrom the start of Mack’s tenure in January 2005, he missed 6 percent of roll call votes -- that’s how Mack can claim that he has a 94 percent voting record. During Nelson’s Senate tenure starting in January 2001, he missed 1 percent. The median missed votes for all members was 2.5 percent.\n\nBut Mack’s claim that Nelson had a 92 percent voting record -- or missed 8 percent of votes  -- refers to his term in the House (1979-1990) plus his term in the Senate starting in 2001.\n\nHere’s why Mack likes to throw in those earlier years for Nelson: When Nelson campaigned for governor in 1990, he missed 56 percent of his votes.\n\nMack campaign consultant Gary Maloney sent us a spreadsheet showing Nelson’s missed votes and his voting participation rate each year based on Congressional Quarterly data. According to that data, Nelson participated about 92 percent of the time.\n\nWe contacted CQ directly, and they could not immediately verify the raw number of votes but did provide the percentage of missed votes each year, and that averaged out to about 92 percent, too. (Note that averaging the percentage each year isn’t a true average, because the total number of votes changed each year, but it likely provides a close approximation.)\n\nWe sent our findings to the Nelson campaign and they did not dispute the numbers.", "Our ruling\n\nMack said that his own career voting participation rate is 94 percent, while Nelson’s is 92 percent. The available data supports those numbers.\n\nBoth candidates have political reasons for times when they missed votes: Nelson missed more than half of his votes in 1990 when he ran for governor. Mack missed about 30 percent so far this year running for Senate.\n\nSo while Nelson criticized Mack for missed votes this year, Nelson has also missed votes in the past, and their career voting rates are roughly equivalent. We rate this claim True.", "PolitiFact, \"Bill Nelson says Connie Mack missed a lot of votes this year,\"Oct.  17, 2012\n\nPolitiFact,\"Dave Weldon says Connie Mack missed ‘almost half’ of his votes in Congress this year,\"July 25, 2012\n\nPolitiFact, \"Connie Mack says Bill Nelson missed 56 percent of his votes -- in 1990,\"July 26, 2012\n\nTampa Bay Times The Buzz blog, Weldon robocall rips Mack for missing votes, July 22, 2012\n\nTampa Bay Times The Buzz blog,\"Missed votes could be an issue for U.S. Rep. Mack as U.S. Sen. campaign heats up,\" Feb. 3, 2012\n\nTampa Bay Times The Buzz blog, \"Connie Mack competing with Charlie  Rangel for most missed votes,\"July 24,  2012\n\nMiami Herald, \"Campaign pressures McCollum candidate: Senate run restricts voting in House,\" Accessed in Nexis, Oct. 16, 2000\n\nPOLITCO, \"Connie Mack skips out on big votes, hits trail instead,\"April 17, 2012\n\nGeorge LeMieux for U.S. Senate, Radio ad, March 14, 2012\n\nGovTrack.us, Missed votes for U.S. Rep. Connie Mack (R-Fort Myers), Accessed July 23, 2012\n\nGovTrack.us, Missed votes for U.S. Sen. Bill Nelson (D-Florida), Accessed July 23, 2012\n\nCQ Roll Call, Data showing missed votes for Bill Nelson in the House and Senate, Accessed Oct. 18, 2012\n\nNew York Times Inside Congress, Top house vote missers, Accessed Oct. 17, 2012\n\nInterview, Derek Willis, New York Times reporter, Oct. 17, 2012\n\nInterview, Joshua Tauberer, president of Civic Impulse which created the GovTrack.us website, Oct. 17, 2012\n\nInterview, Gary Maloney, Connie Mack campaign consultant, Oct. 17, 2012\n\nInterview, David Meyers, CQ managing editor of member information and research, Oct. 18, 2012", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]