["The photo was shared here in a Facebook post on October 7, 2020.", "The post's Hindi-language caption translates to English as: “This is the fakir’s new flying hut, built at a cost of 8600 crores rupees.”", "Indian Prime Minister Narendra Modi referred himself as a fakir – a poor ascetic or holy man – in a public speech earlier this year, as mentioned in this report by Indian financial newspaper Mint.", "The total cost of the two highly customised Boeing-777 planes to be used by India’s top leaders -- presidents, vice-presidents and prime ministers -- is estimated to be around 8400 crore rupees as reported here. A crore is equal to 10 million.", "The photo was also shared here, here, here and here on Facebook, and here, here, here and here on Twitter alongside an identical claim.", "The claim, however, is false.", "A reverse image search on Google found the photo was published here on the website of Beijing-based private Deer Jet Airlines alongside several other photos showing the luxurious interior of a plane.", "“In September 2016, Deer Jet took over the management of the world’s first 787 Dream Jet. The aircraft was added to Deer Jet’s Hong Kong-based fleet. It took renowned French aircraft interior designer Jacques Plerrejean and the aircraft completion centre more than 2.5 years of work to create this masterpiece of aerospace and craftsmanship,” reads the text alongside the photos on the website in parts.", "Below is a screenshot comparison of the photo shared in the misleading Facebook post (L) and the photo published on the Deer Jet website (R):", "The same photo was published here by private jet charter broker company Private Fly and here in an article by UK newspaper The Times on September 2, 2017. Both articles state the aircraft is a private Boeing-787 plane.", "In response to the misleading posts, the Indian government-run Press Information Bureau (PIB) dismissed the claim here on Twitter, quoting an identical tweet alongside the same photo, earlier on August 1, 2020.", "Claim - A twitter user has posted image of luxurious interior of an aircraft claiming it is PM @narendramodi's official aircraft #PIBFactCheck - The photo is of a private Dreamliner model by Boeing 787 and not of PM's aircraft #FakeNews pic.twitter.com/eTyhpBTpor", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]