["About this rating", "The Mylan pharmaceutical company donated money to the Clinton Foundation, according to the organization's web site.", "Mylan CEO Heather Bresch is not personally listed as a donor to the Clinton Foundation.", "An image circulating in the wake of the controversy over the increasing costs of Mylan's EpiPens and the financial affairs of the company's CEO has left some people confused about the identity and political status of that CEO.", "The text of the image reads:", "Hi, I'm Heather Dresch, CEO of the company that makes EpiPens. I raised the price from 5 bucks to over $300. Oh yeah, I'm also a huge Clinton Foundation donor. You're welcome, America.", "Mylan's CEO is Heather Bresch (not Heather Dresch, as it was misrendered), and while it is conceivable she could have furtively donated to the Clinton Foundation under another name, Heather Bresch is not listed as a donor to the Clinton Foundation at any monetary level (much less a \"huge\" one), nor is anyone else with the surname Bresch.", "However, Mylan, the company she heads, has donated somewhere between $100,000 and $250,000 to the Clinton Foundation — thereby joining the ranks of thousands of other donors, including the Bill and Melinda Gates Foundation, GOP presidential candidate Donald Trump, the Commonwealth of Australia, Kingdom of Saudi Arabia, Norwegian government, the Netherlands government, Blue Cross and Blue Shield of North Carolina, and the Elton John AIDS Foundation.", "Bresch and the company she leads have been at the center of controversy over the skyrocketing cost of EpiPens, pre-filled auto-injectors that are used to counteract life-threatening symptoms associated with severe allergic reactions. As the wholesale price of EpiPens has jumped from $56.64 to $317.82 between August 2016 and 2007, Bresch has enjoyed a total compensation spike that at the same time went from $2,453,456 to $18,931,068. As SEC proxy filings note, Bresch went from president in 2007 to chief executive in 2015.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]