["Voters are comparing the two presidential candidates on a number of issues as Election Day nears. A post on social media claims Democratic presidential nominee Joe Biden can’t compete on one issue: event turnout.", "“Embarrassing: Biden-Harris Held Arizona Rally, According to Media, No One Showed,” the Facebook post’s text reads, overlaid on a picture of the two Democratic candidates along with several laughing emoji.", "Similar posts are circulating, and some commenters were quick to believe the claim is true.", "“Imagine what they are thinking! The fear! The knowledge they are not going to win!!” one commenter wrote.", "“And yet, they are ahead in the polls!” another wrote.", "The post’s creator did not respond to USA TODAY’s request for comment.", "More:Biden, Harris to AZ: Vote like life depends on it", "The event described in the posts wasn’t a rally. According to local Fox 10’s NEWS NOW reporter Nicole Garcia, Biden and vice presidential candidate Kamala Harris were meeting with local tribal leaders at the Heard Museum in Phoenix, which features American Indian art.", "Garcia noted that there was not much “fanfare” outside the museum for the two candidates but said that was an intentional move by the Biden campaign. She said she was told by Biden staffers that the campaign chose to withhold details about the visit, like timing and location, from the public so that the visit would not attract a crowd.", "“They want to keep the crowds to a minimum,” Garcia said of the Biden campaign. “They realize we are in a pandemic, and they don’t want a crowd of more than 50 people at any of their events.”", "The photo in one of the posts was a screenshot from Garcia’s reel, after she moved out of the way to show the lack of a crowd at the event.", "As President Donald Trump continues to hold rallies amid the COVID-19 pandemic, the assertion that Biden can’t bring in a sizable crowd has been raised numerous times, including by Trump at the first presidential debate.", "The Biden campaign has said it does not support large gatherings due to the danger of coronavirus spread.", "More:Fact check: Biden campaign events portrayed as small lack context of COVID-19 guidelines", "\"Joe Biden is working to earn every vote with a groundbreaking campaign that meets this moment. And he's doing it in the way he would govern: by putting the well-being of the American families he'd fight for every day in office first — as opposed to Donald Trump, who's holding divisive, vain superspreader events at the expense of communities hungering to overcome the pandemic that he continues to make immeasurably worse than it needs to be,\" Andrew Bates, Biden's director of rapid response, told USA TODAY.", "Both Biden and Harris have criticized the president for his rallies.", "\"Every place I go I’ve got to set an example,\" Biden said Sept. 10. \"That’s why, everywhere I go, I wear this mask, and, everywhere I go, I keep my social distance.\"", "We rate the claim that Biden and Harris threw a rally in Arizona that no one attended as MISSING CONTEXT, based on our research. The campaign did not plan for the stop to be a rally and withheld details about the event from the public. The claim also ignores the context of the Biden campaign’s stance on large gatherings during the COVID-19 pandemic.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more."]