["By Robert Farley", "Posted on March 6, 2018", "President Donald Trump often likes to boast about his ability to negotiate better deals for the government. This week, the boast was the cost of a new embassy in Jerusalem, and it was a doozy.", "“Two hundred and fifty thousand dollars versus a billion dollars. Is that good?” Trump asked Israeli Prime Minister Benjamin Netanyahu.", "It would be if it were true. But Trump is comparing the cost of renovating and adding to an existing facility in Jerusalem to use temporarily as an interim embassy with the cost of building a new, permanent home for the embassy in Jerusalem.", "Moreover, it’s unclear where Trump is getting that $1 billion estimate for the cost of the permanent facility.", "We asked the White House press office who provided Trump with the $1 billion estimate. It did not respond.", "But just a week ago, State Department spokeswoman Heather Nauert said it was “premature to discuss financing arrangements” for the new construction. “We have not had any formal discussions or any formal proposals of the sort, and when it comes to overall cost estimates, that’s something that we’ll have to work out with Congress,” Nauert said in a Feb. 28 briefing.", "Trump’s comments came during remarks before a bilateral meeting with Netanyahu on March 5. Trump was asked about the opening of the U.S. Embassy, which Trump announced in December would be moved from Tel Aviv to Jerusalem.", "“We’ll have it built very quickly,” Trump said. “We’re going to have it built very quickly and very inexpensively.”", "Trump then continued: “They put an order in front of my desk last week for a billion dollars. I said, ‘A billion? What’s that for?’ ‘We’re going to build an embassy.’ I said, ‘We’re not going to spend a billion dollars.’ And we’re actually doing it for about $250,000. So check that out. Now, it’s temporary, but it’ll be very nice. Two hundred and fifty thousand dollars versus a billion dollars. Is that good?”", "“Yeah, it’s good,” Netanyahu said.", "On Dec. 6, Trump formally announced his intention to relocate the U.S. Embassy to Jerusalem. Congress passed the Jerusalem Embassy Act in 1995 recognizing Jerusalem as the capital of Israel and calling for the relocation of the U.S. Embassy from Tel Aviv to Jerusalem. But since then, Presidents Bill Clinton, George W. Bush and Barack Obama signed waivers every six months putting off the relocation, fearing that it would be an impediment to Middle East peace talks. (Read here for some history on why the relocation of the embassy is controversial.)", "“While previous presidents have made this a major campaign promise, they failed to deliver,” Trump said on Dec. 6. “Today, I am delivering.”", "On Feb. 23, the State Department announced plans to open an interim U.S. Embassy in Jerusalem in May in a building that currently acts as the U.S. Consulate General Jerusalem. The building will temporarily house the U.S. ambassador “and a small staff.” By the end of 2019, however, the State Department plans to build an annex on the same compound for the “Ambassador and his team with expanded interim office space.”", "A State Department official told us internal modifications to allow the embassy to open in an existing facility in May are anticipated to cost $200,000 to $400,000. So that’s presumably where Trump got the $250,000 figure, which he identified as going toward a “temporary” facility.", "The State Department says it has begun to search for a site for a permanent embassy, “the planning and construction of which will be a longer-term undertaking.”", "That, of course, is the bigger ticket item. But as we said, we’re not sure where the president is getting his $1 billion estimate, and the press office did not clarify. The New York Times cited a former State Department official who estimated the cost at half that, $500 million.", "Patrick Kennedy, who retired last year from the State Department where he served as under secretary for management, told the New York Times that embassies can cost anywhere from $150 million to $1 billion to build. According to the Times: “The one in Jerusalem is likely to cost somewhere in the middle of that range — about $500 million — because it does not need the housing, warehouse or security functions of some of the most expensive buildings, such as those in Baghdad and Kabul, Mr. Kennedy said.”", "Asked about Trump’s comments about the embassy costing $250,000, White House Press Secretary Sarah Sanders said, “I think the point he’s making is that he’s going to do it faster and far less expensive than a billion-dollar project, as was projected.” She did not say who made that projection.", "Trump suggested that the $250,000 figure was tied to the interim facility when he said, “Now, it’s temporary.”", "But he muddied the issue when he said, “We’re not going to spend a billion dollars. … We’re actually doing it for about $250,000.” He then said, “Two hundred and fifty thousand dollars versus a billion dollars. Is that good?” It would be “good,” if the figures were for the same thing, but they are not.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]