["About this rating", "Social media erupted with expressions of outrage in early October 2017 after WJBK, a Fox Television affiliate in Detroit, reported that a novice firefighter, 41-year-old Robert Pattison, was fired for bringing a watermelon to the station as a gift for his new co-workers at Engine 55 in the Joy-Southfield neighborhood of Detroit.", "Although showing up on one's first day with a gift (usually doughnuts) is a firehouse tradition, Second Battallion Chief Shawn McCarty told Fox 2 News, 90 percent of Engine 55's firefighters are black, and some took offense at Pattison's choice of offerings:", "FOX 2: \"Is it racially insensitive to bring a watermelon into a firehouse?\"", "\"To some people,\" McCarty says.", "FOX 2 spoke to Pattison by phone, who claims it was not a joke — and he did not mean to offend his fellow firefighters. But he clearly did. Fire Commissioner Eric Jones says the Fenton native was officially discharged.", "Certain foods, notably watermelon and fried chicken, acquired racially charged significance when they were used to caricature and dehumanize black Americans during the long period of segregation in the South following the Civil War. As William Black explained in a 2014 article in The Atlantic:", "The trope came into full force when slaves won their emancipation during the Civil War. Free black people grew, ate, and sold watermelons, and in doing so made the fruit a symbol of their freedom. Southern whites, threatened by blacks’ newfound freedom, responded by making the fruit a symbol of black people’s perceived uncleanliness, laziness, childishness, and unwanted public presence. This racist trope then exploded in American popular culture, becoming so pervasive that its historical origin became obscure.", "Although mixed, social media responses to the announcement of Pattison's termination appeared to sharply favor the sentiment that Detroit officials overreacted by firing him:", "? Seriously? Heads up White people like Watermelon!! Firefighter fired first day for bringing watermelon to station https://t.co/mwnorC2fYB", "— America1st (@mepk00alcom) October 9, 2017", "I constantly eat watermelon when it's in season. Guess I'm racist.", "He's lucky not to be working with hypersensitive a$$holes like them. https://t.co/kyyHP8Lvu7", "— Laud Report ⭕ (@laudreport) October 9, 2017", "When asked by Fox 2 News if he thought Pattison, who said his gift was meant as a gesture of good will, deserved to be fired, Battalion Chief McCarty said he didn't think so. \"Between what he did and losing his job there were a few things that could have been done,\" McCarty said. However, Detroit Fire Commissioner Eric Jones issued a strongly-worded statement defending the decision:", "There is zero tolerance for discriminatory behavior inside the Detroit Fire Department. On Saturday, Sept. 30, 2017, at Engine 55, a trial firefighter (probationary employee) engaged in unsatisfactory work behavior which was deemed offensive and racially insensitive to members of the Detroit Fire Department.", "After a thorough investigation, it was determined that the best course of action was to terminate the employment of this probationary employee.", "We invited further comment from the Detroit Fire Department, but did not hear back before publication time. We have not been able to reach Robert Pattison.", "Asher, Taryn.  \"Detroit Firefighter Fired for Bringing Watermelon to Station.\"\r\n  WJBK.  6 October 2017.", "Black, William.  \"How Watermelons Became a Racist Trope.\"\r\n  The Atlantic.  8 December 2014.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]