["The Facebook post attracted over 5000 comments and more than 10,000 reactions when shared on this Facebook Page that has 1.2 million followers.", "The photo shows a distressed male student carrying a female student, who appears to be lifeless or unconscious, at Nairobi’s Silver Spring Secondary School in the Kibera slum.", "A caption accompanying the image on the misleading post implores the public to send their condolence messages to the family of the allegedly dead student.", "\"Only the heartless will ignore this. May her saw (soul, sic)  rest in peace, she died after her mathematics exams. Don't scroll without typing....R.I.P,\" the caption read.", "In the “About” section of the Facebook page it is described as “just for laughs” but some of comments appeared to take the post seriously, showing concern for the girl.", "A reverse image search on Google and Yandex search engines revealed that the image was first taken in May 2016 during protests held in Kibera to push for electoral reforms in the country.", "The demonstrations, reported in several publications, were spearheaded by the opposition Coalition for Reforms and Democracy (CORD) which held that the electoral body must be reconstituted before a general election in 2017.", "As police officers were dispersing the protesters, they fired tear gas into the school’s compound, causing the girl in the photo to collapse, according to Katie G. Nelson, the reporter who took the picture in May 2016.", "While this image is not of a student who died during exams, the Nation last week reported that a male student at Gesiaga Secondary school in the west of the country died after taking a mathematics exam. The student is said to have suffered a heart-related ailment.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]