["About this rating", "In 2018, two entities founded by Oprah Winfrey — \"O, the Oprah Magazine\" and the Oprah Winfrey Network — published an article that promoted a pro-choice online campaign called #ShoutYourAbortion.", "Winfrey is not the editor-in-chief of \"O, the Oprah Magazine,\" and she did not herself make any personal statement about the #ShoutYourAbortion campaign, supportive or otherwise. She also did not share or promote the campaign on her personal social media accounts.", "It's not clear whether Winfrey, in her capacity as founder and editorial director of the magazine, played any part in the decision to publish the May 2018 article that promoted the campaign.", "In March 2019, an old story re-emerged on social media claiming that media mogul Oprah Winfrey had \"promoted\" an online campaign encouraging women to talk publicly about abortions they had undergone.", "In Facebook and Twitter posts made on 3 March, the pro-life website Lifenews.com posted an August 2018 article with the headline \"Oprah Winfrey Promotes 'Shout Your Abortion' Movement Where Women Brag About Their Abortions\":", "Oprah Winfrey waded deeper into political waters this summer by promoting the “Shout Your Abortion” movement and its attempts to normalize the killing of unborn babies. The July issue of her “O” magazine featured “Shout Your Abortion” founder Amelia Bonow in its “Inspiration” section, CNS News reports. Bonow, who began the campaign to urge women to brag about aborting their unborn babies, soon will be coming out with a new book by the same title, according to the report.", "Several other websites, mostly with conservative or pro-life leanings, published similar reports. Some reports' headlines specified that Bonow's article was published by \"O, the Oprah Magazine,\" while other reports, including that published by Lifenews.com, singled out Winfrey, claiming that she personally had promoted, endorsed or supported the #ShoutYourAbortion campaign.", "In reality, Winfrey has not personally made any statement about the campaign, supportive or otherwise, so it is somewhat misleading to claim, as some observers did, that she had \"promoted\" or endorsed it.", "However, it's true that two entities she founded, \"O, the Oprah Magazine\" and OWN, the Oprah Winfrey Network, published an article written by Amelia Bonow, the creator and leader of the #ShoutYourAbortion campaign, in which Bonow promoted that campaign. Furthermore, it's not clear to what extent Winfrey herself exercises any editorial oversight over the content that ends up in the magazine or on OWN's Oprah.com website, or whether she played a part in the publication of Bonow's article in particular.", "Bonow's article was a first-hand account of how she inadvertently gave rise to the #ShoutYourAbortion campaign after she discussed an abortion she herself had undergone, in a September 2015 Facebook post: \"Right after my Facebook post, people I knew started chiming in with their own abortion stories. I texted a screenshot to my friend Lindy, who asked to tweet it. I said, 'Sure,' then ran out to catch a bus. After a couple of blocks, I looked at my phone and saw all-caps texts from her. The hashtag she added, #ShoutYourAbortion, had gone viral. Over the next couple of days, tens of thousands of women flooded social media to talk about their abortions.\"", "The article was published in the May 2018 edition of \"O, the Oprah Magazine\" and posted on Oprah.com, which is the digital platform for OWN.", "Winfrey was the founder of both entities and is listed as \"editorial director\" of the magazine. However, she is not that publication's editor-in-chief (that person is Lucy Kaylin), and a disclaimer on the magazine's website stipulates that Winfrey does not sign off on or agree with everything the magazine publishes:", "Does Oprah approve everything on this site?", "She doesn't! While, just like with the magazine, Oprah is involved in the vision and overall DNA of her brands, we're working to carry on her mission -- and now, that also includes her magazine's website. So while we may feature a reported story on a specific topic, a reaction to a TV show, or a personal opinion from a writer, that does not mean Oprah feels that way; it just means that, as a team, we're producing articles we hope will inspire you -- or at the very least, spark a conversation.", "Winfrey also did not promote or share either Bonow's article or the #ShoutYourAbortion campaign on any of her personal social media channels.", "We contacted representatives for the magazine, asking whether Winfrey approved Bonow's article in particular, and whether Winfrey personally supported the #ShoutYourAbortion campaign, but we did not receive a response in time for publication.", "Winfrey is also chief executive officer of the Oprah Winfrey Network, whose website re-published Bonow's article. However, it's not clear whether Winfrey exercises any discretion over articles published or re-published on that site. We contacted representatives for the network, asking whether Winfrey had approved the re-publication of Bonow's article on Oprah.com, and whether Winfrey personally supported the #ShoutYourAbortion campaign, but we did not receive a response in time for publication.", "Bilger, Micaiah.   \"Oprah Winfrey Promotes 'Shout Your Abortion' Movement Where Women Brag About Their Abortions.\"\r\n    Lifenews.com.   20 August 2018.", "Zanotti, Emily.   \"Oprah Winfrey's Magazine Promotes the 'Shout Your Abortion' Movement.\"\r\n    The Daily Wire.   21 August 2018.", "Bannister, Craig.   \"Oprah's Magazine Promotes 'Shout Your Abortion' Movement.\"\r\n    CNSNews.com.   20 August 2018.", "Byas, Steve.   \"Oprah Promotes 'Shout Your Abortion' Movement.\"\r\n    The New American.   21 August 2018.", "Morana, Janet.   \"Oprah Champions #ShoutYourAbortion and Ignores Women Who Regret Their Abortions.\"\r\n    The Washington Examiner.   23 August 2018.", "Bozell III, L. Brent.   \"Oprah Shouts for Abortion.\"\r\n    Creators.com.   24 August 2018.", "Bonow, Amelia.   \"How One Woman Became an Activist with the Hashtag #ShoutYourAbortion.\"\r\n    O, the Oprah Magazine.   May 2018.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]