["About this rating", "A photograph supposedly showing \"millions\" of colorful buttons littering a dilapidated staircase has been circulating on social media for several years, attached to the claim that the image was taken inside an abandoned button factory:", "Many internet users have expressed skepticism over the claim. In a September 2018 thread on Reddit, for example, one user imagined the supposedly ridiculous series of events that would have resulted in such a scene:", "Did it explode? Why are buttons just laying everywhere?", "Factory is closed! Everyone clock out, collect your last paycheck, and spill ALL of the buttons we have left on the floor on your way out so people know what happened here.", "While we can't confirm exactly how these buttons came to be on this staircase (or even how many there are), we can confirm that this photograph was actually taken at an abandoned button factory by Instagram user Dec_Des and was originally shared to her feed in November 2016:", "?Member? #abandoned_excellence #jj_urbex #grime_lords #ic_urbex #abandoned_greece #masters_of_darkness #rustlord_vip #ig_asylum #froggy_members #trb_members1 #team_urbex ? ? ?#abandoned_addiction#ae_membersonly#bpa_stairwaytodecay#G_S_I#global_urbex#aj_ladies#urbex_utopia#grime_nation#igw_decay#tv_hiddenbeauty#ig_abandoned#abandoned_junkies#discarded_butnot_forgotten#kings_abandoned#bleak_life#kf_urbanonedmasks#abandonedafterdark#GL_UL_Ladies#bandorebelz", "A post shared by  ??? ᴰᴱᴱᴾ ᴰᴼᵂᴺ ✞ ᴰᴵᴿᵀᵞ (@dec_des) on Nov 20, 2016 at 8:48am PST", "We reached out to Dec_Des, a photographer who specializes in abandoned urban buildings, for more information, and she told us that the image showed a staircase at an abandoned button factory in Athens, Greece. Dec_Des also said that the photograph wasn't staged, and that the buttons were \"all over the top floor in plastic bags decayed and opened with that result and all over the stairs.\"", "The humorously suggested scenario by the Redditor above is likely inaccurate. -- that is, employees did not spill buttons all over the floor on the day that this factory was shut down. However, it's easy to imagine someone's ripping open the abandoned bags of buttons and dumping them over the stairs as urban explorers made their way into the graffiti-covered building in the years since the factory closed.", "Dec_Des provided us with additional images she took in this abandoned factory:", "Dec_Des isn't the only person who has explored this abandoned building. In October 2018, after this photograph went viral attached to an inaccurate claim that it was taken in China, a photographer named Christos Tolis set out to locate and photograph this picturesque staircase and found it inside an abandoned button factory in Patissia, a neighborhood in Athens, Greece.", "Here's an excerpt from an article published by mixanitouxronou.gr (translated via Google and edited for clarity):", "The discovery started with an unusual photo of an old stair full of colorful buttons. The spectacular spectacle and the automatic search ... The photo existed on various international websites. Most of these reported that it was an abandoned button factory in China ...", "With a bit of searching and a lot of luck, we found the real ghost factory! It's not in the Chinese city Longhua Shenzhen, as mentioned in most posts, nor are we talking about a staged photograph. The abandoned button factory is in Patissia!", "Mixanitouxronou.gr, which published a number of Tolis' photographs, explained that this building was once owned by a company called \"Niva.\" In addition to capturing his own version of the viral button-covered staircase photo, Tolis also took images of the abandoned equipment, old store signs, graffiti, discarded button boxes, and a tower adorned with three black stars outside of the building. We were able to match Tolis' photographs of the exterior of this building with images from Google Earth and Google Maps. You can see Tolis' images on Mixanitouxronou.gr.", "Here's an excerpt from the article describing the condition of this abandoned building:", "The factory area is divided into three floors, each approximately 1000 square meters. On the ground floor are the heaviest cutting and packaging machines as well as powder-coated barrels, large benches, button molds, and many others useful for their production.", "On the first floor there is a large space with millions of buttons spilled down drawing a second colorful floor. Many are still packaged in plastic bags. These over time disintegrate and so others are added to the pile. Inside the buttons are also the glasses from broken windows, cylindrical plastic rods, various barrels and machine parts.", "On the second floor, also thousands of buttons spilled on the floor or glued on paper card samples, machines, wardrobes for the clothes of the staff with their initials, invoices, order forms, brochures, posters, packing boxes etc.", "It's unclear exactly when this factory was shut down. Mixanitouxronou.gr reported that Niva started manufacturing buttons in the 1940s, and that buttons produced by this company \"were placed on the clothes of half of Greece in the 1960s and 1970s.\"", "The website continued: \"Buttons in a variety of sizes and colors. Buttons for shirts, trousers, coats, dresses ... It is not unlikely that in some old grandfather's coats the buttons will be from this industrial unit!\"", "While this building has likely been abandoned for several decades, we know that Greek officials have been contemplating what to do with the land it sits on since at least 2015.", "Μιχάλη Γελασάκη.   \"Αποκλειστικό φωτορεπορτάζ από το εντυπωσιακό εγκαταλελειμμένο εργοστάσιο κουμπιών στα Πατήσια. Το βιομηχανικό φουγάρο με τα τρία μαύρα αστέρια.\"\r\n    Mixanitouxronou.gr.   17 October 2018.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]