["The claims about Williams have circulated online for more than a decade, for example here is a 2008 blog post which has been shared by accounts with millions of followers according to CrowdTangle data.", "This Urdu-language Facebook post, which has been shared more than 370,000 times since it was published September 14, 2016, repeats the misleading claims that Williams was the first Indian astronaut and that she converted to Islam after returning from the moon.", "The post says: “Glory to Allah: And there are many clues for the wise… First Indian astronaut Sunita Williams, who converted to Islam after returning from a journey to the moon, says: ‘When I looked at the earth after reaching the moon, I saw darkness on the entire planet, but there were two places from where light was coming and when I looked at them with a telescope those places were Mecca and Medina. The second reason (for converting to Islam) was that on the moon all frequencies were constantly failing, but still the Azan (Islamic call to prayer) could be heard.' Share this miracle with the entire world\".", "The misleading Facebook post includes a photograph of Williams in a space suit and two satellite images of the Kaaba and the tomb of the Prophet Mohammed in Saudi Arabia.", "Similar claims about Williams have also been published here on the popular Pakistan Defence blog and here on the Made for Pakistan blog.", "William is American and was born in Euclid, Ohio, according to her official NASA biography which can be seen here. Her father is from India’s Gujarat and her mother is from Slovenia, according to multiple media reports from those countries, for example here and here.", "The first Indian astronaut was Rakesh Sharma who went into space in 1984, according to the Kennedy Space Center.", "Archival footage of Sharma speaking with then-Indian prime minister Indira Gandhi from space can be seen here on the Indian National Congress official YouTube channel.", "The first American astronaut with Indian heritage to go into space was Kalpana Chawla in November 1997, according to NASA.", "And the last time humans walked on the moon was the Apollo 17 mission in 1972, according to NASA.", "Williams was born in 1965 and first went to space on December 9, 2006, according to her official biography, which can be seen on NASA’s website here.", "Her second space mission was from July 14 to November 18, 2012, and both times she went to the International Space Station, NASA said.", "There is no evidence that Williams converted to Islam after her space missions.", "In this April 2, 2013 video of a press conference with Williams posted on the NDTV official YouTube channel, the astronaut speaks about taking a statue of Hindu god Ganesha to space along with a copy of the Bhagavad Gita, a famous Hindu text.", "\"I really appreciate my Indian heritage and was glad I could bring part of it with me to space,\" she says at the press conference.", "\"We don't get to carry too much to space so those were some of the small items I wanted to make sure were part of me while I was there. Ganesha has always been in my house. Everywhere I have lived I've had Ganesha. So he had to come with me to space of course.\"", "Williams also dismisses the allegations she converted to Islam in a 2010 interview Conde Nast Traveller.", "She is asked: “Are rumours that you converted to Islam after seeing the lights of Mecca and Medina from space true?”", "She replies: “I don’t know where that started. It’s not like I mind and I don’t have favoritism for any religion. But my dad is Hindu and I grew up trying to understand, what Krishna, Ram and Sita means? My mother is Christian, so then, what does Jesus mean? Me personally—not something to do with NASA—I do think there is a God and it’s somebody looking out for us and trying to guide us to live a very happy, productive life. There is further meaning. That’s just my thought.”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]