["By Saranac Hale Spencer", "Posted on May 14, 2020", "Social media posts targeting former President Barack Obama suggest he will be tried for “treason” and falsely claim that if convicted his title would be “stripped away” along with all his presidential actions.  There’s no support for the claim he’ll be tried for treason, and it’s untrue that any former president’s actions would be undone after such a conviction.", "The social media spotlight has turned to former President Barack Obama since President Donald Trump began tweeting about “Obamagate” on May 10.", "Trump has long accused Obama — without evidence — of directing an illegal FBI investigation into his 2016 campaign for political reasons. But, as we have written before, the Department of Justice inspector general, Michael E. Horowitz, examined the origins of the FBI’s investigation of Russia’s interference in the 2016 presidential election, and found no “documentary or testimonial evidence that political bias or improper motivation” influenced the opening of the investigation or decision-making during it.", "One recent post that picked up on the “Obamagate” buzz began on Twitter, but quickly migrated to Facebook as a screenshot meme, claiming: “When a POTUS is found guilty of #Treason, their title of the Presidency is completely stripped away negating every Executive Order, Judge Appointee, ‘everything’ they had ever done… Brace yourselves, #Obama is about to make history.”", "But that’s “complete nonsense,” Gregory Magarian, a law professor at Washington University in St. Louis, told FactCheck.org in an email.", "Two other law professors we contacted agreed.", "There is “no support at all” for the claim that a treason conviction would undo a past president’s work, Professor Michael Gerhardt, of the University of North Carolina at Chapel Hill, told us by email. He said that overturning past actions taken by a convicted former president would require counteractions, such as successful court challenges or new presidential directives.", "Similarly, Alan Morrison, associate dean of the George Washington University Law School, told us that a conviction of treason wouldn’t affect a former president’s actions and, further, he said, “the notion that he’s going to be tried for treason is laughable.”", "Treason is the only crime that is specifically defined in the U.S. Constitution, which says:", "U.S. Constitution, Article III, Section 3: Treason against the United States, shall consist only in levying War against them, or in adhering to their Enemies, giving them Aid and Comfort. No Person shall be convicted of Treason unless on the Testimony of two Witnesses to the same overt Act, or on Confession in open Court.", "And, according to the National Constitution Center, there have been few treason prosecutions in the history of the U.S. and only one since 1954.", "No president has been convicted of treason, so there is no precedent for it. And the post’s claims about the potential impact — that such a conviction would negate “everything they had ever done” — are false.", "“That’s complete fiction,” Magarian said in a phone interview. “There’s absolutely no authority for that.”", "Addressing the claim about federal judges, Magarian explained that once a judge is confirmed by the Senate and takes the oath of office, nothing that happens to the president who appointed him or her would have an impact.", "Also, Morrison explained that once federal judges take office, the only way they can be removed is through the impeachment process.", "“We are a government of laws, not of men,” Magarian said, explaining that actions taken by presidents have legal authority of their own, and are not an appendage of the person who took the action.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "Trump, Donald (@realDonaldTrump). “He got caught, OBAMAGATE!” Twitter. 10 May 2020.", "Magarian, Gregory. Professor, Washington University in St. Louis. Telephone Interview with FactCheck.org. 12 May 2020.", "Gerhardt, Michael. Professor, University of North Carolina at Chapel Hill. Email interview with FactCheck.org. 13 May 2020.", "Morrison, Alan. Associate dean, The George Washington University Law School. Telephone interview with FactCheck.org. 13 May 2020.", "The National Constitution Center. Treason Clause. Constitutioncenter.org. Accessed 12 May 2020.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]