["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "• A product’s barcode numbers don’t reveal its country of origin.", "• Prefixes for product numbers are assigned to individual manufacturers based on a set of country codes, but the products could be made anywhere.", "• These claims have been around since 2008 and have been debunked several times.", "As American businesses struggle to stay afloat amid shutdowns caused by the COVID-19 pandemic, calls to buy American-made products have been growing on social media.", "Also rearing its head online is anti-Asian and anti-Chinese sentiment, directed at the country where the novel coronavirus was first discovered.", "One viral image from Facebook reads: \"Pick up a product. Look at the barcode. If the first 3 numbers are 690 or 691 or 692, the product was made in China. Put it down and buy from any other country.\"", "The post misrepresents what the numbers that accompany a barcode indicate; they do not tell consumers where a product was made.", "These claims appear to date back to a 2008 email chain, and they’ve been repeatedly dismissed as incorrect. The idea that barcodes indicate a product’s country of origin has been debunked through the years by outlets such as Snopes, Reuters, Lead Stories and Nationwide Barcode.", "Barcodes are found on nearly all consumer products worldwide.", "The black and white barcode on a product package is an electronically scannable image that is accompanied by product number, usually printed just below it. This number, called a Global Trade Item Number, identifies what a product is and the owner of the brand that makes it. Although several variations of product numbers are used around the world, a 12- or 13-digit product number is common.", "The Facebook post claims that the first two to three digits of a product number indicate a product’s country of origin. But this is not the case, according to GS1, the global nonprofit foundation that works with manufacturers to assign the unique product numbers used with barcodes.", "These first few digits, called a prefix, are significant: GS1 licenses prefixes to manufacturers so they can create unique product numbers and barcodes that identify their particular company as the owner. These company prefixes are based on a set of country codes.", "It’s true that 690 to 699 prefixes are assigned to GS1 China, but that doesn’t mean products with those prefixes are made there. GS1’s website notes that \"since GS1 member companies can manufacture products anywhere in the world, GS1 prefixes do not identify the country of origin for a given product.\"", "Most products have written labels that indicate where they were made. For example, a box of anti-viral Kleenex tissues says, \"Made in the USA from domestic and imported material.\"", "Nationwide Barcode, another outfit that sells EAN and UPC barcodes, confirms that the product number prefix does not indicate what country a product was made in.", "\"Whether you purchase a barcode prefix from the GS1 or purchase a barcode from a company like Nationwide Barcode, the barcode will indicate the country where the prefix originated, regardless of where that company has their products manufactured,\" says a Nationwide Barcode article.", "A viral image reads, \"Pick up a product. Look at the barcode. If the first 3 numbers are 690 or 691 or 692, the product was made in China.\"", "The prefix of the number that accompanies a barcode does not indicate what country the product was manufactured in. While GS1 assigns prefixes to companies based on a set of country codes, those companies can manufacture their products anywhere in the world.", "We rate this image Mostly False.", "ABC News, \"Timeline: How coronavirus got started,\" April 9, 2020", "Snopes.com, \"Can You Determine a Product’s Country of Origin by Its Bar Code?\" October 28, 2008", "Lead Stories, \"Fact Check: A Barcode Does NOT Tell You A Product's Country Of Origin,\" April 16, 2020", "Nationwide Barcode, \"Barcodes – Where Products Come From,\" August 27, 2011", "Reuters, \"Partly false claim: Barcode prefixes identify where a product was made,\" April 21, 2020", "Barcodes, Inc., \"Barcoding Frequently Asked Questions (FAQ),\" accessed April 22, 2020", "GS1, \"GS1 in a nutshell,\" accessed April 23, 2020", "Reuters, \"Days numbered for barcodes as shoppers demand more data,\" Aug. 18, 2015", "Vox, \"How the coronavirus is surfacing America’s deep-seated anti-Asian biases,\" April 21, 2020", "YouTube, \"Why do I need a GS1 barcode?\" Jan. 8, 2019", "GS1, \"Does the GS1 Prefix (first 2 or 3 digits of the EAN-13 barcode number) show the country of origin?\" accessed April 23, 2020", "International Barcodes, \"Difference Between EAN-13 and UPC-A Barcodes,\" accessed April 23, 2020", "GS1, \"EAN/UPC barcodes,\" accessed April 23, 2020", "GTIN Info, \"GTIN DEFINITION : INFORMATION,\" accessed April 23, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]