["About this rating", "In January 2018, a Florida activist's video showing immigration officials asking Greyhound passengers for their papers caused some confusion about whether this shows an actual encounter.", "It does. The footage, posted by Tomas Kennedy, legitimately shows Customs and Border Protection officers boarding a Greyhound bus in Fort Lauderdale on 19 January 2018 and arresting one passenger. Greyhound had reportedly told passengers that they would be subject to a routine security check, not an immigration-related action:", "The video was shared thousands of times on Facebook and Twitter, where it was posted by the Florida Immigration Coalition (FLIC). (Kennedy is the deputy political director for an affiliated group, FLIC Votes.) He urged people to call FLIC, and wrote:", "Border Patrol got on a Greyhound bus yesterday at 4:30pm in Fort Lauderdale and asked every passenger for their papers and to prove citizenship. Proof of citizenship is NOT required to ride a bus!", "The American Civil Liberties Union of Florida told us in a statement that it is \"extremely concerned\" by the footage and is investigating the encounter:", "Immigration raids yield to unconstitutional practices that can violate the right to equal protection and the Fourth Amendment by coercing vulnerable individuals to submit to interrogations about their citizenship and immigration status, conducting unreasonable searches and seizure and targeting people of color.", "However, this is not a new practice. While Greyhound requires identification — but not citizenship — for people riding within the boundaries of the United States, the company has typically cooperated with immigration officials; in 2008 a Greyhound spokesperson told the New York Times:", "We are under no obligation to inform customers of law enforcement activity at any time.", "As the ACLU has noted, Customs and Border Protection agents have the authority to operate within 100 miles of any U.S. \"external boundary,\" including states with coastal borders like Florida. However, according to the ACLU:", "In practice, Border Patrol agents routinely ignore or misunderstand the limits of their legal authority in the course of individual stops, resulting in violations of the constitutional rights of innocent people. These problems are compounded by inadequate training for Border Patrol agents, a lack of oversight by CBP and the U.S. Department of Homeland Security, and the consistent failure of CBP to hold agents accountable for abuse. Thus, although the 100-mile border zone is not literally \"Constitution free,\" the U.S. government frequently acts like it is.", "University of Southern California law professor Niels Frenzen tells us that although it may be illegal to lie to federal law enforcement officers, it is not illegal for citizens to refuse to talk to them. Frenzen, who is the director of the immigration clinic at the USC Gould School of Law, told us:", "If it's literally an encounter on a bus in an interior checkpoint on the street and if the only thing the officer says is, \"Sir what's your citizenship, what's your immigration status,\" and you ignore the officer or you decline to answer, that in and of itself does not give the officer probable cause to make an arrest.", "Denis L. Gilman, who helms a similar clinic at the University of Texas at Austin school of law, has said that the same principle holds true for motorists. She told the Texas Observer in 2013:", "So, if you refuse to answer, they can pull you out of the line and over into \"secondary inspection\" and they can probably hold you there for about 20 minutes or so. But they cannot do anything more if you continue to refuse to respond unless something else develops during that time period that would lead to probable cause.", "Frenzen did add that permanent residents (a.k.a. \"green card\" holders) are required to not only carry their documentation but produce them if asked by immigration officers.", "FLIC membership director Isabel Sousa-Rodriguez told Miami New Times that encounters like the one filmed in Fort Lauderdale weaken the public's trust in law enforcement:", "Without an official judicial warrant, border patrol agents should not be permitted to board the private property of the Greyhound corporation to harass its customers and violate their civil liberties.", "We have reached out to CBP, FLIC, and Greyhound for further comment.", "Elfrink, Tim. \"Video: Border Agents Demand Papers From South Florida Greyhound Bus Riders, Arrest Woman.\"\r\nMiami New Times. 22 January 2018.", "Lee, Jennifer. \"A Protest Over Bus and Train Citizenship Checks.\"\r\nNew York Times. 2 April 2008.", "American Civil Liberties Union. \"The Constitution in the 100-Mile Border Zone.\"", "Casares, Cindy. \"Border Patrol Takes 'No' for an Answer at Internal Checkpoints.\"\r\nTexas Observer. 7 March 2013.", "Arturo Garcia is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]