["Images of ancient structures and sculptures have been circulated on social media with the claim that a Jain temple was excavated beneath a mosque in Raichur, Karnataka after a road renovation project. “कर्नाटक रायचूर मे रोड सौंदर्यीकरणकरने के लिये मस्जिद गिराई उस मस्जिद के नीचे निकला जैन मंदिर,” reads the message. From a Facebook page ‘3j-jai jinendra ji’, the post had attracted nearly 3,000 shares but was later taken down.", "कर्नाटक रायचूर मे रोड सौंदर्यीकरणकरने के लिये मस्जिद गिराई उस मस्जिद के नीचे निकला अद्भुत जैन मंदिर 👇👇🏻🤔", "Posted by Irresponsible Indians on Sunday, 20 October 2019", "The same claim has also been propagated on Twitter.", "कर्नाटक रायचूर मे रोड सौंदर्यीकरणकरने के लिये मस्जिद गिराई उस मस्जिद के नीचे निकला जैन मंदिर 👇👇🏻🤔 pic.twitter.com/tqdoxSG85s", "— Swapnil Mishra🔥 (@SwapnilPanditt) October 22, 2019", "It is being forwarded on WhatsApp as well.", "In fact, it has been doing the rounds on social media since May.", "A simple Google reverse image search reveals that the photographs shared on social media are of Gwalior fort in Madhya Pradesh. The fort is built on a solitary rocky hill called Gopachal which has been carved to build Jain statues, images of which are available on the internet.", "Photographs of the stepwell in the fort are also available on Getty Images.", "Several other similar images of areas inside the fort were found online.", "Photographs of different structures and statues inside the Gwalior fort were shared on social media as a Jain temple excavated beneath a mosque in Karnataka. A similar claim was shared in November 2018 when a digital artwork was portrayed as temple discovered after the demolition of a mosque in Raichur, Karnataka.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]