["By Eugene Kiely and Lori Robertson", "Posted on June 13, 2019", "In his much publicized visit to Iowa, President Donald Trump made a few false and misleading statements about agricultural exports:", "The president visited Iowa on June 11, the same day former Vice President Joe Biden campaigned in the state. Trump, who won Iowa by 9.4 percentage points in 2016, touted his record on farming issues and took aim at the policies of former President Barack Obama and Biden, the current frontrunner in the Democratic presidential field.", "In his remarks, the president touted a recent agreement with Japan on U.S. beef exports.", "Trump, June 11: And all around the world, my administration is knocking down barriers to products made, grown, and raised in the USA — not only on the farm, but all over. Just recently reached an agreement to eliminate restrictions and expand exports of American beef — you saw that — to Japan by up to $200 million a year. You saw that. There’s somebody selling beef over there. They haven’t bought our beef since the year 2000.", "He’s right that Japan agreed “to eliminate restrictions and expand exports of American beef,” but he’s wrong that Japan hasn’t imported U.S. beef since 2000.", "In a press release last month, the Department of Agriculture announced that Japan has agreed to give full access to U.S. beef products — the final step in a years-long process to fully restore access to the lucrative Japanese market.", "Japan was one of at least 100 countries that closed their markets to U.S. beef in late 2003 because of a case of bovine spongiform encephalopathy, or mad cow disease, according to a 2013 report by the U.S. Trade Representative’s office. The ban had a devastating impact on U.S. beef exports.", "“In 2003, U.S. producers exported $3.86 billion (1.3 million metric tons) of beef and beef products. The following year, as a result of the widespread import ban, U.S. exports fell by 79 percent, to $808 million,” the USTR report said.", "After two years, Japan eased its restrictions, and the U.S. started to sell some beef and beef products in Japan again. Access was further expanded in 2013.", "“In December 2005, Japan restored partial access for U.S. beef muscle cuts and offal items from cattle 20 months of age and younger,” the USDA said in its release. “In February 2013, Japan extended access to include beef and beef products from cattle less than 30 months of age.”", "According to USDA, U.S. beef exports to Japan totaled $1.4 billion in 2013, $1.6 billion in 2014, $1.3 billion in 2015, $1.5 billion in 2016, and $1.9 billion in 2017. The value of U.S. beef exports to Japan topped $2 billion in 2018, according to USDA data compiled by the U.S. Meat Export Federation. (See chart below.)", "The export federation website contains 10 years of USDA data, from 2009 to 2018, and shows Canada was the top market for U.S. beef in 2012. But Japan has been the best customer for U.S. beef since 2013.", "Trump cherry-picked figures to claim a drop of “over $22 billion” in agricultural exports during the last two years of the Obama administration. But the decrease (actually $15.3 billion from 2014 to 2016) masks the overall increase in export values under Obama.", "Agricultural export values rose during the first half of Obama’s tenure, peaking in 2014, before falling mostly as a result of lower commodity prices. Even with the drop in the last two years, export values rose by 17 percent over Obama’s time in office. They’ve gone up another 4 percent under Trump.", "Trump also misleadingly claimed that “farm income declined” under “past administrations.” The overall trend, similar to that of agricultural exports, has been a rise since the early 2000s, with a peak in 2013 and a general decline since.", "Trump, June 11: Past administrations did nothing while the farm income declined. In the last two years of the previous administration, farm income plummeted by more than $30 billion, and agricultural exports dropped by over $22 billion. Did you know that? Did you know that? You’ll be hearing it a lot over the next little while. That’s not a good number. …", "By the end of this year, farm incomes are projected to rise by more than $10 billion from the day I was elected.", "Here’s the longer-term trend for both farm income and agricultural exports since 1993.", "As the chart shows, the value of agricultural exports grew under Obama. Calendar-year figures from the USDA show that under former President George W. Bush the annual average was $70.8 billion, and it was $131.8 billion under Obama – a clear upward trend.", "Export values dropped from 2014, when they hit their peak of $150 billion, to 2015, when they were $133 billion. Jason Grant, director of the Center for Agricultural Trade at Virginia Tech University, told us in an email that about 75 percent of the decrease from 2014 to 2015 was because of declining commodity prices, and the rest was attributable to a decline in export quantities.", "“The US also experienced a large appreciation in the value of the US dollar against a broad basket of foreign currencies,” Grant said. “Dollar appreciation makes it more expensive for foreign customers to purchase our products, thus contributing to the decline in US agricultural exports during the last two years of the Obama presidency.”", "Looking at quantities, not dollar values, shows that “2016 was a record year for US soybean and corn exports (58 and 56 million metric tons, respectively, compared to 50 million metric tons each in 2014), even though the 2016 value of these exports fell short of 2014 values,” Grant said.", "In other words: “Lower values do not always translate into farmers and ranchers producing less or selling less on the global market,” since these values are moving with the change in commodity prices.", "Since Trump took office, the value of exports edged up a bit – to $138 billion in 2017 and $139 billion in 2018, according to data from the USDA. The 2018 figure is just $4 billion higher than exports in 2016.", "The average monthly agricultural export value in Obama’s last year in office was $11.2 billion, and it has averaged $11.5 billion over the past 12 months under Trump.", "As for net farm income (a “broad measure of profits,” the USDA says), that, too, has been on a general upward trend since 2003. Farm income did drop by about $30 billion, as Trump said, from 2014 to 2016, when net farm income was $61.5 billion. But that came after an increase from 2009, the year Obama took office, until 2013, when it hit a peak of $123.4 billion. We’ve explained before that this trend largely reflects the ebb and flow in commodity prices.", "“Trade agreements help and are important for longer run sustainability of the agricultural sector, but year-to-year changes in farm income are driven largely by movements in commodity prices which are a function of supply (weather, yield, stocks, etc) and demand balances,” Grant said.", "Farm income during the Trump administration has fluctuated — rising in 2017 to $75.2 billion, dropping to a projected $63.1 billion in 2018 and edging back up to a projected $69.4 billion in 2019.", "That would be a $7.9 billion increase from 2016 to 2019. Trump claimed “farm incomes are projected to rise by more than $10 billion from the day I was elected,” a figure we couldn’t confirm since USDA farm income figures are by year, not month or day. The 2019 projection is still below the recent historical average, the USDA’s Economic Research Service notes. “If realized, inflation-adjusted net farm income and net cash farm income would remain below their historical averages ($90.0 billion and $108.0 billion) across 2000-17,” it says.", "USDA ERS says “most” of the forecasted bump up in farm income for 2019 was driven by an expected increase in commodity prices. Why are prices expected to go up this year? It’s classic supply-and-demand. “Commodity prices are expected to increase because of severe flooding and poor planting conditions which has plagued the Midwest this spring,” Grant said. “When supply is expected to fall, this is supportive for prices.”", "The president also wrongly claimed that past trade policies — particularly the North American Free Trade Agreement, or NAFTA — have hurt U.S. farmers “so badly over a 15-year period.”", "Trump, June 11: How bad was NAFTA — what they did to you with NAFTA? And that’s why, for 15 years, you’ve been going — that and other reasons. That’s why the farmer has been hurt so badly over a 15-year period.", "As we’ve written before, U.S. farmers have had some down years recently, but not over a 15-year period and not because of trade.", "Farmers “experienced a golden period during 2011 through 2014 due to strong commodity prices and robust agricultural exports,” a February 2018 report by the nonpartisan Congressional Research Service said. Since 2013, farm income has been generally falling, mostly because of a drop in commodity prices.", "“The ag sector is seeing some hard times, but it is because of lower prices and not trade,” Wallace E. Tyner, who teaches agricultural economics at Purdue University, told us when we looked into this issue last year. “Weather has been pretty good, production high, and prices therefore lower.”", "As for the impact of NAFTA on farmers, “U.S. agriculture has benefited significantly from increasing market access in Canada and Mexico as a result of the formation of NAFTA some 25 years ago,” according to a February paper written by agricultural economists at Purdue University’s College of Agriculture.", "“The share of U.S. agricultural exports to these two countries has increased from 14.2% when the agreement was first signed to almost 30% currently,” the paper said.", "Along with an increased market share, there has been a significant increase in the total value of U.S. agricultural exports since NAFTA took effect.", "In 1993, a year before NAFTA was implemented, the U.S. exported about $43 billion worth of agricultural products, according to USDA’s calendar year export data. By 2007, agricultural exports had more than doubled ($90 billion). The next year, agricultural exports exceeded $100 billion for the first time ($114.8 billion). The total value of agricultural exports last year was nearly $140 billion.", "Tyner, a coauthor of the Farm Foundation paper, told us in an email that it’s “hard to say exactly how much of the change in share of ag exports to Mexico and Canada was due to NAFTA.” But, he added, “My sense is that most of it was due to NAFTA.”", "In fact, the USDA has a chart on its website that shows NAFTA has had more of an impact — in terms of export value — than any other trade agreement. The USDA chart compares the five-year agriculture export average for periods immediately before and after the implementation of 12 trade agreements since 1994.", "“Agricultural trade among NAFTA’s member countries has grown tremendously during the NAFTA period,” the USDA’s Economic Research Service wrote in a February 2015 paper on the impact of NAFTA. “The total value of intraregional agricultural trade (exports and imports) among all three NAFTA countries reached about $82.0 billion in 2013, compared with $16.7 billion in 1993 (the year before NAFTA’s implementation).”", "Trump also claimed that his replacement for NAFTA — the United States Mexico Canada Agreement, or USMCA — will reverse the damage he says NAFTA has inflicted on farmers, claiming his plan is going “to do pretty much the opposite” of NAFTA.", "The Farm Foundation paper said that the USMCA will have a “modest” impact on farm exports.", "“The new NAFTA agreement, the USMCA, consolidates the agricultural market access gains from the original NAFTA and in some sectors leads to an improvement in market access, most notably in dairy and poultry exports to Canada,” the report said.", "The USMCA will expand import quotas in Canada for dairy and poultry products, the Purdue researchers say.", "We won’t know the impact of the USMCA for sure unless and until it is ratified by Congress. For now, NAFTA remains in effect.", "Mary Marchant, a professor in Virginia Tech’s Department of Agricultural and Applied Economics, told us for a previous article on agricultural exports: “Bottom line, trade has been good for ag. overall & we are dependent on it for our success.”", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]