["About this rating", "A guest appearance by Fox News Channel host Judge Jeanine Pirro on the TV daytime talk show The View in July 2018 resulted in some angry words between Pirro and View co-host Whoopi Goldberg:", "Although this heated disagreement continued for a bit backstage after the cameras turned off, it did not, as some Twitter users have claimed, end with Whoopi Goldberg's using a racial slur in reference to the Fox News personality:", "(The phrase \"sand nigger\" is a derogatory and offensive term used to refer to persons of Middle Eastern or North African descent. Pirro was born in the U.S. to Lebanese-American parents.)", "Both Pirro and Goldberg addressed their verbal altercation during subsequent segments of The View and Pirro's Justice with Judge Jeanine Fox News show. While the two television personalities disagreed on some of the details (Pirro said that Whoopi told her to get \"the f*ck out\" and spat on her, Whoopi denied this happened and claimed that Pirro cursed everyone at The View as she left the building), Pirro did not assert, nor did Goldberg admit, that any racial slur was used.", "Here's how Pirro addressed her controversial appearance on The View during the \"Opening Statement\" portion of her show:", "\"Everyone has the right to speak. But when you cant even listen to what someone has to say because you despise the man who is president, you undermine not the president of the United States, you undermine the United States. \"- My #OpeningStatement pic.twitter.com/Fkq2sQiWII", "— Jeanine Pirro (@JudgeJeanine) July 22, 2018", "Here's Goldberg's follow-up on The View:", "Goldberg and Pirro may have disagreed on who was at fault for their squabble, but neither of them claimed or suggested that a racial slur had been directed by one of them at the other. Nor has anyone who was present when the incident took place come forward to offer anything substantiating that rumor.", "The accusation that Goldberg called Pirro a \"sand n***er\" did not originate with a credible news report, video evidence, or even a first-hand account of the argument. Rather, it came from the above-displayed tweet, issued by an account that has previously published unsubstantiated accusations from unknown sources.", "When we inquired of Lauri Hogan, the publicity director of ABC Television Network, about this matter, she vehemently denied that Whoopi Goldberg ever used the term \"sand n***er\" during her heated exchange with Pirro, saying \"This absolutely is false. Whoopi did NOT call Jeanine Pirro that name used in the tweet or anything like it.\"", "We reached out to both Whoopi Goldberg and Jeanine Pirro but have yet to receive a response.", "Stalter, Morgan.   \"Whoopi Goldberg: Pirro Wasn’t Kicked Out, She Left Cursing at Staff.\"\r\n    The Hill.   20 July 2018.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]