["The video was published here on Twitter, dating January 10, 2021.", "It has been viewed more than 1,900 times.", "The post’s traditional Chinese-language caption translates to English in part as: “Pence has been talking and laughing with Biden so soon! Many people say that he didn't change his face just a moment ago, and I believe it!”", "The posts circulated online after Pence acknowledged Biden as the US President-elect on January 7, 2021. The development was reported here by US newspaper USA Today and here by US television program producer CBS News.", "The video was also shared here and here on Twitter; here on Facebook; and on Weibo here and here with a similar claim.", "Some Weibo users posted comments on the posts that indicated they mistakenly believed the video was filmed in 2021.", "One comment translates to English as: \"Begun to take refuge in the new leader while the old one has not left his post. Understand! Afraid of being punished.\"", "Another reads: \"Pence hasn't smiled in front of Trump before. Look how sweet his smile is now.\"", "The claim in the posts, however, is false.", "A keyword search based on the video found this longer YouTube footage published by US news agency Associated Press (AP) on November 16, 2016.", "Corresponding visuals can be seen from the one-minute 18-second mark of the AP video.", "Below is a screenshot comparison of the misleading Twitter post (L) and the AP video (R):", "The title of the AP video reads: “Mike Pence Meets with Joe Biden at VP Residence”.", "The video’s caption states: “Vice President-elect Mike Pence met with Vice President Joe Biden Wednesday at the Naval Observatory in Washington, the official residence of the vice-president. (Nov. 16)”.", "The same footage was also published in 2016 by media outlets including UK newspaper The Guardian here, and the US broadcasting company ABC News here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]