["The Facebook post from October 21, 2020, has been shared more than 430 times from a South African page and shows 12 pictures of various wildfires.", "“See the farms burning here..well that's your breakfast,lunch and dinner..to hell and gone! (sic)” reads the caption, which invokes a racial slur to suggest the fires were started intentionally, before ending with: “Soon there'll be nothing left..but scorched earth.”", "Some comments believed the claim to be true, while others reprimanded the post’s author for using images from other countries.", "The post takes advantage of recent widespread fires in South Africa that have injured farmers, killed hundreds of animals and ripped through more than 200,000 hectares of land in the Free State, Northern Cape and North West provinces in October 2020, as reported here and here.", "AFP Fact Check used reverse image searches -- mainly on Google Images and TinEye -- to locate the original images, and found that none of them are related to any farm fires in South Africa.", "The first image was taken by John McColgan, a fire behaviour analyst for the United States department of agriculture (USDA) on August 6, 2000, at the Bitterroot National Forest in Montana.", "According to the USDA, on July 31, 2000, a line of dry-lightning storms swept across the southern portion of the forest, igniting more than 90 wildfires. Within two weeks, more than 121,405 hectares of the forest was ablaze.", "The second image was taken by AFP’s Kyle Grillot and shows a California wildfire in 2017. The caption reads in part: “The Thomas Fire burns along a hillside near Santa Paula, California, on December 5, 2017.”", "One firefighter was killed in one of the largest blazes in California’s history and a 70-year-old woman also died in a crash as she fled from the flames in her car. The Thomas Fire burnt at least 70,172 hectares, destroyed 1,063 structures and cost more than $177 million.", "The third image was taken by Reuters’ Noah Berger on September 13, 2015, in Lower Lake, California during a massive wildfire that claimed four lives and destroyed nearly 2,000 structures.", "“Flames from the Valley Fire cover a hillside along Highway 29 in Lower Lake, California September 13, 2015,” reads part of the caption.", "The fourth image is by Kent Porter of the Press Democrat via the Associated Press. It shows a home burning in Fountaingrove in Santa Rosa, California on October 9, 2017.", "“More than a dozen wildfires whipped by powerful winds have been burning through California wine country. The flames have destroyed at least 1,500 homes and businesses and sent thousands of people fleeing,” reads part of the caption.", "The fifth image was taken by Josh Edelson for AFP on August 2, 2015 during the Rocky Fire wildfire. It shows a fire truck being driven away from flames near Clear Lake, California. At the time, the fire had burnt more than 10,927 hectares and only five percent of it had been contained.", "Image six is also by Josh Edelson but taken a month later on September 12, 2015 near San Andreas, California. It shows a firefighter dousing flames from the Butte fire, which killed two people and destroyed hundreds of homes in California’s Gold Country.", "The seventh picture is of Tumwater Canyon in Washington, taken in July 2014 by Michael Stanford during the Chiwaukum Creek fire outside of Leavenworth which forced hundreds of residents to evacuate their homes.", "The eighth picture is a photograph by Darvin Atkenson showing fires approaching the shore of Bass Lake in California on September 14, 2014.", "The fire damaged 75 structures and forced the evacuation of hundreds of residents.", "The ninth picture as reported here and here was taken by Stuart Palley, showing the El Portal fire near Yosemite National Park, California on July 27, 2014.", "The tenth picture is also by Kent Porter and the caption reads: “A San Diego Cal Fire firefighter monitors a flare-up in Sonoma, California on October 11, 2017. A wind shift caused flames to move quickly uphill and threatened homes in the area.”", "Gene Blevins from Reuters took the eleventh picture on June 20, 2016. It’s captioned: “A Los Angeles County fire helicopter makes a night drop while battling the so-called Fish Fire above Azusa, California.”", "The San Gabriel Complex Fire consisted of two blazes that burned relatively close to each other: the Reservoir Fire, which consumed 464 hectares, and the Fish Fire, which burnt 1,721 hectares.", "AFP Fact Check could not trace the name of the photographer of the last picture but it was taken during the Witch Creek fire on October 21, 2007, in San Diego, California (see here and here).", "State investigators blamed San Diego Gas & Electric for three of the fires – the Witch, Guejito and Rice wildfires – that were responsible for the death of two people. The company, which supplies power to the San Diego area, paid out $2.4 billion to settle damages claims.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]