["About this rating", "If you need help, call the National Suicide Prevention Lifeline: 1-800-273-8255. Or contact Crisis Text Line by texting HOME to 741741.", "The inauguration of U.S. President Donald Trump was met with protests from the left, and just over a week later, on Jan. 29, 2017, a meme blasting those protests posted by a Catholic priest in New York resulted in backlash.", "The meme was posted by Rev. Philip Pizzo of St. Benedict Joseph Labre Roman Catholic Church in Richmond Hill, a neighborhood in Queens. The meme he posted depicted a man falling from a skyscraper accompanied by the words, \"Show your hate for Trump. Do it for social justice. #JumpAgainstTrump.\"", "Although it's unclear why, news stories about the resulting controversy re-circulated in February 2020, prompting some Snopes readers to ask whether the stories were true.", "The meme, posted to Pizzo's personal Facebook page, upset parishioners, some of whom told the New York Post at the time that they planned to seek a different place to worship. Pizzo told the Post he considered the meme to be humorous and did not think it promoted suicide, although many of his parishioners disagreed.", "Days later, however, Pizzo issued an apology, saying, \"I have been a priest for 40 years and my goal has always been to bring Christ to the people. I am pro-life and any reference to suicide is contrary to my beliefs, therefore, making my post completely inappropriate. Again, please accept my sincerest apology.\"", "Because Pizzo created the Facebook post more than three years ago (at the time of this writing), deleted it, and then issued an apology, we rate this claim \"Outdated.\"", "Alvarado, Caroll and Billie Shears. \"Priest Tells Anti-Trump Protesters to Commit Suicide.\"\r\n  New York Post. 30 January 2017.", "Rezac, Mary. \"Priest Apologizes for Meme Encouraging Anti-Trump Protesters to Commit Suicide.\"\r\n  Catholic News Agency. 1 February 2017.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]