["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Increases in the nation's spending on health care are smaller in recent years. How much credit can be given to Obamacare? (AP photo)", "On Aug. 2, 2013, when House Republicans staged their 40th vote to do away with all or part of Obamacare, Rep. Ron Kind rose to defend President Barack Obama’s landmark legislation.", "\"Mr. Speaker, what turned out to be a silly exercise has suddenly turned into an insane exercise. We find ourselves, for the 40th time in the House of Representatives, debating repeal of the Affordable Care Act,\" the Wisconsin Democrat said on the House floor.", "\"We understand they don't like it. But I beseech my colleagues on the other side to start working with us to improve a system that's in desperate need of reform, and make changes and adjustments along the way as we learn what's working and what isn't. That's the only way this can work.\"", "Then Kind, who took the microphone after Rep. James Bridenstine, R-Okla., made this claim:", "\"But let me just inject a few facts in this debate, especially for the benefit of the previous speaker. Since the passage of the Affordable Care Act, U.S. health care spending grew at 3.9 percent for the last three years, the lowest growth rate in over 50 years.\"", "Let’s see whether Kind is right on the numbers -- and to what extent Obamacare is responsible.", "The numbers", "The most recent federal figures, from the Centers for Medicare and Medicaid Services, show total public and private health care spending grew by the same rate -- 3.9 percent -- for three straight years: 2009, 2010 and 2011.", "Kind's spokesman, Peter Knudsen, confirmed to us that those were the years Kind was referring to when he spoke of \"the last three years.\"", "The 3.9 percent is the smallest annual increase since 1960, the first year total health care spending statistics were kept. The total spending has never declined from one year to the next.", "That means Kind is mostly on target with the statistical part of his statement.", "Where he’s off is that the 3.9 percent increase in 2009 occurred before the Affordable Care Act became law in March 2010.", "Now let’s turn to the other part of the statement: Kind's linking Obamacare with the record-low increases in health care spending.", "The credit", "Kind didn’t explicitly state that Obamacare alone is responsible for keeping a lid on spending on doctors, hospitals and other health care.", "His spokesman told us that Kind meant that Obamacare was merely one of many factors.", "But the implication was pretty strong. In defending Obamacare from a repeal attempt, Kind said that since the passage of the law, health care spending had been much lower. And he didn't cite any other reasons.", "We found widespread agreement among experts that many factors helped hold down the spending growth. And there is no consensus that Obamacare, which is still being implemented, was a leading factor.", "The experts who have weighed in on reasons for the smaller increases in spending include the American Medical Association, the Health Affairs journal and the federal government itself.", "Some experts have said Obamacare has helped rein in spending through steps such as reducing some Medicare Advantage payments; providing incentives that have led to fewer hospital-acquired infections and readmissions; and adding \"accountable care organizations,\" which give physicians incentives to improve quality and lower costs.", "But many economists and others experts say the slowdown in health care spending simply reflects the overall economic slowdown.", "Other factors include expert cite for the slowdown in health care spending increases include a decline in private insurance coverage, changes in the design of insurance benefits, and a slower introduction of new drugs and technology.", "And when the Centers for Medicare and Medicaid Services released the total health care spending figures for 2011, the agency concluded that Obamacare had \"no discernible impact\" on the slowdown in spending that year.", "Our rating", "Defending Obamacare, Kind said: \"Since the passage of the Affordable Care Act, U.S. health care spending grew at 3.9 percent for the last three years, the lowest growth rate in over 50 years.\"", "The statistical part of the claim is mostly accurate. But despite Kind’s implication that Obamacare was key in reducing the growth of health care spending, the evidence suggests its role was modest.", "For a statement that is partially accurate but leaves out important details, we give Kind a Half True.", "C-SPAN, U.S. Rep. Ron Kind House floor speech, Aug. 2, 2013", "PolitiFact National, \"Nancy Pelosi says Obamacare is bringing down health care costs,\" May 16, 2013", "Associated Press, \"House OKs effort to repeal Obamacare for 40th time,\" Aug. 2, 2013", "Interview and email interview, Rep. Ron Kind press secretary Peter Knudsen, Aug. 13, 2013", "Centers for Medicare and Medicaid Services, National Health Expenditure Accounts, 2011 highlights", "New York Times, \"Growth of health spending stays low,\" Jan. 7, 2013", "Health Affairs journal blog, \"The slowing of health care spending: Have we turned a corner?\" Aug. 9, 2013", "American Medical Association’s AMA wire, \"Slowdown in health spending rooted in factors beyond economic downturn,\" May 29, 2013", "American Medical News, \"Health spending slowdown shows signs it will stick,\" May 20, 2013", "Health Affairs, \"The slowdown in health care spending,\" May 9, 2013", "Health Affairs, \"If slow rate of health care spending growth persists, projections may be off by $770 billion,\" May 21, 2013", "Robert Wood Johnson Foundation-Urban Institute, \"What drove the recent slowdown in health spending growth and can it continue?\" May 2013", "Email interview, Centers for Medicare & Medicaid Services National Health Statistics Group deputy director Aaron Catlin, Aug. 14, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]