["About this rating", "On Dec. 9, 2020, a photograph supposedly showing the skeleton of a Kiwi bird and its unusually large egg was shared on social media:", "We have not been able to source this specific picture, but we have seen similar ones showing models of a kiwi bird skeleton and an egg in its body. The following image, for example, comes from the Museum of New Zealand Te Papa Tongarewa.", "North Island Brown Kiwi, Apteryx mantelli, collected 26 August 1940, Rotorua, New Zealand. CC BY 4.0. Te Papa (OR.016582)", "The kiwi, a flightless bird about the size of a hen that is native to New Zealand, has one of the largest egg-to-body ratios of any bird. According to the Audubon Society, a kiwi egg can \"can weigh up to a quarter of its body mass.\"", "To put that into perspective, here's an excerpt from a 2017 article from Live Science:", "[The egg] can be up to 20 percent of her body weight, though, which is comparable to a 120-lb. (54 kg) woman giving birth to a 24-lb. (11 kg) baby, according to the San Diego Zoo. The female lays one to two eggs at a time, up to three times per year.", "[...]", "Unlike other birds, chicks kick their eggs open and are covered in feathers as soon as they hatch. They look like tiny versions of their parents. After a few days, the chick will leave the burrow and hang out with dad for around 20 days. After that, they may stay in their parent's territory for a while or trek out to find their own.", "In addition to producing one of the largest eggs of any bird, the kiwi also has one of the shortest beaks. That might seem like a misstatement, judging by the photos above, but the length of a bird's beak is determined by measuring the distance from its nostrils to the tip of its beak. While most birds' nostrils are close to their heads, the kiwi's nostrils are at the ends of its beak. So, technically speaking, the kiwi has one of the shortest beaks of any birds.", "Here's a video from the Aukland Zoo about the amazing and unusual kiwi:", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]