["About this rating", "On 1 February 2017 the pop culture site Pajiba published what appeared to be an announcement by film and WWE star Dwayne \"The Rock\" Johnson that he would be running for President of the United States in 2020.  That putative announcement opened as follows:", "Hi. My name is Dwayne Johnson. Many of you may know me better as The Rock.", "I am running for the President of the United States.", "I know that this may sound like a joke to many of you. But it’s not. I am throwing my hat in the ring for 2020. I am not running against Donald Trump. I am not running against whatever candidate the Democrats field. I am not running against anyone. I am running for the country. As an independent. I am running on a simple platform of compassion and civility.", "In truth, Pajiba creative director Dustin Rowles told us in an e-mail, the post was not meant to deceive, but was instead presented as a best-case scenario", "It was just a joke! I didn't expect (or want) anyone to take it seriously! Basically, I was just trying to imagine the magic bullet that could solve our current political crisis, and the idea of The Rock running for President seemed to make sense. He's the one guy who could bring both sides back together again.", "Johnson, who is reportedly a Republican Party member and appeared at the GOP's national convention in 2000, has floated the idea of running for office on several occasions. He told the British edition of GQ magazine in June 2016 that:", "I'll be honest, I haven't ruled politics out. I'm not being coy when I say that, but at the moment I am not sure. I can't deny that the thought of being governor, the thought of being president, is alluring. And beyond that, it would be an opportunity to make a real impact on people's lives on a global scale. But there are a lot of other things I want to do first.", "A month later, ABC News aired a segment based around the possibility of Johnson's pursuing the presidency, in which he told interviewer Michael Strahan that:", "The idea of me being president one day has become a legit thing to some people. If it is an overwhelming positive strong, 'We want you to run for President' [sentiment] and if I felt that I could step up to the plate and become a tremendous leader and make a real difference and make change, I would do it.", "In November 2016, Johnson similarly told Reuters that:", "If I felt like I could be an effective leader for us, and surround myself with really high-quality leaders, then sure, I would ... I've found really good success in being able to galvanize people in a positive way and continued to push them, as I've pushed myself along the way too, because I walk what I talk, daily, which I think is an important quality.", "After being named \"Sexiest Man Alive\" by People magazine that same month, Johnson was quoted as saying:", "I used to say it jokingly but every time I was asked, it was with a real genuine interest ... So I started to really think. Could I make a difference? Could I surround myself with really brilliant people to help me make decisions? Do I care about this country? And when the answers continued to come up yes, then I thought, there’s a good chance. Yeah, one day. Then we’ll do another interview like this.", "The actor and occasional World Wrestling Entertainment performer has not responded to the faux announcement. On the day it was published, he was promoting his partnership with Ford Motors on Twitter.", "Kopan, Tal.    \"Dwayne 'The Rock' Johnson Entertains Presidential Campaign.\" \r\n    CNN.com.   25 March 2016.", "Sinha-Roy, Piya.   \"'The Rock' Talks a Future in Politics, Including Potential White House Run.\" \r\n     Reuters.   14 November 2016.", "Zimmerman, Amy.   \"Trump’s Win Encourages The Rock to Run for President: ‘Anything Can Happen.'\" \r\n    The Daily Beast.   15 November 2016.", "ABC News.   \"Dwayne 'The Rock' Johnson on Whether He Would Run for President.\" \r\n    14 July 2016.", "Arturo Garcia is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]