["About this rating", "In 2002 we encountered a rumor that postulated Lowe's Companies, Inc. was begun by the embittered ex-spouse of the owner of The Home Depot, Inc. According to this whisper (which we've since heard from a number of folks), a wife who felt she had not been fairly treated in a divorce used the knowledge she'd gained while in her marriage to create a rival to her husband's chain of home improvement supplies business, even to the point of locating her stores next to his in an effort to steal his customers.", "Story going around about Home Depot and Lowe's. At one time the owners were married to each other and got a divorce. The wife got a raw deal in the divorce so to get even she builds a Lowe's store as close to a Home Depot as she can.", "A less well-traveled form of the basic rumor asserts the following:", "I heard that the reason Home Depot and Loewe's are always built in close proximity to each other is that the \"owners\" of Home Depot and Loewe's are ex-spouses and that part of the divorce settlement is that wherever Home Depot builds a store, there must be a comparable space available for Loewe's to go in.", "In that version, neither spouse is presented as bent upon driving the other's business into the ground; instead, the puzzling concurrence of so many Lowe's and Home Depots is explained as a condition of the divorce and therefore as an item worked out and agreed to by both parties rather than as something one was doing to taunt or punish the other.", "As inherently satisfying as both forms of the legend are, there isn't a shred of truth to either. Lowe's was started in 1946 as a single store in North Wilkesboro, North Carolina, by two brothers-in-law, James Lowe and Carl Buchan. Within a few years Buchan bought out Lowe but kept the Lowe's name, possibly because he liked the sound of \"Lowe's Low Prices.\" Buchan died in 1961, the same year the company went public. Lowe's began trading on the New York Stock Exchange in 1979, and by 2004 its sales totaled $36.5 billion. As of 2005,  Lowe's operates more than 1,100 stores in 48 states. Its current President and Chief Executive Officer is Marvin R. Ellison, who has held that position since 2018. Before him, the Chairman, President, and CEO was Robert A. Niblock.", "Home Depot was founded in 1978 in Atlanta, Georgia, by Bernard Marcus and Arthur Blank, two top executives who had recently been fired from Los Angeles-based Handy Dan (another home improvement chain), and  Kenneth Langone, a New York investment banker who helped the pair gain the financing they needed to launch their venture. The company went public in 1981, and by 2005 the parent company, The Home Depot, Inc., was operating more than 1,800 stores (Home Depot, EXPO, and other subsidiary companies) in 50 states, the District of Columbia, the ten Canadian provinces, Mexico, and Puerto Rico. While Home Depot does not yet have stores in China, it did recently open two sourcing offices in that country. The current Chairman and CEO of Home Depot is Craig Menear, who has held that position since 2014.", "We can only guess why the rumor of a vengeful wife has attached to these two home improvement emporiums, speculating that it's possible the tale sprang in part from someone's having noticed the two retailers often locate their stores near one another, a practice that does appear to fly in the face of generally accepted business wisdom regarding not building too close to one's competitor. Yet Lowe's and Home Depot seem to want to go head-to-head in battling for the home improvement dollar, with both companies appearing to seek out locations as near as possible to the other's stores. (For instance, Home Depot announced in 2003 that it planned to build one of its stores in Olive Branch, Mississippi, a scant half mile from the spot on which Lowe's had just six weeks earlier declared it would build.) And in some cases, one retailer will choose to put its store right beside the other's, as in 2003, when Home Depot opened one of its outlets right next to an existing Lowe's in East Brainerd, TN.", "While a variety of rotten tricks have over the course of human history been pulled by retaliation-minded spouses of both sexes, few and far between have been acts of an empowering nature (which would have been the case here if this legend had been true about a wronged wife who started her own business, then used it to take on the giant in its business sector because she was determined to teach her ex- a lesson). Far more common in situations where there is an acrimonious split between a husband and wife who have knowledge of each other's business dealings is the clandestine phone call to the IRS in which misgivings are expressed about the accuracy of the other spouse's corporation's tax returns and a suggestion that an audit of that company's books might not be such a bad idea. As many a vengeance seeker has discovered, who needs the likes of Tony Soprano to administer a sharp and memorable lesson when Uncle Sam is but a phone call away?", "While this next story (which has been reported as true in Canada, yet so far defies our efforts to confirm it) isn't quite on point, it is similar enough in terms of a retribution-bent wife using \"her\" business to take apart his and humiliate him in the process to bear mentioning here:", "Consider Frank, the hairdresser in Vancouver, who was working both sides of the street — literally and figuratively. When creditors began closing in on Frank's salon, he opened up a new shop on the other side of the street, going into business against himself. To protect this new salon from his creditors, he registered it in his wife's name. The only problem was that Frank's wife knew he was having an affair with her sister, the receptionist at the old salon. And once her name was on the second salon, Frank's wife filed for divorce and kept it in the settlement. With the old salon now in bankruptcy, Frank had few options. His ex-wife — no doubt relishing her newfound  leverage — then offered him work in her salon. In one fell swoop, Frank had lost both salons, his marriage had failed and he was working for his ex-wife on salary.", "Langway, Lynn and Joseph Cumming.   \"Lowe's Largesse.\"\n     Newsweek.   31 March 1975   (p. 61).", "Lepeska, Toni. \"Home Depot Plans Olive Branch Store.\"\n     The [Memphis] Commercial Appeal.   9 October 2003   (p. DS1).\nMcDermott, John.   \"Expansions Added with Customers' Need for One-Stop Shopping.\"\n     The [Charleston] Post and Courier.   9 February 1998   (p. D8).\n Propp, Wren.   \"Biz Legends Prove Untrue.\"\n     Albuquerque Journal.   2 November 2004   (p. S1).\nReynolds, Jason.   \"Home Depot, Lowe's Will Duke It Out Again in City.\"\n     Chattanooga Times Free Press.   26 June 2003   (p. C1).\nScott, Jeffry.   \"Unusual Team Has Built No. 1 Firm in Its Field.\"\n     The Atlanta Journal and Constitution.   22 May 1991   (p. H1).\nTaylor, Peter Shawn.   \"Your House Divided.\"\n     Canadian Business.   February 1996   (p. 29).\nUpbin, Bruce.   \"Work, Buy and Hold.\"\n     Forbes.   20 January 2003.", "McDermott, John.   \"Expansions Added with Customers' Need for One-Stop Shopping.\"\n     The [Charleston] Post and Courier.   9 February 1998   (p. D8).", "Propp, Wren.   \"Biz Legends Prove Untrue.\"\n     Albuquerque Journal.   2 November 2004   (p. S1).", "Reynolds, Jason.   \"Home Depot, Lowe's Will Duke It Out Again in City.\"\n     Chattanooga Times Free Press.   26 June 2003   (p. C1).", "Scott, Jeffry.   \"Unusual Team Has Built No. 1 Firm in Its Field.\"\n     The Atlanta Journal and Constitution.   22 May 1991   (p. H1).", "Taylor, Peter Shawn.   \"Your House Divided.\"\n     Canadian Business.   February 1996   (p. 29).", "Upbin, Bruce.   \"Work, Buy and Hold.\"\n     Forbes.   20 January 2003.", "05/26/11: This article was reformatted.", "12/09/15: This article was updated to reflect a new Niblock link.", "02/02/21: This article was updated to reflect the current CEOs of Lowe's and Home Depot.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]