["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A recent American Crossroads ad attacks Rep. Ami Bera, D-Calif., for supporting Obamacare.", "Even though Rep. Ami Bera, D-Calif., wasn’t in office when Obamacare passed, a pro-Republican ad in California’s seventh congressional district is using the law to attack him.", "Bera is running against Republican Doug Ose for a second term, and it’s a tight race. Less than six months into his first term, Bera voted against repealing the Affordable Care Act, and American Crossroads, Karl Rove’s conservative political action committee, used this fact to appeal to California seniors in a recent ad.", "\"Bera voted to keep Obamacare, which cut $716 billion from Medicare, slashing Medicare Advantage,\" the ad’s narrator says. \"Now California seniors face benefit cuts of over $1,700.\"", "Many times, we’ve rated the claim that there are $716 billion in Medicare cuts as Half True. But we hadn’t heard claims about specific benefit cuts by state before, so we decided to check it out.", "We found that the claim that California seniors will see $1,700 in benefit cuts as a result of the Affordable Care Act is misleading. The statistic comes from a report that ignores critical context and evidence that the law has expanded Medicare’s benefits packages.", "Advantages", "We should first note that the statistic comes from an April 2014 report by the American Action Forum, and they have a stake in the election. The American Action Forum is an arm of the American Action Network, which is a conservative political nonprofit with financial ties to the Koch brothers. According to the Center for Responsive Politics, the group shares office space with American Crossroads -- the group that produced the very ad we’re checking.", "Now to the claim. The ad makes it sound like all California seniors will face cuts to this degree. However, the report only addresses Medicare Advantage. About one-third of seniors use Medicare Advantage, which is a private coverage option.", "Medicare Advantage plans are required to provide at minimum the same array of benefits as traditional Medicare. Many Advantage plans offer extra benefits -- things like gym memberships, vision exams or generous cost-sharing -- that have contributed to escalating program costs.", "The creators of Medicare Advantage thought that letting seniors choose plans from private insurance providers would be more cost-effective than traditional Medicare. But Advantage has turned out to be more expensive. Medicare paid insurers about 114 percent more for Advantage plans than for traditional plans, as of 2009 before enactment of the federal health care law.", "The law attempted to close that gap in part by gradually reducing how much Medicare pays Advantage plan providers. It was estimated that its changes would slow down spending on Medicare by about $716 billion over 10 years, and Medicare Advantage cost-saving measures accounted for about one-third of that. (Though the Obama administration has reversed these cuts for the past two years -- facing pressure from insurance providers, Republicans and some Democrats, including Bera.)", "Critics argue that the cuts will force insurance providers to reduce the benefits they offer to Medicare Advantage enrollees. However, Medicare Advantage plans are still required to offer, at minimum, the same level of benefits as traditional plans. And Obamacare includes language protecting that set of guaranteed benefits from shrinking.", "In fact, the law expanded Medicare’s required benefits to include certain preventative services, annual visits, closing a gap in prescription coverage and more.", "Additionally, the law rewards Medicare Advantage providers with financial bonuses to encourage quality and cost-efficiency. Providers are required to use the bonuses to offer extra benefits, attracting more enrollees. Nearly all Medicare Advantage plan providers received these bonuses in 2012, according to the Kaiser Family Foundation.", "A matter of speculation", "It’s possible that Medicare Advantage providers could respond to their pay cut by reducing benefits, but the only benefits they could cut would be those extra benefits that go beyond Medicare plan requirements.", "\"It's not automatic and won't affect every (Advantage) enrollee or any of the (traditional Medicare) enrollees,\" said Dylan Roby, an expert in health economics at the University of California Los Angeles Center for Health Policy Research.", "Insurance providers could also  respond to lower payments by offering the same benefits while operating more efficiently. They could cut administrative costs, adjust cost-sharing plans, take in less profit or drop out of the market altogether.", "But, according to the Kaiser Family Foundation, the Department of Health and Human Services and more, insurance providers’ response to the cuts has been less dramatic than was expected when Obama signed the legislation in 2010. In fact, Medicare Advantage enrollment is at an all-time high, and the percentage of plans with four or more stars in the program’s five-star rating system is increasing.", "\"When Congress debated the payment reductions in 2010, forecasters and analysts also projected that reductions would drive insurers to raise premiums, cut extra benefits and even pull out of the Medicare Advantage market,\" Kaiser experts wrote in May. \"Thus far, however, the response by insurers to the (Affordable Care Act) cuts has been more muted.\"", "Health and Human Services reported in fall 2013 that \"The average number of plan choices will remain about the same in 2014 and access to supplemental benefits remains stable.  Since passage of the Affordable Care Act, average MA premiums are down by 9.8 percent.\"", "Experts also told us that they haven’t seen evidence of reduced Medicare Advantage cuts.", "\"The evidence is that plan participation has been stable, premiums have been stable or even a little bit lower, and there are no overall changes in the benefits provided,\" said Jack Hoadley, a research professor at Georgetown University and a member of the nonpartisan Medicare Payment Advisory Commission.", "\"In my view, the claims in this advertisement are misleading,\" Hoadley added. \"Seniors have not faced benefit cuts in Medicare Advantage, even though the plans (and providers) have to manage with somewhat lower payments.\"", "So how did the American Action forum report come up with their estimated benefit cut figures?", "The American Action Forum report breaks down the reduction in Medicare payments to Advantage plan providers by state and county. It says, compared to pre-Obamacare, Medicare Advantage benefits in California are down $1,718 per beneficiary.", "We asked several experts to take a look at the report, and they told us that it is misleading because it assumes that Obamacare’s spending reductions directly results in reduced benefits.", "Yes, Obamacare reduces Medicare’s spending per Advantage beneficiary, but this does not necessarily mean fewer benefits for seniors with Advantage plans. Like we said before, there are multiple ways that an insurance provider can deal with the spending cuts other than slimming down its offerings.", "\"To immediately treat it as a cut to benefits is an exaggeration,\" said Judith Feder, a professor of health policy at Georgetown University.", "Our ruling", "American Crossroads said that as a result of Obamacare, \"California seniors face benefit cuts of over $1,700.\"", "First of all, this claim is misleading because it makes it seem like all seniors will face these cuts, when the statistic actually refers to Medicare Advantage enrollees -- only about one-third of seniors.", "The statistic comes from a report that assumes all reductions in Medicare Advantage spending results in fewer benefits for enrollees. While insurance providers feel the cuts, there are multiple ways for them to respond other than reducing benefits, such as trimming administrative costs. We heard from multiple experts and researchers who said Medicare Advantage benefits have remained stable.", "The ad also leaves out the fact that the federal health care law expanded Medicare’s minimum required benefits and established incentives for Advantage plans to provide extra benefits.", "It’s possible that some Medicare Advantage enrollees could see their benefits shrink, but this ad blows that possibility out of proportion and ignores important context. We rate this claim False.", "American Crossroads, \"See Right Through,\" Oct. 28, 2014", "American Action Forum, \"Medicare Advantage Cuts in the Affordable Care Act: April 2014 Update,\" April 17, 2014", "Washington Post, \"The Medicare Advantage Scam,\" Oct. 15, 2009", "Washington Post, \"Romney’s right: Obamacare cuts Medicare by $716 billion. Here’s how,\" Aug. 14, 2012", "AARP, \"Is your Medicare Safe?\" Jan. 2014", "Kaiser Family Foundation, \"Medicare Advantage Plan Star Ratings and Bonus Payments in 2012,\" Nov. 1, 2012", "Kaiser, \"Medicare Advantage: Take Another Look,\" May 7, 2014", "Kaiser Health News, \"Decoding The High-Stakes Debate Over Medicare Advantage Cuts,\" April 7, 2014", "HHS, \"Issue Brief: the Medicare Advantage program in 2014,\" April 7, 2014", "HHS, \"More, higher quality options for seniors in Medicare Advantage,\" Sept. 19, 2013", "Email interview, Dylan Roby, expert in health economics at the UCLA Center for Health Policy Research, Oct. 28, 2014", "Email interview, Jack Hoadley, research professor at Georgetown University, Oct. 29, 2014", "Email interview, Don Taylor, professor of health policy at Duke University, Oct. 28, 2014", "Phone interview, Judith Feder, professor of health policy at Georgetown, Oct. 28, 2014", "Email interview, American Crossroads spokesman Paul Lindsay, Oct. 28, 2014", "Email interview, Bera spokeswoman Allison Teixeira, Oct. 29, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]