["About this rating", "Hillary Clinton told MSNBC's Chris Matthews that \"we didn't lose a single person\" in response to a question about U.S. activity in Libya.", "Hillary Clinton 'forgot' about or declined to mention the four Americans killed in the 2012 attack in Benghazi, Libya.", "On the evening of 11 September 2012, Islamic militants attacked the American diplomatic compound in Benghazi, Libya, killing U.S. Ambassador J. Christopher Stevens and U.S. Foreign Service Information Management Officer Sean Smith. Several hours later, a second assault by militants that targeted a different U.S. facility about one mile away from the diplomatic compound resulted in the deaths of CIA contractors Tyrone S. Woods and Glen Doherty.", "This event (commonly referred to as the \"Benghazi attack,\" the \"Battle of Benghazi,\" or simply \"Benghazi\") is one that has been raised frequently by opponents of Democratic presidential candidate Hillary Clinton. Critics contend that Clinton, who was the U.S. secretary of state at the time of the attack, failed to take proper measures to ensure the safety of American personnel stationed in Benghazi and has declined to accept responsibility for the incident ever since.", "This subject once again reared its head during the 2016 presidential campaign, when Hillary Clinton appeared on MSNBC and in response to a question from interviewer Chris Matthews, asserted that \"we didn't lose a single person\" in Libya. Clips of that appearance were quickly posted on YouTube and circulated via social media, along with messages mocking and deriding Clinton for supposedly \"forgetting\" about (or glossing over) the deaths of four Americans in Benghazi:", "However, such clips featured only a 53-second long truncated portion of Clinton's remarks (beginning with Clinton's defending U.S. actions in Libya, and concluding abruptly with the \"didn't lose a single person\" statement), thereby eliminating vital context. The entire segment was over eleven minutes long and began with Matthews' first challenging Clinton about her vote for war in Iraq before shifting (at about the 5:47 mark) to ask her about her support for military intervention in Libya.", "The truncated clip began (at approximately the 8:11 mark) directly after Clinton told Matthews that U.S. intervention in Libya had concluded with \"eventually defeating [Libyan leader Muammar Gaddafi] and his forces\":", "Viewing the clip in its entirety reveals that the discussion between Clinton and Mathews regarding Libya revolved around a multinational military intervention in that country which began in March 2011 and concluded seven months later, well before the attack on the American diplomatic compound in Benghazi took place:", "American, French and British military forces, convinced that [Libyan leader Muammar] Gadhafi was not adhering to a United Nations-mandated cease-fire, hammered Libyan military positions with missiles and fighter jets in the first phase of an operation that will include enforcement of a no-fly zone.", "More than 110 Tomahawk missiles fired from American and British ships and submarines hit about 20 Libyan air and missile defense targets in western portions of the country, U.S. Vice Adm. William Gortney said at a Pentagon briefing.", "The salvo, in an operation dubbed \"Odyssey Dawn,\" was meant \"to deny the Libyan regime from using force against its own people,\" said Gortney ... Earlier, French fighter jets deployed over Libya fired at a military vehicle Saturday, the first strike against Gadhafi's military forces, which earlier attacked the rebel stronghold of Benghazi.", "Prime Minister David Cameron said that British forces also are in action over Libya. \"What we are doing is necessary, it is legal and it is right,\" he said. \"I believe we should not stand aside while this dictator murders his own people.\"", "Without the original context, it wasn't clear to viewers that Clinton was referring to a military action in Libya that took place during a particular timeframe. She didn't \"forget\" about or ignore the four American deaths in Benghazi; rather, she was specifically discussing events that took place prior to the Benghazi attack. The truncated version of the video effectively cut out Clinton's explanation and justification of U.S. military intervention in Libya in 2011, as well as the context that her remarks were completely unrelated to Benghazi.", "Clinton's comments ended abruptly in the truncated video directly before she clarified the context of her statements. Just as Clinton's reference to the end of the Gaddafi regime was chopped from the start of clip, so was the portion of her statement following \"we didn't lose a single person\":", "We didn't have a problem in supporting our European and Arab allies [during the 2011 intervention in Libya] ... in working with NATO ... and now we've gotta support the Libyan people.", "Had the second part of Clinton's response not been cut from the more widely viewed truncated clip, it would have been clearer to viewers that the former secretary of state was referencing the 2011 NATO military intervention in Libya. The attack in Benghazi during which four Americans were killed occurred on 11 September 2012, nearly a year after military action in Libya involving the United States and other NATO allies officially concluded on 31 October 2011.", "Clinton had already come under fire for a separate portion of the same interview, unrelated to United States intervention in Libya. Immediately after the segment aired, she was falsely accused of \"admitting\" that she had accepted a tacit bribe from the White House in exchange for her vote in support of a U.S. invasion of Iraq.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]