["About this rating", "In early August 2018 social media users began sharing a quote ostensibly uttered by House Minority Leader Nancy Pelosi concerning a nonsensical connection between a national push to ban single-use plastic straws for environmental reasons, and gun control: \"The plastic straw ban is important for gun control. It stops pea shooting and spitballing which are gateway guns.\"", "Although this statement was featured in a number of memes and Facebook posts, it was never accompanied by any information about where and when Pelosi supposedly made this pronouncement. The reason for this lack of evidence, of course, is that Pelosi never actually said any such thing.", "This quote did not originate with reporting by a credible news organization or a transcript of an interview, speech, or press conference. Rather, it was manufactured in an attempt to paint Pelosi as an foolish, crazy, or just plain out-of-touch politician.", "We've encountered a number of fake quotes that were shared with similar intentions. These quotes rarely reflect politicians' actual words or beliefs; instead, they're intended to reinforce existing negative perceptions of those figures. These fabrications are often shared with clarifying statements opining that although the offered quote may be a fake, it \"might as well be real\" because it \"sounds like something [that person] would say\":", "\"The plastic straw ban is important for gun control. It stops pea shooting and spitballing which are gateway guns.\" - Nancy Pelosi ????\n??It really sounds like something she would say..???‍♀️ pic.twitter.com/hXzFjvb9sV", "— #LockThemAllUp?? {⭐️} (@Ldaught2) August 5, 2018", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]