["The photo of the painted rock was posted here on Facebook on December 5, 2019, where it has been shared more than 2,000 times.", "Below is a screenshot of the Facebook post:", "The Sinhala text in the image, translated to English, reads:  \"You thought it was a shark, right? No, this is a painting done by a group of our boys on a rock in Jungle beach\"", "The post’s caption reads: “?Our boys\"", "The claim that the painting is on Jungle beach, which is roughly 140 kilometers south of the capital Colombo, was also posted on Facebook here and here.", "But the claim is false; the painting is actually located in Goa, a southern state in India, and was completed by an American artist.", "A reverse Google image search of the photo led to this article published on February 12, 2018 titled “Graffiti Artist Transforms a Beach Rock Into a Great White Shark”, which features an image identical to the photograph in the misleading post.", "Below is a screenshot of the article:", "The shark was spray painted on the rock by American artist Jimmy Swift in March 2015 and is located at Palolem Beach in Goa, according to the report.", "The article also links to Swift’s Instagram account, where he  posted the same photo here on March 7, 2017.", "The photo, Swift’s caption states, was taken after he repainted the rock following two years of fading.", "Below is a screenshot comparison of the misleading post (R) and Swift’s instagram post (L):", "In addition, Swift posted a photo of the art piece on Instagram here on March 7, 2015 after he painted the rock for the first time. The post is geotagged to Palolem Beach..", "“This was the hardest thing I've ever painted. I was literally beat up by the waves and rising tide and forced to stop before it was finished,” Swift wrote in the post’s caption. “When I first saw this rock it looked like a perfect place for a great white. Hopefully it doesn't scare the sh** out of people!”", "The shark painting is also featured in Swift’s official website, as seen in the screenshot below:", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]