["By Saranac Hale Spencer", "Posted on May 22, 2018", "Q: Did the school shooter in Santa Fe, Texas wear an Antifa insignia?", "A: No. There is no evidence that he was a member of that loose organization of activists.", "Officials are still investigating the shooting that left 10 dead and 13 wounded at Santa Fe High School in Texas. They haven’t disclosed a motive.", "Since the shooting on May 18, there has been no evidence to indicate that the alleged shooter, 17-year-old Dimitrios Pagourtzis, was connected to the loosely organized group of anti-fascist activists called Antifa.", "But a video from Mike Cernovich — who is best known for spreading the bogus “Pizzagate” conspiracy theory — has spawned several headlines on Facebook like these: “Santa Fe high school shooter has Antifa hammer and sickle, Iron Cross, Satanic Star pins on trench coat” and “Santa Fe School Shooter’s ANTIFA Connections Discovered!”", "Facebook users rightly flagged the stories as potentially false.", "In his hour-long video, Cernovich says at one point, “I didn’t say Antifa did it.  I’m just simply observing that the shooter was wearing a symbol of Antifa,” the post is titled: “Texas Shooter Wore ANTIFA Hammer-and-Sickle Gang Logo.”", "But, to the extent that it has a logo at all, Antifa usually uses a graphic of two single-color flags, one red and one black. The hammer and sickle is a communist symbol associated with the former the Soviet Union.", "A pin featuring a hammer and sickle did sit on the collar of a trench coat pictured on a now-deleted Facebook page that had belonged to Pagourtzis. It was the same style pin that Columbine High School shooter Dylan Klebold wore on his combat boot when he and Eric Harris gunned down 13 students and staff in 1999.", "Texas Gov. Greg Abbott said nothing about the pin when asked during a press conference on the day of the shooting if there had been any warning signs that Pagourtzis may have been dangerous. Abbott said the only sign was a picture on the deleted Facebook page of a T-shirt that said “born to kill.”", "This isn’t the first time that Cernovich, a right-wing personality, has tried to tie Antifa to mass shooters soon after a tragedy. On the same day that 26 people died in a church shooting in Sutherland Springs, Texas, Cernovich tweeted without any evidence: “This is looking more and more like Antifa terror.” We wrote about that claim, too.", "Others on the Internet were also quick to put up false information about Pagourtzis in the immediate aftermath of the shooting. Within hours of the shooting, a fake Facebook page featured a picture of Pagourtzis with an image of a Hillary Clinton campaign hat superimposed on his head and an Antifa banner across the top of the page went up. The page since has been taken down.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk false stories flagged by readers on the social media network.", "Cernovich, Mike. “Texas Shooter Wore ANTIFA Hammer-and-Sickle Gang Logo.” YouTube.com. 18 May 2018.", "“Santa Fe high school shooter has Antifa hammer and sickle, Iron Cross, Satanic Star pins on trench coat” PuppetStringNews.com. 18 May 2018.", "“Santa Fe School Shooter’s ANTIFA Connections Discovered!” Constitution.com. 18 May 2018.", "Anti-Defamation League. “Who are the Antifa?” Accessed 21 May 2018.", "Federal Bureau of Investigation. “Active Shooter Incidents in the United States in 2016 and 2017.” Accessed 21 May 2018.", "Hale Spencer, Saranac. “Texas Shooting Unrelated to Antifa.” FactCheck.org. 8 Nov 2017.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]