["Shifting plans for distributing COVID-19 vaccines are drawing out new criticism for plans to administer the shots.", "In a Facebook post on March 1, comedian and podcaster Adam Carolla took aim at the state of California. “In California the homeless and prisoners are getting the vaccine before taxpayers,” he wrote in the post that about 12,000 users have reacted to. “It sounds like something out of Idiocracy. If that isn’t the most California way of doing things I don’t know what is.”", "Advocates have fought for those populations to be prioritized because they live in close quarters, such as homeless shelters, and cannot easily maintain social distance.", "While Carolla is correct that California is administering vaccines to those groups, a shift in the state’s distribution plan in January no longer gave them priority for the vaccine.", "Carolla did not respond to a request for comment.", "Fact check:Israel launching 'Green Pass' for citizens vaccinated against COVID-19", "The first doses of the COVID-19 vaccine arrived in California in mid-December, and the state began vaccinating front-line health care workers soon after.", "California’s initial plan for distributing the vaccine prioritized health care workers before moving on to those 75 and older and workers the state deemed essential, including teachers, first responders and grocery store clerks.", "That first plan also included those experiencing homelessness and state prisoners in the second wave. California started vaccinating prisoners on Dec. 22, according to the Los Angeles Times.", "However, The Sacramento Bee points out thatCalifornia's plan to vaccinate its residents has changed several times since December, and in late January the state adopted a new framework that prioritizes those 65 and older and those working in agriculture and food, education and child care and emergency services in the most recent phase. Starting March 14, the state will vaccinate people between the ages of 16 and 64 who are “at the very highest risk” because of severe health conditions, including cancer, pregnancy, heart conditions and severe obesity.", "Prisoners and homeless people would no longer get preference for vaccines under that change, according to The Bee.", "The new plan doesn’t disqualify prisoners or homeless people from receiving the vaccine if they fall into one of the eligible categories, though. California’s Department of Rehabilitation and Corrections notes on its website that it is prioritizing vaccine distribution under the state health department’s guidelines.", "As of March 1, 40,905 incarcerated people had been vaccinated, along with 25,626 staff members, according to the department's website. At that time, the state had 94,586 people in custody and 89,892 in prisons.", "\"We are prioritizing vaccine distribution in a manner that is consistent with CDPH guidelines. It is our intent to offer COVID-19 vaccinations to all CDCR and CCHCS employees and incarcerated individuals,\" said Liz Gransee, the department's deputy director of communications, in an email.", "About three of every four people incarcerated in California have either received the first dose of the vaccine or been infected with the virus as of Feb. 8, according to the Los Angeles Times.", "Data showing the number of vaccines that have gone to homeless people, though, is harder to find.", "“Unfortunately, while there is good data on prison populations and COVID-19 vaccine administration, we don’t have good data on vaccine administration and people experiencing homelessness,” said Barbara DiPietro, senior director of policy for the National Health Care for the Homeless Council, in a prepared statement.", "The claim that California is vaccinating prison inmates and the homeless against COVID-19 before others is MISSING CONTEXT, because without additional information it could be misleading. While it’s true that the state is administering the vaccine to those populations, California shifted its vaccine distribution plan in January. The new plan does not prioritize those groups.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook."]