["In an interview with the AP, the president stretched the facts on China, his border wall and job creation.", "By Eugene Kiely, Robert Farley and Lori Robertson", "Posted on April 25, 2017 | Corrected on October 27, 2017", "In an interview with the Associated Press, President Donald Trump put some spin on what he has done — and hasn’t done — as he nears the completion of his first 100 days in office:", "The president also repeated several false and misleading claims, including taking too much credit for job creation.", "The Associated Press interviewed Trump in the Oval Office on April 21, and published a transcript of the interview on April 24. The interview comes as the president nears completion of his first 100 days in office — which will occur on April 29 — and dealt in part with the promises he made during the campaign.", "During the campaign, Trump issued a “100-day action plan to Make America Great Again.” One of those promises dealt with China’s history of devaluing its currency to gain a trade advantage. In his action plan, Trump said on his first day in office he would “direct my Secretary of the Treasury to label China a currency manipulator.”", "That has not happened. In fact, the Treasury Department issued a report on April 14 that declined to label China a currency manipulator.", "The president told the Associated Press that “things change” and he needs “flexibility” once he takes office. He said the decision was in part political, as he is trying to convince China to lean on North Korea to halt its nuclear weapons program.", "But then he twisted the facts about China’s history of devaluing its currency.", "Trump said he decided not to label China a currency manipulator, in part, because it has not manipulated its currency since he took office. Trump claimed credit for that, saying “there’s a certain respect” that China’s President Xi Jinping has for him and “he knew I would do something” if China devalued its currency.", "In fact, China has not been devaluing its currency to create a trade advantage since 2014, years before Trump took office.", "Trump, April 21: But [Chinese] President Xi, from the time I took office, he has not, they have not been currency manipulators. Because there’s a certain respect because he knew I would do something or whatever. But more importantly than him not being a currency manipulator the bigger picture, bigger than even currency manipulation, if he’s helping us with North Korea, with nuclear and all of the things that go along with it, who would call, what am I going to do, say, “By the way, would you help us with North Korea? And also, you’re a currency manipulator.” It doesn’t work that way. …", "And the media, some of them get it, in all fairness. But you know some of them either don’t get it, in which case they’re very stupid people, or they just don’t want to say it. You know because of a couple of them said, “He didn’t call them a currency manipulator.” Well, for two reasons. Number One, he’s not, since my time. You know, very specific formula. You would think it’s like generalities, it’s not. They have — they’ve actually — their currency’s gone up. So it’s a very, very specific formula. And I said, “How badly have they been,” … they said, “Since you got to office they have not manipulated their currency.” That’s Number One, but much more important, they are working with us on North Korea.", "As the Washington Post explained, “The value of a currency is determined by supply and demand, and currency manipulation occurs when a country buys or sell [sic] large amounts of its own currency on global markets to change the price. But U.S. policy is really directed at countries that sell large volumes of their own currency to lower its price — a practice that makes a country’s exports relatively cheap on global markets, hurting American exporters. In previous years, when China artificially lowered the value of its currency, it helped the country export products to the United States, and U.S. industries and workers balked at what they saw as an unfair competitive edge.”", "The Treasury report found that “after engaging in one-way, large-scale intervention to resist appreciation of the RMB [the Chinese currency] for a decade, China’s recent intervention in foreign exchange markets has sought to prevent a rapid RMB depreciation that would have negative consequences for the United States, China, and the global economy.”", "Moreover, the report notes that China’s “lack of intervention to resist appreciation” has been occurring “over the last three years.” In other words, China didn’t make a change in its policy since Trump took office, or because — as Trump said — of a perceived threat that Trump would “do something.”", "Economists broadly agree that China has not been holding down its currency since 2014 or 2015.", "“The accusation that China is manipulating its currency in order to gain an unfair advantage for its exports is not supported by economic facts,” Eswar Prasad, a professor of trade policy at Cornell University and formerly head of the IMF’s China Division, told us in an email. “Since mid-2014, the Peoples’ Bank of China (PBC, China’s central bank) has in fact been intervening in currency markets to prevent the renminbi (RMB) from falling too sharply in value against the dollar. Over the past three years, China has burnt up $1 trillion of its stock of foreign exchange reserves in order to support its currency and prevent it from depreciating as much and as fast as market forces seem to want.”", "“Thus, China has, if anything, been doing the U.S. a favor by not letting the RMB depreciate as much and as fast against the dollar as indicated by market pressures,” Prasad said. “The reason it has done this is largely to forestall any domestic financial instability from panic-driven capital outflows if it were to allow the RMB to depreciate a lot, especially over a short period.”", "Brad Setser, a senior fellow and acting director of the Maurice R. Greenberg Center for Geoeconomics at the Council on Foreign Relations, said conventional wisdom is that China shifted from buying reserves to selling reserves several years ago.", "“If by manipulation, you mean – when did China stop accumulating reserves to hold its currency down, it stopped manipulating in 2014 or 2015,” Setser told us via email.", "But Setser said the issue is made more complex, “because China has held its currency relatively stable against the dollar this year, and that is arguably a change (though holding the currency stable against the dollar has been relatively easy for China because the dollar has been relatively stable or even weakened a bit against the other big currencies).”", "Some consider manipulation to mean any government intervention in the market at all, not just depreciating currency, Setser said.", "But it is clear from Trump’s statements that he was concerned about China holding down its currency to gain a trade advantage, to the detriment especially of U.S. manufacturers. Economists say that’s exactly what China was doing for more than a decade, but as Eduardo Porter put it for the New York Times, “Trump Isn’t Wrong on China Currency Manipulation, Just Late.”", "Trump said his decision to not label China a currency manipulator was partly political, since he is trying to convince China to pressure North Korea to halt its nuclear weapons program. We take no position on that.", "But Trump’s claim that China stopped manipulating its currency when he took office — and more, that it did so “because there’s a certain respect, because [Xi] knew I would do something or whatever” — is another example of Trump taking credit for something that long predates his presidency.", "During the campaign, Trump also promised to build a “big, fat beautiful wall” along the southern border. In his 100-day action plan, Trump said he would work with Congress to fully fund the wall “with the full understanding that the country Mexico will be reimbursing the United States for the full cost of such wall.”", "The U.S. Customs and Border Protection, as we will explain later, has moved forward with the project, so that promise is a work in progress.", "But in the AP interview, Trump lowballed the estimated cost of the project, claiming it will cost “$10 billion or less.”", "Trump, April 21: Well, first of all, the wall will cost much less than the numbers I’m seeing. I’m seeing numbers, I mean, this wall is not going to be that expensive.", "Associated Press: What do you think the estimate on it would be?", "Trump: Oh I’m seeing numbers — $24 billion, I think I’ll do it for $10 billion or less. …  The opponents are talking $25 billion for the wall. It’s not going to cost anywhere near that.", "Associated Press: You think $10 billion or less.", "Trump: I think $10 billion or less. And if I do a super-duper, higher, better, better security, everything else, maybe it goes a little bit more. But it’s not going to be anywhere near (those) kind of numbers.", "We can’t predict the future, but the estimates to date have been much higher than $10 billion:", "The cost of the wall will depend on many factors — such as the height and length of the wall, the construction materials used, and whether parts of the wall are substituted with fencing or other barriers.", "Let’s take a look at what the Trump administration envisions and how much it might cost.", "On March 17, U.S. Customs and Border Protection issued two requests for proposals “to acquire multiple conceptual wall designs with the intent to construct multiple prototypes.” One RFP is for a “solid concrete border wall,” and the second RFP is for “other border wall.” For the “other border wall,” the RPF says: “Prototypes constructed in response to this solicitation must offer designs that are alternatives to reinforced solid concrete walls (i.e. no solid concrete external faces).”", "So, we know that the administration is at least considering not just a solid concrete wall, but a combination of walls and other barriers.", "The wall — whether solid concrete or an alternative design — must be between 18 feet and 30 feet tall and 2 feet wide, according to the RFPs. It also must go 6 feet below the ground to prevent people from tunneling under the wall.", "As for the length of the wall, the U.S.-Mexico border is 1,933 miles. But the DHS document obtained by Reuters indicated that the administration will not seek to build new barriers the full length of the border.", "“The plan lays out what it would take to seal the border in three phases of construction of fences and walls covering just over 1,250 miles (2,000 km) by the end of 2020,” Reuters wrote on Feb. 9. “With 654 miles (1,046 km) of the border already fortified, the new construction would extend almost the length of the entire border.”", "The 654 miles of existing barriers is a reference, as we have written before, to the Secure Fence Act of 2006, which called for the construction of 700 miles of fencing and enhanced surveillance technology. In its report, Bernstein Research wrote that under the 2006 law “18ft tall steel ‘primary fencing’ is used in many urban areas … to less substantial ‘vehicle fencing’ in lower-risk areas.”", "The cost of the primary fencing, also known as pedestrian fencing, averaged about $6.5 million per mile under the 2006 law, according to a September 2009 report by the Government Accountability Office. At that per-mile average price (not adjusted for inflation), a 1,250-mile “wall” constructed entirely of pedestrian fencing would cost more than $8 billion.", "More recently, Trump’s chief budget director, Mick Mulvaney, told talk show host Hugh Hewitt in March that the per-mile cost “starts at $8 million per mile” and “goes up to about $25 million per mile.”", "The range of Mulvaney’s per-mile cost estimates would place the total cost at between $10 billion and $31.25 billion for 1,250 miles of walls and fences. Mulvaney added that the total cost “just depends on … what you decide to build in what areas.”", "As we said, Homeland Security estimated that the 1,250-mile combination of fences and walls under the Trump administration plan could cost as much as $21.6 billion.", "Bernstein Research estimated the cost at between $15 billion and $25 billion. The firm — which provided its estimate during the campaign, when Trump gave no details on the size and scope of the project — assumed construction of a 1,000-mile concrete wall at 40 feet tall and 7 feet deep, but only 10 inches thick.", "MIT Technology Review provided its cost estimate in October. The magazine’s cost estimate of between $27 billion and $40 billion assumes construction of a 1,000-mile concrete wall that is 50 feet tall and 10 feet underground — which is taller and deeper than the specifications ordered by DHS, but not as long.", "We don’t know what the wall will cost, but independent analyses and Trump’s own Department of Homeland Security say a border wall could cost twice as much as Trump’s figure.", "In his interview, Trump also repeated claims we have fact-checked before — most of them dealing with his campaign promise to be “the greatest jobs president God has ever created.”", "Trump once again claimed too much credit for job creation, saying, “we create a lot of jobs, 500,000 jobs as of two months ago, and plenty created since.” As we wrote two weeks ago, under Trump, the U.S. job growth has been 317,000 jobs in February and March. That’s according to the Bureau of Labor Statistics.", "The January job numbers  — an additional 216,000 jobs — were based on a survey that was done before Trump was inaugurated.", "This job growth is a continuation of a trend that began pre-Trump: The economy added more than 250,000 new jobs a month in 20 of the 96 months under President Obama, and as of March, the U.S. has had 78 straight months of job growth.", "The president also cited examples of his job creation, and in some cases he took too much credit.", "Trump: As an example, Ford, General Motors. I’ve had cases where the gentleman from China, Ma, Jack Ma [chairman of Alibaba Group], he comes up, he says, “Only because of you am I making this massive investment.” Intel, only because of you. … The press never writes that.", "But, as we’ve written before, investments made by Ford and GM were part of longtime trends and market decisions. Ford CEO Mark Fields, for example, praised Trump’s promises to cut taxes and regulation, but said recent investments in U.S. plants were market-based. Asked on Fox Business News if he would have made the investments had Trump not won the election, Fields said, “Yes, absolutely.”", "As for Intel, we wrote in February that Trump had a stronger case in that instance. The Intel CEO credited Trump’s pro-business policies for a $7 billion investment in an Arizona factory, though Intel had announced a $5 billion investment in that facility in 2011. The project wasn’t completed.", "“We’re making this investment now to meet demand that we now expect,” Intel spokesman William Moss said. “That said, we certainly join other companies in supporting the administration’s pro business and pro investment goals.”", "And Jack Ma, of Alibaba, the e-commerce Chinese company, told Trump in early January that he would add 1 million U.S. small businesses to the online platform over the next five years, a move Alibaba said could add 1 million jobs (one each per small business).", "Trump also again took credit for saving hundreds of millions on the F-35 jet made by Lockheed Martin, savings that were in the works before he was sworn in.", "“[A] little before I took office there was a terrible article about the F-35 fighter jet. It was hundreds of billions of dollars over budget,” he said, going on to say that he called Lockheed and said he would have to “bid this out to another company, namely Boeing” and that “I started getting competing offers back and forth.”", "Trump claimed he saved $725 million. In the past, he has claimed a savings of $600 million. But as the Washington Post‘s Fact Checker found, Air Force Lt. Gen. Christopher Bogdan, the head of the F-35 Joint Program Office, had already announced on Dec. 19 — before Trump met privately with Lockheed CEO Marillyn Hewson — that the cost of the F-35 would come down. His cost reduction estimate came out to $549 million to $630 million, according to the Post’s calculation.", "Aviation Week also wrote that Trump “overstates” his role and that the price reduction on the jet had been “ongoing.”", "In addition, the president rehashed a campaign claim that distorts the facts on the vetting process required for those entering the U.S.", "Trump: We have people allowed into our country with no documentation whatsoever. They have no documentation and they were allowed under the previous administrations, they were allowed into our country.", "Trump didn’t specify that he was talking about refugees, but he indicated he was speaking about his “stance on having people come in to this country that we have no idea who they are and in certain cases you will have radical Islamic terrorism.”", "Throughout the 2016 campaign, Trump made similar claims. For instance, in a late August speech on illegal immigration, he said that Syrian refugees seeking admission to the U.S. have “no documentation” and “no paperwork.” That’s false.", "As we wrote, Barbara Strack, chief of the refugee affairs division of the U.S. Citizenship and Immigration Services, told Congress in October 2015 that “we’ve found with Syrian refugees … in general they have many, many documents.” Documents were also one part of the vetting process, she said. Those applying for refugee status are also interviewed by the U.S. Citizenship and Immigration Services and go through security checks by the National Counterterrorism Center, the FBI’s Terrorist Screening Center, the Department of Homeland Security and the Department of Defense. There’s a health screening and a three-day “cultural orientation,” too.", "Editor’s Note: We will be doing more on Trump’s first 100 days in office later this week, so be sure to return to our website as the new president approaches the milestone.", "Correction, Oct. 27: The U.S. had 78 straight months of job growth through March, not 77 as we originally wrote.", "U.S. Department of the Treasury Office of International Affairs. “Report to Congress: Foreign Exchange Policies of Major Trading Partners  of the United States.” 14 Apr 2017.", "Trump Campaign Website. “Donald J. Trump Contract with the American Voter.”", "Swanson, Ana, and Ehrenfreund, Max. “Trump administration officially declines to label China currency manipulator.” Washington Post Wonkblog. 14 Apr 2017.", "Porter, Eduardo. “Trump Isn’t Wrong on China Currency Manipulation, Just Late.” New York Times. 11 Apr 2017.", "Prasad, Eswar, Cornell University. Email interview with FactCheck.org. 24 Apr 2017.", "Setser, Brad, Council on Foreign Relations. Email interview with FactCheck.org. 24 Apr 2017.", "Finnegan, Michael. “‘It’s going to be a big, fat, beautiful wall!’: Trump’s words make his California climb an even steeper trek.” Los Angeles Times. 3 Jun 2016.", "Edwards Ainsley, Julia. “Exclusive – Trump border ‘wall’ to cost $21.6 billion, take 3.5 years to build: internal report.” Reuters. 9 Feb 2017.", "Rosenberg, Phil et al. “Bernstein Materials Blast: Who Would Profit from The Trump Wall?” Bernstein Research. 15 Jul 2016.", "“CBP Requests Proposals for Border Wall Prototypes.” Press release. U.S. Customs and Border Protection. 17 Mar 2017.", "“Solid Concrete Border Wall RFP.” Request for proposal. U.S. Customs and Border Protection. 17 Mar 2017, updated 1 Apr 2017, accessed 25 Apr 2017.", "“Other Border Wall RFP.” Request for proposal. U.S. Customs and Border Protection. 17 Mar 2017, updated 1 Apr 2017, accessed 25 Apr 2017.", "“U.S. Census Bureau, Statistical Abstract of the United States: 2011. Table 359 — U.S.–Canada and U.S.–Mexico Border Lengths.” U.S. Census Bureau. Accessed 25 Apr 2017.", "Farley, Robert. “Cherry-picking Pryor on Border Security.” FactCheck.org. 6 Aug 2014.", "U.S. Government Accountability Office. “Secure Border Initiative.” GAO. Sep 2009.", "Dinan, Stephen. “Trump’s border wall is estimated to cost $8 million to $25 million per mile.” Washington Times. 6 Mar 2017.", "“Donald Trump: ‘I will be greatest jobs president God ever created’ – video.” The Guardian. 16 Jun 2015.", "Gore, D’Angelo. “Trump Takes More Undue Credit.” FactCheck.org. 12 Apr 2017.", "U.S. Department of Labor. “Employment, Hours, and Earnings from the Current Employment Statistics survey (National).” Accessed 25 Apr 2017.", "Farley, Robert. “Trump: Jobs Returning ‘Because of Me’.” FactCheck.org. 21 Jan 2017.", "Henderson, Peter et al. “Alibaba’s Ma meets Trump, promises to bring one million jobs to U.S.” Reuters. 10 Jan 2017.", "Ye Hee Lee, Michelle. “Trump’s claim taking credit for cutting $600 million from the F-35 program.” Washington Post. 31 Jan 2017.", "Seligman, Lara. “Trump Exaggerates Role In F-35 Price Reduction.” Aviation Week. 30 Jan 2017.", "Kiely, Eugene et al. “Trump Still Off on Immigration.” FactCheck.org. 1 Sep 2016.", "U.S. Senate Committee on the Judiciary. “Oversight of the Administration’s FY 2016 Refugee Resettlement Program: Fiscal and Security Implications.” Hearing. 1 Oct 2015.", "Farley, Robert. “Cruz Misquotes Clapper on Refugees.” FactCheck.org. 8 Oct 2015.", "FactCheck.org Rating:", "Read More", "FactCheck.org Rating:", "Read More", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]