["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "President Donald Trump’s unfounded allegations that millions voted illegally in 2016 is back in the news, with his supporters pointing to a new analysis that claims millions of undocumented immigrants voted in 2008.", "Fox and Friends co-host Ainsley Earhardt talked about it on the morning show recently.", "\"5.7 million -- that’s how many illegal immigrants might have voted\" in 2008, she said. Her comments referenced an article in the Washington Times, a conservative newspaper.", "Trump has made repeated claims about massive voter fraud and election rigging, which we’ve debunked again and again and again and again and again and again and again (and we debunked a claim by his spokesman Sean Spicer).", "The claim made on Fox and Friends is based on an extrapolation of a controversial study that relied on a very small number of responses. Researchers involved in the underlying survey of voters have cautioned against using their data to reach conclusions about noncitizen voters.", "We emailed a spokeswoman for Fox News and did not get a reply; however, the Washington Times article showed that the information came from Just Facts, a think tank that describes itself as conservative/libertarian and was founded by James D. Agresti, a mechanical engineer in New Jersey.", "Agresti’s conclusions are based on data from a paper by Old Dominion University researchers who used data from the Cooperative Congressional Election Study, or CCES. He multiplied the findings in that data with U.S. Census Bureau estimates of the noncitizen population to come up with a conclusion about the number of noncitizen voters nationwide.", "It’s important to note that the CCES researchers have disputed the conclusions Old Dominion researchers reached about noncitizen voters.", "Here’s how the studies unfolded: In 2008, the CCES surveyed 32,800 adults nationwide online about their political views. Respondents answered at least 100 questions before they made it to the citizenship question, one of the last questions asked.", "The survey showed that 339 identified themselves as noncitizens -- about 1 percent of the total respondents. Then of the 339 self-identified noncitizens, 39 of those claim to have voted, said Brian Schaffner, a political science professor at the University of Massachusetts Amherst, one of the main researchers.", "That’s 39 respondents out of 32,800 people who are now being used to extrapolate millions of illegal voters. Schaffner has warned that with a subset that small, the responses might be unreliable.", "\"Survey respondents occasionally select the wrong response by accident—perhaps because they are rushing through and not reading the questions carefully, because they do not fully understand the terminology being used, or because they simply click on the wrong box on the page,\" Schaffner wrote in a Politico magazine article after the November election.", "Subsequent CCES surveys provide more evidence that some respondents answered the question wrong. There were 20 respondents who identified themselves as citizens in 2010 but then in 2012 changed their answers to indicate that they were noncitizens, which Schaffer said is \"highly unrealistic.\"", "In 2014, researchers at Old Dominion University used the CCES data in 2008 and 2010, as well as voter records in 2008, to conclude that more than 14 percent of noncitizens indicated that they were registered to vote. Their best guess at the portion of noncitizens who voted was about 6.4 percent, or 1.2 million votes cast.", "The researchers at CCES (including Schaffner; Stephen Ansolabehere, a Harvard political scientist; and Samantha Luks, managing director of scientific research at YouGov) have criticized the methodology used by Old Dominion.", "They said it didn’t fully consider the possibility that people responded to the survey inaccurately.", "\"You are ignoring the measurement error in a very small group which is going to inflate those numbers,\" Schaffner said, \"then you assume this is a random sample of all noncitizens in the country, which it probably isn’t.\"", "More than 100 political scientists from universities and colleges wrote an open letter in January disputing the Old Dominion paper as evidence for Trump’s claim that millions of noncitizens voted.", "\"In a survey as large as the CCES, even a small rate of response error (where people incorrectly mark the wrong item on a survey) can lead to incorrect conclusions,\" they wrote. \"The scholarly political science community has generally rejected the findings in the Richman et al. study and we believe it should not be cited or used in any debate over fraudulent voting.\"", "Jesse Richman, one of the Old Dominion researchers and a political science professor, told PolitiFact he still stands by his research and responded to the criticisms by CCES researchers in a working paper in February.", "Agresti of Just Facts, the source of the numbers cited on Fox and Friends, used the same data from CCES and Old Dominion and concluded that between 594,000 to 5.7 million noncitizens voted illegally in the 2008 election. Agresti said his number on the high end of his range was higher than Old Dominion because he used different methodology in his calculations.", "Setting aside surveys, another way to find noncitizen voters is to examine state voter records and compare that with data about immigration status. But states have struggled with attempts to do that. Florida tried before the 2012 election and scrapped the effort amid many errors.", "We interviewed other election experts: Rick Hasen, an election law expert at the University of California, Irvine; Lorraine Minnite, political science professor at Rutgers University; and Justin Levitt, a professor at Loyola Law School in Los Angeles who has tracked voter fraud allegations since 2000.", "All three rejected Agresti’s conclusions.", "There have been some instances of noncitizens voting, but actual evidence has shown small numbers among millions of votes cast nationwide. Kansas Secretary of State Kris Kobach, who co-chairs Trump’s voter fraud commission, has obtained a total of one conviction for noncitizen voting since 2015.", "North Carolina’s 2016 post-election audit showed a few dozen noncitizen voters out of 4.8 million votes cast. Ohio Secretary of State Jon Husted announced in February that since he took office in 2011, he has identified 126 noncitizens who cast ballots.", "Fox and Friends co-host Ainsley Earhardt said, \"5.7 million -- that’s how many illegal immigrants might have voted\" in 2008.", "The number comes from a conclusion by Just Facts, a conservative/libertarian think tank. Just Facts’ numbers came from a study by Old Dominion University researchers. That study was based on a survey which showed that 39 people out 32,800 claimed to be noncitizens who had voted. Just Facts used data from the study and Census estimates on the noncitizen population to come up with a national figure of noncitizen voters.", "But other researchers and political scientists have said the small number is not a reliable source of data on noncitizen voters nationwide.", "We rate this claim False.", "'", "Fox and Friends, June 20, 2017", "Just Facts, Immigration, Accessed June 21, 2017", "Old Dominion University political science professor Jesse Richman, \"A Valid Analysis of a Small Subsample: The Case of Non-Citizen Registration and Voting,\" Feb. 7, 2017", "Old Dominion University, \"Some thoughts on noncitizen voting,\" Oct. 19, 2016", "Cooperative Congressional Election Study, Accessed June 21, 2017", "Open letter by political scientists to President Donald Trump, January 2017", "Washington Times, \"Study supports Trump: 5.7 million noncitizens may have cast illegal votes,\" June 19, 2017", "Washington Times, \"Noncitizen voters feud between academics resurfaces with fraud probe,\" Feb. 13, 2017", "Electoral Studies, \"The perils of cherry picking low frequency events in large sample surveys,\" 2015", "Kansas Secretary of State Kris Kobach, Press release, April 12, 2014", "Ohio Secretary of State Jon Husted, \"Investigation uncovers non-citizens who registered to vote and illegally cast ballots,\" Feb. 27, 2017", "Politico Magazine op-ed by University of Massachusetts political scientist Brian Schaffner, \"Trump’s Claims About Illegal Votes Are Nonsense. I Debunked the Study He Cites as ‘Evidence,’\" Nov. 29, 2016", "Huffington Post, \"New Study Suggests Over 5 Million Could Have Voted Illegally In 2008. Here’s Why It’s Doubtful,\" June 20, 2017", "PolitiFact, \"Donald Trump's Pants on Fire claim that millions of illegal votes cost him popular vote victory,\" Nov. 28, 2016", "PolitiFact, \"Fact-check: Did 3 million undocumented immigrants vote in this year's election?\" Nov. 18, 2016", "PolitiFact, \"Donald Trump's Pants on Fire claim of 'large scale voter fraud,’\" Oct. 17, 2016", "PolitiFact Wisconsin, \"Which happens more: People struck by lightning or people committing voter fraud by impersonation?,\" April; 7, 2016", "PolitiFact, \"Donald Trump wrongly says 14 percent of noncitizens are registered to vote,\" Oct. 24, 2016", "PolitiFact, \"Trump's election commission chair Kris Kobach says immigration data not bounced against voter rolls,\" May 23, 2017", "Washington Post, \"Recidivism Watch: Spicer uses repeatedly debunked citations for Trump’s voter fraud claims,\" Jan. 24, 2016", "Washington Post, \"Could noncitizens decide the November election?\" Oct. 24, 2014", "Washington Post, \"Methodological challenges affect study of noncitizens’ voting,\" Oct. 27, 2014", "Washington Post, \"Are noncitizens following American election laws?\" Oct. 31, 2014", "Washington Post, \"Trump thinks noncitizens are deciding elections. We debunked the research he’s citing,\" Oct. 19, 2016", "Interview, James Agresti, Just Facts president, June 21, 2017", "Interview, Brian Schaffner, a political science professor at the University of Massachusetts Amherst, June 21, 2017", "Interview, Stephen Ansolabehere, Harvard government professor, June 21, 2017", "Interview, Richard Hasen, law professor at the University of California, Irvine, June 21, 2017", "Interview, Lorraine Minnite, political science professor at Rutgers University who wrote The Myth of Voter Fraud, June 21, 2017", "Interview, Justin Levitt, Loyola Law School professor and Associate Dean for Research, June 21, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]