["Alt News has received several requests on its official Android application to fact-check a letter circulating on social media. The letter is a supposed order issued by the Tourism Ministry which says that hotels and restaurants will remain closed till October 15.", "The order also says that “all tourism departments of India” have been informed. At one point, it specifically talks about closing north Indian hotels, restaurants and resorts. It also says that in case of any violation, a case will be filed against the owner of the property.", "First of all, the supposed order is replete with spelling and grammatical errors which is unusual for any official document. The order also mentions a website – indiantourism.org – which doesn’t exist. The official website of the Tourism Ministry is tourism.gov.in. All government websites either end with ‘.gov’ or ‘.nic’.", "With a keyword search on Google, we couldn’t find any news report which said that hotels, restaurants, and resorts will remain closed till October 15. Press Information Bureau of India’s fact-checking handle on Twitter had called out the misinformation and dubbed the order as fake. “The order is Fake and has NOT been issued by Ministry of Tourism.” reads the tweet.", "Be cautious of #Fake order claiming that hotels/resturants will remain closed till 15th October 2020 due to #Coronavirusoutbreak.#PIBFactCheck: The order is Fake and has NOT been issued by Ministry of Tourism.", "Do not believe in rumours! pic.twitter.com/efRx3PWTj0", "— PIB Fact Check (@PIBFactCheck) April 8, 2020", "Earlier, we had debunked a fake notice which was circulating in the name of the World Health Organisation (WHO).", "Donate Now", "Priyanka Jha specialises in monitoring and researching mis/disinformation at Alt News. She also manages the Alt News Hindi portal.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "Amid the ongoing Israel-Palestine conflict, media outlet Times Now put out a report claiming that…", "A 45-second video clip is being shared widely on social media where a group of…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…"]