["The photos were shared on Facebook here on February 25, 2021.", "Korean text has been superimposed on the three images.", "“South Korea practised how to deliver vaccines safely even by mobilising SWAT... but the reality is the authorities had to destroy all the vaccines after failing to maintain the recommended storage temperature,” reads the Korean-languge claim overlay on one of the images.", "The Facebook post's Korean-language caption translates to English as: \"This is why Gag Concert was shut down\".", "Gag Concert is a South Korean stand-up comedy show. The user appears to be mocking the purported scene in the images, implying it is funnier than Gag Concert.", "The post circulated online one day after South Korea began a five-day logistics plan to distribute Oxford/AstraZeneca vaccines across the nation, as Yonhap News Agency reported on February 24, 2021.", "The photos were shared alongside a similar claim on Facebook here, here and here.", "The claim is false.", "The first and second image show drills conducted by South Korean authorities to ensure safe storage and distribution of Covid-19 vaccines.", "They were published by Yonhap News Agency on February 23, 2021, and South Korean news agency News1 on February 24, 2021, respectively, before the country's vaccine rollout official began on February 26, 2021.", "The third image at the bottom is a screenshot of a news report from Yonhap News TV aired on February 25, 2021. The chyron in the image translates as: “The authorities had to retrieve all the vaccines en route to Jeju Island after failing to maintain recommended temperature range.”", "On February 24, 2021, AstraZeneca vaccines allocated to Jeju Island were seized by health officials after they were exposed to temperatures below their recommended range.", "The KDCA, however, said the batch of Oxford/AstraZeneca vaccines had not been damaged and would still be used for inoculations.", "In an online press briefing on February 25, 2021, Yang Dong-kyo, head of the KDCA's resource management team for the vaccination response, said: “Oxford/AstraZeneca vaccines must be kept at temperatures of between 2 and 8 degrees Celsius. And they must not be frozen. However, as for vaccines en route to Jeju Island yesterday, it was about 0.5 degrees Celsius outside the storage temperature. We concluded that there would be no issue of using these vaccines for inoculations, and they are not to be destroyed.\"", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]