["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Delaine Eastin is a candidate for California governor. AP file photo", "Candidate for California governor Delaine Eastin says she wants to create \"an economy that works for everyone.\"", "But with the state’s affordable housing crisis and deep poverty, Eastin believes that’s not happening now, especially for young people.", "\"People become cynical,\" she wrote in an Oct. 11, 2017 op-ed in the San Francisco Chronicle \"because the path to a brighter future is becoming more remote.\"", "Eastin continued:", "\"Ninety percent of people born in the 1940s ended up doing better financially than their parents. But those born in the 1980s, the much-maligned Millennials, have only a 50-50 chance of doing better (financially) than their parents, despite being the best-educated generation in our history.\"", "Millennials are typically considered the children of the Baby Boomers and older Gen Xers. They were born between the early 1980s and the late 1990s.", "We wanted to know whether Eastin was right about this dramatic decline in children doing better than their parents.", "We set out on a fact check.", "Eastin’s background", "Eastin is one of several Democrats vying to succeed Gov. Jerry Brown in 2018. She served in the State Assembly from 1986 to 1994 and then as State Superintendent of Public Instruction from 1995 to 2003. She was the first, and remains, the only woman to hold that position.", "In addition to her desire to create a more equitable economy, Eastin has advocated for greater investment in education, the adoption of universal health care and continued work on climate change during her run for governor.", "Our research", "We asked Eastin’s campaign for evidence supporting her claim about millennials and their financial prospects. Jon Murchinson, her campaign spokesman, told us the statement is based on conclusions in a December 2016 study by the Stanford Institute for Economic Policy Research.", "The study is called \"The Fading American Dream: Trends in Absolute Income Mobility since 1940.\"", "Its findings, indeed, show that the fraction of children earning more than their parents has plummeted -- from 90 percent for children born in the 1940s to 50 percent for those born in the 1980s. The study accounted for inflation, taxes and other changes between the generations.", "\"It’s basically a coin flip as to whether you’ll do better than your parents,\" Stanford economist Raj Chetty, one of the study’s authors, said in a news release announcing the study’s publication in December 2016.", "SOURCE: The Equality of Opportunity Project", "Reached by email this week, Chetty told us Eastin’s characterization of this trend \"appears accurate.\"", "David Grusky, the study’s co-author and director of Stanford’s Center on Poverty and Inequality, added that Eastin’s statement is \"a fair summary of our headline conclusion.\"", "The Stanford study doesn’t examine whether millennials are the \"best-educated generation in our history.\" That part of Eastin’s statement, however, was substantiated in a recent survey by the Pew Research Center. It found 27 percent of millennial women and 21 percent of millennial men had completed at least a bachelor’s degree by age 33.", "That was slightly higher than the percentages for men and women at the same age from Baby Boomer to Generation X populations.", "Inside the study", "While Eastin appears to have correctly represented the report’s findings, we wanted to know how the Stanford researchers came to their conclusions and whether other researchers agreed with them.", "Grusky told us the report used millions of Internal Revenue Service records and Census data to compare income between parents and children. The report specifically looked at people born between 1940 and 1984 and measured household income for parents and children when both were 30 years old.", "Even after accounting for changes between the generations, such as millennials entering the workforce at an older age than their parents, Grusky said the findings on upward mobility did not change significantly.", "Only slightly more than 50 percent of children at age 40 had higher income compared with their parents’ income when their parents were 30 years old.", "Unequal growth", "The Stanford study also accounted for the rapid economic growth experienced during the Baby Boomer generation, when the nation’s post-World War II economy created a surge of new jobs and industries.", "Assuming both generations had experienced the same economic growth rates, Grusky said only 62 percent of millennials would do better than their parents. The key factor holding back broader financial success of this younger generation, the report concluded, was today’s inequality of growth.", "Financial success, Grusky said, has become concentrated among a smaller share of families compared with the recent past.", "Ensuring that financial success is distributed more widely would \"make a lot of headway\" toward millennials doing better than their parents in future years, the researcher added.", "The report found declines in upward mobility for millennials across all 50 states. The biggest drops took place in Rust Belt states such as Ohio, Illinois and Michigan, Grusky said. Millennials in states such as California, New York and Massachusetts saw, on average, less substantial declines.", "SOURCE: The Equality of Opportunity Project", "For this study, Grusky said, researchers were not able to factor in student debt or address how people of different races and ethnicities are affected by the mobility trends.", "‘Behind the starting line’", "Tom Allison, deputy policy and research director at Young Invincibles, said the Stanford research \"is right in line\" with the conclusions reached by his Washington D.C.-based group. Young Invincibles advocates for expanding economic opportunities for young adults and encouraging them to get involved in the political process. Allison said the Stanford study is both transparent and relies on credible public data.", "Factors from the Great Recession to student debt to globalization have all put millennials \"behind the starting line\" compared with their parents, he said.", "\"That is a cornerstone of the American Dream,\" Allison continued, \"that if you work hard and play by the rules, then you can exceed the living standards of your parents. And we’ve seen a precipitous decline in that.\"", "Our ruling", "Delaine Eastin recently claimed millennials \"have only a 50-50 chance\" of doing better financially than their parents, while those born in the 1940s had a 90 percent chance of doing better than their parents.", "Her claim is supported by a 2016 Stanford study, \"The Fading American Dream: Trends in Absolute Income Mobility since 1940.\"", "Stanford researchers found stronger economic growth combined with a broader distribution of that growth during the Baby Boomer generation drove greater upward mobility for people born in the 1940s.", "They said financial success has become more concentrated in recent decades, leaving millennials with much lower odds of doing better than their parents. Even after accounting for changes, such as inflation and millennials starting work at older ages, they found today’s younger generation faces comparatively smaller odds of earning more than their parents. Other research, notably by the advocacy group Young Invincibles, agreed with the Stanford findings.", "We rate her claim True.", "TRUE – The statement is accurate and there’s nothing significant missing.", "Click here for more on the six PolitiFact ratings and how we select facts to check.", "Delaine Eastin, Op-ed published by SF Chronicle, October 11 2017", "Stanford Institute for Economic Policy Research, The Fading American Dream: Trends in Absolute Income Mobility since 1940, Executive Summary, December 2016", "David Grusky, director, Stanford University Center on Poverty and Inequality, interview Oct. 25, 2017", "Raj Chetty, economics professor, Stanford Institute for Economic Policy Research, email exchange Oct. 23, 2017", "Tom Allison, deputy policy and research director, Young Invincibles, interview Oct. 26, 2017", "Stanford News, Today’s children face tough prospects of being better off than their parents, Stanford researchers find, Dec. 8, 2016", "NPR, \"US kids far less likely to out-earn their parents as inequality grows,\" Dec. 9, 2016", "Washington Post, American Dream collapsing for young adults, study says, as odds plunge that children will earn more than their parents, December 8 2016", "PolitiFact, Dispelling Myths about Millennials and Homeownership, March 22 2017", "Associated Press, Millennials are falling behind their boomer parents,  January 13 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]