["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Tammy Baldwin", "Two cybersecurity committees within the federal Department of Homeland Security released a statement that called the Nov. 3 presidential election “the most secure in American history.”", "The statement notably debunks claims from President Donald Trump and others that have alleged massive fraud.", "As President Donald Trump continues to spread baseless claims of widespread fraud and a \"rigged\" presidential election that left him the loser to Democrat Joe Biden, others have come to the defense of the American election system.", "But does that group include officials in one of Trump’s own federal departments?", "That was the claim from U.S. Sen. Tammy Baldwin, D-Wisconsin, in a Nov. 15, 2020 appearance on WISN-TV’s \"UpFront\" program.", "\"We heard from the Department of Homeland Security this week that this was probably the most secure election that’s ever been run in the United States,\" Baldwin said.", "Is it true that some of the nation’s own top cybersecurity experts disagree with Trump?", "Yes. Let’s take a look.", "On Nov. 12, 2020, officials from two Department of Homeland Security committees — the Election Infrastructure Sector Coordinating Council and the Election Infrastructure Government Coordinating Council overseeing cybersecurity — released a joint statement debunking their own boss’s rampant misinformation campaign.", "\"The November 3rd election was the most secure in American history,\" the statement says.", "It’s normal for states with close contests to launch ballot recounts to allow for correction of mistakes, the statement also says, but adds there is no evidence that any voting system deleted or lost votes, changed votes or was in any way compromised.", "\"While we know there are many unfounded claims and opportunities for misinformation about the process of our elections, we can assure you we have the utmost confidence in the security and integrity of our elections, and you should too,\" the statement concludes.", "Trump has pointedly refused to concede to Biden, and his administration has blocked typical transition measures aimed at a smooth transfer of power.", "And on Nov. 17, Trump fired Christopher Krebs, the senior cybersecurity official responsible for securing the presidential election. Krebs, a Trump appointee, has been among the loudest voices rebutting false claims of election fraud. In a tweet firing Krebs, Trump said Krebs' statements have been \"highly inaccurate,\" reiterating allegations of voter fraud.", "His unsubstantiated claims of fraud have prompted several prominent Republicans to call for investigations into election proceedings, including in Wisconsin, where the GOP-controlled Legislature will launch a probe into the election, which went to Biden by about 20,000 votes.", "Trump has pledged to seek a recount in Wisconsin, though the top Republican in the Assembly has acknowledged it’s unlikely to change the outcome. The deadline to seek a recount — which election officials say could cost Trump’s campaign nearly $8 million — is Wednesday, Nov. 18.", "Baldwin claimed federal security officials called the Nov. 3, 2020 election the most secure in the country’s history.", "She’s correct. The groups did so in direct conflict with what the president has been falsely claiming for weeks.", "We rate Baldwin’s claim True.", "Milwaukee Journal Sentinel, \"Top Republican says an investigation of Wisconsin's election is unlikely to take away Biden's win in the state,\" Nov. 12, 2020", "WISN-TV, \"UPFRONT recap: Sen. Tammy Baldwin says lack of transition hurts country,\" Nov. 15, 2020", "Cybersecurity and Infrastructure Security Agency, \"Joint statement from Elections Infrastructure Government Coordinating Council & The Election Infrastructure Sector Coordinating Executive Committees,\" Nov. 12, 2020", "Axios, \"Department of Homeland Security calls election ‘the most secure in American history,’\" Nov. 12, 2020", "Milwaukee Journal Sentinel, \"Trump campaign would have to pay nearly $8 million for Wisconsin recount,\" Nov. 16, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]