["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Rep. Peter King, R-N.Y., right, appeared on CBS' \"Face the Nation\" on Aug. 31, 2014.", "Sunday marked the one-year point from President Barack Obama’s Aug. 31, 2013, Rose Garden address seeking congressional approval to conduct air strikes in Syria against Bashar al-Assad’s regime.", "Twelve months later, the situation in Syria remains a troubling international crisis, amplified by the growing presence of the terrorist group Islamic State, also known as ISIS, throughout the region.", "Across all five major Sunday political shows, Republicans — and even some Democrats — criticized the administration’s response to the unrest, with many politicians and pundits leaching on to Obama’s remark Thursday that \"we don’t have a strategy yet\" for dealing with the Islamic State.", "Among the critics was Rep. Peter King, R-N.Y., who said on CBS’ Face the Nation, \"I wish our president was showing the same leadership that (British Prime Minister) David Cameron\nshowed. What is President Obama waiting for?\"", "\"It was a year ago this all started,\" King added. \"I remember being in the White House with (White House Chief of Staff) Denis McDonough talking about the importance of air attacks in Syria, and we had allies lined up and then the president pulled the rug out. And those allies are going to be very hard now to get back into a coalition.\"", "We looked at a similar claim in March, when former Vice President Dick Cheney said, \"a lot of the allies signed on (for airstrikes in Syria). At the last minute, Obama backed off.\" We rated that statement Mostly False.", "Given the recent developments, we thought King’s comments about what happened a year ago deserved a review.", "Unlike Cheney, King does not go so far as to claim \"a lot of allies signed on\" to air strikes.", "The push to intervene in Syria came to a head on Aug. 21, 2013, when the Assad regime attacked a rebel-held area on the outskirts of Damascus using chemical weapons. A year earlier, Obama had said \"a red line for (military intervention) is we start seeing a whole bunch of chemical weapons moving around or being utilized.\"", "Within a week of the attack, the administration was talking about launching air strikes at weapon depots and military command centers in Syria. To do so, Obama and Secretary of State John Kerry tried to garner support from the international community.", "Leaders in France and Britain immediately jumped on board the idea of limited air strikes.", "On Aug. 27, 2013, French President Francois Hollande said, \"France is ready to punish those who took the heinous decision to gas innocents.\" A top British official was quoted as saying it was \"reasonable to assume our armed forces are making contingency plans.\"", "But Prime Minister Cameron suffered an embarrassing rebuke Aug. 29, 2013, at the hands of Parliament — controlled by his own party — which narrowly voted to defeat a motion to support military intervention in Syria. According to the Telegraph, it was \"the first time that a British Government has been blocked from executing a military deployment.\" Cameron later called off a military deployment.", "Support among the other European states was equally hard to find. Italy said it would only go along if the U.N. Security Council approved the use of force (which didn’t happen). Germany, seen as a pivotal player, was clearly against military action.", "Germany signed on to a G20 statement that called the use of poisonous gas a war crime and said the Syrian government was the likely culprit. But the statement added, \"The EU underscores at the same time the need to move forward with addressing the Syrian crisis through the U.N. process.\"", "The strongest legal justification for an air strike would come through the U.N. Security Council. That was impossible to achieve since two permanent members, Russia and China, had made it clear they would veto any such resolution.", "Within NATO, Turkey was a major proponent of intervention. In the Middle East, Saudi Arabia was the most eager to see an attack on Syria, a long-time political foe. Qatar and the United Arab Emirates were also on board. However, the Arab League, which includes Qatar, the UAE and Saudi Arabia, never approved a military strike.", "In the end, the most significant show of unity with allies was a Sept. 6 joint statement between the United States and Australia, Canada, France, Italy, Japan, South Korea, Saudi Arabia, Spain, Turkey and the United Kingdom calling for \"a strong international response to this grave violation of the world’s rules and conscience that will send a clear message that this kind of atrocity can never be repeated. Those who perpetrated these crimes must be held accountable.\"", "However, a \"strong international response\" was never defined, and eventually even France said it wanted to wait for a final report from U.N. chemical weapons inspectors.", "King also claimed support among allies dissipated because Obama \"pulled the rug out\" from plans to launch air strikes.", "It’s unclear exactly what moment King is referencing (his staff did not respond to an email seeking further explanation). But widespread hesitance to intervene among the international community was palpable from the start.", "Even before Obama sought congressional support for targeted military strikes on Aug. 31, 2013, — as opposed to unilateral action — Britain had already voted against any military action.", "It’s true Obama had a hand in shelving military action when the United States and Russia struck a deal that sidelined the use of force in exchange for Syria giving up its chemical weapons (which has since been completed). At that point, an international movement for significant military intervention dissipated since the source of the angst — Assad’s use of chemical weapons — was eliminated. But support was already fading anyway.", "Our ruling", "King said, \"we had allies lined up (to launch air strikes on Syria) then the president pulled the rug out.\"", "A handful of allies \"lined up\" for air strikes. We counted France, Turkey and Saudi Arabia as countries that were supportive. Hardly an overwhelming show of hands, but King did not specify how many in his remarks.", "Among the \"no\" crowd were key allies like the United Kingdom, Germany and Italy. The Arab League and the United Nations also balked.", "Any support faded after Russia helped broker a diplomatic solution in which Syria agreed to give up its chemical weapons.", "The statement is partially accurate but leaves out important details. We rate it Half True.", "CBS News, Face the Nation, Aug. 31, 2014", "PunditFact, \"Dick Cheney says 'a lot' of allies backed Syrian air strike,\" March 9, 2014", "CBS News, Face the Nation, March 9, 2014", "Associated Press, France \"ready to punish\" Syria over gas attack, Aug. 27, 2013", "Telegraph, Syria crisis: No to war, blow to Cameron, Aug. 29, 2013", "Talking Points Memo, Levin: Syria Intervention Would Suffer Without Support Of 'Large Number Of Nations', Aug. 30, 2013", "NBC News, World powers reach deal on removal of Syrian chemical weapons,Sep. 26, 2013", "BBC News, Kerry meets Arab leaders to seek Syria strike support, Sept. 8, 2014", "Radio Free Europe, U.S. Struggles To Gather International Support For Syria Military Strike, Sept. 10, 2013", "Huffington Post, Syria intervention: Countries for and against military action in wake of chemical attack, Aug. 27, 2013", "White House, Joint Statement on Syria, Sept. 6, 2013", "NBC News, Arab Leagues agrees with Kerry on assad chemical weapon use - but not military action, Sept. 8, 2013", "Reuters, Germany backs G20 statement on Syria a day late, Sept. 7, 2013", "German Embassy, EU position on Syria, Sept. 7, 2013", "Carnegie Endowment for International Peace, Obama steps back from the Syria brink, Sept. 11, 2013", "BBC News, Syria crisis: Where key countries stand, Feb. 18, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]