["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Mark Dayton, then running for his first term as Minnesota governor, and President Barack Obama, wave to the crowd during a get-out-the-vote rally at the University of Minnesota in October 2010.", "Recent electoral trends have not been kind to Democratic governors. When Barack Obama was elected president, 28 of the nation’s 50 governors were Democratic. Now, just 18 governors are Democrats, even as lots of current and former Republican governors are considered presidential prospects.", "But there’s one Democratic governor who’s been getting attention recently, at least in certain social media circles: Mark Dayton of Minnesota. To some Democrats, Dayton is a governor to be emulated -- one who pursued a no-holds-barred progressive course and succeeded in improving the state’s economy.", "Here’s a recent meme sent to PolitiFact by a reader. It was created by Occupy Democrats, a progressive group with a significant presence on social media.", "\"Hello America. I am Minnesota's Democratic Governor Mark Dayton. Although Republicans nearly lost their minds and predicted an economic disaster, I raised taxes on the wealthy and raised my state's minimum wage a few years ago. Today, my state's economy is creating jobs at a record pace, unemployment is at a historic low, median income is skyrocketing, and my state has a billion dollar surplus -- which I'm going to invest in education.\"", "It’s tricky to assign credit for economic accomplishments to particular policies, but in this case, we found problems with most of the meme’s statistical claims. We’ll go through where the meme exaggerates the facts. (Occupy Democrats did not respond to email inquiries.)", "Here’s a look at the claims, one by one.", "• \"Creating jobs at a record pace.\" We looked at state-level data from the Bureau of Labor Statistics and found that the number of employed Minnesota residents rose by 31,300 over the course of 2014 and by 35,600 over the course of 2013. That’s a pretty good clip, but it’s still a only middling amount when compared to how Minnesota has done historically. In roughly a half-dozen years since 1990, Minnesota has seen its job gains top 60,000 or even 70,000 a year. So the current pace is hardly a \"record.\"", "• \"Unemployment is at a historic low.\" As we noted, unemployment in Minnesota today is an impressive 3.7 percent. But that isn’t a \"historic low.\" In fact, it was lower for almost four and a half consecutive years, from January 1997 until May 2001. During that stretch, the unemployment rate went as low as 2.5 percent.", "• \"Median income is skyrocketing.\" Median household incomes have been increasing in Minnesota faster than the United States as a whole. Over the past three years, inflation-adjusted, median household incomes have increased more than twice as fast in Minnesota as in the U.S. -- up by 9.5 percent in Minnesota between 2010 to 2013, as opposed to 4.4 percent nationally. Still, to put this in context, that means the median Minnesota household has seen its real incomes rise by 1.7 percentage points per year faster than the country as a whole. That’s certainly progress, but we don’t think most people would consider that rate of increase \"skyrocketing.\"", "• \"A billion dollar surplus.\" This is the one point on which the meme appears to be accurate (and, in fact, underplays the number). The state is looking at a projected surplus of nearly $1.9 billion.", "We should reiterate that, by national standards, Minnesota is indeed doing well. The state has a 3.7 percent unemployment rate -- the fifth best of any state and significantly lower than the national rate of 5.5 percent. And Minnesota ranks seventh-highest among the 50 states in median household income.", "But this meme doesn’t just say that Minnesota has better-than-average metrics for employment and income -- it uses some very specific superlatives that aren’t in tune with the data.", "Our ruling", "Occupy Democrats said that Minnesota \"is creating jobs at a record pace, unemployment is at a historic low, median income is skyrocketing, and (the) state has a billion-dollar surplus.\" While Minnesota is doing well on several key economic measurements, its achievements do not qualify as a \"record,\" \"historic\" or \"skyrocketing.\" Only the meme’s budget surplus claim is correct. On balance, we rate the claim Half True.", "Occupy Democrats, social media meme, received by PolitiFact March 30, 2015", "Bureau of Labor Statistics, Local Area Unemployment Statistics (main index page), accessed March 30, 2015", "U.S. Census Bureau, Minnesota and U.S. median householf Income in the past 12 months in 2013 inflation-adjusted dollars from the 2013 American Community Survey, one-year estimates, accessed April 1, 2015", "Minnesota Management and Budget, Budget and Economic Forecast, February 2015", "Bureau of Labor Statistics, Unemployment Rates for States, accessed March 30, 2015", "Minnesota Public Radio, \"Senate DFL wants surplus used for schools, reserves,\" March 27, 2015", "Email interview with Matt Swenson, press secretary and senior communications advisor for Mark Dayton, March 30, 2015", "Email interview with John Pollard, legislative and communications director for Minnesota Management and Budget, March 30, 2015", "Email interview with Madeline Koch, director of communications for the Minnesota Department of Employment and Economic Development, March 30, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]