["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "The world’s fastest man says he’s not scared of Zika since he can always outrun virus-carrying mosquitoes.", "Jamaican sprinter Usain Bolt, who is preparing for this summer’s Olympic games, was asked recently about the Zika epidemic in the host country of Brazil. No worries, he said.", "\"Because I’m fast,\" he joked in a May 18 interview on NBC’s Today. \"They can’t catch me.\"", "This should be obvious: We are not saying that running is a Zika prevention method. (Here are some actual steps to take to avoid being bitten.)", "But we were curious whether Bolt really would outpace the mosquito. (People already have tried to figure out if Bolt can beat a cheetah. He can’t.)", "To the stat sheet!", "Bolt currently holds both the 100 meter and 200 meter world records at 9.58 seconds and 19.19 seconds respectively. That corresponds to 23.35 miles per hour for the 100-meter dash, and 23.31 miles per hour for the 200-meter dash.", "Based on how he’s performed in all past races listed by the International Association of Athletics Federations, Bolt’s average speed is 21.65 miles per hour. Even at his slowest, when he clocked 48.28 seconds at the 400-meter in 2001, he was still running at 18.53 miles per hour.", "The New York Times did an excellent job breaking down Bolt’s prowess in this video from the 2012 Olympics.", "So Bolt runs — in short bursts — around 22 miles per hour.", "How does that stack up against mosquitoes?", "Many mosquito species in the Aedes genus (africanus, apicoargenteus, luteocephalus, vitattus, furcifer, albopictus, hensilli and polynesiensis) can transmit the Zika virus, but the main vector is Aedes aegypti.", "Female aegypti mosquitoes (the ones that bite) are estimated to have a cruising speed of 0.5 to 1.5 meters per second.", "That’s the equivalent of 1.12 to 3.35 miles per hour — a fraction of Bolt’s speed, even at his slowest.", "In that sense, it’s not a contest.", "Until you factor in stamina. Bolt runs short distances, while the mosquitoes are in it for the long haul. Researchers have documented lady aegypti flying continuously for two to nine hours, with an average of 2.2 hours. So Bolt, or really anyone, would have to run more than 7.37 miles in that time frame to outpace the mosquito.", "Kenya’s Dennis Kimetto, Bolt’s world record counterpart in the marathon world, ran 26.219 miles in 2 hours, 2 minutes and 57 seconds. He’d leave the mosquito nearly 20 miles behind with that pace.", "Kimetto. (AP)", "Bolt and Kimetto would have a lot more to worry about if the Zika vector was a desert locust or earworm, which have respective average air speeds of 21 and 17 miles per hour. But for now, Zika-carrying mosquitoes can’t catch up to either man.", "Our ruling", "Bolt said Zika mosquitoes \"can’t catch me.\"", "The Olympic champion and world record holder clocks an average speed is 21.65 miles per hour in his races, with 23.35 miles per hour at the high end and 18.53 miles per hour at the low end.", "Female A. aegypti mosquitoes, the main vector for Zika, cruise between 1.12 and 3.35 miles per hour. That’s a lot slower than Bolt, though the mosquitoes fly for much longer than Bolt sprints.", "Don’t try this, people. (But if you do, send us a video!)", "We rate Bolt’s claim Mostly True.", "https://www.sharethefacts.co/share/fab8b2cf-1ebd-4627-9ca4-d3bfb150ef4b", "Today, \"Jamaican sprinter Usain Bolt on Zika outbreak in Rio: I'm too fast to get bit,\" May 18, 2016", "International Association of Athletics Federations, Usain Bolt’s athlete profile, accessed May 19, 2016", "Sir S. Rickard Christophers, Aedes aegypti: the yellow fever mosquito, 1960", "A.N. Clements, The Physiology of Mosquitoes, 1963", "Journal of Vector Ecology, \"Aedes aegypti: size, reserves, survival, and flight potential.\" 2001", "The University of Florida Book of Insect Records, Fastest Flyer, April 1, 2003", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]