["About this rating", "Actor Peter Fonda prompted an outraged reaction on 20 June 2018, when he suggested in a tweet that he and other opponents of President Donald Trump's \"zero-tolerance\" immigration policy should kidnap Trump's 12-year-old son Barron and \"put him in a cage with pedophiles.\"", "Fonda, who later deleted the tweet and apologized, suggested the boy's kidnapping as a way to provoke his mother, First Lady Melania Trump, into opposing a policy that had seen thousands of children separated from their parents at the United States border.", "Stephanie Grisham, a spokesperson for the First Lady, told us that her office had reported the tweet to the United States Secret Service, which is responsible for protecting the President and Vice-President of the United States and their families. A spokesperson for the Secret Service confirmed by e-mail that the agency was \"aware of the tweet made by Mr. Fonda\" but declined to say whether an investigation was underway, citing a policy of not commenting on \"matters involving protective intelligence.\"", "Donald Trump Jr., a half-brother of Barron Trump, called Fonda a \"sick individual\" in response to the tweet:", "You’re clearly a sick individual and everyone is an internet badass but rather than attack an 11 year old like a bully and a coward why don’t you pick on someone a bit bigger. LMK. https://t.co/8OhiQ0aZmO", "— Donald Trump Jr. (@DonaldJTrumpJr) June 20, 2018", "The actor posted a series of angry tweets on the morning of 20 June 2018 attacking Trump's \"zero-tolerance\" immigration policy and proposing mass protests:", "Wanna stop this fucking monster? Really wanna stop this giant asshole? 90 MILLION PEOPLE IN THE STREETS ON THE SAME WEEKEND! THESE REPUBLICAN ASSHOLES ARE ALL IN ON IT! THE CHIEF ASSHOLE IS HAPPY WE ARE ALL VERY UPSET. WE HAVE TO GET EVEN MORE ANGRY WITH THESE REPUBLICANS", "— Peter Henry Fonda (@iamfonda) June 20, 2018", "Fonda also proposed kidnapping the president's youngest son. His tweet has been deleted, but its authenticity was initially corroborated by Twitter responses and multiple screenshots before Fonda himself apologized for it:", "WE SHOULD RIP BARRON TRUMP FROM HIS MOTHER'S ARMS AND PUT HIM IN A CAGE WITH PEDOPHILES AND SEE IF MOTHER WILL STAND UP AGAINST THE GIANT ASSHOLE SHE IS MARRIED TO. 90 MILLION PEOPLE IN THE STREETS ON THE SAME WEEKEND IN THE COUNTRY. FUCK", "According to a statement distributed to reporters, Fonda apologized for the tweet later on 20 June, writing:", "I tweeted something highly inappropriate and vulgar about the president and his family in response to the devastating images I was seeing on television. Like many Americans, I am very impassioned and distraught over the situation with children separated from their families at the border, but I went way too far. It was wrong and I should not have done it. I immediately regretted it and sincerely apologize to the family for what I said and any hurt my words have caused.", "Fonda also proposed harassing and intimidating families and children of federal agents involved in immigration law enforcement in two tweets which have also since been deleted, but the authenticity of which has also been corroborated. Fonda did not acknowledge or apologize for those tweets.", "Peter Fonda passed away in August 2019 at the age of 79.", "Nolte, John.   \"Actor Peter Fonda: 'Rip Barron Trump from His Mother ... Put Him in Cage with Pedophiles.'\"\r\n    Breitbart.   20 June 2018", "Kruta, Virginia.   \"Actor Peter Fonda Calls for Barron Trump's Kidnapping Over Border Crisis.\"\r\n    Daily Caller.   20 June 2018.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]