["‘No wonder why his bhakts are like that‘, says a post put up by the Facebook page Feku Express 2.0. This post shows two images of Prime Minister Narendra Modi. In the photograph on the left, he is seen garlanding a bust of Mahatma Gandhi and in the photo on the right, PM Modi is garlanding a bust of what is being claimed is the bust of the ‘killer of Gandhi’, in an allusion to Nathuram Godse, the assassin of Mahatma Gandhi.", "Kya kahoge inke bare me. Fake currency toh thik tha but Fake PM Ye Bik Gayi Hai Gormint – Truth of India", "Posted by FekuExpress2.0 on Saturday, May 5, 2018", "The page has more than 280,000 followers. This post was put up by the page on May 6, 2018 and so far, it has been shared more than 6500 times. The post by Feku Express 2.0 has tagged another popular page Ye Bik Gayi Hai Gormint- Truth of India crediting them for the post. The image also carries a logo of Truth of India. However, we could not find the post on the said page.", "Not Nathuram Godse", "The bust of the person in the photograph on the right is NOT of Nathuram Godse or any of the co-accused in the Gandhi murder case. Using Google Reverse Image search option, we found this article by the International Business Times dated April 6, 2017. The caption accompanying the photograph clearly says that PM Modi is paying tribute to Pandit Deen Dayal Upadhyay, sangh parivar ideologue and founder of the erstwhile Bharatiya Jana Sangh. The photo was clicked on April 6, 2017. PM Modi was paying tribute to Upadhyay on the 37th foundation day of BJP.", "Alt News had earlier reported how fans of Nathuram Godse on Twitter are followed by Prime Minister Narendra Modi. Godse has presented a classical dilemma for the sangh parivar which on numerous occasions has found it difficult to openly disown him. At the same time, the RSS has distanced itself from Godse while detractors of the sangh parivar have always maintained that Godse was an intrinsic part of the RSS. Political propaganda on social media however often blurs the line between fiction and fact. In this photograph, PM Modi is paying homage not to Godse but to Deen Dayal Upadhyay.", "Donate Now", "Arjun Sidharth is a writer with Alt News. He has previously worked in the television news industry, where he managed news bulletins and breaking news scenarios, apart from scripting numerous prime time television stories. He has also been actively involved with various freelance projects. Sidharth has studied economics, political science, international relations and journalism. He has a keen interest in books, movies, music, sports, politics, foreign policy, history and economics. His hobbies include reading, watching movies and indoor gaming.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]