["President Donald Trump hasn’t been decisive on whether he’d sign a spending bill that did not include funding for his promised border wall. But he raised a related topic in an interview with the Associated Press: declining illegal immigration.", "\"People want the border wall … They want to see the wall, they want to see security. Now, it just came out that they're 73 percent down. ... That's a tremendous achievement. ... Look at this, in 100 days, that down to the lowest in 17 years and it's going lower,\" Trump said in the April 21 interview, which we fact-checked.", "Trump’s wording did not specify what was the lowest in 17 years, but similar comments made by others in his administration indicate he was referring to apprehensions at the southwest border by border patrol agents. Historical data from Border Patrol show that Trump’s claim is accurate.", "Southwest border apprehensions", "Trump has used different timeframes to make a case that fewer people are attempting to cross into the United States illegally.", "He’s looked at year-over-year March border apprehension data to say there’s been a 64 percent decline; compared February 2017 numbers to the election month, November 2016 to say it’s gone down 61 percent; and said there was a 40 percent decline from January, the month he was inaugurated, to February.", "U.S. Customs and Border Protection data show that in March 2017 agents made 12,193 apprehensions at the U.S.-Mexico border. It is the lowest number in at least 17 years, according to monthly southwest border apprehension numbers since fiscal year 2000.", "Apprehension data is generally used as a metric to measure illegal immigration.", "Experts have told us that Trump’s rhetoric has played a role in deterring illegal immigration, perhaps more so than his newly issued policies, which may take longer to implement on the ground.", "\"The recent dip in apprehensions likely does signify a trend, in particular as apprehensions typically rise in March and early spring,\" said Michelle Mittelstadt, spokeswoman for Migration Policy Institute, a nonpartisan think tank that researches migration.", "It’s still to be determined if it’s a temporary lull or a lasting decline, \"but at this point it seems clear that would-be migrants are concerned about rising enforcement not just at the border but within the United States,\" Mittelstadt said.", "Apprehensions at the southwest border peaked in 2000 at 1.6 million (yearly total) but began a declining trend during the 2008-09 recession that has continued since, Mittelstadt said.", "Aside from policies and enforcement in the United States, factors in Mexico have contributed to lower apprehension numbers, Mittelstadt said, among them: lower birth rates, increased educational levels and an improved economy.", "Trump isn’t the only one who has said the numbers are declining; Democrats have cited the same point.", "During the Democratic National Convention we rated Mostly True a claim by U.S. Rep. Luis Gutierrez, D-Ill. that fewer people were crossing the southwest border than in the last three decades. More recently, Democratic congressman John Conyers Jr., of Michigan, also said apprehension rates had plummeted and that numbers for Mexicans caught by Border Patrol had reached their lowest point in nearly half a century. That also rated Mostly True.", "Mittelstadt, from Migration Policy Institute, noted that as the number of Mexicans apprehended has gone down recently, about one-third of apprehensions last year were Central American unaccompanied minors and families seeking refuge in the United States – presenting themselves to immigration authorities instead of evading detection.", "Apprehensions of Central Americans outnumbered those of Mexicans in 2014 and 2016.", "\"Amid overall declining unauthorized inflows, the Obama administration prioritized putting more people in formal removal proceedings rather than permitting voluntary return, which increases the range of punishments for those seeking to re-enter illegally,\" Mittelstadt said. \"And during the Obama administration, as occurred with prior administrations, sizable new border enforcement resources were provided by Congress.\"", "Our ruling", "Trump said illegal immigration on the U.S.-Mexico border is \"the lowest in 17 years.\"", "Border Patrol data support Trump’s claim. In March, Border Patrol recorded 12,193 apprehensions at the southwest border, the lowest in at least 17 years.", "It’s worth noting that apprehension rates have been declining since the recession, and significantly so since their peak of 1.6 million in 2000.", "Overall, we rate Trump’s claim True.", "AP, Transcript of interview with President Donald Trump, April 24, 2017", "Justice Department, Attorney General Jeff Sessions Delivers Remarks Before Media Availability in El Paso, Texas, April 20, 2017", "AP, Immigration arrests at Mexican border continue to plummet, April 4, 2017", "U.S. border patrol, historical data on apprehensions fiscal years 2000-2016", "U.S. Customs and Border Protection, Southwest Border Migration, last published April 12, 2017", "PolitiFact, Fact-checking Trump’s AP interview about his first 100 days, April 24, 2017", "PolitiFact, Mostly True: Rep. Conyers' claim about border apprehensions down since 1980s, April 3, 2017", "PolitiFact, Rep. Gutierrez says fewer people crossing border than in last 30 years, July 26, 2016", "PolitiFact, Donald Trump changes yardstick in claim about southern border apprehensions, April 10, 2017", "PolitiFact, Trump says illegal immigration at southern border is down 61 percent since Election Day, March 22, 2017", "PolitiFact, Donald Trump trumpets 40 percent decrease in illegal border crossings. Is he right?, March 14, 2017", "Email interview, Michelle Mittelstadt, spokeswoman for Migration Policy Institute, April 25, 2017", "Department of Homeland Security, Statement by Secretary Johnson on Southwest Border Security, Oct. 17, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]