["The six photos were shared on Facebook here on February 14, 2021.", "The Indonesian-language caption reads in part: “Tajikistan", "“A 6.4-magnitude earthquake struck Azad, Kashmir, Friday evening at 22:02. The quake’s epicentre is in Tajikistan, 80 km deep.", "“There have been no reported casualties so far. The quake was strongly felt in North India, in Jammu and Kashmir, Punjab, Haryana, Himachal Pradesh, Delhi-NCR and Uttarakhand. According to India’s Meteorology Department (IMD), the quake’s epicentre is in Tajikistan. IMD said the quake was 6.3 magnitude strong. It took place at 22:30 Western Indonesian Time.\"", "A 6.3-magnitude earthquake struck the central Asian country of Tajikistan on February 12, 2021. The tremor was felt across the region, including in northern India, as reported by the Hindustan Times and the Hindu.", "The photos also appeared in other Facebook posts with a similar claim, for instance, here, here and here.", "The photos have also been shared with a similar claim in English, including here and here on Facebook and here and here on Instagram.", "However, the claim is misleading.", "Reverse image searches found four of the photos have circulated in media reports about the aftermath of earthquakes in Turkey, Italy and Pakistan in the past three years.", "First photo", "The first photo appeared in this French-language report published by Turkish state-run Anadolu Agency on January 24, 2020.", "Translated to English, the report’s headline reads: “Turkey / Earthquake in Elazig: 35 aftershocks recorded.”", "The report's first paragraph reads: “A magnitude 6.8 earthquake occurred Friday evening in Elazig region, southeastern Turkey.”", "A 6.8-magnitude earthquake struck the eastern Turkish province of Turkey on January 24, 2020, killing at least 29 and injuring nearly 1,500, AFP reported here and here.", "Below is a screenshot comparison between the first photo in the misleading post (L) and the Anadolu Agency photo (R):", "Second photo", "The second photo appeared in this December 27, 2018, report about an earthquake in Sicily, Italy, which was triggered by Mount Etna volcano. The photo, credited to the Australian Associated Press, has a caption that reads: “A damaged house in Fleri, Sicily Italy.”", "Several people were injured and buildings damaged after a 4.8-magnitude earthquake near Italy’s Mount Etna on December 26, 2018, days after the volcano erupted, AFP reported here.", "Below is a screenshot comparison between the second photo in the misleading post (L) and the Australian Associated Press photo (R):", "Third photo", "The third photo was published by AFP here on January 24, 2020.", "The photo’s caption reads: “Turkish officials and police work at the scene of a collapsed building following a 6.8 magnitude earthquake in Elazig, eastern Turkey on January 24, 2020. A powerful earthquake with a magnitude of 6.8 hit eastern Turkey, killing at least four people, causing buildings to collapse and sending panicked residents rushing into the street. Rescue teams were being sent to the scene of the quake, which had its epicentre in the small lakeside town of Sivrice in the eastern province of Elazig.”", "Below is a screenshot comparison between the third photo in the misleading post (L) and the AFP photo (R):", "Fourth photo", "The fourth image showing a large crack on a road was published by Pakistani media Geo News in this report on September 24, 2019. It is headlined: “Pictures, videos show havoc wreaked by earthquake in northern Pakistan, AJK.”", "The report's first paragraph reads: “A 5.8-magnitude earthquake in northern Pakistan and Azad Jammu and Kashmir’s Mirpur on Tuesday left dozens of people injured and wreaked havoc on the cities’ infrastructure, especially the roads.”", "The earthquake killed at least 19 people and injured hundreds of others, AFP reported.", "Below is a screenshot comparison between the fourth photo in the misleading post (L) and the Geo News photo (R):", "Fifth and sixth photos", "The remaining two photos have appeared in Indian media reports about how the tremors of the February 12, 2021, earthquake in Tajikistan were felt in northern India. One photo shows people who came out of their houses in Delhi, while the other photo was taken in Srinagar, according to local media reports.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]