["Some of the most-watched moments from Judge Amy Coney Barrett's testimony before the Senate Judiciary Committee were her exchanges with Sen. Kamala Harris.", "One user took to Facebook to compare the qualifications of the conservative Supreme Court nominee and the Democratic vice presidential nominee.", "\"Kamala Harris failed the bar 1st time. Amy Coney Barrett 1st in her class,\" the post read atop a background of laughter emojis. \"I rest.\"", "The user behind the post did not respond to a request from USA TODAY for comment.", "Fact check:It's true, Ginsburg said bipartisanship needed 'true patriots' on both sides", "Fact or fiction?:We're fact checking the news and sending it to your inbox. Sign up to get that here.", "It's true that Harris failed the bar exam on her first attempt, per The New York Times. She later passed.", "The bar exam is the qualifying examination for lawyers to receive a license to practice law in a given state.", "California has a notoriously difficult bar exam. In 1985, the Los Angeles Times wrote that its pass rate \"has generally hovered around 50%.\"", "Harris graduated from the University of California, Hastings College of the Law in 1989.", "Even now, the pass rate on the California Bar Examination averages out to approximately 50%.", "In February, just 40% of \"first-timers\" passed, per a report by the State Bar of California. In July 2019, around 60% of \"first-timers\" passed, per another report.", "Harris once told a recent law school grad who didn't pass the test, \"It’s not a measure of your capacity,” The New York Times also reported in 2016.", "It's also true that Barrett graduated at the top of her class at Notre Dame Law School, per Politico.", "Fact check:Photo of maskless Democratic senators is from 2018 Kavanaugh confirmation hearing", "USA TODAY could not locate the corresponding metric — law school class rank for Harris, or information about whether Barrett passed the bar exam at her first attempt.", "Charleston School of Law Dean Larry Cunningham told USA TODAY that law school performance is correlated with performance on the bar exam.", "\"The bar exam is a standardized test,\" he wrote in an email. \"Students who do well on law school exams tend to do well on the bar exam.\"", "However, the exam has been criticized as \"unrealistic\" and insufficient to assess some important legal skills, like interviewing clients and arguing in court, per Cunningham.", "\"These criticisms also explain why many law graduates who struggle to pass this high-stakes exam on the first attempt go on to become excellent lawyers and judges,\" he wrote. \"The bar exam is not a measure of their worth as a person or as a lawyer.\"", "Loyola Law School Director of Bar Programs Susan Smith Bakhshian told USA TODAY that class rank and grade point average are a \"reasonable predictor of your likelihood of success on the bar exam, but they are not the only ones.\"", "She said new research also reveals that the high cut score to pass the bar in California \"has a disparate impact on minority law graduates,\" like Harris, who is Black and Asian American.", "\"It is also very much your socioeconomic status. Students who do not have the money to study full time without working have a much harder time passing,\" she said.", "Fact check:Fake Trump tweet says Supreme Court should decide every election", "Based on our research, the claims about both Harris and Barrett are TRUE. Kamala Harris failed the bar exam on her first try, and Amy Coney Barrett graduated law school at the top of her class.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more."]