["About this rating", "In late 2019, a meme circulated on social media reporting that Rudy Giuliani's son was employed to work in the White House on the staff of U.S. President Donald Trump.\nIt's true that Andrew Giuliani, the son of Trump's personal attorney, works in the White House, or at least he did as of June 28, 2019, the date of the most recent government disclosure of executive office staff. The younger Giuliani, according to the disclosure, earns $95,000 annually as special assistant to the president and associate director of the Office of Public Liaison. He was hired in 2017.", "The meme, posted by the liberal social media network Occupy Democrats, likely gained traction in December 2019 because concurrent impeachment proceedings against Trump in the U.S. House of Representatives focused heavily on accusations of nepotism.", "Trump is facing impeachment over a whistleblower allegation that he attempted to extort the Ukrainian president by holding hostage crucial military aid while that country is embroiled in a war with Russia, in exchange for Ukraine producing damaging information on Trump's potential 2020 electoral rival, former Vice President Joe Biden.", "The elder Giuliani has been accused of acting on Trump's behalf in the effort to pressure Ukrainian officials into producing an investigation against Biden and his son, Hunter. Neither Biden has been formally accused of criminal wrongdoing.", "Trump and his political allies have attempted to shift focus away from accusations against Trump by focusing instead on the fact that Hunter Biden gained a lucrative position on the board of Burisma, a Ukrainian energy company — a position they say he wouldn't have held without the influence of his father.", "Rudy Giuliani addressed his son's employment in the Trump White House in a November 2019 interview with The Atlantic, saying it wasn't a typical \"hire-my-kid\" situation, stating, \"[Andrew has] known the president since he was a baby. Now, did he know him in the first place because he was the mayor’s son? Sure, but they also had a relationship independent of me.\"", "Executive Office of the President.   \"Annual Report to Congress on White House Office Personnel.\"\r\n    28 June 2019.", "Karni, Annie.   \"Trump Hires Rudy Giuliani's Son for White House Role.\"\r\n    Politico.   6 March 2017.", "Hess, Abigail.   \"Rudy Giuliani’s Son Makes $95,000 Working as Sports Liaison for the White House.\"\r\n    CNBC.   22 November 2019.", "Plott, Elaina.   \"What Does Rudy Giuliani’s Son Do?\"\r\n    The Atlantic.   18 November 2019.", "Protess, Ben et al.   \"Giuliani Pursued Business in Ukraine While Pushing for Inquiries for Trump.\"\r\n    The New York Times.   27 November 2019.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]