["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Donald Trump’s merchandise doesn’t show a commitment to making America great again, Hillary Clinton said in her keynote address on the last night of the Democratic National Convention.", "\"He also talks a big game about putting America First,\" Clinton said. \"Please explain to me what part of America First leads him to make Trump ties in China, not Colorado. Trump suits in Mexico, not Michigan. Trump furniture in Turkey, not Ohio. Trump picture frames in India, not Wisconsin. Donald Trump says he wants to make America great again. Well, he could start  by actually making things in America again.\"", "Are all these Trump-brand products really made abroad? Let’s check it out.", "Claim: Trump neckties are made in China.", "We saw a \"made in China\" label on a Trump tie for sale on eBay, and here’s another one on Amazon. Many are listed as \"imported,\" and we haven’t come across any that were definitely made in the United States.", "Claim: Trump suits are made in Mexico.", "At least one image of a Trump suit with a \"made in Mexico\" label has surfaced, and Trump has acknowledged he has made some of his clothing line there. We also found examples of Trump suits made in India and China. But we actually found quite a few for sale on Amazon that were made in the United States.", "Claim: Trump furniture is made in Turkey.", "The Trump Home by Dorya line – described in a press release as \"inspired by the diverse locations and architecture of Trump properties around the globe\" –  is manufactured in Turkey.", "Claim: Trump picture frames are made in India.", "We could only find one Trump picture frame, and the Amazon page does not indicate where it was made. It lists the producer as IMAX, which is an Oklahoma-based company, though it does have facilities in India.", "But not all Trump products are made overseas.", "Some Trump products are made in the United States, including the candidate’s iconic \"Make America Great Again\" baseball cap, which is manufactured in California. We gave a Pants on Fire rating in October to a claim made by Twitter users that the hats were made in China.", "In a previous fact check, we found that some Trump-brand bedding, cologne, Trump Natural Spring Water and Trump Wine are also made in the United States.", "Our ruling", "Clinton says Trump ties are made \"in China, not Colorado. Trump suits in Mexico, not Michigan. Trump furniture in Turkey, not Ohio. Trump picture frames in India, not Wisconsin.\"", "We found examples of Trump ties made in China, suits in Mexico and furniture in Turkey. We did not find a clear example of a Trump picture frame made in India.", "It’s worth noting we also came across suits listed as made in the United States, as well as other Trump-brand products that Clinton did not name, including the \"Make America Great Again\" baseball caps.", "We rate Clinton’s claim Mostly True.", "PolitiFact, \"Tweets say Donald Trump's 'Make America Great Again' hats are made in China,\" Oct. 7, 2015", "PolitiFact Virginia, \"Tom Perez erroneously tags all Trump products with 'Made in China' label,\" June 27, 2016", "PolitiFact, \"Fact-checking the Funny Or Die video about Trump-brand products made overseas,\" July 25, 2016", "Trump Home by Dorya, press release, Feb. 10, 2014", "Quick Company, Trump Home trademark registration, accessed July 28, 2016", "Email interview, Clinton spokesman Tim Hogan, July 28, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]