["NRA Carry Guard Expo was held in Milwaukee in August 2017. (Michael Sears/Milwaukee Journal Sentinel)", "Days after the Florida school shooting that left 17 people dead, Republican Kevin Nicholson was asked about the shooting and whether anything should be done.", "Nicholson, who touts his support of the Second Amendment, is running for the U.S. Senate seat held by Wisconsin Democrat Tammy Baldwin. He appeared on the Feb. 18, 2018 edition of \"UpFront with Mike Gousha,\" a Milwaukee-based public affairs TV show. Nicholson responded to the question, in part, with a statistical claim, saying:", "The reality is, we're a nation of 300-plus-million people. There are more guns in this country than there are people. If somebody wants to obtain a firearm to commit a crime -- a heinous crime, a disgusting crime like this that puts children in harm's way and ends up taking innocent life -- they're going to do it.\"", "Are there more guns than people in the United States?", "The estimates", "We found in our first fact check related to the shooting at the high school in Parkland, Fla., that bad numbers related to guns can spread fast. We rated as Mostly False a claim that there had already been 18 U.S. school shootings in 2018, but only 18 in the rest of the world over past 20 years.", "Hard numbers on the number of guns in the United States are also elusive.", "In the past few years, headlines in the Washington Post and on Vox have declared there are more guns than people in the United States. Both noted a surge of gun sales following the 2008 election of President Barack Obama.", "But the headlines suggest the figures are certain when they’re not, given that there is no record keeping that would produce an actual count of guns in the United States. As the Pew Research Center has observed: \"Gun ownership is one of the hardest things for researchers to pin down.\"", "At the same time, there have been studies to produce estimates on the number of civilian guns in the nation.", "Both the Post and Vox noted an estimate on the high end -- 310 million guns -- that was cited in a 2012 report by the nonpartisan Congressional Research Service. The report said the estimate was based on U.S. Department of Justice data and was the \"total number of firearms available to civilians\" as of 2009.", "That 310 million count is higher than the U.S. population in 2009 of about 305 million.", "But one gun-statistics expert, Philip Cook at Duke University, told the Post that the actual figure then was probably closer to 245 million guns, not 310 million, to take into account circumstances such as guns that break down or are lost or destroyed.", "And Cook and two other experts -- Tom Smith at the University of Chicago and Daniel Webster at the Johns Hopkins at the Center for Gun Policy and Research -- told us the best, most recent estimate is in a study published in October 2017 by researchers from the Harvard Injury Control Research Center. A total of 3,949 adults, representative of the U.S. population, were surveyed online.", "The lead author of that study, Deborah Azrael, told us the respondents were asked if they owned guns and how many, and were instructed not to count BB guns, replicas or other guns that were not functioning. \"There are clearly guns we miss,\" Azrael said, noting that some people might lie about owning guns. \"My guess is we probably miss more than we undercount.\"", "The estimate: 265 million civilian guns in the United States, as of when the survey was taken, in January 2015.", "Meanwhile, the U.S. population at that time, according to the U.S. Census Bureau, was about 320 million.", "Other highlights of the Harvard study:", "Of the estimated 265 million total civilian guns, 113 million were handguns.", "The typical gun owner (the median, in the survey) owned two guns.", "39 percent of the estimated 265 million guns were owned by 8 percent of the gun owners -- that 8 percent of all owners owned 10 or more guns.", "Prior fact check", "The claim made by Nicholson was also made in 2013 by Democrat Eleanor Holmes Norton, the non-voting delegate in the U.S. House of Representatives representing the District of Columbia. PolitiFact National, noting the lack of firm numbers, gave her a rating of Half True.", "That fits here.", "Our rating", "Nicholson says: \"There are more guns in this country than there are people.\"", "There is no official count of the number of firearms in the United States. In one estimate, for 2009, the number of guns exceeded the population. But the most recent estimate cited by gun-statistics experts puts the figure at 265 million guns as of January 2015, when the population was 320 million.", "We rate Nicholson’s statement Half True.", "YouTube, \"Upfront with Mike Gousha\" Kevin Nicholson interview (3:00), posted Feb. 17, 2018", "Email, Kevin Nicholson campaign spokesman Brandon Moody, Feb. 19, 2018", "PolitiFact National, \"Eleanor Holmes Norton says ‘more guns than people’ in U.S., in Navy Yard reaction,\" Sept. 19, 2013", "Email, Duke University professor emeritus of public policy studies Philip Cook, Feb. 19, 2018", "Interview, Ohio State University professor of public affairs Ned Hill, Feb. 20, 2018", "Interview, Harvard Youth Violence Prevention Center associate director Deborah Azrael, Feb. 20, 2018", "U.S. News & World Report, \"U.S. Population, 2009: 305 Million and Counting,\" Dec. 31, 2008", "Washington Post, \"Wonkblog: There are now more guns than people in the United States,\" Oct. 5, 2015", "U.S. Census Bureau, news release, Dec. 29, 2014", "National Public Radio, \"Guns In America, By The Numbers,\" Jan. 5, 2016", "Russell Sage Foundation Journal of the Social Sciences, \"The Stock and Flow of U.S. Firearms: Results from the 2015 National Firearms Survey,\" October 2017", "Harvard Injury Control Research Center, \"Gun ownership,\" accessed Feb. 19, 2018", "Pew Research Center, \"The demographics of gun ownership,\" June 22, 2017", "NORC at the University of Chicago, \"Trends in Gun Ownership in the United States, 1972-2014,\" March 2015", "Email, University of Chicago’s NORC Center for the Study of Politics and Society director Tom Smith, Feb. 20, 2018", "Vox, \"There are now more guns than people in America,\" July 27, 2016", "Quartz, \"Three percent of the population own half of the civilian guns in the US,\" Oct. 6, 2017", "Pew Research Center, \"A minority of Americans own guns, but just how many is unclear,\" June 4, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]