["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "You may have heard the uproar by now: \"Pizza is not a vegetable!\"\n\nDemocrats used the rallying cry in a mass e-mail Nov. 17, 2011, alerting partisans that, \"House Republicans are ramming through legislation this week to classify pizza as a 'vegetable' for the purpose of school lunches.\"\n\nWe wondered: Pizza as a vegetable? We had heard rumblings on social networks about magical pizza seeds and pizza gardens — all in response to Congress' action — and we had to know. Was it true?\n\nHere's more from Democrats' message:", "Then it linked to a message for folks to send from MyDemocrats.org/Pizza. (The message: \"Dear House Republicans, Pizza is not a vegetable. Sincerely, America.\")", "We could have a lot of fun with this.\n\nWe asked the source of the e-mail, Brad Woodhouse at the Democratic National Committee, to back up his statement.", "He sent us a CBS News/Associated Press article from Nov. 15, 2011, \"Congress pushes back on healthier school lunches.\" The topic? A spending bill that forces the U.S. Department of Agriculture to ignore a proposed change from the Obama administration about how to credit tomato paste. (Congress simply won't fund implementation of the new rule.) The House and Senate both approved the bill Nov. 17, and the president signed it the next day.\n\nThe new law doesn't mention pizza.\n\nWhat it does is allow just two tablespoons of tomato paste to continue to count as a serving of vegetables. The USDA had proposed requiring a full half-cup of the concentrated tomato spread before it would count as a fruit or veggie — a standard \"serving\" by volume — far more than you'd find slathered on a slice o' school cafeteria pizza. \n\n(And, yes, we're aware the tomato is technically a fruit. The federal regulations cover both fruits and vegetables, but most folks in this debate are referring to tomatoes as vegetables. Just roll with it.)\n\nHow crazy is considering tomato paste on a pizza as a vegetable? One Washington Post Wonkblog reporter said that it's not as nuts as you might think. Sarah Kliff pointed out that two tablespoons of tomato paste offer up a nutritional profile comparable to a half-cup of apples or other fresh fruit. It offers more than a gram each of fiber and protein and more calcium and potassium than the apples.\n\nIt also packs beta carotene and the antioxidant lycopene, according the the USDA.\n\nWe should also note that the slices kids get at school aren't exactly the greasy, meat-laden marvels they might pick up at a pizza parlor. Federal nutrition standards require that school meals get no more than 30 percent of their calories from fat, and less than 10 percent from saturated fat. Schwan Food Co., which makes 70 percent of school-lunch pizza, started adding protein and whole grains to crusts and pushing down fat and salt to meet school standards.\n\nNot to mention, if that slice doesn't have at least two tablespoons of tomato paste on it, it's not going to fly. No creamy white or pesto pizza gets automatic credit. (Well, unless that pesto's made from enough basil or spinach ... but we digress.)\n\nStill, Margo Wootan, nutrition policy director for Center for Science in the Public Interest said in a Nov. 15 press release that, \"if finalized, this legislation may go down in nutritional history as a bigger blunder than when the Reagan Administration tried (but failed) to credit ketchup as a vegetable in the school lunch program. Pizza should be served with a vegetable, not count as one.\"\n\nShe's right that if the tomato paste didn't count as a serving of vegetables, kids would benefit from tomato-paste-covered pizza plus an additional serving of a vegetable.\n\nBut is this the great Reagan ketchup debacle?\n\nThe same amount of ketchup, according to the USDA, sneaks in about 10 times the sodium, contains just a third of the protein, less than a tenth of the fiber and more carbs and sugar. It offers smaller traces of vitamins, and half the beta carotene and lycopene. Tomato paste is not ketchup.\n\nStill, frozen pizza manufacturers and the frozen food industry did push hard to keep the vegetable designation for the tomato paste on the pizza. When it does, that's one less vegetable the school has to buy and a cheaper deal for school districts.", "Fewer vegetables for kids may not be exactly a win for America. But did House Republicans try \"to classify pizza as a 'vegetable' for the purpose of school lunches\"? They did fight for the classification for the sauce on the pizza and blocked a move by the Obama administration to boost the amount of tomato paste needed to count as a serving of vegetables. But they didn't try to classify \"pizza\" as a vegetable. And even the amount of tomato paste required, just two tablespoons, packs nearly the nutritional punch of a half-cup of other foods we consider healthy. That's a pretty important detail to omit. We call the Democrats' claim Half True.", "E-mail to Democrats sent by Brad Woodhouse, communications director, Democratic National Committee, Nov. 17, 2011\n\nDemocratic National Committee, \"Pizza Is Not A Vegetable,\" accessed Nov. 21, 2011\n\nE-mail interview with Brad Woodhouse, communications director, Democratic National Committee, Nov. 21, 2011\n\nE-mail interview with Corey Henry, vice president of communications for the American Frozen Food Institute, Nov. 21, 2011\n\nCBS News/Associated Press, \"Congress pushes back on healthier school lunches,\" Nov. 15, 2011\n\nSchool Nutrition Association, \"Update: House and Senate approve agriculture appropriations bill,\" Nov. 18, 2011\n\nHouse of Representatives, Consolidated and Further Continuing Appropriations Act 2012, Nov. 14, 2011\n\nWhite House, Signed Legislation, accessed Nov. 21, 2011\n\nMerriam-Webster, Tomato, accessed Nov. 21, 2011\n\nDepartment of Agriculture, \"Nutrition Standards in the National School Lunch and School Breakfast Programs,\" proposed rule, Jan. 13, 2011\n\nWashington Post's Wonkblog, \"No, Congress did not declare pizza a vegetable,\" Nov. 21, 2011\n\nNPR, \"Pizza As A Vegetable? It Depends on the Sauce,\" Nov. 15, 2011\n\nABC News' The Note, \"Veggie Politics: How Budget Cuts Can Make Pizza A Vegetable,\" Nov. 16, 2011\n\nWashington Post, \"Obama administration loses effort to make school lunches healthier,\" Nov. 15, 2011\n\nU.S. Department of Agriculture, \"What's In The Foods You Eat,\" accessed Nov. 21, 2011\n\nSchool Nutrition Association, \"Get the Facts: Healthy School Meals,\" accessed Nov. 21, 2011\n\nCenter for Science in the Public Interest, \"Congress Protects Pizza as a Vegetable in School Lunches,\" Nov. 15, 2011\n\nStar Tribune, \"Pizza still counts as a veggie in schools,\" updated Nov. 21, 2011\n\nAmerican Frozen Food Institute, \"American Frozen Food Institute Commends Congress for Balanced Approach on School Meal Standards,\" Nov. 15, 2011\n\nSchwan Food Co., Leading School Food Supplier, Schwan’s Food Service, Serves Up Industry’s First Portfolio of Products to Meet Proposed USDA School Meal Rules, Aug. 17, 2011", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]