["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "The graphic is unrelated to the coronavirus. It's from a 2017 CDC blog post that pointed out some of the problems certain types of beards could present with tight-fitting respirator masks.", "A 2017 CDC infographic shows how facial hair could interfere with respirator masks.", "The graphic is unrelated to coronavirus protection and the CDC has not recommended people should shave their beards to ward off the virus.", "Amid increased fears about a potential coronavirus outbreak in the United States, a Centers for Disease Control and Prevention graphic from 2017 has resurfaced online along with the claim that the organization is recommending men shave their beards to protect against the virus.", "This is not true. The organization has made no such recommendation.", "The wrong information developed out of a CNN wire story that was re-packaged by San Francisco-based news station Kron4.com. We saw it shared on plenty of other news websites.", "The story was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Though the original Feb. 26 CNN story differs slightly, it also states that the CDC has suggestions about facial hair in relation with coronavirus protection, and fails to mention that the graphic is old and has no connection to the illness.", "The infographic, which covers over 30 different types of facial hair styles, is from 2017 and is unrelated to the current coronavirus outbreak – or any other illness. It instead warns that some beard styles can interfere with face masks.", "The graphic was originally posted in a CDC blog post that year during \"No Shave November\" that pointed out some of the problems certain types of beards could present with tight-fitting respirator masks. It’s one of several respiratory protection posters for the workplace compiled by the National Institute for Occupational Safety and Health, a CDC department.", "The graphic is specific to respirators, which the CDC does not recommend using outside of the workplace for protection against the coronavirus:", "\"CDC does not recommend the routine use of respirators outside of workplace settings (in the community). Most often, spread of respiratory viruses from person-to-person happens among close contacts (within 6 feet). CDC recommends everyday preventive actions to prevent the spread of respiratory viruses, such as avoiding people who are sick, avoiding touching your eyes or nose, and covering your cough or sneeze with a tissue.\"", "For the record, a respirator is different than a surgical mask, as evidenced by this CDC graphic. Surgical masks aren’t considered adequate protection for respiratory illness, and only protect the face from large droplets and should be worn to shield others from your own coughs and sneezes.", "A headline claims that the CDC recommends men shave their beards to protect against coronavirus.", "The story, and others like it, say that facial hair can interfere with masks – and that isn’t untrue – but these posts in connection with the coronavirus are ultimately misleading.", "The story inaccurately says the CDC is telling people to shave their faces to help ward off the coronavirus and omits that the graphic was made years ago and unrelated to the current outbreak. It also misses health officials’ actual recommendation against using respirators for protection outside of the workplace.", "We rate it False.", "Web Archive, Kron4.com, CDC recommends men shave their beards to protect against coronavirus, Feb. 26, 2020", "Web Archive, CNN, The CDC has thoughts about soul patches and mutton chops. And they have to do with preventing coronavirus, Feb. 26, 2020", "World Health Organization, Coronavirus disease 2019 (COVID-19) Situation Report – 37, Feb. 25, 2020", "Centers for Disease and Control, To Beard or not to Beard? That’s a good Question!, Nov. 2, 2017", "Centers for Disease Control and Prevention, Frequently Asked Questions About Respirators and Their Use, Feb. 12, 2020", "Centers for Disease Control and Prevention, Respiratory Protection Infographics, Sept. 3, 2019", "Centers for Disease Control and Prevention, Understanding the Difference, Accessed Feb. 27, 2020", "New York Times, C.D.C. Officials Warn of Coronavirus Outbreaks in the U.S., Feb. 25, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]