["A video of policemen escorting a man from the basement of a building has been shared on social media as “terrorist” caught in Delhi’s Gaffar market. The person recording the video can be heard making this claim.", "Terrorist caught red-handed at Gaffar Market Delhi today 😯😎", "Posted by INDILAD on Wednesday, 29 July 2020", "The video is also floating on Twitter.", "Two terrorist at #GaffarMarket #CarolBagh New Delhi . One killed & another arrested .", "Need Confirmation ?? Is this Correct ?#Delhi #Terriorist pic.twitter.com/CXRbGPqZgC", "— Major Saurabh Sharma Retd (@MajorSaurabhSh1) July 29, 2020", "It has also been shared with a Hindi caption — “In Karol Bagh, Gaffar market, a terrorist was caught. Salute to Karol Bagh SHO and all staff. (करोल बाग़ गफ्फार मार्केट में टेररिस्ट को पकड़ा करोल बाग की पुलिस थाना प्रभारी और सभी इस्टाफ को सैल्यूट.)”", "करोल बाग़ गफ्फार मार्केट में टेररिस्ट को पकड़ा करोल बाग की पुलिस थाना प्रभारी और सभी इस्टाफ को सैल्यूट", "Posted by Shyam Jaggarwal on Wednesday, 29 July 2020", "Had a terrorist been caught in the national capital, it would be all over the news. However, the same has not been reported in the media. This suggested that the video must represent a mock drill conducted by the police.", "On July 29, journalist Tarun Sharma tweeted the clip and wrote in Hindi, “Today, Delhi police conducted a mock drill in Delhi’s Karol Bagh market. Such mock drills are often conducted before August 15. In this mock drill, police are taking three dummy terrorists into custody. This was conducted so that the police remains prepared in case of an emergency.” This was retweeted by DCP Central Delhi.", "Therefore, the claim that a terrorist was apprehended by the police in Delhi is false. Mock drill videos are often circulated as real incidents. Several such videos debunked by Alt News can be viewed here.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "Trigger Warning: Sexual Violence A distressing video of a girl forced to take her clothes…", "A clip featuring Pakistan men’s Cricket team captain Babar Azam is viral on social media…", "A 13-second clip featuring Bollywood actor Shah Rukh Khan is being shared on social media…", "Union minister of information and broadcasting Anurag Thakur on September 26 announced Waheeda Rehman as…"]