["The doctored image was published here on Facebook on October 21, 2019, in a Facebook group that has more than 366,000 members.", "The post has been shared more than 1,000 times.", "Below is a screenshot of the misleading Facebook post:", "The photo shows a Hong Kong police hat on a surface alongside six police warrant cards.", "The traditional Chinese characters written on a piece of paper underneath the objects translate to English as: “Carrie Lam does not represent me”.", "Carrie Lam is the chief executive of Hong Kong.", "The post’s traditional Chinese language caption translates to English as: “Cops make a clean break”.", "The post was published on the same day when Lam apologised to Muslim leaders after a mosque in the Tsim Sha Tsui district was sprayed with blue dye from a police water cannon during a pro-democracy protest on October 20, 2019. Here is an AFP report about the incident.", "The same photo was also published here and included here on Facebook, both carrying a similar claim.", "The claim is false; the photo has been doctored to include a message referencing Lam.", "A reverse image search on Google found the photo included in this news article published by Hong Kong news site Hong Kong Free Press on July 26, 2019.", "Below is a screenshot of the photo in the article:", "The article’s headline states: “Hong Kong’s chief sec. apologises over handling of Yuen Long attacks, stirring dissent from police”.", "The photo’s caption states: “A police cap and warrant cards placed next to the words, 'Matthew Cheung does not represent me.' Photo: supplied.”", "The article states in part: “Hong Kong’s number two official Matthew Cheung has apologised for the way the government handled the Yuen Long attacks on Sunday, and for the first time described its perpetrators as ‘thugs.’", "“However, his apology was denounced by some police officers, who appeared to have posted pictures distancing themselves from Cheung’s remarks.”", "Matthew Cheung is the chief secretary for administration of Hong Kong.", "This article published by Hong Kong newspaper South China Morning Post on July 27, 2019, explains the anger triggered amongst senior police officers after Cheung's apology over the force’s handling of a suspected triad attack in Yuen Long, a district in northwest Hong Kong.", "Below is a comparison of the misleading image (L) and the picture posted by Hong Kong Free Press (R):", "The Hong Kong Free Press article includes similar photos purportedly taken and posted online by police officers in a bid to express their anger towards Cheung.", "Below is a screenshot of the photo:", "The original version of the doctored image in the misleading posts was also published by other local media organisations in Hong Kong in July 2019, including news sites hk01 here and Stand News here.", "Both reports state the photo was posted online by police officers following Cheung’s comments regarding the Yuen Long attacks.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]