["The nine-minute video was published on Facebook here on September 1, 2020.", "The logo seen in the bottom left-hand corner of the footage reads: “MarjaeyatTVEN”.", "The post’s caption reads: “Ayatullah Ali Al Sistani heading on foot to revive Ashura night. He came out Publicily for Azadari this year 1442/2020. Long Live Our Marja.”", "Grand Ayatollah Ali Sistani is a major Shiite leader in Iraq and one of the most influential figures for Shiite Muslims across the region.", "Ashura is an Islamic holiday that Shiite Muslims observe to honour and mourn the martyrdom of Imam Hussain, the grandson of the Prophet Muhammad.", "Sistani warned worshippers to avoid participating in traditional Ashura gatherings because of the coronavirus pandemic, unless they could ensure social distancing. A statement from his office about the issue was published here by the Shia News Association, an international news website for Shiites, on July 30, 2020.", "“Azadari” is an Urdu word that translates to English as “mourning”. It is usually used in relation to Hussain. Marja is a title given to religious leaders.", "The video was also shared alongside a similar claim on Facebook here, here and here; and on YouTube here and here.", "The claim is false.", "Reverse image and keyword searches on Google found the footage was originally published here on the Facebook page of Marjaeyat TV.", "The two-hour video was posted on the network's Facebook page on August 30, 2020. It features a Farsi caption that translates to English as: “Walk of Supreme authority grand Ayatollah Sayid Sadiq Husseini al-Shirazi.”", "Sayid Sadiq Shirazi is a Shiite leader in the Iranian city of Qom.", "Below is a screenshot comparison of the video in the misleading post (L) and the Marjaeyat TV Facebook video (R):", "According to Marjaeyat TV’s Facebook page, the network is al-Shirazi's official channel, which airs his programmes in Qom.", "Al-Shirazi also posted  a tweet which shared images of the same event in Ashura on August 30, 2020.", "Like the previous years and coinciding with the morning of Ashura Day, the Grand Shia Islamic Jurist Ayatollah Sayed Sadiq Shirazi walked barefooted and without a cloak, to honor the martyrdom of the Master of Martyrs Imam Husayn (peace be upon him) ... pic.twitter.com/ceupqBYVCT", "The tweet reads: \"Like the previous years and coinciding with the morning of Ashura Day, the Grand Shia Islamic Jurist Ayatollah Sayed Sadiq Shirazi walked barefooted and without a cloak, to honor the martyrdom of the Master of Martyrs Imam Husayn (peace be upon him).\"", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]