["About this rating", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "After nearly a year of appearing to keep the coronavirus at bay, officials in Antarctica announced that the isolated southern continent registered dozens of COVID-19 cases in mid-December 2020. According to official COVID-19 figures reported by the Chilean government, at least 36 total cases were reported at the General Bernardo O’Higgins Base as of Dec. 22, 2020.", "Located on the northern point of the Antarctic Peninsula, the O’Higgins Base is a permanently staffed research station and capital of the Antártica Commune. It is operated by the Chilean army and can house up to 60 persons at a time, though it typically will accommodate around 44 during the peak Antarctic summer, which runs from December through March.", "The local Spanish-language news outlet 24 Horas was the first to report the outbreak in its Dec. 21 coverage. An official with the Chilean government confirmed that of the 36 individuals who tested positive for the virus, 26 were members of the Chilean army and another 10 were contracted workers scheduled to carry out maintenance work in the area. Contact tracing was being carried out and each person who tested positive was transferred to quarantine in Punta Arenas, Chile.", "Until the final days of 2020, Antarctica was the last continent on Earth to be free of the novel coronavirus. A study published in the Aug. 19 edition of Social Sciences and Humanities Open reviewed the long-term effects that the pandemic might have on life, research, and tourism in Antarctica. In it, the study authors described Antarctica as the “one place untouched.”", "To protect rotating researchers and residents at the 70 permanent stations across the continent, health experts have implemented safety protocols in response to the pandemic. For example, the Office of Polar Programs at the National Science Foundation developed a tiered rating system to ensure the safety of those working.", "“As people continue to arrive at the USAP stations after going through long periods of testing and quarantine, the station communities go into a 'yellow' level status to ensure the safety of everyone as COVID continues to spread in other parts of the world,” wrote the agency in a Nov. 12 Facebook post.", "“During 'yellow' status, strict measures are put into place, such as wearing facial coverings in all shared indoor spaces and vehicles, increased focus on personal hygiene and cleanliness, six feet of social distancing, and limiting occupancy in many indoor spaces.”", "It was not immediately clear how the outbreak started or why safety protocols appeared to have failed. We will update the article accordingly as more information becomes available.", "Madison Dapcevich is a freelance contributor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]