["About this rating", "One sub-genre of photography are the so-called \"perfectly-timed\" or \"just in time\" photographs, pictures that capture the coincidental confluence of multiple objects and events to create compelling or humorous images.", "One such image went viral in November 2015, a photograph supposedly showing a \"super moon positioned in just the right way so that from the photographer's vantage point it appeared to be perfectly resting atop a radio telescope, like an egg in a cup:", "As New Zealand's Northern Advocate explained, however, this ethereal image was actually a digital composite formed from separate images of the moon and a radio telescope by astro-photographer Chris Pegman:", "Kerikeri man Chris Pegman's usual hobby is astro-photography, capturing the night sky in hugely detailed panoramic images.", "Last Friday, however, he was having a bit of fun with a couple of photos. One was a night-time panorama of a radio telescope at Warkworth, taken last year for an online photo challenge; the other was a shot of the \"supermoon\" — when the moon is at its closest point to the Earth, making it looker bigger than usual — taken from Kerikeri a few months ago.", "He combined the two so the moon was resting perfectly in the radio dish and, chuckling to himself, uploaded the result to his Flickr page and an online photo competition called 500px. A few hours later a friend called to say his photo had gone viral.", "Someone had posted it on Imgur, a photo-sharing site. From there, someone else had posted it on Reddit. The image then popped up on Twitter and a raft of Facebook pages, including one dedicated to all things Warkworth.", "It also sparked debate about whether the image had been Photoshopped (it has) and whether it would be possible to create the image without Photoshop (the verdict was that it might be, but it would require an incredible amount of planning.)", "\"I was just having fun ... I didn't realise the gem I'd created\" [Pegman said]/", "The radio telescope image was taken on a Canon 6D with a 24m lens and consists of three photos stitched together. The supermoon was shot with a 70-200mm lens.", "de Graaf, Peter.   \"Supermoon Image Goes Into Media Orbit.\"\r\n    The Northern Advocate.   12 November 2015.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]