["About this rating", "Budweiser is changing its name to America for the summer of 2016.", "The name change isn't permanent.", "In May 2016, social media was overrun with claims that Budweiser was changing its name to \"America.\" Many were skeptical of the rumor:", "However, the story was legitimate.  Budweiser's own Facebook page shared a video on 10 May 2016 about the \"America\" label:", "According to a story from the Associated Press, Budweiser decided to temporarily change its name to capitalize on not just the U.S. presidential elections, but also the role the United States will be playing in several high-profile sports, such as the Copa America's first appearance in the United States:", "The red, white and blue campaign is being launched into a very competitive market already foamy with craft beers, and upon a drinking public bracing itself for a presidential election likely to be unlike any before it.", "\"We are embarking on what should be the most patriotic summer that this generation has ever seen, with Copa America Centenario being held on U.S. soil for the first time, Team USA competing at the Rio 2016, Olympic and Paralympic Games,\" said Ricardo Marques, vice president at Budweiser.", "Fast Company included more detail behind the marketing initiative in their 10 May 2016 coverage, noting that the change would remain in place until after the November 2016 general election:", "With the backdrop of the Olympics and a comically botched election, this summer is bound to be what Ricardo Marques, a vice president from Budweiser, calls \"maybe the most American summer ever.\"", "So Budweiser is going to potentially ingenious, potentially absurd branding extremes. The company has kept the same can you already know, but when you look closely, you’ll realize that it has swapped out its own name, \"Budweiser,\" for \"America.\" That’s right, Budweiser has renamed its beer America for the summer. \"We thought nothing was more iconic than Budweiser and nothing was more iconic than America,\" says Tosh Hall, creative director at the can’s branding firm JKR.", "It's pretty obvious what Budweiser is doing here. Summer is peak beer-selling season—the entire industry sees a double-digit boost. Since 2011, Budweiser has released special summer-edition cans that feature images such as the American flag and the Statue of Liberty, upping the ante on its red-white-and-blue packaging with a full salute to patriotism—as a nod to Memorial Day, July Fourth, and the quiet American dream of drinking a beer in your backyard while charring various processed meats.", "Summer is peak beer-drinking time, and for years, Budweiser has been using this time of year to release special cans to commemorate the season. This time, instead of just changing the cans, the company is temporarily re-branding its product.", "So while it it true Budweiser was renamed \"America,\" that change is only in effect until November 2016.", "Wilson, Mark.   \"Budweiser Renames Its Beer 'America.'\"\r\nFast Company.   10 May 2016.", "Asssociated Press.   \"Budweiser Becomes 'America.' Drink up. Or not.\"\r\n10 May 2016.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]