["A meme shared on Facebook makes an unfounded claim about the magnitude of wealth possessed by the Rothschild family.", "Memes pushing an old rumor about the Rothschilds, the influential European banking family, are making the rounds online.", "The post claims that the family \"holds about 80 percent of the world’s total wealth\" and has the ability to \"literally feed, clothe and settle every man, woman and child on the planet if they wanted to.\"", "It was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "It is true that the Rothschilds are quite wealthy – they have been since the 1700s – but to suggest they are in possession of 80 percent of the world’s wealth is a gross exaggeration.", "The Rothschilds are a famous, wealthy Jewish banking family from Europe. The family has long been the target of conspiracy theories, and their wealth is largely thought to be responsible for inspiring the anti-Semitic belief that Jews \"control\" the world’s money. (They’ve been wrongly blamed for everything from starting wars to sinking the Titanic to assassinating U.S. presidents..", "The family business began in the 1700s in Frankfurt when Mayer Amschel Rothschild became an apprentice at a small bank in Hamburg before returning home to start trading in rare coins. Soon, he began providing financial services for power brokers and, eventually, nobles.", "Mayer then dispatched each of his five sons to a different European city – London, Paris, Vienna, Naples and Frankfurt – to set up shop.", "The family’s dealings with various governments and savvy investments paid off handsomely, helping them establish a financial dynasty.", "While the Rothschilds certainly still have deep pockets, they have produced hundreds of descendants and there is no longer any centralized family wealth, nor does the family have the same kind of global power it did in the 18th and 19th centuries.", "With no monolithic house, the Rothschild name has connections to a number of independent business ventures and have investments in mining, energy, farming, real estate and winemaking.", "As the Financial Times once put it, \"The family empire is divided among a web of descendants and a few external shareholders. The ownership structure is opaque, which makes it hard to estimate the family wealth, although it is one of the richest in the world.\"", "The closest thing to a \"Rothschild’s family\" business today is the Rothschild Group, a multinational investment banking company. But the enterprise does not produce nearly enough money to back up the claim that the family controls 80 percent of the world’s money supply.", "The Rothschild Group's annual revenue was approximately $500 million in 2017 – less than what many corporations make. (Walmart, for example, boasted an annual revenue of about $500 billion in 2018.) In April 2017, the Rothschild’s net worth was estimated by Celebrity Net Worth to be around $400 billion.", "Aggregate global wealth, for comparison, reached $317 trillion in 2018, according to Credit Suisse Research Institute. That figure comes from an analysis of wealth held by 5 billion adults across the globe, from the least affluent to the wealthiest individuals to arrive at a figure that represents the world’s total household wealth.", "In 2012, Skeptoid, an award-winning weekly science podcast hosted by writer and producer Brian Andrew Dunning, explored the famous family’s history and noted that while the Rothschild’s are still a looming figure in the banking world, they are still dwarfed by larger, wealthier institutions.", "\"Make no mistake, it's a large and successful company; but with billions in assets, it's a relatively small fish in the sea of world financial institutions with trillions in assets,\" Dunning said then, \"including Deutsche Bank, Mitsubishi UFJ Financial Group, HSBC Holdings, BNP Paribas, Japan Post Bank, Crédit Agricole Group, Barclays PLC, Industrial & Commercial Bank of China, Royal Bank of Scotland Group, JP Morgan Chase & Co., and many others. Anyone trying to point the finger at the scattered Rothschilds as ‘controlling’ world banks has an awfully tall order. That little factoid is about 100 years out of date.\"", "While many Rothschild family members hold massive fortunes, it should also be noted only one made it on Forbes world billionaires list: Swiss banker Benjamin de Rothschild, who comes in at No. 1284 with a net worth of $1.6 billion.", "A meme recirculating the internet claims the Rothschild family \"holds about 80 percent of the world’s wealth,\" and thus has the ability to \"feed, clothe and settle every man, woman and child\" if they so choose.", "The family is certainly wealthy but claiming they control 80 percent of the world’s wealth is a tall order. There is no longer any centralized family wealth, with the closest being an investment banking firm. But the firm’s revenues are far less than what many corporations make.", "The rumor is a baseless exaggeration that furthers the spread of anti-Semitic theories.", "We rate it Pants on Fire!", "Facebook post, Jan. 5, 2019", "Washington Post, \"The Rothschilds a pamphlet by satan and anti-Semitic conspiracy theories tied to a battle 200 years ago,\" March 19, 2018", "Britannica, Rothschild Family, Accessed Jan. 7, 2018", "Statista, Walmart's net sales worldwide from 2006 to 2018 (in billion U.S. dollars) Accessed Jan. 8, 2018", "Credit Suisse, 2018 Global Wealth Report, Accessed Jan. 7, 2018", "Snopes, Rothschild Family Wealth, Oct. 30, 2016", "Skeptoid, Deconstructing the Rothschild Conspiracy, May 22, 2012", "Investopedia, Top 10 Wealthiest Families in the World, Oct. 8, 2018", "Financial Times, The Rothschild's family fortune, March 25, 2010", "Forbes, 2018 Billionaires list, Accessed Jan. 8 2019", "Celebrity Net Worth, Rothschild Family Net Worth, Accessed Jan. 8, 2019", "Bankrate.com, \"The Rothschild family’s net worth is $400 billion,\" April 21, 2017", "Rothschild & Co. Annual Report 2017, Accessed Jan. 7, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]