["State Sen. Mamie Locke, D-Hampton, recently defended Gov. Terry McAuliffe’s decision to restore voting rights to about 206,000 felons who have served their time and said Republicans opposing the action want to suppress turnout in this fall’s presidential election.", "Locke participated in a May 8 panel discussion of McAuliffe’s decree conducted by NewsOne.com, an outlet dedicated to presenting news to black Americans.", "\"There’s this feeling that somehow, since the governor did this, that somehow this state is once again going to vote for a Democrat for president of the United States,\" she said. \"So that is the fear, that somehow, these 206,000 individuals are going to vote for a Democrat.\"", "\"We do not have voters in this country flocking to the polls,\" she added. \"The United States has a low voter turnout rate. You would think that you would want individuals voting in this country.\"", "There’s no shortage of Republicans who are accusing McAuliffe of issuing the blanket restoration of rights to help presidential hopeful Hillary Clinton - his good friend and fellow Democrat - carry Virginia this fall. What caught our attention is Locke’s claim that the U.S. has a low voter turnout. We wondered if she’s right.", "Locke pointed us to a May 2015 study by the nonpartisan Pew Research Center. It examined voter turnout in the member nations of the Organization for Economic Cooperation and Development, a group of 34 democratic nations - mostly with industrialized economies - seeking to improve trade.", "Voting-age population", "Pew looked at OECD members’ most recent national elections. It computed the votes cast as a percentage of each country’s estimated voting-age population.", "In the U.S., Pew estimated that 53.6 percent of citizens old enough to vote participated in the 2012 presidential election. That ranked 31st among OECD nations. The only trailers were:", "•Japan, 52 percent in 2014;", "•Chile, 45.7 percent in 2013; and", "•Switzerland, 40 percent in 2011.", "By contrast, the five countries with the highest age-eligible turnout were:", "•Belgium, 87.2 percent in 2014;", "•Turkey, 86.4 percent in 2011;", "•Sweden, 82.6 percent in 2014;", "•Denmark, 81.8 percent in 2011; and", "•Australia, 80.5 percent in 2013.", "It’s important to note that three of the top five - Belgium, Turkey and Australia - have mandatory voting laws. There are 14 nations in the world that enforce such statutes, according to the International Institute for Democracy and Electoral Assistance.", "Registered voter turnout", "If Pew’s 53.6 percent voting-age participation estimate for the U.S. in 2012 sounds low to you, there’s a good reason.", "Turnout often is expressed as the percentage of registered voters who cast ballots and, under this measure, the U.S. does fairly well. In 2012, when President Barack Obama won a second-term challenge from Republican Mitt Romney, 84.3 of registered voters went to the polls - ranking seventh in that measurement among OECD countries.", "But Pew says national turnout comparisons based on registered voters \"may not be very meaningful.\" That’s because \"in most countries, the government takes the lead in getting people’s names on the rolls - whether by registering them automatically (as in, for example Sweden or Germany) or by aggressively seeking out and registering eligible voters (as in the U.K. and Australia). As a result, turnout looks pretty similar regardless of whether you’re looking at voting-age population or registered voters.", "\"In the U.S., by contrast, registration is mainly an individual responsibility,\" Pew says. \"And registered voters represent a much smaller share of potential voters in the U.S. than just about any other OECD country: Only 65 percent of the U.S. voting age population (and 71 percent of the voting-age citizenry) is registered, according to the Census Bureau, compared with 96 percent in Sweden and 93 percent in the U.K.\"", "For these reasons, Pew said that political scientists \"typically\" measure turnout by looking at the percentage of age-eligible people who went to the polls.", "We found one other data source that compares election turnouts based on countries’ voting-age population. The International Institute for Democracy and Electoral Assistance compiles that information for 109 nations and territories. The U.S., with its 53.6 percent turnout in 2012, ranked 73rd.", "Top on its list is Uzbekistan, a landlocked former member of the Soviet Union, where 98.4 percent of age-eligible people voted in its 2015 presidential election. At the bottom is Haiti, an impoverished Caribbean nation, had an 18.9 percent turnout.", "Our ruling", "Locke said \"The United States has a low voter turnout rate.\"", "She based her statement on a Pew study that shows the U.S. ranks 31st among 34 OECD nations in the percentage of age-eligible people who cast ballots in recent national elections. Wider data, compiled by the International Institute for Democracy and Electoral Assistance, ranks the U.S. 73rd among 109 nations and territories.", "We rate Locke’s statement True.", "State Sen. Mamie Locke, Interview with NewsOne, May 8, 2016.", "Email from Mamie Locke, May 10, 2016.", "NewsOne.com, \"About Us,\" accessed May 12, 2016.", "PolitiFact California, \"Mostly True: Bernie Sanders’ claim about America’s ‘lowest on earth’ voter turnout,\" March 23, 2016.", "Pew Research Center, \"U.S. voter turnout trails most developed countries, \" May 2015.", "International Institute for Democracy and Electoral Assistance, \"Compulsory Voting,\" accessed May 12, 2016.", "International Institute for Democracy and Electoral Assistance, \"VAP Turnout,\" accessed May 11, 2016.", "United States Election Project, FAQ, accessed May 12, 2016.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]