["The United Kingdom’s Guardian newspaper claimed nearly half of Kenya’s goods and services were produced in the country's capital city.", "In an article on unsafe abortions in Nairobi’s Kibera slum, the UK Guardian said the capital produced 45% of Kenya’s GDP.", "Earlier reports put the figure even higher.", "New data from Kenya’s statistics agency estimates that Nairobi accounted for an average of 21.7% of GDP from 2013 to 2017.", "In an article on unsafe abortions and urban poverty in Nairobi’s Kibera slum, the UK’s Guardian newspaper claimed nearly half of Kenya’s goods and services were produced in the capital.", "“Nairobi is the economic heart, accounting for 45% of the gross domestic product of a country approaching middle-income status,” it said.", "Is the figure correct? We checked.", "The journalist who wrote the article has not responded to our request for the source of the statistic.", "UPDATE: After we published this report, the author told Africa Check that the statistic was from a 2005 urban profile study of Nairobi by UN-Habitat, the UN agency that focuses on human settlements and urban development We are contacting the agency.", "Earlier reports put Nairobi’s share of GDP at 60%. They include:", "Nairobi county’s 2019/20 development plan", "A 2017 policy brief by the UN Development Programme", "A 2011 study on Nairobi’s future by the Institute of Economic Affairs, a local policy thinktank", "2009 research on Nairobi’s slum economies by the London School of Economics", "Nairobi is both a city and one of Kenya’s 47 counties. Until February 2019, the Kenya National Bureau of Statistics did not publish GDP figures for counties. But its latest report, prepared with help from the World Bank, does.", "Nairobi’s estimated share of national GDP from 2013 to 2017 was an average of 21.7%. Second was Nakuru county at 6.1%, with Kiambu (5.5%) in third place.", "Nearly a third of Kenya’s GDP comes from agriculture. Very little of this happens in the capital, said Dr Kennedy Opalo, an assistant professor at Georgetown University in the US with expertise in the political economy of development.", "“A lot of non-agricultural economic activity is concentrated in Nairobi.”", "This wasn’t unusual, as capital cities tended to contribute the most to their countries’ economies, Opalo told Africa Check. “Economic concentration of this kind is often unavoidable.”", "But the fact that one county out of 47 contributed a fifth of GDP “should worry the government because too much concentration may result in greater inequality at all levels of the income distribution”.", "The UK’s Guardian newspaper claimed Nairobi produced 45% of Kenya’s GDP. A February 2019 national statistics agency report, which included GDP estimates for counties, put the figure at an average of  21.7% from 2013 to 2017.", "But a development expert warned that the capital’s share of GDP – roughly a fifth – should still concern the government because too much economic concentration could lead to greater inequality.", "Further reading:", "https://africacheck.org/reports/kenya-logging-ban-do-senators-claims-about-gdp-and-demand-add-up/", "https://africacheck.org/reports/kenyas-2019-budget-speech-do-finance-ministers-numbers-add-up/", "Please complete this form to receive the HTML sharing code.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "For democracy to function, public figures need to be held to account for what they say. The claims they make need to be checked, openly and impartially. Africa Check is an independent, non-partisan organisation which assesses claims made in the public arena using journalistic skills and evidence drawn from the latest online tools, readers, public sources and experts, sorting fact from fiction and publishing the results.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "© 2023 - Africa Check - All rights reserved.", "We will never charge you for verified, reliable information. Help us keep it that way by supporting our work.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "Support independent fact-checking in Africa."]