["The 11-second video was posted here on Facebook on January 11, 2021. It has been viewed more than 700 times.", "The post's Indonesian-language caption translates to English as: “The victim’s tears are like the constant rain. The flight attendant’s last words on Sj182", "“Before the tragedy happened, she already had a hunch. Rest in peace in heaven now, younger sister”.", "Indonesia’s Sriwijaya Air Flight SJ 182, carrying 62 people on board, crashed into the Java Sea on January 9, 2021, just four minutes after taking off from Jakarta’s airport, AFP reported here.", "The footage has been viewed more than 77,000 times  after it was posted alongside a similar claim on YouTube here, here, here; as well as on TikTok here and here.", "The claim is false.", "An online search found the video was previously posted here on October 24, 2020, on TikTok account @cckimberlyangcay.", "The video’s caption reads: \"MY LAST FLIGHT AS A CABIN CREW vlog ?? yt link in my bio ?”.", "In the video, the woman can be heard speaking Tagalog, saying: “Guys, this flight is so (emotionally) heavy for me.”", "The logo for Cebu Pacific, a low-cost carrier from the Philippines, can be seen in the background of the clip.", "Below is screenshot comparison between the footage in the misleading post (L) and the original clip (R), with the logo of Cebu Pacific circled by AFP:", "Angelica Kimberly M. Angcay, the owner of the TikTok account, told AFP that she recorded the video on her last flight working as a Cebu Pacific cabin crew member in July 2020.", "“I could not help but break down during the flight because we received the email about the retrenchment while we were briefing before the flight,” the former flight attendant told AFP by Instagram message on January 22, 2021. “I really wanted to vlog my last flight and just enjoy it. I tried to contain my emotions that time, but I broke down during the flight.”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]