["About this rating", "Every crisis brings out the \"I-told-you-so\" contingent, the Cassandras who maintain after the fact that a realized danger was perfectly predictable (and therefore preventable). Unsurprisingly, during the COVID-19 coronavirus pandemic of early 2020, a popular social media post displayed covers of Time magazine issues bearing prominent warnings about global warming and pandemic — from 2006 and 2017, respectively:", "These images of Time covers are real and correctly dated. The first, from the April 3, 2006, issue, bore headline banners about a \"SPECIAL REPORT: GLOBAL WARMING\" which implored us to \"BE WORRIED. BE VERY WORRIED\":", "Polar Ice Caps Are Melting Faster Than Ever ... More And More Land Is Being Devastated By Drought ... Rising Waters Are Drowning Low-Lying Communities ... The climate is crashing, and global warming is to blame. Why the crisis hit so soon -- and what we can do about it", "Global warming is already disrupting the biological world, pushing many species to the brink of extinction and turning others into runaway pests. But the worst is yet to come.", "The second cover, from the May 15, 2017, issue, featured a large box proclaiming \"WARNING: WE ARE NOT READY FOR THE NEXT PANDEMIC\" advertising a feature story on the subject of \"The World Is Not Ready for the Next Pandemic\" which opened as follows:", "On a hyperconnected planet rife with hyperinfectious diseases, experts warn we aren't ready to keep America -- and the world -- safe from the next pandemic", "Across China, the virus that could spark the next pandemic is already circulating. It’s a bird flu called H7N9, and true to its name, it mostly infects poultry. Lately, however, it’s started jumping from chickens to humans more readily -- bad news, because the virus is a killer. During a recent spike, 88% of people infected got pneumonia, three-quarters ended up in intensive care with severe respiratory problems, and 41% died.", "What H7N9 can’t do -- yet -- is spread easily from person to person, but experts know that could change. The longer the virus spends in humans, the better the chance that it might mutate to become more contagious–and once that happens, it’s only a matter of time before it hops a plane out of China and onto foreign soil, where it could spread through the air like wildfire.", "Neither of these warnings was particularly new or revelatory, however. A 2018 \"Historical Overview of Climate Change Science\" report from the Intergovernmental Panel on Climate Change (IPCC), a United Nations body for assessing the science related to climate change, noted that \"The realisation that Earth’s climate might be sensitive to the atmospheric concentrations of gases that create a greenhouse effect is more than a century old.\" And increases in temperature correlated with increases in CO2 concentrations have been measured and noted at least as far back as 1938.", "Likewise, occurrences of plagues and pandemics have been charted across many centuries of human history, and we have been aware for a long time that bacteria and viruses that cause diseases in other animal species are capable of evolving to infect humans.", "Unfortunately, something that has also existed across the course of human history is our reluctance to bear the costs of preparing ourselves for dangers that we know are real but aren't more predictable in timing than \"some day.\"", "Live Science.   \"11 (Sometimes) Deadly Diseases That Hopped Across Species.\"\r\n    6 March 2020.", "Walsh, Bryan.   \"The World Is Not Ready for the Next Pandemic.\"\r\n    Time.   4 May 2017.", "BBC News.   \"A Brief History of Climate Change.\"\r\n    20 September 2013.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]