["About this rating", "A decision by Hyatt Hotels Corp. in September 2018 to ban hate groups from their properties led to an unfounded accusation that the chain was turning its back on all political conservatives.", "ACT for America (AForA) blamed a \"Soros-funded smear campaign\" -- invoking a popular conservative conspiracy -- for the hotel chain's decision in a statement posted online on 4 October 2018.", "\"Their decisions to ban 'hate groups' is in reality a decision to ban all freedom loving, flag waving, conservative Americans from their hotel chains,\" the statement read. \"While we have come to expect this from left-wing radicals, we certainly did not expect a prominent American hotel chain to weaponize their brand and influence against the conservative voice\":", "ACT for America's statement was released in response to Hyatt's announcement on 28 September 2018 that they would no longer allow groups \"who primarily seek to disparage or demean a specific group of people, to host meetings or events at our hotels.\"", "AForA has claimed that they are not an anti-Muslim organization and should not be excluded by Hyatt's hate groups policy. But AForA's leader, Brigitte Gabriel, has argued that the Arab world is beset by \"barbarism\" and that people in those countries \"are dead-set on killing and destruction.\" The group also organized \"March Against Sharia\" events in 2017, seizing on the conservative claim that \"Sharia Law\" is growing in the U.S.", "The Southern Poverty Law Center (SPLC) has designated AForA as a hate group, arguing that \"it pushes wild anti-Muslim conspiracy theories, denigrates American Muslims and deliberately conflates mainstream and radical Islam.\"", "Hyatt's policy announcement came shortly after one of their hotels in Crystal City, Virginia, hosted AForA's annual conference, during which Gabriel bragged that she had a \"standing meeting once a week\" with President Donald Trump.", "AForA's choice of conference site was first reported in February 2018, and it prompted a campaign by activist groups such as MoveOn and Muslim Advocates urging Hyatt to turn Gabriel's group away.", "On 30 August 2018, the activist groups delivered what they said were 100,000 signatures on a petition calling for Hyatt not to host AForA's conference, but the event was held as scheduled nonetheless.", "Scott Simpson, public advocacy director for Muslim Advocates, called Hyatt's decision \"a breath of fresh air\" and rejected AForA's claims about a blanket ban on conservatives.", "\"I certainly don't want conservatives banned from places,\" Simpson said. \"I don't stand for that, and I know Muslim Advocates don't stand for that.\"", "Meanwhile, there has been no sign that Hyatt hotels are turning away conservative events in general. The American Legislative Executive Council, which has championed conservative policies, is scheduled to hold a policy summit at a Hyatt hotel in Washington, D.C., in November 2018.", "Martin, Hugo.   \"Hyatt Hotels Won't Rent to Hate Groups, CEO Says; Muslim Group Claims a Victory.\"\r\n    Los Angeles Times.   28 September 2018.", "Southern Poverty Law Center.   \"ACT For America.\"\r\n    Accessed 5 October 2018.", "Barrouquere, Brent.   \"At Conference, ACT for America Brags About Access to White House, Donald Trump.\"\r\n    Southern Poverty Law Center.   10 September 2018.", "Mathias, Christopher.   \"Hyatt Hotel Says It Will Host Anti-Muslim Hate Group’s Conference.\"\r\n    Huffington Post.   15 February 2018.", "American Legislative Exchange Council.   \"2018 States & Nation Policy Summit -- Washington D.C.\"\r\n    Accessed 5 October 2018.", "Simpson, Scott. \"Nearly 100,000 Consumers, Faith and Civil Rights Advocates Tell Hyatt: Don't Host Major Hate Group.\"\r\n    Muslim Advocates.   30 August 2018.", "Arturo Garcia is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]