["About this rating", "In mid-2018, a meme widely shared on social media decried the passage of legislation by Missouri Republicans that allegedly lowered the minimum wage in St. Louis from $10 to $7.70.", "The $2.30 reduction in pay, the viral graphic warned, would harm more than 35,000 workers and their families:", "Although the subject matter was already a year old by the time the meme was brought to our attention (the legislative change didn't \"just\" happen), it describes an event that really did occur. What it lacks, obviously, is context.", "The minimum wage is a perennial topic of debate in American politics. Although public opinion polls indicate general bipartisan support for minimum wage increases perceived as reasonable, partisan disagreement remains not only over what constitutes a reasonable minimum wage level, but over who should set it (local, state, or federal governments), and whether or not it should even exist.", "Proponents say a minimum wage is necessary to ensure livable earnings for workers with the least bargaining power. A minimum wage that is at least indexed to inflation, they argue, reduces wage inequality, as well as injecting money into the economy and creating jobs by increasing consumer spending. Opponents argue that a too-high minimum wage hurts businesses and increases unemployment by forcing employers to lay off workers they can't afford. It also shuts younger and unskilled workers out of the workforce, they claim, because employers are unwilling to pay them higher wages.", "As of 2017, the U.S. federal minimum wage stood at $7.25 an hour, an amount that hadn't budged in eight years despite increases in the cost of living. For that reason, at least 29 states (including Missouri) had established state-wide minimum wages above the federal floor. Individual cities and counties took action as well, in many cases adopting local ordinances that raised minimum wages even higher than those set by their states.", "One place this latter action occurred was St. Louis, Missouri, where city officials decided in 2015 that the minimum hourly wage needed to be raised to $10 ($2.30 above than the state-mandated minimum of $7.70), with another increase (to $11) set to go into effect in 2018.", "The ordinance, which did not apply to small businesses employing fewer than 15 workers or grossing less than $500,000 a year, was intended to raise the standard of living for the lowest wage earners in a city where the poverty rate was twice the national average, according to a report in the St. Louis Post-Dispatch:", "The increase in St. Louis will give an immediate raise to an estimated 35,000 workers who will make, on average, $2,400 more each year, said Paul Sonn, general counsel for the National Employment Law Project, a nonprofit that advocates for a higher minimum wage. “That is enough to make a real difference for a waitress or a nursing home worker who is trying to get by on less than $18,000 a year.”", "Though its implementation was delayed for two years because of legal challenges by business groups, St. Louis's $10 wage floor finally took effect in May 2017, instantly adding an average of $200 a month to the incomes of tens of thousands of workers.", "Missouri governor Eric Greitens, a Republican, had been opposed to the increase all along, arguing that it would \"kill jobs\" and \"take money out of people's pockets.\" A Republican lawmaker, Jason Chipman, introduced a bill (HB 1194) that would pre-empt local minimum wage laws everywhere in the state. Days after the St. Louis ordinance went into effect, the Republican-dominated Missouri legislature passed the pre-emption bill in a party line vote, effectively overriding the local ordinance. When the bill became law at the end of August,  St. Louis's minimum wage reverted to $7.70, the same as the state's.", "Some disagreement remains over how many workers were actually affected by the changes in St. Louis's minimum wage. The meme cited a number (35,000 workers) taken from the St. Louis Post-Dispatch, which attributed the estimate to the non-profit National Employment Law Project (NELP).  However, researchers at the Federal Reserve Bank of St. Louis came up with a different estimate based on a distinction between resident and non-resident minimum-wage workers. Observing that \"only one-third of the workers in St. Louis City are city residents, and less than half of the city workers earning less than $10 per hour are residents,\" the researchers calculated that approximately 20,000 St. Louis residents saw an impact on their earnings. Including non-residents, they estimated that around 32,500 workers were affected, a slightly lower number than that estimated by NELP.", "On 1 January 2018, Missouri increased their statewide minimum wage by 15 cents, to $7.85 per hour. In May, a ballot initiative was proposed to raise the minimum wage to $8.60 in 2019 and an additional 85 cents per year thereafter, until it reaches $12 by 2023.", "Achenbach, Erin.   \"Missouri Businesses and Workers Submit Signatures for Minimum Wage Ballot Initiative.\"\r\n    St. Louis Public Radio.   2 May 2018.", "Barker, Jacob.   \"With State Law Set to Preempt St. Louis Minimum Wage, Groups Push for Missouri-wide Hike.\"\r\n    St. Louis Post-Dispatch.   28 August 2017.", "Bernstein, Jared and John Schmitt.   \"The Impact of the Minimum Wage.\"\r\n    Economic Policy Institute.   1 June 2000.", "Bernthal, Jeff.    \"Minimum Wage Increases Across Missouri.\"\r\n    KTVI-TV.   1 January 2018.", "Bott, Celeste.   \"St. Louis $10 Minimum Wage Will Revert Back to $7.70 in August, Greitens Announces.\"\r\n    St. Louis Post-Dispatch.   1 July 2017.", "Elis, Niv.   \"Poll: Bipartisan Majority Supports Raising Minimum Wage.\"\r\n    The Hill.   1 June 2017.", "Hirsch, Mitchell.   \"Missouri Lawmakers to Lowest-Paid Workers in St. Louis: We're Taking Back Your Raises.\"\r\n    National Employment Law Project.   19 May 2017.", "McDermott, Kevin.   \"After Two Years of Wrangling, St. Louis' New $10 Minimum Wage Could Be in Effect Within Days.\"\r\n    St. Louis Post-Dispatch.   2 May 2017.", "Noguchi, Yuki.   \"As Cities Raise Minimum Wages, Many States Are Rolling Them Back.\"\r\n    National Public Radio.   18 July 2017.", "Weller, Chris.   \"St. Louis' Minimum Wage Has Dropped After Missouri's Governor Said Increasing It to $10 Would Take 'Money Out of People's Pockets.'\"\r\n    Business Insider.   29 August 2017.", "Federal Reserve Bank of St. Louis.   \"Whom Would St. Louis' Minimum Wage Hike Have Impacted?\"\r\n    20 July 2017.", "Pew Research Center.   \"States with Minimum Wages Higher than the $7.25/Hr Federal Standard.\"\r\n    3 January 2017.", "ProCon.org.  \"Should the Federal Minimum Wage Be Increased?\"\r\n    25 April 2018.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]