["The claim was published on Twitter here on March 9, 2021, by Hans Masroor Badvi, the central deputy secretary of information of the Pakistan Tehreek-e-Insaf party for the province of Sindh.", "The Urdu-language tweet translates to English as: “Sadness! In the Women’s March, the French flag was hoisted and it was said that the women marchers are supporting the blasphemous France which is being boycotted all over Pakistan! Meaning they’re supporters of blasphemy?”", "Pakistani women celebrated International Women’s Day on March 8, 2021, with a series of Women’s March, also called Aurat March — aurat means women in Urdu — in cities across the country, as reported by local media Dawn newspaper and the News International.", "The post circulated several months after a wave of anti-French protests swept across the Muslim world following French President Emmanuel Macron’s refusal to renounce laws that permit the showing of blasphemous caricatures, AFP reported here. The issue began after a French teacher was murdered for showing his class a cartoon of the Prophet Muhammad in October 2020.", "Other posts making the claim that the French flag was raised at an Aurat March in Pakistan have been shared hundreds of times after appearing on Facebook here, here, here, here, here, here and here; and on Twitter here, here, here, here and here.", "Pakistani media outlets also published the claim; for instance in a Facebook post by 72News here and in a video news report by Neo News posted on YouTube here.", "The Neo News anchor’s opening comments in Urdu translate to English as: “Yesterday was the Women’s March in Pakistan and whatever happened in this women’s march you’ve already seen on TV screens. But a special thing happened in this march, a country’s flag was waived. Which country was this? Let’s watch the video and then decide why, what and who did this. Look at this. This is France’s flag. And what is the use of France’s flag in this Women’s March?”", "The video from Neo News was also shared on Facebook here and here.", "The claim, however, is false.", "The tricolour flag seen raised at an Aurat March represents the Women Democratic Front of Pakistan (WDF), a feminist organization based in Islamabad, the capital of Pakistan.", "In a tweet from WDF’s official account, the group explained the flag “represents grassroots feminism in Pakistan and has nothing to do with the French flag. We, at WDF, stand against all forms of imperialism and the accusation that we would ever wave the flag of a former colonial power is ridiculous.”", "The WDF flag represents grassroots feminism in Pakistan and has nothing to do with the French flag. We, at WDF, stand against all forms of imperialism and the accusation that we would ever wave the flag of a former colonial power is ridiculous. pic.twitter.com/oZIjDB8XGu", "In a text graphic, the WDF’s tweet added that the organisation’s flag is red, white and purple — not the French blue, white and red colours.", "The WDF also tweeted a video showing the organisation’s flag being raised at the Women’s March in Islamabad on March 8, 2021, which corresponds to the video and photos shared in the misleading posts.", "Below is a screenshot comparison of the flag from the WDF’s video on Twitter (L) and the video shared in the misleading post (R):", "AFP Fact Check previously debunked a false claim about a placard carried by a participant at a Women’s March in Pakistan in March 2020.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]