["About this rating", "In November 2018, Facebook users shared a boilerplate post which claimed that Rosalind Brewer, Chief Operating Officer (COO) of the behemoth Starbucks coffee chain, had once declared a belief that \"white men are the root of all evil\":", "On 4 November, a user on the \"Tiger Droppings\" web forum shared the same claim, along with a link to an article on NewsPunch, the rebranded name for the notorious junk news purveyor Your News Wire:", "An archived version of the original article shows that it was published on Your News Wire in February 2018 and was the original source for the claim that spread on Facebook several months later.", "The article, under the headline \"Starbucks CEO: White Men Are Root of All Evil,\" read as follows:", "Starbucks newly appointed CEO Rosalind Brewer has shocked shareholders after it was revealed she believes white men are the root of all evil. According to a recently surfaced 2015 CNN interview, Brewer says she is extremely “triggered” by the sight of white men in business.", "Silenceisconsent.net reports: \"The Washington Post reported on a particular exchange in the interview. CNN’s Poppy Harlow asked Rosalind Brewer about what it would take to see more women at the top of corporate America. Brewer answered.", "'My executive team is very diverse, and I make that a priority,” she told Harlow. “I demand it of my team and within the structure. And then, every now and then, you have to nudge your partners, and you have to speak up and speak out. And I try to use my platform for that ... I try to set an example. I try to mentor many women inside my company and outside the company because I think it’s important.", "'And I talk to my suppliers about it. Just today we met with a supplier, and the entire other side of the table was all Caucasian males. That was interesting. I decided not to talk about it directly with [the supplier’s] folks in the room because there were actually no females, like, levels down. So I’m going to place a call to him.'\"", "You may have noticed the chain of sourcing at work in Your News Wire/Newspunch's article: it quoted from SilenceIsConsent.net (a hyperpartisan right-wing web site with a history of putting exaggerated, misleading, or sensationalised twists on news stories), which in turn quoted from a Washington Post article, which in turn described a 2015 CNN interview with Brewer, who was then CEO of the Walmart subsidiary Sam's Club.", "At no point did the Your News Wire/Newspunch article include any statement by Brewer in which she said that she was \"triggered\" by the sight of white men in business, or that she believed \"white men are the root of all evil.\"", "A brief check on all the sources cited in the article showed that neither SilenceIsConsent.net, the Washington Post, nor CNN's original interview contains such statements by Brewer.", "SilenceIsConsent.net falsely claimed, based on the 2015 interview, that Brewer (who is black) \"doesn't really like white guys\" (and also misidentified her as Starbucks' CEO) and the Post reported on a Twitter-driven backlash against Brewer's interview, which some commenters claimed revealed an \"anti-white\" viewpoint on her part.", "The interview, which was posted to YouTube by Walmart in December 2015, can be viewed below. Here's an excerpted transcript, which makes clear that Brewer never said \"white men are the root of all evil\" (or anything approximating that sentiment) and was expressing her enthusiasm for racial and gender diversity within Sam's Club, as well as an aversion to racial and gender-based homogeneity, rather than an aversion to white men as such:", "Poppy Harlow: You are a rarity in the corner office in America, and it is something that so many people want to see change. Not only are you a female CEO, you are a minority CEO. Where do you fall on who has to make the change and how it is going to happen, so that there are more women like you represented in the top echelons of corporate America?", "Rosalind Brewer: I totally agree with you, but it starts with the top of many companies, it has to start with top leadership. I can tell you that, even with myself, I have to live it also. My executive team is very diverse and I make that a priority. I demand it of my team and within the structure, and then every now and then you have to nudge your partners, you have to speak up and speak out, and I try to use my platform for that, to remind people. I try to set an example, I mentor many women inside my company, and outside the company, because I think it's important.", "Harlow: And in hiring, do you demand it [diversity] when you're hiring for the top spots?", "Brewer: Absolutely, and not only that, I talk to my suppliers about it. Just today, we met with a supplier and the entire other side of the table was all Caucasian male -- that was interesting.", "Harlow: What did you say?", "Brewer: Well I decided not to talk about it directly, with his folks in the room, because there were actually no females, levels down. So I'm going to place a call to him.", "This subject was revived in October 2019 via an article published by The LA Post and headlined \"The NEW Starbucks CEO Has Admitted She Doesn’t Like White People ...\"", "Adl-Tabatabai, Sean.   \"Starbucks CEO: White Men Are Root of All Evil.\"\r\n    Your News Wire/Newspunch.   17 February 2018.", "Medina, Victor.   \"Starbucks' New CEO Rosalind Brewer Doesn't Really Like White Guys.\"\r\n    SilenceIsConsent.net.   September 2017.", "Bever, Lindsey.   \"Sam's Club CEO Called 'Racist' for Remarks on Diversity.\"\r\n    The Washington Post.   15 December 2015.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]