["The photo was published on Facebook here on November 19, 2019. It has been shared more than 1,100 times.", "The post's Hindi-language caption translates to English as: “You will get to know all the hidden truth behind the JNU protest if you look at this poster carefully. If they are protesting against fee hike then why this placard against RSS.\"", "The caption uses the acronym JNU in reference to Jawaharlal Nehru University where students have been protesting against a proposed increase to various fees. Baton-wielding police responded to the unrest with a crackdown on November 19, 2019, AFP reported here.", "The caption also refers to a placard visible in the photo that reads in English and Hindi: “Down with RSS: SFI”.", "RSS refers to the Hindu nationalist group Rashtriya Swayamsevak Sangh while SFI refers to the Student Federation of India, the student wing of the Communist Party of India - Marxist (CPI-M).", "Below is a screenshot of the misleading Facebook post:", "The photo was also shared here, here, here and here on Facebook and here, here, here and here on Twitter alongside a similar claim.", "The claim is false; the photo actually shows a 2016 student protest in New Delhi against the RSS following the suicide of a university student in Hyderabad.", "A reverse image search on Google found the same photo was published here on February 2, 2016 in a report by Catch News, an India-based current affairs website. The report was updated on February 14, 2017.", "Below is a screenshot of the report:", "“#RohithVemula: female eye-witness on horror of being assaulted by Delhi police,” reads the headline of the report.", "Vikas Kumar, a journalist in New Delhi who previously worked at Catch News, told AFP that he took the photo on January 31, 2016 during a protest outside the RSS office.", "The student protesters, Kumar said, were marching against the RSS after the suicide of Rohit Vemula, a Dalit student at Hyderabad Central University who reportedly took his life on January 17, 2016 following alleged harashment and caste discrimination by the university administration.", "“They were intending to hold a protest demonstration before the RSS’ Delhi office, but the police personnel started beating the protesting students soon after they reached near the RSS office. The police didn't even spare journalists who were there to cover the protest,” Kumar told AFP by phone on November 22, 2019.", "Kumar also shared photos of the 2016 protest with AFP that he took, one of which he published on his Facebook page here on January 31, 2016.", "Below is a screenshot comparison of the photo in the misleading Facebook post (L) and a second photo of the 2016 protest posted on Facebook by Kumar (R) with corresponding references circled in green:", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]