["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Sacker is a freelance photojournalist. CNN said she has never worked for the network. NPR said she once took photos for its network. Both said she was not working for them during the Jan. 6 attack on the U.S. Capitol.", "Sacker was with controversial Utah activist John Sullivan inside the Capitol during the attack. She said she was there to work on a documentary about him.", "Sullivan has denied being an anti-fascist activist and there is no evidence that antifa was behind the attack. He was arrested in connection with the attack nine days after it happened.", "A conservative website claimed that a CNN and NPR journalist joined an anti-fascist leader in inciting the Jan. 6 attack on the U.S. Capitol.", "The headline of the Gateway Pundit article stated:", "\"CNN-NPR Photo-Journalist Jade Sacker was Embedded with Antifa Leader John Sullivan During Siege of US Capitol", "The article, widely shared on Facebook, was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The text of the article refers to Sacker as a CNN photojournalist and later says, \"Sacker has done work for NPR, CNN, NBC and other liberal outlets.\"", "CNN and NPR denied Sacker was working for them during the Capitol attack, and CNN said she has never worked for the network. Sacker said she was there with Sullivan as part of a documentary she is producing about him and his brother James, who is described as a conservative activist. Sacker told the Associated Press her film \"intends to portray the emotional interior of the family’s story as they become divided\" by the brothers’ \"opposing political activism.\"", "There is no evidence Sacker was at the Capitol working for a news organizationworking for a news organization covering the siege. Sullivan has denied having any connection with a broad coalition of left-wing activists known as antifa, and there is no evidence that antifa activists incited the attack. However, Sullivan was arrested in connection with the attack.\n\nSacker not working for a news organizationfor a news organization at the Capitol", "Both CNN and NPR said Sacker was not working for them at the Capitol.", "CNN spokesman Matt Dornic said: \"Jade Sacker was not at the Capitol on our behalf. She does not work for CNN in any capacity and has never been employed by our organization.\"", "NPR spokeswoman Isabel Lara said: \"NPR retained Jade Sacker in October of 2020 for a freelance photography assignment. She has not performed any services for NPR since. She was not at the Capitol at our request or on our behalf. If we determine that her actions in any way contributed to the incident at the Capitol, Ms. Sacker will not be engaged by NPR again.\"", "Sacker, who says she is a documentary photographer, lists NPR and CNBC among her clients. She told PolitiFact for a previous fact-check that she is a documentary filmmaker working on a project about Sullivan and his brother, and was alongside Sullivan for much of the riot.", "She did not return a call for this fact-check.", "Sullivan is a Utah resident and the founder of Insurgence USA, an activist group against police brutality, who joined supporters of President Donald Trump who stormed the Capitol. He has denied any affiliation with antifa, although he has posted related hashtags on his Twitter accounts. There remains no legitimate evidence that the mob at the Capitol was infiltrated or led by antifa activists in disguise.", "We rated as Mostly False a claim shared on Facebook that Sullivan incited the riot at the Capitol. incited the riot at the Capitol.", "On Jan. 15, Sullivan was arrested in connection with the Capitol attack. He was charged with one felony count of interfering with law enforcement in connection with a civil disorder, as well as misdemeanor charges of unlawful entry and disorderly conduct.", "An affidavit from an FBI agent filed in support of the criminal complaint and arrest warrant noted that, despite Sullivan’s claims that he was present as a journalist, he has no press credentials and is not affiliated with any journalistic organization. The affidavit does not say Sullivan led the mob or had a special role organizing it.", "An article widely shared on Facebook claimed that \"CNN-NPR photojournalist Jade Sacker was embedded with antifa leader\" during the U.S. Capitol attack.", "Sacker is a freelance photojournalist. CNN said she has never worked for the network. NPR said she once took photos for its network. Both said she was not working for them during the Jan. 6 attack on the U.S. Capitol.", "Sacker was with Utah activist John Sullivan inside the Capitol during the attack. She said she was there to work on a documentary about him.", "Sullivan has denied being connected with antifa and there is no evidence that antifa incited the attack. He was arrested in connection with being inside the U.S. Capitol nine days after the attack.", "We rate the statement Mostly False.", "Note: On Jan. 18, 2021, after this article was published, Sacker confirmed that she was not working on Jan. 6 for CNN or NPR and that she was accompanying Sullivan at the Capitol as part of her documentary on him.", "Gateway Pundit, \"HUGE! CNN-NPR Photo-Journalist Jade Sacker was Embedded with Antifa Leader John Sullivan During Siege of US Capitol – Cheered \"We Did It!\" After Inciting Riot,\" (archived here),", "Associated Press, \"Woman in video at Capitol with arrested activist is not with CNN,\" Jan. 17, 2021", "Email, CNN spokesman Matt Dornic, Jan. 18, 2021", "Snopes, \"Does Jade Sacker Work for CNN?\", Jan. 15, 2021", "Email, National Public Radio spokesman Isabel Lara, Jan. 18, 2021", "Lead Stories, \"Fact Check: Two CNN Journalists Were NOT Arrested For Infiltrating U.S. Capitol Dressed As Trump Supporters,\" Jan. 15, 2021", "PolitiFact, \"Facebook posts wrongly claim left-wing activist, antifa ‘incited’ US Capitol mob,\" Jan. 8, 2021", "Text message, Jade Sacker, Jan. 18, 2021", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]