["About this rating", "Today's lesson: Be skeptical of names that are spelled with numbers.", "Rumors holding that New England Patriots coach Bill Belichick reversed a decision to sign National Football League quarterback Colin Kaepernick after a phone call with President Donald Trump quickly traveled around social media, after a spoof Twitter account posing as ESPN reporter Adam Shefter posted the following tweets:", "These tweets were not sent by Adam Schefter's genuine Twitter account (located at @AdamSchefter).", "Colin Kaepernick filed a lawsuit against the NFL in October 2017, alleging that team owners had colluded to keep him out of the league because he protested against police brutality and social inequality by kneeling during the national anthem, sparking waves of protests and ongoing discussions about free speech.", "A common trolling tactic on Twitter is to create an account that slightly alters the Twitter handle of a well-known personality. In this case, the @AddamScheft3r account added an extra \"d\" to the name and replaced an \"E\" with a \"3.\" These small changes can easily be missed by social media users skimming through their feeds.", "Although this spoof account fooled many people at first blush, it does provide several hints about its lack of authenticity. The profile, for instance, simply read \"made you look.\" The account also posted a tweet warning people about fake accounts:", "At the time of this writing, the tweet admitting that the account was fake had 0 retweets. By comparison, the tweet claiming that the Patriots had signed Kaepernick had dozens.", "Shortly after this article was published, the fake Adam Schefter account was deleted and replaced with an account mimicking Pro Football Talk's Twitter account. The spoof account employed the same tactic, replacing a letter with a number, to make it appear as if the tweets came from the genuine account. In this case, the \"o\" in \"Pro\" was replaced with a zero:", "Neuman, Scott.   \"Kaepernick Files Grievance Saying NFL, Owners Conspired To Shut Him Out.\"\r\n    NPR.   16 October 2017.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]