["Singer Caralisa Monteiro had recently tweeted a morphed screengrab of an OpIndia article. She later took down her tweet. Soon after, another screenshot was widespread. But this time in Monteiro’s name. It showed that the singer had tweeted, “Every time a Hindu is killed, I get orgasmic pleasure. Modi might dream Congress Mukt Bharat, but we will get Hindu Mukt India soon. Amen!”", "OpIndia published a story around the alleged tweet in both English and Hindi. The story, apart from taking personal digs, attempts to show how Monteiro herself is a ‘fake news peddler’. Ironically, it also says that the tweet viral in her name may be fake.", "This slideshow requires JavaScript.", "BJP member Surendra Poonia also shared the alleged tweet, drawing over 5,000 retweets.", "Twitter user @woman_tigress tweeted the screenshot and wrote, “Doesn’t this break any rules ? @Twitter”. This tweet also gained over 5,000 retweets.", "The screenshot carries the date ‘January 1’ which means despite Monteiro posting the alleged tweet more than a month ago, only now is it drawing criticism. This was the first red flag.", "A closer look at the screenshot reveals inconsistencies when compared with a genuine tweet.", "1. The top right corner should have three dots for the drop-down menu, not a downward arrow.", "2. A dot is missing after ‘2021’ in the date and so is the name of the device used to post the tweet.", "3. The bar that shows the number of retweets, quote tweets and likes for a tweet is also absent from the viral screenshot.", "Monteiro quote-tweeted a user who had posted the viral screenshot and said that “a case has been filed against this fake tweet”.", "Tell your dad WhatsApp University band kar lo.", "And a case has been filed against this fake tweet. https://t.co/7kLkBY7Lrx", "— Caralisa Monteiro (@runcaralisarun) February 6, 2021", "OpIndia founder Rahul Roshan had tweeted the fake screenshot in response to Monteiro tweeting the morphed screengrab of OpIndia’s article. He later took it down but an archived link can be accessed here.", "Multiple Twitter users have discussed that Roushan created the fake tweet as ‘revenge’. (1,2,3)", "OpIndia, therefore, wrote two articles targeting singer Caralisa Monteiro based on a fake tweet that was shared by its founder Rahul Roushan.", "Donate Now", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]