["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "President Donald Trump speaks during a rally on Aug. 21, 2018, in Charleston, W.Va. (AP/Alex Brandon)", "Like many politicians, President Donald Trump often refers to economic growth to gauge the success of his policies. And one of the most common yardsticks politicians use is gross domestic product, which is the sum of all economic activity in a geographical unit, such as a country or a state.", "At a rally in Charleston, W.Va., on Aug. 21, Trump said, \"When I came here originally, West Virginia, frankly, was down and out. It was not doing exactly well. One of the last. Do you know that a few months ago, it hit where West Virginia is, on a per capita basis, one of the most successful G.D.P. states in our union?\"", "Does he have a point? We took a closer look.", "This isn’t the first time Trump has claimed success in revitalizing West Virginia's economy. A little over a year ago, he said at a different rally in the state, \"3 percent growth in West Virginia. … West Virginia, you’re leading the average.\"", "At the time, PolitiFact found that assertion to be well-grounded.  During the first quarter of 2017, West Virginia’s economy grew by exactly 3 percent, according to the data available at the time. (This figure was subsequently updated with new data, as is the standard procedure.)", "That was the second-fastest rate of any state in the country at the time. It was well above the national average for the first quarter, which was 1.2 percent.", "However, as we noted at the time, that was only one quarter’s worth of growth. How well has The Mountain State done since then?", "It’s been a bit of a roller coaster, according to data from the federal Bureau of Economic Analysis.", "Here are the figures for annualized GDP growth for West Virginia on Trump’s watch. They are the most recent figures available, including updated data for the previous quarters.", "Quarter", "Annualized GDP growth for West Virginia", "1st quarter 2017", "6.6 percent", "2nd quarter 2017", "-1.1 percent", "3rd quarter 2017", "10.2 percent", "4th quarter 2017", "1.0 percent", "1st quarter 2018", "1.3 percent", "This chart shows that while West Virginia has had some highs in GDP growth during Trump’s tenure -- specifically, in the first and third quarters of 2017 -- the state’s GDP actually shrank during the second quarter of 2017, and in the most recent two quarters, it has grown only modestly, by 1 percent and 1.3 percent, respectively.", "In fact, during the most recent quarter for which data is available, West Virginia’s growth rate ranked as only the 37th best in the nation. That paints a different picture than the one Trump was offering at the rally.", "There’s another way to look at Trump’s assertion -- to compare gross domestic product per capita for West Virginia to the other states in the union. This statistic is calculated by dividing the state’s GDP by the state’s population.", "Measuring it this way makes Trump’s statement even less accurate.", "For 2017 -- the most recent full year for which data is available -- West Virginia ranked 47th nationally in GDP per capita, according to the Bureau of Economic Analysis. The only states that ranked lower were Arkansas, Idaho and Mississippi.", "Finally, we’ll note that economists say presidents don’t deserve either full credit or full blame for employment trends on their watch. The president is not all-powerful on economic matters; broader factors, from the business cycle to changes in technology to demographic shifts, play major roles.", "Trump said, \"A few months ago, it hit where West Virginia is, on a per capita basis, one of the most successful (gross domestic product) states in our union.\"", "Judging by quarterly GDP growth -- a measure Trump has used accurately in the past to talk about West Virginia -- the state chalked up two quarters of rapid growth but three quarters of stagnation. In the most recent two quarters, West Virginia was mired around 1 percent growth, ranking in the bottom half of states.", "Alternately, using GDP per capita, Trump is way off, as West Virginia ranks 47th among the states in this measure.", "The statement contains an element of truth but ignores evidence that would give a different impression, so we rate the statement Mostly False.", "Donald Trump, rally in Charleston, W.Va., Aug. 21, 2018", "Bureau of Economic Analysis, annualized state GDP growth, first quarter 2017 to first quarter 2018", "Bureau of Economic Analysis, GDP per capita, 2017", "New York Times, \"Trump’s False Claims About Coal, the Environment and West Virginia,\" Aug. 21, 2018", "PolitiFact, \"Fact-checking Donald Trump's rally in West Virginia with Gov. Jim Justice,\" Aug. 3, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]