["In August 2019, the Union government abrogated key provisions of Article 370, altering the status of Jammu & Kashmir. Since then, social media has witnessed relentless attempts to justify or criticize the move, often through misinformation. A set of photographs has been shared on social media to portray normalcy in Kashmir, nearly two months after the dramatic step of August 5.", "3 Pictures clicked today from #Kashmir as a reply to your fake tweets and Anti India Propaganda @arjunsethi81", "Have a nyc Day #JaiHind @adgpi @JmuKmrPolice @crpfindia @ZPHQJammu @drmonika_langeh @ashokepandit @KhajuriaManu pic.twitter.com/GxFqAbCnof", "— Ashish Kohli 🇮🇳 (@dograjournalist) October 3, 2019", "The above post is by Ashish Kohli (@dograjournalist) who is followed on Twitter by the Office of Nirmala Sitharaman. Kohli describes himself as a journalist who “Reports Border Conflicts and Terrorism from J&K”, and his Twitter bio reads, “A Proud Jammu Citizen blocked by my former CM Mehbooba Mufti”. He has tweeted three photographs which, he claims, have been clicked today (October 3). He calls these photographs a response to “fake tweets” and “Anti India propaganda”.", "A comment by a user on Kohli’s tweet suggested that the photographs are old. Based on this information, Alt News found that the photographs tweeted as recent, were indeed clicked earlier. Let us take a look at each of these pictures.", "Alt News reverse-searched the above photograph and came across a tweet from March 2019 by a journalist, Sameer Yasir. The same photo was tweeted on March 22, 2019, more than four months before the Central government’s move on Article 370.", "Two militants died in Baramulla and no hartel (strike) today in the town. And it is a Friday! pic.twitter.com/BB6yjhk1yR", "— Sameer Yasir (@sameeryasir) March 22, 2019", "The above photograph had appeared in an article on Kashmir Life, in April 2017.", "Alt News found that the above photograph had appeared in an article on Daily Excelsior, a J&K daily, in November 2016. The report is from Srinagar.", "Old photographs from Kashmir have been falsely shared as recent, in a bid to portray normalcy in the region, weeks after the revocation of key provisions of Article 370.", "Donate Now", "Arjun Sidharth is a writer with Alt News. He has previously worked in the television news industry, where he managed news bulletins and breaking news scenarios, apart from scripting numerous prime time television stories. He has also been actively involved with various freelance projects. Sidharth has studied economics, political science, international relations and journalism. He has a keen interest in books, movies, music, sports, politics, foreign policy, history and economics. His hobbies include reading, watching movies and indoor gaming.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]