["About this rating", "A Virginia-based LGBTQ advocacy group drew widespread media attention towards a middle school after posting their account of school official's failing to ensure a transgender student's safety during a shooting safety drill.", "According to Equality Stafford, the incident took place during a \"lockdown\" drill at an undisclosed school on 28 September 2018.  The student, a transgender girl, was taking part in the drill during her physical education class but was not allowed to take shelter in a locker room alongside her fellow students.", "This past week, an incident occurred during a middle school lock down drill in Stafford County. When the drill began, a particular class of children took shelter in the bathroom/locker room nearest them as they were in PE. One student was prevented from entering either the boys or girls locker room while the teachers discussed where she should go. The student was forced to watch the adults charged with her care, debate the safest place (for the other students) to have her shelter. During this debate, she was instructed to sit in the gym with a teacher until the drill was complete, away from her peers and identified as different. After some additional debate, she was made to sit in the locker room hall way, by the door away from her peers. This happened because the child, in addition to being a model student, also happens to be transgender.", "Let me be clear. During an event that prepares children to survive an attack by actual assailants, she was treated as if she was so much of a danger to peers that she was left exposed and vulnerable.", "Equality Stafford noted that the teachers themselves were not to blame, saying: \"It is important to highlight that the child’s PE teachers are not the bad guys. They are teachers without guidance in a county without guidance for these issues. They were following that they were told to do.\"", "The post has been shared more than 1,200 times on Facebook since being published on 3 October 2018:", "A spokesperson for Stafford County Public Schools (SCPS), Sherrie Johnson, released a statement saying that the incident was under review:", "Stafford County Public Schools does not comment on individual student incidents to avoid divulging confidential information. However, the new superintendent has requested a review of all protocols and procedures to ensure that all children are treated with dignity and respect. We take such matters very seriously and they will be addressed. The welfare of all students is of the utmost importance for SCPS.", "The story was also picked up by local and national news outlets, and we contacted Equality Stafford seeking more information.", "One of the group's leaders, Lesley Woods, has said that the Facebook post was based on information provided by the girl's family, adding: \"This is nothing new for the family. They are a solid family and they are very much in support of their child, and they are really solid advocates for the community. So I would say all in all, the rest of us are shocked and appalled and motivated to come and speak and learn, but this family, this is their life everyday.\"", "During a school board meeting on 9 October 2018, a family friend read a statement from the girl asking school staff to stop treating her like a predator, saying: \"If there was someone armed in my school, I would have been the first one gone. I felt like an afterthought. If the whole thing wasn't bad enough, the embarrassment caused me to have a panic attack in front of everyone.\"", "Superintendent Scott Kizner did not approve any specific policies regarding inclusion of LGBTQ students but reiterated that the district would review their current guidelines and make changes at necessary.", "\"We did not live up to my unwavering expectation that every child and adult—regardless of race, religion, color, disability, gender and sexual orientation is treated with respect and dignity,\" Kizner said during the meeting. \"And for that I apologize to the student, the family and the Stafford community.\"", "In March 2015, the same school board voted not to allow another transgender student, a fourth-grader, to use a restroom according to their gender identity after receiving complaints from both parents and local politicians.", "Leshan, Bruce.   \"Transgender Student Barred from Shelter in Locker Rooms During School Safety Drill.\"\r\n    WUSA-TV.   4 October 2018.", "Lambert, Evan.   \"Transgender Student Left Out of Locker Rooms During Lockdown Drill Because of Confusion Over Policy.\"\r\n    WTTG-TV.   8 October 2018.", "Preston, Hannah.   \"Virginia Transgender Student Denied Entry to Both Locker Rooms During Safety Drill.\"\r\n    Newsweek.   6 October 2015.", "Carey, Julie.   \"Stafford County Schools Issue New Restroom Rules in Response to Transgender Student.\"\r\n    WRC-TV.   25 March 2015.", "Branscome, Jeff. \"Stafford Superintendent Apologizes to Transgender Student Amid National Outcry.\"\r\n    Fredericksburg Free-Lance Star. 9 October 2018.", "Arturo Garcia is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]