["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "The candidate field for retiring U.S. Sen. Saxby Chambliss’ seat is more crowded than the mall on Christmas Eve.", "Thus far, the race includes three congressmen, a former secretary of state, a former state senator, a former U.S. senator’s daughter and a former governor’s cousin. And that’s just the candidates who’ve grabbed the most headlines. For lesser-known candidates, distinguishing themselves has been tough.", "One candidate, Dr. Branko Radulovacki, a Democrat and Atlanta psychiatrist, is doing his best to emerge from the fray. Dr. Rad -- as he prefers to be called -- has been appearing everywhere, commenting on the issues in online videos, town hall meetings and through campaign emails.", "One such email, titled \"Walking the Talk,\" highlights Dr. Rad’s actions. The email includes several \"only\" statements, touting the Atlanta doctor as being the only candidate to participate in the 50th anniversary March on Washington, the \"Si se puede\" immigration reform march in Atlanta and to march in Atlanta’s Pride parade.", "But it was his \"only\" statements about two controversial political topics -- Syria and the Affordable Care Act -- that intrigued us.", "Here are the key statements from Dr. Rad’s campaign email, emphasis his:", "\"I’m the only one who spoke out against bombing Syria. And the only one who took on Governor Deal and Insurance Commissioner Hudgens over their efforts to ‘obstruct’ the Affordable Care Act in Georgia.\"", "With more than a dozen announced candidates in that U.S. Senate race, we were curious whether Dr. Rad’s statements were correct. Did he actually hold the \"only\" title on these two issues? We decided to investigate.", "A few months ago, international relations were strained as President Barack Obama considered taking military action against Syria for its alleged use of chemical weapons. Dr. Rad released a statement opposing the strikes. And at the time, many of Georgia’s leading Republicans, including those running for Senate, also denounced Obama’s plans, saying the president failed to make his case for attacking the country.", "PolitiFact Georgia’s research found that Peach State congressmen and Senate candidates Paul Broun and Phil Gingrey spoke out against the proposed attacks, and U.S. Rep. Jack Kingston was leaning no. And former Secretary of State Karen Handel even made a radio ad out of her opposition, and used it as an attack ad against leading Democratic challenger Michelle Nunn.", "On the Democratic side, former state Sen. Steen Miles also publicly opposed strikes on Syria. From our research of major announced candidates, only Nunn supported Obama’s plans.", "There was less political chatter surrounding Dr. Rad’s Affordable Care Act claim. Georgia  Gov. Nathan Deal and Insurance Commissioner Ralph Hudgens were early opponents of Obama’s health care plan. Hudgens even bragged during the summer about being an \"obstructionist\" to the law. Last week, when asked about the health care plan rollout, Hudgens said he hopes the plan \"implodes.\"", "Georgia chose not to expand Medicaid for low-income residents, and not to offer a state-based health care marketplace for its residents seeking health insurance coverage under the new law.", "Dr. Rad released a statement and video about the leaders’ \"obstructionism,\" saying it was hurting the state. \"We call on Gov. Deal and Insurance Commissioner Hudgens to STEP UP and lead, or STEP ASIDE,\" Rad’s statement and petition said. Last week, he applauded Hudgens for putting some helpful information about the law and insurance marketplaces on the insurance commissioner’s website.", "Along with Dr. Rad’s statements, we found comments from Nunn about Deal’s rejection of the Medicaid expansion and the impact on war veterans. (Nunn received a True rating from PolitiFact Georgia for her statements.)", "When contacted by PolitiFact Georgia, Dr. Rad reviewed the statements and admitted that his campaign email was incorrect. The doctor said that a campaign staffer in charge of composing the email unintentionally misrepresented one of Dr. Rad’s Facebook posts. That post, an open letter dated Oct. 11, detailed the ways the physician was different from the other Senate candidates.", "\"The buck stops with me,\" Dr. Rad told us. \"It was a mistake and I take full responsibility for that mistake. I will set the record straight.\"", "Dr. Rad promised to send out another campaign statement correcting the errors.", "So where does this leave us?", "The Atlanta physician released a campaign email that said he was the only Senate candidate to speak out against bombing Syria, and to challenge Georgia’s governor and insurance commissioner about obstructing the federal health care law.", "Dr. Rad is incorrect on the first point: Several Republican candidates, including current congressmen, spoke against proposed attacks on Syria. And another candidate produced a radio ad about her opposition.", "On the health care front, one other Democratic Senate candidate spoke out against the state’s decision not to expand Medicaid to poor residents, which was a large part of the Affordable Care Act.", "Dr. Rad admitted that the campaign email was incorrect and promised to correct the error.", "Corrections are always a good thing.", "But on the initial claim, the doctor gets a False.", "Campaign email, \"Walking the Talk,\" Dr. Rad, Oct. 14, 2013", "Phone interview, Dr. Rad, Oct. 31, 2013", "Marietta Daily Journal, Around Town column, \"Bombing Syria: Isakson off hot seat, Nunn on,\" Sept. 9, 2013", "Democratic Senate candidate Dr. Rad statement on Syria, Sept. 9, 2013", "Dr. Rad campaign video, \"Sign the petition! Tell Georgia to step up or step aside\"", "Washington Examiner, \"Georgia Senate candidate invokes Syria attack in radio ad,\" Rebecca Berg, Sept. 12, 2013", "Channel 2 Action News, \"Georgia insurance commissioner: I hope Obamacare implodes,\" Oct. 28, 2013", "Stone Mountain-Lithonia Patch, \"U.S. Senate candidate Steen Miles speaks out on Syria,\" Kevin Madigan, Sept. 8, 2013", "U.S. Rep. Phil Gingrey, press release, \"Gingrey: ‘No’ to strike on Syria,\" Sept. 5, 2013", "Dacula Patch, \"Broun: Military intervention in Syria not within our national interests,\" Kristi Reed, Sept. 4, 2013", "Athens Banner-Herald, \"U.S. Rep. Jack Kingston ‘leaning no’ on Syria strike,\" Associated Press, Sept. 2, 2013", "The Atlanta Journal-Constitution, \"Michelle Nunn backs Syria strike,\" Daniel Malloy, Sept. 6, 2013", "The Atlanta Journal-Constitution, \"Ga. insurance chief brags about sabotage of Obamacare,\" Jay Bookman, Aug. 29, 2013", "The Atlanta Journal-Constitution, \"Michelle Nunn declares herself a U.S. Senate candidate,\" Jim Galloway, July 22, 2013", "The Atlanta Journal-Constitution, \"Deal rejects expansion of Medicaid,\" Daniel Malloy, Aug. 28, 2012", "Dr. Rad for Senate Facebook page, Oct. 11, 2013 post", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]