["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A vice presidential debate is scheduled for Oct. 8 in Salt Lake City. But a recent Facebook post that’s being shared widely claims the current veep, Mike Pence, refuses to debate Sen. Kamala Harris, whom Joe Biden recently named as his running mate.", "\"Pence said he won’t debate Kamala!\" the post says.", "It was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "We couldn’t find any evidence that Pence said he wouldn’t debate Harris.", "Rather, on Aug. 11, Fox News reported that Pence indicated at a rally in Arizona that day that he was eager to debate the California senator.", "\"My message to the Democratic nominee for vice president: Congratulations,\" he said. \"I’ll see you in Salt Lake City.\"", "A couple days later, Pence doubled down on this sentiment during an interview with Fox News host Sean Hannity.", "\"I think she is a skilled debater,\" Pence said, \"but I can’t wait to get to Salt Lake and be on the stage with her.\"", "In 2002, Pence told the Hill that he \"never eats alone with a woman other than his wife,\" leading Harris in 2019 to criticize him for limiting one-on-one meetings with women. After Biden tapped Harris as his running mate, a satirical story was shared on social media that said Pence demanded an \"on-stage chaperone\" for the vice presidential debate.", "But this story is fiction.", "We rate this Facebook post False.", "Facebook post, Aug. 16, 2020", "CNN, Kamala Harris and Mike Pence scheduled to face off at October debate, Aug. 12, 2020", "Fox News, Pence tells Harris he looks forward to debate: ‘I’ll see you in Salt Lake City,’ Aug. 11, 2020", "The Hill, Pence on debating Harris: ‘I can’t wait,’ Aug. 13, 2020", "Politico, Harris says it’s ‘outrageous’ that Pence limits one-on-one meetings with women, March 14, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]