["A photo of a huge ape standing next to a man has been shared in multiple Facebook posts about Gigantopithecus, the largest ape ever to roam Earth that died out around 100,000 years ago. However, the ‘creature’ in the picture is in fact a model built by Hollywood special effects artist William Munns.", "The image was published on Facebook here on January 22, 2021.", "“Gigantopithecus is an ape species that went extinct. This one is considered the largest of his species,” the Sinhala-language caption reads.", "“His height is 10 feet and weighs 1200 pounds. He is also said to be vegetarian.”", "Some Facebook users commented on the post to suggest it was misleading.", "“Isn't this from a movie? Gigantopithecus is an animal that is extinct,” one person commented.", "“Please don't publicise false information,” another said.", "The photo was also shared on Facebook here and here.", "The largest ape to roam the Earth, gigantopithecus weighed five times as much as an adult man and stood three-metres high, scientists estimate.", "In its heyday a million years ago, it inhabited semi-tropical forests in southern China and mainland Southeast Asia.", "But gigantopithecus died out around 100,000 years ago because it failed to adapt to savannah grass after climate change hit its preferred diet of forest fruit, scientists believe.", "A reverse image search found the photo on blog post, “Cryptozoologist of the year 2014: Bill Munns”.", "“William “Bill” Munns has been a makeup and special effects artist in Hollywood for decades,” it reads.", "“In 1998, Munns started working at Creative Presentations, Inc, Valencia, California...While there, he designed, sculpted and figure finished a Gigantopithecus figure as a museum showcase figure.”", "On his website, Munns describes how he built the model, nicknamed Giganto, taking inspiration from gorillas and ancient human homo erectus.", "He said the photo of him stood next to the towering ape “has become something of an internet icon”.", "“Internet people interested in Bigfoot (and the believed relationship to this prehistoric ape) quickly seized the picture of me and Giganto as an impressive illustration of a giant ape that might still be alive today,” he wrote.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]