["Arnab Goswami, the editor of Republic TV, alleged in a video statement that he was attacked by goons affiliated with Indian Youth Congress (IYC) on April 23. He claimed that two bike-borne men pounded on his car windows and threw bottles when he was driving home from work with his wife. Since then, several social media users have accused Goswami of manufacturing the alleged attack. National coordinator of Congress IT cell Gaurav Pandhi claimed that the metadata of Goswami’s video reveals that it was shot much before the alleged attack. Congress member Suraj Hegde and Twitter handle Rofl Republic also tweeted the purported metadata.", "🔸Arnab has a Y category security 🔸His security guards caught the attackers, who then talked at great length & were let off?😂 🔸Why were they not handed over to the Police? 🔸Also metadata of the video put up by #Repuplick suggests it was shot much before the alleged incident pic.twitter.com/mXNOj5Anag", "— Gaurav Pandhi (@GauravPandhi) April 23, 2020", "National campaign in-charge of IYC, Srivatsa, claimed that BJP national spokesperson Sambit Patra and filmmaker Ashoke Pandit knew about the alleged attack before the information was shared by Republic TV. His claim was based on the timing of the tweets put out by the channels and the two individuals.", "Ashoke Pandit knew about attack on Arnab a full ten minutes before it supposedly happened 😂", "These #PaidNazi enthu cutlets of BJP IT cell started posting their drafted tweet much before they were supposed to", "Arnab hire better scriptwriters and directors next time. pic.twitter.com/SQuk870KHJ", "— Srivatsa (@srivatsayb) April 23, 2020", "That Patra knew of the alleged attack before Republic TV was also tweeted by the handle @dostam_comrade (drawing over 1,200 retweets) and @VinayDokania (gathering close to 700 retweets).", "In this fact-check, we shall analyse both claims separately.", "1. Does the metadata of the video show that it was shot before Republic TV informed viewers of the alleged attack?", "2. Did Sambit Patra and Ashoke Pandit tweet about the alleged attack before it happened?", "The answer to both the questions is no. Let’s see why.", "Metadata", "Metadata is essentially data (information) about data. Certain tools expose the metadata associated with videos. But such data is accurate only when extracted from the original file. Metadata is modified based on the platform where the video is sent. Metadata of Twitter files will show date and time based on when they were uploaded on the platform, not when they were shot.", "Congress members used the website metadata2go.com to extract the metadata of the video. They downloaded the video and uploaded it on the website. Readers can also try the same for the purpose of self-verification. The website shows the time as 20:17 (8:17 PM) on April 22. However, in the ‘tags’ section, the website gives the time as ‘2020-04-22T20:17:11.000000Z’. The letter ‘Z’ denotes Zulu Time which is the Greenwich Mean Time (GMT), now known as the Universal Time Coordinated (UTC).", "To adjust this with the Indian Standard Time (IST), one needs to add 5:30 hours which means that the creation time is 1:47 AM, April 23. This is the exact time when Republic TV uploaded the video on Twitter.", "Twitter user Ravi Nair added another claim. He checked the video on YouTube and suggested that Goswami’s statement was created at 21:04 UTC or 2:34 AM IST on April 23, before the purported attack took place at 12:15 AM. His analysis was based on the results he derived from metadata2go.com.", "However, when Alt News checked the same on metadata2go.com, we got a different result. This means that checking the metadata of a YouTube video by downloading and uploading it to metadata2go.com is not a reliable process. A much better tool to check YouTube metadata is Amnesty International’s YouTube DataViewer. According to Amnesty, the video was uploaded on YouTube at 21:13 or 2:43 AM IST on April 23.", "Same as Twitter, YouTube strips all the metadata from a video. The time showed by Amnesty is the upload time on YouTube, not the actual date of creation of the video.", "Therefore, several Congress members and social media users misinterpreted the upload time on Twitter and YouTube as the true metadata (date of creation) of the video. Furthermore, the metadata reflected the time in UTC which has to be adjusted to reflect the Indian time.", "Tweets", "In the video, Goswami claimed that he was attacked at 12:15 AM on April 23. Republic TV’s first tweet about the alleged attack was put out at 1:06 AM. Sambit Patra and Ashoke Pandit tweeted a few minutes before at 1:05 AM and 12:55 AM respectively. This caused many to believe that the two individuals knew about the purported attack before Republic TV broke the news.", "However, social media is not the only place to break news. Republic TV had disclosed the alleged attack during a 12:45 AM broadcast. This was before the channel either tweeted about it or uploaded Goswami’s video on Youtube.", "The claim that Patra and Pandit knew about the alleged attack before it took place was based on the time of Republic TV’s tweet. However, the channel had reported on the alleged incident first on TV, then on social media. Both allegations by Congress members and several other social media users are therefore, false.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "Amid the ongoing Israel-Palestine conflict, media outlet Times Now put out a report claiming that…", "A 45-second video clip is being shared widely on social media where a group of…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…"]