["An image has been shared multiple times on Facebook alongside a claim it shows a newspaper report about Myanmar opposition leader U Than Htay of the Union Solidarity and Development Party (USDP) vowing to ban people from speaking English should the party come to power. The claim is false; the image actually shows a doctored page of Myanmar newspaper Golden Hand; the paper denied publishing any such report.", "The image was published on Facebook on July 25, 2020.", "The post features part of a purported page of the Myanmar newspaper Golden Hand Journal.", "The Burmese headline translates to English as: “U Than Htay says his party will work to enact a law that would forbid Myanmar citizens from speaking English.”", "The report reads, in part: “[The USDP] has already agreed to amend the constitution. That’s why we submit many proposals to parliament. But we can’t move forward because of the voting system in the parliament. Regardless of whether our proposals pass or fail, it remains on record. We will amend the constitution. But before we do amend it, following the constitution is every citizen’s duty so we'll only go forward in accordance with the law.”", "U Than Htay is the incumbent chairman of Myanmar's opposition party, the USDP.", "The post’s Burmese caption translates to English as: “Oh my..! My major at university was English. I’m teaching English now too. Will I lose my job when they regain power? I should teach Economics”.", "The image was also shared in multiple Facebook posts in February and July 2020, alongside similar claims.", "However, the claim is false; the image actually shows a doctored newspaper page.", "In response to the misleading posts, Golden Hand told AFP by email on August 19, 2020 that the claim is a “hoax”.", "The email from editor-in-chief Oak Soe San also included a copy of a statement they issued on February 28, 2020, denying the claims.", "Part of the Burmese statement translates to English as: “On the Page 9 of the Golden Hand (Vol-1, No -14) released on 23 January, 2020, we published an interview with U Than Htay headlined ‘Although we report (to the government) many times, we are defeated whenever we compete with the ruling party as the government neglect our reports’. However, we have seen this report circulating on social media with a different headline.", "“As the hoax circulating online was created with intent to personally and politically attack and ruin the dignity of USDP’s chairman Than Htay and Golden Hand editor Oak Soe San, we will pursue legal proceedings against those responsible.”", "Oak Soe San also sent AFP a pdf copy of the original newspaper page published on January 23, 2020. Below is a screenshot comparison between the image in the misleading post (L) and the original newspaper page provided by the Golden Hand (R) :", "USDP spokesperson Thein Tun Oo also addressed the claim here on his Facebook account, calling it “false”.", "The Burmese post reads: “The claim below is false and was created intentionally. In accordance with the current law, we will pursue legal proceedings against the original creator of the fake news post and anyone who reposts or shares it.”", "Multiple local media outlets, including The Voice here, Myanmar Times here and Kumudra here, have since reported that the USDP has filed legal proceedings about the spread of “fake news headlines”.", "AFP has not included names of people who shared this misinformation due to the risk of prosecution.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]