["The four-minute, 23-second video was posted on Facebook here on December 25, 2020. It has been viewed more than 8,400 times.", "The caption of the Indonesian-language post translates to English as: “HRS Received the ‘Muslim Cleric Moeslim Choice Award’ from Malaysia.”", "HRS is an acronym for Habib Rizieq Shihab. Habib is an honorific title used to refer to Muslim scholars believed to be descendant of the Prophet Muhammad.", "Rizieq Shihab was leader of the Islamic Defenders Front, a Muslim group that was banned by the Indonesian government on December 30, 2020. The ban came just weeks after Rizieq was arrested for allegedly violating Covid-19 protocols.", "The same footage, which has been viewed more than 280,000 times, also appeared alongside a similar claim on Facebook here, here, here and here; on Twitter here and here; as well as on YouTube here and here.", "The claim is misleading.", "A combined reverse image and keyword searches on Google found the original footage posted here on the YouTube channel of MOESLIM CHOICE TV on December 18, 2018.", "The video’s Indonesian-language title translates to English as: “MUSLIM CLERIC AWARD: Habib Muhammad Rizieq Shihab.”", "Moeslim Choice Award is an annual event held by Jakarta-based Moeslim Choice magazine.", "Below is screenshot comparison between the video in the misleading post (L) and the Moeslim Choice TV footage (R):", "On December 13, 2018, the magazine published this report headlined: “Habib Rizieq Awarded the Moeslimchoice Muslim Cleric Award”.", "The first two sentences of the report read: “Because he is regarded as a representation of the Islamic struggle, the Islamic Defenders Front Great Leader Habib Rizieq Shihab was awarded MoeslimChoice Muslim Cleric Award.", "“The award was received by Habib Muhammad Hanif Alattas LC, Habib Rizieq’s son-in-law.”", "Rizieq, who left Indonesia in 2017, was in self-imposed exile in Saudi Arabia at that time. He returned in November 2020.", "The 2018 event in Jakarta and also reported by local media Suara.com and Warta Ekonomi.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]