["Mohamed is one of eight candidates seeking to succeed current WTO head Roberto Azevêdo. As reported by AFP, the Brazilian career diplomat announced in May that he was stepping down a year before the end of his tenure for “personal” reasons.", "But Mohamed is said to have already clinched the WTO top post in numerous social media posts in Nigeria, including this one published on Facebook on July 16, 2020. The Facebook page, called Foluke Daramola, has more than 280,000 followers.", "“Amina Mohamed of Kenya is the new WTO D-G, congratulations to her and to our own Ngozi Okonjo weala thanks for the robust campaign (sic),” the post partly reads.", "Mohamed and Nigeria’s two-time former finance minister Ngozi Okonjo-Iweala are the two female candidates from Africa lobbying for the WTO position.", "The other challengers are Egypt’s former trade negotiator Abdel-Hamid Mamdouh, Mexico’s ex-WTO deputy director-general Jesús Seade Kuri, former Moldovan foreign minister Tudor Ulianovschi, South Korean Trade Minister Yoo Myung-hee, former Saudi economy minister Mohammad Maziad Al-Tuwaijri, and former international trade secretary Liam Fox.", "Deleted tweet spreads misinformation", "Using the online monitoring tool CrowdTangle, AFP Fact Check found that the post started circulating after popular Nigerian journalist Dele Momodu tweeted about Mohamed’s alleged victory on July 16, 2020.", "“BREAKING NEWS: KENYA’S AMINA MOHAMED BEATS NIGERIA’S NGOZI OKONJO-IWEALA FOR THE W.T.O’S TOP JOB…,” the now-deleted tweet read.", "The tweet surfaced a few days after Kenya nominated Mohamed for the WTO chief position.", "Since then, Momodu’s posts on social media have sparked a wave of misinformation across Nigeria about the WTO race.", "A Facebook page called NG News Reporters -- whose posts have been debunked by AFP Fact Check here and here -- is one of the accounts that published the claim. Local online site City News also shared an article alongside a similar claim.", "But Mohamed has not been appointed as WTO’s director-general. She’s still in the race with other contenders.", "Race stages", "AFP Fact Check found that the WTO was in the second phase of the appointment process for its next leader after a month-long nomination stage. Candidates have until September 7, 2020, to “make themselves known to members”, according to the global trade organisation.", "Consultations with WTO members to narrow the field to one candidate are the last step before the new director-general is finally named. “The third phase will last no more than two months,” the WTO stated.", "Momodu issued a correction to his tweet on the same day and apologised for spreading false claims. “Just received news that AMINA MOHAMED has not been confirmed for the W.T.O job but nominated by KENYA,” Momodu said on Twitter. “The interviews are still ongoing.”", "CORRECTION... Just received news that AMINA MOHAMED has not been confirmed for the W.T.O job but nominated by KENYA... The interviews are still ongoing...\n\t\t\"So is Nigeria. Even after NGOZI OKONJO-IWEALA'S interview the Nigerian delegation is still with Ngozi in Geneva. Very sorry. pic.twitter.com/R8NKjdxYTQ", "The WTO leadership race comes amid prolonged trade tensions between the United States and China, creating an uphill task for an organisation whose goal is to foster free and predictable global trade.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]