["As expected, this election season's candidates for president and vice president faced intense scrutiny and criticism over their histories and track records regarding policy, partisanship and agendas.", "When now President-elect Joe Biden selected Kamala Harris to be his running mate in August, the decision excited some and disappointed others, both inside and outside of the Democratic Party.", "Harris' track record as a prosecutor, which had given her the reputation of \"top cop\" earlier in her career, doesn't sit well with the more progressive members of the Democratic Party, especially following the rise of the Black Lives Matter movement.", "On the other hand, moderates and conservatives, including President Donald Trump, have used the independent GovTrack.us's ranking of Harris as the \"most politically left compared to all senators,\" against her.", "Among the criticisms of Harris on social media is a YouTube video from March 2019 that recently recirculated. Init, the host of a conservative Christian channel denounces Harris for comments she made about decriminalizing sex work during an interview with The Root earlier that year.", "Pastor James Pittman, the host of the channel \"For Such A Time As This,\" said Harris wants to legalize prostitution, condemns her comments about sex work and questions the existence of her \"moral clarity.\"", "More:Fact check: Kamala Harris proposed extended school days in 2019 bill", "In a February 2019 interview with The Root, Harris was asked, \"Do you think that sex work ought to be decriminalized?\"", "She responded: \"I think so, I do. I think that we have to understand though that it is not as simple as that. ... But when you’re talking about consenting adults, I think that yes we should really consider that we can’t criminalize consensual behavior as long as no one is being harmed.\"", "The most important thing to note from Harris' response is that, despite its nuances, decriminalization is not the same thing as legalization.", "Decriminalization is the reduction of criminal penalties when someone commits an illegal act, while legalization means that there are no longer legal prohibitions on the act, meaning it would now be legal.", "In the Root interview, Harris did not say she wanted to legalize sex work or prostitution. She did say she wants to decriminalize it, meaning those who participate in sex work would face lesser punishments than they do now. Harris has not laid out specific policies on that.", "She also noted that there is an \"ecosystem\" of sex work that includes people who profit off of the harm or exploitation of others. Those people, according to Harris, should not be exempt from criminal prosecution.", "More:Fact check: Claim that Kamala Harris' current press secretary works for Twitter is false", "After the YouTube video went viral, Snopes fact checked the claims and Pittman responded.", "In the video \"The fact checkers need to be fact checked,\" Pittman acknowledged the difference between legalization and decriminalization while defending his claim that Harris wants to legalize prostitution.", "\"If you want to decriminalize something and remove all penalties ... that in essence — you may call it decriminalization — that is the legalization of prostitution,\" Pittman said.", "Pittman criticized Snopes for its fact check — which rated the claim as a \"mixture,\" meaning it has elements of truth and falsity — because they don't know what Harris' policies would be.", "\"From what (Harris) is saying, I surmise, it seems like to me, I'm not 100% sure just 99.99% sure, she wants to remove all penalties,\" Pittman said.", "More:Vice President-elect Kamala Harris: A look at her political career", "In a second video following the Snopes analysis, Pittman further explained and doubled down on his claim.", "Despite previously acknowledging the difference between legalization and decriminalization, in this video, Pittman said that only in \"bizzaro world\" does decriminalization not mean the same thing as legalization.", "\"If you remove something from criminal prosecution, you don't even get a ticket for it, then that act is equal in the eyes of the law to me getting in my car and driving to the store and back,\" he said.", "PSA: Get these in your inbox: We're fact checking the news and sending it to your inbox. Sign up here to start receiving our newsletter.", "\"You can call it whatever you want, if it is not going to come with a ticket or jail time or any prosecution, that's called making it legal in the real world.\"", "Concluding the video, Pittman said decriminalization ultimately makes things legal and that he stands by his claim that Harris supports legalizing prostitution.", "The claim in the Youtube video has been rated FALSE. Vice President-elect Kamala Harris did not say that sex work, specifically prostitution, should be legalized.", "What Harris said is that she believes sex work should be decriminalized, which means participants would face lesser consequences for the act, but legal prohibitions would still exist. Additionally, Harris added that she believes those who profit from harming or exploiting others through sex work should still face criminal prosecution.", "Despite Pittman's claims, there is a difference between legalization and decriminalization. That difference may be more nuanced in some situations than it is in others, but the two are not fully synonymous.", "Thank you for supporting our journalism. Youcan subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more."]