["About this rating", "In June 2017, entertainment web site Nevada County Scooper published an article in June 2017 appearing to report that U.S. President Donald Trump had promised to shut down the government's \"chemtrail program\" after touring a \"chemtrail plane\".", "The chemtrail conspiracy theory holds that airplanes have been spraying harmful materials on the unsuspecting U.S. population in order to keep them passive and easy to manipulate:", "Donald Trump accompanied by select members of his cabinet toured a chemtrail-outfitted dispersal airplane at Andrews Air Force Base yesterday afternoon, according to an NBC news report today. The president is fulfilling a promise to end the controversial program and redirect government funding away from geoengineering operations and towards other programs like roads, the aging electrical grid infrastructure and of course his proposed wall between the United States and Mexico.", "“Today marks a great day for our country where we turn out [sic] backs on the secret poisoning of our skies, and look to a new future with better roads, a secure electrical grid, and a great wall to protect us from Mexico,” said President Trump reading prepared comments out in front of a Boeing 767 which had been retrofitted for chemtrail spraying. “And hear me you, we are not going to let scientists and other elite eggheads tell us about how to control the environment anymore. It’s America first, not the skies first.”", "There was no truth to this article, which originated with the Nevada County Scooper, a self-described satire website:", "The Scooper is a satirical website is in scope and intent. Sometimes it’s funny; often it is not. in scope and intent. It provides social criticism in a satirical, sometimes news-genre setting. We are not a “fake news” site, but rather an entertainment one. Sometimes it’s just plain-old crappy writing with a few bad jokes. Our intention is not to fool or trick anyone, but obviously it happens. We firmly believe that you can soften a person’s willingness to listen by injecting irony, and yes sometimes humor, into the conversation.", "Not only is the site satirical in nature, but chemtrails are a debunked conspiracy theory, making it extremely difficult to tour a chemtrail plane. The photograph posted with the story, which White House Director of Social Media Dan Scavino Jr. originally posted on 17 February 2017, shows Trump touring a Boeing Dreamliner in Charleston, South Carolina:", "Although the inside of this plane may look unfamiliar to most commercial airline passengers, there is nothing amiss in this image. The tanks in the photograph, which conspiracy theorists may mistake for chemtrail storage, are actually water ballast tanks that are used during test flights. Wired explained the tanks' use in an article about a similar 747-8 test plane:", "The interiors are all business for flight test. In the front of the airplane, there are 16 water ballast tanks with another 16 in the aft end. A single ballast tank also sits closer to the middle and it looks like there's a spot for one more across the aisle.", "These tanks are filled with water and engineers can transfer water between the tanks during flight to shift the weight of simulated cargo or passengers. The center of gravity, or CG as pilots call it, is important to the flight characteristics of any airplane. During flight test, Boeing must ensure the plane is safe and efficient at full forward and full aft CG as well as any combination between the two.", "The White House.   \"Remarks by President Trump at Unveiling of Boeing 787 Dreamliner Aircraft.\"\r\n    17 February 2017.", "Paur, Jason.   \"Take a Peek Inside the 747-8 Test Plane.\"\r\n    Wired.   2 October 2010.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]