["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Donald Trump with \"Angel Moms,\" parents who say their children were killed by illegal immigrants, during a campaign event focused on immigration policy in Phoenix on Aug. 31, 2016. (Travis Dove/The New York Times)", "Republican presidential nominee Donald Trump broke from his tough talk on immigration recently to highlight a more positive exchange between Mexico and the United States: legal border crossings.", "\"The United States and Mexico share a 2,000-mile border, a half a trillion dollars in annual trade and 1 million legal border crossings each and every day,\" Trump said during his visit to Mexico Aug. 31. \"We are united by our support for democracy, a great love for our people and the contributions of millions of Mexican Americans to the United States.\"", "Mexican President Enrique Peña Nieto during that same press conference also cited legal crossings, saying, \"We share the most travelled border through which every day, legally, more than a million people cross it and over 400,000 vehicles.\"", "Given the focus on illegal crossings, we decided to take a look at the flip side: Do 1 million people cross the border legally every day? Trump’s campaign did not respond to requests for information.", "Border patrol processings", "We couldn't find definitive figures pointing to the 1 million estimate. But experts said it sounds reasonable based on figures we do have for U.S. entries and how intertwined cities are in the border region.", "A spokesperson for U.S. Customs and Border Protection told us that along the southwest border, the daily average number of inbound legal crossings of pedestrians, passengers and crew into the United States has increased in recent years.", "Legal crossing were 462,793 in fiscal year 2013, 483,501 in 2014, and 507,767 in 2015.", "CBP said 1 million daily crossings seemed accurate when taking into account outbound crossings, which the agency does not track.", "An entry is recorded for every visit into the United States from Mexico, so one individual could represent multiple crossings in one day.", "Transportation Department data, compiled from the Homeland Security Department, reflect similar border flows.", "Pedestrians and passengers on buses, trains and personal vehicles accounted for about 474,686 entries into the United States per day in fiscal year 2014, according to the department’s border crossing/entry data.", "In fiscal year 2015, that grew to about 496,660.", "Reasons for travel", "The border region includes four U.S. states (California, Arizona, New Mexico and Texas) and six Mexican states and is home to about 14 million people, according to December 2014 data from the Mexican government. The 2014 figures also say one million people cross the U.S.-Mexico border daily.", "Border cities like El Paso/Juarez and San Diego/Tijuana \"are really single urban entities divided by an artificial border,\" said Douglas S. Massey, sociology and public affairs professor at Princeton University and director of the university’s Office of Population Research.", "\"People often live on one side of the border and work on the other and vice versa, with huge movement in both directions,\" Massey said. \"There are also many, many daily trips in both directions for shopping, business and recreation.\"", "The U.S. government also allows Mexican citizens to use Border Crossing Cards to enter the country from Mexico \"by land, or by pleasure vessel or ferry.\"", "Border crossing cards allow people to go back and forth at will, Massey said.", "Many of the entries from Mexico to the United States also are Americans coming back into the country, Massey said. Crossings have increased since the North American Free Trade Agreement went into effect in 1994, he said.", "\"Legal border crossings at the dozens of ports of entries located along the U.S.-Mexican border significantly benefit both the U.S. and Mexican economies, which is why the numbers continue to rise,\" said Noe Garcia, president of the Border Trade Alliance, a nonprofit advocating for improved border affairs and trade relations among Canada, the United States and Mexico.", "Trade between the United States and Mexico in 2015 totaled about $583.6 billion, according to the Office of the United States Trade Representative. Commerce Department figures show United States exports of goods and services to Mexico also supported about 1.1 million jobs in 2014.", "We emailed Mexican officials for their entry tallies, but didn’t get a response.", "Our ruling", "Trump said the U.S.-Mexico border has \"1 million legal border crossings each and every day.\"", "Border patrol and Transportation Department data show there are around half a million daily border crossings from Mexico into the United States. While that number doesn’t necessarily represent unique individuals (rather total crossings), the border region is home to about 14 million people, many who cross back and forth between the nations to go to school, work and for recreational purposes.", "So while there isn’t a hard number pointing to the 1 million total crossings, experts believe it’s a plausible estimate given the needs of the millions of people who live in the border region.", "With that caveat, we rate Trump’s statement Mostly True.", "https://www.sharethefacts.co/share/2ea495f3-90ef-4d42-acec-8dc9edc98939", "The Washington Post, Donald Trump press conference in Mexico, Aug. 31, 2016", "Email exchange, U.S. Customs and Border Protection, September 2016", "PolitiFact, Trump says number of illegal immigrant families crossing border this year exceeds 2015 total, July 21, 2016", "Transportation Department, Border Crossing/Entry Data", "Secretariat of Foreign Relations, Mexico, Our Common Border: an area of prosperity and competitiveness", "Secretariat of Foreign Relations, Mexico, Basic Facts, U.S.-Mexico border, December 2014", "Email interview, Douglas S. Massey, sociology and public affairs professor at Princeton University and director of the university’s Office of Population Research", "U.S. Customs and Border Protection, Border Crossing Card - documentation requirements for Mexican citizens", "Council on Foreign Relations, NAFTA’s Economic Impact, updated July 26, 2016", "Email interview, Noe Garcia, president of the Border Trade Alliance", "U.S. Census Bureau, Trade in Goods with Mexico", "Office of the United States Trade Representative, U.S.-Mexico Trade Facts", "Commerce Department, Jobs Supported by Export Destination 2014, Nov. 17, 2015", "PolitiFact, At 'Three Amigos' summit, Obama overshoots trade benefits between Mexico, Canada, July 5, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]