["Hindu festival of Dussehra was recently celebrated with small gatherings in many parts of the country. Ravana Dahan and Ramlila programs were also held even as the crowd was solemn compared to pre-COVID years. In the midst of this, a photo has gone viral on social media, purportedly showing an attack on Ramlila actors in Punjab. It depicts a destroyed room with broken furniture and things scattered on the floor. This picture was shared by a user named Rahul Keshri on a Facebook group ‘Hindu Ekta’.", "Another Facebook user posted this picture with the same claim. (archived link)", "The photo is being widely shared across Twitter and Facebook.", "This slideshow requires JavaScript.", "A website called india-politics.com shared this image in July 2019 in a story about temple vandalism, along with claims of attacks on temples in Delhi’s Lal Kuan area and Uttar Pradesh’s Muzaffarnagar.", "It is true that in Kothe Manwal village of Punjab some miscreants had started a fight during Ramlila. According to a Jagran report dated October 23, 2020, “Mischievous elements in the village Kothe Manwal caused a commotion during Ramlila event. On Wednesday night, these men jumped onto the stage, abused the actors, as well as beat them up. They cut off the electricity powering the event and tore up posters and banners as well. Attendees protested and demanded strict action against those who interrupted the gathering.”", "However, the picture going viral on social media does not represent the recent commotion.", "Alt News performed a simple reverse image search and found the viral image on the website of Australian magazine Crikey. The accompanying article, published on October 30, 2018, stated that a group of vandals attacked a Hindu temple in the South Western suburb of Regent’s Park. Temple idols, musical instruments, and other items were smashed in the destruction. The word ‘Jesus’ was also written on the wall. The report also mentions that the culprits set fire to some parts of the temple.", "The Daily Mail also covered the incident in a story dated October 19, 2018. It said that 30 idols of gods and goddesses were destroyed in the attack. Several items in the temple, including the furniture, were smashed and set on fire. Pandit Para Maharaj, the chief priest of the temple, told SBS that he was “in a state of shock” and “never expected anything like this to happen in Australia”. The chief priest was quoted as saying that the attack was motivated by hate since nothing was stolen from the temple. This article also included some more pictures of the aftermath of the attack. The Facebook page of the temple, ‘Bhartiye Mandir Sydney’, also shared some images from the scene on October 18, 2018.", "Dear all, as you may know, Bhartiye Mandir was brutally vandalised on Sunday evening. All the statues and pictures…", "Posted by Bhartiye Mandir Sydney on Wednesday, 17 October 2018", "According to the SBS article, the incident was strongly condemned by the Hindu community in Australia, leaving them baffled. The report quoted David Coleman, then Australia’s immigration minister, as saying, “I am concerned to learn the Bhartiye Mandir Hindu Temple in Regents Park, Sydney has been vandalised and I offer my sympathies to members of the Hindu community affected.” It was reported that the temple would reopen in January 2019. An article in Indian Link quoted the temple priest as saying that it was set to reopen for the public on February 2.", "Therefore, a picture of an attack on a Hindu temple in Australia from two years ago was circulated as recent. The incident is not connected to the commotion at a recent Ramlila program in Punjab.", "Donate Now", "Kinjal Parmar holds a Bachelor of Science in Microbiology. However, her keen interest in journalism, drove her to pursue journalism from the Indian Institute of Mass Communication. At Alt News since 2019, she focuses on authentication of information which includes visual verification, media misreports, examining mis/disinformation across social media. She is the lead video producer at Alt News and manages social media accounts for the organization.", "A purported video of a Muslim man beating a temple priest with a bat is…", "A picture depicting the Pakistani flag apparently bigger in size and apparently placed higher than…", "Amid the ongoing war between Israel and Hamas, a video of a fleet of cars…", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…"]