["About this rating", "The prospect of governments forcing citizens to undergo microchip implants for tracking or other purposes is of perennial concern to the conspiracy-minded, so much so that any mention of chip implants in the news is enough to spark apocalyptic howls.", "Consider this August 2016 item out of Australia: \"Australians Embracing Super-Human Microchip Technology.\" It's a fluff piece about a Sydney \"biohacking\" entrepreneur named Shanti Korporaal whose business is arranging for people to get microchip implants if they want them — as in, voluntarily. There's nothing in the original article about government programs, or mandated chipping, or anything of the kind, yet this is how the same story was reworked for Internet consumption by a web site called Organic & Healthy:", "Australia Becomes First Country To Begin Microchipping Its Public", "Back in 2010, CBS news reported that the Australian government had a potential RFID microchipping plan in the works related to the health care system.", "Now, it seems that this plan is beginning to unfold but the push is not a result of mandated health care reforms, but rather a clever propaganda campaign that equates RFID microchipping with becoming superhuman, and people are begging for it.", "Again, there's nothing in the original report, nor any additional information provided in the reworked version, to support the claim that \"Australia is microchipping its public.\" To the contrary, all that has been reported is that a few Australian techno-hipsters have begun microchipping themselves on the assumption that this will one day be a useful technology. For that matter, Australia isn't even the first country where self-chipping has taken place; it's been going on in the U.S. for years.", "Australia has not begun microchipping its public. The claim that it has is, at best, misinformation and, at worst, a lie.", "And it's also not true that, as claimed in the example at the head of this page, NBC predicted that \"all Americans will receive a microchip implant in 2017.\"", "Reynolds, Emma.   \"Australians Embracing Super-Human Microchip Technology.\"\r\n   News.com.au.   25 August 2016.", "Thompson, Cadie.   \"This Man Sells a Kit That'll Turn Anyone Into a 'Cyborg.'\"\r\n   Tech Insider.   29 July 2015.", "Organic & Healthy.   \"Australia Becomes First Country to Begin Microchipping Its Public.\"\r\n   October 2016.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]