["About this rating", "In January 2016, NBC News medical contributor Natalie Azar reported a segment for the Today show that highlighted six medical screenings that can purportedly be done at home. One of these screenings, the \"bad breath test,\" served as the original basis for a series of largely erroneous (but viral) health posts on dubious websites. We will collectively refer the claims made based on this information as the \"spoon test.\"", "The \"Breath\" Part of the \"Spoon Test\"", "The original test, as described by Azar, relies on factual science, which suggests that odors in one's breath can be indicative of systemic health issues:", "Scrape the back of your tongue with a spoon, seal the spoon in a plastic bag and put it under a bright light for one minute. Then, smell it.", "A healthy tongue coating should be clear, but if what you find on the spoon is thick, colored or has an unpleasant odor, it could be an early sign of problems with your respiratory system, liver, kidneys, hormones or gut.", "Most cases of bad breath will be related to gum disease or tonsils, but really ominous odors could be a sign of a larger health problem. Azar said a fruity smell could be a sign of diabetes; an ammonia smell could be related to kidney problems, other smells could indicate gastric or lung problems.", "And while you’re at it, take note that this test is the closest indicator of how your breath smells to other people.", "The use of a spoon to test breath odor has long been used as a way to get a rough sense of a person’s own breath, which is normally not readily perceptible to the person creating the odor. The method, as an example, is described in a 1996 review paper in the Journal of the American Dental Association:", "Although the anterior part of the tongue usually smells ... the main source of odor is usually farther back in the posterior region. The posterior area of the dorsal surface can be readily assessed by a gentle but thorough scraping using a disposable plastic spoon. Afterward, the spoon can be smelled to compare the odor with the overall mouth odor.", "Placing the spoon under the light presumably serves to increase the odor causing potential of the material sampled by the spoon. The notion that some odors can be indicative of conditions outside of dental hygiene, as well, is not controversial. The Today Show writeup of the test links to an entry on the NIH’s Medline website that describes various causes of bad breath, including the items referenced in the test:", "A fruity odor to the breath is a sign of ketoacidosis, which may occur in diabetes. It is a potentially life-threatening condition.", "Breath that smells like feces can occur with prolonged vomiting, especially when there is a bowel obstruction. It may also occur temporarily if a person has a tube placed through the nose or mouth to drain their stomach.", "The breath may have an ammonia-like odor (also described as urine-like or \"fishy\") in people with chronic kidney failure.", "These facts (while not controversial) do not mean that such observations would have any diagnostic or screening value, because the conditions they describe would be so far progressed by the point that they would show up on your breath that you would already be well aware of serious health problems, or they would be caused by highly noticeable things like excessive vomiting or a tube in your throat.", "Joseph Wolfsdorf, a professor of pediatrics at Harvard Medical School and Director of the Diabetes Program at Boston Children’s Hospital, told us that diabetic ketoacidosis would produce a fruity odor, but that this would be a sign of severe and pronounced illness that should already have produced more noticeable symptoms:", "A “fruity” odor of the breath (from acetone) is a feature of diabetic ketoacidosis (DKA). However, DKA is a late manifestation of severely uncontrolled diabetes. One would hope that classic symptoms: polyuria [frequent urination], polydipsia [excessive drinking], weight loss will lead to a person seeking medical attention long before a fruit odor was detected on the breath.", "The case is the same for that fishy odor on the breath — there is a connection between kidney failure and ammonia-breath, but this would be an extremely late manifestation of an already obvious and serious condition.", "We reached out to Azar multiple times through multiple channels to get more information on the scientific rationale behind her test, but have not yet received a response.", "The \"Stain\" Portion of the \"Spoon Test\"", "Perhaps as a result of the lackluster utility of the test as originally described, a variety of dubious websites like davidwolfe.com and Brightside.me added additional diagnostic features to the test inspired, it appears, by the largely unverified claims made by traditional Chinese medical practitioners. This mishmash of information has resulted in a viral but wholly useless video that includes a section on how to analyze the colors left on the spoon after the \"bad breath test.\"", "David \"Avocado\" Wolfe — one of the Internet’s worst offenders when it comes the mass production of incorrect medical information and illogical aphorisms -- added these details to the test, which also appeared in the Brightside.me video:", "If the stains are white or yellow with a thick coating, it may be an indication of a thyroid gland dysfunction. The conversion of beta-carotene to Vitamin A depends on the thyroid hormone. A deficiency can manifest as a yellowish buildup of carotene.", "If the stains are purple, it may mean you have poor blood circulation or high cholesterol levels. It can also indicate bronchitis. Bronchitis cuts down the efficiency of airwaves that bring oxygen to the blood stream, which can cause a purple tint.", "If the stains are white, you may be suffering from a respiratory infection. White buildup on the tongue can be caused by several different infections and viruses.", "If the stains are orange, it may be a sign of kidney disease. Chronic kidney disease can either cause the mouth tissues to appear pale due to anemia, or orange due to carotene-like deposits.", "First, it should be noted that these claims (accuracy aside) all refer to a discoloration on the tongue itself, and none of the material used by Wolfe to defend the claims actually discuss a spoon or a light.", "In support of the claim regarding a yellow discoloration, Wolfe linked to a page on “holisticprimarycare.net” offering the unsourced claim that in a low thyroid state, \"conversion stagnates and beta carotene builds up, causing a yellow tint in palmar and plantar surfaces.\"", "While medical literature does support the notion that a buildup of carotene caused by hypothyroidism may result in a yellowish discoloration on the palms of the hands (palmar surfaces) or feet (plantar surfaces), it is unclear why this information has been re-interpreted as applicable to the tongue, especially when a yellow tongue discoloration is a common (and usually benign) symptom related to a variety of non-thyroid issues.", "Such a discoloration could also occur, Wolfe claimed three bullet points down with a similar lack of evidence, as a result of kidney diseases through the same dubious \"carotenoid buildup\" mechanism. In other words, a yellow tongue on its own, even by the incorrect logic presented in Wolfe’s post, tells you next to nothing.", "In support of the claim that purple stains could be indicative of \"poor blood circulation\" or \"high cholesterol levels,\" Wolfe linked to a post by the Daily Mail which provided the commentary of naturopaths and traditional Chinese herbalists (again, with no supporting evidence or links) about what various colors on the tongue might mean. There is no hard evidence to support a purple tongue (let alone a purple stain on a spoon caused by a purple tongue) as being indicative of poor blood circulation or high cholesterol levels.  Chronic bronchitis, similar to claims made of breath odor, would be readily apparent to the sufferer without the use of a tongue test.", "If the spoon produces white stains, Wolfe says, you may be suffering from a respiratory infection. (We feel that we should point out here that bronchitis is also a respiratory infection, which Wolfe claims should produce a purple stain in his preceding bullet point.) Wolfe also suggested in his first bullet point that white stains could also be thyroid gland dysfunction. In fact, a white tongue can be caused by a large number of conditions (and also no condition whatsoever), including over sixty respiratory issues that would already be apparent to the screener, making it effectively useless outside of its dubious scientific rationalization.", "All told, claims made relating the \"breath\" portion of the spoon test are generally rooted in factual connections between mouth odor and internal health, but are effectively useless as a screening or diagnostic tool. Claims made of the \"stain\" portion of the spoon test are created by conflating unproven or confused claims borrowed from traditional Chinese medical practices or from misinterpreted and sparsely sourced websites to create an equally useless \"screening\" test. Thus, we rank claims made of the \"spoon test\" as mostly false.", "Flam, Lisa.   “Make It a Healthy New Year! 6 Medical Screenings You Can Do at Home.\"\r\n    Today.com.   4 January 2016.", "Rosenberg, M.   “Clinical Assessment of Bad Breath: Current Concepts.\"\r\n    Journal of the American Dental Association.   April 1996.", "MedlinePlus.   \"Breath Odor.\"\r\n    Accessed 9 February 2018.", "Bevc, S. et al.   “Measurement of Breath Ammonia for Detection of Patients With Chronic Kidney Disease.\"\r\n    Clinical Nephrology.   2017.", "Shaffer, Lindsay.   “This Simple Spoon Test Reveals Hidden Health Problems in Your Body.\"\r\n    DavidWolfe.com.   Accessed 9 February 2017.", "Brightside.me.   \"One Simple Way to Check Your Health in One Minute.\"\r\n    Accessed 9 February 2018.", "d’Entremont, Yvette et al.   “David Avocado Wolfe Is the Biggest Asshole in the Multiverse.\"\r\n    The Outline.   7 August 2017.", "Mitchell, Roby.   “The Clinical Picture of Hypothyroidism.\"\r\n    Holistic Primary Care,   Fall 2007.", "Callen, Jeffery P. et al.   Dermatological Signs of Internal Disease.\r\n    Elsevier Health Sciences, 2009.   ISBN 1437711308   (p. 199).", "MayoClinic.org.   \"Yellow Tongue.\"\r\n    Accessed 9 February 2018.", "Coleman, Naomi.   “How the Colour of Your Tongue Reveals Your Health.\"\r\n    Daily Mail.   Accessed 9 February 2018.", "MayoClinic.org.   \"White Tongue Causes.\"\r\n    Accessed 9 February 2018.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]