["Several Facebook and Twitter users have shared a one-minute video that shows men uprooting plants from a field. The viral text associated with the video reads, “Tree plantation drive was started by Pak PM Imran Khan. Look how namazi people oppose it becuase it’s un!slam!c. Planting tree is against the faith.”", "Right-wing author Renee Lynn claimed that Pakistani Prime Minister Imran Khan “copying” his Indian counterpart started a tree plantation drive but locals uprooted the trees because they consider it “against Islam”. The video gained close to 10,000 retweets and 4 lakh views as of this writing. (archived link)", "Modi Ji on Earth Day started “Plant Trees” project because it has many benefits. Now Pakistan PM Imran Khan is copying Modi & started the “Tree Plantation Drive”. Look at these idiot vultures in Pakistan ripping out all the trees. They said “Planting trees is against Islam”. pic.twitter.com/N4kSOKoeKK", "— Renee Lynn (@Voice_For_India) August 9, 2020", "Other Twitter users who shared the viral video include Major Surendra Poonia and Norwegian diplomat Erik Solheim. Poonia’s tweet gained over 8,000 retweets.", "This slideshow requires JavaScript.", "Pakistani Jihadis uprooting tree saplings to practice killing infidel kaafirs.", "Which begs the eternal question: How does one country produce so many rectums? Just how does Pakistan do it? pic.twitter.com/ADNkdmvrR9", "— Tarek Fatah (@TarekFatah) August 9, 2020", "IPS officer Dipanshu Kabra quote-tweeted Solheim and wrote, “Even God can’t bless a nation where extremist thinks, “Tree Plantation is “Anti-Islam” All religions preach that “We the people of Earth, must respect & protect all living beings and embrace our relationship with the environment. Our deepest sympathies with @ImranKhanPTI.” Kabra later deleted his tweet.", "Ravinder Sangwan posted the viral video on Facebook with the same narrative. It gained over 6,700 shares.", "Alt News performed a keyword search ‘plantation Pakistan uproots trees’ and found an August 9 report by The News, a Pakistan-based website. The article includes a video of a news bulletin that shows the viral video. The outlet also tweeted the article.", "Locals uproot trees of PTI lawmaker's plantation campaign in Khyber over land dispute#TheNews", "— The News (@thenews_intl) August 9, 2020", "As per the report, the chaotic incident took place at the Mandi Kas area in Khyber Agency in Pakistan. Newly-planted trees were uprooted by locals over alleged “forceful plantation on private land”. The tree plantation drive was an initiative by Pakistan Tehreek-e-Insaf member Iqbal Afridi as a part of Pakistan’s 10 Billion Tree Tsunami, a nationwide plantation drive.", "On August 9, PM Khan had organised the “biggest” plantation drive in the country with the goal to plant at least 35 lakh trees.", "I want everyone to join me tomorrow, 9 Aug, in planting trees all over Pak. Have asked my MPs, ministers, Chief Ministers and Tiger Force to participate in the biggest tree planting campaign in our history. The target is 35 lakh trees in a day though we will try to exceed it.", "— Imran Khan (@ImranKhanPTI) August 8, 2020", "Afridi admitted that the plantation campaign in Mandi Kas had been carried out on private property. He told The News, “The locals were angry over the unauthorised tree plantation campaign. We’re trying to have negotiations with them.”", "Speaking to Dawn, a district administration official said that there was a dispute between two powerful tribes over the ownership of the land. “One of the parties was present when the campaign was inaugurated, while the other was unaware about the drive and uprooted the saplings,” he said.", "Riaz Ghafur, a former faculty member at Edwardes College Peshwar, had tweeted the viral video condemning the incident. He subsequently shared another video where people can be seen planting trees. Ghafur told Alt News that the elders of the tribe which did not oppose the plantation drive later planted trees on the same land.", "دا هم زما قام دی! چا چې نن بوټي ویستلي وو، راغلل او بیا ئې وکرل. ځکه چې بوټي که د دښمن په زمکه وي او که د دوست فائده ئي ټولو ته وي. پام کښې لرئ چې دا پېښه د خېبر پښتونخوا په ضلع خېبر کښې مخي ته راغلي وه.#PlantforPakistan https://t.co/QgCAxRjijf pic.twitter.com/WEU3lC4xTA", "— Riaz Ghafur (@riazghafur) August 9, 2020", "Thus, social media claim that people in Pakistan opposed a tree plantation campaign because it is “unIslamic” to plant trees is ridiculous and false.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]