["About this rating", "In June 2020, a meme supposedly showing a picture of 2020 Democratic U.S. presidential candidate Joe Biden's great-grandfather, Joseph J. Biden -- including a piece of text claiming that he was a Confederate soldier who owned slaves in the 1800's -- was widely circulated on social media:", "This is not a photograph of Joe Biden's great-grandfather, and the claim that \"Joseph J. Biden\" was a Confederate soldier who owned slaves is unfounded.", "While this meme went viral in June 2020, it's actually been circulating for more than a decade. The earliest iteration we could find was posted to the Blogspot blog Truth First back in 2008, when Biden was running for vice president alongside then-presidential candidate Barack Obama. That posting included no supporting information to back up its claims, and in the 12 years since its posting, no sources to support this claim have emerged.", "We were also unable to find any mention of a great-grandfather named Joseph J. Biden in any of the material we examined while researching Biden’s family tree. In 2016, the Irish Family History Research Center traced the Irish side of Biden's family tree back six generations. On his side, then-vice president Biden's great-grandfathers were James Finnegan, born in Ireland in 1840, and Edward Francis Blewitt, born in 1859.", "The Irish Family History Research Center writes:", "The Vice President’s great-great grandfather, Owen Finnegan, left in the late 1840's for America. Previous research undertaken by genealogist Megan Smolenyak identified Owen’s marriage in 1839 to Jean Boyle in county Louth. Owen and Jean’s first four children were born here, including the Vice President’s great-grandfather, James Finnegan born 1840.", "The Vice President’s earliest traceable direct ancestor is his great-great-great grandfather Edward Blewitt (ca. 1795-1872), born in north county Mayo, Ireland. Our first documentary evidence for Edward Blewitt is in the parish records for Kilmoremoy, in the picturesque town of Ballina. The town’s name is derived from the Irish ‘mouth of the river or ford’ and it is located at the head of the river Moy overlooking Killala Bay. It was here that we know that at least three children were born to Edward Blewitt and Mary Mulderg, including the Vice President’s great-great grandfather, Patrick Blewitt baptised in 1832, when the couple were living in Patrick Street, part of Garden Street, in the heart of the town. It is disappointing that parish registers for Kilmoremoy only start in 1823 for baptisms and marriage's preventing us from determining Edward Blewitt's exact year of birth.", "Details about the other side of Biden's family are less clear. Still, there's no evidence to suggest that Biden's great-grandfather was a Confederate soldier and slave owner. Biden's father's family came from England, and they arrived in America (specifically in Baltimore, Maryland) sometime in the 1840s. A passage from David Hagan's \"No Ordinary Joe: The Life and Career of Joe Biden\" gives some insight into Biden's family history:", "Biden's father's family has been traced back to an Englishman from Sussex, William Biden, who was born around the same time as Edward Blewitt and who died in Baltimore in the 1840s. Elsewhere on that side of the family, there were more Irish and French ancestors, which explains Biden's unusual middle name, Robinette. According to family folklore, the Robinettes, Joe Biden's grandmother's family, crossed the Atlantic with Lafayette, the young Frenchmen who served as a General in the American army during the War of Independence, and never returned. Biden's paternal grandfather, Joseph H. Biden, was from Baltimore and worked as a salesman in the oil industry.", "USA Today identified Biden's great-grandfather as George T. Biden, not Joseph J. Biden as claimed in the meme, who was born in 1867, two years after the end of the Civil War. Biden's great-great grandfather was named Joseph H. Biden (some genealogy sites list him as Joseph J.H. Biden,) and he lived during the Civil War. However, Biden's great-great grandfather was on a draft registration list for the Union Army, not the Confederacy, and the Maryland State Archives (where Biden's great-grandfather and great-great grandfather lived) do not list any Bidens as slave owners.", "The Maryland State Archives \"Legacy of Slavery\" website does list a few \"Robinettes\" who owned slaves during the 1830s. However, it's unclear how (or if) this family is related to the Bidens. The former vice president's middle name, Robinette, is the same as his grandmother's maiden name, Mary Elizabeth Biden (Robinette). However, we've been unable to trace a direct line from Biden's grandmother to the Robinettes on Maryland's Legacy of Slavery website. While it's possible that the former vice president's mother's mother's parents' parents' are listed on this website, it's also possible that the two-generation gap between Mary Elizabeth Biden (Robinette) and the Robinettes on this list of slave owners is filled with non-paternal or maternal ancestors.", "Regardless, this image does not show the former veep's great-grandfather \"Joseph J. Biden,\" a confederate soldier who owned slaves. So who does this image show?", "The image at the center of this meme does not show a member of the Biden family. We reached out to Kurt Luther, an associate professor of computer science at Virginia Tech and founder of \"Civil War Photo Sleuth,\" an online tool that helps users identify soldiers in old Civil War photographs, for help unmasking the individual in this photograph.", "The man in this photo is not Biden's great-grandfather \"Joseph J. Biden.\" This image actually shows a man named Richard Young Bennett, a Confederate soldier who served with Mississippi's 2nd Infantry during the Civil War. Furthermore, Luther was unable to find any Confederate soldiers with the surname \"Biden\" in various Civil War soldier databases he examined.", "\"I don't know anything about Joe Biden's ancestry,\" he said, \"but I can confirm by searching a couple of Civil War soldier databases that there was no Confederate soldier with the surname Biden.\"", "To sum up", "The viral meme claims that an image shows Joseph J. Biden, former Vice President Joe Biden’s great-grandfather, slave owner, and confederate soldier. But, that isn’t the case. The man in this photograph is actually a Civil War soldier named Richard Young Bennett who has no connection to the Biden family.", "Furthermore, Biden’s paternal great-great grandfather was George T. Biden, not Joseph J. Biden, and we found no “Bidens” in the databases examined regarding Civil War soldiers or slave owners. While there are members of the “Robinette” family listed in Maryland’s database of slave owners from 1830, it’s unclear how this family is related (if at all) to the former vice president.", "Kertscher, Tom.   \"No Evidence Joe Biden’s Great-Grandfather Was Confederate Soldier, Enslaved People.\" \r\n    Politifact.   26 June 2020.", "Lee, Ella.   \"Fact Check: Joe Biden's Great-Grandfather Didn't Own Slaves, Fight for Confederacy.\" \r\n    USA Today.   29 June 2020.", "Hagan, David.   \"No Ordinary Joe: The Life and Career of Joe Biden.\"\r\n   Oppian.   26 May 2020.", "BBC.   \"Joe Biden: US Vice President Returns to His Irish Roots.\"  \r\n  21 June 2016.", "Irish Central.   \"Joe Biden's Love Letter to His Irish Roots Revealed.\"  \r\n  17 May 2020.", "Irish Family History Center.   \"Vice President Joe Biden's Irish Family History.\"  \r\n  Retrieved 22 June 2020.", "Updated [29 June 2020]: Article updated with more information about Biden's paternal great-grandfather and the members of the \"Robinette\" family listed on the \"Legacy of Slavery\" website.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]