["About this rating", "Multiple mugshots of persons booked by the Arkansas' Union County Sheriff's Department show the arrestees wearing Nike shirts.", "The county sheriff denied that the use of Nike apparel was intended at a jab at Nike over their promotional partnership with Colin Kaepernick.", "On 11 October 2018, activist Shaun King posted a series of mugshots purportedly taken by the Union County Sheriff's Department in Arkansas showing various arrestees dressed in Nike attire.", "King reported, via a source, that the sheriff was dressing individuals in Nike shirts for their mugshots as a way to mock the company and their new brand ambassador, Colin Kaepernick:", "The Sheriff in Union County, Arkansas is putting Nike t-shirts on people they arrest and making them wear them during mugshots.", "Source says it is to mock Nike and Colin Kaepernick. Disgusting. pic.twitter.com/9z9Nw9hxuF", "— Shaun King (@shaunking) October 11, 2018", "The Arkansas Democrat-Gazette reported that the Union County sheriff's office removed all mugshots from their web site shortly after King's tweet went viral:", "The Arkansas Democrat-Gazette reached out to [Union County Sheriff Rick] Roberts but was unable to speak with him. Calls to the sheriff’s office were directed to a voicemail for the the public relations officer, Chief Deputy Charles Phillips, who was also unavailable.", "About 9 p.m., less than an hour after King posted the allegation to social media, the Union County sheriff’s office removed all photos of inmates from the jail’s online roster.", "Before the photos were taken down, at least 11 of the 182 inmates were shown wearing a large, black T-shirt with NIKE ATHLETICS in boldface font above Nike’s signature check mark.", "As of this writing, the \"Jail Roster\" at the Union County Sheriff's Department is indeed void of mugshots:", "However, we did find several of these photographs on arrests.org, a website that collects mugshots from county sheriff's offices from around the country. In addition to locating several of the mugshots that were originally posted by King, we also found eight additional mugshots taken in Union County, Arkansas showing recently arrested individuals in similar Nike clothing:", "A number of conservatives called for a boycott of the apparel company in September 2018 after Nike featured Colin Kaepernick, the former NFL star who became a lightning rod for controversy when he started to kneel during the National Anthem in protest of police brutality in 2016, in a new advertisement.", "Sheriff Roberts told Little Rock television station KLRT that these mugshots were not connected to any Nike protests but rather were simply provided to people who came into the jail without proper attire:", "Sheriff Ricky Roberts says the shirts were given to people who came into their jail without \"proper attire during the booking process.\" Roberts says the shirts weren't purchased by his department -- but rather, already on-hand.", "\"We are not, and will not, be influenced by current political and social debates in the media,\" Roberts said in a statement. \"This shirt is not only in use now, but has also been for several months prior. We have taken steps to rectify this issue and insure that this will never happen again.\"", "The Union County Sheriff's Department also posted a news release with this information on Facebook:", "The mugshots available via Arrests.org only date to the end of August 2018, and the earliest mugshot that we could locate involving a Nike Athletics shirt was posted on 13 September 2018. As Union County Sheriff's Department has removed the mugshots from their website, we are unable to verify Roberts' statement that this shirt was in use for \"several months prior.\" Many of the individuals pictured above also appear to be wearing clothing underneath their Nike shirts, which could indicate they were perhaps not supplied with Nike-branded clothing because they lacked \"proper attire.\"", "We've reached out to the Union County Sheriff's Department in an attempt to determine what classifies as improper attire.", "It should be noted that our examination of the mugshots on Arrests.org didn't yield any specific patterns about who was given Nike shirts to wear.  The vast majority of mugshotted by the Union County Sheriff's Department between 1 September 2018 and 11 October 2018 were not wearing Nike shirts.", "Kellerman, Austin.   \"Sheriff: Nike Shirts in Mug Shots Not Done in Protest.\"\r\n    KLRT-TV.   11 October 2018.", "Abad-Santos, Alex.   \"Why the Social Media Boycott Over Colin Kaepernick Is a Win for Nike.\"\r\n    Vox.   6 September 2018.", "Turnage, Clara.   \"Activist Says Arkansas Sheriff's Office Forced Inmates to Wear Nike Shirts in Mug Shots.\"\r\n    Arkansas Democrat-Gazette.   10 October 2018.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]