["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "U.S. Rep. Patrick Murphy and U.S. Sen. Marco Rubio debate at Broward College in Davie on Oct. 26, 2016. (AP photo)", "Marco Rubio decried President Barack Obama’s past Syria strategy during the second U.S. Senate debate in Davie, saying Obama had supported small and ineffectual attacks.", "Debate moderator Patricia Mazzei of the Miami Herald noted during the Oct. 26 event with U.S. Rep. Patrick Murphy at Broward College that Rubio voted against airstrikes in Syria, and asked if he favored committing ground troops there.", "Rubio said he would support a plan if he thought it would work but didn’t think using American soldiers was a good option. He said he voted against Obama’s plan because he had favored helping factions already in Syria over committing to airstrikes.", "\"He (Obama) was proposing what they called pinprick strikes — basically a symbolic strike to send a message, but not backed up by a clear plan,\" Rubio said, without elaborating on who \"they\" were.", "Obama did use the term \"pinprick strikes,\" but it was to specifically advocate against what Rubio is attributing to him.", "Military intervention", "Rubio’s \"pinprick strikes\" go back to 2013, when Obama was grappling with how to deal with Syrian President Bashar al-Assad’s chemical weapons attack against civilians.", "Washington had planned a military response against the Assad regime, but Obama changed his mind on Aug. 31. Instead of acting unilaterally, Obama planned to first ask Congress to authorize an attack. His approach reportedly would have involved surgical missile strikes by Navy destroyers.", "Obama did use the term \"pinprick\" several times. But every time he did, it was to describe what he wanted the U.S. military to avoid.", "Obama said it during an interview blitz on Sept. 9. In one example, he told the Today show’s Savannah Guthrie that \"the U.S. does not do pinpricks. Our military is the greatest the world has ever known. And when we take even limited strikes, it has an impact on a country like Syria.\"", "There is no technical term like \"pinprick\" when describing any kind of military intervention, Michael O’Hanlon, a Brookings Institution senior fellow and co-director of the institution’s Center for 21st Century Security and Intelligence, told us in a previous fact-check of this Rubio attack. O’Hanlon said that in his experience, when the word is used, \"it is always pejorative.\"", "Sen. John McCain, R-Ariz., said on Face the Nation on Sept. 1, 2013, that he wondered whether surgical strikes are \"just a pinprick that somehow Bashar Assad can trumpet that he defeated the United States of America.\"", "The vote mentioned at the debate came on Sept. 4, when Rubio voted against a Senate Foreign Relations Committee resolution allowing Obama to use limited force against Assad’s regime. It passed by a 10-7 vote and was sent to the Senate.", "The same day, Defense Secretary Chuck Hagel also used the term during a hearing for the House Foreign Affairs Committee on strategy in Syria.", "\"The president has said ... this would not be a pinprick. Those were his words. This would be a significant strike that would in fact degrade his capability,\" Hagel said.", "Secretary of State John Kerry did refer to the planned intervention as an \"unbelievably small, limited kind of effort\" on Sept. 9, but he didn’t call it a \"pinprick.\"", "As support waned in the Senate, Obama asked the Senate majority leader, then Harry Reid, to pull the measure. Obama said on Sept. 10 that the military would not intervene but could in the future.", "\"As some members of Congress have said, there's no point in simply doing a pinprick strike in Syria,\" Obama said. \"Let me make something clear: The United States military doesn't do pinpricks.\"", "Rubio voted in favor of arming Syrian rebels a year later.", "Rubio’s campaign pointed out that Obama revisited the term in the November 2016 issue of Vanity Fair when he said there were no easy solutions in Syria.", "\"The conventional arguments about what could have been done are wrong. The notion that if we had provided some more modest arms to Syrian rebels — that somehow that would have led to Assad’s overthrow more decisively,\" Obama said. \"The notion that if I had taken a pinprick strike when the chemical-weapons issue came out, as opposed to negotiating and getting all those chemical weapons out — that that would have been decisive. All those things I tend to be skeptical about.\"", "It’s not clear if Obama is characterizing his own proposed strike as a \"pinprick,\" or describing a potential attack the way others may have suggested. Even so, it’s still clear that back in 2013, he specifically avoided defining his proposal as any form of \"pinprick.\"", "Our ruling", "Rubio said Obama \"was proposing pinprick strikes\" for military intervention in Syria.", "In 2013, Obama did suggest a limited military response — likely airstrikes from Navy ships — after Assad’s chemical weapons attacks on civilians. Obama only used the word \"pinprick\" to describe what he didn’t want the attacks to be, and said repeatedly that the U.S. military isn’t built for small-scale action. And while some officials have used the term, \"pinprick strikes\" aren’t a true military description for any kind of operation.", "We rate the statement False.", "https://www.sharethefacts.co/share/312c2630-210d-4b95-8f30-c16c89bb4dda", "U.S. Sen. Marco Rubio, Comments during U.S. Senate debate, Oct. 26, 2016", "New York Times, \"Obama Seeks Approval by Congress for Strike in Syria,\" Aug. 31, 2013", "Washington Post, \"Senate committee approves resolution authorizing U.S. strike on Syria,\" Sept. 4, 2013", "Sen. Marco Rubio, \"Rubio: My Vote Against Military Action in Syria,\" Sept. 4, 2013", "Reuters, \"U.S. defense chief says attack on Syria would not be 'pin prick',\" Sept. 4, 2013", "New Yorker, \"Six interviews later, a way out for Obama on Syria?,\" Sept. 9, 2013", "PolitiFact Florida, \"Obama called potential attack on Syria a 'pinprick,' Rubio says,\" Sept. 18, 2015", "Vanity Fair, \"Barack Obama and Doris Kearns Goodwin: The ultimate exit interview,\" November 2016", "Interview with Michael Ahrens, Rubio spokesman, Oct. 26, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]