["On September 10, Bharatiya Janata Party (BJP) spokesperson Sambit Patra tweeted a video clip from Aaj Tak’s debate show Dangal. The clip showed him taking a jibe at fellow panellist Ravi Shrivastava who raised a question on Y-security given to Bollywood actor Kangana Ranaut from taxpayers’ money before her scheduled visit to Mumbai on September 9.", "The actor has been surrounded by controversy after comparing ‘Pakistan occupied Kashmir’ with Mumbai and criticising the Mumbai police. The debate was held a day after Birhanmumbai Municipal Corporation (BMC) demolished parts of her Pali Hill office in Mumbai amid a public row with Maharastra’s ruling party Shiv Sena, which also controls the corporation. The Bombay High Court has stayed the demolition of what the BMC alleges to be unauthorised structures.", "Responding to Shrivastava’s question on security provided to the actor, Patra said, “When Kasab was fed biriyani from their money, he never for one day said that he – Kasab – shouldn’t be fed biriyani from my money”.", "रवि श्रीवास्तव : कंगना को security मेरे पैसे से क्यों दो गयी? मेरा उत्तर : जब अजमल कसाब को आपके पैसे से बिरयानी दो जा रही थी तब आपको कोई दिक़्क़त नहीं थी। pic.twitter.com/OuqGuzfOJS", "— Sambit Patra (@sambitswaraj) September 10, 2020", "This fabricated story was cited in the past by the top brass of the BJP, Home Minister Amit Shah, who was then the party president. He had targeted the Congress party for ‘feeding biryani to terrorist‘ at a campaign rally in Uttar Pradesh in March 2019 and the same was also used by UP CM Yogi Adityanath at a rally in Rajasthan in November 2018.", "The fact of the matter is that it’s a fabricated story which was propagated by Ujjwal Nikam, the public prosecutor of the 26/11 trial. During the trial, Nikam, who had argued on behalf of the state, had manufactured a story about Ajmal Kasab being fed biryani in jail to counter an emotional wave supposedly being created in Kasab’s favour. “Kasab neither asked for biryani nor it was served by the government. I concocted it just to break an emotional atmosphere which was taking shape in favour of Kasab during the trial of the case”, Nikam said speaking to the media in 2015.", "According to a 2012 report, Nikam had earlier said, “On Raksha Bandhan, he had inquired from his lawyer whether some girl would come to tie a Rakhi on his wrist, while on another occasion he threw tantrums for mutton biryani to be served to him in jail.”", "It is unfortunate that a false story was used for the third time to counter questions posed on the administration. The fictional tale is a classic example of evading criticism with whataboutery.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]