["The video was published here on Twitter on November 21, 2020. It has been viewed almost 300 times.", "WARNING: Distressing content", "The tweet's traditional Chinese-language caption translates to English as: “Please report this raid and murder case to the FBI / Location: San Gabriel, Los Angeles, California.”", "San Gabriel is a US city in California state’s Los Angeles county.", "The video was also shared here on Twitter, and here and here on Facebook, alongside a similar claim.", "The claim is false.", "A reverse Google image search found this article published by the Brazilian news portal G1 on August 2, 2020.", "The Portuguese-language article states in part: “The Civil Police is investigating whether the fatal shooting of an accountant in the South Zone of São Paulo was a robbery or an execution. The incident took place on the morning of last Wednesday (29) in front of the accounting firm where he worked, and was recorded by security cameras (see video below; the scenes are graphic).”", "São Paulo is a municipality in Brazil.", "The footage embedded in the article shows identical scenes as the video in the misleading tweet.", "Below are screenshot comparisons between the Twitter video (L) and the clip in the G1 report (R):", "The article states that the car pictured in the video was parked “at Rua Coronel Francisco Inácio, in the Sacomã region”.", "AFP located the street here on Google Maps.", "Other local media, including Agora São Paulo newspaper here, and R7 news portal here also reported on the same incident.", "The same claim was also debunked by Taiwanese fact-checking organization Taiwan FactCheck Center here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]