["By Angelo Fichera", "Posted on August 4, 2020 | Updated on February 10, 2021", "A viral headline on Facebook claims that a vaccine isn’t “Needed” for COVID-19 because “There Is Already A Cure.” But the supposed “cure” is an asthma medication, touted by a Texas doctor, that has not yet been proven in clinical trials as an effective treatment for COVID-19 — though researchers are exploring its efficacy.", "In a video interview shared on social media in early July, a Texas doctor promised a “silver bullet” and “cure” for COVID-19.", "The answer, Dr. Richard Bartlett claimed, is an existing asthma medicine — inhaled budesonide, a corticosteroid — whose success, he suggests, negates the need for a vaccine. The video has racked up 4 million views on YouTube and its claims have migrated elsewhere. A headline shared on Facebook nearly 40,000 times, for example, claims that “COVID-19 No Vaccine Needed, There Is Already A Cure.”", "But experts say the medication has not yet been proven as an effective treatment for COVID-19 and, even if helpful, wouldn’t dismiss the need for a vaccine for the novel coronavirus that causes the disease — which would help to prevent people from becoming sick in the first place. The World Health Organization also notes that there is “currently no licensed medication to cure COVID-19.”", "Bartlett, a general practice doctor who initiated a short-lived run for Congress as a Republican in 2019, said in his interview on the conservative talk show “America Can We Talk?” that he uses a nebulizer machine to administer the budesonide. He said he also uses zinc and clarithromycin, an antibiotic.", "“My silver bullet is inhaled budesonide,” he said. “It works. One hundred percent of my patients are alive.” He said that patients “tell me, ‘I feel better during the first treatment,’ and so their chest pain goes away, their shortness of breath goes away, their fever breaks.”", "In describing the success of one patient, he refers to the treatment as a “cure.”", "Mona Bafadhel, associate professor of respiratory medicine at the University of Oxford, told us in an email that “there is NO evidence to suggest that inhaled budesonide or any inhaled steroids (ICS) is a cure for COVID.” (Emphasis is hers.)", "Bafadhel is currently conducting a randomized controlled clinical trial to examine the use of inhaled budesonide to treat patients with early COVID-19 infection.", "“If ICS were proven to be successful, as a treatment, this would NOT mean we don’t need a vaccine,” she said.", "(Update, Feb. 10, 2021: Unpublished results from Bafadhel’s study, posted to the preprint server medRxiv, suggest that giving inhaled budesonide soon after developing symptoms can reduce the need for urgent care or hospitalization and shorten recovery time.)", "Dr. Mitchell Grayson, a professor of pediatrics and chief of the Division of Allergy and Immunology at the Nationwide Children’s Hospital at Ohio State University College of Medicine, also said in a phone interview that “the jury is out” on whether inhaled corticosteroids will help with treatment of COVID-19. Grayson briefly evaluated the dearth of evidence available on the issue for the American Academy of Allergy, Asthma & Immunology.", "“I don’t see any strong signals that would make me think that inhaled steroids are going to be remarkably better,” he said, but a clinical trial is the only way to know more definitively.", "Grayson said one possibility is that the steroid could help temper the immune system’s overreaction to the disease, since that overreaction can lead people to getting seriously ill.", "Bartlett recently started a website, “covidsilverbullet.com,” where he has published a case study of inhaled budesonide that involves two patients treated via telemedicine. The patients — a 63-year-old woman and 38-year-old man — both are reported to have preexisting conditions and use other medications, too.", "“It’s very hard to make any kinds of heads or tails out of” the case study, Grayson said.", "A large, randomized clinical trial in the U.K. by the RECOVERY group found that 22.9% of COVID-19 patients allocated dexamethasone — another steroid — by mouth or intravenously died within 28 days, as opposed to 25.7% of patients allocated usual care. It was most effective among patients receiving invasive mechanical ventilation.", "The study only looked at hospitalized patients and did not look at inhaled steroids. It also did not find a benefit for those not receiving respiratory support.", "In a July 30 commentary for The Lancet Respiratory Medicine, Bafadhel and Dan Nicolau, a physician and mathematician at Queensland University of Technology in Australia, lay out the hypothesis that inhaled corticosteroids “could be a therapeutic intervention for COVID-19 for several reasons.”", "“We would propose that ICS could have a dual role: first, reducing the inflammatory [acute respiratory distress syndrome-like] response affecting a minority of patients with COVID-19; and second, directly inhibiting viral replication,” they note. They later add: “Whether use of ICS protects against COVID-19 is still unknown, but to dismiss this hypothesis as nonsense is premature.”", "In addition to Bafadehl’s study, there are several other clinical trials also exploring inhaled corticosteroids and COVID-19.", "But in the viral video, Bartlett dubiously suggests the medication is already being used so widely as to keep COVID-19 fatalities low in Taiwan, Japan, Singapore and Iceland. “They’re doing what I’m doing … an inhaled steroid,” he claims.", "The WHO, in a statement provided to FactCheck.org, said “there is no evidence suggesting that inhaled corticosteroid have reduced case fatality rate in Taiwan, Japan, Singapore, and Iceland.”", "Taiwan, with a population of nearly 24 million, has reported only 475 COVID-19 cases and seven deaths — but it’s not because of an inhaled steroid, said Tsung-Mei Cheng, a health policy research analyst at Princeton University who has written about Taiwan’s health care system and closely follows the country’s COVID-19 response.", "Cheng said in a phone interview that she had “never” heard of such a treatment being responsible for low fatalities. Instead, she said the country prepared itself for such a crisis in the aftermath of the SARS outbreak in the early 2000s. She said the country’s leadership (including a central command system), a national policy, and “very, very strict, effective quarantine and contact tracing” protocols helped to prevent the disease from spreading within the country.", "The WHO statement also said that “[t]here is limited information on possible effect of inhaled steroids and there is no evidence there is any advantage to use this route of administration to improve patient outcomes.” (Emphasis is theirs.)", "“Available evidence from randomized clinical trials such as RECOVERY suggest that systemic corticosteroids” — meaning, taken orally or through a shot — “provide benefits in reducing mortality in severe and critically ill patients requiring respiratory support,” it noted. “In addition, data indicate that [there is] no benefit of systemic corticosteroids in patients who did not require supplemental oxygen.”", "Dr. Amesh Adalja, senior scholar at the Johns Hopkins University Center for Health Security who studies infectious diseases, also said in an email that “[t]here is no definitive evidence to support the use of inhaled corticosteroids like budesonide in the treatment of COVID-19. While there is biological plausibility that such a treatment could have a beneficial role it can only be determined in a proper clinical trial.”", "Adalja cautioned that “[w]hen it comes to steroid treatments for COVID19 it is important to realize that, as was shown with systemic steroid treatment, there is an appropriate and inappropriate time to administer them.” He also said “inhaled corticosteroids are not benign and have a range of side effects that range from osteoporosis to making one more vulnerable to bacterial pneumonia so I would not advise the use of such treatments for COVID19 outside of a clinical trial or protocol (though those prescribed them for other reasons should continue taking them).”", "In a subsequent interview, with the conservative outlet One America News Network, Bartlett said that a hospital in Texas south of San Antonio — Frio Regional Hospital — “emptied” its ICU of COVID-19 patients by using inhaled budesonide.", "The CEO of the hospital, John Hughson, told FactCheck.org in a phone interview that the hospital, which typically has a 25-bed capacity, did use inhaled budesonide on three patients in a room converted into an ICU — and that they improved several days later and were discharged. He said he believes the inhaled budesonide can be effective for some patients and that while some doctors at the hospital use it, others haven’t adopted it.", "Hughson noted that “it is a very, very small sample size and all those patients were on high-flow oxygen.”", "“It’s up to the physician’s discretion and their medical judgment … if they initiate the therapy at all,” he said. “I would also say that’s not the only treatment we use.”", "“I wouldn’t say this is indicated for every patient, it is not the magic cure for everything, and it is not going to keep everyone from getting the disease,” he added.", "On that point, Bartlett also suggested — in his earlier interview — that a vaccine isn’t needed if inhaled budesonide is being widely used. For example, after advancing the baseless claim about Taiwan’s wide adoption of the steroid, he says: “Taiwan, 24 million people, they don’t need to wait for a vaccine — they don’t have a problem that you should vaccinate 24 million people for.”", "Adalja, however, said that “no treatment will obviate the need for a vaccine — a vaccine is the only way to remove this virus as a threat to human health.”", "And Cheng, who said she has spoken recently with both Taiwan’s former health minister and the current health minister, dismissed the suggestion that the country isn’t in need of a vaccine. She said Taiwan is putting many resources into vaccine development and negotiating with vaccine manufacturers to ensure that, when one is ready, the country can procure enough doses to begin with protecting health care workers — followed by the rest of the population.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "Adalja, Amesh. Senior scholar, Johns Hopkins University Center for Health Security. Email to FactCheck.org. 29 Jul 2020.", "Barnes, Peter. Professor of medicine, National Heart and Lung Institute in London. Email to FactCheck.org. 28 Jul 2020.", "Bafadhel, Mona. Associate professor of respiratory medicine, University of Oxford. Email to FactCheck.org. 29 Jul 2020.", "Bafadhel, Mona and Dan V. Nicolau.“Inhaled corticosteroids in virus pandemics: a treatment for COVID-19?” The Lancet Respiratory Medicine. 30 Jul 2020.", "“Budesonide and COVID-19.” American Academy of Allergy, Asthma & Immunology. 19 Jul 2020.", "“Budesonide (Inhalation Route).” Mayo Clinic. 1 Jul 2020.", "Cheng, Tsung-Mei. Health policy research analyst, Princeton University. Phone interview with FactCheck.org. 4 Aug 2020.", "“COVID-19 Dashboard.” Center for Systems Science and Engineering, Johns Hopkins University. Accessed 3 Aug 2020.", "Edgin, Alana. “Odessa man drops from Congressional run due to other ‘like-minded’ candidate.” GoSanAngelo.com. 27 Sep 2019.", "Grayson, Mitchell. Professor of pediatrics and chief of the division of allergy and immunology, Nationwide Children’s Hospital at Ohio State University College of Medicine. Phone interview with FactCheck.org. 30 Jul 2020.", "Hughson, John. CEO, Frio Regional Hospital. Phone interview with FactCheck.org. 4 Aug 2020.", "“Mythbusters.” World Health Organization. Accessed 3 Aug 2020.", "RECOVERY Collaborative Group. “Dexamethasone in Hospitalized Patients with Covid-19 — Preliminary Report.” New England Journal of Medicine. 17 Jul 2020.", "World Health Organization. Email statement to FactCheck.org. 31 Jul 2020.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]