["By D'Angelo Gore", "Posted on May 20, 2020", "President Donald Trump erroneously tweeted that Michigan’s Democratic secretary of state was “illegally” sending “absentee ballots to 7.7 million people” for this year’s primary and general elections.", "The state said it will send absentee ballot applications — not actual ballots — to all registered voters, who may want to vote by mail.", "Trump, who has been critical of mail-in voting, made the false claim May 20, in a since-deleted tweet.", "“Breaking: Michigan sends absentee ballots to 7.7 million people ahead of Primaries and the General Election,” he wrote. “This was done illegally and without authorization by a rogue Secretary of State. I will ask to hold up funding to Michigan if they want to go down this Voter Fraud path.”", "About an hour after his message was sent, Michigan Secretary of State Jocelyn Benson corrected the president on Twitter.", "“Hi!  I also have a name, it’s Jocelyn Benson. And we sent applications, not ballots. Just like my GOP colleagues in Iowa, Georgia, Nebraska and West Virginia,” she tweeted.", "Benson is correct that Iowa, Georgia, Nebraska and West Virginia have mailed absentee ballot applications to voters.", "Trump’s original tweet was later deleted, six hours after he posted it, according to Politwoops. The president replaced it with one saying “ballot applications” — instead of just “ballots” — still claiming it’s “illegal.”", "Benson announced May 19 that, due to the COVID-19 pandemic, all of the state’s registered voters would be mailed an application to vote by mail in the August and November elections. A press statement on the announcement said that 1.3 million of the state’s 7.7 million registered voters are already on the permanent absent voter list, and receive applications from their local election clerk prior to each election.", "“By mailing applications, we have ensured that no Michigander has to choose between their health and their right to vote,” Benson said. “Voting by mail is easy, convenient, safe, and secure, and every voter in Michigan has the right to do it.”", "The National Conference of State Legislatures says that all U.S. states allow qualified voters to vote by absentee ballot, and five states (Utah, Colorado, Hawaii, Washington and Oregon) currently conduct all their elections primarily by mail. Michigan is one of 34 states that do not require an excuse from those who want to vote by absentee ballot, according to the NCSL.", "Trump also tweeted a threat to withhold unspecified federal funding from Nevada, which he said was sending “illegal” ballots to voters in the mail.", "“State of Nevada ‘thinks’ that they can send out illegal vote by mail ballots, creating a great Voter Fraud scenario for the State and the U.S. They can’t!,” Trump wrote. “If they do, ‘I think’ I can hold up funds to the State. Sorry, but you must not cheat in elections.”", "Citing concerns about COVID-19, Nevada Secretary of State Barbara Cegavske, a Republican, did announce in late March that state election officials decided that it would be best to conduct an all-mail vote for the upcoming June 9 primary election.", "“All active registered voters in Nevada will be mailed an absentee ballot for the primary election,” her office said in a news release.", "Nevada state law already allowed registered voters to request, for any reason, an absentee ballot to vote by mail. And neither the White House nor Trump’s presidential campaign could explain why it would be “illegal” for Nevada to send ballots to voters for next month’s primary election.", "In a statement released after Trump sent his tweet, Cegavske’s office said: “Secretary Cegavske lawfully declared the 2020 primary election as a mail-in election. In a recent court order, a federal judge ruled that Secretary Cegavske lawfully exercised authority granted to her by state law to call for a primary election conducted primarily by mail ballot.”", "Election experts previously told us that fraud via mail-in ballots is more common than in-person voting fraud, but still rare. Plus, a recent study by Stanford University’s Democracy & Polarization Lab found that neither the Democratic or Republican parties would benefit from an entirely vote-by-mail system.", "“We find that universal vote-by-mail does not affect either party’s share of turnout or either party’s vote share,” the study’s authors wrote.", "Editor’s Note: FactCheck.org does not accept advertising. We rely on grants and individual donations from people like you. Please consider a donation. Credit card donations may be made through our “Donate” page. If you prefer to give by check, send to: FactCheck.org, Annenberg Public Policy Center, 202 S. 36th St., Philadelphia, PA 19104.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]