["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "In a packed town hall in Springfield, Mo., Sen. Barack Obama laid down the challenge for a duel.", "His eyes weren't exactly squinting. And theme music to\n\nThe Good, the Bad and the Ugly\n\ncould not be heard. But the gauntlet was dropped.", "\"I'm ready to duel John McCain on taxes,\" Obama said. \"Right here. Right now.\"", "Then Obama surprised the crowd.\n\"I don't know if people are aware of the fact,\" Obama said, \"but the family legend is that Wild Bill Hickok, he's a distant cousin of mine.\"", "The crowd roared with laughter. It seemed that perhaps the sun had gotten to him.", "\"I'm serious, I'm serious,\" Obama said. \"I don't know if it's true, but that's the family legend. But we're going to research that.\"", "No need, Sen. Obama. We called the New England Historic Genealogical Society. These are the folks who back in March released the study that found that Obama is a distant relative of actor Brad Pitt (ninth cousins, to be exact).", "Chris Child, a staff genealogist, compared geneological charts for Obama and Hickok and...bang...there it was. The two trees intersected with one Thomas Blossom of Holland, who arrived in Plymouth, Mass., in 1629.", "The two are sixth cousins\n\nsix\n\ntimes removed, Child said. Whatever that means.", "Seems quite a length for Obama to go to support a metaphor about dueling with your opponent over taxes, but then Hickok was also a noted gambler.", "Obama also said that Hickok, the legendary frontier lawman, had his first duel in Springfield, Mo. While we were digging we looked that up, too. And Obama is right again. While it's hard for many historians to separate fact from legend, it is documented that James Butler Hickok (his name wasn't even William) got the better of former Confederate Army soldier Davis Tutt in a 1865 \"quick draw\" duel after a dispute involving gambling debts and, you guessed it, a woman.", "In the ensuing years, Hickok boasted of killing more than 100 men. Though in his defense, he said they all had it coming.", "Hickok got his in 1876 after he apparently broke the cardinal rule of gunfighters: He sat with his back to the door and was shot from behind while playing poker at a saloon in Deadwood, S.D. The story was that he was holding two pairs, aces and eights — hence the term \"dead man's hand\" still used today.", "The relation to \"Wild Bill\" Hickok is way cooler than the revelations earlier this year that Obama is distantly related to none other than vice president Dick Cheney. Undoubtedly, Obama took a lot of ribbing over that. Maybe those jokesters ought to sleep with one eye open because Obama's \"family legend\" is correct. We rule the statement True.", "New England Historic Genealogical Society,\n\nPress release: Boston Genealogical Society Confirms Obama and 'Wild Bill' Hickok are Cousins\"", "New York Times,\n\n\"Obama Claims 'Wild Bill' Heritage in a Challenge to McCain\"\n\nby Michael Powell, July 30, 2008", "New York Daily News,\n\n\"Wild Bill Obama?\"\n\nby Michael McAuliff, July 30, 2008", "Library of Congress,\n\n\"American Memory U.S. Historical Collections\"", "Nebraska State Historical Society,\n\n\"James Butler 'Wild Bill' Hickok, 1837-1876\"", "Interview with Chris Child of the New England Historic Genealogical Society, July 30, 2008", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]