["About this rating", "Social media users became alarmed in early January 2019 after a Facebook post linked a child's illness to foam \"Squishies\" toys that had already been recalled in at least one country outside of the U.S.", "Elaine Lee said in her post that her 8-year-old daughter developed unusual symptoms after receiving several of the toys for Christmas:", "Within a day of acquiring them she started having nightmares and disrupted sleep. On the 4th day she started having what I believe were hallucinations or delusions. She became convinced the pictures of cats on her walls were watching her and believed the oscillating fan and dresser in her room were alive. She stared at me as I was sitting with her in her room and insisted my nose was moving around my face. She was very anxious and distressed, unable to fall asleep until she came to sleep in our room with us.", "Lee then cited a 20 June 2018 statement by the Ministry of Environment and Food in Denmark regarding an analysis performed by that country's Environmental Protection Agency (EPA).", "According to the Danish EPA's study, 12 out of the 12 toys they examined \"contained high levels of harmful chemicals,\" prompting Jakob Ellemann-Jensen, the country's minister for environment and food, to say:", "Selling toys that may be harmful to children is completely unacceptable. The toy industry is responsible for ensuring that the products they sell are legal and do not contain harmful chemicals. In this case, we’re talking about serious violations, where children breathe in substances that may cause mucous membrane irritation and which may, in the long term, be harmful for fertility and cause liver damage.", "The Ministry of Environment and Food added that the toys would be withdrawn from the market:", "The twelve tested products will now be transferred to the Danish EPA Chemical Inspection Service who will ensure the withdrawal of the products from the market and ascertain whether there are grounds to report this to the police. In the case of gross violations, these can be reported to the police. The Danish EPA Chemical Inspection Service will now assess whether to do so.", "The study also drew international attention, with news outlets in Canada and Australia reporting on the issue.", "However, Ellemann-Jensen said in a parliamentary response published on 30 August 2018 that \"no final conclusions have yet been reached\" regarding the sale of the foam toys in Denmark, indicating that no recall effort had yet been implemented.", "\"The question of whether the individual squishies products are illegal, thus depends on the progress of the further case processing in the Danish EPA,\" he wrote. We contacted the ministry seeking clarification but have yet to hear back.", "Lee said that after removing the toys from her daughter's room and \"airing out the house,\" her child began to feel better. But her story was concerning enough to readers that they shared it more than 204,000 times on social media.", "We also contacted Health Canada and the Australian Competition and Consumer Commission asking whether any investigations were underway in their respective countries regarding the toys but did not receive a response. The U.S. Consumer Product Safety Commission, which would typically assess possible consumer complaints of Squishies in the states, is currently closed as a result of the partial federal government shutdown that began in December 2018.", "Dunham, Jackie. \"'Squishies' Toys Banned in Denmark After Test Finds Harmful Chemicals.\"\r\n    CTV News.   31 August 2018.", "Ministry of Environment and Food of Denmark.   \"Popular Toy Full of Dangerous Chemicals.\"\r\n    20 June 2018.", "Bainbridge, Amy. \"Are Squishies Safe for Your Kids? Australian Authorities Launch Investigation.\"\r\n    ABC News. 12 September 2018.", "Arturo Garcia is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]