["A photograph of a group of women is being shared with the claim that it shows Jashodaben, Prime Minister Narendra Modi’s wife, attending a rally against the Citizenship Amendment Act (CAA) at Shaheen Bagh.", "The image shared by a Facebook group Mj Khan Indian has received 8,200 shares and 593 likes. It was posted on January 18 with a caption that reads, “मोदी जी की पत्नी #जसोदा_बेन भी आज शाहीन बाग पहुच गई। (Jashodaben also reached Shaheen Bagh today.)”", "The image has been shared with the same narrative on a Facebook page dedicated to lawyer Deepika Singh Rajawat.", "Alt News ran a reverse image search and discovered the same image uploaded on a Deccan Chronicle report from February 13, 2016. The woman in the pink saree is Jashodaben Modi. She was part of a hunger strike against the demolition of slums in Mumbai. The protest was held at Azad Maidan.", "Similar images were uploaded by Mid-Day, Catch News and The Hindu.", "Alt News has received several requests to verify the truth behind the viral picture.", "That PM Modi wife attended an anti-CAA rally is a claim viral on social media. From the account of one Madina Khan Barkat Khan, it drew over 700 shares and likes.", "The misinformation was shared by a parody account of media outlet Aaj Tak (@AajTak422).", "A similar tweet was posted by a parody handle of comedian Kunal Kamra.", "The claim that Prime Minister Narendra Modi’s wife Jashodaben attended an anti-CAA rally at Shaheen Bagh is completely false. A three-year-old picture of her attending a protest against the demolition of slums in Mumbai has been shared to propagate the misinformation.", "Donate Now", "Defence Correspondent turned fact-checker. Two times award winning journalist by Govt. of Goa.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]