["The claim was posted on Advance New Zealand’s Facebook page here on December 1, 2020. The post has been shared more than 260 times.", "The post claims that “mRNA vaccines intervene directly in the genetic material of the patient and therefore alter the individual genetic material, which represents the [sic] genetic manipulation”.", "It adds that “intervention can be compared to genetically manipulated food” and that “after an unprecedented mRNA vaccine, you will no longer be able to treat the vaccine symptoms in a complementary way”.", "The post goes on to state that if an inoculated patient develops Covid-19 symptoms, they will not be able to be treated “because the damage caused by the vaccination will be genetically irreversible”.", "The Advance New Zealand post claims that the author of the text is Robert F Kennedy Jr, the nephew of US President John F. Kennedy. AFP found no evidence that Kennedy was the source of the misinformation, but he has promoted falsehoods about vaccines in the past, as explained in this article by UK-based media site Tortoise.", "The text in the post has also been shared hundreds of times on Facebook here, here and here.", "The posts' claims are false, according to experts.", "A Covid-19 mRNA vaccine, which is the basis for two of the leading vaccine candidates, instructs human cells to make a protein found in the Covid-19 virus, rather than using a weakened version of the virus.", "After the immune system recognises the foreign protein, it begins “building an immune response and making antibodies, like what happens in natural infection against COVID-19,” according to the US Centers for Disease Control and Prevention.", "The notion that mRNA vaccines can manipulate a patient's genome is a “biological impossibility,” Associate Professor Helen Petousis-Harris, vaccinologist at the University of Auckland, told AFP in a December 7 email.", "“RNA vaccines cannot alter or in any way interact with a person’s genome,” she said.", "Petousis said the claim in the Facebook posts is false because “our genes are contained in the nucleus of our cells and RNA has no access to this area” and “there are no instructions in the vaccine that make it possible.”", "“The RNA in the vaccine is taken up by cells at the injection site and the instructions for the production of the vaccine antigen/the antibody generator executed. At that point the RNA is broken down into its basic building blocks to be recycled,” she said.", "University of Canterbury epidemiologist Associate Professor Arindam Basu told AFP in an email that mRNA vaccines and genetically modified foods are “two completely different concepts.”", "“Genetically modified foods are produced by manipulating the ‘genetic code’ or DNA of the organisms,” he said, adding that it is impossible for RNA to be incorporated into human DNA.", "“This vaccine will enter a cell, the cell will use the information contained in mRNA to assemble a spike protein like molecule and the immune system will generate antibodies that will circulate in the bloodstream and will neutralize if and when an active infection is encountered,” Basu explained.", "In response to the misleading Facebook posts, Petousis-Harris and Basu both told AFP that it is false to suggest patients will not be treated if they develop Covid-19 symptoms after being inoculated.", "“There will be no difference in the way someone’s disease is managed. For the majority for whom the vaccine fails, they are more likely to have mild symptoms. So far only one person in the mRNA trials who got a vaccine has had serious disease - out of tens of thousands,” Petousis-Harris said.", "Basu said: “If someone ends up with COVID19 symptoms [after being vaccinated], it means that the vaccine did not produce antibodies that were aimed at neutralizing the virus, so it is treated as a ‘new’ viral infection, no different from if the person were unvaccinated.”", "Current reports on the leading mRNA Covid-19 vaccines show that they have between 90-95% efficacy.", "Advance New Zealand, which failed to gain any seats in the country's 2020 election, has a history of publishing false and misleading content.", "The party’s page was removed by Facebook in the days before the 2020 election after it violated the platform’s terms of service. \"We don't allow anyone to share misinformation on our platforms about Covid-19 that could lead to imminent physical harm,\" a spokesperson for Facebook told AFP.", "AFP has reported on multiple other misleading claims published by the party; for example here and here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]