["Robin Vos, Speaker of The Wisconsin Assembly, explains proposed coronavirus legislation in April 2020. (Rick Wood/Milwaukee Journal Sentinel)", "Wisconsin’s gerrymandered legislative boundaries mean very few Assembly districts are competitive. Many don’t even draw two candidates.", "State election records confirm only one Assembly seat has flipped from a Republican to a Democrat since 2013, when Robin Vos took over as Speaker.", "Wisconsin is among the most gerrymandered states in the country, but have Democrats only flipped a single Republican seat in the last seven years?", "That’s the claim from state Rep. Robyn Vining, a Democrat who accomplished that feat when she beat Republican Matt Adamczyk by 138 votes in 2018. That handed Vining, D-Wauwatosa, the District 14 seat previously held by Republican Dale Kooyenga, who ran for the state Senate that year.", "In an Oct. 25, 2020, episode of WISN-TV’s \"UpFront\" program, Vining said her win was unique during the tenure of Assembly Speaker Robin Vos. The Rochester Republican has headed the chamber since 2013.", "\"I’m the only Democrat to beat the speaker,\" Vining said, discussing her 2020 campaign. \"This is the first time Speaker Vos has lost a seat, and so he wants it back.\"", "A federal court said in 2016 the maps drawn by Wisconsin Republicans in 2011 were among the most heavily skewed to one party of any plan in the country going back more than 40 years, designed to \"secure Republican control of the Assembly under any likely future electoral scenario for the remainder of the decade.\" Calculating gerrymandering is an imprecise business, but two studies have agreed with that court finding, ranking Wisconsin among the most five skewed states in the nation.", "Has the maneuver really been as beneficial to Republicans as Vining claims?", "Republicans control nearly two-thirds of the 99-member Assembly, a level they have held have since the new maps were drawn in 2011.", "Wisconsin Democrats enter the 2020 election hoping to cut into Republicans 63-34 majority, while the GOP is looking to lock in a veto-proof majority.", "RELATED: Attacking Republicans, Democratic state senator says Wisconsin among most gerrymandered states", "Gerrymandering is done by drawing legislative boundaries in such a way that voters in one party are concentrated in a limited number of districts, while voters from the other are spread out just enough to ensure victories. Lawmakers accomplish this by drawing irregularly shaped districts that strategically include and exclude certain groups of voters rather than cordoning off districts based on geography or municipality.", "The result in Wisconsin is Democrats tend to win their districts by a landslide, while Republicans win by narrower margins.", "The 2018 election highlighted this, as Republicans didn’t even bother sending out a candidate in 27 of the 36 Assembly districts Democrats won, Ballotpedia reported. In the general election contests with two candidates, Democratic winners outpolled their Republican counterparts by an average of 37%, while Republican winners won by an average of 20%.", "In another sign of the lack of competitive districts, a whopping 49 Assembly races were uncontested in 2016.", "With that context, let’s focus in on Vining’s claim about seat flipping since 2013.", "There were three elections in that span — every Assembly member is up for election in even-numbered years — and the Republican majority hardly budged. Republicans held 63 seats after the 2014 election, picked up one in the 2016 election, then dropped back to 63 with Vining’s victory in 2018.", "Most Democratic victories in that span came from incumbents. But a review of the Wisconsin Blue Book’s election results for 2014, 2016 and 2018 shows more than a dozen non-incumbent Democrats were elected to the Assembly in that span.", "For all but Vining, however, those lawmakers were filling a seat previously held by another Democrat.", "The closest call came in 2014 in District 51, centered around Dodgeville an hour west of Madison. Republican Todd Novak won the seat by 65 votes that year, and it stayed close in the two elections since, which he won by 723 votes in 2016 and 332 votes in 2018.", "Vining said her victory in 2018 was the first seat to flip from Republican to Democrat since Vos took over the Assembly in 2013.", "Almost every Wisconsin district has been locked one way or another as a result of the maps drawn by Republicans in 2011. Only one district flipped from Democrat to Republican in that span.", "And only one flipped from Republican to Democrat — in line with Vining’s statement.", "We rate this claim True.", "WISN-TV, \"UpFront,\" Oct. 25, 2020", "PolitiFact Wisconsin, Attacking Republicans, Democratic state senator says Wisconsin among most gerrymandered states, March 17, 2017", "Wisconsin Blue Book 2015-16, Elections", "Wisconsin Blue Book 2017-18, Election Results", "Wisconsin Blue Book 2019-20, Elections and Political Parties", "Ballotpedia, Wisconsin State Assembly elections, 2018", "Ballotpedia, Wisconsin State Assembly elections, 2016", "Milwaukee Journal Sentinel, Federal court strikes down GOP-drawn maps, Nov. 21, 2016", "The Washington Post, This is the best explanation of gerrymandering you will ever see, March 1, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]