["“BEWARE People of Zamboanga Del Sur !!! On 2015, volcanologists discovered Mt. Timolan isn't really a mountain (sic)” reads a Facebook post shared more than 1,000 times since it was published on March 2, 2021.", "“This is the biggest and tallest Volcano in Western Mindanao (former name of Zamboanga Peninsula, editor’s note) today ever found which Phivolcs really concerns (sic) about if it becomes active again.”", "The post lists more than a dozen “endangered towns” and warns that an eruption “could destroy towns and villages in a 40km+ range.”", "Phivolcs is the acronym for the Philippine Institute of Volcanology and Seismology, the government agency that monitors potential volcanic hazards across the country.", "Located on the Pacific \"Ring of Fire\", the Philippines sees frequent volcanic activity. The country's most powerful explosion in recent years was the 1991 eruption of Mount Pinatubo, about 100 kilometres northwest of Manila, which killed more than 800 people.", "Mount Timolan in the Philippines’s Zamboanga Del Sur province is in a protected area popular with hikers and campers for its peaks, forests and lakes.", "An identical claim was also shared on Facebook here, here, here and here.", "However, the claim is misleading.", "The Philippine Institute of Volcanology and Seismology said that while Mount Timolan is a volcano, the warnings circulating on social media were baseless.", "Timolan is an inactive volcano and “has no record of historical eruption”, the agency told AFP in an email on March 5, 2021. “Being classified as an inactive volcano, there is no reason to cause an alarm.\"", "A Phivolcs’s list of 24 active volcanoes in the Philippines does not include Mount Timolan.", "The volcanoes on the list had documented eruptions within the last 10,000 years, according to the agency’s website.", "Phivolcs has not issued any hazard advisory related to Timolan as of March 12, 2021.", "Phivolcs added that the peak was not the biggest and tallest volcano in the Zamboanga peninsula, as the misleading posts claim.", "AFP has previously debunked false reports of natural disasters in the Philippines, including baseless warnings of an imminent storm in September 2018 and a doctored weather report falsely forecasting a succession of cyclones in November 2020.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]