["This photo of people waving Palestinian flags was taken at 2018’s Labour party conference.", "This is correct.", "Labour party members voted to debate Palestine rather than Brexit and the NHS at the 2018 Labour Conference.", "This is correct, although Brexit was still debated due to being chosen for debate by Trade Unions. CLP members are usually encouraged to vote for options not chosen by the Unions.", "An image claiming to show Labour party members waving Palestinian flags at the 2018 Labour party conference, with a caption that says members voted to debate Palestine rather than the NHS and Brexit, has been shared hundreds of times on Facebook.", "It is true that members waved Palestinian flags. This happened during a debate on the region at the 2018 Labour party conference.", "It is also true that Labour party members voted to debate Palestine over Brexit and the NHS, although this needs a bit of context. A priorities ballot is held at the start of each Labour conference to determine what eight topics will be debated. Four of these are chosen by trade unions and affiliates, and four are chosen by members; specifically, by the delegates from Constituency Labour Parties (CLPs).", "At the 2018 conference, the CLP delegations voted to debate housing, the schools system, justice for Windrush, and Palestine, with Brexit and NHS in fifth and six places. However, the trade unions’ top four were Brexit, an economy for the many, government contracts, and in-work poverty, with the NHS coming 6th and Palestine 11th.", "There has historically been a large amount of process and direction put into choosing the topics, with certain restrictions in place for which topics can be voted on.", "Unions have historically voted as a block to ensure certain topics get through, and signal what these topics will be, so CLPs and campaign groups tend to advise delegations to vote for four different topics to these. That is to ensure that a range of topics are debated (or sometimes that certain topics aren’t debated to avoid conflict). Although, as shown by the fact that Brexit came fifth in the CLP poll, not every CLP delegation follows the advice to vote for particular topics—they will also be swayed by, for example, decisions taken at local party meetings.", "So members did vote to debate Palestine over the NHS, and because of trade union votes, Brexit was also added to the agenda—but voting among members doesn’t necessarily reflect what topics the CLPs feel are the highest priorities in general, but rather their priorities among topics that are not already likely to be debated.", "This article is part of our work fact checking potentially false pictures, videos and stories on Facebook. You can read more about this—and find out how to report Facebook content—here.\n\n        For the purposes of that scheme, we’ve rated this claim as true\n            as Labour members did wave Palestinian flags, and vote for Palestine to be debated over the Brexit and the NHS.", "Full Fact fights for good, reliable information in the media, online, and in politics.", "Bad information ruins lives. It promotes hate, damages people’s health, and hurts democracy. You deserve better.", "Full Fact, 17 Oval Way, London, SE11 5RR", "Full Fact is a registered charity (no. 1158683) and a non-profit company (no. 06975984) limited by guarantee and registered in England and Wales. © Copyright 2010-2023 Full Fact. Thanks to Bytemark for donating our web hosting.\n                        \n                        Privacy, terms and conditions."]