["About this rating", "On 4 December 2016, the U.S. Army Corps of Engineers denied an easement necessary for Energy Transfer Partners to complete the Dakota Access pipeline, seemingly bringing an end to months of protests over the project. By the next day, widespread rumors asserted that the decision was not as final as it seemed.", "In the above-reproduced examples from e-mail and social media, claims have appeared that DAPL was \"still under active construction,\" and that Energy Transfer Partner had opted to incur a $50,000 daily fine for continuing construction on the pipeline. No specifics accompanied the rumor, such as how the fine might be incurred, or what would happen if DAPL were constructed without the approval to do so. One version of the rumor referenced a statement purportedly issued by ETP on the ACOE's DAPL decision of 4 December 2016:", "Just spoke to Matt who is standing at the front line right now. Easement was denied, however DAPL released a statement saying that they will continue drilling and just pay the $50,000 a day fine. We are not free of this black snake yet, relatives.", "Late on 4 December 2016, ETP did release a statement on the ACOE's denial of the necessary easement:", "Energy Transfer Partners, L.P. (NYSE: ETP) and Sunoco Logistics Partners L.P. (NYSE: SXL) announced that the Administration’s statement today that it would not at this time issue an “easement” to Dakota Access Pipeline is a purely political action – which the Administration concedes when it states it has made a “policy decision” – Washington code for a political decision. This is nothing new from this Administration, since over the last four months the Administration has demonstrated by its action and inaction that it intended to delay a decision in this matter until President Obama is out of office.", "For more than three years now, Dakota Access Pipeline has done nothing but play by the rules. The Army Corps of Engineers agrees, and has said so publicly and in federal court filings. The Corps’ review process and its decisions have been ratified by two federal courts. The Army Corps confirmed this again today when it stated its “policy decision” does “not alter the Army’s position that the Corps’ prior reviews and actions have comported with legal requirements.”", "In spite of consistently stating at every turn that the permit for the crossing of the Missouri River at Lake Oahe granted in July 2016, comported with all legal requirements, including the use of an environmental assessment, rather than an environmental impact statement, the Army Corps now seeks to engage in additional review and analysis of alternative locations for the pipeline.", "The White House’s directive today to the Corps for further delay is just the latest in a series of overt and transparent political actions by an administration which has abandoned the rule of law in favor of currying favor with a narrow and extreme political constituency.", "The statement's final paragraph indicated that ETP was not giving up on DAPL, but in no part of that statement did they say that the company would continue to drill. However, it did say that they plan to finish construction of the pipeline as planned, without providing details:", "As stated all along, ETP and SXL are fully committed to ensuring that this vital project is brought to completion and fully expect to complete construction of the pipeline without any additional rerouting in and around Lake Oahe. Nothing this Administration has done today changes that in any way.", "It is possible that the company's statement alongside a clearly speculative response shared (but not written) by prominent protester Dallas Goldtooth prompted the rumor:", "WILL THIS ACTUALLY STOP CONSTRUCTION? Debatable. It would be illegal for Energy Transfer Partners to drill under the Missouri, but that's not to say they won't do it and opt to pay whatever legal penalties they incur. That would be a fairly shocking move on their part but they've hinted they may be open to doing it. It's easy to imagine that an incoming Trump administration would do their best to make the penalties as minimal as possible.", "The earliest versions of the rumor that DAPL construction would continue unabated despite the Army Corps of Engineers' decision referenced the statement from ETP. Although the company said it is \"fully committed to ensuring that this vital project is brought to completion\" and that it expects to complete construction of the pipeline \"without any additional rerouting in and around Lake Oahe,\" it did not indicate any plans were in place to move ahead in violation of the referenced \"policy decision.\" The statement also did not indicate that the company intended to incur a $50,000 daily fine and continue DAPL construction without the easement. That aspect of the claim mirrored age-old urban legends involving a wealthy entity opting to pay fines to the detriment of public health, a rumor that dates back to at least 2005 and (falsely) attributes similar behavior to Coca-Cola.", "BusinessWire.   \"Energy Transfer Partners And Sunoco Logistics Partners Respond To The Statement From The Department Of The Army.\"\r\n    4 December 2016.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]