["An election worker looks at a ballot during a Cobb County hand recount of presidential votes at the Miller Park Event Center in Marietta, Ga. (John Amis for the Atlanta Journal-Constitution, via AP)", "Mail-in ballots are processed in two steps: First they are verified through signature matching, then the votes on the ballot are counted.", "After verification, ballots and the signed envelopes they came in are separated to protect the privacy of the vote.", "A recount can only be a count of the votes.", "In his effort to challenge votes in states he lost, President Donald Trump focused on the hand recount of over 5 million ballots in Georgia.", "\"The Fake recount going on in Georgia means nothing because they are not allowing signatures to be looked at and verified,\" a fundraising email from Trump said. \"Georgia’s secretary of state won’t let the people checking the ballots see the signatures for fraud. Why? Without this, the whole process is very unfair and close to meaningless.\"", "Trump has cast doubt on the validity of mail-in ballots for months. In Georgia, he is asserting that not only should the count of votes be checked, but the authenticity of each mail-in ballot, too.", "This overlooks a core principle of American democracy: How you voted is your business, and no one else’s.", "For voting in person, the voting booth guarantees your privacy. For mail-in ballots, the process is different. Each mail-in ballot comes in a sleeve or envelope that the voter must sign. Election workers then match the signature to their voter records.", "\"They review the signature, and if it complies with the law, the ballot is separated from the envelope to maintain secrecy,\" said David Becker, head of the private Center for Election Innovation and Research. \"There is no way to go back and review signatures after they’ve been separated from the ballots, and there’d be no reason to do so.\"", "Every state follows the same basic steps, Becker said. Once the ballot is verified, it becomes an anonymous vote just like a vote cast in person.", "Signature verification is critical for ensuring that only valid ballots are counted, and Georgia’s Republican secretary of state, Brad Raffensperger, explained that his office doubled down on the steps to maximize accuracy.", "\"We strengthened signature match,\" Raffensperger wrote on Facebook. \"We helped train election officials on Georgia Bureau of Investigation signature match — which is confirmed twice before a ballot is ever cast.\"", "There was a disagreement this year in Georgia over the steps election officials should take when a ballot arrives well before Election Day and there’s time to get back to the voter to fix an issue with their signature. A March 6 settlement agreement spelled out a process acceptable to both parties and the state.", "Becker noted that Trump and his team raised their objections to the procedures late in the game, including a Nov. 16 tweet from Trump. Becker said none of this could be a surprise to them.", "\"The Trump campaign and its allies knew the rules of the election well in advance of the election, and those rules had been set by a legislature and a governor friendly to the campaign, and were enforced by a secretary of state of the president’s own party,\" Becker said. \"It’s only after they lost the election that they’ve raised any concerns, and they still have found no evidence of any issues with the ballots.", "The Trump campaign did not respond to a request for comment.", "Trump said Georgia’s secretary of state won’t allow people recounting ballots to check the signatures for fraud.", "This reflects a flawed understanding of how mail-in votes work. Before a mailed ballot is counted, the voter’s signature has already been verified. In Georgia, it is verified twice.", "To protect the privacy of the vote, after verification, every state separates the ballot from the signed envelope it came in. By design, there is no way to reunite the two pieces of paper.", "A recount can only be a recount of ballots, and Trump and his campaign knew that months ago.", "We rate this claim Pants on Fire!", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more.", "CORRECTION, April 26, 2022: A March 6, 2020, settlement agreement spelled out the process by which Georgia election officials would notify voters of an issue with their signature on a mail-in ballot. An earlier version of this post inaccurately described the document as a \"consent decree.\" This fact-check has been updated for accuracy. The rating is unchanged.", "Donald Trump, Fundraising email, Nov. 17, 2020", "Georgia Secretary of State, Facebook post, Nov. 15, 2020", "Donald Trump, tweet, Nov. 16, 2020", "New York Times, No, the Georgia recount does not include reverifying signatures., Nov. 17, 2020", "Forbes, Trump Repeats Inaccurate Claims About Georgia’s ‘Fake’ Recount, Feb. 16, 2020", "Justicia, Article 10 - ABSENTEE VOTING, accessed Nov. 17, 2020", "Stephen Fowler, tweet, Nov. 14, 2020", "Boston Globe, Fact check: Trump wrong on Georgia voter signature checks, Nov. 15, 2020", "Court Listener, Democratic Party of Georgia, Inc. v. Raffensperger (1:19-cv-05028), Compromise Settlement Agreement and Release, March, 6, 2020", "AP, Trump wrong on Georgia voter signature checks,Nov. 15, 2020", "Email exchange, David Becker, executive director and founder, Center for Election Innovation and Research, Nov. 17, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]