["The image was published in this Facebook post on September 18, 2019. It received more than 320 comments and 1,000 reactions before it was removed.", "It shows Jokowi sitting on the floor of a house with food laid out in front of him.", "Below is a screenshot of the misleading Facebook post:", "The post’s Indonesian-language caption translates to English as: “When the flood of smoke hits, the governor and deputy governor are traveling abroad, But then who is this person? The location is a resident’s house in Riau near the forest that caught fire.\"", "The Riau province fires have sent toxic, choking haze to parts of Southeast Asia for weeks. Jokowi visited an area hard hit by forest fires in Riau province on September 17, 2019, according to this AFP report.", "The same image was also published here, here and here on Facebook with an identical claim.", "The claim is false; the image has been doctored from a photo taken of Jokowi when he visited the Raja Ampat islands in northeastern Indonesia to celebrate the New Year in 2016.", "Keyword searches on Google found the photo published by the president here, on his official Twitter account, on January 1, 2016.", "Fajar perdana 2016 di dermaga Waiwo, Raja Ampat, tempat terbaik di dunia untuk snorkeling -Jkw pic.twitter.com/mLV22FA9R9", "The post's Indonesian-language caption translates to English as: “My first sunrise in 2016 on the pier of Waiwo, Raja Ampat, the best place in the world for snorkeling -Jkw.”", "Raja Ampat islands is a tourist destination in the eastern Indonesian province of West Papua.", "“Jkw” is the initials of the president’s popular nickname, Jokowi.", "In the doctored photo, the background of the original image has been replaced by the inside of a building and the photo of Jokowi has been slightly tilted.", "Below is a screenshot comparing the misleading Facebook photo (L) and the photo from the Indonesian president’s Twitter account (R):", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]