["By Angelo Fichera", "Posted on May 21, 2019", "Viral social media posts attribute a quotation about how “to anger” a conservative and a liberal to President Theodore Roosevelt. But there’s no evidence he ever said it.", "A popular meme revived on social media puts words in the mouth of President Theodore Roosevelt.", "“To anger a conservative, lie to him,” the quotation reads. “To anger a liberal, tell him the truth.”", "That supposed quotation has circulated online for years — and others have tried to pass it off as the words of the late United Kingdom Prime Minister Winston Churchill or conservative commentator Rush Limbaugh.", "The attribution to Roosevelt was promoted recently by the prominent young conservatives group Turning Point USA in the form of a Facebook meme with a caption that, ironically, reads: “SO MUCH TRUTH! #BigGovSucks.”", "The group, known for supporting President Donald Trump, has more than 1 million followers on its verified Facebook page.", "But there is no evidence the 26th president ever made that remark, and experts on Roosevelt cast doubt on its veracity.", "Sharon Kilzer, project manager for the Theodore Roosevelt Center at Dickinson State University, told us in an email that the center is “continually challenged by sayings attributed to [Roosevelt], for which we may or may not be able to identify a source.”", "Kilzer said it’s difficult to “definitively” say that Roosevelt “did not say something,” but she said the quotation “is one we have not encountered in Theodore Roosevelt’s speeches and writings.”", "“I question its validity, as the terms ‘liberal’ and ‘conservative’ were not used to describe opposing political views in early 20th century America,” she explained. “The term ‘progressive’ was used more readily than ‘liberal,’ and ‘conservative’ did not mean what it does today. I don’t believe Theodore Roosevelt would have used this rhetorical juxtaposition.”", "Roosevelt was a Republican who rose from vice president to the presidency in 1901 following the assassination of President William McKinley. He was reelected in 1904.", "But some of his policies — including his focus on income inequality, government regulation and conservationism — align with the agenda of today’s Democratic party.", "In 1912, Roosevelt again sought the presidency, challenging the Republican incumbent, President William Howard Taft, because he believed Taft was not progressive enough. Republicans renominated Taft, but then Roosevelt ran in the general election under a newly formed Progressive Party, or the “Bull Moose Party.” Democrat Woodrow Wilson ultimately won that election.", "Sidney Milkis — a professor in the Department of Politics at the University of Virginia, who co-authored the book Theodore Roosevelt, the Progressive Party, and the Transformation of American Democracy — also questioned the idea that Roosevelt said the quotation in question.", "“I have never seen this, and doubt very much it is authentic,” Milkis said in an email. Roosevelt “called reformers Progressives, and ran [as] a third party candidate on the Progressive Party ticket. Not until the New Deal was the dimension of conflict between liberals and conservatives.”", "(The New Deal — under President Franklin D. Roosevelt in the 1930s — was a series of government projects, programs and reforms in response to the Great Depression.)", "It’s not just social media posts that have wrongly attributed the quotation to Roosevelt.", "It appeared, for example, in a December 2016 opinion piece about the 2016 election in the literary magazine the New Criterion. The relevant section mentioning Roosevelt was in turn republished by the Wall Street Journal and cited in a reader’s submission to the Morning Call in Pennsylvania.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "“Election of 1912.” 7 Elections that Changed U.S. History. Duke University Libraries. 17 Oct 2008.", "Hobson, Jeremy. “Teddy Roosevelt’s Complicated Legacy 100 Years After His Death.” WBUR. 21 Mar 2019.", "Kilzer, Sharon. Project manager, Theodore Roosevelt Center at Dickinson State University. Email to FactCheck.org. 17 May 2019.", "“Left’s reaction to Trump ‘alarming.’” The Morning Call. 5 Dec 2016.", "Milkis, Sidney. Professor, University of Virginia. Email to FactCheck.org. 17 May 2019.", "“Notable & Quotable: Trumped-Up Outrage.” Wall Street Journal. 2 Dec 2016.", "“Theodore Roosevelt Biography in Brief.” Theodore Roosevelt Center, Dickinson State University. Accessed 17 May 2019.", "“Trumped-up, trickle-down outrage.” The New Criterion. December 2016.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]