["Democratic presidential candidate Sen. Cory Booker, D-N.J., speaks in SEIU Unions For All Summit on Oct. 4, 2019, in Los Angeles. (AP)", "An old video from a Republican political operative alleging that Cory Booker laundered money as mayor of Newark, N.J., has resurfaced on Twitter.", "The video, which was originally published on Facebook in September 2018, shows Roger Stone talking to the camera about Booker, a Democratic U.S. senator from New Jersey and a candidate for president.", "Stone is a veteran political consultant for Republicans and worked on Donald Trump’s campaign in 2015. Stone was charged with witness tampering, obstruction of justice and lying to Congress during former special prosecutor Rober Mueller’s investigation of Russian meddling in the 2016 election. He is banned from social media pending a federal trial.", "\"As the mayor of Newark, Sen. Cory Booker took $600,000 from a city water authority and put it in his pocket. He told four different stories about it,\" Stone said in the video. \"If Cory were a white Republican, he’d be in prison right now.\"", "(Screenshot from Facebook)", "A tweet from Red Nation Rising copied the video and its caption and published it Oct. 6. It’s been retweeted more than 7,000 times, so we wanted to check it out.", "We reached out to Stone for the evidence he used to make his claim against Booker. We’ll update this story if we hear back.", "The source of Stone’s claim about Booker can be traced back to a corruption scandal involving the Newark Watershed Conservation and Development Corp. But there is no evidence that Booker, who was Newark mayor from 2006 until 2013, contributed to the bribery scheme.", "In 2014, a year after Booker left his post as mayor, a state controller report found \"an egregious and yet preventable abuse of public funds\" at the watershed. The city of Newark delegated water management to the agency through service contracts valued at roughly $10 million annually, but the report said the agency operated \"free from any meaningful oversight.\"", "The controller found that watershed Executive Director Linda Watkins-Brashear had authorized \"risky investment activity in an account that lost more than $500,000 in public funds.\" The agency dissolved in 2013 shortly after the controller first discovered the abuse of funds.", "Watkins-Brashear was later sentenced to more than eight years in federal prison for handing out $1 million worth of contracts to her friends and ex-husband. At least eight other individuals connected to the scheme were also indicted — but not before the watershed’s board of trustees sued Booker, Rep. Donald Payne Jr., D-N.J., and two dozen others for their alleged roles in the waste of taxpayer money.", "RELATED: Recent statements by and about Cory Booker", "The lawsuit claimed the actions of the defendants, including alleged misappropriation and waste of corporate assets, had led to the agency’s dissolution. Booker’s attorneys said at the time that the suit mischaracterized his role with the watershed.", "NJ.com reported that Booker served as an ex-officio chairman of the watershed’s Board of Trustees (a position he held by virtue of being mayor), but he never attended a meeting. The lawsuit alleged that Booker’s lack of oversight led to the agency’s mismanagement.", "A federal judge disagreed and, in June 2016, Booker’s name was dropped from the lawsuit. The judge ruled that Booker was immune from liability since his chairmanship was a function of his mayorship.", "\"Because there is no dispute that Booker was acting as a public employee in serving on the Board, and no argument that his actions (or inactions) as a member of the Board were other than discretionary and/or legislative in nature and required the exercise of his judgment, the Court finds that Booker is immune under N.J.S.A. § 59:3-2(a) and (b),\" Vincent Papala, a U.S. bankruptcy judge, wrote in the opinion.", "It appears that Stone took two stories about Booker’s old law firm and used them to spin a conspiracy about his involvement in the water scandal.", "The first story was published by the New York Post in 2013. It reported that Booker’s federal tax returns showed he collected $689,500 in payments from Trenk DiPasquale, the senator’s former law firm, between 2007 and 2012 — while he was mayor of Newark.", "Booker had previously said he stopped working for the firm in 2006, soon after he became mayor. Booker’s spokespeople told the New York Post at the time that the money wasn’t a salary, but part of a \"separation agreement\" with the firm. The Daily Beast reported the agreement was paid out for work Booker did for the firm before he became mayor.", "From 2010 to 2012, Booker reported on his tax returns that he \"materially participate[d] in the operation of this business.\" A Booker spokesman told the New York Post it was an error made by a tax preparer.", "The second story, published by Politico in January 2017, reported that Elnardo Webster, one of Booker’s longtime advisers, was the general counsel for the watershed while he worked at Trenk (and while Booker was mayor). However, neither he nor Booker have been charged with wrongdoing related to the bribery scandal.", "The Post reported that, as of 2013, Trenk had made $212,318 from the watershed. That’s one-third of the $600,000 Stone alleged. According to a review of existing media reports and court records, there is no evidence of a money laundering scheme involving the two entities.", "Booker’s presidential campaign did not respond to a request for comment.", "In a 2018 video, Roger Stone claimed Cory Booker \"stole $600,000 from a city water authority and laundered it through his law firm.\" The video has recently resurfaced on Twitter.", "That claim is related to a decade-long corruption scandal involving the Newark Watershed Conservation and Development Corp., which Booker oversaw as mayor and ex-officio chairman. At least nine people have been indicted or sentenced in connection with the bribery scheme. But there is no evidence, based on court records and other existing reporting, that the former mayor contributed to the scheme.", "As to Stone’s specific claim, there is no public paper trail connecting Booker being paid by a former law firm, and that firm being paid from the watershed. Stone is using two independent facts to create a conspiracy. We rate his claim False.", "CNBC, \"Roger Stone avoids jail, banned from major social media after judge rules Trump friend breached gag order in Mueller case,\" July 16, 2019", "The Daily Beast, \"The Ugly Truth About Cory Booker, New Jersey’s Golden Boy,\" April 14, 2017", "Facebook video from Roger Stone - Stone Cold Truth, Sept. 28, 2018", "New York Post, \"Booker made $689K from ex-law firm while mayor,\" Sept. 7, 2013", "NJ.com, \"Booker says he shouldn't be held responsible for Newark water agency corruption,\" Dec. 3, 2015", "NJ.com, \"Ex-Newark watershed director sentenced to 8 years for kickback scheme,\" Sept. 22, 2017", "NJ.com, \"Now everybody is talking about Cory Booker’s time as mayor of Newark. But how did he do?\" Feb. 5, 2019", "Politico, \"Booker dropped from Newark Watershed Conservation and Development Corporation suit,\" June 21, 2016", "Politico, \"Two years later, Newark's water still haunting Booker,\" Nov. 12, 2015", "Report from the New Jersey Office of the State Controller, Feb. 19, 2014", "Tweet from Red Nation Rising, Oct. 6, 2019", "U.S. Bankruptcy Court opinion, June 21, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]