["Soon after the news about Pulwama terror attack broke out, political parties issued statements strongly condemning the attack on CRPF convoy which led to the martyrdom of 44 CRPF personnel. Sameed Kakroo, Jammu Bureau chief of Greater Kashmir tweeted a screenshot of one such press release statement issued by J&K BJP.", "While the entire nations mourns the martyrdom of #CRPF soldiers in Awantipora, the former deputy CM @KavinderGupta from @BJP4JnK condoles “death of CRPF soldiers in a police post of Shopian”. Wow. Incompetency at its peak. @OmarAbdullah @MehboobaMufti @INCIndia @jkpdp pic.twitter.com/pr3IumU77t", "— Sameed Kakroo (@sameedkakroo) February 14, 2019", "The press release received by the editor at 6:21 pm on February 14, 2019 stated, “I strongly condemn the attack on the police post in Shopian and condole the deaths of 12 CRP personnel in the duty.”  Kakroo pointed out BJP’s faux pas, “While the entire nations mourns the martyrdom of #CRPF soldiers in Awantipora, the former deputy CM @KavinderGupta from @BJP4JnK condoles “death of CRPF soldiers in a police post of Shopian”. Wow. Incompetency at its peak”. It may be emphasised here that no media reports had emerged about such an incident in Shopian district up until this point.", "At 9:34 pm on February 14, Times Now broadcast ‘breaking news’ on The Newshour Debate about a terrorist attack on a police station located in Shopian district, Jammu and Kashmir. “As we are talking, if you set aside your politics, then, I want to inform you that terrorists have attacked a police station in Shopian. That’s the latest coming in from there. What do we see in our studio, we see once again warring politicians. Sohail joins me on the phone-line.”, said Times Now anchor Navika Kumar at 34:00 mins in the video posted below.", "The reporter on the phone-line said, “We have talked about this incident, this has happened in Keegam area of Shopian where a grenade was lobbed on the police station followed by firing. But the police personnel who were deployed at the police station retaliated back and the area is under cordon. Meanwhile, the security forces have also launched coordinated search operations in 15 villages of Pulwama and this is being seen in the backdrop of the attack that took place today on the National Highway 44 in Awantipora area of Kashmir valley.”", "A senior police official of the Shopian district called out the “fake news” propagated by Times Now. “Kindly avoid whatsapp driven fake news cycle @TimesNow like the attack on Keegam PP in Shopian. No such attack took place. @JmuKmrPolice @KashmirPolice”,tweeted the Senior Superintendent of Police Sandeep Chaudhary.", "Kindly avoid whatsapp driven fake news cycle @TimesNow like the attack on Keegam PP in Shopian. No such attack took place. @JmuKmrPolice @KashmirPolice pic.twitter.com/L1yGP7V3wI", "— Sandeep Chaudhary IPS (@Sandeep_IPS_JKP) February 14, 2019", "In a reply to Chaudhary, Times Now clarified with a tweet saying that the news report was unverified and the error is regretted. However, it may be noted that the broadcast video with the misinformation has not been deleted yet.", "CORRIGENDUM: This is with regard to an unverified news report of an attack on a police station in Shopian Thursday night. The error is regretted. @TimesNow", "— TIMES NOW (@TimesNow) February 15, 2019", "Earlier, the channel had issued a clarification on Twitter without referring to their misreport.", "CLARIFICATION | Official sources deny attack on police station in Shopian, J&K pic.twitter.com/rPYKVelTfo", "— TIMES NOW (@TimesNow) February 14, 2019", "News Nation too reported, “Amid growing rage over Pulwama blast, there are reports of another terror attack in Jammu and Kashmir’s Shopian district.”", "It may be noted that News Nation has not issued a clarification yet.", "Amid growing rage over #PulwamaBlast, there are reports of another terror attack in #JammuAndKashmir‘s #shopian district#CRPFattack #CRPFConvoy #CRPFJawans #PulawamaTerrorAttack #KashmirTerrorAttack https://t.co/o5XdrMj4vg", "— News Nation (@NewsNationTV) February 14, 2019", "At 9:49 pm, ABP News also reported that militants had attacked the ‘Keegam police station.’", "Militants fire at Keegam police station in South Kashmir’s Shopian. Alert cops retaliate, area put under cordon.https://t.co/DklVA2kRqn", "— ABP News (@abpnewstv) February 14, 2019", "Media outlets put out the news story without due diligence. As it turned out, the news report about a terrorist attack on a police station in Shopian district was called out by Jammu and Kashmir police. While Times Now has issued a clarification, News Nation and ABP are yet to acknowledge their error.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]