["By Saranac Hale Spencer and Angelo Fichera", "Posted on February 5, 2021", "A two-hour video, claiming to prove that the 2020 presidential election was “stolen” from former President Donald Trump, has been viewed tens of thousands of times online and aired on the cable channel One America News Network. But the video rehashes baseless conspiracy theories and debunked claims.", "Three months after Election Day and two weeks after President Joe Biden took office, a video rehashing debunked claims of fraud played repeatedly on the conservative cable station One America News Network.", "Mike Lindell — an avid supporter of former President Donald Trump and CEO of MyPillow, Inc. — created and presented the video, which reportedly aired with a disclaimer saying that it expressed his “opinion” and that he had purchased the airtime starting Feb. 5 and extending through the weekend.", "It was viewed tens of thousands of times on social media, including YouTube and Facebook.", "The video is titled: “Absolute Proof.” But Lindell’s assertion that the election was “stolen” from Trump has no factual basis and many of the claims he relies on in the roughly two-hour video have already been debunked.", "Biden won both the Electoral College and the popular vote in an election federal, state and local election officials called “the most secure in American history.” Then-Attorney General William Barr said there were no signs of fraud on a scale that would have changed the results. A group of 59 election-security experts and computer scientists signed a letter explaining that widespread claims of fraud “either have been unsubstantiated or are technically incoherent.” Dozens of current and former Republican officials or party brass have publicly rejected the claims. And federal, state, and local courts that have been presented with allegations of fraud have dismissed the suits.", "Despite that, the falsehoods persist.", "Early in the video, Lindell rattles off a long list of instances of alleged fraud, many of which aren’t new.", "For example, he claims that there were “10,315” cases of dead people voting in Georgia. But Brad Raffensperger, Georgia’s secretary of state, told Congress in a Jan. 6 letter that that allegation “is not supported by any evidence” and that officials had identified only two potential cases, which were both under investigation at the time.", "Lindell also refers to “100,000” ballots in Wisconsin being backdated by the U.S. Postal Service. But even if that claim were true, and there is no evidence that it is, it wouldn’t have affected election results since all ballots had to be received by Election Day in order to be counted, as USA Today previously explained.", "A central focus appears to be what he deems “absolute proof of the biggest cyberattack in history.” But the claim is really just a warmed-over version of a conspiracy theory about a secret supercomputer that we’ve already addressed.", "The theory appeared several days before the election on a dubious blog called the American Report, which claimed that Biden was using a supercomputer called “Hammer” and a software program called “Scorecard” to “Steal Another Presidential Election.”", "The premise of the theory is that “Hammer” and “Scorecard” can be used to access electronic voting systems and switch or change votes.", "It was elevated to national attention when Sidney Powell, a lawyer who joined Trump’s legal team after the election, promoted it on Fox News.", "But the bogus theory was directly disputed by federal and state officials, as well as experts who study election security, as we explained at the time.", "The U.S. Cybersecurity and Infrastructure Security Agency flatly rejected the claim. The agency’s director, Chris Krebs — who was appointed by Trump — called the theory “nonsense” and a “hoax.”", "CISA has said that safeguards — including auditable logs and software checks — used by states ensure accuracy in the vote totals.", "Still, Lindell invited Mary Fanning, one of the authors of the original American Report post, to present an updated version of the theory on his video.", "“This is a documentation, the proof positive” that foreign governments manipulated the results of the election, she said, while showing a map of the world with lines connecting China, Iran and other countries to the U.S.", "Fanning called it “an act of war to come in and steal the election from the American people.”", "She had cited the same map in a Jan. 3 blog post claiming that the originator of the conspiracy theory had “revealed that there is not just one HAMMER in the United States, but now, also a second HAMMER in the United Kingdom, and also, a third HAMMER in China.”", "The theory isn’t any more convincing with three supercomputers than it was with one.", "Much of the video also regurgitates claims about Antrim County, Michigan, that stem from an error in the initial, unofficial election results — which wrongly showed Biden leading Trump in the reliably Republican county. The results were corrected by Nov. 6 and state and local officials have repeatedly explained the mistake as a human error.", "Lindell highlights a report that disagreed with that explanation and claimed that Dominion Voting Systems software was designed with errors “to create systemic fraud and influence election results.”", "We wrote about that report in December, when an audit that involved a hand tally of the underlying paper ballots disproved the conspiracy theory. The audit showed a gain of 11 votes for Trump and a loss of one vote for Biden; small variances are expected in a machine versus hand count.", "The flawed report was prepared by Allied Security Operations Group, an outfit founded by Russell Ramsland Jr. — a Republican who unsuccessfully ran for Congress in Texas in 2016 and who has claimed that a “deep state” was undermining Trump. Ramsland appears in the video.", "Experts told us that among the report’s flaws was a calculation of a purported “error rate” of 68.05%, which is referenced in the new video, that actually included entries on a log that weren’t “errors” but standard, expected responses as the tabulators process the paper ballots.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "Balsamo, Michael. “Disputing Trump, Barr says no widespread election fraud.” Associated Press. 1 Dec 2020.", "Adams, Tony, et al. “Scientists say no credible evidence of computer fraud in the 2020 election outcome, but policymakers must work with experts to improve confidence.” 16 Nov 2020.", "“It’s Official: The Election Was Secure.” Brennan Center for Justice. 11 Dec 2020.", "Fichera, Angelo and Saranac Hale Spencer. “Bogus Theory Claims Supercomputer Switched Votes in Election.” FactCheck.org. 13 Nov 2020.", "Egan, Paul. “Antrim vote glitch: Expert shares how county mistakenly flipped from red to blue.” Detroit Free Press. 6 Nov 2020.", "Fichera, Angelo. “Audit in Michigan County Refutes Dominion Conspiracy Theory.” FactCheck.org. 18 Dec 2020.", "“Hand audit of all Presidential Election votes in Antrim County confirms previously certified results, voting machines were accurate.” Michigan Department of State. 17 Dec 2020.", "Hand Count Calculation Sheet | Antrim County. Michigan Department of State. 18 Dec 2020.", "Litke, Eric. “Fact check: Alleged ‘backdated’ ballots wouldn’t have been counted even if USPS claim true.” USA Today. 5 Dec 2020.", "Raffensperger, Brad. Letter to Congress. 6 Jan 2021.", "“Joint Statement From Elections Infrastructure Government Coordinating Council & The Election Infrastructure Sector Coordinating Executive Committees.” U.S. Cybersecurity and Infrastructure Security Agency. 12 Nov 2020.", "Krebs, Chris (@CISAKrebs). “Same as yesterday, Hammer and Scorecard is still a hoax. Thats it. That’s the tweet.” Twitter. 8 Nov 2020.", "Krebs, Chris (@CISAKrebs). “To be crystal clear on Downwards arrow, I’m specifically referring to the Hammer and Scorecard nonsense. It’s just that – nonsense. This is not a real thing, don’t fall for it and think 2x before you share. #Protect2020” Twitter. 7 Nov 2020.", "“Rumor Control.” U.S. Cybersecurity and Infrastructure Security Agency. Accessed 5 Feb 2021.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]