["About this rating", "During the summer of 2019, remarks by Facebook CEO Mark Zuckerberg prompted a wave of reports, mainly by right-leaning and pro-life websites, that the social network founder had \"admitted\" to having banned pro-life advertising in the lead-up to Ireland's May 2018 referendum on abortion, and even that he had \"bragged\" and \"boasted\" about it.", "The conservative PJ Media website published an article with the headline \"Mark Zuckerberg Brags: We Didn't Allow Pro-Life Groups to Advertise Before Ireland's Abortion Vote.\" That article cited a tweet posted by pro-life activist Lila Rose, who wrote that Zuckerberg had \"blocked pro-life ads ahead of Ireland's abortion vote\":", "FB CEO @MarkZuckerburg blocked pro-life ads ahead of Ireland's abortion vote", "FB COO @sherylsandberg donated $2M to Planned Parenthood", "Twitter CEO @Jack banned my & @LiveAction’s pro-life ads, allows @PPFA ads, & says legal protections for preborn babies are “bad for business” pic.twitter.com/ZkrLoY9H2b", "— Lila Rose (@LilaGraceRose) July 8, 2019", "The pro-life website Life Site News similarly published an article with the headline \"Facebook Intentionally Blocked Pro-Life Ads During Irish Abortion Vote, CEO Admits.\" The conservative website The Blaze, founded by former Fox News presenter Glenn Beck, also claimed that Zuckerberg had \"bragged\" that his company \"blocked pro-life ads ahead of Ireland's vote,\" reporting that: \"Facebook CEO Mark Zuckerberg boasted last month about his company's decision not to allow pro-life ads from American groups to run in Ireland ahead of the country's referendum vote on abortion last year.\"", "Irish Central, an Irish diaspora news website based in New York, reported that:", "\"Facebook deliberately banned pro-life advertisements from the US during the Irish abortion referendum after the Irish government told them they had no laws on the books either way to cover such foreign advertising. Facebook CEO Mark Zuckerberg has admitted his company deliberately blocked pro-life ads from American groups seeking to influence the recent abortion referendum in Ireland.\"", "Each of these reports significantly distorted and misrepresented what actually happened, by leaving out two crucial facts. Firstly, that Facebook banned all advertising — both pro-life and pro-choice — that originated from outside Ireland and had to do with the country's contentious abortion referendum in May 2018. Secondly, that Facebook continued to host both pro-life and pro-choice advertisements in the lead-up to the referendum, provided they originated within Ireland.", "None of the articles cited above made any mention of these crucial facts, thereby creating the false impression that Facebook had exclusively targeted pro-life advertising on its platform. Facebook did not do that.", "However, the wording of Zuckerberg's remarks in June 2019 could reasonably create the impression that the catalyst for Facebook's blanket ban on foreign, abortion-related advertising may have been an influx of pro-life ads, many of them created by U.S. actors, on the Facebook feeds of Irish users, in the early days of the referendum campaign.", "On May 25, 2018, the Irish electorate voted in favor of repealing the Eighth Amendment to the Irish constitution, by a margin of 66.4 percent to 33.6 percent. (Under Ireland's constitution, any constitutional changes must be ratified by referendum).", "After the repeal of the Eighth Amendment, Ireland's parliament was free to pass its own laws on the availability of abortion services, which it duly did in December 2018, legalizing abortion up to 12 weeks, and after that point in cases where a risk exists to the life of a woman, or a serious risk to her health.", "The Eighth Amendment had been passed in 1983, enshrining in Ireland's constitution the \"equal right to life\" of \"the unborn\" and \"the mother,\" and giving constitutional backing to Ireland's existing and long-standing ban on abortion. However, the inherent tension in the law between the rights to life of the unborn child and its mother created ambiguity and uncertainty in how it should be interpreted, especially in cases where a pregnancy posed a threat to a woman's life.", "In 1992, Ireland's Supreme Court ruled that a threat to the life of a mother, including the risk of suicide, was a legitimate ground for abortion. However, Irish lawmakers did not implement that ruling in legislation until 2013.", "After five years of activism and debate, and following lengthy consultations involving a parliamentary committee and a \"citizen's assembly,\" in March 2018 the Irish government set the date for a vote to repeal the Eighth Amendment, formally launching the referendum campaign.", "Irish election and referendum campaigns are very short in comparison with campaigns in the United States (the second phase of Ireland's 2018 presidential election lasted only 30 days, for example). As a result, the period between late March and late May 2018 saw a flurry of intense campaigning and debating on both sides of the abortion-referendum campaign, including targeted social media activism and paid advertising on Facebook and Google (including YouTube).", "Unlike in the U.S. and other countries, political advertising is banned on radio and television in Ireland, and broadcast media are also governed by strict regulations around fairness and balance in hosting political debates, especially once a campaign has been formally opened.", "Social media, by contrast, is not governed by any law when it comes to political content, and that gap in Irish regulations prompted concerns about a lack of transparency about the identity, affiliations and funding of those who created various referendum-themed social media pages, posts and paid advertisements. In particular, the role of foreign actors became a cause for concern among some transparency activists and political commentators in the lead-up to the May 25 vote.", "As part of that push for enhanced transparency, on April 25 Facebook expanded its \"View Ads\" feature (which had been tested in Canada) to Ireland, meaning only authorized advertisers could purchase political and \"issue\" advertisements. (In order to become authorized to publish political advertisements, individuals must verify their identities and location with Facebook).", "The expansion of the \"View Ads\" feature also meant Irish Facebook users who were targeted with an advertisement on a particular page could also see a list of all the other advertisements published by that page, in principle creating further context and transparency around political advertising.", "On May 8, Facebook went further, announcing it had decided not to accept any further advertisements relating to the Eighth Amendment referendum campaign, if those advertisements were being sought by actors based outside Ireland. In a news release, the company wrote:", "\"Facebook will no longer be accepting ads related to the forthcoming referendum if they are from advertisers based outside of Ireland. Concerns have been raised about organisations and individuals based outside of Ireland trying to influence the outcome of the referendum on the Eighth Amendment to the Constitution of Ireland by buying ads on Facebook. This is an issue we have been thinking about for some time. Today, as part of our efforts to help protect the integrity of elections and referendums from undue influence, we will begin rejecting ads related to the referendum if they are being run by advertisers based outside of Ireland.\"", "The announcement made no reference to the viewpoint of those \"individuals based outside of Ireland,\" meaning the claim that Facebook targeted or banned pro-life advertisements, in particular, was false. Facebook also continued to allow referendum-related advertisements from authorized advertisers, regardless of their viewpoint on the issue of abortion, but provided Facebook determined they were based inside Ireland.", "The Transparent Referendum Initiative, a crowdsourcing project overseen by volunteer transparency advocates and technology experts, collated a database of referendum-related advertisements that appeared on the Facebook feeds of Irish users during the campaign.", "That database contains multiple examples of pro-life paid advertisements being posted to Facebook after the company announced its crackdown on foreign advertising purchases on May 8. This further disproves any claim that Zuckerberg had either admitted, bragged or boasted that Facebook \"didn't allow pro-life groups to advertise\" before the referendum. Facebook did allow that, but simply barred actors based outside Ireland — whether pro-life or pro-choice — from doing the same, after May 8.", "For its part, Google went a step further than Facebook on May 9, banning any and all referendum-related advertising from YouTube and Google AdWords.", "On June 26, 2019, Zuckerberg appeared at the Aspen Ideas Festival in Colorado and made remarks about how Facebook operates in countries where certain regulations are lacking, particularly around political advertising. The company's CEO encouraged national governments to pass their own laws regulating political content and advertising, rather than relying on large technology companies such as Facebook to intervene in the interests of transparency. He offered the Eighth Amendment referendum campaign in Ireland as an example:", "There are other types of laws around the world that I think would be positive as well. For example, we had an issue — this is not an American example — but we had an issue in Ireland. In the last year there was a referendum on abortion, and during that election [sic], leading up to that referendum, a bunch of pro-life American groups advertised, leading up to this Irish election [sic], to try to influence public opinion there.", "And we went to the Irish and asked folks there, 'Well, how do you want us to handle this? You have no laws on the books that are relevant for whether we should be allowing this kind of speech in your election, and really this doesn't feel like the kind of thing that a private company should be making a decision on.' And their response at the time was, 'We don't currently have a law, so you need to make whatever decision you want to make.'", "We ended up not allowing the ads, but at the end of the day, that feels like the kind of thing, around the world in different democracies, that you'd really want the local countries to be deciding for themselves — what kind of discourse they want and what kind of advertising they want in their elections — not a private company.", "The first thing to note about Zuckerberg's remarks is that he is clearly not \"bragging\" or \"boasting\" about Facebook's intervention during the abortion referendum in Ireland. In fact, he expressed reticence on the part of Facebook about having a decisive role in regulating political advertising in the country in that case, and he was using the Eighth Amendment campaign as an example of why it would be better, in his view, for individual national governments to use local statutes, rather than private companies, to regulate that kind of content.", "Furthermore, some reports have assumed that in describing consultations between Facebook and \"folks\" in Ireland, Zuckerberg was saying that Facebook intervened in the Eighth Amendment campaign after conversations with members of the Irish government, which had proposed the repeal of the constitutional ban on abortion.", "In fact, a spokesperson for Facebook clarified that the company had not had any conversations with members of the Irish government on the issue, but rather consulted with an electoral watchdog called the Standards in Public Office Commission (SIPO). SIPO is independent of the government of Ireland, and operates on a strictly non-partisan basis. It is responsible for investigating and enforcing laws around political ethics, election spending, donations, and so on.", "So it is false to claim, as some reports did, that Facebook had consulted with the Irish government who, motivated by a desire to see the Eighth Amendment repealed, persuaded Facebook to intervene by specifically targeting pro-life advertisements.", "(After the publication of this fact check, LifeNews.com edited a report which had claimed Zuckerberg told the Aspen Ideas Festival that Facebook \"asked pro-abortion politicians last year whether it should ban pro-life ads\" during the campaign. The amended article subsequently stated that Facebook had put that enquiry to \"an Irish government agency,\" an apparent allusion to SIPO. The article did not include a correction, or an explanation of the source of that detail, since Zuckerberg did not mention any \"Irish government agency\" in his Aspen remarks).", "Rather, in April 2018 Facebook raised concerns with SIPO that it may have discovered evidence of a violation of Ireland's law against foreign donations to political campaigns, in the form of a U.S.-based actor paying Facebook to \"boost\" a post that had been created by an Irish-based abortion-campaign page.", "The case was rather complicated, and involved several inter-connected Facebook pages that shared the same administrators, one of whom was Irish and one of whom was American, and in the end SIPO reached no clear conclusion about whether a breach of the law against foreign campaign donations occurred. In email correspondence released under Ireland's Freedom of Information law, Facebook representatives were scrupulous in not revealing to SIPO the nature or viewpoint of the campaign pages in question.", "Separately, a spokesperson for Facebook told us that in the first weeks of the campaign, Facebook had become aware of several concerns about foreign actors attempting to influence the campaign, and that one of those concerns related to U.S.-based, pro-life groups paying for advertising on the platform. That concern, the spokesperson told us, partly informed Facebook's later decision to implement a blanket ban on all foreign referendum-related advertising, but only because of an overarching concern for the integrity of the election, and not because of the views those U.S. groups happened to hold.", "It was to this that Zuckerberg was referring in his Aspen remarks, when he said \"leading up to that referendum, a bunch of pro-life American groups advertised ... to try to influence public opinion there.\" The prospect of undue influence from foreign actors, who happened to hold pro-life views, was one of the catalysts for the later blanket ban on foreign advertising, rather than their pro-life stance being its target.", "Van der Galien, Michael.  \"Mark Zuckerberg Brags: We Didn't Allow Pro-Life Groups to Advertise Before Ireland's Abortion Vote.\"\r\n  PJ Media.  9 July 2019.", "Freiburger, Calvin.  \"Facebook Intentionally Blocked Pro-Life Ads During Irish Abortion Vote, CEO Admits.\"\r\n  Life Site News.  10 July 2019.", "Dumas, Breck.  \"Mark Zuckerberg Brags That Facebook Blocked Pro-Life Ads Ahead of Ireland's Vote.\"\r\n  The Blaze.  9 July 2019.", "Irish Central.  \"Zuckerberg Admits Facebook Banned Pro-Life Ads in Irish Abortion Vote.\"\r\n  11 July 2019.", "O'Carroll, Sinead.  \"Abortion Services Made Legal in Ireland as Michael D Higgins Signs Bill Into Law.\"\r\n  TheJournal.ie.  20 December 2018.", "Duffy, Rónán.  \"From 1983 to 2018: A History of the Eighth Amendment.\"\r\n  TheJournal.ie.  1 April 2018.", "Ryan, Órla.  \"Timeline: The History of Abortion in Ireland.\"\r\n  TheJournal.ie.  30 December 2018.", "Irish Statute Book.  \"Protection of Life During Pregnancy Act 2013.\"\r\n  2013.", "Finn, Christina.  \"Referendum on Repealing the Eighth Amendment to Be Held on Friday 25 May.\"\r\n  TheJournal.ie.  28 March 2018.", "Pollak, Sorcha; Clarke, Vivienne.  \"Presidential Election Confirmed for October 26th as Order Signed.\"\r\n  The Irish Times.  28 August 2018.", "Broadcasting Authority of Ireland.  \"Rule 27 Guidelines.\"\r\n  September 2018.", "O'Loughlin, Ed.  \"As Irish Abortion Vote Nears, Fears of Foreign Influence Rise.\"\r\n  The New York Times.  26 March 2018.", "Goldman, Rob; Himel, Alex.  \"Making Ads and Pages More Transparent.\"\r\n  Facebook.  6 April 2018.", "Facebook Ireland.  \"Facebook Will Not Be Accepting Referendum Related Ads From Advertisers Based Outside of Ireland.\"\r\n  8 May 2018.", "Waterson, Jim.  \"Google Bans Irish Abortion Referendum Adverts.\"\r\n  The Guardian.  9 May 2018.", "Lowe, Tiana.  \"Amid Abortion Referendum, Zuckerberg Asked Ireland's Government if He Should Block American Pro-Life Ads.\"\r\n  The Washington Examiner.  26 June 2019.", "Bilger, Micaiah.  \"Facebook CEO Mark Zuckerberg Conspired With Abortion Activists to Ban Pro-Life Ads Before Ireland Vote.\"\r\n  LifeNews.com.  27 June 2019.", "Foxe, Ken.  \"Facebook Had No 'Definitive Answer' on U.S. Interference in Abortion Referendum Problem.\"\r\n  TheStory.ie.  30 July 2018.", "Updated [25 July 2019]: Added mention of LifeNews.com's editing of its 27 June article, after the publication of this fact check.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]