["About this rating", "In April 2018, the editor-in-chief for a sports news site based in the United Arab Emirates inflamed the rumor mill surrounding a possible second bout between retired boxer Floyd Mayweather, Jr. and mixed martial artist Conor McGregor. (The first bout took place in August 2017, when Mayweather stopped McGregor in the tenth round.)", "Omar Al Raisi of the Sports Journal tweeted on 8 April 2018 that the two would meet in a modified-rules MMA format with \"4 ounce gloves, no shoes, 5-five minute rounds in 155 division,\" adding that the rules would include, \"No kicks, no take downs, no elbows, no knees. Certain things will be allowed like the clinch\":", "Other outlets picked up on Al Raisi's unsourced tweet for their own reports.  Two days later, however, Al Raisi backtracked on that statement in a story featuring an interview with retired boxing champion Vinny Paz:", "The Sports Journal reported yesterday that there have been negotiations, which was confirmed by Dana White himself, for a rematch between Floy Mayweather and Conor McGregor, except this time in the UFC Octagon with 'modified rules'. I would like to clarify that no deal is in place, nor any contract is signed, only initial talks.", "He added on Twitter:", "Let me clarify. Nothing is approved or signed. The modified rules MMA fight is something that has been discussed.", "No one has an interest for another boxing bout & we all know Floyd won't jump into a full MMA fight.", "Modified rules generates interest and Conor has better chances.", "Meanwhile, White dismissed that story on his own Twitter account saying, \"None of that is even close to true. Dumbest shit i have ever heard.\"", "Al Raisi told us:", "I never said Dana White has confirmed my reporting, I have never spoken to him or any of his team members. What I said was — Dana White confirmed on camera, to a reporter, that he has an offer for Floyd to fight in the UFC, he also indicated that it was a very large offer.", "Al Raisi also said, \"Some members of the media took my words a bit wrong,\" citing an interview he gave to SiriusXM radio hosts Gerry Cooney and Randy Gordon in which he said, \"Number one I'm not claiming that the fight is confirmed, absolutely not.\" He added, \"Both parties have not agreed. There's no pen to paper. These are certain things that were discussed. It went back and forth.\"", "When asked to identify when White confirmed the offer to Mayweather Al Raisi told us, \"He said it in one of the interviews I watched, I can't remember for which media outlet it was for.\"", "White did tell ESPN in December 2017, \"We're interested in doing something with Floyd.\" In April 2018, he said of the prospect of Mayweather fighting in a UFC event, \"Yeah, I could see this happening,\" but that it would go \"very badly\" for him. Al Raisi said of White's statement refuting his initial post:", "Well, he is supposed to say that, he said something similar when the news started to come out on Mayweather vs McGregor's boxing fight. Remember? Dana White is a very intelligent business man, and he knows what to do. He has built this sport of MMA and hopefully we will see him come over to Boxing and do the same.", "Rumors of a rematch between Mayweather and McGregor have swirled since their first encounter, which was held under boxing rules on 26 August 2017. Mayweather won that fight after scoring a technical knockout against McGregor in the tenth round, bringing his record to 50-0.", "More recently, White publicly criticized McGregor for what he called a \"coordinated attack\" during a UFC press conference in Brooklyn, New York on 6 April 2018 — two days before Al Rani's first post about the alleged negotiations. McGregor was arrested and charged with one count of criminal mischief and three counts of misdemeanor assault for allegedly throwing objects at a bus, causing injuries to two fighters sitting inside and causing their respective contests to be canceled.", "\"This was a real bad career move for him. Right now? No. I mean, do you want to be in business with Conor McGregor right now?\" White said. \"Do you want to chase this guy around for interviews and buy his fights. Do you?\"", "McGregor was released after posting $50,000 bail. He is due back in court on 14 June 2018.", "Mazique, Brian. \"Floyd Mayweather Vs. Conor McGregor 2 Will Happen In Octagon With Modified Rules, Per Report.\"\r\n    Forbes. 9 April 2018.", "Victor, Tom. \"Conor McGregor v Floyd Mayweather 2 – Everything We Know So Far.\"\r\n    Shortlist. 10 April 2018.", "Al Raisi, Omar. \"Vinny Paz Talks Mayweather-McGregor 2 And Says Only Dana White Can Save Boxing.\"\r\n    The Sports Journal. 10 April 2018.", "MMAJunkie. \"Dana White: Floyd Mayweather Fight in UFC Would Go Very Badly.\"\r\n4 April 2018.", "Bonesteel, Matt et al. \"Conor McGregor, Out on Bail After Rampage, and UFC Face the Future.\"\r\n    Washington Post. 8 April 2018.", "Reddy, Luke. \"Floyd Mayweather Stops Conor McGregor in 10th Round in Las Vegas.\"\r\n    BBC. 27 August 2017.", "Okamoto, Brett. \"Floyd Mayweather Jr. in Talks for UFC deal, Dana White Says.\"\r\nESPN. 20 December 2017.", "Update [13 April 2018]: Correction - noted that the Sports Journal is based in the United Arab Emirates.", "Arturo Garcia is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]