["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A viral Facebook post that has peppered social media for at least a year was given fresh life last month when former vice presidential candidate Sarah Palin shared it on her account.", "\"449,000 Californians turned down jury duty because they were not citizens… but they WERE registered voters,\" reads the text of the Oct. 2 post. \"Let that sink in.\"", "This post, which has been shared more than 57,000 times, was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "After searching online and in the Nexis news archive, we couldn’t find this statistic in any news coverage. So we started reaching out to California officials.", "Sam Mahood, a spokesperson for California Secretary of State Alex Padilla, told us he couldn’t comment on how many Californians declined jury duty on citizenship grounds — that’s not the office’s purview — but he said it’s not true that 449,000 noncitizens were registered to vote.", "Here’s what else you should know about potential jurors in California.", "First, people who are summoned for jury duty don’t \"turn it down,\" said Blaine Corren, a public affairs analyst for the Judicial Council of California. Rather, they can be excused from jury duty for various reasons, or a court can disqualify them from serving based on a number of factors including not being 18 or older, having a felony conviction on their record or for not being a citizen of the United States.", "The council collects statewide data on how many people were excused or disqualified and why — with some caveats. That information comes to the council from individual trial courts but since there’s no requirement that courts provide this data, some courts and categories may be missing in the Jury Data Reports the council produces.", "The data the state keeps on why someone was excused from jury duty includes financial hardship and physical or mental disabilities, but not citizenship status. The Judicial Council of California does, however, keep track of how many people were disqualified for jury duty because they’re not citizens.", "We requested the council’s reports through the most recent fiscal year for which a completed report is available, which was July 2017-June 2018. Our analysis shows that, annually, around 1 million people — citizens and noncitizens — are disqualified from jury duty in California. Approximately half aren’t citizens.", "From July 2008 through June 2017, about 11.3 million people were disqualified. Of those, about 4.7 million were disqualified for not being a U.S. citizen.", "In 2017-2018, 1,063,784 people overall were disqualified with 425,814 for not being citizens. But it was fiscal year 2016-17 that has a figure that comes closest to the claim in the Facebook post: Among 1,096,478 people who were disqualified for jury duty that year, 449,404 were disqualified for not being U.S. citizens.", "But that doesn’t mean that those rejected juror candidates were registered to vote.", "One of the primary sources courts use to summon jurors is the voter registration list, Corren said. The other is the state Department of Motor Vehicles’ list of licensed drivers and identification card holders in the area served by the court. Noncitizens, such as lawful permanent residents, can get driver’s licenses. As of 2015, undocumented immigrants in California can, too. So it follows that noncitizens — both lawful permanent residents and undocumented immigrants — would be summoned for jury duty as courts tap potential jurors from DMV data.", "\"These two lists are considered inclusive of a representative cross-section of the population, according to the California Code of Civil Procedure,\" Corren said. But, he added, courts could seek jurors from other sources like telephone directories and utility company lists.", "In Nevada County, Calif., for example, 97 potential jurors were excused because they weren’t citizens, said Jason Galkin, court executive officer of the Superior Court there. Galkin said the county tapped them from a list it got from the DMV. But searching for their names on the voter registration list, he said, there were no matches.", "In fiscal year 2017-2018, three Sierra County residents were dismissed from jury duty because they weren’t citizens but none of them were registered voters, said Jean-Anne Cheatham, a court assistant there.", "Karen Dalton, a spokesperson for the San Diego County Superior Court, told us most courts in California use the DMV’s driver’s license database as its primary source for the jury master list and then augment that with the voter registrar's list. In California, noncitizens can get driver’s licenses so, again, it follows that noncitizens would appear for jury duty in San Diego County, among others.", "The DMV has a \"motor voter\" program that automatically registers eligible driver’s license applicants unless they opt out. Sometimes, Corren said, people will inadvertently mark themselves down to register to vote and it’s possible that the lists courts receive from the DMV include these individuals. That information also goes to the California Secretary of State’s office to determine whether to add them to the voter rolls, according to Corren. The office then reviews the lists and cancels requests to register to vote from people who aren’t eligible, he said.", "Three Republican voters recently sued Secretary of State Padilla over the \"motor voter\" program, claiming that the state enables voter fraud by failing to investigate voters’ citizenship status, Courthouse News Service reported on Oct. 1.", "Since the DMV started automatically registering people to vote in April 2018, it acknowledged making 105,000 processing errors out of more than 2.4 million, according to a January Sacramento Bee story, and at least one noncitizen came forward to say he was improperly added to the voter rolls. But that doesn’t mean that 105,000 noncitizens cast ballots. Sam Mahood, with the secretary of state’s office, told us he doesn’t know of any recent convictions for noncitizens registering to vote.", "It’s also a far cry from the Facebook post’s claim: that 449,000 noncitizens were registered voters who had also been summoned for jury duty and turned it down.", "We rate this post False.", "Facebook post, Oct. 2, 2019", "Facebook post, Feb. 28, 2019", "Snopes, Did 449,000 Californians turn down jury duty because they are undocumented immigrants, Dec. 11, 2018", "Courthouse News Service, Suit says California lets noncitizens register to vote at DMV, Oct. 1, 2019", "The Sacramento Bee, Did non-citizens vote last year? California officials still can’t say, Jan. 4, 2019", "The Sacramento Bee, More than a million undocumented immigrants have received California driver’s licenses, April 5, 2018", "Jury Data Reports 2008-2017, Judicial Council of California", "Email interview with Sam Mahood, press secretary, California Secretary of State, March 26, 2019", "Email interview with Blaine Corren, public affairs analyst, Judicial Council of California, March 28, 2019", "Email interview with Benjamin Rada, public affairs, Santa Clara County Superior Court, May 3, 2019", "Email interview with Jason Galkin, court executive officer, Nevada County Superior Court, April 15, 2019", "Email interview with court administration, Placer County Superior Court, April 5, 2019", "Email interview with Rachel Black, management analyst, San Bernardino County Superior Court, April 3, 2019", "Email interview with Kevin Harrigan, court executive officer, Tehama Superior Court, April 3, 2019", "Email interview with Bianca Fasuescu, court executive assistant, San Mateo County Superior Court, April 3, 2019", "Email interview with Robert Fleshman, court executive officer, Napa County Superior Court, March 28, 2019", "Email interview with Karen Dalton, public affairs officer, San Diego County Superior Court, March 28, 2019", "Email interview with Mary Eckhardt Hearn, public information officer, Los Angeles Superior Court, March 28, 2019", "Email interview with Jean-Anne Cheatham, administrative assistant, Sierra Superior Court, March 28, 2019", "Email interview with Cindia Martinez, interim court executive officer, Glenn Superior Court, March 28, 2019", "Email interview with Stephanie Fathy, public information liaison, Monterey County Superior Court, March 28, 2019", "Email interview with Robert Sherman, assistant court executive officer, Ventura Superior Court, March 28, 2019", "Email interview with Kim Turner, court executive officer, Mendocino County Superior Court, March 28, 2019", "Email interview with Brian Taylor, court executive officer, Solano County Superior Court, March 28, 2019", "Email interview with Krisa LeVier, court executive officer, Lake County Superior Court, March 28, 2019", "Email interview with Marita Ford, public information officer, Riverside Superior Court, March 28, 2019", "Email interview with Shawn Landry, court executive officer, Yolo County Superior Court, March 28, 2019", "Email interview with Melissa Fowler-Bradley, court executive officer, Shasta County Superior Court, March 28, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]