["Senate Minority Leader Sen. Chuck Schumer of N.Y., speaks to reporters on Capitol Hill in Washington, Tuesday, July 10, 2018. (AP)", "Democrats pounced on a years-old statement by president Donald Trump’s U.S. Supreme Court pick Brett Kavanaugh to drum up concern about how he might shield the president from Robert Mueller’s investigation.", "In an interview July 10, Senate Democratic Leader Charles Schumer suggested the comment about presidential power by Kavanaugh could give Trump a pass in the investigation, even though it came long before Mueller’s investigation into Russian interference in the 2016 election.", "\"You are worried about president Trump’s overreach. So am I,\" Schumer said on MSNBC’s Morning Joe. \"This nominee has stood more, both certainly before he became a judge, for presidential overreach. He has said the president shouldn't be investigated. He has gone so far as to say a president if he declares a law unconstitutional doesn’t have to obey it. How is he going to react if Mueller needs a subpoena? If Mueller needs some other action?\"", "Many Democrats have latched onto Kavanaugh’s statement about investigations into presidents. But we found that Democrats aren’t telling the full story about what Kavanaugh said.", "The statement by Kavanaugh stems from his 2009 article in the Minnesota Law Review about the separation of powers.", "At the time, he was a judge for the United States Court of Appeals for the District of Columbia Circuit. His article was adapted from remarks he made at the University of Minnesota Law School on Oct. 17, 2008, a couple of weeks before the presidential election.", "Kavanaugh made a reference to his experience with the Starr Report, which said that president Bill Clinton lied under oath in Clinton vs. Jones regarding his sexual relationship with Monica Lewinsky, obstructed justice, and refused to testify. Clinton was impeached in 1998 but acquitted by the Senate.", "In the law review article, Kavanaugh wrote that Congress could consider a law exempting the president while in office from criminal prosecution because it is \"inevitably politicized by both their supporters and critics.\"", "Kavanaugh wrote that the Supreme Court‘s decision in Clinton vs Jones that presidents are not constitutionally entitled to deferral of civil suits \"may well have been entirely correct\" but Congress \"may be wise\" to set a statute to allow temporary deferral.", "Democrats have zeroed in on this passage by Kavanaugh:", "\"Even the lesser burdens of a criminal investigation — including preparing for questioning by criminal investigators — are time-consuming and distracting. Like civil suits, criminal investigations take the president’s focus away from his or her responsibilities to the people. And a president who is concerned about an ongoing criminal investigation is almost inevitably going to do a worse job as president.\"", "Kavanaugh also wrote that the Constitution already provides a check on executive power, because an impeached president is then subject to criminal prosecution.", "\"In short, the Constitution establishes a clear mechanism to deter executive malfeasance; we should not burden a sitting president with civil suits, criminal investigations, or criminal prosecutions. The president’s job is difficult enough as is. And the country loses when the president’s focus is distracted by the burdens of civil litigation or criminal investigation and possible prosecution.\"", "In a footnote, Kavanaugh wrote that the independent counsel statute, which was used by Kenneth Starr to investigate Clinton, \"was a major mistake.\"", "\"The law itself created a perverse structure that was inconsistent with foundational principles of separation of powers and that created problems for both the president and the independent counsel,\" he wrote.", "Law professors told us it was important to put Kavanaugh’s 2009 comments in context.", "Kavanaugh was calling for Congress to pass a statute granting presidents temporary immunity.", "\"Schumer is using that notion — that in general, it is bad policy to allow presidents to be pursued by prosecutors while in office — to imply that Kavanaugh thinks Trump shouldn’t be investigated, and to question how he would rule as a judge,\" said Michigan State University law professor Brian Kalt. \"That is disingenuous, because Kavanaugh was calling for Congress to pass a statute granting immunity. They have passed no such statute, and it is not reasonable to suggest that Kavanaugh as a judge would ignore that fact.\"", "If Kavanaugh became a justice and had to react to a future Mueller subpoena of Trump, Kavanaugh \"would almost certainly respect the unanimous precedent of U.S. v. Nixon, which held that the president is not immune from subpoenas. If Congress passed a statute exempting the president from such subpoenas — which it hasn’t — then he would say that the president is exempt,\" Kalt said.", "Noah Feldman, a Harvard law professor, wrote in a Bloomberg column that while Democrats argue that Kavanaugh believes a president shouldn’t be indicted while in office, \"Kavanaugh’s expressed views actually support the opposite conclusion: that the president can be investigated and maybe even indicted unless Congress passes a law saying he can’t — which Congress has not done.\"", "Kavanaugh said only that Congress should pass a law that delays certain investigations until after the presidency, Feldman told PolitiFact.", "\"He did NOT say that was the state of affairs without the law — and there is no such law. For comparison, that is what Bill Clinton wanted even for civil investigation. Totally mainstream,\" Feldman said. \"On the subpoena, we don’t know. But given that there is no law in place protecting (the president) and that Ken Starr issued subpoenas while Kavanaugh was working for him, my money would be on requiring Trump to comply.\"", "Schumer said that Kavanaugh \"has said the president shouldn't be investigated.\"", "Schumer is plucking one part of what Kavanaugh wrote in a 2009 Minnesota law review paper without recapping his comments in full.", "Kavanaugh wrote that civil suits and criminal investigations take away from a president’s focus on his or her work responsibilities. He didn’t call for the court to take away the power to investigate the president; he said that Congress could consider writing a law to exempt the president.", "As for Schumer’s concern for the Mueller investigation, experts said there is unanimous Supreme Court precedent that the president is not immune from subpoenas, and Kavanaugh has not indicated so far that he would change that.", "We rate this claim Half True.", "MSNBC, Sen. Chuck Schumer interview, July 10, 2018", "Minnesota Law Review, \"Separation of Powers During the Forty-Fourth Presidency and Beyond,\" 2009", "NPR, \"Who Is Brett Kavanaugh, President Trump's Pick For The Supreme Court?\" July 9, 2018", "Talking Points Memo, \"A Way Forward on the Eager Brett Kavanaugh,\" July 10, 2018", "New York Times, \"Brett Kavanaugh, Supreme Court Front-Runner, Once Argued Broad Grounds for Impeachment,\" July 5, 2018", "New York Times opinion By Caroline Fredrickson and Norman L. Eisen, \"Will Kavanaugh Provide Cover for Trump?\" July 10, 2018", "Washington Post, \"Supreme Court nominee has argued presidents should not be distracted by investigations and lawsuits,\" July 9, 2018", "Vox, \"Brett Kavanaugh, Donald Trump’s Supreme Court pick, explained,\" July 9, 2018", "Shugerblog, \"Four thoughts on Judge Kavanaugh,\" July 9, 2018", "Bloomberg Opinion by Harvard law professor Noah Feldman, \"Kavanaugh’s Papers Don’t Help Trump Avoid Indictment,\" July 10, 2018", "Washington Post, The Starr Report", "Interview, Justin Goodman, U.S. Sen. Chuck Schumer spokesman, July 10, 2018", "Interview, Brian Kalt, Michigan State University law professor, July 10, 2018", "Interview, Jed Shugerman, Fordham law professor, July 10, 2018", "Interview, Noah Feldman, Harvard law professor, July 10, 2018", "Interview, Daniel Kobil, Capital University law professor, July 10, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]