["‘No role for coconut oil in cancer treatment in humans’ – and it’s not good for the heartHot coconut water kills cancer cells, claims a message circulating on social media.The alert popped up in June 2019 on the Africa Check Whatsapp group set up to flag false and potentially harmful health information in Nigeria.It was also shared on the Facebook pages DVBIOLOGYSCIENCE, Hallaur and The Star News.The message reads: “Dr Abbas Hussain Kazmi of Sheikh Zaid Hospital stressed that if everyone who receives this newsletter can forward ten copies to others, surely at least one life will be saved back... Hot coconut water can save you a lifetime... Hot coconut water ~ only kills cancer cells...“Cut 2 to 3 thin coconut flakes in a cup, add hot water, it will become ‘alkaline water’, drink every day, it is good for anyone. Hot Coconut water releases an anti-cancer substance, which is the latest advance in the effective treatment of cancer in the medical field.”It also claims that “hot coconut juice has an effect on cysts and tumours. Proven to remedy all types of cancer.”", "Please complete this form to receive the HTML sharing code.", "A fact-checker has rated your Facebook or Instagram post as “false”, “altered”, “partly false” or “missing context”. This could have serious consequences. What do you do?", "Click on our guide for the steps you should follow.", "Africa Check is a partner in\nMeta's third-party fact-checking programme\nto help stop the spread of false information on social media.", "The content we rate as “false” will be downgraded on Facebook and Instagram. This means fewer people will see it.", "You can also help identify false information on Facebook. This\nguide explains how.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "For democracy to function, public figures need to be held to account for what they say. The claims they make need to be checked, openly and impartially. Africa Check is an independent, non-partisan organisation which assesses claims made in the public arena using journalistic skills and evidence drawn from the latest online tools, readers, public sources and experts, sorting fact from fiction and publishing the results.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "© 2023 - Africa Check - All rights reserved.", "We will never charge you for verified, reliable information. Help us keep it that way by supporting our work.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "Support independent fact-checking in Africa."]