["About this rating", "On Dec. 17, 2020, dozens of Twitter accounts started spamming social media with near-verbatim messages falsely claiming that a woman named Ruby Freeman had been arrested by the FBI for crimes related to election fraud in Atlanta, Georgia.", "The viral copypasta read:", "\"HUGE BREAKING NEWS! Ruby Freeman (the Democrat suitcase blonde-braid woman in GA) has been arrested! She has acknowledged to law enforcement and investigators her role in the Fulton County methods of GOP witness complaints and the after hours ballot scheme count.\"", "There was no truth to this rumor. The FBI did not arrest Ruby Freeman for election fraud and this person was not suspected (outside of conspiracy-minded circles) of any illegal activity related to the 2020 election.", "While most of the iterations of this viral message that we encountered simply contained the message above, some versions were part of longer Twitter threads that included additional claims about various charges that the FBI allegedly filed against Freeman.", "The longer versions of this rumor claimed that the \"source\" of the information was an FBI statement posted in the early hours of Dec. 17. However, we found no such news release. We looked through the websites and social media pages of the FBI, the FBI's Atlanta Division, the U.S. Attorney's Office for the Southern District of Georgia, the U.S. Attorney's Office for the Northern District of Georgia, and the Fulton County Police Department, but found no mention of Freeman's alleged arrest.", "The false rumors about Freeman's arrest were just another installment in a weeks-long smear campaign against the U.S. electoral process. In early December, U.S. President Donald Trump's attorney Rudy Giuliani, disreputable websites such as the Gateway Pundit, and conspiracy-minded social media users started sharing a video that showed an election worker they identified as Freeman allegedly removing ballots from a \"suitcase.\" While Giuliani and others have claimed without evidence that this \"suitcase\" (which was actually a standard absentee ballot container, according to Georgia elections officials) was filled with illegal ballots, election officials labeled this claim \"ridiculous\" and offered a much more reasonable explanation.", "The New York Times reported:", "Late on Nov. 3, election workers in Fulton County, Georgia, heard that they would be allowed to go home for the night. So they packed uncounted ballots into suitcases and prepared to lock up for the evening.", "When word came that they couldn’t leave yet, they dragged the suitcases back out and began counting the ballots again.", "That singular scene — of workers taking out suitcases of votes — was then selectively edited and shared by allies of President Trump as a conspiracy theory that election workers had dragged out fraudulent ballots under the cover of night. According to the theory, those suitcases helped swing Georgia’s Electoral College votes to President-elect Joseph R. Biden Jr.", "But on Monday, Georgia’s secretary of state office dedicated part of a morning news conference to debunking that falsehood and many others, in what was called “Disinformation Monday.” Gabriel Sterling, the voting implementation manager in Georgia and a Republican, said in the news conference that watching the entire surveillance footage of Election Day showed that workers had first packed the suitcases with valid, uncounted ballots and then later unpacked those same ballots. They had not taken out suitcases full of fake ballots, he said.", "After the suitcase-of-fraud claims were dismissed by election officials, social media users started sharing a \"confession\" that Freeman supposedly posted to her Instagram account. This Instagram account, however, does not actually belong to Freeman. Shortly after this \"confession\" went viral, the @RubyFreeman_Georgia Instagram account (which was created on the same day this message was posted), started sharing content that mocked those who fell for its ruse.", "In addition to falsely accusing this woman of confessing to election fraud, many social media users also passed around a mug shot of an entirely different \"Ruby Freeman\" in an apparent attempt to further smear her character or resuscitate this rumor.", "The accusations against Freeman were without merit, as were a plethora of claims holding that the 2020 presidential election was marred by widespread voter fraud. Claims of voter fraud have been dismissed by election officials and lawsuits alleging fraud have been dismissed by judges across the country.", "As for Ruby Freeman, she was not arrested by the FBI and she is not suspected (outside of conspiracy-minded circles) of any wrongdoing related to the 2020 election.", "Update [Aug. 29, 2022]: Updated to note that so-called \"suitcases\" identified as such by conspiracy theorists were actually standard absentee ballot containers according to Ga. elections officials.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]