["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Where were you on 9/11? According to an image shared on Facebook recently, President Donald Trump was helping first responders and former President Barack Obama was watching sports in the White House.", "\"On September 11, 2001, Donald Trump joined America’s heroes and carried victims over his shoulders down the steps of the burning World Trade Center. Obama spent the whole day sitting in the Oval Office with his feet on the desk watching basketball.\"", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Astute historians will recall that it was former President George W. Bush who was in office in 2001 and was famously reading a children’s book called \"The Pet Goat\" to a class of first graders when the attacks happened.", "Obama was serving in the Illinois State Senate in 2001. The image of him that appears in the Facebook post is real, but it’s just been doctored to look like he’s watching a basketball game. There’s no TV in the original photo, image No. 8 in this slideshow, taken by then-White House photographer Pete Souza. Rather, Obama is meeting with his national security adviser, Tom Danilon, Chief of Staff Jack Lew, and Denis McDonough, deputy national-security adviser, on Nov. 14, 2012.", "Trump, meanwhile, has been edited into this photo taken by Reuters photographer Shannon Stapleton. It shows rescue workers removing Father Mychal Judge from the World Trade Center tower on Sept. 11.", "Trump was near the Ground Zero site two days after the attacks when he gave a TV interview a few blocks away. As we’ve noted in a previous fact-check, that interview marked the first of several times when he would say, without evidence, that he had sent a lot of men to help in the area.", "Richard Alles, a New York Department battalion chief on Sept. 11, told us that he had no knowledge of Trump being at the site or sending workers there to help.", "\"I was in a supervisory role with the fire department at the time,\" said Alles, who said he was on the scene about 20 minutes after the second building collapsed. \"I was there for several months — I have no knowledge of his being down there.\"", "We rate this Facebook post Pants on Fire!", "Facebook post, Nov. 4, 2019", "Politico, Bush reads ‘The Pet Goat’ to schoolchildren, Sept. 11, 2001", "U.S. Senate, Barack Obama,  visited Nov. 8, 2019", "Vanity Fair, The lean-back president, April 29, 2013", "New York Daily News, 9/11 survivors saw horrors to last a lifetime in 2001, Sept. 10, 2015", "PolitiFact, Donald Trump says he spent a lot of time with 9/11 first responders. Here are the facts, July 30, 2019", "USA Today, Trump again said he helped at ground zero immediately following the 9/11 attacks, Sept. 11, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]