["A claim that a local eatery in Sri Lanka was serving plastic eggs has been shared in multiple posts on Facebook. The posts also include tips on how to identify fake eggs. However, the claim is false; local health officials investigated the matter and found now evidence that plastic eggs were being served to customers. The photos in the posts were published in reports about fake eggs being produced in China.", "The claim was published on Facebook here on September 15, 2020. The post has been shared over 200 times.", "The post’s Sinhala caption is titled “Plastic eggs” and claims that a restaurant in Vavuniya, a town in northern Sri Lanka, served fake eggs.", "The lengthy post reads in part: “This is a newspaper article published in September 2020. This scam was first detected in Vavuniya. After I shared this article a lot of requests were made on how to easily identify plastic eggs. So here are some easy methods you can use to detect a plastic egg.”", "Similar claims were also made on Facebook here, here, here, here and here.", "The claim, however, is false.", "“There is no truth to these claims,” K. Ilangeswaran, Vavuniya’s urban council public health inspector, told AFP by phone on September 21, 2020.", "Ilangeswaran explained he investigated the matter after a customer received eggs that had a strange texture and accused the local eatery of using plastic in the eggs.", "“The investigation revealed they weren’t fake eggs. The texture of the egg had toughened due to the boiled eggs being frozen and subsequently being deep fried,” he added.", "A spokesperson for the Consumer Affairs Authority also refuted the claim, telling AFP by phone on September 28, 2020 that the agency has not received any credible claims of plastic eggs being sold in Sri Lanka.", "The director of the Public Health Inspector’s Union of Sri Lanka, Upul Rohana, confirmed that fake eggs have not been found in Sri Lanka. However, he added in a phone  interview on September 21, 2020 that fake and plastic eggs have been an issue in other countries.", "Reverse image searches found that the images used in the misleading Facebook posts were published here and here in online posts about fake eggs being produced in China.", "Citing Chinese media, US magazine Time reported on the issue here in 2012, explaining that fake eggs are produced using resin, starch and pigments.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]