["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "You knew it wouldn't take long for \"the hug\" to get some love during Sunday's debate between Republicans Marco Rubio and Charlie Crist. Minutes into the 40-minute \"Florida Senate Showdown,\" Rubio made a case that he'll stand up to President Barack Obama's agenda and Crist won't.\"Everyone knows that you won't stand up to the Obama agenda because just a year ago you were campaigning for it,\" the former House speaker said, referring to Feb. 10, 2009, when Crist embraced the president at a Fort Myers campaign event for the federal stimulus package.We've fact-checked several claims about Crist's support for the stimulus. Indeed, he earned a Pants on Fire rating for saying he didn't endorse it. So it was a Rubio comment later in the program that drew our attention. FOX News Sunday host Chris Wallace asked Rubio, \"Why is $8 billion and 87,000 jobs bad for a state that has 12 percent unemployment?\"\"Well ... if it's bad for America, it can't possibly be good for your state,\" Rubio said. \"Let me tell you why the stimulus has failed. The stimulus has failed because since that famous day in February where the governor campaigned with Barack Obama on behalf of the stimulus program, 211,000 Floridians have lost their jobs.\"211,000 is a big number, so we wanted to check Rubio's facts.Conveniently, the state's Agency for Workforce Innovation released a report on state employment figures just two days before the debate. In it, Florida's record 12.2 percent unemployment rate is announced, along with many statistics on the state's jobs picture, including year-over-year numbers from February 2009, the month Crist campaigned with Obama. The report shows Florida had 8,356,000 jobs in February 2009 and 8,125,000 in February 2010, the difference being 231,000. These are the seasonally adjusted numbers for the civilian population.However, if you look at seasonally adjusted nonagricultural employment --- a less-inclusive number --- you see the basis for Rubio's claim. There the job loss in a year's time is 211,500.It's the latter number that the Rubio campaign points to. Spokesman Alberto Martinez also shared a report from House Way and Means Republicans that seeks to highlight the stimulus as a job-killer, rather than a job creator, where Florida is said to have lost 240,400 jobs since the stimulus passed.Like any statistics, these are easily sliced and diced to make the key point. But Rubio is very close to the precise number, and in fact, he underestimates it slightly when his point is that Florida has lost a lot of jobs. So we rule this one True.", "Congressional Quarterly, transcript of the Crist-Rubio debate, March 28, 2010Agency for Workforce Innovation, Florida’s February Employment Figures Released, March 26, 2010PolitiFact Florida, \"Charlie Crist says he didn't endorse stimulus bill,\" Nov. 5, 2009. accessed March 28, 2010St. Petersburg Times, \"Florida unemployment reaches 12.2 percent, setting a modern era record,\" March 27, 2010U.S. House Ways and Means Republicans, 48 out of 50 States Have Lost Jobs Since Democrats' Stimulus Passed, March 10, 2010Bureau of Labor Statistics, Regional and State Employment and Unemployment Survey, March 26, 2010E-mail with Alberto Martinez, Marco Rubio campaign spokesman, March 28, 2010", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]