["By Robert Farley", "Posted on July 2, 2020", "Former New York City Mayor Rudy Giuliani misleadingly contrasted his mayoral record on crime with a recent spike in murders under Democratic Mayor Bill de Blasio, citing the uptick as evidence that Democratic mayors are “a danger to their people.”", "Major crimes are down under de Blasio, and while there has been a surge in murders so far this year, the annual number of murders under de Blasio has been about half as high as it was in Giuliani’s best year.", "“Please remember that all the lawlessness is happening in Democrat cities run by Democrats sometimes for 40, 50 and 100 years,” Giuliani, a personal attorney for President Donald Trump, said in comments to reporters from the White House driveway on July 1. “There hasn’t been a Republican mayor there in forever, except for New York, and it was me, and I brought crime down 65%, and Bloomberg got it up to 75%. And right now, murder is up 58% under the ‘regressive’ Democrat mayor, who’s typical of Democrat mayors all over the country. They are a disaster. They’re a danger to their people.”", "Giuliani is mixing two different statistics — comparing his statistics on overall “crime” with the number of murders under de Blasio’s watch. And his claim is misleading by both measures.", "Giuliani’s figures on the drop in crime during his time as mayor from 1994 through 2001 are close to accurate. According to data from the New York City Police Department, major felony offenses declined by 62.3% from 1993, the year before he took office, to 2001, Giuliani’s last year in office (dropping from 430,460 to 162,064). Major crimes include the seven major felony offenses — murder/manslaughter, rape, robbery, felony assault, burglary, grand larceny and grand larceny of a motor vehicle.", "Major crimes continued to decline under Giuliani’s successor, Mike Bloomberg, who won the office as a Republican. (He switched his affiliation to independent in 2007, and then re-registered as a Democrat prior to announcing his bid for president last year.)", "Giuliani said “Bloomberg got it up to 75%.” Indeed, measuring again from the year before Giuliani took office, 1993, there was a 74.1% decline in major crimes to 111,335 by 2013, Bloomberg’s final year in office.", "Put another way, major crimes dropped 62.3% under Giuliani and then dropped 31.3% under Bloomberg.", "Not mentioned by Giuliani, however, is that major crimes continued to decline under de Blasio. The number of those seven major felonies declined to 95,593 by 2019, a 13.9% drop from the number the year before he took office. By Giuliani’s logic — measuring from the year before Giuliani took office — de Blasio “got it up to” 77.8%.", "Giuliani’s claim that “murder is up 58%” under de Blasio appears to cherry-pick and inflate a recent spike.", "Let’s start by looking at the longer-term trend and annual totals.", "There were 335 murders (murders and non-negligent homicides) in New York City in 2013, the year before de Blasio took office, according to police data. During de Blasio’s first six years in office, the number has fluctuated, but has only once edged higher than the number he inherited. In most years, it has been lower.", "In 2019, the city recorded 319 murders (up from 295 in 2018). But that’s still 4.8% fewer than the number of murders before he took office. It’s also half as many as the 649 in Giuliani’s last year in office in 2001.", "“Murder started falling very quickly in the years before Giuliani took office, continued to fall sharply while he was in office, and then continued falling after he left office. His time in office did not change the trend at all,” said Patrick Sharkey, a professor of sociology and public affairs at Princeton University who created a website that tracks data on murder for large cities.", "“When de Blasio took office and ended the use of stop, question, and frisk, lots of people predicted crime would rise — including Bloomberg and former Commissioner Ray Kelly,” Sharkey told us via email. “Instead, violence in NYC has fallen to the lowest levels on record under de Blasio. Based on the previous year, New York City is the safest big city in the country, and is safer than it’s been in decades.”", "We wrote about some of those trends in May 2019 when Trump and his son Eric wrongly claimed that crime had risen in the city under de Blasio’s leadership.", "There has been, however, an upswing in gun violence and murder in 2020.", "According to police department data, there have been 166 murders in New York City in 2020 through June 21. That’s nearly 24% higher than the 134 murders over the same period last year. Over a 28-day period ending June 21, there were 34 murders, roughly 48% higher than the 23 over the same 28-day period last year.", "According to the New York Times, the number of shootings in the first three weeks of June surged to 125, more than double the number over the same three-week period last year. The spike comes amid rising tensions from protests and riots after George Floyd’s death while in police custody in Minneapolis on May 25. It is a trend the Times said has been happening in other large cities around the country.", "“I have been studying this for a long time. I have never seen that much of an increase ever,” Christopher Herrmann, a professor at the John Jay College of Criminal Justice who once analyzed crime statistics for the New York City Police Department, told the New York Times.", "But it is still a small sample size.", "“So far this year, murders and shootings are up,” Sharkey told us. “It’s usually not wise to extrapolate based on short periods of time, because it often fluctuates. That said, the trends so far this year suggest that the level of violence will be higher this year than last year.”", "Andrew Karmen, a professor at John Jay College of Criminal Justice in New York City, cautioned us via email that the spike may only be temporary.", "And, he said, it is going up this year during a pandemic, high unemployment “and a new wave of political activism.”", "“What is Giuliani implying? That mayors and police chiefs should adopt the hard-line law and order policies that he claims worked so well in the 1990s?” Karmen said. “But these policies were discontinued in NYC, and yet crime continued to fall for several years, until the end of 2019.”", "In a press conference on June 22, de Blasio talked about the need to “address a troubling trend we’ve seen in terms of shootings over the last weeks,” which he attributed in part to a typical upswing in the summer as well as complications caused by the coronavirus. De Blasio said the police department would be flooding hundreds of police officers into areas experiencing violence, and that there would be an increase in car and foot patrols.", "“The bottom line here is we’re not going to allow gun violence to continue to grow in this city,” de Blasio said, adding that the city’s response would include police strategies that emphasize a partnership between police and communities. “We’re not going back to the bad old days when there was so much violence in this city. Nor are we going back to the bad old days where policing was done the wrong way.”", "It remains to be seen how the rest of the year shakes out. But it is misleading for Giuliani to say “murder is up 58%” under de Blasio.", "The number of murders has declined 4.8% from the year before de Blasio took office to 2019, the last full year of data. The number of murders went up 8% in 2019 from 2018, and so far it is up 24% this year through June 21 compared with the same time period last year. But the number hasn’t gone up 58%, as Giuliani claimed.", "Editor’s note: FactCheck.org does not accept advertising. We rely on grants and individual donations from people like you. Please consider a donation. Credit card donations may be made through our “Donate” page. If you prefer to give by check, send to: FactCheck.org, Annenberg Public Policy Center, 202 S. 36th St., Philadelphia, PA 19104.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]