["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Sen. Marco Rubio, R-Fla., arrives at the chamber to take taking an oath and vote on how to proceed on the impeachment against former President Donald Trump, at the Capitol in Washington, Jan. 26, 2021. (AP)", "The total number of presidential directives signed by Biden during his first two days in office is greater than the number signed by Trump and Obama over the same period.", "The available record before FDR isn’t complete enough to definitively say whether Rubio is also right about all presidents, but experts said it’s likely that his claim still holds.", "It’s worth noting that Biden issued multiple orders directed at a specific issue that’s actively affecting the entire nation: the coronavirus pandemic.", "Sen. Marco Rubio, R. Fla., claimed that President Joe Biden talks like a centrist, but is \"governing like someone from the far-left.\"", "\"He has issued more executive fiats than anyone in such a short period of time, ever, more than Obama, more than Trump, more than anyone,\" Rubio said in a video.", "Is that true?", "Rubio tweeted the video shortly before 8 a.m. Jan. 22, so we evaluated Rubio’s claim based on actions Biden had taken up to that point (Jan. 20-21).", "Setting aside the political implications of the word \"fiat,\" we found that available evidence supports Rubio’s assessment: Biden’s use of the executive power in his first two days far outpaced that of his predecessors.", "Rubio’s office did not respond to our requests for information.", "The total number of presidential directives signed by Biden during his first two days in office is greater than the number signed by Presidents Donald Trump and Barack Obama over the same period.", "Biden issued 17 executive orders on his first two days in office, compared with Trump who issued one and Obama who issued two. Biden issued three proclamations, while Trump and Obama each issued one.", "Executive orders state how to manage the operations of the executive branch of the federal government. Proclamations communicate information on holidays, commemorations, special observances, trade, and policy.", "The Office of the Federal Register numbers each executive order and proclamation consecutively as part of a series and publishes them in the daily Federal Register after the White House sends over the information. Other presidential documents, such as memoranda and notices, are not numbered but are also published.", "The Office of the Federal Register is in the process of digitizing documents published prior to 1994. So we were unable to use that source to compare Biden’s actions with all other presidents. We turned instead to the American Presidency Project, a nonpartisan source of presidential documents hosted at the University of California, Santa Barbara.", "If Rubio was referring to a president’s first two days in office (instead of any two-day period), the available documents show that he is correct dating back to President Franklin D. Roosevelt, whose first inauguration was in 1933, said Gerhard Peters, a political science professor at Citrus College and co-director of the American Presidency Project.", "The available record before FDR isn’t complete enough to say definitively whether Rubio is also right about earlier presidents, but experts said it’s likely that his claim still holds.", "\"Before FDR, presidents simply did not charge into office as prepared for action,\" said John Woolley, co-director of American Presidency Project and professor emeritus of political science at UCSB. \"Even Lincoln, judging by the record assembled by (his secretaries John G. Nicolay and John Hay), did not fire off as many orders as Biden despite there already being an active revolt in progress.\"", "Rubio used the word \"fiat\" — a politicized term that would suggest Biden rushed in sweeping and long-lasting policy changes. However, Biden in his first two days issued 10 executive orders and one memorandum to address a specific issue that’s actively affecting the entire nation: the coronavirus pandemic. Biden was sworn into office around the time the United States recorded about 400,000 deaths from COVID-19, the disease caused by the novel coronavirus.", "Here’s a rundown of those specific actions:", "Executive order mandating use of masks on federal property", "Executive order creating the position of COVID-19 response coordinator", "Executive order requiring masks in all forms of public transportation", "Executive order to develop and expand access to COVID-19 treatments", "Executive order to improve the collection and sharing of COVID-19 data", "Executive order to secure supplies necessary for responding to the pandemic", "Executive order to ensure equitable pandemic response and recovery", "Executive order to support the reopening and continuing operation of schools", "Executive order to protect workers from COVID-19 under the Occupational Safety and Health Act", "Executive order establishing the COVID-19 Pandemic Testing Board", "Memorandum extending federal support to governors’ use of the National Guard in their COVID-19 response", "\"No one would doubt the need for executive action to deal with an overwhelming health crisis, so this crisis situation makes this a unique point in time,\" said John Frendreis, a professor emeritus of political science at Loyola University Chicago. \"Rubio’s comment is technically correct, although when taken together with the context, it is exaggerated.\"", "Besides those COVID-19 measures, Biden’s actions included an order requiring an ethics pledge from his appointees and directives revoking several of Trump’s policies.", "It’s become more common for presidents to issue executive actions and for the other party to dislike it, said Daniel Gitterman, a public policy professor at the University of North Carolina at Chapel Hill.", "\"When it’s the president of the opposite party, they call it executive fiat, and when it’s the president of the same party, they call it bold action,\" Gitterman said.", "According to the Federal Register, Trump signed 220 executive orders during his four years in office. Throughout their eight-year administrations, Obama signed 276 executive orders and George W. Bush signed 291.", "Rubio said Biden \"has issued more executive fiats than anyone in such a short period of time, ever, more than Obama, more than Trump, more than anyone.\"", "Fiats\" is a politically loaded term and ignores that many of Biden’s directives were specific to the ongoing pandemic.", "Still, the available evidence on the number of directives issued supports Rubio’s claim.", "We rate it True.", "RELATED: Which campaign promises did Joe Biden tackle first?", "RELATED: Here's what Donald Trump did his first week as president of the United States", "Twitter, @marcorubio tweet, Jan. 22, 2021", "FederalRegister.gov, Presidential Documents; Digitizing the Federal Register", "WhiteHouse.gov, Briefing Room — Presidential Actions", "PolitiFact, How Biden’s Keystone XL pipeline executive order affects American jobs, Jan. 21, 2021", "The American Presidency Project, hosted at the University of California, Santa Barbara", "Email interview, John Frendreis, a professor emeritus of political science at Loyola University Chicago, Jan. 26, 2021", "Email interview, Gerhard Peters, a political science professor at Citrus College and co-director of the American Presidency Project, Jan. 26, 2021", "Email interview, John Woolley, co-director of American Presidency Project, Jan. 26, 2021", "Phone interview, Daniel Gitterman, a public policy professor at the University of North Carolina at Chapel Hill, Jan. 26, 2021", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]