["About this rating", "As thousands of protesters continued to gather in Cannon Ball, North Dakota, in September 2016 to protest the construction of the Dakota Access oil pipeline, social media users widely circulated a photograph purportedly showing a young protester staring down a police officer garbed in full riot gear:", "North Dakota. The United States of America. 2016. You need to know what is happening. The tribes are not speaking up for only themselves, but for all people who rely on clean water to live. You do drink water, don't you? This little girl is standing up for you.", "Although this photograph is real, it was not taken in North Dakota nor does it have anything to do with protests over the Dakota Access Pipeline. This image originated with the Reuters news service and captured a moment from a September 2016 political demonstration in Chile:", "A demonstrator looks at a riot policeman during a protest marking the country's 1973 military coup in Santiago, Chile — September 12, 2016 01:00pm EDT", "Facebook user \"Bc EchoHawk,\" who originally shared the above-displayed photograph along with the claim that it was taken in North Dakota, later updated his Facebook post with correct information about the photograph's origins:", "CORRECTION: This photo does not come from the Sacred Stone Camp, as I believed, knowing the ND Governor had sent National Guard troops to the area. It was taken from a protest earlier this week in Chile. So, while this young girl is not in ND, there ARE children there who clearly understand what is happening, and continue to fight for clean water and treaty rights with their families. I stand firmly behind my original words, and if inadvertently using an inaccurate photo allowed those words to be seen and shared by over 50K people, then more power to FB. Why doesn't anybody share my cat memes like this?", "While \"Bc EchoHawk\" admitted the mistake, this photograph is still being widely shared with along with the incorrect claim that it was taken in North Dakota and not Chile.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]