["On November 9, 2019, India’s Supreme Court issued a decision on a long-running ownership dispute over a religious site in Ayodhya, a north Indian city in the state of Uttar Pradesh. Here is an AFP report over the court’s ruling.", "The purported advisory was shared here on Facebook on the same day -- November 9, 2019 -- and claims to set out 12 new rules on communication which will come into force from November 10.", "The text of the misleading post says:", "“New rules of Ayodhya decision on new communication will be applicable tomorrow: _ *\n\t1. All calls will be recorded.\n\t2. All call recordings will be saved\n\t3. WhatsApp, Facebook, Twitter and all social media will be monitored: Tell anyone who doesn't know.\n\t5. Your devices will be connected to the Ministry system.\n\t6. Note that do not send the wrong message to anyone\n\t7. Inform your children, brothers, relatives, friends, acquaintances, etc. that they should all take care of. Do not send any objectionable posts or videos ..\n\t9. At this time it is a crime to write or send an abusive message on any political or religious issue…. Doing so can lead to arrest without warrant.\n\t10.Police will issue a notification… then cybercrime… then action will be taken.\n\t11. This is very serious.\n\tAll members of the group, organizers, ... think deeply about this topic\n\t12. Do not send an incorrect message. Notify everyone and keep an eye on this topic.\n\t13. Please Share It … Be careful of the group and beware of the group.”", "Below is a screenshot of the misleading Facebook post:", "The same message has also been shared here and here on Twitter, and in Hindi here on Facebook.", "Below is a screenshot of the Hindi text message:", "“The government or police have not issued any such directive; it’s false,” said Ashish Dwivedi, a spokesperson for the state police in the north Indian state of Uttar Pradesh, when asked about the viral text message on November 13, 2019.", "The Ayodhya Police also said here on Twitter on November 3, 2019, that the purported advisory was fake.", "कतिपय व्हाट्सएप ग्रुपों में इस प्रकार के भ्रामक मैसेज का प्रसार किया जा रहा है, जिसका #ayodhyapolice पूर्णतया खंडन करती है। कृपया इस भ्रामक पोस्ट को शेयर न करें।@dgpup @IpsAshish @adgzonelucknow @igrangeayodhya#UPPAgainstFakeNews pic.twitter.com/kwzzhNbUMD", "“The Ayodhya Police completely refutes such messages that have been shared in several WhatsApp groups. Please don't share this misleading message. @dgpup @IpsAshish @adgzonelucknow @igrangeayodhya #UPPAgainstFakeNews,” the Hindi language tweet says.", "On October 31, the Ayodhya district administration did issue a directive including some temporary restrictions on social media postings.", "Photographs of the Hindi language document were widely shared online by Indian media organisations and journalists, for example here by The Times of India reporter Rohan Dua and here by Indian fact-checking site BOOM.", "The directive orders people “not to post or forward false, misleading or provoking messages and posters” regarding the Ayodhya land case that could “disturb communal harmony”.", "According to this tweet by Indian news agency ANI, which was retweeted by Ayodhya District Magistrate Anuj Kumar Jha, the prohibition, which was issued on October 31, will stay in force till December 28, 2019.", "Below is a screenshot of the detailed directive ​issued by the local administration on October 31 and uploaded here by BOOM, with two points - on social media restrictions - highlighted in red:", "The Hindi language text says: “No person/ organisation/ group/ community/ political party is allowed to disrespect any deity or saint of any religion/sect or community directly or indirectly on any social media platforms, like WhatsApp, Facebook, Messenger, Instagram, Hike, Telegram, Twitter etc or put any statue of god/saint without prior permission of a competent official.”", "“No person/ organisation/ group/ community/ political party is allowed to post or forward any communal/ false/ misleading/ provocative message/ article/painting on any social media platforms, like WhatsApp, Facebook, Messenger, Instagram, Hike, Telegram, Twitter etc. Also, no one is allowed to share, post or like social media posts/ message/ photo prone to spread rumours and disturb communal harmony.”", "The directive does not contain any provisions that allow local authorities to record all calls, save all telephone recordings, or connect all devices “to the Ministry system” as is claimed in the misleading purported advisory.", "The state police chief also issued a similar appeal, calling on people not to post or forward misleading messages regarding the court’s verdict, here on Twitter on November 9, 2019.", "@dgpup द्वारा अफवाहों से बचते हुए शांति-व्यवस्था बनाए रखने की अपील की गयी है. उत्तर प्रदेश पुलिस के सभी अधिकारी और कर्मी अपने अपने क्षेत्रों और पॉइंटों पर मुस्तैद हैं. pic.twitter.com/RpgwXjK6HV", "Ahead of the Ayodhya verdict, local authorities boosted security and deployed teams of people to monitor social media, according to this report by AFP.", "At least 77 people have been arrested over social media comments deemed to threaten “communal harmony” after the court verdict, according to this AFP report.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]