["About this rating", "In November 2020, a video supposedly showing a large elephant seal crawling down the road in a small town in Chile went viral on social media:", "https://gfycat.com/plasticillfatedbaleenwhale", "This is a genuine video.", "According to the Latin American news outlet Infobae, this footage was taken in October, and shows a two-ton elephant seal who got lost after coming ashore, and soon found itself wandering through the the suburbs of Puerto Cisnes, Chile.", "Here's another video of this elephant seal in the Chilean town:", "The Guardian reported:", "On Monday night, the residents of Puerto Cisnes, a coastal town 1,500km (932 miles) south of the capital, were treated to the decidedly un-swanlike spectacle of a two-tonne elephant seal hauling itself through their neighbourhoods at a surprisingly decent clip.", "[...]", "“I was a bit startled to begin with, but because they move slowly, I calmed down and told my son to film it,” a local woman called Antonia told the Argentinian online newspaper Infobae. “I’d never seen one so close up – and certainly never in the middle of town. We see these animals quite far out at sea and so we don’t know much about them. You don’t know if they’re dangerous or if they could attack someone. But what we saw here was that the animal was scared.”", "The elephant seal eventually found its way back to the beach with the help of the Chilean Navy. A group of people surrounded the large animal with strips of black tarpaulins, and then guided it toward the water.", "Local news outlet La Vanguardia reported the following (translated via Google):", "\"The residents of the place alerted the police who, in turn, notified the Chilean Navy. Fifty people participated in the rescue of the animal, a job that took many hours, but ended with a happy ending for the elephant seal, which was able to return safely to the sea.\"", "Here's a video of the rescue mission:", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]