["About this rating", "Voting in the 2020 U.S. Election may be over, but the misinformation keeps on ticking. Never stop fact-checking. Follow our post-election coverage here.", "During a violence-filled weekend of protests by supporters of U.S. President Donald Trump, conspiracy theorist Alex Jones made statements about Trump's soon-to-be successor, President-elect Joe Biden, which some observers interpreted as a threat.", "The statement by Jones, who runs the conspiracy trolling network Infowars, was made on Dec. 12, 2020, during a rally in Washington, D.C. by Trump supporters protesting the results of the presidential election, which they claimed was rife with fraud. Four people were stabbed and one person was shot during the weekend's protests. Dozens were arrested.", "\"I don't know who's going to the White House in 38 days but I sure know this,\" Jones screamed into a microphone. \"Joe Biden is a globalist, and Joe Biden will be removed one way or another.\"", "The commentary was captured on video and posted to Twitter by journalist Zachary Petrizzo:", "Jones is a longtime and prolific promoter of conspiracy theories on his Infowars platform, which he also uses to hawk herbal supplements. He has been sued by the family members of the young children murdered by a mass shooter at Sandy Hook Elementary in Newtown, Connecticut, in 2012, for aggressively promoting the narrative that the shooting was a hoax.", "The conspiracy theory promoted by Jones resulted in the families of those children being targeted with death threats, stalking, and harassment from Jones's followers. At least two people have been arrested for crimes associated with harassing victims' families because of the hoax conspiracy theory.", "The term \"globalist\" is a reference to an overarching conspiracy theory often promoted by Jones which posits that a secret cabal of powerful people is plotting to subvert U.S. sovereignty. The word is often used as an anti-Semitic slur.", "Trump's own administration has undermined Trump's persistent claims that the election, which he lost by an estimated 7 million votes and 74 electoral college points, was fraudulent, stating that it was in fact the most secure election in American history.", "Nevertheless, Trump and his supporters have continued to push the false claim, even as various public officials targeted by his ire have stated that resulting anger from Trump's supporters against them is growing more threatening and potentially violent.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]