["About this rating", "Following President Donald Trump's press conference on 15 August 2017, many observers initially believed that the president had referred to white supremacists who marched in Charlottesville, Virginia three days earlier as \"us.\"", "Critics of the speech cited a transcript published by the news web site Politico that initially read:", "Okay, what about the alt-left that came charging at us – excuse me – what about the alt-left that came charging at the, as you say, the alt right? Do they have any semblance of guilt?", "But footage from the press conference shows that Trump's audio appears to cut out around the moment he refers the \"alt-left\" (at about the 0:34 mark of the following video):", "Politico revised its transcript and added this correction:", "CORRECTION: An earlier version of this transcript quoted Trump as saying, \"Okay, what about the alt-left that came charging at us – excuse me.\" In a review of the audio, we could not definitively discern Trump's exact words at that moment in the news conference. The transcript has been updated to now read: \"Okay, what about the alt-left that came charging at [indiscernible] – excuse me.\"", "A separate transcript released by CNBC also reflects the lack of clear audio at that moment in the press conference.", "Trump: OK. What about the alt-left that came charging at-", "[Indistinct.]", "Trump: Excuse me, what about the alt-left that came charging at the, as you say, the alt-right. Do they have any semblance of guilt?", "[Cross talk. Reporters shout questions.]", "We contacted the White House press office, as well as CNN producer Elizabeth Landers and senior White House correspondent Jim Acosta -- both of whom attended the press conference -- seeking clarification, but have yet to receive a response.", "Politico. \"Full Text: Trump’s Comments on White Supremacists, ‘Alt-Left’ in Charlottesville.\" 15 August 2017.", "Wang, Christine and Breuninger, Kevin. \"Read the Transcript of Donald Trump's Jaw-Dropping Press Conference.\" CNBC. 15 August 2017.", "\"Trump: Both Sides to Blame for Charlottesville.\" YouTube, uploaded by Associated Press. 15 August 2017. https://youtu.be/j9AYhdKTe1w", "Arturo Garcia is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]