["A Facebook page called “Australians For Australia”, which has nearly 20,000 followers, shared the two screenshots in this post dated June 5, 2019.", "The post’s caption says: “When being ‘Woke’ crosses the line…”", "According to this dictionary definition, “woke” means: “Alert to injustice in society, especially racism”.", "Below is a screenshot of the misleading post:", "The first image contained in the misleading post shows a tweet from an account called “Nintendo of America” with an illustration of Mario and Luigi, characters created by Japanese video game giant Nintendo, kissing on the lips.", "“Happy #PrideMonth! Our staff is filled with people of all sexualities so we love supporting that,” says the caption on the tweet.", "June was chosen as Pride Month in the US in commemoration of the Stonewall riots, a series of pro-LGBT demonstrations held in New York in June 1969; here is a US government web page about the initiative.", "Spliced under the screenshot is an image of another supposed tweet that says: “Ain’t they brothers?”", "Below is a screenshot of that part of the misleading post:", "The second screenshot in the misleading post purports to show a tweet by Shigeru Miyamoto, the game designer who created the Mario series for Nintendo.", "Here is his IMDb profile and here is a 2010 New York Times article about him.", "“Saw a picture of Mario and Luigi kissing one another online. Please do not do that,” says the tweet, purportedly posted on April 24, 2014 by the account @RealShigeruM.", "Below is a screenshot of that section of the post:", "The same two screenshots were also retweeted hundreds of times after being shared on Twitter here.", "Neither of the tweets shown in the misleading post are from genuine, verified accounts.", "Former deputy assistant to US President Donald Trump, Sebastian Gorka, appeared to have believed the false tweet by @NIntedoAmerica.", "News site Indy100 reported here on June 7, 2019, that Gorka shared the Mario-Luigi kissing picture and wrote in a now-deleted tweet, stating: “So @NintendoAmerica is promoting incest now?”", "The image of Mario and Luigi kissing purports to be from a Twitter account called Nintendo of America, with the handle @NIntedoAmerica.", "However, the verified Nintendo of America Twitter account here has a similar but differently spelled handle: @NintendoAmerica.", "Twitter’s blue verified badge, which the social network says “lets people know that an account of public interest is authentic”, is present on Nintendo of America’s official account, but not on the one in the misleading post.", "Below is a screenshot comparison of the Twitter account details in the misleading post (L) and the official Nintendo of America account (R), with the discrepancies highlighted in green:", "A search in the online history of the verified Nintendo of America account from June 1 to 7, 2019, using this advanced search query, finds no such image or statement in support of Pride Month.", "This Twitter account with the handle @realShigeruM has been suspended for violating Twitter rules.", "Below is a screenshot of the account:", "Reports about the @RealShigeruM Twitter account on video game website Kotaku here and tech news blog Tech Digest here say that Miyamoto is not on Twitter and the profile is a parody account.", "The Tech Digest article says, in part: “Shigeru Miyamoto, creator of Mario, Legend of Zelda, and the man responsible for most of the joy in your childhood, isn’t on Twitter – but he is represented in the form of parody account @RealShigeruM. We don’t know who is behind the account, but it is brilliant – here’s our pick of the funniest tweets.”", "No verified accounts appear in this Twitter search for the name Shigeru Miyamoto, but there are several other profiles with the words “parody account” in their bio.", "Other similar false tweets and claims are being shared across social media, for example here on Twitter by an unverified account called “Nintendo News Network”, here on Facebook and here on far-right social network Gab.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]