["In this still image taken from video, Rep. Joe Kennedy III delivers the Democratic response to President Donald Trump's State of the Union, at Diman Regional Vocational Technical High School in Fall River, Mass., Tuesday, Jan. 30, 2018. (AP)", "In his Democratic response to President Donald Trump’s State of the Union address, U.S. Rep. Joe Kennedy III talked about the immigrant roots of a city in his Boston-area district.", "\"We are here in Fall River, Massachusetts, a proud American city,\" Kennedy said, speaking from a vocational technical high school. \"An American city built by immigrants.\"", "Breitbart, a conservative website formerly run by Steve Bannon who served as Trump’s strategist, fired back at Kennedy’s description of the city.", "\"No, Fall River, Massachusetts was not 'built by immigrants,' \" stated the headline. \"Fact-Check: Mostly False.\"", "We decided to do a fact-check of our own of Breitbart’s claim.", "Facebook users flagged the post as being potentially fabricated, as part of the social network’s efforts to combat fake news. We found the Breitbart story glosses over the role of immigrants in the city’s history.", "As evidence, Breitbart wrote that Fall River was established in the 1600s by English settlers \"who were not ‘immigrants’ but colonists.\"", "Breitbart wrote that a native-born family, the Bordens, ran a mill in what became the town before and after the American Revolutionary War. Industrialization began when Col. Joseph Durfee, a native-born Revolutionary War hero built the first factory in 1811. Breitbart said that immigrants arrived at the end of the 19th century.", "Breitbart has a point that English settlers arrived before other immigrant groups, but when the town truly took off due to the textile mills, it was waves of immigrant labor that fueled the growth.", "We interviewed Bridgewater State University professor Philip Silvia who wrote his dissertation on local history, The Spindle City: Labor, Politics and Religion in Fall River (1870-1905). Silvia has taught courses on Fall River’s immigrant and labor history.", "Fall River was settled by English immigrants in the 1600s when few people lived in the area, Silvia said. But ultimately, \"it attracted immigrants like no other place,\" Silvia said.", "Fall River became prominent in the 19th century when textile factories were constructed. The mills drew various waves of immigrants from different nationalities, including the English and the Irish.", "Fall River incorporated as a town in 1803 and as a city in 1854.", "The real surge occurred after the Civil War when Fall River became the pre-eminent textile city in the United States, fueling a massive influx of immigrant workers.", "A gigantic wave came from French Canada, the largest immigrant group for decades.", "\"Technically one could argue it wasn’t immigrants supplying the capital who built the mills, but without workers, the mills would not have succeeded as they did,\" Silvia said.", "Breitbart pointed to immigrant statistics in 1910 and wrote that immigrants \"never made up a majority of the population of Bristol County, where Fall River lies, even at their early 20th Century peak.\"", "But Silvia, who wrote his dissertation on the topic, said that by 1875, more than half of the population was foreign born.", "By the 1870s, three-quarters of the mill population were immigrants and that population climbed even higher.", "Eventually immigrants included those who were Portuguese, Italian, Polish, Jewish and Scottish. Later waves came from Vietnam and Cambodia.", "Around 1900, there were 18 ethnic groups in the city.", "\"It is an immigrant city,\" he said.", "Kennedy’s spokesman pointed to an article by the local newspaper that covers Fall River, The Herald News, documenting visible signs around the city that show its immigrant history.", "\"From the Fabergé egg-shaped bell towers of St. Anne’s Church to the Portuguese bakeries that line Columbia Street, Fall River would not be Fall River without its immigrants...,\" stated the newspaper following Breitbart’s article about Kennedy’s speech. \"Fall River’s notable churches and many of its landmarks were built by the people who began arriving on its streets in the mid-19th century from Ireland, Canada, Italy, Lebanon, Poland and Portugal, and in recent years from Brazil, Syria, Haiti, Cambodia and elsewhere.\"", "As of 2016, about 18 percent of the city’s population of 90,000 is foreign born, according to the U.S. Census.", "We attempted to reach Breitbart and did not get a reply.", "Breitbart wrote that, \"Fall River, Massachusetts was not 'built by immigrants.' \"", "English settlers first established Fall River in the 1600s when it was sparsely populated. But Breitbart gives short shrift to the role waves of immigrants played in growing the community as it turned into a prominent textile city in the 1800s.", "We rate this claim False.", "Breitbart, \"No, Fall River, Massachusetts was not built by immigrants,\" Jan. 30, 2018", "Secretary of the Commonwealth, Massachusetts City and Town", "Massachusetts Secretary of the Commonwealth, Incorporation and Settlement Dates, Accessed Jan. 31, 2018", "U.S. Census, Quick Facts Fall River, 2016", "Herald News, \"Fall River fires back after taking hits following Kennedy speech,\" Jan. 31, 2018", "Southcoast Today, \"Professor’s roots run deep with history Philip Silvia,\" July 17, 2008", "Digital Commonwealth, \"First cotton mill of Fall River, Mass. built by Col. Joseph Durfee in 1811, Fall River, Mass.,\" Accessed Jan. 31, 2018", "New York Times, \"In reply, a bilingual salvo From Kennedy,\" Jan. 31, 2018", "New York Times, \"Massachusetts City Plans To Destroy Public Housing,\" April 2, 2001", "Interview, Dennis Binette, Fall River Historical Society assistant curator, Jan. 31, 2018", "Interview, Philip Silvia, Bridgewater professor Jan. 31, 2018", "Interview, Dan Black, U.S. Rep. Joe Kennedy spokesman, Jan. 31, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]