["By Angelo Fichera", "Posted on November 20, 2019", "Social media posts falsely claim that California Gov. Gavin Newsom is House Speaker Nancy Pelosi’s nephew, and that Rep. Adam Schiff has a sister who is married to the son of George Soros. It also falsely states that a daughter of former Secretary of State John Kerry is married to a “mullah’s son in Iran.”", "Viral posts circulating on Facebook claim to show supposed marriages and family relationships among, and between, political and media figures — but they advance several falsehoods and also present some outdated information.", "The images, repeatedly posted and shared thousands of times, first advance false claims about the families of three prominent Democrats — House Speaker Nancy Pelosi, Rep. Adam Schiff and former Secretary of State John Kerry.", "“Yes, Gavin Newsom is Nancy Pelosi’s nephew,” the posts begin, falsely drawing that relation between Pelosi and Newsom, the California governor. It then falsely says “Adam Schiff’s sister is married to George Soros son” — a claim we’ve debunked before — and that Kerry’s “daughter is married to a ‘mullah’s son in Iran.”", "Here are the facts about those three claims.", "Pelosi and Newsom", "There are ties between the Pelosi and Newsom families — both prominent California families — that go back several decades, as outlined in a recent commentary piece published by the nonprofit journalism venture CalMatters. But Nancy Pelosi is not Gavin Newsom’s aunt. In reality, Nancy Pelosi’s brother-in-law, Ron Pelosi, was married to the late Belinda Barbara Newsom, who was Gavin Newsom’s aunt.", "In other words, Pelosi’s brother-in-law was the uncle (through marriage) of Gavin Newsom. But Barbara Newsom and Ron Pelosi divorced decades ago, in 1977, and Barbara Newsom died in 2008.", "Kerry’s Daughter", "The claim that Kerry’s “daughter is married to a ‘mullah’s son in Iran” is also bogus.", "Kerry’s daughter, Vanessa, is married to Brian Nahed, a neurosurgeon. Nahed is of Iranian descent, but he was born in the United States. According to the couple’s wedding announcement in the New York Times in 2009, Nahed’s father, M. Reza Nahed, is a pulmonologist in California, who operates a private practice managed by his wife — and Brian’s mother — Nooshin P. Nahed. M. Reza Nahed graduated from Tehran University of Medical Sciences and Health Services in 1974, and received his medical license in California in 1979, according to state medical board records.", "Both Brian Nahed and Vanessa Kerry, in interviews with FactCheck.org, said the description of the elder Nahed as a “mullah in Iran” was a fabrication. The term in Iran typically describes a Muslim clergyman.", "“That is false,” Kerry said, reiterating that her father-in-law is a “devoted doctor” who lives in California and has been in the U.S. since the 1970s.", "Moreover, Brian Nahed said, “my parents aren’t religious at all.” Nahed added that his parents immigrated before the Iranian Revolution and haven’t returned since; both Vanessa Kerry and Brian Nahed also said they have never been to Iran.", "In 2015 — when then-Secretary of State John Kerry helped negotiate the Iran nuclear agreement — online rumors wrongly claimed that the son of Iran’s foreign minister had been the best man at the couple’s wedding years earlier, which Vanessa Kerry publicly debunked. Nahed said similar falsehoods have continued to resurface. “Every once in awhile — maybe once a year — you’ll see it flare up,” he said.", "“It’s been incredibly frustrating,” Kerry said of the continued flow of misinformation. “It’s really an invasion of the privacy of my in-laws. They never signed up for a political life.”", "Kerry is the co-founder and CEO of a Boston-based nonprofit aimed at improving the health profession around the world. Brian Nahed works at Massachusetts General Hospital.", "Schiff and Soros", "The claim that Schiff’s “sister” is married to the son of George Soros — a billionaire philanthropist known for funding liberal causes and who is often the subject of falsehoods — is also bogus. As we’ve previously written, Schiff doesn’t even have a sister. The falsehood is born out of the fact that Soros’ son, Robert, was once married to a woman who also had the last name Schiff.", "Media Ties", "The posts then proceed to list a half-dozen family relationships it presents as proof that “the news system” is “rigged.” That same list — which accurately depicts relationships between members of the media industry and former members of the Obama administration — has circulated since 2016.", "At this point, though, some of the information is outdated. For example, David Rhodes — the brother of former Obama deputy national security adviser Ben Rhodes — is no longer the president of CBS News. And Ben Sherwood — whose sister, Elizabeth Sherwood, was a deputy secretary of energy under Obama — recently left his post as president of Disney/ABC Television Group.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "“Ben Rhodes.” Wilson Center. Accessed 19 Nov 2019.", "“Dr. Elizabeth Sherwood-Randall.” U.S. Department of Energy. Accessed 19 Nov 2019.", "Gore, D’Angelo. “Adam Schiff and George Soros Not In-Laws.” FactCheck.org. 8 Feb 2018.", "Guthrie, Julian. “Belinda Barbara Newsom dies at 73.” SFGate.com. 24 Nov 2008.", "Kerry, Vanessa. Phone interview with FactCheck.org. 20 Nov 2019.", "Mallozzi, Vincent M. “Vanessa Kerry, Brian Nahed.” New York Times. 9 Oct 2009.", "Nahed, Brian. Phone interview with FactCheck.org. 20 Nov 2019.", "U.S. State Department. “Interview With Siamak Dehghanpour of Voice of America Persian.” Transcript. 20 Mar 2014.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]