["The blog article, dated March 27, 2019, was published here on the website k0mpasinf0.blogspot.com – whose name and logo “KompasInfo” resembles that of Indonesian news organisation Kompas, online here with a different URL at kompas.com.", "The article’s main photo shows Indonesia’s coordinating minister for maritime affairs, Luhut Binsar Pandjaitan. Its headline, translated into English, says:", "“Jokowi administration offers Bogor city to China; Luhut: Hey people, you can’t object and don’t meddle in this issue!”", "Bogor refers to a major city, and separately also a district, south of the capital Jakarta. Jokowi is the nickname of Indonesia’s President Joko Widodo, who is seeking re-election in April 17 polls. Here is his official Twitter account.", "Below is a screenshot of the blog post:", "A screenshot of the blog article showing its headline and main picture has been shared hundreds of times in multiple Facebook posts, for example here, here and here, where it has been shared more than 650 times since being published on March 27, 2019.", "Below is a screenshot of one of the Facebook posts, whose caption says, when translated, “Who does this country belong to? Think, Grandpa..!!”:", "The blog post falsely represents Kompas – a national newspaper in publication since 1965, according to this Kompas article. It is owned by the media company Kompas Gramedia, here is its website.", "The URL of the blog is “k0mpasinf0.blogspot.com”. This is clearly different from the Kompas URL: kompas.com.", "The logo in the top left-hand corner of the “KompasInfo” site resembles the logo used on kompas.com.", "Below is an image comparing the two sites’ URLs and logos:", "Searching for the blog post’s first paragraph on Google led to this March 27, 2019, news report by Bogor-based local newspaper Radar Bogor.", "The entire text of the Radar Bogor report has been copied into the misleading blog article, but the headline is different.", "When translated, the original report’s headline states: “Jonggol district ‘sold’ to China; Ade Yasin: I don’t know about that.” Jonggol is a subdistrict of Bogor district, and Ade Yasin is the current regional head of Bogor.", "Below is a screenshot of the Radar Bogor report:", "The first two paragraphs of both the Radar Bogor report and the misleading blog article say:", "“The Indonesian government will offer 28 projects worth US$91.1 billion, which equals to 1,295.8 trillion rupiah, to the government of China at the second high-level Belt and Road Initiative or the Silk Road conference in April.", "“One of the 28 proposed projects would be located in Jonggol subdistrict in Bogor district as the Indonesia-China special economic zone.”", "The coordinating minister for maritime affairs, Luhut Pandjaitan, is Jokowi’s point man in negotiating investment with China. The report about his appointment can be read here.", "Radar Bogor did cite the senior minister in its story, but he was not quoted as saying: “Hey people, you can’t object and don’t meddle in this issue!”", "According to the paper, Luhut said the Indonesian government wouldn’t give any special treatment to China and they have to satisfy requirements like other foreign investors.", "“First, every investor who wants to make an investment has to bring the best technology from the country of origin. We don’t want second-class technology, we want investors bringing technology that is environmentally friendly,” he said.", "The Indonesian information ministry also released a statement here on March 28, 2019, saying that Luhut’s quote in the headline of the misleading blog post had been fabricated.", "Below is a screenshot of the government’s denial, which includes a screenshot of the “KompasInfo” blog with the word “HOAX” superimposed on it:", "The main photo in the misleading blog post is a stock image of Luhut that has previously been used in news reports by the genuine Indonesian news site Kompas, such as this one, published July 11, 2018, and this one, published August 21, 2018.", "The image below compares a screenshot of the misleading blog post with a screenshot of the July 11, 2018, kompas.com article, showing the photos used are the same:", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]