["The claim was posted here on Facebook on October 14, 2020.", "The post was shared alongside a photo which shows an invitation to participate in a coronavirus testing research study. The letter includes logos for Ipsos MORI; UK university Imperial College London; and the UK’s Department of Health and Social Care.", "The post states: “The Name of a Covid-19 testing research company 'Ipsos MORI' Translates to 'They DIE' in Latin. Never once have they hidden their motives in History for those with Eyes to See.”", "An identical claim was also shared on Facebook here; and on Twitter here and here.", "The claim is false; the company’s name was established in 2005 after a merger between two other companies that existed decades before the Covid-19 pandemic.", "On July 20, 2020, the company said in this post on its website that the name Ipsos MORI “doesn’t mean anything.”", "“Our name - Ipsos MORI - was formed in 2005 by the merger of Ipsos, founded in France in 1975 with its named (sic) derived from the Latin phrase ‘ipso facto’ and Market and Opinion Research International (MORI), founded in the UK in 1969. This merger created our name: Ipsos MORI.”", "UK newspaper The Guardian reported on the merger between the two companies in October 2005.", "Michael Matza, who teaches Latin at the University of the Philippines, told AFP in an email on October 19, 2020 that while “Ipsos” means “themselves or they” and “Mori” means “to die”, a correct way to say “they die” in Latin is: “Moriuntur”.", "A similar misleading claim was earlier debunked by AFP here in Polish.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]