["By Angelo Fichera", "Posted on December 14, 2018", "A viral meme mocks Rep.-elect Alexandria Ocasio-Cortez for a statement about capitalism versus socialism that she never actually made.", "Since her victory in the Democratic primary in New York’s 14th Congressional District in the House, and in light of her November general election win, Alexandria Ocasio-Cortez has attracted no shortage of attention.", "Sometimes that spotlight has arrived in the form of news coverage; other times via viral deceptions.", "In the latest example of the latter, a meme made viral on Facebook with the help of singer Ted Nugent and others falsely attributes a quote about economics to Ocasio-Cortez.", "“Under capitalism, man oppresses man,” the quote reads. “Under socialism, it’s the other way around.”", "Corbin Trent, a spokesman for Ocasio-Cortez, told FactCheck.org that the representative-elect had not said that.", "Likewise, we could find no evidence Ocasio-Cortez, a democratic socialist, ever did. Instead, we came across references to that quote dating back years, well before the 29-year-old political newcomer entered the public eye.", "At a 2013 Liberty Fund event, for example, the economist Russell Roberts of Stanford University’s Hoover Institution cited it in jest.", "“My view of capitalism has always been that under capitalism, man oppresses man. But under socialism, it’s the other way around,” he said to laughter. “It’s not my line. I’m told it came from MAD Magazine. And to be honest, it’s not my view—but it does capture the reality that all political and economic systems are imperfect.”", "Others have traced it, or some iteration of it, back to the late economist John Kenneth Galbraith.", "In 2006, the Atlantic reported:", "Another remark often attributed to Galbraith is, “Under capitalism, man exploits man. Under communism, it’s just the opposite.” If he didn’t say it, he might as well have. It has an authentically Galbraithian ring: It seems profound, and it’s funny. But it encapsulates perhaps the worst error that a student of economy and society could have made in the past century—the idea that, under the surface, those two systems are pretty much alike, not least ethically. The common man has no standing, no real power, in either case. The main difference resides in which small group of people is actually in charge. That is something that Galbraith certainly appeared to believe. It is a main theme of his writings. And it is a travesty of the truth.", "Appearing on Twitter in recent weeks, as well, the misattributed quote has been shared thousands of times across social media. Nugent’s Facebook post of the meme alone garnered nearly 15,000 shares.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on the social media network.", "“Capitalism, Government and the Good Society.” EconStories. YouTube.com. 4 Sep 2013.", "Crook, Clive. “John Kenneth Galbraith, Revisited.” The Atlantic. May 2006.", "Trent, Corbin. Spokesman, Alexandria Ocasio-Cortez. Phone interview with FactCheck.org. 14 Dec 2018.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]