["About this rating", "In February 2021, an online advertisement appeared to announce that Netflix had canceled the popular series \"Cobra Kai\" even though just weeks earlier, the streaming service had just released Season 3 on New Year's Day.", "The show is a faithful follow-up to the 1980s \"The Karate Kid\" movie franchise. Stars from the original films returned for the Netflix series.", "The startling ad was headlined \"Netflix Cancellations: Effective Immediately\" and featured a picture of actor Ralph Macchio, who portrayed Daniel LaRusso in the original \"Karate Kid\" films as well as \"Cobra Kai.\" On the left was William Zabka, who also returned as Johnny Lawrence:", "This ad was misleading, as Netflix had not canceled \"Cobra Kai.\" Readers who clicked on the ad were led to a lengthy slideshow story on the website The Delite which, despite the headline promise of a list of \"Netflix cancellations,\" was also about show renewals. The ad and story were basically a bait-and-switch.", "\"Cobra Kai\" was far from canceled. In fact, Netflix renewed (link contains spoilers) the series for a fourth season before season 3 was released.", "Jon Hurwitz, one of the showrunners, said that a release date hadn't yet been set for season 4. However, he tweeted he \"would imagine season 4 will come out roughly a year after season 3.\" This meant perhaps that new episodes of \"Cobra Kai\" will be on the way by early 2022.", "On Jan. 12, 2021, after season 3 was released, \"On Air with Ryan Seacrest\" interviewed Macchio, who in addition to portraying Daniel also served as a co-executive producer. Seacrest asked Macchio about season 4:", "https://www.youtube.com/watch?t=238&v=CMXVqwZrsU0", "Seacrest: \"And are you, you said you're on location, are you shooting new episodes of ['Cobra Kai'] or something else right now?\"", "Macchio: \"We are prepping ['Cobra Kai'], and, but we're waiting for the green light, you know, in this COVID world to actually move forward.\"", "The first two seasons of \"Cobra Kai\" previously debuted on YouTube Red, the name of which was later changed to YouTube Premium. Season 3 debuted on Netflix, where it found a new home.", "Hurwitz, one of the showrunners, tweeted that he was \"floored\" by the massive popularity of the series on Netflix:", "In sum, \"Cobra Kai\" was not canceled. The show gained newfound popularity after it became available on Netflix, as opposed to its early days on YouTube Red, and Season 4 is on the way (link contains spoilers) and will likely be ready to stream in 2022.", "Snopes debunks a wide range of content, and online advertisements are no exception. Misleading ads often lead to obscure websites that host lengthy slideshow articles with lots of pages. It's called advertising \"arbitrage.\" The advertiser's goal is to make more money on ads displayed on the slideshow's pages than it cost to show the initial ad that lured them to it. Feel free to submit ads to us, and be sure to include a screenshot of the ad and the link to where the ad leads.", "Jordan Liles is a Senior Reporter who has been with Snopes since 2016.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]