["About this rating", "A video purportedly showing Jay-Z punching a young girl gets passed around the internet from time to time, in an apparent attempt to smear the musician.", "When Jay-Z performed a concert to benefit Hillary Clinton in November 2016, for instance, this 3-second clip was shared along with the dubious claim that it showed the musician striking an underage girl at the rally. The clip was circulated a few months later with similar claims after Jay-Z criticized President Trump for his alleged \"shithole\" remark about African countries. It was also shared in previous years as if it showed Jay-Z punching a 12-year-old girl for trying to hug him or slapping an underage girl for taking his picture:", "This footage is real, but the claims frequently attached to it seem to be made up out of whole cloth.", "The websites and social media accounts sharing this video frequently post it as if they were privy to specific details about the encounter (such as the age of the girl or the reason for the altercation), yet information about where and when this incident occurred is almost always neglected.", "The provided details also change with each posting: Is the girl 12? Is she a teenager? Did she try to hug Jay-Z or take his picture? Whatever the situation, it's difficult to verify based solely on the images in this 3-second clip. Of course, that's problematic as we never actually get a good look at the \"victim\" in this video, and its limited runtime provides little to no context about the encounter.", "When we searched for more information about this clip, we found that the person in the video was an adult, not a child, that they were an old friend and employee, not a fan, and that all parties involved said that the altercation was friendly in nature.", "This clip first appeared in a 2000 documentary called Backstage about Jay-Z's Hard Knock Life Tour, but it didn't start creating controversy until it was picked up by music gossip web sites in 2004. Again, the footage was shared with sensational claims about what it showed, yet provided little in the way of context:", "Apparently Jay-Z had a problem with a female in a shocking video that was pulled out of the archives of the Backstage DVD by HipHopDX.", "As of this time I have yet to hear from my numerous contacts at Roc-A-Fella in regards to Jay-Z’s side to this affair.", "But, if pictures speak louder than words then Jigga-man has some explaining to do. The assault looks unprovoked as HOVA walks into what looks like a backstage area of a concert venue.", "As Mr. Carter walks into the room he has a rather irritated look upon his face and without hesitation lashes out at an unidentified female in the video. The video is brief…but, shows a lot.", "Shortly after this video went viral in 2004, Jay-Z addressed the controversy and explained that the woman in the footage was actually his good friend music executive Chaka Pilgrim, who is currently the president of Roc Nation Records, and that they were just playing. Pilgrim and director Chris Fiore backed up Jay-Z's story, with Fiore adding that the moment was poorly edited and left out footage of Pilgrim and Jay-Z smiling and hugging after the altercation:", "Jay-Z has found out what it's like to be the victim of a bad rap. The hip-hop star has come under fire because of a scene in the 2000 concert documentary \"Backstage,\" in which he appears to strike a woman who takes his picture after a performance. Jay told us last week that the woman, Chaka Pilgrim, is \"one of my best friends,\" insisting, \"We were playing.\"", "Now \"Backstage\" director Chris Fiore is corroborating that the hand-to-face smoosh was \"playful.\"", "What's more, Fiore admits to us, he left out footage where \"they both laughed and hugged\" immediately afterward.", "\"The shot in question was taken out of context by me, and was used in the film to create a sense of heightened tension at the end of the tour,\" Fiore says. Pilgrim, who works for Jay's Rocawear company, confirms they're still pals and that \"we were just playing around.\"", "We reached out to Fiore for more information about the clip and he reiterated that it was cut just before Jay-Z and Chaka hugged and laughed about the incident. He also added that the claim that the video showed an \"underage\" girl was \"disturbing\" since Chaka was Jay Z's business manager at the time:", "To me the most disturbing aspect of the clip is that Chaka is labeled an underaged girl. A diminutive, super intelligent woman who does not suffer fools lightly, she was Jay’s business manager at the time, and had been for years. They’d been through a lot together and their relationship was as much brother/sister as business partners. Like many siblings, they sometimes engaged in a little roughhouse play.", "The fact that Chaka still works for Jay two decades later says something, though, no?", "Gossip columnists Joanna Molloy and George Rush provided more details in their book Scandal: A Memoir:", "\"I can't believe that we had a nice conversation and then you turn around and run that story,\" Jay said.", "\"I can't believe that you slapped a woman in the face and you think that's okay,\" Joanna said.", "\"First of all, she's one of my best friends,\" he countered. \"Her name is Chaka Pilgrim. She works for me. And secondly, I didn't 'strike' her - I gave her a 'smoosh.' It was all set up ahead of time. She was in on it.\"", "\"Well, that's not a true documentary then,\" said Joanna. \"And I'm not the only one complaining about it\" ...", "(Joanna) talked to Chaka Pilgrim and Backstage director Chris Fiore. They both backed up Jay's story. They could have been towing his line out of loyalty or fear, but Joanna didn't think so. We ran their side of things in a follow-up story.", "It should also be noted that this clip originated in a documentary about Jay-Z and that was co-produced (according to IMDb) by Chaka Pilgrim.;", "Although the exact details of this encounter are still unclear (was the incident staged or not?), it certainly doesn't show Jay-Z punching a 12-year-old girl.", "Rush, George.   \"Jay-Z Gets Clear of Hard-Knock Strife.\"\r\n    New York Daily News.   15 June 2004.", "Hip Hop DX.   \"Jay-Z Hits Girl In Backstage!\"\r\n    15 June 2004.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]