["“बच्चों उठाने वाला गिरोह रायसिंहनगर में भी सक्रिय हुआ। रायसिंहनगर, वार्ड -24 वाल्मीकि मोहल्ले में एक औरत बच्चे को उठा के ले जा रही थी मोहल्ले वालों ने पकड़कर पुलिस के हवाले कर दिया ।आप सब लोग भी सचेत रहें। (Child-lifting gang is active in Raisingh Nagar. A woman was caught while lifting a child by the people of Valmiki neighbourhood located in ward-24 of Raisingh Nagar. You people beware. -translated)”", "On August 5, the above message was shared by a Facebook page Aapno Raisinghnagar with a video where a woman is being held captive by a mob. It is being claimed that the said incident took place in Raisingh Nagar town of Sri Ganganagar district, Rajasthan. In the video, a man can be heard raising the allegation of child-kidnapping against the woman who seems to be disoriented and remains silent for the most part.", "बच्चों उठाने वाला गिरोह रायसिंहनगर में भी सक्रिय हुआ । रायसिंहनगर, वार्ड -24 वाल्मीकि मोहल्ले में एक औरत बच्चे को उठा के ले जा रही थी मोहल्ले वालों ने पकड़कर पुलिस के हवाले कर दिया । आप सब लोग भी सचेत रहें ।", "Posted by Aapno Raisinghnagar on Monday, 5 August 2019", "A few more users on Facebook have shared the video with the same narrative.", "Alt News contacted Raisingh Nagar police to inquire about the video doing the rounds on social media. Raisingh Nagar Station House Officer Kishan Singh rubbished the claim about the woman being a child-lifter caught by the locals when he said, “The incident happened 3-4 days ago. The woman was mentally ill and unable to speak. She is was very old. People had taken her hostage on the basis of a rumour.” He further added that no FIR was lodged in the matter.", "Fact-checking website BOOM also spoke to Har Prabh Aasra Seva Samiti, an NGO based in Padampur that looks after the homeless. “She is responding well. Though she has not been able to say much about her whereabouts, she is not mentally stable,” said a member of the organization.", "In conclusion, a video of a homeless and mentally unstable woman who was falsely accused of being a child-lifter was circulated on social media to stoke the rumours that child-kidnappers are strolling across the town. Earlier as well, a video of a mentally-challenged man who taken hostage over suspicion of child-lifting by a mob in Madhya Pradesh was maliciously used to further the same rumours.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]