["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "While announcing plans to decriminalize marijuana, Gov. Tony Evers claimed 75-85% of prison inmates in Wisconsin were there for drug offenses. Evers is shown here delivering the State of the State in January 2019. Mark Hoffman/Milwaukee Journal Sentinel", "Gov. Tony Evers’ announcement that he would push to decriminalize marijuana in Wisconsin was one of the biggest splashes of his young tenure.", "It drew media coverage from across the country and sparked a war of news releases on the homefront.", "Evers said Feb. 18, 2019, that his first budget would include proposals to legalize medical marijuana; allow possession of small amounts of marijuana for personal use; and expand the ability to expunge certain drug possession convictions.", "A news release announcing the move touted the medicinal benefits of marijuana, then pivoted to making a social justice case for change.", "\"Reforming Wisconsin’s marijuana laws to align with the people’s support for medical marijuana is an important part of the governor’s plan,\" the release said. \"But so, too, is addressing the social and racial justice aspect of marijuana use. Wisconsin has the highest incarceration rate in the country for Black men, and drug-related crimes account for as many as 75-85 percent of all inmates in our prisons.\"", "Evers touted the same 75-85 percent statistic in a since-deleted tweet that day making the case for decriminalizing marijuana. It was repeated in the text of the NBC News story on Evers’ announcement.", "That’s a really high number.", "Given all the possible actions that could land a person in prison, do drug crimes really account for three-quarters or more of all inmates?", "The Wisconsin Department of Corrections uses a number of measures to track how inmates landed behind bars. But none of them are anywhere close to Evers’ number.", "A February 2017 analysis examining the point of prison admission showed 27 percent of inmates were sent to prison for a drug crime in 2016. That included opioids, cocaine, amphetamines and marijuana. Marijuana crimes accounted for 6.4 percent of prison admissions.", "Meanwhile, a point-in-time analysis done by the department showed 22 percent of Wisconsin inmates had an active drug offense in 2017 — meaning that was among the offenses for which they were serving time.", "The numbers are even lower when examining only the most serious offense for each inmate — in other words the one most likely responsible for the length of their prison stay. Only 11 percent of inmates in 2017 had a drug offense as their most serious charge.", "By comparison, a violent crime was the most serious charge for 66 percent of offenders, and a property crime for 14 percent.", "So where did Evers get his number?", "When we asked Evers’ office for the evidence behind the drug offenses claim, Deputy Chief of Staff Melissa Baldauff said they made a mistake. Evers’ staff has since removed the statistic from the online version of the news release announcing Evers’ marijuana proposal.", "Related: U.S. Sen. Tammy Baldwin strikes out on marijuana research claim", "Related: U.S. Sen. Tammy Baldwin's claim that VA doctors 'are censored' from talking about pot misses plot", "A staff member pulled the number from a 2013 WUWM radio story that attributed the number to retired Lutheran pastor Joe Ellwanger, Baldauff said. WUWM is Milwaukee’s National Public Radio affiliate.", "Ellwanger used the stat in the context of a University of Wisconsin-Milwaukee study that found Wisconsin had the highest rates of incarceration in the nation for black residents. But he was wrong.", "\"Upon further investigation, the claim as reported in the WUWM article above did not appear to have sufficient substantiation, and it should have been removed from our document,\" Baldauff said in an email. \"So, the honest answer is that staff made a mistake. We have since updated our press release online to remove that statistic and note the error.\"", "Evers’ tweet citing the statistic as proof of the need to decriminalize marijuana garnered more than 500 retweets before it was deleted several days later.", "Evers claimed in a news release and a tweet that drug-related crimes account for as 75 to 85 percent of the Wisconsin inmate population.", "That statistic was pulled from an incorrect article published six years ago.", "Current DOC data shows the actual number of prison inmates sentenced for drug offenses is a fraction of that number — about one-quarter of the prison population.", "Indeed the numbers are so far off, and the sourcing — a six-year-old article based on a radio interview that focused on a different topic — is so remote, it’s ridiculous.", "We rate the claim Pants on Fire.", "Twitter.com, Tony Evers (@GovEvers), Feb. 18, 2019", "Office of Gov. Tony Evers, Gov. Evers Announces Proposal to Reform Wisconsin’s Marijuana Laws (original), Feb. 18, 2019", "Office of Gov. Tony Evers, Gov. Evers Announces Proposal to Reform Wisconsin’s Marijuana Laws (corrected), Feb. 19, 2019", "WUWM-radio (Milwaukee NPR affiliate), Wisconsin's High Black Male Incarceration Rate Concerns Community Leaders, Nov. 11, 2013", "Wisconsin Department of Corrections, Prison Point-in-Time Populations: 2000-2016, August 2017", "Wisconsin Department of Corrections, DAI - Prison Point-in-Time Dashboards, accessed Feb. 21, 2019", "Email exchange with Melissa Baldauff, deputy chief of staff for Gov. Tony Evers, Feb. 19-20, 2019", "Email exchange with Claire Hendricks, spokeswoman for Wisconsin Department of Corrections, Feb. 19-21, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]