["The photo was published here on Facebook on February 26, 2020. It has been shared more than 24,000 times.", "Below is a screenshot of the misleading post:", "The post’s Thai-language caption translates to English as: “Live from Kasetsart University right now. Have to say don’t let this issue stay quiet. University students are not idle, uniting to disapprove of this country’s justice system. #notdesserttoppedwithcoconutmilk #NotSalim”.", "The hashtags #notdesserttoppedwithcoconutmilk and #NotSalim are a reference to the traditional Thai dessert salim, whose name has been adopted as derogatory term for the pro-establishment faction.", "Following a February 21, 2020, constitutional court ruling that ordered the dissolution of the popular opposition Future Forward Party, Thai students have held several protests against the country’s military junta. Students from Kasetsart University staged a large protest on February 29, 2020, calling for the resignation of Prime Minister Prayut Chan-o-cha. Here is an article about the protests published by Thai newspaper Bangkok Post on March 1, 2020.", "The claim in the misleading post is false; the photo has circulated online since at least December 2013 in reports about protests against Thailand’s proposed amnesty bill.", "A Google reverse image search found the same photo published here on Facebook, dated December 22, 2013.", "The caption reads: “V For Thailand / Pink Power, Chula is here!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!”", "“V For Thailand” is a reference to the anti-government movements of 2013, in which thousands took to the streets to protest against former Prime Ministers Yingluck Shinawatra and her self-exiled brother Thaksin Shinawatra.", "Protests were triggered after Thailand’s lower house under Yingluck hurriedly passed a bill on November 1, 2013, that offered blanket amnesty to Thaksin, who faced a two-year jail term for corruption should he return to the country. Thailand’s Senate unanimously rejected the bill on November 12, 2013.", "Here is a Bangkok Post report on the timeline of the bill and the protests that followed.", "The same photo was also shared here on the Thai blog Pantip.com on March 29, 2014, in a discussion about participation numbers during the 2013 anti-government protests in Bangkok.", "Below is a screenshot of the photo on Pantip.com:", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]