["The claim was made in this graphic published on Facebook here on May 18, 2020.", "The Hindi text translates to English as: “Prime minister Narendra Modi becomes WHO chairman and he assumes his role in the organization on May 22. Congratulations to everyone.”", "Similar claims were also shared on Facebook here and here; and on Twitter here and here.", "However, the claim is false.", "On May 22, 2020, Indian Health Minister Dr Harsh Vardhan was elected chair of the WHO’s Executive Board. Both the WHO and the Indian government released a statement here and here on the appointment.", "“I feel deeply honored to have the trust and faith of all of you,” Dr Harsh Vardhan said during the online WHO Executive Board session on May 22. “I will work to realize the collective vision of our organization, to build the collective capacity of all our Member nations and to build a heroic collective leadership.”", "The WHO Executive Board is composed of 34 member states that serve three-year terms. Vardhan will chair the Executive Board’s 148th session in January 2021 and hand over to the next chair at the May 2021 session, according to the WHO.", "The WHO also does not have a \"chairman” role in the organisation. The highest position is Director-General, currently held by Dr Tedros Adhanom Ghebreyesus.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]