["About this rating", "In January 2018, readers notified us that a number of news outlets had reported that a man in Fresno, California, had walked into a local emergency room carrying a 5-foot-long tapeworm he said he had pulled out of his own body after experiencing symptoms that included cramping and bloody diarrhea.", "According to the reports, the patient, a frequent sushi eater, extracted the parasite as best he could after feeling it \"wiggling\" in his intestines and wrapped it around a toilet paper tube for transport. He presented it to doctors at Fresno's Community Regional Medical Center and requested immediate treatment for \"worms.\"", "We decided to check the story out for ourselves by contacting the person named as the attending physician, Dr. Kenny Banh.", "It's all true, Dr. Banh told us, right down to the toilet paper roll.", "\"I have seen and treated intestinal worms and parasites before, but never had a patient bring in a giant tapeworm,\" he said in an e-mail.", "By \"giant\" he means five-and-a-half feet long. The tapeworm had a flat, skinny body, tan in color, with narrow, dark brown lines down its back and \"a big, flat head.\"", "Tapeworms are a type of parasitic flatworm (also called cestode) most often taken into the body by eating contaminated raw meat or fish. They reside in the digestive tracts of infected human beings or nonhuman animals, where they hold themselves in place using the suckers on their heads, and they may or may not cause noticeable symptoms ranging from abdominal discomfort to intestinal blockage. They can grow to more than 30 feet in length.", "What was Banh's first thought when he saw the creature?", "\"Very cool,\" he said. \"People asked if it was disgusting, but as an EM physician I see much worse. This was more geeky scientifically interesting — though funny, as it was wrapped around a toilet paper roll.\"", "Treatment for tapeworms in humans is fairly simple: usually a single dose of an oral antihelminthic, a drug that kills the worms, \"similar to the deworming medication you give your pet dog,\" Banh says.", "Of greater concern to the patient was figuring out how he contracted the tapeworm in the first place. He hadn't been exposed to parasitic infection by travel, or by drinking contaminated liquids, or by eating raw meat, he was sure — which really only left one possibility: sushi. The patient said he eats a lot of sushi — daily, in fact — and his favorite dish is salmon sashimi.", "A bit of Googling confirmed that he was probably right. The Centers for Disease Control (CDC) issued a research letter in January 2017 noting that the Japanese broad tapeworm (Diphyllobothrium nihonkaiense) has been detected in wild salmon caught along the U.S. and Asian Pacific coasts and that it therefore poses \"potential dangers for persons who eat these fish raw.\"", "For any salmon sashimi addicts reading this, that doesn't mean you have give up your habit on pain of contracting a tapeworm infection, but it does mean you need to make sure the raw salmon you consume has been handled properly. Freezing kills parasites, which is why the U.S. Food and Drug Administration (FDA) requires that all fish be frozen before it can be served raw anywhere in the United States.", "If you're not confident your favorite sushi restaurant sources and handles its fish in accordance with the law, we trust our little cautionary tale will inspire you to seek out one that does.", "Dadourian, Melanie.   \"Five-Foot-Long Tapeworm Came 'Wiggling Out' of Man's Body After He Ate Sushi.\"\r\n  Fox News.  18 January 2018.", "Kuchta, Roman et al.  \"Diphyllobothrium Nihonkaiense Tapeworm Larvae in Salmon from North America.\"\r\n  Centers for Disease Control.  February 2017.", "Encyclopedia Britannica.  \"Tapeworm — Parasitic Flatworm.\"\r\n  1 December 2017.", "LiveScience.   \"Is Sushi Safe to Eat?\"\r\n  3 October 2012.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]