["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "CNN's Jim Acosta walks on the North Lawn driveway upon returning back to the White House in Washington, Friday, Nov. 16, 2018. (AP)", "A Facebook post is trying to trick you into a click by placing the headline \"CNN Journalist Of The Year Fired For Creating Fake News Stories\" next to an image of CNN's Jim Acosta.", "Don't do it.", "The person fired wasn't Acosta, CNN's White House correspondent who made waves in November after a testy exchange with President Donald Trump. The person at the center of the story isn't even a CNN journalist.", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Claas Relotius, an award-winning reporter and editor for Der Spiegel, the biggest weekly news magazine in Germany, resigned Dec. 17 after the organization found he falsified articles on a \"grand scale and even invented characters, deceiving both readers and his colleagues,\" the newspaper announced.", "Der Spiegel said Relotius confessed he had made up material in at least 14 articles since 2011.", "In 2014, CNN named Relotius the Journalist of the Year and Print Journalist of the Year. The awards were for German-language journalism and decided by an independent jury. The last awards were given in 2015, CNN reported.", "In a statement to the Associated Press, CNN International said the independent panel of judges who awarded Relotius the awards decided unanimously to remove them following revelations about his fraud.", "The story about the incident on the website The Federalist Papers isn't inaccurate. But it includes a purposively deceptive image of a top CNN correspondent to bait readers on Facebook into clicking on the story itself. Readers seeing the post caught the deception, but only after clicking on the item.", "\"Carolyn McKnight Langdon Wow, the hypocrisy.... Isn't putting the face of Acosta on this article link (about a German reporter) equal to the kinds of Truth spinning shenanigans CNN is often accused of?\"\n\n\"Ellie Merritt How much more misleading can you get? Had I not seen the Federalist banner, I would have sworn this was another misleading CNN article. Shame on you.\"", "\"Chris Domenico Dang it....ya got me. I kept telling myself \"don’t click, it’s not what you think\", yet I clicked. Hat’s off to you....\"", "A story from The Federalist Papers with the headline \"CNN Journalist Of The Year Fired For Creating Fake News Stories,\" is being shared on social media with a photo of CNN reporter Jim Acosta.", "The post is misleading clickbait. Acosta has nothing to do with the story, and the journalist fired doesn't work for CNN. Readers caught on to the gimmick if they read the full story.", "Overall, we rate this claim Half True.", "TheFederalistPapers.org \"CNN Journalist Of The Year Fired For Creating Fake News Stories,\" Dec. 19, 2018", "New York Times, \"CNN’s Jim Acosta Returns to the White House After Judge’s Ruling,\" Nov. 16, 2018.", "Der Spiegel, \"The Relotius Case: Answers to the Most Important Questions,\" Accessed Dec. 20, 2018", "Associated Press, \"German reporter stripped of CNN awards over fraud,\" Dec. 20, 2018", "Australian Broadcasting Corporation, \"German news magazine Der Spiegel sacks star reporter Claas Relotius for fabricating stories,\" Dec. 19, 2018", "MSN.com, \"Winner of CNN's 'Journalist of the Year' Award Admits He Fabricated Stories,\" Dec. 19, 2018", "Huffington Post, German Reporter At Der Spiegel Fired For Fabricating Stories ‘On A Grand Scale’, Dec. 20, 2018", "CNN, \"Germany's Der Spiegel says star reporter Claas Relotius wrote fake stories 'on a grand scale',\" Dec. 20, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]