["About this rating", "A photograph of an illuminated igloo is often shared on social media along with the claim that \"this is what an igloo looks like when you build a fire inside\":", "This is a genuine photograph of an illuminated igloo. However, the light source is not a fire built inside this snowy structure. It's actually a flashlight.", "This picture was snapped by Ukrainian photographer Volodymyr Shevchuk in the Carpathian Mountains circa 2015. While we couldn't find this exact image on Shevchuk's social media profiles, he has posted several other photographs of this illuminated igloo to both his Instagram and Facebook pages:", "Коли кілька днів сидиш на одному місці і треба себе чимось зайняти... ❄️?️❣️Карпати. Україна А ви хотіли би тут переночувати? __________ When you sit in one place for a few days and tray something to take yourself... ❄️?️❣️ Carpathian mountains. Ukraine Would you like to stay here? __________ #nikon d90 nikkor 16-85 ▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️ . @vova_shevchuk_travel . #igloo #shelter #realigloo #winter #winterlove #mountains #hiking #winterhiking #ukrainiantravelers #snow #carpathiangram #carpathian #nightphotography #wintertime #wintercamping #winterwonderland #traveladdict #travelphotography #wintervibes #зимовікарпати #срюкзаком #зима #карпати #иглу #снег #поход #зимнийтуризм #фототур #кемпинг", "A post shared by  Volodymyr Shevchuk (@vova_shevchuk_travel) on Dec 19, 2018 at 1:26am PST", "We reached out to Shevchuk for more information about the photographs, and he told us it was a flashlight, not a fire, illuminating this igloo from within. Furthermore, this is a \"long exposure\" photograph, which means that the camera's shutter was held open for an extended period of time, allowing more light to hit the sensor. In other words, this igloo wouldn't appear nearly as bright to a person standing next to it.", "Shevchuk told us: \"We built this igloo in the Ukrainian Carpathians. The light in the middle is a flashlight. Photo taken at long exposure.\"", "While the images above may give viewers the impression that raging bonfires were commonly built inside of igloos, that wasn't the case. Traditionally, a much smaller flame from a kudlik (qulliq), a sort of lamp or candle made from seal-oil or blubber, was used to light and heat the inside of an igloo.", "A qulliq can be seen in the following video (starting around the 1:30 mark) from an episode of the BBC's \"Ray Mears World of Survival\":", "Igloos are made from blocks of compact snow, rather than blocks of ice, and snow is a rather good insulator. This makes it possible to keep the interior of an igloo at a reasonable temperature (above freezing) using only body heat, even when the temperatures outside plummet:", "Snow is such a good insulator that some animals dig snow caves in which to hibernate through the winter. New snow is composed of a high percentage of air trapped among the accumulated snow crystals. Since the air can barely move, heat transfer is greatly reduced. Fresh, uncompacted snow typically is 90 to 95 percent trapped air. Many animals take advantage of snow's insulating qualities, and burrow into the snow to hibernate through the winter.", "The following video from the PBS Digital Studios' YouTube channel It's OK To Be Smart provides some more information on how igloos are built and how they are kept warm:", "While a quilliq was traditionally used to heat and light an igloo's insides, we did find a number of videos featuring wood bonfires. Here's what an igloo actually looks like when a fire is built inside:", "Smith, Craig.   \"A Lost Art in the Arctic: Igloo Making.\"\r\n    New York Times.   21 June 2017.", "Van Look, Geert.   \"A Guide to Long Exposure Photography.\"\r\n    Peta Pixel.   5 June 2019.", "National Snow and Ice Data Center.   \"All About Snow.\"\r\n    Retrieved 14 August 2019.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]