["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "The 2014 race for governor is off to a punchy start.", "PolitiFact Ohio told you Wednesday about the early attacks that Republican allies of incumbent John Kasich hope will stick against his likely Democratic challenger, Ed FitzGerald.", "Essentially, the GOP has seized on FitzGerald’s bystander status in the federal investigation of Cuyahoga County government and wrongly branded the first-term county executive as corrupt. It’s an attack that cuts directly at FitzGerald’s efforts to project a law-and-order image.", "But FitzGerald is using similar rhetoric in his attempt to draw contrasts with Kasich.", "\"We need a governor who will stand up for middle-class families, for women’s rights and for good paying jobs,\" FitzGerald wrote last month when inviting supporters to his campaign kickoffs in Cleveland, Columbus and Cincinnati. \"Ohioans want an end to pay-to-play politics, rampant cronyism and wasteful spending of our tax dollars on corporate donors and political perks.\"", "Jon Thompson, a spokesman for the Republican Governors Association, pointed to that statement this week as PolitiFact Ohio was evaluating his group’s claim that FitzGerald, the former mayor of Lakewood, represented a \"brand of pay-to-play and corruption politics.\"", "The he-started-it defense is not acceptable when dealing with dishonesty. The RGA statement earned a Pants On Fire rating on our Truth-O-Meter. But what’s good for the goose is good for the gander, so PolitiFact Ohio today is taking a closer look at FitzGerald’s \"pay-to-play\" claim.", "We asked Meredith Tucker, spokeswoman for FitzGerald’s campaign, to clarify what, specifically, FitzGerald meant by talking of pay-to-play politics involving Kasich. She responded with a 12-page memo with a table of contents that offered six examples. None, though, is a case in which the governor himself is accused of seeking or providing a favor in exchange for another.", "Most of the examples involve Kasich administration officials or political allies. And while a few raise obvious ethics questions, they do not fit the pay-to-play description in the classic sense. One example FitzGerald’s campaign cites is merely a rehash of the controversy surrounding Kasich’s JobsOhio program, which is not subject to any substantiated corruption claims.", "FitzGerald’s team fills three pages with quotes from newspapers that reported on how three members of Kasich’s inner circle emerged as top Statehouse lobbyists after Kasich took office. The FitzGerald document says the lobbyists \"cashed in on their relationship with the governor.\"", "This cannot fairly be held as an example of pay-to-play. This the culture of Capitol Square.", "Lobbyists closely aligned with a particular party do better when that party is in power. The Plain Dealer’s Mark Naymik noted this in April 2007, when he reported that demand had surged for Democratic lobbyists after Democrat Ted Strickland’s election as governor. Naymik reported  in 2011 that the GOP sweep the previous fall had ushered in a new wave of Republican lobbyists.", "Another of FitzGerald’s examples focuses on Jim Leftwich, a former Kasich administration official who lost his development job with the state after it was learned he had a consulting contract with Wright State University. The Dayton Daily News covered the story extensively. Last November the newspaper reported it had obtained public records that showed Leftwich was on the state payroll when he and a WSU official devised a plan to give Leftwich’s firm \"a 25 percent ownership stake in start-up companies established based on the WSU-originated research.\"", "Leftwich \"apparently … did not disclose\" this arrangement to his supervisors in state government -- something that state ethics rules would have required him to do, the Daily News reported. After Leftwich signed his WSU contract, Kasich, according to the newspaper, \"appointed him to the board for the Third Frontier program,\" a state program that invests in technology companies.", "Three weeks later, Leftwich suggested that \"WSU could use Third Frontier money to help launch two potential start-up businesses the university was working to create,\" the Daily News reported.", "The Kasich administration eventually learned about Leftwich’s dual roles, terminated him last fall and referred the case to the Ohio Ethics Commission. Paul Nick, the agency’s executive director, told PolitiFact Ohio this week that he \"cannot comment on an ongoing investigation.\"", "While ethically murky, this is a stretch as a pay-to-play example.", "FitzGerald’s campaign also singles out former Ohio Schools Superintendent Stan Heffner. The state inspector general last year found Heffner acted improperly by testifying in favor of a bill  that benefited a private education company he planned to work for, The Plain Dealer reported.", "The FitzGerald memo blasts Kasich for opposing Heffner’s firing. The governor’s spokesman told The Plain Dealer at the time that Heffner exercised bad judgment but that Kasich believed dismissal \"seems too far.\" Heffner resigned two days later, a move Kasich said was appropriate.", "Prosecutors in Franklin County and Columbus ruled that Heffner’s actions were not criminal.", "Conflict of interest involving the state schools chief? Yes.", "Pay-to-play politics involving the governor? No.", "The final two examples FitzGerald offers relate to the governor’s control over the Ohio GOP.", "Last year Andrew Manning, the former chairman of the Portage County Republican Party, accused Kasich allies of offering him influence in the governor’s administration if he agreed not to run for a seat on the party’s State Central Committee. Team Kasich at the time wanted to dump Kevin DeWine as state party chairman and needed a majority of votes on the panel.", "Manning has said he met with FBI and sent the agency a sworn affidavit backing up his claims. But to date nothing has come of his accusations. Kasich’s allies have denied wrongdoing.", "This year Kasich endorsed Matt Borges, the state party’s executive director, to move up to the chairman’s post. Borges, who won the post last month, was dogged by a past guilty plea to unauthorized use of a public office. The 2004 misdemeanor involved Borges giving preferential treatment to certain brokers who donated to Ohio Treasurer Joe Deters’ re-election campaign. Borges paid a $1,000 fine and later cleared his record when he was granted an expungement.", "The Borges case is the only one cited in FitzGerald’s memo that is an actual example of a pay-to-play crime. And in this case Kasich has no connection to the crime, which since has been cleared from Borges’ record. FitzGerald resorts here to guilt by association.", "FitzGerald, in the invitation to his campaign kickoffs, contrasted himself with Kasich by asserting that Ohioans \"want an end to pay-to-play politics.\" By doing so he characterizes the Kasich administration as corrupt. But he has no strong examples to back up this claim.", "PolitiFact Ohio applies the same threshold we applied when evaluating the Republican Governors Association’s effort to brand FitzGerald as corrupt. Kasich has never been accused of or charged with a crime, and FitzGerald lacks proof that he is even suspected of one.", "The GOP’s attack on FitzGerald was especially absurd given the fact that a federal prosecutor has publicly cleared the county executive of wrongdoing. FitzGerald walks a finer line by citing specific cases in which members of Kasich’s administration or political circle were accused of ethics violations and other uses of poor judgment -- but nothing that fits the \"pay-to-play\" label.", "As for Borges, had his misdemeanor come during Kasich’s term, FitzGerald might have a better argument. Instead, on the Truth-O-Meter, PolitiFact Ohio finds his statement False.", "PolitiFact Ohio, \"Republican Governors Association portrays FitzGerald as a ‘pay-to-play’ politician,\" April 30, 2013;", "Friends of FitzGerald, \"A Big Announcement!\" via email, April 19; 2013;", "Email exchange with RGA spokesman Jon Thompson, April 29; 2013;", "Email exchange with Ed FitzGerald spokeswoman Meredith Tucker, April 29 - May 1, 2013;", "Plain Dealer archives, \"Power shifts to Democratic lobbyists,\" April 1, 2007;", "The Plain Dealer, via cleveland.com, \"New lobbyists in Ohio have strong Republican ties,\" July 4, 2011;", "Dayton Daily News, \"Ex-state official loses job in ethics flap,\" Nov. 24, 2012;", "Phone interview with Paul Nick of the Ohio Ethics Commission, May 1, 2013;", "The Plain Dealer, via cleveland.com, \"Ohio Superintendent Stan Heffner improperly advocated for private education firm, inspector general finds,\" Aug. 2, 2012;", "The Plain Dealer, via cleveland.com, \"Ohio schools chief Stan Heffner resigns under fire for conflict,\" Aug. 4, 2012;", "StateImpact, \"Former State Schools Chief Stan Heffner Won’t Face Criminal Charges,\" Sept. 24, 2012;", "The Plain Dealer, via cleveland.com, \"FBI interviews player in Ohio Republican Party dispute,\" May 17, 2012;", "The Plain Dealer, via cleveland.com, \"John Kasich, Josh Mandel and others rally around Matt Borges to succeed Bob Bennett at Ohio GOP,\" March 18, 2013;", "The Plain Dealer, via cleveland.com, \"Matt Borges named Ohio Republican Party executive director,\" May 14, 2012", "Friends of FitzGerald, memo in response to questions about Ed FitzGerald's pay-to-play attack on Gov. John Kasich, May 1, 2013.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]