["About this rating", "In August 2016, web site Simple Capacity posted a curious story (“Science Finally Confirms that People Absorb Energy from Others”) which subsequently went viral on a number of meditation or alternative health and science social media pages.", "The article is a reprint of something first written on 22 November 2012 and published on the PreventDisease.com website. That author’s main claim was well summarized by the first two sentences of the article:", "A biological research team at Bielefeld University has made a groundbreaking discovery showing that plants can draw an alternative source of energy from other plants. This finding could also have a major impact on the future of bioenergy eventually providing the evidence to show that people draw energy from others in much the same way.", "This article distorted the findings of an actual scientific study about a species of green algae called Chlamydomonas reinhardtii. That research, published in the journal Nature Communications on 20 November 2012, demonstrated that, in addition to photosynthesis, this species of green algae, under sub-optimal growing conditions, can derive energy by breaking down and consuming the cellulose (the main molecule of a green plant’s cell walls) of other nearby plants, as  reported in a Universitaet Bielefeld press release:", "“This is the first time that such a behaviour has been confirmed in a vegetable organism,” says Professor Kruse. “That algae can digest cellulose contradicts every previous textbook. To a certain extent, what we are seeing is plants eating plants.”", "The paper also speculated that this technology could be used to convert cellulose waste (e.g. crops, paper, etc.) into a form of carbon that could be used as a biofuel, a process that currently relies on a type of fungi that needs additional sources of energy to grow.", "The press release continued on to speculate that \"If, in future, cellulose enzymes can be obtained from algae, there would be no more need for the organic material to feed the fungi.\"", "In the case of the Simple Capacity viral story, the major leap from the scientific study to pseudoscience occurred when “psychologist and energy healer” Dr. Olivia Bader-Lee (who may be a fictional character created for the purpose of promoting this one claim) commented on the study.", "The logic of the transition was not subtle:", "Flowers need water and light to grow and people are no different. Our physical bodies are like sponges, soaking up the environment. “This is exactly why there are certain people who feel uncomfortable in specific group settings where there is a mix of energy and emotions,” said psychologist and energy healer Dr. Olivia Bader-Lee.", "Bader-Lee’s claim was that this study of a specific species of algae reinforced a mystical notion that humans can sense and “feed” from one another’s energy:", "Bader-Lee suggests that the field of bioenergy is now ever evolving and that studies on the plant and animal world will soon translate and demonstrate what energy metaphysicians have known all along — that humans can heal each other simply through energy transfer just as plants do. “Human can absorb and heal through other humans, animals, and any part of nature. That’s why being around nature is often uplifting and energizing for so many people,” she concluded.", "If, however, humans did act like Chlamydomonas reinhardtii when they couldn’t create food for themselves, it would be a macabre undertaking. The algae literally consume the physical organic matter of other plants, not some unseen, untapped metaphysical form of energy. The analogous concept for humans would be cannibalism.", "To be consistent with the study, humans would also be required to be built of cellulose (which we are not), as the algae’s mechanism for deriving energy from other plants is to produce an enzyme that breaks down the cellulose and converts it into a form that can be consumed by its own cells.", "This viral news story was a prime example of a poorly executed bait and switch. It provided results of an actual study to gain credibility before switching into unsubstantiated, unverifiable, and illogical claims, forcing a connection that — like “Dr. Olivia Bader-Lee” herself — will no appear, no matter how hard you look for it.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]