["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Former U.S. Sen. Russ Feingold (left), a Democrat, served three terms in the Senate before Republican Ron Johnson defeated him in 2010. They are in a rematch in 2016.", "During the 2016 election cycle, free trade agreements have drawn scorn from candidates ranging from Donald Trump to Bernie Sanders, both of whom have unloaded on Hillary Clinton for her support of NAFTA and other trade deals.", "But Democrats have ripped Republicans on the deals, too.", "In June 2016, Democratic U.S. Senate candidate Russ Feingold released a TV ad  claiming that the incumbent, Wisconsin Republican Ron Johnson, \"voted five times for tax breaks that help companies ship Wisconsin jobs overseas.\" Our rating was False.", "Then on Sept. 26, 2016, Feingold went on the attack again with a similar but less specific claim in a TV ad that features four middle-age people.", "One looks at the camera and says Johnson \"helped companies ship jobs overseas.\"", "The new attack falls short, too.", "Three trade deals", "To back the claim, the Feingold campaign cited three votes Johnson made in 2011. They were in favor of free trade deals with South Korea, Panama and Colombia. President Barack Obama, who touts the tariff-reducing agreements as a way to increase U.S. exports and \"support\" jobs in the United States, signed each of them into law in 2012.", "Currently, the United States has free trade agreements with 20 countries -- with the largest being the North American Free Trade Agreement with Canada and Mexico. The South Korea deal is the second-largest.", "An August 2016 report by the nonpartisan Congressional Research Service found that the United States’ negative trade balance with South Korea has grown -- from $16.6 billion in 2012 to $28.3 billion in 2015 -- since that trade deal was signed. That report did not make any estimates on jobs.", "In May 2016, the left-leaning Economic Policy Institute estimated that trade deficits with Korea eliminated more than 95,000 U.S. jobs between 2011 and 2015. The report was written by Robert Scott, the institute’s senior economist and director of trade and manufacturing policy research.", "Scott told us that the Korean trade deal led to an increased demand in the United States for products made in Korea and a decreased demand for U.S.-made products.", "But, importantly for this fact check, his report did not say that jobs lost in the United States were sent overseas.", "The report’s job-loss estimate was in the same range as a March 2015 estimate by government accountability think tank Public Citizen, which said the increased trade deficit with Korea \"equates to nearly 85,000 lost U.S. jobs.\"", "But that report did not state that U.S. jobs were sent overseas, either.", "Moreover, there are issues with the two job-loss estimates attributed to the Korean trade deal.", "The Washington Post’s Fact Checker weighed in in March 2016 about claims on free trade and job losses, including one by Trump that cited the Economic Policy Institute, saying:", "\"We urge all readers to view such claims with deep skepticism. The job-loss figures often rely on simplistic formulas that are disputed by other economists. It is often difficult to separate out the impact of trade agreements on jobs, compared to other, broader economic trends.\"", "Indeed, the Fact Checker gave Public Citizen four Pinocchios, its lowest rating, for its 85,000 lost-jobs claim. Public Citizen took \"fishy\" math the White House used to make a jobs increase estimate and then manipulated further, the Fact Checker said.", "(Scott, of the Economic Policy Institute, told us he has not seen estimates on job effects of the Colombia and Panama free trade deals, noting the deals are much smaller.)", "Other experts also see problems with the job-loss estimates attributed to free-trade deals.", "Susan Houseman, senior economist at the Michigan-based Upjohn Institute for Employment Research, told us:", "\"Estimating the effects of a trade agreement on jobs is very difficult to do convincingly, because many other factors affect employment, and so parsing out the effects of one trade agreement is tough. Some jobs are lost by increased competition, but others are created by increased access to foreign markets.\"", "NAFTA, Houseman noted, has been closely studied, \"and the evidence that it had significant negative effects on employment is weak.\"", "PolitiFact National also concluded in an April 2016 fact check on Sanders attacking Clinton over trade deals that that the jury is still out on the job effects of the deals.", "Our rating", "Citing Johnson’s votes for free trade agreements with South Korea, Panama and Colombia, Feingold says Ron Johnson \"helped companies ship jobs overseas.\"", "There are estimates that the largest of the three deals, with South Korea, resulted in a loss of jobs in the United States. But those estimates are disputed, largely because of how difficult it is to isolate one cause for changes in employment. Moreover, the job-loss estimates do not state that any U.S. jobs were shipped overseas.", "Without evidence of the trade deals helping ship jobs overseas, we rate Feingold’s statement False.", "YouTube, Russ Feingold \"Harder to get ahead\" TV ad, Sept. 26, 2016", "Interview, Russ Feingold campaign spokesman Josh Orton, Sept. 27, 2016", "Email, Ron Johnson campaign spokesman Will Allison, Sept. 29, 2016", "PolitiFact Wisconsin, \"Feingold: Johnson voted five times for tax breaks that help ship Wisconsin jobs overseas (False),\" Aug. 26, 2016", "PolitiFact National, \"Is there a corporate tax break that ships jobs overseas?\" Sept. 16, 2014", "Washington Post Fact Checker, \"Trump’s trade rhetoric, stuck in a time warp,\" March 18, 2016", "Washington Post Fact Checker, \"Public Citizen’s misleading math on the Korea Free Trade Agreement,\" Aug. 7, 2015", "Congressional Research Service, \"U.S. Trade with Free Trade Agreement Partners,\" Aug. 18, 2016", "Interview Economic Policy Institute senior economist and director of trade and manufacturing policy research Robert Scott, Sept. 28, 2016", "Email, Upjohn Institute for Employment Research senior economist Susan Houseman, Sept. 28, 2016", "Economic Policy Institute, \"U.S.-Korea trade deal resulted in growing trade deficits and more than 95,000 lost U.S. jobs,\" May 5, 2016", "Public Citizen, \"Unhappy Third Birthday for Korea FTA Drags Down Obama Push for Fast Track,\" March 13, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]