["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Sen. Elizabeth Warren, D-Mass., has been in demand as a speaker at Democratic campaign events this year. Here she campaigns for the Democratic Senate candidate in Iowa, Bruce Braley, on Oct. 19, 2014, in Des Moines.", "Nothing animates political discussions like the appearance of hypocrisy. And for some critics these days, Sen. Elizabeth Warren, D-Mass., offers a tempting target.", "Warren, elected in 2012, has become a leader of the liberal wing of the Democratic Party, decrying the excesses of Wall Street and income inequality. These efforts -- and the possibility that she could run for president in 2016 -- has made her a high-profile political figure.", "Here’s a social media meme we recently received:", "\"Senator Liz Warren lives in a $5.4M mansion, claimed 'Native American' status to score a Harvard gig paying $350,000 to teach one class, and now lectures us that 'the system is rigged to benefit the rich.' \"", "That’s a lot to chew on, so we’ll limit our analysis here to the claim that Warren \"lives in a $5.4 million mansion.\"", "It’s a claim that mirrors others cited elsewhere in the media -- for instance, in an op-ed in the Boston Herald and in an article in the Huffington Post, both of which say Warren’s house is worth $5 million.", "But is it really worth that much? No.", "After plowing through public real estate data, we found that the house Warren shares with her husband, Bruce Mann, is worth less than half that -- though it’s located in a desirable neighborhood in Cambridge, Mass., so it’s still pretty expensive by most Americans’ standards. (Warren's staff did not respond to an inquiry for this story.)", "House values", "According to real estate records, Warren’s house -- a clapboard Victorian built in 1890 -- was purchased in 1995 for $447,000. Back then, the median sale price for a single-family home in Cambridge was roughly $300,000, so the house was definitely above average for the city at the time.", "The amount paid for the house in 1995 works out to just shy of $700,000 in today’s dollars. But it was a smart purchase. The house’s assessed value for 2015 was a bit over $1.9 million, and as is often the case, the expected resale value is higher.", "The real estate website Zillow.com estimates that the house’s value today is about $2.4 million. That’s well above the median price of homes currently listed in Cambridge, which Zillow says is $639,000, though in Warren’s immediate neighborhood, several houses have values exceeding $2 million and more exceed $1 million, according to Zillow.", "It’s worth noting that the use of the term \"mansion\" may be a bit of a stretch. The house has two bedrooms and three-and-a-half baths, and 3,728 square feet of living space. According to the Census Bureau, the median new home in the northeastern United States in 2010 had 2,392 square feet. So Warren’s house is bigger than average, but hardly Versailles.", "Indeed, almost half of the house’s $1.9 million in assessed value comes from the land, not the structure itself. And a key factor in the price growth likely stems from its location in a good school district, the easy access to fancy neighborhood amenities, and its close proximity to Harvard University, where Mann is a law professor, and where Warren taught before winning her Senate race.", "So where did the $5 million figure come from? A garbled financial disclosure report, most likely.", "Warren’s 2011 financial disclosure report, required of Senate candidates, listed the house as having a value of between $1 million and $5 million. This disclosure form only requires the candidate to gauge asset values within broad ranges, rather than a specific amount. Somewhere along the line, some authors started neglecting to mention that the $5 million figure was the upper range for the house, not its specific value. (Other articles were more careful.)", "A final note: Warren is wealthy by national standards, but so are a lot of other senators. In the most recent Roll Call survey of congressional net worth, Warren ranks 24th among senators with an estimated net worth of $3.66 million, and 76th among the 535 members of the House and Senate combined. So her net worth is well above average, but it’s nowhere near the congressional or senatorial top 1 percent.", "Our ruling", "The social media meme said Warren \"lives in a $5.4 million mansion.\" Warren does live in a desirable neighborhood in an expensive urban center, which means that her house is much more expensive than that of most Americans.", "Still, the meme overshoots the facts of the case. The house’s estimated value is less than half of the stated $5.4 million, and calling it a mansion is a stretch. The statement contains some element of truth but ignores critical facts that would give a different impression, so we rate it Mostly False.", "Social media meme critical of Elizabeth Warren", "U.S. Senate, financial disclosure form for Elizabeth Warren, Dec. 29, 2011", "City of Cambridge, Mass., property database, accessed Oct. 29, 2014", "Zillow.com, Cambridge Home Prices & Values, accessed Oct. 29, 2014", "Cambridge Community Development Department, \"Housing Profile,\" Aug. 2010", "U.S. Census Bureau, \"Median and Average Square Feet of Floor Area in New Single-Family Houses Completed by Location,\" accessed Oct. 29, 2014", "Bureau of Labor Statistics, CPI inflation calculator, accessed Oct. 29, 2014", "Roll Call, \"Wealth of Congress,\" Oct. 22, 2014", "New York Post, \"Mass. masquerader,\" Nov. 21, 2011", "Huffington Post, \"Elizabeth Warren, Worth Millions, Says Members Of Congress Shouldn't Own Stock,\" Jan. 28, 2012", "New York magazine, \"A Saint With Sharp Elbows,\" Nov. 13, 2011", "Boston Herald, \"Cohen: One-percenter Liz Warren milks system then slams it in phony soundbites,\" April 26, 2014", "Human Events, \"Elizabeth Warren Goes Native,\" May 7, 2012", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]