["On February 28, several social media users shared a 20-second video of a building engulfed in fire. The viral message blamed “Islamic jihad” for the incident and claimed that this occurred in Paris. “After burning India’s capital, the terrorist community has burnt the French capital as well. #IslamicJihad Now tell did the riots happen because of @KapilMishra_IND’s speech. There is only one solution #EconomicBoycott,” reads the message.", "[Translated from आतंकवादी कौम ने भारत की राजधानी फूकने के बाद फ्रांस की राजधानी पेरिस फूक दी । #IslamicJihad अब बोलो @KapilMishra_IND जी ने फ़्रांस में भी भाषण दिया था इस लिए वहाँ दंगा भड़का! एक ही उपाय #आर्थिक_बहिष्कार]", "Twitter user @Satynistha posted the viral video (archive link). It was quote-tweeted (archive link) by Suresh Chavhanke, editor-in-chief, Sudarshan News and the host of ‘Bindas Bol’. Chavhanke’s tweet has been retweeted over 3,700 times and @Satynistha’s video has gained over 40,000 views.", "अब बोलो @KapilMishra_IND ने फ़्रांस में भी भाषण दिया था इस लिए वहाँ दंगा भड़का! एक ही उपाय #आर्थिक_बहिष्कार https://t.co/pl0qD7WPjl", "— Suresh Chavhanke “Sudarshan News” (@SureshChavhanke) February 29, 2020", "Similarly, several users posted the viral video on Facebook and Twitter.", "Alt News performed a keyword search on Google and found a February 29 report by UK-based The Express which includes screenshots from the viral video. According to the report, a railway station in Paris, Gare de Lyon, was set ablaze by protesters opposing a concert by Fally Ipupa from the Democratic Republic of Congo.", "Several media outlets reported that the fire was started by political opponents of the DR Congo government. They accused Ipupa of being too close to the Congolese government.", "According to BBC, “For years parts of the Congolese diaspora have condemned musicians they view as too close to the political elite they blame for destroying the country. As a punishment they have used direct action to effectively ban musicians from performing in Europe and thereby prevent them [from] making money. For about 10 years, some members of the diaspora would try to beat up any musician – and anyone who was part of the regime – whenever they visited Europe. It happened to some senior officials in the past few years. Some musicians have had concerts targeted. Fally Ipupa is the first Congolese artist to perform in Europe since then.”", "The BBC report also added that police has arrested 30 people and fined 54 for participating in a banned protest.", "Therefore, social media claims attempted to communalise a case of arson by political opponents of the Congolese government in Paris. This wasn’t an attack orchestrated by the Muslim community, as claimed.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]