["About this rating", "Frank \"Rocky\" Fiegel was a real person who lived in the hometown of \"Popeye\" creator Elzie Segar.", "A photograph often shared as if it shows Fiegel actually depicts another individual unrelated to the \"Popeye\" franchise.", "The internet's interest is periodically piqued by a photograph supposedly showing Frank \"Rocky\" Fiegel, the man believed to be cartoonist E.C. Segar's inspiration for the character of \"Popeye\":", "The claim that Fiegel was the inspiration for \"Popeye\" is largely accurate. However, the picture shown above is not a photograph of him.", "Fred Grandinetti explored the origins of the character in his book Popeye: An Illustrated Cultural History. He found that the locals of Chester, Ill., where creator Segar was raised in the early 1900s, likely served as an inspiration to Segar.", "The characterization of Popeye, for example, can be found in the look and personality of Fiegel, who had a strong chin, always smoked a pipe, and had a propensity for fights, according to Grandinetti:", "The lore of Chester, Illinois, holds that the character of Popeye was inspired by town resident Frank \"Rocky\" Fiegel. Lee Huffstutler, herself a Chester local, makes and well supports this argument. According to Huffstutler, Rocky Fiegel was of Polish descent and lived with his mother in a house near the Evergreen Cemetery. Mrs. Huffstutler describes him as \"tall, strong, always ready for a fight and always a winner\" ...", "Rocky worked part-time at George Gozney's saloon. When he finished his work and had consumed a couple of beers, he would take a chair outside, seat himself, tilt the chair back, and, with pipe in his mouth, proceed to take a nap in the sunshine. Of course, the sleeping Rocky became an amusing target for the school children who came by. They would creep near, yell loudly, and run. Rocky would awaken with a start and jump out of his chair, arms flailing, ready for a fight. but alas, there would be no opponent. The children would be a block away by that time.", "In the March 28, 1947, issue of the Chester Herald Tribune, there is an obituary for Mr. Fiegel, who died at his home in Chester on March 24, 1947. Born January 27, 1868, he was 79 years of age at the time of his death.", "The editor wrote that Frank \"Rocky\" Fiegel was a familiar character in Chester and was credited for being the inspiration of Elsie Segar's \"Popeye.\" The article reads: \"In his younger days he performed amazing feats of strength. Because of his hardened physique he was affectionately known as \"Rocky.\" His angular jaw and familiar corn-cob pipe apparently impressed the young Segar.", "Some versions of this claim also state that Fiegel, like Popeye, was a sailor, but that wasn't the case. Furthermore, Fiegel wasn't aware of his role in the creation of Popeye until the final years of his life, according to the Southern Illinoisan:", "In Chester, it is commonly accepted that Fiegel provided Segar with the basis for the character of Popeye. Although not a sailor, and more inclined to guzzle liquor than spinach, Fiegel had the reputation of being as tough and as fearless as the cartoon character ...", "Fiegel, a bartender and general laborer around Chester, seldom had steady work and was often seen loafing around the town's saloons ...", "It wasn't until 1938, nine years before he died, that he learned that he was the inspiration for Popeye. That was the year the strip's creator, Segar, died. The St. Louis Post-Dispatch ran a picture of Fiegel sitting in a rocking chair and smoking a pipe, saying he was the inspiration for the character.", "While Fiegel likely inspired Segar's Popeye character, the viral photograph frequently attached to this claim doesn't actually show him. The image is one of an anonymous sailor aboard the HMS Rodney in 1940. The image is available via the Imperial War Museum where it is presented with the caption: \"A Leading Stoker nicknamed \"Popeye\", with 21 years service\":", "Fiegel was in his 70s at the time this photograph was taken. Furthermore, HMS Rodney was a British battleship in service of the Royal Navy, far from Fiegel's home in Chester.", "A genuine photograph of the \"real life Popeye\" can be seen in a 1979 article published in the Carbondale, Ill., newspaper Southern Illinoisan about Chester's famous resident (see top right image):", "Sun, Apr 8, 1979 – Page 33 · Southern Illinoisan (Carbondale, Illinois) · Newspapers.com", "Here's a larger version of that image:", "Fiegel passed away in 1947 and was buried in an unmarked grave. According to the Official Popeye Fan Club, this was remedied in 1996 when a headstone bearing a 1929 version of Popeye was placed at Fiegel's final resting place:", "On September 7, 1996, Fiegel's formerly unmarked grave was finally marked with a headstone. The marker was inscripted with the 1929 version of E.C. Segar's Popeye character. This version of Popeye most resembles his legendary 'real life' counterpart.", "Grandinetti, Fred.   Popeye: An Illustrated Cultural History.     McFarland Publishing, 2003.   ISBN 078641605X.", "Associated Press.   \"Where They Really Knew Popeye and Co.\"     18 January 2004.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]