["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "The shooting of unarmed 18-year-old Michael Brown by former Ferguson, Mo., police officer Darren Wilson has sparked national dialogues ranging from the racial makeup of police forces to the militarization of local law enforcement.", "Another issue up for debate is the use of deadly force by police. On this topic, we heard a noteworthy statistic from National Urban League CEO Marc Morial during an appearance on Fox News Sunday: \"The number of killings of citizens by police is at a two-decade high.\"", "The stat caught our attention, but is it accurate?", "At first blush, it looked like Morial is on solid ground. He has two good sources for his claim: USA Today and the FBI. But as we dug deeper, we discovered sizeable shortcomings in the data.", "A spokeswoman for the National Urban League pointed us to the USA Today story. The headline: \"Police killings highest in two decades.\"", "USA Today reviewed data collected by the FBI for its annual Uniformed Crime Report and a statistic called \"justifiable homicide by law enforcement.\"", "We looked at the statistics ourselves. In 2013, the latest year on record, there were 458 justifiable homicides involving a firearm. The previous high was in 1994, when 460 were reported. Here’s a graph of justifiable homicides by law enforcement:", "This would seem to make it a cut-and-dried case. However, as we learned from experts who have studied crime statistics and police-involved shooting, there are significant holes in the FBI data that cast doubts on whether real conclusions can be drawn from the statistics.", "Even the USA Today story the National Urban League linked us to highlighted many of the inadequacies of the data. Other news outlets have noted the limitations of the FBI statistics as well.", "Here’s the biggest problem: There is no mandate that local law enforcement agencies report officer involved shootings to the FBI. While 18,000 city, university, county, state, tribal and federal law enforcement agencies voluntarily participate in the FBI’s annual Uniform Crime Report, just a small fraction of them willingly provide data on deadly force and justifiable homicides within their departments.", "Robert Worden, professor at the University of Albany School of Criminal Justice, said \"the actual number of such homicides may be as high as double the FBI’s counts.\"", "\"(Morial’s) claim might be true, but it’s impossible to say with confidence,\" Worden said. \"The consensus among experts is that these data are unsatisfactory, leaving questions about the number of people shot and killed by police in any year and trends in that number over time completely open.\"", "David Klinger, a professor at the University of Missouri-St. Louis, said there is no reason to believe the number of agencies that do report are representative of the population, and the number who report may fluctuate from year to year. It’s entirely possible that the reason the number went up from 2012 to 2013 is simply because more police agencies reported their officer-involved shootings than in previous years. Even less definitive conclusions can be drawn from comparing 2013 results to 1994.", "And there’s no way to extrapolate the FBI figures because there is no benchmark that indicates by how much the information is underreported. We couldn’t even tell if more or fewer police departments were reporting the numbers over the years. A spokesman for the FBI did not get back to us.", "Klinger said academics and others in the field have publicly questioned these numbers for decades.", "\"I wish people would just admit that the data sucks and they shouldn't be using it for anything other than to say, that’s the baseline number of people who have been reported to be killed by the police in a given year,\" Klinger said. \"To talk about trends against time? No, we don’t know what agencies are coming in and out of reporting and how many are accurately reporting.\"", "Are there any other sources for the data? Not really. James McGinty, spokesman for the Police Executive Research Forum, a think tank focused on best practices for law enforcement, said there’s no data that’s conclusive, even for determining basic trend lines.", "\"We certainly think there should be better data on this,\" McGinty said.", "The Bureau of Justice Statistics used to track the number of deaths while in police custody, a similar but imperfect number. However, the data only goes from 2003 to 2009 and it appears it has not been updated since.", "The Centers for Disease Control and Prevention estimates deaths in cases of \"legal intervention\" which includes \"injuries inflicted by the police or other law-enforcing agents, including military on duty, in the course of arresting or attempting to arrest lawbreakers, suppressing disturbances, maintaining order, and other legal actions.\" However, this is a calculated statistic based on sample surveys and the data only goes back to 1999 anyway.", "Lorie Fridell, a professor at the University of South Florida Department of Criminology, surveyed most local law enforcement agencies in the country and found the vast majority track the number of officer-involved shootings internally. However, there is no national clearinghouse for the data and mandating reporting to the federal level would be a challenge.", "\"Individual researchers sometimes collect this information from multiple departments, but even those latter efforts do not come close to providing us with reliable national data,\" Fridell said.", "Our ruling", "Morial said, \"The number of killings of citizens by police is at a two-decade high.\"", "Morial was quoting a USA Today analysis based on FBI statistics. In that sense, Morial seemed to have good sources. But digging deeper showed the information is hardly reliable.", "Only a fraction of law enforcement agencies provide this data to the FBI, and the agencies reporting changes every year. These problems are not new and were in fact noted in the USA Today story he referenced.", "Normally we would put more stock in FBI statistics. But in this case there are many known problems with the data. We rate the claim Half True", "Fox News Sunday, Transcript, Nov. 30, 2014", "Email interview with Latraviette Smith, spokeswoman for the National Urban League, Dec. 1, 2014", "USA Today, \"Police killings highest in two decades,\" Nov. 11, 2014", "Washington Post, \"How many police shootings a year? No one knows,\" Sept. 8, 2014", "Bureau of Justice Statistics, \"Arrest-Related Deaths,\" accessed Dec. 2, 2014", "PunditFact, \"Lawyer in Ferguson case: 99% of the time police not charged in death of young person of color,\" Nov. 25, 2014", "Centers for Disease Control and Prevention, \"Fatal Injury Reports, National and Regional, 1999 - 2012,\" accessed Dec. 2, 2014", "Archive.org, \"Crime in the United States 1994,\" accessed Dec. 1, 2014", "FBI, Uniformed Crime Report, 1999", "FBI, Uniformed Crime Report, 2003", "FBI, Expanded Homicide Data Table 14, 2008", "FBI, Expanded Homicide Data Table 14, 2013", "Email interview with Robert Worden, professor at the University of Albany School of Criminal Justice, Dec. 2, 2014", "Phone interview with David Klinger, a professor at the University of Missouri-St. Louis, Dec. 2, 2014", "Phone interview with Lorie Fridell, a professor at the University of South Florida Department of Criminology, Dec. 2, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]