["About this rating", "On 10 October 2016, the conspiracy-mongering WhatDoesItMean.com web site published an article that exploited recent presidential campaign controversies by reporting that a \"secretly made Israeli intelligence video recording\" had captured \"former President Bill Clinton raping a 13-year-old girl\":", "A stunning new Foreign Intelligence Service (SVR) report circulating in the Kremlin today states that the entire US presidential election is nearing an “explosive crisis” over a secretly made Israeli intelligence video recording showing former President Bill Clinton raping a 13-year-old girl child that Hillary Clinton has kept hidden from public knowledge with help from the American propaganda mainstream media — but by her embroiling Donald Trump in her husband's sex crimes now threatens its being released.", "According to this report, the video recording of Bill Clinton raping this 13-year-old girl child was “created/engineered” by Israel’s Institute for Intelligence and Special Operations (MOSSAD) “Clothing Shop Network” (Магазин/одежды/חנות בגדים) whose main “organizer/facilitator” is the “international money man of mystery” Jeffery Epstein—and who is now being called “The Billionaire Pedophile Who Could Bring Down Donald Trump and Hillary Clinton”.", "As we have chronicled multiple times, WhatDoesItMean.com is a purveyor of fabricated conspiracy \"news\" — information that is, unfortunately, all too often aggregated by numerous bottom-feeding web sites and spread by social media users unaware of its source.  This article about the non-existent Bill Clinton \"secret rape video\" is just another fake \"Sorcha Faal\" report that weaves actual events into fabricated narratives of ominous political happenings:", "Sorcha Faal is the alleged author of an ongoing series of \"reports\" published at WhatDoesItMean.com, whose work is of such quality that even other conspiracy nutters don't think much of it.", "Each report resembles a news story in its style, but usually includes a sensational headline barely related to reality (e.g. \"American Rebel Forces Attack Gas Pipelines, Explode Trains As US Civil War Nears\") and quotes authoritative high-level Russian sources (such as the Russian Federal Security Service in the same article) to support its most outrageous claims. Except for the stuff attributed to unverifiable sources, the reports don't contain much original material. They are usually based on various news items from the mainstream media and/or whatever the clogosphere is currently hyperventilating about, with each item shoehorned into the conspiracy narrative the report is trying to establish.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]