["About this rating", "The Muslim Prophet Muhammad had multiple wives.", "There are no historical accounts of the Prophet committing rape or torturing people; he was known for freeing slaves, not \"dealing\" them.", "The age of his youngest wife, Aisha, at the time of marriage is contested; the male members of a Jewish tribe in Medina were executed for treason during a battle, but the number is also contested.", "On 7 June 2017, the nonprofit arm of the right wing media outlet Daily Caller published a story reporting that a billboard in Indiana displaying six inflammatory claims about Muhammad (the central figure of the Muslim faith) was accurate, but local Muslims were upset about it anyway.", "The text of the story is little more than a regurgitation of original reporting done by the local Fox affiliate WXIN about the controversial billboard drivers have been seeing from the southbound lanes of I-465 in Indianapolis. The billboard bears the title \"The Perfect Man.\" It lays out six accusations which include; \"Married 6 year old\"; \"slave owner and dealer\"; \"rapist\"; \"beheaded 600 Jews in one day\"; \"13 wives, 11 at one time\"; and \"tortured and killed unbelievers.\"", "The Daily Caller states (incorrectly) that \"the facts check out except for its first box stating Muhammad married a 6-year-old\":", "The billboard lists six boxes below things the prophet did or beliefs he espoused during his lifetime, according to Islam’s holy book, the Quran.", "The billboard’s facts check out except for its first box stating Muhammad married a 6-year-old. In fact, his wife was 6-years-old when she became engaged to the prophet Muhammad and 9-years-old when they were married. The billboard signs off with “Educate Truthophobes.”", "We spoke to academics who study early Islam to get more information and context. Ayesha S. Chaudhry, Associate Professor of Islamic Studies and Gender Studies at the University of British Columbia, told us that everything about the billboard is wrong.", "The title, \"the perfect man,\" is poor translation from an Arabic phrase in the Koran, which describes the Prophet as an excellent example. But none of the items listed on the billboard appear in the Koran — they are historical events, and the accuracy of details surrounding them remain contested by scholars, the Muslim community to which Chaudhry belongs.", "Chaudhry told us that all accounts of the Prophet's life, which occurred 1,400 years ago in 7th-century Arabia, were written at least 200 years after his death, and their reliability for accuracy is shaky:", "Muslims believe the Prophet is an excellent example, and deeply disagree about the kind of man he was and the things he did. There are very few things all Muslims agree on — there is one God, the Prophet is his messenger, and the Koran is the word of God. That’s the closest we can come to agreeing. All the things that are on that sign, none of them are in the Koran.", "The billboard is not accurate because it doesn't represent Muslim faith. If we were to say now that Jews and Christians believe in stoning [because it's allowed in the Old Testament], that would not be true. These statements [on the billboard], they're not even in the Koran.", "The age of the young wife in question, Aisha Bint Abu Bakr, is contested — many believe she was actually in her late teens when she married Muhammad. Accounts contradict each other; while Aisha is quoted by one source saying she was six when she was married and nine when the marriage was consummated, another account describes Muhammad refusing offers from older men to marry his 9-year-old daughter because he thought her to be too young. Muhammad's first wife, Khadija, on the other hand, was 15 years his senior and he remained married to her exclusively until she died.", "Chaudhry also told us she doesn't know of any accounts of nonbelievers being tortured and killed, although Muhammad was engaged in warfare during his lifetime. There are no known accounts of the Prophet committing rape — to the contrary, the image Muslims derive from the Koran is one of a compassionate person prone to mercy:", "Torturing and killing non-believers — I don’t know what they’re talking about. There were several battles that happen during his life and they’re complicated. The rape comment is just hateful. I don’t know what to do with that.", "Aisha is a central figure in Islamic tradition who is characterized by her strength and eloquence, said Omar Suleiman, Islamic Studies professor at Southern Methodist University and president of the Yaqeen Institute for Islamic Research:", "The image of [Aisha] that is projected by Islamophobes is so nasty and disingenuous. Her personality refutes the image that’s projected on her as this oppressed child that was taken and had horrible things done to her by this old prophet. She was the greatest scholar of Islam, she was an extremely confident woman and eloquent speaker. She was not afraid to challenge misogyny.", "Denise Spellberg, history professor at the University of Texas at Austin cast further doubt on any claims of certainty surrounding Aisha's age, but also pointed to social norms during that point in history. In an e-mail, she told us:", "Most early accounts state Aisha was 6 or 7 at betrothal and 9 or 10 when the marriage was consummated. One later source in Arabic from the 13th century suggests 9 at the age of betrothal, and 12 at consummation. Child betrothal and marriage were not uncommon at this time in Arabia or throughout the pre-modern world. In Roman law, girls had to be 12, for example.", "What is not usually noted in reference to Muhammad is that he resisted the early marriage to Aisha. This was her father's idea. Only when her father, probably for political reasons, forced the issue, did the Prophet agree. The rest of his marriages were to previously married women.", "Marriage at that time was often about forming political alliances — and Muhammad was one among many prophets in the Abrahamic faiths who had more than one wife. Muhammad was an influential political figure during his lifetime. All of his wives, except Aisha, were either divorcees or widows, which Suleiman said denotes the strategic nature of marriage in those times. Some were widows of his allies, and marriage prevented them from falling to the economic fringes of society. Chaudhry added that in an era when polygamy was commonplace, the Koran limited it to four wives.", "In terms of slavery, it was a reality throughout Muslim, Christian and Jewish communities during Muhammad's lifetime. But tradition holds he purchased slaves for the purpose of liberating them. Suleiman told us Muhammad purchased 63 slaves in order to set them free, and at the time of his death he owned no slaves. Some of them were elevated to authoritative social roles. For example, Bilal ibn Rabah became a trusted companion of the Prophet, who was given the role of calling people to prayer.", "Spellberg told us:", "Muhammad is known for manumitting [freeing] slaves, although the Qur'an allows slavery (as did Jews and Christians of the era), to free a slave is enjoined by the sacred text as a good deed, as is treating slaves well.", "Well-known British-American orientalist Bernard Lewis addressed the issue in a 1994 book, in which he noted that slavery was a widespread reality that wasn't by any means exclusive to nascent Muslim society but a feature of a wide swath of human civilization since Biblical times:", "The Qur'an, like the Old and the New Testaments, assumes the existence of slavery. It regulates the practice of the institution and thus implicitly accepts it. The Prophet Muhammad and those of his Companions who could afford it themselves owned slaves; some of them acquired more by conquest. But Qur'anic legislation, subsequently confirmed and elaborated in the Holy Law, brought two major changes to ancient slavery which were to have far-reaching effects. One of these was the presumption of freedom; the other, the ban on the enslavement of free persons except in strictly defined circumstances.", "Suleiman told us that the bullet point that claims Muhammad \"beheaded 600 Jews\" may well be an attempt to paint the prophet as an anti-Semite, but it is in regards to an incident known as the Battle of the Trench, which took place during a siege on Medina in 627. A number of Jewish tribes were allied with Muhammad's forces — but one, Banu Qurayza, committed treason, allowing an attack to happen from the inside. An arbiter, Abdullah ibn Salam (who was a convert from Judaism to Islam) was selected to punish the tribe in keeping with the Torah — the men would be killed and women and children kept as captives.", "But the number of men killed is again the subject of controversy. Suleiman said it may have been 100 to 200. Spellberg pointed to a source that said 400. Chaudhry said one prominent scholar,  Ibn Hajar, who died in 1449, doesn't believe the executions took place at all. Again, Chaudhry cited the fact the account was collected 200 years after the fact:", "Muslims early on were disagreeing whether that actually happened. This is a really contested issue. It’s not part of the [Muslim faith's] narrative.", "The billboard not only appears to be an inaccurate representation of Islam, it's also hate speech. Rima Khan Shahid, executive director of the Muslim Alliance of Indiana told us:", "I do believe that the people responsible for putting up that billboard have gone through great lengths and put a lot of effort into spreading hatred in terms of resources, money and time. My offer still stands — I would love to sit down and have a civil conversation with those either responsible or those even that agree with the billboard. If we stay in our individual silos and bubbles we’ll never be able to come together. At the end of the day we can agree to disagree, but things like this billboard are making a rift in our society, whether it’s religious or political. We can't seem to get along and we’re putting so many resources and so much time into dividing ourselves. Why not spend that into bringing us together?", "At the end of the day, Chaudhry said, the billboard was not meant to introduce fact but to dehumanize a segment of the population.", "Going through those six pieces is also ceding ground to people construing false narrative that the Prophet is evil and people following him are evil. [In the Koran] he is described as being kind and just, and those are the qualities that Muslims think about — being patient, open to dialogue. These are all things I’ve learned form the Koran.", "Carr, Grace. \"Indiana Muslims Appalled By Accurate List of Muhammad’s Deeds.\"\r\n  The Daily Caller News Foundation. 7 June 2017.", "Shirley, Trevor. \"Muslims Appalled by ‘Perfect Man’ Billboard in Indianapolis.\"\r\n  WXIN. 5 June 2017.", "Briggs, James. \"Anti-Muslim Billboard Owned by Businessman With History of Inflammatory Rhetoric.\"\r\n  USA Today. 7 June 2017.", "Kwiatkowski, Marisa. \"'We Are One People': Religious Leaders Denounce Anti-Muslim Billboard.\"\r\n  Indiana Star. 9 June 2017.", "Lewis, Bernard. Race and Slavery in the Middle East.\r\n  Oxford University Press. 1994.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]