["About this rating", "On June 1, 2020, the white nationalist group Identity Evropa was revealed to have been behind a hoax tweet suggesting that members of “antifa” — a diffuse movement that sometimes advocates radical methods to oppose what they view as fascism — were gearing up to cause trouble for America. Amid unrest and demonstrations following the death of George Floyd, an unarmed Black man, while in the custody of Minneapolis police, antifa — according to this white nationalist hoax — were coming to sow chaos and violence across small towns in America.", "Despite reports indicating that antifa has had at most a negligible influence at any of the thousands of anti-police-brutality demonstrations, the movement has been elevated by some on the right, including President Donald Trump, as a symbol of left-wing anarchy and terror, creating a national, if not ill-defined, boogeyman on which to blame the country’s unrest. As a result, panic about marauding bands of “antifa” infiltrating small towns across America to cause terror became an ubiquitous feature of social media rumors and forwarded emails in June 2020.", "One notable panic occurred thanks to a screenshot of a purported Craigslist ad claiming to have been authored by “ANTIFA” and offering to pay “up to 1,000 people $25 per hour for protesters in Lincoln, NE and Omaha, NE.” In unusual candor for a supposedly anonymous and shadowy political movement, the ad continued to explain that “basically we want to cause as much chaos and destruction as possible.”", "First things first: Yes, the screenshots are of a real ad that was posted, briefly, to Craigslist. By combining multiple screenshots of the ad, each of which included incomplete portions of its URL, we were able to reconstruct its one-time location on the web:", "As of this writing, that URL goes to a live page that indicates a post once existed, but that it had “been flagged for removal.”", "Based on several pieces of information, we infer that the ad was live for less than a day, having been both posted and removed on June 1, 2020. Our evidence for this assertion stems from the fact that the earliest screenshot of the ad — according to reverse-image searches —  is found on a post in the message board community Godlike Productions created on June 1. Further, there are no relevant search results for “antifa,” “craigslist,” and “Nebraska” before June 1 on either Google or the social media analytics tool Crowdtangle.", "Thanks to the message board posting, we also know that the ad had to have been deleted at some point before 5:58 p.m. EDT on June 1. The author states that “My friend sent me [this Craigslist ad] on Facebook. I searched for the Craigslist ad, and it isn't there anymore.”", "The timing is crucial. The point of this ad, allegedly, was to recruit people to create “as much chaos and destruction as possible.” It is true that there was some “chaos and destruction” in Lincoln and Omaha in the aftermath of the Floyd killing, but almost all of it occurred before June 1. In both Lincoln and Omaha, demonstrations turned violent and included looting on several nights prior to and including May 31. Since then, however, demonstrations remained largely peaceful in both cities. A majority of the arrests since then were for breaking the curfew, not for property damage or theft.", "If there was a serious effort by persons connected to antifa to recruit agitators to sow chaos in Lincoln and Omaha with this Craigslist ad, their effort bore no fruit. By way of another explanation, fake Craigslist ads are a tragically common form of online manipulation — anyone can claim they are whoever they want, and this allows them to impersonate people they want to cast in whatever light they choose. The lack of actual chaos and violence following the Craigslist ad, combined with the comically candid assertion that “basically we [antifa] want to cause as much chaos and destruction as possible,” strongly suggests it was a hoax.", "Other evidence in favor of this being an inauthentic posting comes from two demonstrably different sources: the Lincoln Police Department and an organization named “Anti-Fascist Action Nebraska” — the latter appears to legitimately represent the Nebraska anti-fascist movement based on past reporting of their activism.", "On June 3, according to the Journal Star, “Officer Erin Spilker said Lincoln Police are aware of the online rumor and are investigating its authenticity — but have found no indication that it's real.” As for Anti-Fascist Action Nebraska, they, too, have denied any involvement in its creation, calling it a hoax. In a tweet, they described the Craigslist ad as “bullshit,” adding that “you're a gullible mark with questionable motives if you believe everything you see on the internet”", "Because the post existed for less than a day, was created after the most significant unrest and violence in Omaha and Lincoln occurred, and went viral only in screenshot form in predominantly right-wing circles well after its deletion, we conclude that this is just another one of the thousands of viral but wholly inauthentic Craigslist ads floating around on the internet. The denial from Anti-Fascist Action Nebraska and the skepticism of the Lincoln Police Department further support that conclusion.", "For these reasons, we rank the claim that antifa is using Craigslist to recruit violent protests in Nebraska as \"False.\"", "Collins, Ben, et al.   \"White Nationalist Group Posing as Antifa Called for Violence on Twitter.”\r\n    NBC News.   1 June 2020.", "Myers, Quinn.   \"‘How Facebook Misinformation Turned a White Supremacist Conspiracy Into Police Action.”\r\n    MEL Magazine.   4 June 2020", "Biesecker, Michael, et al.   \"As Trump Blames Antifa, Protest Records Show Scant Evidence.”\r\n    AP News.   6 June 2020.", "Peterson, Anne Helen.   \"How The Antifa Fantasy Spread In Small Towns Across The U.S.”\r\n    BuzzFeed News.   9 June 2020.", "Godlike Productions.   “Craigslist ad from Antifa for Protesters.\"\r\n    1 June 2020.", "Mollenkamp, Allison.   \"Peaceful Protests Turn To Violence In Lincoln And Omaha.”\r\n    NET News.   30 May 2020.", "Dillard, Dalaun.   \"Thousands Gather at Omaha's Memorial Park Standing Against Racial Injustice.”\r\n    KETV Omaha.   7 June 2020.", "Lincoln Journal Star.   “Photos, Videos: Violent and Peaceful Protests in Lincoln Over George Floyd's Death.\"\r\n    3 June 2020.", "Sautter, Mike, et al.   \"Fourth Day of Omaha Protests Brings More Clashes After Curfew, But Also Signs of Unity; Council Bluffs Sees Peaceful Gatherings.”\r\n    Daily Nonpareil.   2 June 2020.", "Schulte, Grant.   \"Former Nebraska GOP Staffer Under Fire for Racist Remarks.”\r\n    The Associated Press.   11 March 2019.", "Dunker, Chris.   \"Rumors of 'Antifa' Descending on Nebraska Towns Unfounded, Police Say.”\r\n    Lincoln Journal Star.   11 March 2019.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]