["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A National Republican Senatorial Committee ad in the Indiana Senate race claims Democratic incumbent Joe Donnelly stands with the \"radical left\" on immigration.", "A National Republican Senatorial Committee ad in the Indiana Senate race will have you believe Democratic incumbent Joe Donnelly has a radical outlook on immigration. He doesn’t.", "\"We know dangerous criminals can slip through immigration at airports just like ours,\" the ad says. \"Yet Joe Donnelly stood right here with the radical left against all efforts to secure our most vulnerable entry points. Just like he stood with the radical left in Washington. Open borders, taxpayer-funded benefits. Putting them in front of Hoosiers. Joe Donnelly stood right here and showed us whose side he’s on.\"", "Donnelly has consistently voted in favor of tougher immigration enforcement. He has voted to defund sanctuary cities and called eliminating ICE a \"terrible idea.\" He voted three times to fund Trump’s border wall, and even said he would be \"fine\" providing \"$3 (billion), $3.5, $4 or $5\" billion for the wall.", "We rated a claim that he voted to grant amnesty to undocumented immigrants Mostly False.", "The clip of Donnelly is taken from a protest against President Donald Trump’s travel ban at the Indianapolis International Airport on Jan 29, 2017.", "The executive order, signed Jan. 27, temporarily halted the entry into the United States of people from seven majority-Muslim countries impacted by terrorism. It also paused admission of all refugees for 120 days and indefinitely stopped the entry of refugees from Syria.", "\"This is wrong,\" the ad shows Donnelly saying, emphasizing each word. But footage from that same speech shows he was actually quoting Republicans to support his position — not the \"radical left\".", "\"(Senators) John McCain (R-Ariz.) and Lindsey Graham (R-S.C.) came out today and said: This is wrong. This does not make us safer. And so I say to all of you here, thank you. Thank you for standing up for America and American values,\" Donnelly said.", "Donnelly was paraphrasing a joint statement McCain and Graham released on Jan. 29, 2017. \"This executive order sends a signal, intended or not, that America does not want Muslims coming into our country,\" they wrote. \"That is why we fear this executive order may do more to help terrorist recruitment than improve our security.\"", "Trump produced three iterations of the ban. The first two were struck down by the courts. The third was upheld by the U.S. Supreme Court. Trump's travel restrictions currently apply to nationals of Iran, Libya, Somalia, Syria, Yemen, North Korea and Venezuela.", "NRSC did not respond to multiple requests for comment.", "NRSC said, \"We know dangerous criminals can slip through immigration at airports just like ours. Yet Joe Donnelly stood right here with the radical left against all efforts to secure our most vulnerable entry points.\"", "Donnelly has mostly stood with Republicans when it comes to immigration. He stood with Democrats and several prominent Republicans, whom he quotes in the video, in decrying Trump’s executive order to halt the entry of people from countries impacted by terrorism. That’s not the \"radical left\".", "We rate this statement False.", "Youtube, NRSC Airport, Oct. 24, 2018", "Email interview with Kate Oehl, Donnelly press secretary, Oct. 25, 2018", "Senate.gov, Statement by Senators McCain and Graham on executive order on immigration, Jan. 29, 2017", "NRSC, Airport, Oct. 24, 2017", "Vox, The (growing) list of Republicans in Congress who have criticized Trump’s immigration order, Jan. 28, 2017", "Youtube, Senator Joe Donnelly Speaking at Rally at Indianapolis Airport, Jan 29, 2018", "Youtube, Trump Immigration Ban - Senator Joe Donnelly, Jan. 31, 2018", "Senate.gov, Vote 34, Feb. 15, 2018", "Senate.gov, Vote 119, July 6, 2016", "Senate.gov, Vote 318, Dec. 3, 2015", "Senate.gov, Vote 280, Oct. 20, 2015", "Washington Examiner, Indiana Democrat Joe Donnelly breaks with liberals on ICE, noncommittal on Kavanaugh, Aug. 7, 2018", "The Hill, Senate rejects Trump immigration plan, Feb. 15, 2018", "CQ, Fiscal 2018 Omnibus Appropriations - Motion to Concur, March 23, 2018", "CQ, Legislative Vehicle for Immigration Overhaul Measures - Cloture, Feb. 15, 2018", "Congress.gov, H.R.1625 - Consolidated Appropriations Act, 2018, Feb. 28, 2018", "Politico, Key red-state Democrat sides with Trump on wall funding, Aug. 8, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]