["About this rating", "On 3 December 2018, the Facebook page “Pictures in History” posted what appeared to be a prescription written by Elvis Presley’s doctor, George Nichopoulos, the day before the singer died at his Graceland estate in Memphis on 16 August 1977:", "Several clear indicators show this document to be a forgery. First, the ZIP code “34108” does not correspond to Memphis, Tennessee, but rather to part of Naples. The forger transposed a couple of digits, as the correct ZIP code for the Memphis address is 38104.", "Second, we find it unlikely that a doctor would spell his own name incorrectly. Presley's controversial personal physician (colloquially referred to as \"Dr. Nick\" even after he lost his medical license in 1995) was Dr. George Nichopoulos, not George “Nichopolous.” Even if Dr. Nick had accidentally misspelled his name in this one instance, though, it's still the case that the handwriting on the prescription in no way matches Nichopoulos’ actual signature. Below is his real signature as it appeared on a loan agreement between Presley and Nichopoulos signed in 1975 and the signature on the forged prescription for comparison:", "Real", "Not real", "That being said, the forged document does speak to some historical realities. The faux prescription lists a variety of drugs that were frequently prescribed for Presley while he was a patient of Nichopoulos. Dilaudid (hydromorphone) and Percodan (oxycodone/aspirin) are both narcotic painkillers, Amytal (amobarbital) and Quaalude (methaqualone) are sedative drugs that Presley used to sleep, and Dexedrine (dextroamphetamine) and Biphetamine (amphetamine salts) are both stimulants similar to Adderall. Dr. Nichopoulos prescribed them all:", "Between 1975 and 1977, he had prescribed 19,000 doses of drugs. In the first eight months of 1977 alone, he had written 199 prescriptions totaling more than 10,000 doses of sedatives, amphetamines and narcotics: all in Elvis's name.", "Nichopoulos was blamed for the singer’s death and branded a “Dr. Feelgood” in the media. In September 1981 he faced trial on “14 counts of overprescribing uppers, downers, and painkillers to Presley, entertainer Jerry Lee Lewis, himself, and eight others”:", "The two counts of the indictment dealing with Presley allege Nichopoulos \"unlawfully, wilfully and feloniously\" prescribed for the entertainer \"certain quantities\" of the synthetic narcotic, Dilaudid; the painkillers Percodan and Demerol; the sedatives Quaalude and Parest; the barbiturate Amytal; the stimulants Dexedrine and Biphetamine; and the appetite suppressant Ionamine from May 17, 1976, to Aug. 16, 1977 -- the day Presley died at the age of 42.", "Nichopoulos was acquitted on all counts in November 1981, but in 1995 the Tennessee Board of Medical Examiners permanently suspended his medical license, stating that he had been “overprescribing to numerous patients for years.”", "Nichopoulos died on 24 February 2016 at the age of 88.", "EssentialElvis.com.   \"Loan Agreement for the Nichopoulos' Home.\"\r\n    Accessed 4 December 2018.", "Higginbotham, Adam.   \"Doctor Feelgood.\"\r\n    The Guardian.   10 August 2002.", "Murphy, Pamela.   \"Elvis' Doctor Goes on Trial, Charged With Overprescribing Drug.\"\r\n    United Press International.   26 September 1981.", "The New York Times.   \"Presley's Doctor Acquitted on All Prescription Charges.\"\r\n    5 November 1981.", "Grimes, William.   \"George C. Nichopoulos, Elvis’s Last Doctor, Dies at 88.\"\r\n    United Press International.   26 February 2016.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]