["By Saranac Hale Spencer", "Posted on December 14, 2017 | Updated on December 28, 2017", "Q: Did voters in Alabama’s special Senate election get “caught voting multiple times with fake IDs”?", "A: No. The Alabama Secretary of State’s office has received no such report.", "Alabama elected its first Democratic U.S. senator in 25 years on Dec. 12 in a narrow victory over a Republican candidate who had been beset by allegations of sexual misconduct.", "The next day, a popular story on Facebook claimed that 60,000 votes cast in a heavily Democratic area might be invalid. The story was flagged by Facebook users as potentially false. It is.", "Jefferson County, which includes the city of Birmingham, voted overwhelmingly in favor of Democrat Doug Jones. Of the 219,541 people who voted in the county, 68 percent voted for Jones and 30 percent voted for Republican Roy Moore, according to the unofficial numbers from the secretary of state.", "The made-up story ran under a headline that said, “BREAKING: Black People In Birmingham Caught Voting Multiple Times With Fake IDs,” and suggested that the outcome of the election was in question. It’s not.", "The Alabama Secretary of State’s office hasn’t received reports of voter fraud of any significant scale, said Communications Director John Bennett, and it has heard of nothing that would sway the outcome of the election.", "The false story began by claiming: “The FEC has announced that it may have to recommend invalidating more than 60K votes from the Birmingham area to the Alabama Secretary of State.”", "But the Federal Election Commission enforces federal campaign finance law; it does not have jurisdiction over voting irregularities in statewide elections. The Alabama Secretary of State’s office does oversee elections in Alabama, but it has received no reports of widespread voter fraud in Birmingham, Bennett told us.", "The made-up story later uses a quote it claims was posted on the conservative news site Breitbart, but the quote didn’t actually appear on that site. And the link provided goes to a picture of donkey poop.", "The story originated on a website called Reagan Was Right, which describes itself as satirical and includes a disclaimer that says: “Everything on this website is fiction.”", "But the story was picked up and posted by several other sites that have no such disclaimer.", "Update, Dec. 28: Alabama Secretary of State John H. Merrill reiterated in a Dec. 28 interview that there’s no evidence of widespread voter fraud that would change the election results. He told CNN that his office has received “well more than 100” reports of voter fraud and has “adjudicated more than 60 of those.”", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to help identify and label viral fake news stories flagged by readers on the social media network.", "“Doug Jones elected Alabama Senator; Roy Moore won’t concede: What we know today.” AL.com. 13 Dec 2017.", "McCrummen, Stephanie and Reinhard, Beth. “Woman says Roy Moore initiated sexual encounter when she was 14, he was 32.” Washington Post. 9 Nov 2017.", "“BREAKING: Black People In Birmingham Caught Voting Multiple Times With Fake IDs.” Reagan Was Right. 13 Dec 2017.", "Bennett, John. Communications director, Alabama Secretary of State. Interview with FactCheck.org. 13 Dec 2017.", "FactCheck.org Rating:", "Read More", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]