["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "There has been a renewed focus on jobs and how many the economy has lost as Republicans and Democrats continue to do battle and threat of a government shutdown looms.", "Recently a political commentator took to Twitter highlighting job losses since across-the-board, automatic federal budget cuts -- known as sequestration -- took effect March 1.", "\"Since sequester began federal employment has been subtracting 6,000 to 7,000 jobs per month,\" the Political Line Twitter post said.", "If Political Line’s claim is correct, that would mean between 30,000 and 35,000 federal jobs have been lost for the five months, through August, that the sequester has been in effect. That type of possible job loss had us intrigued, so we decided to follow the numbers.", "PolitiFact Georgia emailed Political Line and visited its website for more information about the claim and about the author but received no response to our requests. Political Line is a political blog of postings on a variety of national topics from health care to drug policy, along with an aggregation of news stories.", "Under sequestration, the federal government will cut about $85 billion in spending by the end of the fiscal year, which ends Sept. 30. As a previous PolitiFact sequestration fact check noted, putting money into the economy does create jobs, and less money leads to fewer jobs in the short run.", "There have been numerous reports of the sequester’s impact, including departments limping along on tight budgets, employees forced to take unpaid furlough days and Head Start students being cut from the rolls.", "And this week, Washington, D.C., Mayor Vincent Gray blamed the horrific Navy Yard shooting on the sequester. When asked by CNN anchor Chris Cuomo how shooter Aaron Alexis, who was being treated for mental health issues, was still able to get access to areas that he probably shouldn’t have had, Gray responded:", "\"As I look at, for example, sequestration, which is about saving money in the federal government being spent, have we somehow skimped on what would be available for projects like this and then we put people at risk,\" Gray said on CNN’s \"New Day\" the morning after the shooting.", "Those accounts have provided anecdotal evidence about sequestration’s impact.", "But when it comes to the actual number of jobs lost to sequestration, we really just don’t know, said Scott Lilly, a senior fellow and federal budget policy expert at the Center for American Progress, a left-leaning D.C. think tank.", "\"There isn’t anyone, including (the federal Office of Management and Budget), that has gone agency by agency and says what did you do, and how did you do it, and say how many jobs were lost,\" Lilly said.", "As for Political Line’s claim, with millions of federal employees, the 6,000-7,000 monthly job loss is statistically not a big thing, Lilly said. \"You could lose that many with just inaccurate or inconsistent reporting. It makes sense to me.\"", "With no official analysis, numbers from multiple studies and financial reports have been used to detail sequester job cuts.", "In February, the nonpartisan Congressional Budget Office estimated that 750,000 more full-time jobs would be created in the U.S. economy by the end of the year without sequestration. A Goldman Sachs study, released this month, noted that the sequestration could end up costing another 100,000 federal jobs in the next few quarters, and that federal jobs have declined by 71,000 since last year.", "To get a more accurate count, we reviewed month-to-month federal government employment data from the Bureau of Labor Statistics from March 2013 (when sequestration began) through August, the most recent data available.", "Month", "All federal employees", "Month-to-month change", "Federal employees, minus postal workers", "Month-to-month change", "March", "2,762,000", "2,173,400", "April", "2,777,000", "15,000", "2,169,000", "(4,400)", "May", "2,757,000", "(20,000)", "2,168,200", "(800)", "June", "2,761,000", "4,000", "2,172,100", "3,900", "July", "2,753,000", "(8,000)", "2,162,000", "(10,100)", "August", "2,752,000", "1,000", "2,162,100", "(100)", "The BLS data showed that federal employment varied from month to month. Some months saw job losses exceeding Political Line’s claim of 6,000 to 7,000 jobs lost; but other months saw job gains.", "So what about Political Line’s claim?", "The political blogger said in a Twitter post that since sequestration, federal government jobs have decreased 6,000-7,000 jobs a month. There has been no official analysis of jobs lost to the sequester. There is anecdotal evidence that the budget cuts have hurt the federal sector, but at the same time, there have been job gains -- albeit marginal -- in the private sector.", "Using the best data available from the Bureau of Labor Statistics, the numbers show that some months federal job losses reached and exceeded Political Line’s claim, but in other months, the losses were much less, and there were even job gains.", "Political Line’s statement contains an element of truth, but it needs clarification and additional information. Reviewing the data over the previous 12 months does show an overall downward trend in federal government jobs, but the monthly totals fluctuate.", "And overall the job reduction is far less than the statement would indicate.", "We rate it Mostly False.", "Political Line twitter post, Sept. 11, 2013", "Huffington Post, \"Sequestration could cost 100,000 federal jobs within year: Goldman Sachs report,\" Sam Stein, Sept. 11, 2013", "The Atlanta Journal-Constitution, \"U.S. Attorney Sally Yates: ‘Nobody is a success on their own,’\" Henry Unger, Sept. 14, 2013", "Congressional Budget Office, \"Automatic reductions in government spending -- aka sequestration,\" Wendy Edelberg, Feb. 28, 2013", "Congressional Budget Office, \"The 2013 long-term budget outlook,\" Sept. 17, 2013", "Bureau of Labor Statistics, Federal government employment, 2003 to 2013, generated Sept. 16, 2013", "Bureau of Labor Statistics, Federal government employment (minus USPS), 2003 to 2013, generated Sept. 16, 2013", "The New York Times, \"The sequester starts to show,\" Annie Lowrey, June 7, 2013", "PolitiFact, \"Reid says sequester has already cost 1.6 million jobs,\" Jon Greenberg, Aug. 1, 2013", "Washington Times, \"D.C. Mayor Vincent Gray: Sequester cuts ‘put people at risk,’\" Jacqueline Kilmas, Sept. 17, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]