["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "The Democratic nominee for lieutenant governor of Texas questioned whether Republican nominee Dan Patrick understands the linked economies of neighboring Texas and Mexico.", "In a June 1, 2014, interview on MSNBC’s \"Up With Steve Kornacki,\" state Sen. Leticia Van de Putte of San Antonio said she might ask voters to consider Patrick’s personal debts related to his bankruptcy in the 1980s. More than that, she said, \"it’s the direction that he would bring this state. If really he’s such a great businessman, how come he doesn’t realize that our trade with Mexico is $720 million a day? That’s our No. 1 trading partner. Yet he chooses to demean and insult the people who live ... in the border areas, that are such a vibrant part of our economy.\"", "Patrick, a Houston state senator, can speak for himself on what he knows about trade and the border region. We wondered how Van de Putte reached her $720 million-a-day statement and the declaration of Mexico as the state’s No. 1 trading partner.", "Emmanuel Garcia, a Texas Democratic Party spokesman, responded on Van de Putte's behalf, saying by email the senator drew on a Feb. 26, 2013, news article in the Austin Business Journal and a report, last updated in May 2014, from Gov. Rick Perry’s office stating Mexico was the state's No. 1 trading partner in 2013.", "The article, describing a meeting of the Texas House Committee on International Trade and Intergovernmental Affairs, said trade \"between Texas and Mexico is worth $720 million a day, according to the governor’s office.\"", "We watched the House’s archived video of the hearing, which showed Amir Mirabi of the governor’s office telling the panel Texas accounts for $720 million a day, on average, in trade with Mexico. \"We’re in a very, very sweet spot that we need to maintain,\" Mirabi testified.", "Tricia Horatio, an aide to the committee chairman, state Rep. Rafael Anchia, D-Dallas, emailed us Mirabi’s presentation, which included a chart indicating Texas in 2011 accounted for $262 billion in imports from and exports to Mexico--or some $718 million in trade a day. The per-day figure becomes $720 million, Perry spokeswoman Lucy Nashed told us by email, if one leaves out New Year's and Christmas Day \"when most Texas and Mexico sea/inland ports are closed.\"", "Nashed said the 2013 presentation relied on \"port-level import data, which was the best available to us at the time.\" But the governor no longer draws on port-level import data, she said, relying instead on U.S. Census Bureau breakdowns of each state’s imports and exports.", "Census bureau, here we come.", "And to our inquiry, Mala Mistry, a bureau statistician, provided a chart drawing on its import and export figures for Texas and Mexico. In 2013, according to the chart, Texas exported nearly $101 billion in goods to Mexico and imported nearly $95 billion worth. The total Texas-Mexico trade that year averaged about $539 million a day--up from $535 million in 2012 and $495 million in 2011--the year for which the governor’s office in testimony estimated $720 million a day in trade between the state and nation.", "Top Texas Trading Partners, 2013", "(U.S. Census Bureau estimates)", "Source: U.S. Census Bureau, June 2014", "We brought the bureau’s trade figures to Van de Putte’s attention. Garcia said by email that going forward, she will rely on that data to quantify Texas trade with Mexico.", "Our ruling", "Van de Putte said our \"trade with Mexico is $720 million a day; that’s our No. 1 trading partner.\"", "In 2013, Mexico was by far the nation with the most trade with Texas. But Texas-Mexico trade per day added up to $539 million, nearly $200 million less than the 2011 estimate Van de Putte drew from a 15-month-old presentation by the governor’s office.", "We rate this claim, which lacked the latest available authoritative information, as Mostly True.", "MOSTLY TRUE – The statement is accurate but needs clarification or additional information.", "Click here for more on the six PolitiFact ratings and how we select facts to check.", "CORRECTION, 10:15 a.m., June 16, 2014: We amended the ruling to make it clear that daily trade in 2013 amounted to more than $500 million -- not annual trade. This didn't affect our rating.", "Emails on behalf of Leticia Van de Putte, Emmanuel Garcia, communications director, Texas Democratic Party, June 2 and 9, 2014", "News article, \"Transportation links to Mexico key for Mexico trade,\", Austin Business Journal, Feb. 26, 2013 (accessed June 4, 2014)", "Report, \"Overview of the Texas Economy,\" Office of the Governor, Economic Development & Tourism, updated May 2014 (accessed June 4, 2014)", "Powerpoint presentation, \"Trade and the Texas Success Story,\" Amir Mirabi, director, Small Business and Exports, Small Business Advocate, Office of Gov. Rick Perry, Feb. 25, 2013 (received by email from Tricia Horatio, general counsel/legislative director, Rep. Rafael Anchia, June 5, 2014)", "Emails, Lucy Nashed, press secretary, Gov. Rick Perry, June 5-6, 2014", "Emails (excerpted), Mala Mistry, supervisory statistician, Data Dissemination Branch, Foreign Trade Division, U.S. Census Bureau, June 6, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]