["About this rating", "A photograph showing the words \"F*ck Kavanaugh\" on a sign for South Charlotte Middle School is real.", "This sign was defaced in an act of vandalism; it was not created or sanctioned by any teachers or school officials.", "A photograph showing a derogatory remark aimed at newly confirmed Supreme Court Justice Brett Kavanaugh and displayed on a sign outside of South Charlotte Middle School sign went viral on social media in October 2018. While school officials set about investigating the incident, a number of suspicious Twitter accounts started spreading the photograph along with the claim that the words \"Fuck Kavanaugh\" were put on the sign by \"socialist teachers,\" and that the message reflected the type of lesson \"Democrats (were) teaching our children:\"", "Here are some of the messages that were attached to this image as it circulated online:", "This is an undoctored photo taken in Charlotte, NC on 10/07/2018.", "This is what Democrats are teaching our children.", "Your education system at work. Socialist teachers union must be abolished.", "Parents need to find Christian or Charter schools and use those vouchers or home school. Take your kids out of these indoctrination camps if you love them!", "Wanna know WHY I left my home town? This ? right here! @CharMeckSchools #LiberalIndoctrination! Teaching our kids HATE instead of DEBATE! They tried to deny this happened using an old pic. But 3 folks individually captured this pic! #StopFederalFunding of our schools!", "Shameful! Now we are understanding the reason we have all these kids protesting against they don't know why or what just to be paid to scream by Soros and people like him. Kids deserve better, go to your boards of education and ask questions!", "This image is a genuine photograph of a sign standing outside of South Charlotte Middle School and displaying the words \"Fuck Kavanaugh.\" However, the message on the sign was the product of vandalism; it was not purposefully displayed by school administrators, \"socialist teachers,\" or general \"Democrats\" in an attempt to indoctrinate children.", "Charlotte-Mecklenburg Schools (CMS) spokesman Tracy Russ said that she initially believed the image was \"fake news\" — doctored images of signs, after all, can be found in abundance on social media — and the CMS Twitter account originally labeled the image as such. But after a brief investigation the school discovered that the sign had truly had been altered to display a curse word:", "Tuesday morning Russ confirmed: The message was real. Someone apparently altered the school’s sign, which Russ said had another message on it and should have been locked, to reflect dissatisfaction with Kavanaugh’s confirmation.", "“We thought it had been fake. It turns out it was real,” Russ said.", "Russ said the principal learned of the message and removed it “pretty quickly.” Russ said CMS is checking security cameras to see if the culprit was recorded, but as of Tuesday morning he said the district doesn’t know how the sign was altered or who did it.", "“CMS messaging guidelines, Board policies and codes of conduct forbid use of profanities in any communications. CMS is investigating this matter with law enforcement,” he said in a statement sent Tuesday morning.", "School Principal Lisa Bailes also released a statement on Facebook confirming the existence of the defacement and an investigation into it:", "This is a message from Principal, Lisa Bailes, An exterior sign at South Middle School was vandalized over the weekend. A picture posted to social media Monday evening 10/8 by a community member initially appeared to show a faked alteration of the sign and content. This determination was made after on-site investigation within one hour of the social media post showed the sign was confirmed clear of all content on Monday evening. Later corroboration of the initial posted image and review of the incident from school staff confirmed the sign had been defaced over the weekend with an inappropriate message that was removed early Sunday by staff members. CMS messaging guidelines, Board policies and codes of conduct forbid use of profanities in any communications. CMS is investigating this matter with law enforcement.", "WCNC-TV.   \"Vulgar Anti-Kavanaugh Message Left Outside South Charlotte Middle School.\"\r\n    10 October 2018.", "Helms, Ann.   \"‘Not Fake’: Vulgar Political Jab at Kavanaugh on CMS Middle School Sign Was Real.\"\r\n    Charlotte Observer.   9 October 2018.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]