["About this rating", "As Hurricane Dorian swirled in the Atlantic Ocean in early September 2019, a viral video supposedly showing the huge storm approaching Miami, Florida, started circulating on social media:", "#HurricaneDorain over #Florida ! Pray it passes without doing much damage & zero loss of life ? pic.twitter.com/dybG8jy8lY", "— TruthBeTold (@CanUHandleItBud) September 2, 2019", "This is not a genuine video of Hurricane Dorian. In fact, it's not a genuine video of any weather system approaching any coastal city. This is actually a composite of at least two different images.", "The foreground of this animated image was taken from a stock photograph of Miami Beach, Florida. The cloud portion of this image appears to come from a May 2016 photograph of large supercell storm over Leoti, Kansas:", "Digital artist Brent Shavnore first put these two images together for an artwork he shared to his Instagram page in April 2019:", "\"The world outside had it's own rules, and those rules were not human.\" Michel Houellebecq", "A post shared by  Bʀᴇɴᴛ Sʜᴀᴠɴᴏʀᴇ (@shavnore) on Apr 12, 2019 at 9:14am PDT", "Shavnore's artwork was later animated by Instagram user @TheGlitch.org:", "\"There is peace even in the storm.\" - Vincent van Gogh Photos taken by @shavnore Animation by TheGlitch @theglitch.og Audio on ?? . . . #theglitch #plotaverse #creativeoptic #all2epic #theuniversalart #leagueoflenses #nyc_explorers #MillionDollarVisuals #enter_imagination #shotzdelight #gramslayers #thecreativeshots #edit_grams #thecreativers #clickimagine #fxcreatives #manipulationteam #igcreative_editz #thegraphicspr0ject #XceptionalEdits #artofvisuals #visualambassadors #art #InfiniteArtDesign #nature #manipulation #digitalcontentors @natures @natgeo @earth @earthofficial", "A post shared by  ♏TheGlitch♏ (@theglitch.og) on May 18, 2019 at 8:24am PDT", "Shavnore's Facebook page describes his artwork as \"mind blowing dreamy images of seascapes and anything imaginable.\" While much of his work borders on the surreal, this isn't the first time that someone has tried to pass off one of his pieces as genuine. In May 2018, another one of his digital creations was shared as if it were a genuine photograph of Subtropical Storm Alberto approaching Pensacola Beach.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]