["The Seminole Tribe of Florida is trying to convince the Legislature that approving a new gaming compact is a safe bet.", "As lawmakers consider a plan negotiated between the Seminoles and Gov. Rick Scott, the tribe has started running commercials with the message that the agreement helps the state. One of the ads ticks off several benefits of the deal Scott has touted to the Legislature, which has been reluctant to agree to the compact.", "\"The governor authorized a new and unprecedented Seminole compact: Nearly 20,000 new Florida jobs; $3 billion in guaranteed revenue, the largest share for any state in history; and for the first time, empowering the Legislature to limit expansion to keep Florida's entertainment options family friendly,\" the commercial said.", "That’s a lot to pack into one 30-second spot. PolitiFact Florida was especially curious about the $3 billion in payments the tribe promised the state. Is it really the most any state has received from Indian gaming in history?", "It looks like the odds are in the tribe’s favor.", "Reaching an agreement", "This is a very convoluted subject, but here’s a quick-start look at the issue:", "Since 1988, the U.S. government has allowed federally recognized Indian tribes to run gambling establishments on tribal land. But if a tribe wants to have certain Las Vegas-style games at its casino known as Class III games (blackjack, roulette, slot machines and so forth), it must reach a legal agreement with its state, called a compact.", "The Seminole tribe reached a deal with then-Gov. Charlie Crist in 2010 that allowed them to operate banked card games — games in which players bet against the house instead of each other — at five of its seven casinos across the state.", "The Seminoles agreed to pay Florida for exclusive rights to operate these games, plus slot machines at four casinos outside Miami-Dade and Broward counties. These revenues usually amounted to well over $200 million per year for the state.", "The compact expired in July 2015, with a renewal deadline of Oct. 31, 2015. There hasn’t been a new agreement, leading to lawsuits between Florida and the Seminoles over who can operate these games. The tribe continues to operate the Class III games of blackjack, chemin de fer and baccarat at those five casinos without a compact.", "In December 2015, Scott announced he had formed a new compact with the Seminoles. Among the details in the 20-year deal is a promise that the tribe could expand craps and roulette at their casinos and offer blackjack exclusively for seven years. The tribe would guarantee a minimum of $3 billion in payments to the state over those seven years.", "The Legislature is considering approving the compact during the 2016 session. On Feb. 9, the House Regulatory Affairs Committee okayed a bill to ratify the compact, but the Senate delayed its vote.", "Is that $3 billion in guaranteed revenue to Florida the most any state has ever gotten, as the Seminoles’ commercial says? It’s the \"guaranteed\" part that tips the tribe’s hand.", "Comparing compacts", "Dozens of Indian tribes have gaming compacts in 26 states, and the details differ not only among states, but among tribes in a given state. While tribes can reach agreements to share revenue with local governments and pay regulatory costs, we’re just looking at how much states get.", "Comparing these compacts is a tall order. Given the nature of the industry, casinos are always opening and closing, contract terms are being updated or changed, and the terms of the payments tribes give differ depending on the compact. That’s especially true when considering states like Connecticut, which receives a lot of money but bases compact payments on a percentage of casino earnings, or Washington, which negotiated compacts so money goes to local governments instead of the state.", "The Seminoles currently pay the state quite a bit for a single tribe, which we can illustrate with overall earnings and revenue-sharing figures.", "In California, for example, tribal casinos make about $7 billion per year, highest in the nation. Of that, they give about $241 million to the state in 2014. (The state had compacts with 73 tribes in 2014, but only 11 of those tribes paid into the general revenue fund.) Tribes in Oklahoma, which generated $3.8 billion in gaming revenues from 124 casinos, paid the state about $125 million in 2013.", "Florida is in third place for total gaming revenues, with more than $2.3 billion from eight casinos. The Seminoles operate seven of those to make the lion’s share of the revenue, and as we mentioned, more than $200 million of those revenues go to the state annually. (The Miccosukee tribe, which operates an eighth casino in the Miami area, does not need a compact based on the games it offers.)", "Robert Jarvis, a law professor at Nova Southeastern University in Fort Lauderdale, said the Seminoles can afford to give the state so much because they enjoy several distinct advantages tribes in other states do not.", "The Seminoles live on land close to population centers, like the Hard Rock casinos in Tampa and Hollywood. They also don’t have to fight with other tribes for customers. It doesn’t hurt that this is Florida, where tourists flock and bring gambling money with them.", "These factors affect how the Seminoles have negotiated with the state. The new Seminole compact offers the guaranteed $3 billion in rising increments, from $325 million the first year up to $550 million in the seventh year.", "There are other provisions and potential payments in the compact, but that $3 billion is money the tribe has promised to pay no matter what. Even though apples-to-apples comparisons are difficult, by that final year the Seminoles would be paying more than the total any other single state gets from all its tribes.", "The Seminoles are willing to pay out a lot more than other tribes, Jarvis said, because they want exclusivity in a market that the Legislature could open up to other casino developers.", "\"The real question here is not the money, which in a budget as big as Florida’s really amounts to a rounding error,\" he said. \"It’s about expanding gambling in Florida. And if you’re for that, the question becomes, who do you want to run the casinos, the Seminoles or someone else?\"", "Our ruling", "The Seminole Tribe of Florida said their new gambling compact offers \"$3 billion in guaranteed revenue, the largest share for any state in history.\"", "The tribe's point about guaranteed compensation over seven years holds up when focused on total dollars. But there's no easy way to make apples-to-apples comparisons of the details between various states and their gaming compacts. Some states have compacts with many other tribes. Some deals call for tribes to split a portion of revenues only with local governments.", "The takeaway from the ad is Florida is getting the best financial deal of any state in the country, but the finer points aren't clear. We're going to hedge our bets and rate the statement Mostly True.", "YouTube, \"Letter,\" Jan. 7, 2016", "Forbes, \"Native American Casino And Tax Rules That May Surprise You,\" Oct. 11, 2012", "RubinBrown LLP, \"Commercial and Tribal Gaming Stats 2014,\" April 2014", "South Florida Sun Sentinel, \"Gambling’s value to Florida debated,\" Dec. 9, 2014", "The Oklahoman, \"Oklahoma Indian gaming revenues rise while fees to state drop,\" March 30, 2015", "Florida Office of Economic and Demographic Research, \"Gaming: Revenue Overview,\" March 26, 2015", "Las Vegas Review-Journal, \"Report: Indian gaming revenue hits record $28.3 billion in 2013,\" March 30, 2015", "Casino City Press, \"Indian Gaming Industry Report 2015 (Executive Summary),\" March 2015", "Native Times, \"Oklahoma Indian gaming revenues rise while state fees fall,\" April 1, 2015", "State of Washington, \"The Colville Indian Tribe Opens New Casino,\" July 30, 2015", "Arizona Republic, \"How tribal gaming impacts Arizona’s economy: 15K jobs, $1.81 billion,\" Oct. 8, 2015", "Sacramento Bee, \"California’s share of Indian gambling money dwindles,\" Sept. 6, 2015", "Tampa Tribune, \"Seminole tribe sues Florida in midst of talks over gaming pact,\" Oct. 26, 2015", "Tampa Bay Times Buzz blog, \"Despite deadline, Seminole Tribe keeps dealing black jack -- as state predicted in 2012,\" Oct. 31, 2015", "Indian Country, \"California Indian Gaming Reaches $7 Billion Again,\" Oct. 31, 2015", "Tampa Bay Times Buzz blog, \"Seminole Tribe airing ads calling for new gaming compact,\" Nov. 5, 2015", "Florida Office of Economic and Demographic Research, \"Revenue Estimating Conference Indian Gaming Revenues Executive Summary,\" Dec. 2, 2015", "Miami Herald, \"Deal: Florida Gov. Rick Scott signs $3 billion gambling compact with Seminole Tribe,\" Dec. 7, 2015", "Broward-Palm Beach New Times, \"Seminole tribe wins big with new compact, expands Florida gaming,\" De. 9, 2015", "Politico Florida, \"Seminoles preparing $500K ad buy to push passage of gaming compact,\" Jan. 8, 2016", "Tampa Bay Times Buzz blog, \"Seminole Tribe launches two new ads to promote long-shot compact,\" Jan. 19, 2016", "Miami Herald, \"Seminole Tribe, Gov. Rick Scott tie $1.8 billion expansion to gambling compact, job creation,\" Feb. 1, 2016", "Associated Press, \"Gov. Rick Scott, Seminole Tribe point to Tampa expansion if gaming compact is approved,\" Feb. 1, 2016", "GamingToday.com, \"Seminoles pressure Florida lawmakers,\" Feb. 3, 2016", "Tampa Bay Times, \"Florida House committee advances bill to expand casino games,\" Feb. 9, 2016", "Seminole Tribe of Florida, Gaming facilities, accessed Feb. 3, 2016", "JobsForFlorida.com, \"The New Seminole Compact,\" accessed Feb. 3, 2016", "2009 Seminole gaming compact, via Miami Herald, accessed Feb. 3, 2016", "2010 Seminole gaming compact, via Florida Senate, accessed Feb. 3, 2016", "2015 Seminole gaming compact, via Miami Herald accessed Feb. 3, 2016", "U.S. Interior Department/Indian Affairs, Gaming compacts, accessed Feb. 3, 2016", "Interview with Robert Jarvis, Nova Southeastern University law professor, Feb. 3 and 5, 2016", "Interview with Sarah Crawford, National Indian Gaming Commission spokeswoman, Feb. 3 and 5, 2016", "Email exchange with Alan Meister, Nathan Associates Inc. economist, Feb. 4, 2016", "Interview with Nedra Darling, U.S. Bureau of Indian Affairs spokeswoman, Feb. 4, 2016", "Interview with Gary Bitner, Seminole Tribe of Florida spokesman, Feb. 5, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]