["A month after the presidential election, many pro-Trump groups still refuse to accept the results. Fueled by election conspiracy theories echoed by the president, thousands congregated in the nation’s capital on Dec. 12 to protest the results.", "Supporters of the president shared images online claiming to show millions of people marching in Washington’s streets. The claim circulated widely on social media with some challenging the posts.", "“The 1 million for Trump March lived up to name. In Washington DC. From Today,” the conservative commentator Ron Dwyer said on Facebook. USA TODAY reached out to Dwyer for comment.", "The image is not from a pro-Trump rally, but rather an aerial view of the pro-gun control March for Our Lives rally held in March 2018.", "Fact check:Joe Biden legally won presidential election, despite persistent contrary claims", "In February 2018, a gunman shot and killed 17 people and injured 17 others in a shooting at Stoneman Douglas High School in Parkland, Florida. The incident, among a string of high-profile shootings in recent years, renewed calls for gun control.", "The ensuing March 2018 event, called March for Our Lives, was a student-led effort to convene in the nation’s capital and demand gun control policies, which activists believed would prevent further shootings. The Washington, D.C., event saw an estimated 800,000 people attend, while nearly 900 affiliated events took place across the country.", "Photos and reporting of the event are easily found online. The photo erroneously described as a pro-Trump rally in 2020 was an aerial view of one vein of the 2018 gun-control march taken by Shannon Finney for Getty Images. The image is owned by Getty.", "Some organizers of the March for Our Lives rally, many of whom were victims of various forms of gun violence, including the Parkland shooting, derided pro-Trump pages for incorrectly attributing the image online.", "A month after Trump’s defeat in the presidential election, many of the president's most ardent supporters remain unconvinced. Fueled by conspiracy theories echoed by the president, organizers planned a Saturday rally ahead of the Electoral College’s Dec. 14 vote. The vote proceeded as planned, cementing Biden’s victory.", "The Saturday event drew large crowds to Washington’s Freedom Plaza near the White House, where organizers had projected about 15,000 people would convene.", "The groups present included conservative religious groups, far-right militant organizations like the Proud Boys, white nationalist organizations and some popular conservative media personalities.", "Pro-Trump figures, including former National Security Adviser Michael Flynn, Dr. Sebastian Gorka and evangelical Christian radio host Eric Metaxas, gave speeches at Freedom Plaza, east of White House.", "Elsewhere, militant groups marched toward the Supreme Court and sparred with counterprotesters in Black Lives Matter Plaza, near the White House.", "Images of the event are widely available. They depict group sizes in the rangeexpected by organizers.", "While many online claimed that the photo in question was taken of a large pro-Trump rally on Dec. 12, the image is actually of a student-led gun control march two years earlier. The image is copyrighted to Getty Images. We rate this claim FALSE because it is not supported by our research.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more."]