["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "As the novel coronavirus spreads in the United States, so does misinformation.", "More than 5,000 people have shared a Feb. 28 Facebook post, for example, that warns \"the coronavirus has made it to Mississippi.\"", "\"And the lady that caught it wasn’t around nobody with it which means it is airborne,\" the post continues. \"That means if the wind blows it your direction you’ll have it also.\"", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "First of all, as of March 3, it doesn’t appear that there are any confirmed cases in Mississippi of COVID-19, the disease caused by the coronavirus. The Mississippi State Department of Health website says \"there are currently no cases of COVID-19 in Mississippi.\" The Centers for Disease Control and Prevention reported that there are 60 confirmed cases in the U.S. in 12 states as of March 3, but Mississippi is not one of them.", "Because COVID-19 is a new disease, researchers are still learning about how it spreads. But according to the CDC, the virus is thought to spread mainly from person to person, either between people within sixfeet of each other or through respiratory droplets when an infected person coughs or sneezes. It’s also possible that someone could get COVID-19 by touching something that has the virus on it and then touching their mouth, nose or eyes, but the CDC says this isn’t the main way the virus spreads.", "Noreen Hynes, director of the John Hopkins Geographic Medicine Center, told PolitiFact in an email that talking — especially when saying words with the letters \"t\" or \"d\" — could also spread the droplets that can cause infection when they come into contact with the mucous membranes of someone’s eyes, nose or mouth.", "The spread of coronavirus via such droplets has been documented. Airborne transmission has not been documented but, Hynes said, it \"has been hypothesized to occur.\"", "Hynes explained that \"airborne transmission\" refers to when residue from evaporated respiratory droplets contains a microorganism and can linger suspended in the air for a long time.", "\"The organism on such droplet nuclei, as they are called, must be capable of surviving for a long time outside the body and must be resistant to drying,\" Hynes said. \"Such droplet nuclei act like a gas, allowing organisms to enter both the upper and lower respiratory tract. Diseases associated with airborne transmission include measles, chickenpox and tuberculosis.\"", "But the University of California San Francisco says in a Feb. 13 post on its website that the new coronavirus \"isn’t believed to be an airborne virus, like measles or smallpox, that can circulate through the air.\"", "Charles Chiu, a doctor who studies infectious diseases at the university, is quoted in the post as saying: \"If you have an infected person in the front of the plane, for instance, and you’re in the back of the plane, your risk is close to zero simply because the area of exposure is thought to be roughly six feet from the infected person.\"", "There’s a difference between viruses that are transmitted by droplets and things that are aerosolized and float around in the air, according to University of Chicago Medicine.", "The school puts it like this: \"Think of droplets as small bits of fluid that you can see and feel when someone sneezes. You sneeze or cough and these droplets get on surfaces and then you touch them and get them on your hands, or they can fly right into your mouth or nose or eyes. That’s how most coronaviruses are transmitted and that’s how we think this one is too.\"", "Now consider an aerosol — like hairspray. You may still be able to smell it a while after someone has used it because it’s lingering in the air, according to the school: \"Obviously we’re learning a lot about this virus, but most coronaviruses aren’t airborne this way. Generally speaking, there may be times when some of these droplets or particles are airborne, but it’s limited.\"", "Our ruling", "The Facebook post says a woman in Mississippi was infected by the coronavirus and that it was airborne.", "We’re still learning about the coronavirus and how it spreads, but this isn’t accurate.", "Currently, there are no confirmed cases in Mississippi, and while it has been suggested that coronavirus could be airborne, it hasn’t been documented to spread that way. Rather, the virus’s spread has been documented via respiratory droplets mainly when an infected person coughs or sneezes.", "We rate this Facebook post False.", "Facebook post, Feb. 28, 2020", "Mississippi State Department of Health, Coronavirus disease 2019, visited March 2, 2020", "Centers for Disease Control and Prevention, Coronavirus disease 2019 (COVID-19) in the United States, updated March 2, 2020", "Centers for Disease Control and Prevention, How COVID-19 spreads, page last reviewed Feb. 28, 2020", "John Hopkins Medicine, Coronavirus disease 2019 vs. the flu, visited March 2, 2020", "University of California San Francisco, How the new coronavirus spreads and progresses — and why one test may not be enough, Feb. 13, 2020", "University of Chicago Medicine, COVID-19: What we know so far about the 2019 novel coronavirus, Feb. 13, 2020", "Email interview with Noreen Hynes, director of John Hopkins Geographic Medicine Center, March 2, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]