["A photo has been shared in multiple Facebook posts that claim it shows a young girl pulling her father in a rickshaw to honor him after she passed her exams. The claim, however, is missing context; the image shows a travel blogger posing for a photo with an unrelated rickshaw driver in Calcutta, India.", "The photo has been shared more than 5,900 times since it was published on Facebook here on December 7, 2020.", "“This girl topped the new batch recruited to the Indian Administrative Service. This is how she showed her father to the world,” the Sinhala-language text superimposed on the image reads.", "The Facebook post’s caption translates as: “Be ashamed if you cannot acknowledge your father in front of others”.", "The image was also shared alongside similar claims on Facebook here, here and here.", "The claim, however, is misleading.", "A reverse Google image search found that the photo in fact shows a travel blogger called Shramona Poddar posing in Calcutta, India.", "Poddar posted the image on her Instagram page here on April 25, 2018. The photo is credited to another Instagram user named Bhaskar Chal.", "Below is a screenshot comparison of the image published in the misleading posts (L) and the photo published on Instagram (R)", "In the Instagram post’s caption, Poddar explains that she tried hand-pulling a rickshaw to understand how strenuous the job is.", "“I realized though there's a lot of mechanism involved, it wasn't a piece of cake at all,” the caption reads.", "Bhaskar Chal, the photographer credited in Poddar’s post, also confirmed the story behind the photo and denied that it shows a father and daughter.", "“The claim that the man sitting in the rickshaw is her father and that she is an IAS topper and so on the story goes is so not true,” Chal told AFP on Instagram on February 1, 2021.", "“In fact, to give the picture more depth, the owner himself was asked to sit in the rickshaw,” he said.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]