["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Screeshot from YouTube video -", "A pair of ads attack Karofsky as “soft on crime,” highlighting a 1999 case when she was a Dane County prosecutor", "But Karofsky wasn’t involved in that case until more than a year after the defendant was convicted and sentenced", "Researchers misinterpreted the online court records", "With the April 7, 2020 election bearing down, a national Republican group has jumped in the race for Wisconsin Supreme Court, attacking challenger Jill Karofsky.", "Liberal groups have lined up behind Karofsky in her battle against incumbent Daniel Kelly and his conservative backers. At stake is a 10-year seat on the state’s highest court, where conservatives currently hold a 5-2 majority.", "The Republican State Leadership Committee released multiple ads March 26, 2020, addressing Karofsky’s time as a Dane County prosecutor 20 years ago.", "Backed by the requisite ominous music, one ad says this:", "\"Liberal Jill Karofsky — dangerously soft on crime. As prosecutor, Karofsky even went easy on criminal predators, like no jail time for a monster who sexually assaulted a 5-year-old girl.\"", "A second ad uses almost identical wording, saying \"as a prosecutor, she went easy on criminal predators.\"", "In both ads, on-screen text notes the case in question is that of Donald A. Worley.", "But a closer look at the case file reveals a major oversight in the ad.", "Here’s what we found.", "The Republican State Leadership Committee — which seeks to elect down-ballot state officials — is no stranger to Wisconsin politics. It made late forays into a number of previous races, including ads in support of conservative Brian Hagedorn in his successful 2019 Supreme Court bid and in support of Republicans when they took over control of the state Legislature in 2010.", "This time around it's spending its money attacking Karofsky by highlighting the Worley case. Wisconsin Manufacturers and Commerce is also funding airtime for the ad.", "The Madison man, then 26, was charged in February 1999 with child enticement and first-degree sexual assault of a child — serious felonies that carried decades of potential prison time.", "A plea agreement reached in March 2000 reduced both offenses to misdemeanors, and Worley was sentenced to three years probation with no jail time, online court records show.", "Those online records list Karofsky as the prosecutor, which is what both groups pointed to when asked for evidence backing the ad.", "But they missed a critical detail: online court records list only the most recent prosecutor. Many district attorneys' offices have different prosecutors handle hearings over the course of a given case, and that’s what happened here.", "The prosecution’s file from Worley’s case, provided by Karofsky’s team, details which prosecutor handled different elements of the case.", "The prosecuting attorney for each appearance initials the file, and Dan Martin’s initials are listed alongside appearances from the preliminary hearing in February 1999 to the request to close the case in March 2000 following the sentencing hearing.", "So Martin — not Karofsky — was at the controls when the plea deal was made.", "The file shows Karofsky didn’t touch the case until more than a year after the plea agreement and sentencing. She represented the office for a motion hearing in July 2001, where the state requested that Worley not be allowed to remain in his family residence.", "Dane County District Attorney Ismael Ozanne confirmed the accuracy of the case file record in an email to PolitiFact Wisconsin.", "Karofksy’s campaign issued a news release March 27, 2020, demanding the ads be taken down, and noting a cease-and-desist letter would be issued.", "A pair of attack ads say Karofsky was \"soft\" as a prosecutor because she allowed Worley to get away with no jail time.", "But Karofsky didn’t touch the case until more than a year after the plea agreement reducing the charges and the sentencing imposing no jail time. The ad is based on sloppy research that misunderstood the meaning of the online case records.", "We rate this claim Pants on Fire.", "Wisconsin online court records, Dane County case 1999CF396, filed March 1, 1999", "YouTube.com, JFI Wisconsin Advertisement - Kelly v. Karofsky, March 26, 2020", "YouTube.com, Liberal Jill Karofsky, March 26, 2020", "Email exchange with Sam Roecker, spokesman for Jill Karofsky, March 27, 2020", "Email exchange with Ismael Ozanne, Dane County district attorney, March 27, 2020", "Email exchange with Stami Williams, spokeswoman, Republican State Leadership Committee, March 27, 2020", "Email exchange with Nick Novak, spokesman, Wisconsin Manufacturers and Commerce, March 27, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]