["About this rating", "Joe Exotic was put into isolation after another prisoner tested positive for COVID-19.", "As of this writing, Exotic has not tested positive for COVID-19.", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "On April 2, 2020, reports circulated on social media that Joseph Maldonado-Passage, better known as Joe Exotic from the Netflix documentary \"Tiger King: Murder, Mayhem and Madness,\" had contracted COVID-19 coronavirus disease while in prison.", "The Mirror, for instance, published an article entitled: \"Netflix's Tiger King star Joe Exotic hospitalised after contracting coronavirus in prison.\"", "This report was not accurate.", "The Mirror later updated its headline so it made a less definitive claim, writing that Exotic could have contracted the virus, but was not officially diagnosed with disease.", "This rumor started after Exotic was moved to the Fort Worth Federal Medical Center. Dillon Passage, Exotic's husband, told radio host Andy Cohen that Exotic had been put into isolation at the new facility after someone at the jail where he was previously held had tested positive for COVID-19.", "Passage said, \"We speak like three to five times every day, but [not] since he's been moved to this new facility; they are putting him on a COVID-19 isolation because of the previous jail he was at, there were cases.\"", "Passage did not say that Exotic himself had tested positive for the disease, only that he was put into quarantine after another prisoner had contracted the disease.", "You can watch Passage's interview below:", "https://www.youtube.com/watch?reload=9&v=R7CEN_iaYC0", "The Facebook page for Exotic posted the following message:", "Joe DOES NOT have the COVID-19 virus, he’s in a 14-day quarantine because he was transferred from another facility.", "Exotic was sentenced to 22 years in prison for animal abuse charges and for his involvement in a murder-for-hire scheme.", "As of this writing, Exotic has not been officially diagnosed with COVID-19.", "Madani, Doha.   \"Wildlife Park Owner 'Joe Exotic' Sentenced to 22 Years in Plot to Kill Animal Rights Activist.\"\r\n    NBC News.   22 January 2020.", "Sulway, Verity.   \"Tiger King's Joe Exotic Hospitalised and Could Have Caught Coronavirus in Prison.\"\r\n    The Mirror.   2 April 2020.", "Sulway, Verity.   \"'Netflix's Tiger King Star Joe Exotic Hospitalised After Contracting Coronavirus in Prison.\"\r\n    The Mirror.   2 April 2020.", "Spencer, Samuel.   \"'Tiger King' On Netflix: Does Joe Exotic Have Coronavirus?\"\r\n    Newsweek.   3 April 2020.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]