["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "CIA Director Gina Haspel arrives to conduct briefings for members of Congress on a targeted killing of an Iran senior military commander, Wednesday, Jan. 8, 2020, on Capitol Hill in Washington. (AP)", "• A CIA spokesperson called the claim “absurd” and confirmed that Haspel is alive and at the office. ​", "Social media users are circulating baseless rumors about the well-being of CIA Director Gina Haspel.", "\"Just heard Gina Haspel, CIA head is dead! If POTUS knew about fraud 2 1/2 yrs ago & there was a big sting OP going down, a LOT of DC, state capitals and pols are going down VERY HARD!\" reads a Nov. 30 Tweet.", "CIA spokesperson Nicole de Haay called the allegation the \"most absurd inquiry\" she had ever addressed.", "\"I’m happy to tell you that Director Haspel is alive and well and at the office,\" she wrote in a Dec. 2 email.", "The claim appears to stem from a baseless conspiracy theory that alleges the U.S. military raided the Spanish election software company Scytl in Frankfurt, Germany, and seized its servers for evidence of manipulation in the 2020 U.S. elections. Some posts claim that Scytl has links to Dominion Voting Software, the election software and hardware manufacturer that has become a frequent target of misinformation.", "The raid never actually took place.", "Both Scytl and the U.S. Army, which has been identified in some posts as having conducted the raid, told the Associated Press that it never happened. And Scytl doesn’t have any servers or offices in Frankfurt.", "Nevertheless, some social media users spread false rumors that Haspel had been involved in the raid, claiming that the Army had arrested her and sent her to Guantanamo Bay, the U.S. military prison.", "It’s unclear how these rumors began, but one of the earliest mentions we found is in an article dated Nov. 29 published by a conspiracy-oriented website called \"Rumor Mill News.\" The article misspells Haspel’s name several times.", "Shortly after the claim began to circulate, social media users began to also speculate Haspel had actually been killed in the raid, citing an anonymous \"DC Insider.\"", "None of the users who helped push the story have cited any credible sources or provided a shred of proof to back up their assertions.", "The claims about Haspel are inaccurate and ridiculous. We rate it Pants on Fire!", "A Tweet, Nov. 30, 2020", "A Tweet, Nov. 30, 2020", "A Facebook post, Dec. 1, 2020", "AP, False reports claim election servers were seized in Germany, Nov. 15, 2020", "Email interview with Nicole de Haay, CIA spokesperson, Dec. 2, 2020", "PolitiFact, No evidence Dominion Voting Systems caused widespread tabulation errors that flipped votes for Biden, Nov. 13, 2020", "PolitiFact, No, US military did not raid election software company tied to Dominion, Nov. 17, 2020", "PolitiFact, What is QAnon, the baseless conspiracy spilling into US politics? Aug. 27, 2020", "Rumor Mill News, RUMOR: CIA Director Gina Hasple (sic) arrested for treason & flown to GITMO for questioning after the Special Forces raid on the Frankfurt server, Nov. 29, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]