["About this rating", "As of this writing, the number of accounts following @realDonaldTrump was decreasing from one day to the next — a trend that began on Nov. 17. That type of consecutive daily decline over the course of almost two weeks had not happened since the start of Trump's presidency in January 2017.", "Before late November 2020, Trump's number of Twitter followers decreased from one day to the next on numerous occasions; however, that daily decrease never spanned more than two days.", "Voting in the 2020 U.S. Election may be over, but the misinformation keeps on ticking. Never stop fact-checking. Follow our post-election coverage here.", "In late November 2020, social media users called attention to the number of Twitter accounts following U.S. President Donald Trump after his reelection loss to Joe Biden.", "One such tweet (displayed below) alleged the sitting president had lost followers \"for the first time\" and included a chart supposedly depicting that trend.", "The underlying assertion — that Trump's account saw an unusual decline in followers after the election — is true; however, it is false to say the follower count had never dipped at all before, or that the number only increased or remained stagnant until late November 2020.", "Firstly, the number of Twitter accounts following @realDonaldTrump overall increased during Trump's presidency. Snopes created the below-displayed visualization of the trend based on follower analytics by Factba.se, a database of the president's public statements that uses automated software and archived screenshots to measure his account’s follower count over time.", "Next, let us unpack the claim. Socialbakers, a software company that compiles social media analytics, apparently created the tweet's data visualization. The graph measured @realDonaldTrump's millions of Twitter followers between Nov. 16 and Nov. 23, when the account was a leading tool for the president's misinformation campaign to try to lower Americans' trust in the 2020 election as states certified election results in Biden's favor.", "The graph depicted a steady decrease in followers over that time period, going from about 88.95 million followers to 88.90 million followers. Below is another visualization of the account's growth or decline in followers via Socialbakers over a longer time frame, between Election Day on Nov. 3 and Nov. 29.", "Those numbers were indeed accurate estimations, according to Factba.se.", "In other words, it is accurate to state that the president's follower account was decreasing from one day to the next in late November 2020.", "Per Factba.se, the president recorded an all-time peak follower count — 88,964,791 — on Nov. 17. Then, the following day, that total dropped by more than 18,900 accounts, and a daily decline continued with no sign of changing course as of this writing on Nov. 30.", "By that point, the president had lost almost 140,000 followers since the high point roughly two weeks earlier. (See the slight declines each day via Factba.se data below.)", "That type of consecutive daily decline over the course of almost two weeks had not happened since the start of Trump's presidency in January 2017, per Factba.se's data.", "However, it was false to claim that Trump's follower count had never before decreased. Between Jan. 20, 2017 — the day of Trump's inauguration — and Nov. 17, 2020, Trump lost followers from one day to the next on numerous occasions, per the database.", "The net losses, which ranged in size, were documented on the following dates: June 15, 2017; June 29, 2017; July 13, 2017; Jan. 30, 2018; Feb. 2, 2018; May 25, 2018; June 9, 2018; June 28, 2018; July 12, 2018; July 18, 2018; July 19, 2018; Oct. 23, 2018; Oct. 24, 2018; Nov 4, 2018; Nov. 5, 2018; Nov. 9, 2018; Nov. 29, 2018; Dec. 7, 2018; April 24, 2019; Nov. 29, 2019; Jan. 29, 2020; Oct. 31, 2020; Nov. 9, 2020; Nov. 14, 2020, and Nov. 15, 2020.", "In other words, in four instances — July 2018, October 2018, November 2018, and mid-November 2020 — Trump's Twitter account measured a follower count less than the day prior two days in a row. But in all of those cases, on the third day, the quick trend reversed and showed a net gain.", "That was not the case in late November 2020, when, as of this writing, the account tallied 13 days of consecutive net losses.", "We should note here: the data showed the total number of accounts following the president, no matter if they were associated with particular individuals, companies, organizations, or bots. The latter are run by programs attempting to spread content on social media without human involvement. Factba.se tweeted the following:", "\"We don't analyze for bot behavior,\" the tweet said. However, \"small drops daily\" — like what the president's account measured in late November — were not typically the result of bots removing themselves from accounts, per Factba.se's analysis.", "In sum, it was true in November 2020 that Trump was losing Twitter followers from one day to the next over almost two weeks — something that had not happened since the start of his presidency. However, it was false to say his follower account declined \"for the first time.\" On numerous occasions, he lost followers from one day to the next. For those reasons, we rate this claim a mixture of truth and falsehood.", "Jessica Lee is Snopes' Senior Assignments Editor with expertise in investigative storytelling, media literacy advocacy and digital audience engagement.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]