["The thumbnail was published here on Facebook on December 16, 2019, alongside a screenshot of a separate Facebook post.", "It has since been shared more than 120 times.", "The purported article is titled \"Kid Tells Mall Santa A Secret; Seconds Later Him And His Elves Are Beating The Crap Out Of A Child Molester\" and includes two images: a blurry mug shot of a man and a photo of another dressed up as Santa Claus.", "The traditional Chinese-language caption of the Facebook post shown in the screenshot translates to English as:", "“A little girl told a mall Santa, 'My wish is for my stepfather to never touch me at night again'", "\"After the girl made her wish, her stepfather was about to leave with her when he was approached by Santa and his elves.", "\"The man thought he was to be offered a present by the event organiser.", "\"He didn't expect Santa to come and beat him up~~ The elves also followed suit.\"", "The caption goes on to state a police investigation has been opened into the molestation allegation.", "Below is a screenshot of the misleading Facebook post:", "The same screenshot has been shared in several online posts since at least 2016, for instance here, here and here on Facebook, as well as here on a website called Urreply and here on Taiwanese forum CK101.", "The claim is false; the story originated on a satirical website; the local police force cited in the satirical article told AFP the report was \"false\".", "A link to thuglifevideos.com is visible in the thumbnail of the purported article, and a Google keyword search on its headline led to this article published on the website in December 2016.", "Thug Life Videos notes here that it publishes \"odd satire stories for your entertainment.”", "The article does not include the two photos in the misleading posts but describes a similar incident involving a mall Santa.", "The report adds the incident took place at Southridge Mall in Greendale, a suburb southwest of the US city of Milwaukee, Wisconsin.", "Below is a screenshot of the article:", "A Facebook keyword search on \"Santa Claus\" on the Greendale Police Department's page, which was created in 2011 and linked to the department's website, yielded no results about the incident cited in the misleading posts.", "A spokesperson for Greendale Police Department told AFP by email on December 27: \"We never responded to such an incident. I know this article went around last year or the year before, and it was false then as well.\"", "Southridge Mall, which has been active on social media since at least 2010, also did not mention the incident on either its Facebook or Twitter pages.", "The satirical article stated Milwaukee Police responded at the scene, but a spokesperson for the department told AFP in an email dated December 24, 2019, that Southridge Mall is not in their jurisdiction.", "A reverse image search on Google found a clearer version of the photo of a man published in this 2012 post by the verified Facebook account of Jacksonville Sheriff's Office, which is located in Florida, the US.", "The sheriff's office states in the post the man in the photo was arrested after he was found prowling around a home.", "Below is a screenshot comparison between the blurry photo of a man in the misleading posts (L) and the clearer version posted by Jacksonville Sheriff's Office (R):", "Another Google reverse image search found the photo of Santa in the misleading posts has been circulating online since at least October 2013, such as in a meme posted here on Facebook.", "The same false claim was previously debunked by other fact-checking organisations, such as the Associated Press and Snopes.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]