["By Eugene Kiely, Robert Farley and D'Angelo Gore", "Posted on August 4, 2017", "At a rally in West Virginia, President Donald Trump falsely claimed that his administration is “bringing back to America” manufacturing jobs “by the hundreds of thousands.” In fact, about 70,000 manufacturing jobs have been added since he took office, federal labor statistics show.", "The president also puffed up his record on creating jobs in general, and coal-mining jobs specifically. He also repeated misleading talking points on the nation’s gross domestic product, immigration, war spending and Hillary Clinton.", "Trump’s latest campaign-style speech to supporters was on Aug. 3 in Huntington, West Virginia. The president, who campaigned on a promise to be “the greatest jobs president that God ever created,” focused a good part of his speech on jobs and the economy.", "As we wrote at the time he took office, Trump inherited an economy that was experiencing steady job growth. We said that the unemployment rate was 4.7 percent and the economy had gained jobs for 75 straight months – the longest streak on record. That streak has continued and the unemployment rate has now dropped to 4.3 percent.", "Trump, however, goes too far in some cases when claiming credit for the continued economic growth.", "In criticizing the Democrats for focusing on the federal investigation into Russia’s meddling in the 2016 presidential election, Trump made a false boast about manufacturing job growth.", "Trump, Aug. 3: The reason why Democrats only talk about the totally made-up Russia story is because they have no message, no agenda, and no vision. They don’t talk about the … manufacturing jobs we’re bringing back to America by the hundreds of thousands.", "First, the Russia story, of course, is not totally made-up. The U.S. intelligence community has determined that Russian President Vladimir Putin “ordered an influence campaign in 2016,” including cyberattacks on the Democratic National Committee, to help Trump win the election. The Department of Justice and Republican-controlled congressional committees are investigating whether there was any coordination between Russia and the Trump campaign. (See “Timeline of Russia Investigation” for more information.)", "And what about those manufacturing jobs? Trump is wrong. The U.S. has not added “hundreds of thousands” of manufacturing jobs since Trump became president. The actual figure is 70,000, according to the Bureau of Labor Statistics. The U.S. had 12,355,000 manufacturing jobs in January, when Trump took office, and 12,425,000 as of July.", "Trump also said, “Since our election — not mine — since our election, we’ve added more than one million new jobs.” This has been a talking point for Trump, but it lacks context.", "First, Trump has been taking credit for jobs that were added to the economy while Barack Obama was president, as he did at a rally last month in Ohio. We measure jobs growth under Trump from the time he took office in January. By that measure, the economy has added nearly 1.1 million jobs from January through July, according to the BLS.", "But let’s put that 1.1 million figure into context. During that same period a year ago, the U.S. economy added more than 1.2 million jobs — so the nation continues to add jobs under Trump, although at a tad slower pace.", "As we’ve written, the U.S. economy has been adding jobs every month since October 2010 — a record-setting 82 straight months, as of July.", "Trump also boasted that his administration is “putting our coal miners back to work.” That’s a bit of an exaggeration.", "The number of coal mining jobs has increased by a net of 600 jobs between January and July, going from 50,000 to 50,600, according to the BLS. The most recent jobs report, which was released Aug. 4, shows a drop of 200 jobs between June and July.", "Trump noted that “American exports of coal are already up more than 60 percent this year.” That’s backed up by a Reuters analysis of government data on coal exports. Reuters attributed the jump to “soaring demand from Europe and Asia” fueled in part by a demand for coal in France after a series of nuclear power plant outages. In 2016, about 8 percent of U.S. coal production was exported to other countries, according to the U.S. Energy Information Administration.", "In a July 18 report, the EIA stated that while coal exports for the first quarter of 2017 were 58 percent higher than in the same quarter last year, “EIA expects growth in coal exports to slow in the coming months.” The report also said, “With coal exports running well below export capacity, no significant expansions of coal export facilities in the United States are currently under construction.”", "The president also repeated some of the same false and misleading claims that we have covered before.", "Trump on GDP: “Economic growth has surged to 2.6 percent nationwide. You have to understand what that means. Nobody thought that number was going to happen.”", "As we have written before, the 2.6 percent growth in real GDP for the second quarter was not that unusual nor unexpected.", "Real GDP was higher than 2.6 percent in eight of the last 18 quarters, according to data from the Bureau of Economic Analysis. Although Trump said “nobody thought that number was going to happen,” some economic models actually forecast higher growth. The Federal Reserve Bank of Atlanta, for example, initially forecast in May that the second quarter GDP growth would be 4.3 percent. Economists also caution to not read too much into any one quarter’s performance, as the numbers tend to go up and down through the year, and are often revised based on newer data.", "Trump on RAISE Act: “Our proposal prevents new immigrants from going on welfare for at least five years. So you don’t come in and go on welfare.”", "Trump is referring to the Reforming American Immigration for a Strong Economy (RAISE) Act, and mischaracterizes the impact of the proposed legislation on the ability of newly arriving immigrants to receive public benefits.", "The bill — which was proposed by Republican Sens. Tom Cotton and David Perdue, and endorsed by Trump — seeks to halve legal immigration into the U.S. by reducing the number who gain entry based on family ties and emphasizing a “merit-based” immigration system. But as we wrote when Trump discussed the bill at a press conference earlier this week, current federal law already bars most new immigrants from most federal public assistance programs for five years. There are exceptions in the current law, such as for children and pregnant women. The RAISE Act would expand the prohibition on some public assistance to the households of some new immigrants, but many who qualify for public assistance under the current law would remain eligible under the proposed bill.", "Trump on war spending: “Think of it. We’ve spent $6 trillion in the Middle East, and the Middle East is 100 times worse than it was 16 years ago when we started. Can you believe this? What a shame.”", "Actually, the U.S. spent over $1.7 trillion on “war-related activities” from 2001 through Sept. 30, 2016, according to a February 2017 report from the Congressional Research Service. During the campaign, Trump cited a $6 trillion estimate for the long-term cost of the war. Boston University political science professor Neta Crawford put that figure at between $4.8 trillion and $7.9 trillion when including future costs for such things as veterans’ medical and disability costs, debt service on borrowed money, and war-related spending in the Department of Homeland Security.", "But Trump repeatedly and wrongly uses the past tense — “spent” — to describe the spending. It’s also worth noting that even as Trump criticizes military spending he has on other occasions inaccurately boasted that his proposed fiscal 2018 budget includes a “historic increase” in defense spending.", "Trump on Hillary Clinton: “What the prosecutors should be looking at are Hillary Clinton’s 33,000 deleted e-mails. … Or let them look at the uranium she sold that is now in the hands of very angry Russians.”", "Trump made these remarks while criticizing the federal investigation into Russia’s meddling in the 2016 campaign. These are both talking points from that campaign, which ended in Trump’s victory over the Democratic presidential nominee and former secretary of state. Both statements are misleading, insinuating criminal activity by Clinton without any proof.", "The president says prosecutors should look at Clinton’s 33,000 deleted emails, but federal prosecutors did look at them as part of their investigation into whether Clinton mishandled classified information when she used a personal email account and private server to send and receive work-related emails as secretary of state. Prosecutors determined that there was no criminal intent in the decision to delete any emails, and no charges were ever brought against Clinton or any of her aides for mishandling classified information.", "Trump’s referring specifically to 33,000 emails that Clinton deemed personal. Those emails were deleted rather than turned over to the State Department, but then-FBI Director James Comey said  “like many e-mail users, Secretary Clinton periodically deleted e-mails or e-mails were purged from the system when devices were changed.”", "As for Trump’s claim that Clinton “sold” uranium to the Russians, Trump overstates Clinton’s role as one of nine voting members of the Committee on Foreign Investments in the United States, which is required by law to investigate all U.S. transactions that involve a company owned or controlled by a foreign government. The committee unanimously approved the sale of Uranium One, a Canadian-based company with uranium mining stakes in the West, to Rosatom, the Russian nuclear energy agency. The sale was also approved by the Nuclear Regulatory Commission.", "FactCheck.org Rating:", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]