["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "In this March 23, 2018, file photo, Roseanne Barr arrives at the Los Angeles premiere of \"Roseanne\" on Friday in Burbank, Calif. (Photo by Jordan Strauss/Invision/AP, File)", "A website called Potus Press is peddling false information about Fox Networks Group and Roseanne Barr’s canceled ABC show Roseanne.", "\"FOX Network Picks Up ‘Roseanne,’ Saying It Has No Problem With Occasional Racism,\" said a headline on potus-press.com.", "Facebook flagged this story as part of its efforts to combat false news and misinformation on Facebook's News Feed. You can read more about our partnership with Facebook here.", "The site claimed that \"just hours\" after ABC canceled the show due to a racist tweet from Barr, \"the Fox Network said it would be picking up the show.\"", "But there have been no legitimate reports about Fox Networks Group taking the show after its ABC cancellation. Fox Networks Group is an operating unit of 21st Century Fox, home to cable and broadcasting networks, including Fox News Channel, Fox Sports and FX.", "The post also attributes a made-up quote to Brian Sullivan, president and chief operating officer of Fox Networks Group. Sullivan is falsely quoted welcoming Barr to Fox. The story also falsely claimed President Donald Trump tweeted congratulations to Fox for picking up the show.", "Newsweek reported that some Roseanne fans tweeted expressing hope that Fox picks up the show. But that still hasn’t happened.", "Potus Press’ story has its origin in satire, but there’s nothing obvious on the post to clue readers into the fact that the post is meant as a joke. The story concluded with an H/T or \"hat tip\" and link to Extra News Feed, which posted the same story on May 30, filed under \"Truth in Satire.\" Extra News Feed’s Twitter biography said it’s a \"newsfeed w/ the same political rants you see on Facebook but they’re well written. we publish half satire & half essays. you decide which is which.\"", "Potus Press describes itself as an \"independent source of information\" in its \"About Us\" page, while noting that most of its content comes from other sites.", "\"We encourage critical thinking, having a view outside the box and getting your facts straight. Not only that we give you all the sources within all of our articles, but we also advise you to take nothing for granted, verifying each information that you get. We advise that you double-check each information on the internet before you take it as a truth,\" the About Us page said.", "Unless Potus Press readers click the link at the end of the story, there is no label or tag identifying the post as satire. One of the commenters on the story wrote, \"I am so happy to hear this.\"", "Potus Press’ story about Roseanne being picked up by Fox Networks Group is made up. We rate it Pants on Fire!", "Potus-press.com, \"FOX Network Picks Up ‘Roseanne,’ Saying It Has No Problem With Occasional Racism\", May 31, 2018", "The New York Times, After Racist Tweet, Roseanne Barr’s Show Is Canceled by ABC, May 29, 2018", "Fox Networks Group", "Newsweek, Will Fox Pick Up 'roseanne'? After Abc Cancels Show, Fans Say They'll Watch on a Different Channel, May 29, 2018", "Extranewsfeed.com, FOX Network Picks Up ‘Roseanne,’ Saying It Has No Problem With Occasional Racism, May 29, 2018", "Twitter, @ExtraNewsfeed", "Potus-press.com, About Us", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]