["Images of 2020 US President-elect Joe Biden and his wife Jill Biden with a man has been widely shared on the internet. It is being claimed that the said man is the newly-appointed political advisor Ahmad Khan, an Indian from Hyderabad.", "The image has been shared with Hindi text, “#bignews अमरीका के नए राष्ट्रपति @JoeBiden ने भारतीय मूल के #AhmadKhan को अपना राजनितिक सलाहकार नियुक्त किया है। ग़ौरतलब है कि अहमद खान भारतीय है इनका का ताल्लुक़ हैदराबाद से है।” on Twitter and Facebook.", "It was tweeted by @ShabinaBano_ on November 10, gaining over 200 retweets. (archived link)", "Two out of three images were posted by Facebook page ‘Etihadul muslemin – E – Hind’. This post has been shared over 300 times.", "The man in the image is indeed Ahmed Khan however the viral claim is false. Alt News spoke with Ahmed who confirmed that he is a Chicago-based US citizen and has not been assigned the role of a political advisor by Biden.", "As per his Twitter bio, Ahmed has held the following positions — Former Deputy Executive Director Draft Biden and Former Steering Committee Member at Illinois4Bernie. On November 10, he tweeted a collage of images — including the viral images — congratulating the Bidens. This tweet was retweeted by Spokesman of Hyderabad-based Majlis Bachao Tehreek Amjed Ullah Khan. While speaking with Alt News, Ahmed clarified Amjed is his maternal uncle. While Ahmed does have Indian heritage, he is a US citizen.", "Congratulations to President-elect @JoeBiden and @DrBiden! I wish you the best!", "Additionally, congratulations to my former colleagues at the original @draftbiden 2016 team for #RidinWithBiden before it became cool 😎 again in 2020. #PresidentElectJoeBiden ♥️ pic.twitter.com/EC7qy7d9EA", "— Ahmed Khan (@cityzenkhan) November 10, 2020", "Out of the three viral images, two were posted by Ahmed in 2015 (1,2).", "This slideshow requires JavaScript.", "“The viral claim is false. I have not currently been appointed as a political advisor,” Ahmed told Alt News. “I worked in 2015 as Deputy Executive Director for US political action committee “Draft Biden 2016″ that focused on building foundation and infrastructure for the then US Vice President Joe Biden’s prospective candidacy for US President. Biden had decided not to pursue his candidacy but the pictures were from a special reception at his former residence at the US Naval Observatory in Washington DC in acknowledgement of my and the Draft Biden team’s effort..” This was also reported by Muslim Mirror in 2015.", "Ahmed further added, “I do intend to pursue and would be hopeful for an opportunity to work for President Biden’s forthcoming administration. Currently, they are in a transition phase with senior-level government members. But the claim in the viral tweets is conflating my past endeavours as current.”", "US President-elect Joe Biden is expected to be sworn in as the 46th President of the United States on January 20, 2021. Old images, from the time when Biden was the VP, are being shared on Indian social media ecosystem with the false claim that Ahmed Khan, an Indian, has been selected as Biden’s political advisor. Ahmed is a US citizen with Indian heritage.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]