["About this rating", "In the span of just over three years, humanity will have witnessed both the shortest total lunar eclipse of the 21st century as well as the longest.", "According to NASA, the shortest total lunar eclipse this century will see occurred on 4 April 2015 and lasted a mere 4 minutes and 48 seconds. The longest, spanning 1 hour 42 minutes and 57 seconds, is slated to occur on 27 July 2018.", "The length of a total lunar eclipse varies based how far the moon is from the Earth at the time of the eclipse. As described by EarthSky, the 27 July eclipse will occur when the moon is coincidentally at its farthest point from Earth:", "In 2018, the July full moon and July lunar apogee — the moon’s most distant point from Earth in its monthly orbit – both fall on the same date: July 27, 2018. Therefore, the July 2018 full moon showcases the most distant and smallest full moon of the year. Sometimes called an apogean full moon (or micro-moon or mini-moon), this smaller and slower-moving full moon takes more time to cross the Earth’s shadow than does a full moon that’s closer to Earth and moving faster in orbit. That’s why a full moon at or near lunar apogee adds to the duration of a total lunar eclipse.", "Unfortunately for readers residing in portions of North America that are not on the most eastern side of Newfoundland, they will effectively miss out on the action. However, the eclipse will be visible, to some degree, from every other continent on the planet.", "How does this century’s longest duration total lunar eclipse compare to other centuries’ record holders? Though the Gregorian calendar was not a thing at the time, the longest total lunar eclipse occurring in the five millennia (or 50 centuries) between 2000 BCE and projected into 3000 CE occurred on 31 May 318 CE and lasted 1 hour, 46 minutes, and 36 seconds — a full three minutes and 39 seconds longer than this July's eclipse will be.", "NASA Goddard Space Flight Center.   \"Five Millennium Catalog of Lunar Eclipses: 2001 to 2100 (2001 CE to 2100 CE).\"\r\n    Accessed 3 July 2018.", "NASA Goddard Space Flight Center.   \"Total Lunar Eclipse of 2018 July 27.\"\r\n    Accessed 3 July 2018.", "McClure, Bruce.   \"Century’s Longest Lunar Eclipse July 27.\"\r\n    EarthSky.    Accessed 3 July 2018.", "NASA Goddard Space Flight Center.   \"Index to Five Millennium Catalog of Lunar Eclipses: -1999 to +3000 (2000 BCE to 3000 CE)\"\r\n    Accessed 3 July 2018.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]