["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "(Wikimedia commons)", "Richard Ojeda, the former West Virginia legislator who mounted a short-lived presidential campaign, has continued to tweet extensively as a private citizen.", "On Oct. 19, 2019, Ojeda tweeted about the scale of alcohol abuse and how it might be tamed by cannabidiol, or CBD, a chemical found in cannabis.", "\"One in eight American adults, or 12.7% of the U.S. population, now meets diagnostic criteria for alcohol use disorder. CBD might be the answer to this massive problem. #CBDOil #Healthylifestyle #Alcoholism #Quitsubstanceabuse,\" Ojeda tweeted. The tweet attached an ad for a CBD oil vendor.", "One in eight American adults, or 12.7 percent of the U.S. population, now meets diagnostic criteria for alcohol use disorder. CBD might be the answer to this massive problem. #CBDOil #Healthylifestyle #Alcoholism #Quitsubstanceabuse pic.twitter.com/sojvTsPagF", "The Centers for Disease Control and Prevention says that cannabis-based products can help ease the side effects of chemotherapy and muscle spasms from multiple sclerosis.", "A 2015 article in the journal Substance Abuse reviewed prior studies and expressed some optimism about CBD’s usefulness in combating some addictions, though it found less evidence for alcohol specifically. A second article from 2019 in the journal Alcoholism: Clinical and Experimental Research found, based on rodent trials, that \"CBD appears to have promise\" for treating alcohol use disorder, but the authors cautioned that more research needs to be done to confirm this effect in human subjects.", "Too little is known about the effects of CBD on alcohol abuse for us to address that part of Ojeda’s tweet.", "But what about Ojeda’s statistic, that \"one in eight American adults, or 12.7% of the U.S population, now meets diagnostic criteria for alcohol use disorder\"?", "We found significant uncertainty when it comes to measuring how many Americans have issues with alcohol. (Ojeda did not respond to an inquiry for this article.)", "The National Institute of Alcohol Abuse and Alcoholism, a part of the National Institutes of Health, defines alcohol use disorder as uncontrolled and problematic drinking. The institute considers alcohol use disorder to be synonymous with the more commonly used term \"alcoholism.\"", "There are different ways to measure the extent of alcohol abuse.", "The Centers for Disease Control and Prevention reports that 25.1% of adults age 18 or older have had at least one heavy drinking day during the past year. This comes from the 2018 National Health Interview Survey, which defined a heavy drinking day as five or more drinks consumed (for men) and four or more (for women).", "Meanwhile, a different federally sponsored survey, the National Survey of Drug Use and Health, used another definition -- people reporting that they engaged in heavy alcohol use in the past month. The survey defined heavy alcohol use as having at least five drinks (for men) or four drinks (for women) on at least five days in the past month.", "In 2017, the survey found that 6.7% of respondents reported that they had engaged in heavy alcohol use during the past month. Drinking to this level on a very frequent basis can be indicative of a problem, although there is not a clear consensus on exactly how often -- and this by itself does not constitute an alcohol use disorder.", "Officially, the same survey found that 14.1 million adults -- 9 million men and 5.1 million women -- have alcohol use disorder. That works out to 5.7% of the adult population.", "This 5.7% figure is smaller than Ojeda’s 12.7%. So where did that come from?", "It appears to have come from a study published in the journal JAMA Psychiatry in 2017. In fact, Ojeda’s wording is taken straight from a Washington Post article describing the study.", "The study was based on data from the federally sponsored National Epidemiologic Survey on Alcohol and Related Conditions. Its headline finding was that the prevalence of alcohol use disorder has spiked, rising by 49% in the first decade of the 2000s.", "Specifically, the percentage of adults meeting the criteria for alcohol use disorder rose from 8.5% in 2001-02 to 12.7% in 2012-13.", "Another review of alcohol use disorder was published in the Journal of the American Medical Association in 2018 said the percentage could be even higher. Alcohol abuse disorder \"is present in up to 14% of US adults during a 1-year period,\" the authors wrote.", "The differences between the dueling federal studies have been striking enough that researchers published a paper about it in 2007 in the journal Addiction. They suggested a variety of reasons may be causing the variations, notably the divergent policies on anonymity for respondents. Technical factors like data weighting, question wording, and response format may be making a difference as well.", "Ojeda would not have needed to dig up the 2007 study to understand this background -- the Washington Post article that his assertion originally came from included a section noting this caveat.", "\"While the study's findings are alarming, a different federal survey, the National Survey on Drug Use and Health, has shown that alcohol use disorder rates are lower and falling, rather than rising, since 2002,\" the article said. It quoted the JAMA Psychiatry study's lead author, National Institutes of Health researcher Bridget Grant, saying she isn’t sure what is behind the discrepancies.", "Kenneth Leonard, director of the Clinical and Research Institute on Addictions at the University of Buffalo, told PolitiFact that he agreed with this description of the two surveys.", "Ojeda tweeted, \"One in eight American adults, or 12.7% of the U.S population, now meets diagnostic criteria for alcohol use disorder.\"", "This statistic comes from a peer-reviewed study that was based on federal survey data. However, by citing only this study, Ojeda glosses over the reality that a different federal study showed rates about half as high. Researchers have suggested that the dueling studies may be reporting divergent numbers due to differences in their methodologies. At this point, it’s impossible to say whether the 12.7% statistic is accurate or if it’s actually half that. There is valid evidence for both numbers, and researchers can’t fully account for the difference.", "The statement is partially accurate but leaves out important details, so we rate it Half True.", "Richard Ojeda, tweet, October 4, 2019", "The National Institute on Alcohol Abuse and Alcoholism, \"Alcohol Facts and Statistics\", October 19", "The National Institute on Alcohol Abuse and Alcoholism, \"What is alcohol use disorder (AUD)?\"", "Centers for Disease Control and Prevention, \"Alcohol Use\", January 20, 2017", "National Health Interview Survey, \"Figure 9.4. Percentage of adults aged 18 and over who had at least 1 heavy drinking day in the past year, by metropolitan statistical area (MSA) status: United States, 2018\", May 29, 2019", "Washington Post, \"One in eight Americans is an alcoholic, study says\", August 11, 2017", "JAMA Network, \"Diagnosis and Pharmacotherapy of Alcohol Use Disorder\"", "JAMA Psychiatry, \"Prevalence of 12-Month Alcohol Use, High Risk Drinking, and DSM-IV Alcohol Use Disorder in the United States, 2001-2002 to 2012-2013\", September 2017", "The National Survey on Drug Use and Health, \"Results from 2017\", 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]