["About this rating", "A mock-up image for a potential post-election Newsweek-branded special commemorative publication pictured Hillary Clinton as 'Madam President.'", "As is typical in the souvenir business, an alternate 'President Trump' cover was also prepared to cover both contingencies.", "On 7 November 2016, the day before the 2016 Presidential election, an image purportedly showing Hillary Clinton on the cover of Newsweek under the title \"Madam President\" was widely circulated on social media. Some disreputable web sites claimed that the photograph was evidence that the media had been colluding with the Clinton campaign in order to ensure a victory for the Democratic candidate:\nThousands of copies of a Newsweek magazine claiming a Hillary Clinton victory have been printed in readiness to ship to newsstands and stores.", "Stacks of boxes with the Special Edition ‘Madam President’ cover depicting Hillary Clinton winning the U.S. presidential race next week were secretly photographed by a Newsweek employee who says that there were no Trump versions made.", "The find proves that the media, in collusion with the Clinton campaign, have planned for a Hillary victory all along.", "The above-displayed image is real. However, this image does not prove that the media was rigging the election for Hillary Clinton.", "It isn't uncommon for those in the souvenir business to prepare commemorative items anticipating major events well before they come to pass. In anticipation of the election outcome, two Newsweek-branded special commemorative publication covers were readied — one featuring Donald Trump and the other Hillary Clinton:\n\"For the past six months Newsweek Special Editions has been piecing together a Road to the White House Tribute Issue for both major party candidates,\" Tony Romando of Topix Media said.", "But Topix made a business decision to only print the Clinton version ahead of time given that she is almost universally favored to win the election.", "If Trump wins, the Clinton copies will be trashed and the Trump version will be rushed to the printing presses — a simple business calculation, Romando said.", "Rolando explained: \"Unlike hard news magazines, commemorative editions for sporting events, elections and unfortunately deaths are created weeks, months, and even years in advance. The largest publishers in America have dozens of tributes ready to print at plants across the country,\" he said.", "This same strategy is often used (sometimes to embarrassing effect) for celebrity obituaries and sporting events; it's the reason you can buy the winning team's Super Bowl t-shirt minutes after the game clock hits zero:\nThose locker room T-shirts are the ones you saw the Patriots wearing after the Super Bowl, and that you can buy right away at the stadium. Every year, shirts are printed for both teams before the final game and are kept in closely guarded boxes behind the scenes. The second the clock expires, workers take the winner’s shirts onto the field and give them to the new champions. And just like that – instant marketing for the same T-shirts that will be in stores the next morning.", "While Clinton's cover was widely circulated along with accusations of collusion, the magazine tweeted a picture of both covers on 7 November 2016, along with some clarifying information about who created them:", "Stelter, Brian.   \"No, Newsweek's Clinton cover is not proof the election is rigged\"\r\n    CNN.   7 November 2016.", "The Smoking Gun.   \"CNN's Premature Obituaries.\"\r\n    16 April 2003.", "Palacios, Daisy.   \"How Do Sports Teams Get Their Championship T-Shirts So Fast?\"\r\n    Market Place.   2 February 2015.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]