["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Scott Walker defends his record as Wisconsin governor on Sept. 13, 2015, on \"State of the Union\" on CNN. (Screengrab)", "Less than two weeks after tying President Barack Obama to the killing of police officers, Wisconsin Gov. Scott Walker defended his own approach to defusing tensions between law enforcement and the communities they patrol.", "In an interview on CNN’s State of the Union on Sept. 13, 2015, host Jake Tapper asked Walker to explain why he thought Obama played a role in the recent violence against police. Walker said the president hasn’t spoken out enough on the issue, and that police should be both supported and held accountable.", "\"I’m proud to say I'm the only governor in America, the first one and I believe the only one today, who signed a law that says there needs to be an independent investigation any time there's a death of someone in police custody.\"", "The August 2014 police shooting of unarmed black teenager Michael Brown in Ferguson, Mo., sparked calls for just such independent inquiries. We wanted to see if Walker in fact is the only governor to have approved a statewide law.", "According to a few legal experts, plus our review of state-level legislation, Walker is on solid ground.", "The Wisconsin law", "On April 23, 2014, months before the Brown shooting, Walker signed Act 348.  The law enjoyed bipartisan support. It required that whenever an officer on or off-duty kills someone, there will be an investigation by at least two investigators, \"neither of whom is employed by a law enforcement agency that employs a law enforcement officer involved in the officer-involved death.\"", "Once the investigation is complete, the report goes to the district attorney in the county where the death took place for consideration of criminal charges. If no charges are filed, the report is made public.", "Michael Scott is the director of the Center for Problem-Oriented Policing and clinical professor in criminology at Arizona State University. Scott told us that analysts for the Wisconsin Legislature in 2014 found no other state required an independent investigation for police-related deaths. Scott said this measure came after a 10-year effort by one family.", "\"The push for this legislation in Wisconsin came from a coalition organized by Mr. Michael Bell, the father of a young man shot and killed by police in Wisconsin,\" Scott said. \"Two state legislators, Sen. Gary Bies and Rep. Chris Taylor, took up his cause and sponsored the legislation that Gov. Walker signed. Gov. Walker can take credit for signing the legislation, but it was not proposed by his office.\"", "We found legislators in several states, including Connecticut, California, New York and Missouri, introduced similar measures in 2015, but so far, none have passed.", "We also learned from the Walker campaign that many local police departments in Wisconsin and around the country already require an independent investigation. However, those policies are not state law.", "A funding wrinkle", "There was a brief flap in Wisconsin over the money to pay for these inquiries. PolitiFact Wisconsin reported that Walker’s initial 2015 budget provided no funds. But after the attorney general, a Republican, told House budget writers that this was not a cheap endeavor, and a state report showed the state’s Justice Department had investigated 12 deaths in less than a year since the law took effect, lawmakers agreed to fund four of the five positions that were requested.", "Walker’s office agreed, and the governor signed a two-year budget that included $635,000 for the work.", "Our ruling", "Walker said he was the only governor to sign a bill that required an independent investigation into police-related killings. Walker signed that bill in April 2014. According to experts we reached or whose work we read, and our scan of legislation, no other state has such a law.", "We rate this claim True.", "CNN, State of the Union, Sept. 13, 2015", "Wisconsin State Legislature, Wisconsin Act 348, April 24, 2014", "Journal Sentinel, Gov. Scott Walker signs police custody deaths bill, April 23, 2014", "Wisconsin State Legislature, Legislative Fiscal Bureau, Law Enforcement Officer Involved Death Investigations , May 7, 2015", "Wall Street Journal, Wisconsin to Require Independent Probes in Police-Custody Deaths, April 23, 2014", "PolitiFact Wisconsin, Scott Walker didn't fund law requiring independent review of police-involved deaths, Gwen Moore says, Sept. 1, 2015", "Connecticut General Assembly, An act concerning independent investigation of police officer-involved deaths, January 2015", "New York State Senate, Bill S5746-2015, June 1, 2015", "Missouri House of Representatives, HB 1207, April 22, 2015", "California General Assembly, AB 86, April 28, 2015", "Hot Air, Scott Walker speaks out on cop murders and American leadership, Sept. 2, 2015", "Email interview, Michael Scott, director, Center for Problem-Oriented Policing and clinical professor, School of Criminology and Criminal Justice, Arizona State University, Sept. 13, 2015", "Email interview, AshLee Strong, spokeswoman, Walker for President, Sept. 13, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]