["The picture was published in this Facebook on February 7, 2021, which has been shared 1,300 times.", "It shows healthcare workers holding a Thai-language banner that reads: “If you don’t fight, you will end up like Thailand, without a future.”", "The Facebook post’s Thai-language caption reads: “Myanmar people’s banner. If you don’t fight, you will end up like Thailand without a future. They are telling the truth.”", "The picture surfaced online as hundreds of thousands of people across Myanmar protested against the military's arrest of democratically-elected civilian leader Aung San Suu Kyi in a bloodless coup on February 1, 2021.", "In neighbouring Thailand, authorities have come down heavily on pro-democracy protesters demanding reform to the monarchy as part of a youth-led movement that started in July 2020.", "The image was also shared on Facebook here and here and on Twitter here alongside a similar claim.", "However, the image has been doctored.", "Reverse image and keyword searches on Google found that part of the original photo was published by Thai news outlet Khaosod here on February 3, 2021.", "The photo shows the healthcare workers holding a Burmese-language banner that reads: “We oppose the military coup against the people's government”.", "The article headline reads: “Myanmar people defied military coup by banging pots and honking [their car horns]”.", "The article reports that hospital staff in Myanmar had threatened strike action in opposition to the coup.", "Below is a screenshot comparison of the doctored image shared in social media posts (L) and part of the original image published by Khaosod (R):", "Additional photos of the protesting healthcare workers carrying the Burmese-language banner were published by The Irrawaddy, an English-language Myanmar news website on Twitter here February 3, 2021.", "Healthcare workers at a government orthopedic hospital in Mandalay join civil disobedience campaign on Wednesday against military coup in Myanmar. #militarycoup #SaveMyanmar pic.twitter.com/xzyaFEt4ew", "The tweet reads: “Healthcare workers at a government orthopedic hospital in Mandalay join civil disobedience campaign on Wednesday against military coup in Myanmar. \n\t#militarycoup #SaveMyanmar”", "Eleven Media, another English-language outlet in Myanmar, also reported on the healthcare workers’ protest here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]