["About this rating", "A GoFundMe was created by a fan, not the couple.", "On March 16, 2021, the New York Post ran a story with the headline \"GoFundMe to pay off Meghan Markle and Prince Harry’s Mortgage Goes Bust.\" The Daily Caller ran a similar story with the headline \"GoFundMe Page Set Up To Cover Meghan Markle’s Mortgage Fails Miserably.\"", "For those only reading headlines, some interpreted this story as the royal couple creating a fundraiser for themselves. In reality, the page was created by a fan and shut down shortly after its launch.", "An archived copy of the GoFundMe states that it was created by a fan of the couple named Anastasia Hanson:", "Hello, I am Anastasia Hanson of Ventura, California and I am raising funds to pay off the mortgage for the Montecito, California home of Harry and Meghan.  Were 2 million supporters to donate just $5 each, the Goal is met and the loan can be paid off.  After their interview, I was moved with compassion to help get their home paid off.  As they are now financially independent, this will help and be a loving gift.", "Hanson, according to The Sun, was moved by the couple's interview with Oprah Winfrey on March 7, 2021, in which Prince Harry said the royal family cut Markle and himself off financially after they stepped down as senior members of the royal institution.", "\"My family literally cut me off financially, and I had to afford security for us [in the first quarter of 2020],\" he told Oprah.", "While that chain of events played a role in the couple moving to the Santa Barbara, California, area, the couple is far from troubled financially, and the GoFundMe has since been deleted.", "Prince Harry reportedly received what amounts to be $13 million in inheritance from his mother, Princess Diana, and the couple's newly founded production company recently received an estimated $100 million deal with Netflix. The Duke and Duchess of Sussex purchased their $14.9 million home in the summer of 2020 with a $9.5 million mortgage.", "Because the couple did not solicit money from the public to pay this mortgage, the claim is \"False.\"", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]