["About this rating", "Provisions in the CARES Act changed a 2017 tax law in a way that will largely benefit Americans who earn $1 million or more annually, according to a nonpartisan congressional body. Per calculations using that body's data, those wealthy Americans each could reap a tax benefit of $1.7 million on average with the change.", "However, U.S. millionaires won't receive stimulus payments based on their income under the CARES Act. Only workers who earn $75,000 annually or less (or families that make up to $150,000 annually) will receive one-time checks for the max amount under the federal stimulus package. Instead, CARES provisions temporarily enable wealthy Americans to report tax losses that they previously could not.", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "Responding to an unprecedented disruption to the U.S. economy caused by the COVID-19 coronavirus pandemic, U.S. President Donald Trump on March 27, 2020, approved a $2.2 trillion stimulus package called the Coronavirus Aid, Relief, and Economic Security (CARES) Act.", "Aiming to provide direct payments to Americans, the relief package authorized the U.S. Treasury Department and the Internal Revenue Service (IRS) to send $1,200 checks to low- and middle-class workers. The legislation also boosted funding for unemployment benefits, set aside billions of dollars for loans to help small businesses, and increased health care spending by $100 billion, among other provisions.", "But the bill included an additional benefit for wealthy Americans, per national media headlines in mid-April: “Over 43,000 U.S. Millionaires will get ‘stimulus’ averaging $1.6 million each\" (New York Post) and \"How Some Rich Americans Are Getting ‘Checks’ Averaging $1.7 million\" (Forbes). Snopes received numerous reader inquiries about the veracity of those reports.", "The claim is multi-pronged: that millionaires and other Americans received the same type of stimulus checks, termed \"Economic Impact Payments\"; that those payments were higher for millionaires than for other workers; and that the economic benefits for the country's wealthiest residents averaged $1.7 million each under the CARES Act.", "The coronavirus relief package authorized the federal government to send:", "For single tax filers with higher annual salaries — but less than $99,000 — the federal government is reducing the stimulus checks by $5 for each $100 above the $75,000 threshold (similar math goes for payments to families).", "Yet here is evidence that proves part of the above claim false, in the words of the IRS: \"Tax filers with adjusted gross income up to $75,000 for individuals and up to $150,000 for married couples filing joint returns will receive the full payment\" — which does not exceed the amounts of $1,200 for individuals, $2,400 for joint claims, and $500 per qualifying child. That means only in this hypothetical situation — a family had 3,400 qualifying children — could an American receive a stimulus check of $1.7 million. Here's language verbatim from the CARES Act:", "However, the latter part of the claim — that millionaires could reap an average of $1.7 million in financial gains under the CARES Act — is less definite.", "The answer begins with understanding pre-CARES Act tax code. In 2017, the federal government established new limitations on how much money owners of so-called \"pass-through\" businesses can deduct as losses against their \"nonbusiness\" income to minimize their tax liability. Under the Tax Cuts and Jobs Act, owners of such businesses — entities where profits flow through to owners and are not subject to corporate income taxes — could deduct a maximum of $250,000 in losses individually ($500,000 for couples) to offset taxable income from other sources, such as capital gains. Two Democratic Congressmen — Sen. Sheldon Whitehouse of Rhode Island and Rep. Llloyd Doggett of Texas — have explained the rule like this:", "If one spouse owns a company that had a $5 million loss in 2018 and the other spouse made $5 million from stock market investments, this limitation meant that the couple’s taxable income was $4.5 million (not zero, if the loss were allowed to fully cancel out the income). The other $4.5 million in losses, however, could be carried forward to use in future years.", "Provisions in the CARES Act temporarily suspended that limitation until the start of 2021, according to an analysis of legislative records by Snopes. In other words, the IRS is legally obligated to count excess losses from businesses that it otherwise wouldn’t have and provide them with \"the same treatment as if the Tax Cuts and Jobs Act had not been enacted,\" according to attorneys with the international law firm Foley and Lardner.", "Additionally, the provisions change the timeline of the 2017 law and allow for the new standard to retroactively apply, enabling businesses to report losses in 2018 and 2019 against the past five years. Those taxpayers, however, would likely need to amend their 2018 and 2019 tax returns if they have already been filed to see any changes, according to the tax consulting firm Calvetti Ferguson.", "And since the modification under the CARES Act only applies until Dec. 31, 2020, the 2017 law will kick in the following year.", "Here's how that change to tax code is relevant to the claim: Americans who earn $1 million or more will benefit the most from the temporary suspension on the deduction limit, according to an analysis by the nonpartisan congressional body the Joint Committee on Taxation (JCT). In early April 2020, Whitehouse and Doggett requested the committee to research \"the distributional effects\" of the provision within the CARES Act. Later, the commission’s chief of staff, Thomas Barthold, shared its findings in a letter to the congressmen, including the caveat:", "There is, of course, a great deal of uncertainty about the economic effects of the COVID-19 pandemic, and how those economic effects will translate into business losses for individuals. The revenue estimate represents our best effort to give Congress useful information about the potential scale of revenue changes associated with this provision.", "The letter included the following table, showing what class of Americans will receive what percentage of benefits from the amendment to the 2017 tax law:", "The table shows almost 82% of the provision's benefits will go toward about 43,000 Americans who earn $1 million or more annually. Put another way, hedge-fund investors and owners of real estate businesses are \"far and away\" the two prime beneficiaries of the change to the 2017 tax law, Steve Rosenthal, a tax expert at the nonpartisan Urban-Brookings Tax Policy Center, told The Washington Post. The JCT also found that suspending the limitation for \"pass-through\" businesses will cost taxpayers about $90 billion in 2020 alone, the Post reported.", "Using those numbers, you can do back-of-the-napkin math to estimate the amount of money the country's wealthiest population could reduce from their tax burden as a result of the change (82% of $90 billion): about $73.8 billion. Then, if you divide that total by the estimated number of impacted Americans who earn $1 million or more (43,000), you end up with an average of $1,716,279 — or about $1.7 million — each.", "\"If you take the report’s calculations at face value, that means that, on average, each of the eligible taxpayers would get a windfall of ~$1.7 million!” Forbes contributor Shahar Ziv wrote. “Clearly not all of those earning ‘only’ $1 million will receive a $1.7 million tax cut; however, just as some may receive less than the $1.7 million, some may benefit much more.\"", "In sum, given that U.S. millionaires won't receive stimulus payments based on their income under the CARES Act but rather the Act's provisions enable those Americans to take advantage of a temporary tax relief — potentially to the tune of $1.7 million on average — we rate this claim as a \"Mixture\" of true and false information.", "Arnell, Michael and Teachout, Eric.   “CARES Act — Income Tax Implications.\"    Calvetti Ferguson.   31 March 2020.", "Brown, Lee.   “Over 43,000 U.S. millionaires will get ‘stimulus’ averaging $1.6 million each”.\r\n    New York Post.   16 April 2020.", "Cochrane, Emily and Fandos, Nicholas.   “Senate Approves $2 Trillion Stimulus After Bipartisan Deal”.\r\n    The New York Times.   25 March 2020.", "H.R.748 — CARES Act.   “All Actions H.R.748 — 116th Congress (2019-2020)”.\r\n    Congress.gov.   Accessed 20 April 2020.", "Internal Revenue Service.   \"Economic impact payments: What you need to know\".\r\n   Accessed 20 April 2020.", "May, Ashley and Weisblat, David.   “CARES Act -- Summary of Tax Provision”.\r\n    Foley & Lardner LLP.   Accessed 20 April 2020.", "H.R.748 — CARES Act.   “All Actions H.R.748 — 116th Congress (2019-2020)”.\r\n   Congress.gov.   Accessed 20 April 2020.", "Stein, Jeff.   “Tax change in coronavirus package overwhelmingly benefits millionaires, congressional body finds”.\r\n   The Washington Post.   14 April 2020.", "Tax Cuts and Jobs Act.\r\n   Congress.gov.   Accessed 20 April 2020.", "The White House.   “Remarks by President Trump at Signing of H.R. 748, The CARES Act”.\r\n   27 March 2020.", "Ziv, Shahar.   “How Some Rich Americans Are Getting Stimulus ‘Checks’ Averaging $1.7 Million”.\r\n   Forbes.   14 April 2020.", "Jessica Lee is Snopes' Senior Assignments Editor with expertise in investigative storytelling, media literacy advocacy and digital audience engagement.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]