["Since President Donald Trump's COVID-19 diagnosis Oct. 2, contact tracing has sought everyone and anyone within his sphere who may have contracted or been exposed to the virus. One question being asked, particularly on social media, is how exactly the president acquired COVID-19, which has now claimed over a million lives worldwide and nearly 221,000 in the United States.", "An Instagram post suggests the flu vaccine.", "\"Did Trump's previous three flu vaccines make him more susceptible to contracting CVD?\" the Instagram account @holistichealthandmore asks, including a clip from an Aug. 31 interview between Trump and Fox News host Laura Ingraham that refers to the president's flu vaccination history.", "Preceding the clip are two alleged conclusions from two different scientific papers that appear to offer credence to the theory; links to the papers are also provided.", "USA TODAY has reached out to Instagram account @holistichealthandmore for further comment.", "More:Fact check: Fake Trump quote about battling coronavirus, his body", "In order to discern how the flu vaccine and COVID-19 relate to one another, it is important to first understand the two.", "The flu vaccine confers immunity against influenza, a common and contagious respiratory infection caused by influenza viruses, of which there are four types – A, B, C and D. According to the CDC, type A and B viruses are behind every flu season, type A particularly whenever there is a new pandemic. Types C and D are less of a concern to humans and mostly target animals.", "The vaccine itself is made of two influenza type A strains known to routinely infect humans – H1N1 and H3N2 – and one influenza B strain. Another formulation, a quadrivalent flu vaccine, includes an extra influenza type B strain.", "COVID-19 also causes respiratory illness but hails from an entirely different viral family. While symptoms can range from mild to moderate, even resulting in death, a great number of people recover. But may continue to struggle with residual disease, which includes worrisome heart problems, for weeks or months afterward.", "More:Fact check: Alex Jones' claims about Trump's COVID-19 treatments, 'deep state' are false", "Here is where the flu vaccine comes in: Some scientists have said getting it may offer some protection against COVID-19, rather than susceptibility.", "In an October interview with NPR, virologist Robert Gallo, co-founder and director of the Institute of Human Virology at the University of Maryland School of Medicine, said that getting the right flu vaccine, one that contains a live, attenuated (or weakened) virus, is key. Injecting with this sort of vaccine may sound a bit terrifying. But in reality, it is used in the tuberculosis vaccine, or Bacille Calmette-Guerin, given in developing countries, as well as the oral polio, measles and live flu vaccines.", "The basis for this could be a phenomenon known as viral interference – when one virus provides temporary protection against other related or unrelated viruses by preventing or inhibiting their growth. The exact biological mechanisms underlying this protection are still unknown, although some theories suggest activation of the host's immune system or competition for host cell resources between viruses may be involved.", "Viral interference underpins the two studies cited in the Instagram post, but both actually have nothing to do with COVID-19 risk.", "The first study mentioned, published in 2012, examined whether an inactivated influenza vaccine – one that uses a dead version of the virus – protected children from other respiratory viruses. While the researchers did not observe this, they did admit any post-vaccination protection was likely short-lived (on the order of two to four weeks), so unless a child came down with a non-influenza respiratory illness during that short window, viral interference may not have been observed.", "The second study, conducted by Greg Wolff, an epidemiologist with the Armed Forces Health Surveillance Branch, and published in January, also looked at how influenza vaccination, or lack thereof, affected risk for contracting other noninfluenza respiratory viruses. Wolff's study, which used Department of Defense personnel as its sample population, found a possible association between influenza vaccination and immunity against other noninfluenza viruses. An increased risk of coronavirus and human metapneumovirus, a relative to respiratory syncytial virus that commonly infects young children, was also found.", "Wolff, however, was quick to clarify that the coronaviruses studied were not COVID-19.", "\"Coronavirus results in this study represented the four endemic, regularly circulating strains of coronavirus (229E, NL63, OC43, and HKU1) during the 2017-2018 influenza season, not novel coronavirus (COVID-19),\" Wolff wrote in an April follow-up. \"The four circulating strains of coronavirus have existed in the general population for years, first identified in the mid-1960s. At the time of the study, and even at the time of initial electronic publication, COVID-19 was not yet in existence.\"", "More:Fact check: Trump's hospital records, weight have not been released", "The epidemiologist urged that his findings not be misconstrued or interpreted as influenza vaccination posing an increased risk for contracting COVID-19.", "\"Therefore, the results of this study cannot and should not be interpreted to represent any sort of relationship or association of influenza vaccination receipt and COVID-19 illness,\" Wolff stated. \"Results from this study DO NOT support the anti-vaccination viewpoint of avoiding seasonal influenza vaccination, and in fact should be interpreted in the opposite manner, since significant protection against influenza was associated with vaccination receipt, and a slight decrease in the odds of infection from other respiratory viruses was also noted.\"", "In a September study published in the Journal of Clinical and Translational Science, Cleveland Clinic pulmonologist Dr. Joe Zein and colleagues found that the influenza vaccine did not increase one's susceptibility to COVID-19 nor worsen associated morbidity or mortality.", "The study examined almost 20,000 patients enrolled in the clinic's COVID-19 registry who tested positive for the virus between March 8 and April 15. Patients who received a flu vaccine in the fall or winter of 2019 were compared against those who did not.", "\"Our findings suggest that we should proceed as usual with our vaccination strategy for global influenza this flu season,” Zein said in press release. “Getting the annual flu vaccine remains the best safeguard against the influenza virus – both for yourself and the people around you.\"", "We rate this claim FALSE because it is not supported by our research. The two studies cited in the Instagram post to support the theory that Trump's past flu vaccinations put him at an increased risk for COVID-19 have nothing to do with the virus. A recent study found no link between the flu vaccine and COVID-19 susceptibility, morbidity or mortality. Scientists have suggested the vaccine may actually confer protection against COVID-19, likely through a phenomenon called viral interference.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more."]