["About this rating", "In February 2016, a video purportedly showing a group of children reacting to an \"incredible 7D hologram\" reproduction of a surfacing whale demonstrated inside a school gymnasium was shared on social media:", "The  video was originally created by a company called \"Magic Leap\" in order to demonstrate the potential capabilities of their technology. While the Magic Leap device is still shrouded in mystery, several articles written about the technology explain that it's a wearable device which deals in \"mixed reality,\" layering unreal, virtual objects over real, tangible ones.", "Users will be required to wear something over their eyes (similar to Google Glass or Microsoft's HoloLens) in order to see three-dimensional virtual imagery:", "According to Magic Leap's Abovitz, the still-unseen gadget that Magic Leap will become will stay on your head, and be something you can use in the real world, even while talking to other people. The last gadget that attempted this was Google Glass. And the goals seem similar: make a device that can be on you but \"won't take over your world,\" and something that can show you what you need to see while still making eye contact with real people. Maybe these will feel more like magic glasses than magic headgear, but no image of Magic Leap's physical hardware has yet been shown.", "As the children in the video are not wearing any sort of special headgear, we can assume that they did not actually witness a hologram whale splashing through their gym floor.  Even if they were actually seeing it, the whale would appear in the usual three dimensions, not seven.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]