["The photo was shared in this Facebook post on December 7, 2020, which has since been deleted.", "The post was shared more than 890 times.", "It shows a train timetable at Mount Lavinia railway station, written in English and Chinese characters.", "The post’s Sinhala-language caption translates to English as: “The Mount Lavinia railway station board that has omitted both Sinhala and Tamil”.", "Sri Lanka has two official languages - Sinhala and Tamil. English serves as a “link language”, according to this page on the Sri Lankan government’s website.", "A similar claim was made on Facebook here, here, here, here, here and here.", "The claim however is misleading; the schedule featured in the posts was installed by a Sri lankan hotel for the benefit of tourists. A second schedule in Sinhala was also simultaneously displayed at the station.", "W D Pushpakumara, the Mount Lavinia Railway station master, told AFP the image in the misleading posts shows a timetable installed by the Mount Lavinia Hotel in 2015 for the convenience of Chinese tourists.", "\"Before the tourism industry came to a standstill due to the pandemic, close to 150-200 Chinese tourists would board the trains from the Mount Lavinia station daily,” he told AFP by phone on December 7, 2020. “This timetable was installed for their convenience as the majority of them were not familiar with the local languages. We have a seperate timetable installed for the locals that feature one local language and English.”", "Pushpakuamara shared an image of a second timetable with AFP, written in Sinhala and English for the benefit of locals, as seen below:", "A spokesperson for Mount Lavinia hotel told AFP by phone on December 8, 2020 that it sponsored the installation of the Chinese and English timetable for the convenience of tourists.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]