["One post -- shared here -- quotes Washington as saying: “When government takes away citizens’ right to bear arms it becomes citizens’ duty to take away government’s right to govern.”", "The quote is listed on the Mount Vernon website’s “Spurious Quotations” page, which says: “The library has yet to find an explanation for this misquote or a similar quote of Washington's that was confused for this statement.”", "Founding Fathers including Washington are revered figures in the United States, making them a powerful source of support for political arguments, and firearms and gun control are perennially divisive issues, especially in election years such as 2020.", "Fabricated Washington quotes appear to be on the rise and can take days to debunk, according to Mary V. Thompson, a research historian at Mount Vernon, who works to safeguard the former president’s historical legacy.", "“They do seem to be growing in number (and not just quotes attributed to George Washington, but to Thomas Jefferson, as well),” Thompson told AFP by email.", "This is “probably because of the deepening political divides in the country, and because it is so easy to make and/or pass along a meme on Facebook,” she said.", "Another post -- shared here and here -- pictures a plaque containing a quote that is inaccurate.", "“A free people ought not only be armed and disciplined, but they should have sufficient arms and ammunition to maintain a status of independence from any who might attempt to abuse them, which would include their own government,” the plaque says.", "The initial part of the quote is accurate and is taken from Washington’s First Annual Message to Congress, but it is “then manipulated into a differing context and the remaining text is inaccurate,” according to the Mount Vernon site, which also includes spurious Washington quotes unrelated to firearms.", "The actual quote from Washington’s address was: “A free people ought not only to be armed, but disciplined; to which end a uniform and well-digested plan is requisite; and their safety and interest require that they should promote such manufactories as tend to render them independent of others for essential, particularly military, supplies.”", "A third Facebook post -- shared here -- quotes Washington as saying: “When any nation mistrusts its citizens with guns, it is sending a clear message. It no longer trusts it citizens because such a government has evil plans.”", "It is a variation of one that appears on the spurious quotes list.", "“The quote seems to originate from an online publication: The American Wisdom Series presents Pamphlet #230, ‘President George Washington's Thoughts on Firearms.’ The author provides no citation for the quotations used,” the Mount Vernon website says.", "A fourth post -- shared here and here -- quotes Washington as saying: “Firearms stand next in importance to the Constitution itself. Firearms are the American people’s liberty teeth and keystone under independence.”", "But this quote does not appear in any of Washington’s writings, “nor does any closely related quote,” according to the Mount Vernon site.", "One or two people at Mount Vernon usually work on identifying spurious Washington quotes as they come up, Thompson told AFP.", "“As we see a new one, we tend to deal with them as soon as we can, because somebody is bound to ask us about them at some point,” she said.", "“We typically start by searching compilations of George Washington’s writings, first by looking in the index under entries for subjects relating to the quote in question,” Thompson said.", "“It can take just a few minutes, if you find the quote right away in Washington’s writings,” meaning it is real, “or it can take days.”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]