["Several messages, videos and audio clips, which turned out to be false, are creating panic on social media in the wake of the coronavirus pandemic. Now, Alt News has received a press release claimed to be issued by the Prime Minister of India’s Office. Social media users have sent us the document on our official WhatsApp number.", "The press release is dated March 18, 2020, and is titled, “NATIONAL SECURITY COUNCIL, PRIME MINISTER’S OFFICE”.", "The document informs about “Restricted Movement Order” from March 18 to March 31, 2020. “The National Security Council had a coordination meeting between government agencies on 17 March 2020 to ensure the smooth implementation of the Order,” states the document.", "The press release hints at a potential lockdown when it says, “To ensure the effectiveness of the Order, the general public is advised to stay home at all times except to fulfil basic needs.” It may be noted that Prime Minister Narendra Modi has called for a 14-hour voluntary lockdown on March 22.", "A user posted a screenshot of the “press release” and asked for a confirmation on the authenticity of the document while tagging the official Twitter handle of PMO India.", "Alt News found that the above press release has not been issued by the Indian Prime Minister’s office. The press release has nothing to do with the Indian government. In fact, the document doesn’t even mention the word ‘India’ or ‘Indians’ even for once.", "A Google search with keywords (“Restricted Movement Order“) revealed that the order was issued by the Malaysian National Security Council. We then searched for the word Malaysia (in the document) and found the phrase, “Malaysians working in Singapore/Thailand/ Brunei / Indonesia”. This corroborates the fact that a document was issued by the Malaysian government for their citizens as it talks about Malaysian nationals.", "On March 18, Singapore-based media outlet Channel News Asia reported, “The Malaysia government on Wednesday (Mar 18) imposed a restricted movement order that bars its citizens from going overseas and foreigners from entering the country until the end of March.” According to this explainer, all foreigners including Singaporeans with Malaysian permanent residence who are not employed in “essential services” will be not be allowed to enter Malaysia during the period of Restricted Movement Order. The same press release in Malay can be found on the official website of Malaysia’s PMO.", "Press Information Bureau’s (PIB) fact-check wing has rubbished the press release and stated that no such document has been issued by the Indian PMO.", "Claim: A Press Release regarding movement restriction is widely getting circulated on #WhatsApp claiming to be of Government of India.#PIBFactCheck: No such Press Release has been issued by @PMOIndia. pic.twitter.com/6CQOJUhSpG", "— PIB Fact Check (@PIBFactCheck) March 19, 2020", "According to Channel News Asia’s tracker, the country’s total number of COVID-19 positive cases has surged to 1,180.", "In conclusion, a document which essentially talks about the “Restricted Movement Order” issued by the Malaysian government is doing the rounds on the Indian social media ecosystem with an impression that it was issued by the Indian government.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "Amid the ongoing Israel-Palestine conflict, media outlet Times Now put out a report claiming that…", "A 45-second video clip is being shared widely on social media where a group of…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…"]