["The posts say: “Walmart has announced that everyone who shares this link will be sent a $75 coupon for its anniversary.” They directed users to several websites which are not affiliated with Walmart, one of which we archived here.", "When the user clicks on the site it asks them to answer a series of questions and eventually to share the link on Facebook with “Thank you!” written in the comments field. It also asks to collect personal information.", "However this offer is fake and is not affiliated in any way with Walmart, spokeswoman Tara Aston told AFP by phone on December 9.", "“We typically don’t issue coupons,” Aston said. She said Walmart honors manufacturer’s coupons, but it does not offer coupons on Facebook.", "Aston directed Walmart customers to this fraud protection website, which says: “Walmart does not solicit online for individuals to complete online surveys for gift cards or free gifts.”", "It also suggests: “If you suspect you have been directed to a phony website claiming to be connected with Walmart, please send an email with the link to abuse@walmart.com.”", "AFP Fact Check has debunked other “free offers” on Facebook, including non-existent coupons from Molson Coors in Canada and the Australian supermarket Woolworths.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]