["Two photographs are viral on social media with the claim that a woman named Revathi who hails from a poor family of daily wage earners in Karnataka was placed third in UPSC examination. The message adds that she was selected for IAS. State Joint Secretary of BJP Bengal Amitava Chakravorty was among those who tweeted the images on June 27, 2020.", "Arlan Malik, District Vice-President of BJP J&K, also shared both pictures.", "From the account of Facebook user Dewesh Kumar Choubey the images drew a whopping 28,000 shares. They garnered another 1,000 shares from the group ஆதி அகத்தியர் Aathi Agathiar.", "The claim is also floating on Instagram.", "The same set of images has been doing the rounds on social media since 2017. From the Facebook page Indian Administrative service – IAS, the post attracted over 94,000 shares.", "It was shared by several users in 2017.", "IAS Topper 3rd Rank Revathi, got selected for I.A.S. She is being congratulated by her parents who are daily wagers pic.twitter.com/G0UfOVijrP", "— Suman Chopra (@sumankpt) July 6, 2017", "BJP MP Sonal Mansingh had tweeted the image on July 7, 2017.", "Karnataka’s Revathi got selected for IAS. Her parents are daily wagers. Determination to rise like the Lotus. pic.twitter.com/5Wv1FSnRzL", "— Sonal Mansingh (@sonal_mansingh) July 7, 2017", "Alt News went through the complete list of candidates of the 2016 UPSC examination (results declared in 2017) and found no candidate by the name Revathi who placed third. In fact, the candidate with the third rank was Gopalkrishna Ronanki.", "A Google reverse image search of the photographs led us to a Telugu website journalismpower.com which had penned an article on Revathi on March 26, 2017. As per the article, Venkata Revathi hailed from a poor family in Avanigadda in Andhra Pradesh’s Krishna district. After completing her college, she appeared for AP police examination and was selected for the post of a sub-inspector (SI). The article carries another photograph of Revathi.", "Alt News contacted Avanigadda police station and was redirected to SI Revathi who informed that she is not an IAS officer. Her full name is Mathi Venkata Revathi (28) and she hails from Modumudi village. She is currently posted at Disha police station in Rajahmundry City, East Godavari district. The sub-inspector also shared her recent photograph with Alt News.", "A false claim that Revathi from Karnataka placed third in UPSC examination is, therefore, circulating since 2017. The truth of the matter is that she was selected as a sub-inspector in AP police examination in 2017.", "Donate Now", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "Trigger Warning: Sexual Violence A distressing video of a girl forced to take her clothes…", "A clip featuring Pakistan men’s Cricket team captain Babar Azam is viral on social media…", "A 13-second clip featuring Bollywood actor Shah Rukh Khan is being shared on social media…", "Union minister of information and broadcasting Anurag Thakur on September 26 announced Waheeda Rehman as…"]