["About this rating", "On July 7, 2019, Facebook user Alicia Brown Phillips brought attention to a fainting disorder known as \"hair-grooming syncope\" when she shared a message concerning a scary ordeal that reportedly occurred while she was attempting to curl her little sister's hair:", "I experienced one of the scariest moments of my life this morning with my little sister and I am going to put this out there because I had never heard of this in my life!", "Hair-grooming Syncope ...", "Look it up. This morning I was curling my little sister Gracie’s hair for church. I was maybe about five minutes in and she starts to gag a little and looks kind of pale. I asked her if she was going to get sick and she shook her head yes. I get my little daughters out of the bathroom and start to hold her hair up for her as she leans over the toilet. 30 seconds later... she looks at me. She is extremely pale with blue lips and starts to pass out. Her pupils got really big and I caught her. I start screaming for Dale to come help. Gracie has a blank stare and look on her face and is completely unresponsive and limp for about a minute. Her hands were also shaking. Very seizure like. She then comes back to and says she feels much better. She says she remembers hearing us talk but couldn’t see us. I was crying. She was very confused. My mom and dad rush to my house and a few hours in Children’s hospital, an EKG, and a head scan later... she is fine. Turns out there is something called hair-grooming syncope affects kids from ages 5-13. They said they see about 1-5 cases a year. Turns out brushing, curling, braiding, or drying can cause nerve stimulation on the scalp and cause some children to have seizure like symptoms. I HAVE NEVER HEARD OF THIS BEFORE! We were told if she ever starts to feel nauseous or light headed while getting her hair brushed to sit down and take a break. I am putting this out there for others to see. If a kid ever complains of their belly hurting or feeling light headed while they are getting their hair done, make sure they take a seat and keep a close eye on them! Apparently very rare but so scary to see it happen!", "This Facebook post garnered ten of thousands of shares and comments within a few days of its initial posting. In addition to expressing concern for the child's health, many commentators, like Phillips herself, were surprised to learn about this condition.", "\"Syncope\" is the medical term for fainting. \"Hair-grooming syncope\" refers to fainting that is brought on during hair grooming activities.", "A 1996 study defined the condition as follows: \"Hair-grooming syncope is a rare and benign variety of neurocardiogenic syncope that should be considered in girls that complain of loss of consciousness during different hair care acts, even if seizures are present.\"", "A 2009 study found that while this condition occurs most frequently in females, male children can also experience hair-grooming syncope: \"Of the 111 patients, 78% were girls. We found characteristic difference between boys and girls with boys experiencing syncope more during hair cutting whereas girls experienced syncope more during hair combing and brushing.\"", "We weren't able to find any concrete numbers regarding how often hair-grooming syncope occurs. Knoxville's WBIR reported that doctors see a \"handful\" of cases a year, but it's possible this condition often goes undiagnosed because most parents aren't aware that the condition exists, or it may be misdiagnosed as epilepsy:", "While an instance of hair-grooming syncope may certainly be scary for those involved (especially if it involves a seizure), the biggest difference between this condition and other bouts of fainting is that hair-grooming syncope is specifically triggered by the brushing, combing, curling, or cutting of hair, as pediatrician Dr. Kurt Brandt observed: \"Syncope is basically passing out, and hair grooming is known to be a precipitant of that ... It may be the pulling of the hair, possibly pain, possibly stimulation of the scalp ... Your blood pressure goes down and you pass out.\"", "Evans, Williams.   \"Hair-Grooming Syncope in Children.\"\r\n    Clinical Pediatrics.   1 July 2009.", "Sullivan, Cole.   \"She Passed Out Because Her Hair Was Getting Curled. Doctors Say It's More Common Than You Might Think.\"\r\n    WBIR.   9 July 2019.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]