["By Angelo Fichera", "Posted on March 27, 2019", "A misleading image in support of the Electoral College is circulating on social media.", "Democratic Sen. Elizabeth Warren of Massachusetts, who is running for president in 2020, called this month for ending the Electoral College — highlighting some Democrats’ discomfort with the current process for electing the U.S. president and vice president.", "The political debate over the Electoral College has taken to social media, too, where an image seeking to defend the system gained popularity.", "“The red dot is Los Angeles County. That county has the same population as ALL of the blue sections,” reads the image’s text, shown above a map with a majority of states across the country shaded in blue. “Any questions as to why we need to keep the Electoral College?”", "But it’s not true that “ALL of the blue sections” has the same population as Los Angeles County.", "Whether one interprets the text as meaning that the blue-shaded states collectively have the same population as Los Angeles County, or that each of the states independently have the same population, it’s wrong.", "Los Angeles County has a population of 10.1 million, according to the U.S. Census’s 2013-2017 American Community Survey 5-Year Estimates.", "The states in blue collectively far outnumber Los Angeles County’s population, and individually most states have lower populations — or in Georgia’s case, slightly higher. Idaho’s population, for example, was recorded at about 1.7 million, according to the Census survey. New Jersey, meanwhile, had nearly 9 million. Georgia, a reported 10.2 million.", "The seven states not highlighted in blue — California, Texas, Florida, Illinois, Ohio, Pennsylvania, and New York — all have more residents than Los Angeles County.", "By highlighting the states that mostly have lower populations than Los Angeles County, the creator of the image may have been attempting to illustrate an argument made by those in favor of the Electoral College: that it forces candidates to consider the interests of citizens in more rural, less populated areas of the country.", "The Electoral College was established by the Constitution. The process has resulted in five presidential candidates losing the election despite winning the popular vote — most recently in 2000 and 2016 with Democrats Al Gore and Hillary Clinton, respectively. Prior to that, the last time it happened was in 1888.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on the social media network.", "“Electoral College Fast Facts.” Office of the Historian, U.S. House of Representatives. Accessed 27 Mar 2019.", "“California.” 2013-2017 American Community Survey 5-Year Estimates. U.S. Census Bureau. Accessed 27 Mar 2019.", "“Florida.” 2013-2017 American Community Survey 5-Year Estimates. U.S. Census Bureau. Accessed 27 Mar 2019.", "“Georgia.” 2013-2017 American Community Survey 5-Year Estimates. U.S. Census Bureau. Accessed 26 Mar 2019.", "“Idaho.” 2013-2017 American Community Survey 5-Year Estimates. U.S. Census Bureau. Accessed 26 Mar 2019.", "“Illinois.” 2013-2017 American Community Survey 5-Year Estimates. U.S. Census Bureau. Accessed 27 Mar 2019.", "“Los Angeles County, California.” 2013-2017 American Community Survey 5-Year Estimates. U.S. Census Bureau. Accessed 26 Mar 2019.", "“New Jersey.” 2013-2017 American Community Survey 5-Year Estimates. U.S. Census Bureau. Accessed 26 Mar 2019.", "“New York.” 2013-2017 American Community Survey 5-Year Estimates. U.S. Census Bureau. Accessed 27 Mar 2019.", "“Ohio.” 2013-2017 American Community Survey 5-Year Estimates. U.S. Census Bureau. Accessed 27 Mar 2019.", "“Pennsylvania.” 2013-2017 American Community Survey 5-Year Estimates. U.S. Census Bureau. Accessed 27 Mar 2019.", "“Texas.” 2013-2017 American Community Survey 5-Year Estimates. U.S. Census Bureau. Accessed 27 Mar 2019.", "“What is the Electoral College?” National Archives and Records Administration. Accessed 26 Mar 2019.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]