["Ads against Democratic Senate candidate Ted Strickland are torpedoing Ohio airwaves, even as reports say that supporters of incumbent Sen. Rob Portman are scaling back their spending. One claim that has been repeated across multiple ads is about a handful of change: 89 cents, to be exact.", "\"Eighty-nine cents,\" reads the script from the ad, paid for by the US Chamber of Commerce’s political action arm. \"You can find that in your couch. Or your jeans. Or even under your floor mats. But as governor, Ted Strickland left only 89 cents in Ohio’s rainy day fund.\"", "It seems unlikely that so specific a number would be used without factual underpinning. We wanted to be sure it checked out.", "It does.", "In official-speak, Ohio’s rainy day fund is known as the Budget Stabilization Fund. When Strickland left office in January 2011, the fund had bottomed out to $0.89.", "Here’s a chart using data from Ohio’s Office of Management and Budget. It shows the ebb and flow of Ohio’s reserves, including the low point in fiscal years 2009 and 2010.", "Where’d the reserves go?", "Stickland used $1 billion from the fund to balance the state budget in 2009, a move he and his campaign have defended.", "\"I would not have had a rainy-day fund if I had listened to many Republicans,\" Stickland said in 2009. \"I'm glad I held on to it. There is justification for it now.\"", "Kim Rueben, a state and local finance expert at the Urban Institute, told Columbus Business First that, \"I wouldn’t blame a governor for spending budget stability funds in a time when you need to stabilize your budget.\"", "Yet the tiny reserve became a bit of Ohio lore. Brian Perera, the Ohio Senate’s former deputy chief of staff for budget and finance, even cut a check for $0.89 so he can say he personally doubled the state’s reserves.", "The reserve has grown since Strickland left office. Current Gov. John Kasich started to replenish the rainy day fund with a injection of $246.9 million in July 2011. The money came at the tail end of Strickland's final two-year budget even though he had left office.", "Today, the rainy day fund sits at over $2 billion, according to the state.", "Our ruling", "Campaign ads criticized Strickland for leaving Ohio’s rainy day fund at $.89 when he left office as governor.", "Strickland’s defenders say the recession that hit the United States and Ohio required Strickland and state officials to drain the $1 billion fund. And they note the fund started to be replenished at the tail-end of his final budget, even though Strickland had left office.", "But we don't think that affects the accuracy of this claim. We rate it True.", "https://www.sharethefacts.co/share/2ce48995-a59a-4079-94eb-6d03717ebdf6", "Interview, David Bergstein, Strickland for Senate, Sept. 7, 2016", "Associated Press, \"Strickland: Ads’ claims on Ohio Rainy Day Fund are unfair,\" Aug. 16, 2016", "PolitiFact Ohio, \"Gov. John Kasich says the rainy day fund has grown from 89 cents to $240 million,\" Apr. 11, 2012", "Columbus Dispatch, \"Compared with peers, Ohio is looking good,\" Jul. 21, 2009", "Columbus Dispatch, \"Budget can’t be sustained, critics say,\" Jul. 19, 2009", "Columbus Dispatch, \"$540 million budget hole,\" Sept. 11, 2008", "Columbus Dispatch, \"Veteran budget expert leaving Ohio Senate for OSU,\" Oct. 1, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]