["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A false story about a Zimbabwean inventor defying the laws of physics with an electric car that never needs to be recharged is re-circulating on social media.", "The initial blog post was published in April 2018 on the conspiracy-fueled website Disclose.tv. It popped up again this month on Facebook and has been shared more than 25,000 times, according to CrowdTangle data.", "This story was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The man who supposedly invented this vehicle, Sangulani Maxwell Chikumbutso, first appeared in headlines in the corners of the internet in 2015. At the time, his company, Saith Technologies, held an \"Open Day\" where he debuted his inventions and products, according to Zimbabwean technology news site Techzim.", "The South African news channel SABC Digital News also covered the event.", "All of the images on Saith’s Facebook and Twitter pages are from that event, as are all of the pictures of the inventions the company claims to have created. Neither account has been active since mid-2015. The Saith Technologies website appears to have been taken down.", "Chikumbutso claimed that his car runs on \"5 normal gel batteries.\" According to an archived version of the Saith website, a secret substance is exposed to radio wavelengths, which give the car’s \"power generator\" the \"capacity to funnel the power generated into functional electrical energy\" and never require a recharge.", "Following the \"Open Day\" event, Techzim questioned the legitimacy of Saith Technologies products. It did not report on the company again.", "Techzim noted that Chikumbutso’s car was outside of the law of conservation of energy because it somehow converted 220 volt-producing gel batteries into a much higher output of 500,000 watts.", "\"We are not sure how this assertion can be dispelled and we hope at some forum scientist [sic] will put the claims to test,\" the article read.", "The disclose.tv article says that the U.S. government \"recently\" relocated Chikumbutso to California to work on his inventions and that it might be to \"control this type of invention.\"", "There is no evidence that this happened.", "Three years ago, a man at a one-day event touted \"inventions,\" including a car that defies the laws of physics. Since 2015, his story has only found a home on false news blogs and conspiracy sites.", "We rate this claim Pants on Fire!", "Correction, Dec. 2, 2019: This report has been corrected to note that SABC Digital News is a news organization based in South Africa, not Zimbabwe.", "Disclose.tv, \"This man surpasses Tesla by inventing an electric car that never needs charging,\" April 26, 2018", "TechZim, \"Saith Technology Open Day to exhibit Zimbabwe’s locally produced drone,\" July 20, 2015", "TechZim, \"Saith Technologies : What is the real innovation / invention?,\" July 24, 2015", "SABC Digital News, \"An electric car that does not require conventional recharging,\" Aug 18, 2015", "Saith Technologies, website, accessed Oct. 28, 2018", "Snopes, \"Did a man from Zimbabwe invent an electric car that requires no charging?,\" June 1, 2018", "263chat.com, \"Trump scoops top Zimbabwean inventor Maxwell Chikumbutso,\" June 6, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]