["About this rating", "On 10 May 1991, a 14-year-old Boy Scout named David Hahn earned an Atomic Energy merit badge, the first (and likely only) person in the history of Troop 371 in Clinton Township, Michigan, to receive a badge in that discipline:", "David was awarded his Atomic Energy merit badge on May 10, 1991, five months shy of his fifteenth birthday. To earn it he made a drawing showing how nuclear fission occurs, visited a hospital radiology unit to learn about the medical uses of radioisotopes and built a model reactor using a juice can, coat hangers, soda straws, kitchen matches, and rubber bands. By now, though, David had far grander ambitions.", "Throughout his childhood, Hahn had been obsessed with chemistry, teaching himself everything he knew from encyclopedias, textbooks, and chemistry sets, while personal safety did not seem to be a concern of his. According to a 1998 Harper’s profile of Hahn written by Ken Silverstein, “He once appeared at a scout meeting with a bright orange face caused by an overdose of canthaxanthin, which he was taking to test methods of artificial tanning.” In another instance, he was held responsible for a blowing a large hole in the wall of a Boy Scout tent after accidentally igniting a stockpile of powdered magnesium he had brought along. His “laboratory” was eventually moved to the potting shed behind his mother’s house, after an incident in his father’s basement that did not go as planned:", "One night as [Hahn’s father and stepmother] were sitting in the living room watching TV, the house was rocked by an explosion in the basement. There they found David lying semiconscious on the floor, his eyebrows smoking. Unaware that red phosphorus is pyrophoric, David had been pounding it with a screwdriver and ignited it.", "After achieving the rank of Eagle Scout, Hahn decided he wanted to experiment with real radioactivity, not merely the models he had used to earn his badge. He created various radioactive devices, including two different “neutron guns” that emitted radioactive particles, and eventually decided he wanted to create a “breeder reactor” — an energy generating nuclear reactor that actually produces more fissile material than it consumes (by essentially turning material around it radioactive). The concept was popular in the 1970s but for the most part has been abandoned thanks to modern technology and geologic finds that make mining uranium more cost-efficient. The breeder reactor concept was described by the Department of Energy in 1971 as follows:", "A breeder is a reactor that produces more fuel than it consumes ... If the breeder can be used in a nuclear power plant, it can provide the heat needed for the generation of electricity and simultaneously produce an excess of fissionable material that can be used to fuel other plants. The answer to this apparent contradiction is that breeder reactors do not give \"something for nothing\", but produce usable fissionable material from comparatively useless fertile material at a greater rate than the original fuel in the reactor is consumed in the fissioning process.", "The obvious question is how would an adolescent working out of his mother’s potting shed acquire fissile material to play around with? This is where Hahn’s myopic focus and determination really shined: Many household products (and even more in the 1990s) contain radioactive material, but the problem is scale. Hahn exploited several commonly found products and used his knowledge of chemistry to extract and concentrate it to create radioactivity at levels “not found in nature.”", "Early on, one common source of Hahn’s radioactive material came from household smoke detectors, which contain extremely small amounts of the radioactive isotope americium-241 as part of the mechanism that detects smoke. He “contacted smoke-detector companies and claimed that he needed a large number of the devices for a school project.”", "To obtain the radioactive isotope thorium-232, Hahn recalled a fact he had learned as an Eagle Scout: that the mantle of gas lanterns contains traces of the radioactive material. So he purchased “thousands of lantern mantles from surplus stores and, using the blowtorch, reduced them into a pile of ash.” This method produced radiation levels “9,000 times the level found in nature and 170 times the level that requires [Nuclear Regulatory Commission] licensing.”", "Radium-226, he learned, was found in the paint of antique luminescent clocks. Hahn was able to find an antique can of the mildly radioactive paint in a clock at a nearby antique store, which he used to isolate the isotope for experiments. Tritium, he found, was used as a component of glow-in-the-dark gun and bow sights, which he repeatedly purchased and returned as part of a scheme to collect the material. Hahn “removed the tritium contained in a waxy substance inside the sights, and then, using a variety of pseudonyms, returned the sights to the store or manufacturer for repair—each time collecting another tiny quantity of tritium.”", "These purchases were not the only instances in which Hahn employed subterfuge to obtain radioactive material. Claiming to be a professor, he once wrote to a Czechoslovakian firm that sells uranium to commercial and university buyers, obtaining a few samples of material which contained uranium-235 and uranium-238. “Ignoring any thought of safety,” as Harper’s described it, he attempted to build a reactor using the radioactive material he had collected over the years, using a schematic in his father's college chemistry textbook as his guide:", "[Hahn] took the highly radioactive radium and americium out of their respective lead casings and, after another round of filing and pulverizing, mixed those isotopes with beryllium and aluminum shavings, all of which he wrapped in aluminum foil. What were once the neutron sources for his guns became a makeshift “core” for his reactor. He surrounded this radioactive ball with a “blanket” composed of tiny foil-wrapped cubes of thorium ash and uranium powder, which were stacked in an alternating pattern with carbon cubes and tenuously held together with duct tape.", "While he never achieved the critical mass necessary for a self-sustaining reaction, Hahn certainly appeared to have accomplished the creation of some new fissile material:", "[Hahn] monitored his “breeder reactor” ... with his Geiger counter. “It was radioactive as heck,” he says. “The level of radiation after a few weeks was far greater than it was at the time of assembly. I know I transformed some radioactive materials. Even though there was no critical pile, I know that some of the reactions that go on in a breeder reactor went on to a minute extent\" ...", "When his Geiger counter began picking up radiation five doors down from his mom’s house, David decided that he had “too much radioactive stuff in one place” and began to disassemble the reactor. He placed the thorium pellets in a shoebox that he hid in his mother’s house, left the radium and americium in the shed, and packed most of the rest of his equipment into the trunk of the Pontiac 6000.", "All of these events took place before the end of 1994, and perhaps they would have remained a secret to this day if Hahn had not stashed the remains of his nuclear reactor in that Pontiac. On 31 August 1994, police responded to complaints that Hahn was in a residential neighborhood “stealing tires from a car.” In their discussion with Hahn, the police ended up performing a search of the car and found:", "When they opened the trunk they discovered a toolbox shut with a padlock and sealed with duct tape for good measure. The trunk also contained over fifty foil-wrapped cubes of mysterious gray powder, small disks and cylindrical metal objects, lantern mantles, mercury switches, a clock face, ores, fireworks, vacuum tubes, and assorted chemicals and acids. The police were especially alarmed by the toolbox, which David warned them was radioactive and which they feared was an atomic bomb.", "The discovery of the radioactive contents of Hahn's trunk “automatically triggered the Federal Radiological Emergency Response Plan, and state officials soon were embroiled in tense phone consultations with the DOE, EPA, FBI, and NRC.” After examining his mother’s property (which she had cleansed of the most radioactive material in advance of law enforcement searches of the property for fear she would lose her home), authorities decided that the site was to be an EPA clean-up operation:", "A Superfund cleanup took place between June 26 and 28 at a cost of about $60,000. After the moon-suited workers dismantled the potting shed with electric saws, they loaded the remains into thirty-nine sealed barrels placed aboard a semitrailer bound for Envirocare, a dump facility located in the middle of the Great Salt Lake Desert. There, the remains of [Hahn’s] experiments were entombed along with tons of low-level radioactive debris from the government’s atomic-bomb factories, plutonium-production facilities, and contaminated industrial sites.", "Hahn fell into a deep depression following this episode, according to Harper’s, which was likely exacerbated by his mother’s suicide in 1996. He enlisted in the armed forces and spent four years in the U.S. Navy followed by some time in the Marines Corps before returning to his home state of Michigan. In 2007 the FBI investigated claims that Hahn was storing radioactive material in his apartment. In an interview with the FBI, Hahn described his honorable discharge from the military and his struggles with paranoid schizophrenia in the years following his return home:", "Hahn advised that prior to joining the Navy in May, 1997, he got into trouble for stealing tires and rims from a vehicle. Hahn stated he was in the Navy for approximately five and a half years as a internal communication specialist as well as various other positions. Hahn said he then received his associates from Macomb Community College for Applied Science in Criminal Justice. Hahn advised that he then enlisted in the Marines in 2004. Hahn stated he was a truck driver for approximately a year and a half before he was honorably discharged. Hahn said after a few months living with his [REDACTED], Hahn moved to his current residence. Hahn advised that he does not currently have a job.", "Hahn stated he is on disability because he was diagnosed with paranoid schizophrenia. Hahn said he also has radiation poisoning from his prior contact with radioactive substances. Hahn advised that he is compliant with all his medications most of the time. Hahn stated he occasionally drinks while he is on his medications.", "Hahn ran into trouble with the law for stealing smoke detectors in 2007 as well, and he experienced repeated drug-related incidents in the years following. He died on 27 September 2016 at the age of 39, a death which was the result of alcohol poisoning, his father said:", "Citing a toxicology and autopsy report, Kenneth Hahn said his son was found with a dangerous level of blood alcohol content, 0.404, late in the evening on September 26, 2016 ... Prior to his death, [Kenneth] Hahn accompanied his son to the Veterans Administration hospital for quarterly routine checkups. Medical staff there found no lingering ill effects from the earlier radiation exposure.", "Hahn's story first came to public light in the 1998 Harper’s profile written by Ken Silverstein. Silverstein later expanded that piece into the book The Radioactive Boy Scout which was in turn optioned for a feature film in 2016. “I’m proud of my son and I’m very sad that he’s gone,\" Kenneth Hahn told Ars Technica in March 2017. \"He could have done a lot more in this world.\"", "Silverstein, Ken.   \"The Radioactive Boy Scout.\"\r\n    Harper’s.   November 1998.", "U.S. Atomic Energy Commission.   \"Breeder Reactors.\"\r\n    1971.", "Kasprak, Alex.   \"Friendly Reminder That Your Smoke Detector Is Totally Radioactive.\"\r\n    BuzzFeed.   1 October 2015.", "Veronese, Keith.   \"The Thorium Lantern: Your Opportunity for Retail Radiation Exposure.\"\r\n    Gizmodo.   2 March 2012.", "U.S. Environmental Protection Agency.   \"Radioactive Antiques.\"\r\n    Accessed 23 October 2018.", "TEC Accessories.   \"Primer on Tritium.\"\r\n    Accessed 23 October 2018.", "FBI FOIA Vault.   \"David Hahn Part 01 of 01\"\r\n    Accessed 23 October 2018.", "Tributes.com.   \"David Charles Hahn\"\r\n    Accessed 23 October 2018.", "Pressberg, Matt.   \"‘Radioactive Boy Scout’ Movie About Real Teen Nuke Builder in the Works.\"\r\n    The Wrap.   28 September 2016.", "Farivar, Cyrus.   \"Man Who Tried to Build a Homemade Nuclear Reactor Didn’t Die of Radiation Poisoning.\"\r\n    Ars Technica.   14 March 2016.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]