["About this rating", "On 9 December 2014, The Free Thought Project published an article referencing the Illinois state legislature's passage of an amendment to Senate Bill 1342, which dealt with the recording of oral conversations between two or more persons:", "This bill passed both the Illinois House and Senate with overwhelming majority votes; 106-7 in the House on and 46-4-1 in the Senate. Democrats and Republicans alike slipped this bill by the citizens as they were debating on whether the General Assembly would raise the state's minimum wage or make the 67% temporary income tax hike permanent, neither of which passed.", "According to IllinoisPolicy.org, the bill discourages people from recording conversations with police by making unlawfully recording a conversation with police — or an attorney general, assistant attorney general, state's attorney, assistant state's attorney or judge — a class 3 felony, which carries a sentence of two to four years in prison. Meanwhile, the bill makes illegal recording of a private citizen a class 4 felony, which carries a lower sentencing range of one to three years in prison.", "There's only one apparent reason for imposing a higher penalty on people who record police in particular: to make people especially afraid to record police. That is not a legitimate purpose. And recent history suggests it's important that people not be afraid to record police wherever they perform their duties so that officers will be more likely to respect citizens' rights, and officers who do respect citizens' rights will be able to prove it.", "Although it was widely characterized as such, the legislation did not establish a new law specifically prohibiting citizens from recording police officers. Rather, the bill made it a felony to surreptitiously record any \"private conversation\" (defined as any \"oral communication between 2 or more persons,\" where at least one person involved had a \"reasonable expectation\" of privacy), with greater penalties for recording such conversations when they involved law enforcement officers (including not just police but also state attorneys and judges).  The legislation was intended to replace a previous eavesdropping law that had been struck down by the state Supreme Court:", "Earlier this year, the Illinois Supreme Court struck down a state eavesdropping law that made it a crime for citizens to record conversations with police or anyone else without the other person's permission. The court held that the old law \"criminalize[d] a wide range of innocent conduct\" and violated free-speech rights. In particular, the court noted the state could not criminalize recording activities where there is no reasonable expectation of privacy, including citizens' \"public\" encounters with police.", "According to critics, however, the new law was \"nearly as bad as the old one\" and was intended to effectively prohibit citizens from recording police officers in performance of their duties by making the meaning and application of the eavesdropping law so opaque:", "Under the new bill, a citizen could rarely be sure whether recording any given conversation without permission is legal. The bill would make it a felony to surreptitiously record any \"private conversation,\" which it defines as any \"oral communication between 2 or more persons,\" where at least one person involved had a \"reasonable expectation\" of privacy.", "When does the person you're talking to have a reasonable expectation of privacy? The bill doesn't say. And that's not something an ordinary person can be expected to figure out.", "A law must be clear enough for citizens to know in advance whether a particular action is a crime. This bill doesn't meet that standard, which should be reason enough for a court to strike it down if it becomes law.", "But lack of clarity isn’t the only problem with this bill.", "Although it appears to be designed to accommodate the Illinois Supreme Court’s ruling striking down the old law, the bill actually is designed to continue to prevent people from recording interactions with police.", "The bill says it would only be a crime to record someone where there is a reasonable expectation of privacy, which should mean that recording public encounters with police would not be a crime, and the old law's fatal constitutional flaw would no longer exist.", "But the bill doesn't really fix the problem. Again, citizens can't be expected to know for sure precisely which situations give rise to an \"expectation of privacy\" and which don’t. The Illinois Supreme Court said that police don't have an expectation of privacy in \"public\" encounters with citizens, but it did not explain what counts as a \"public\" encounter. So if this bill becomes law, people who want to be sure to avoid jail time will refrain from recording police at all, and the law will therefore still effectively prevent people from recording police.", "The bill would also discourage people from recording conversations with police by making unlawfully recording a conversation with police — or an attorney general, assistant attorney general, state's attorney, assistant state's attorney or judge — a class 3 felony, which carries a sentence of two to four years in prison. Meanwhile, the bill makes illegal recording of a private citizen a class 4 felony, which carries a lower sentencing range of one to three years in prison.", "However, the element of the bill regarding recording of police activities was praised by groups such as the American Civil Liberties Union (ACLU), who interpreted it as protecting (rather than discouraging) a citizen's right to film on-duty officers: \"We cannot be arrested or prosecuted under the new statute for recording on-duty government officials who are talking to the public as part of their jobs, because those conversations are not private. The new statute respects the appellate court ruling in the case the ACLU brought against the Cook County State's Attorney's Office: on-duty police officers have no reasonable expectation of privacy in their conversations in public places.\"", "Democratic Senators Kwame Raoul and Elaine Nekritz, who wrote the amendment to Senate Bill 1342, believed the bill, which focused more on \"private\" conversations, would fix the issues previously addressed by the Illinois Supreme Court: \"The most important thing the bill does is to restore Illinois to a standard that requires everyone in a private conversation to consent to a recording. We satisfy the Supreme Court requirement by limiting that to conversations where there is a reasonable expectation of privacy.\"", "This \"reasonable expectation of privacy,\" however, would not apply to law enforcement officials in certain situations. The Associated Press reported the new legislation would make it easier for police to eavesdrop without a warrant: \"The bill allows police, with only permission from the state's attorney, to surreptitiously record conversations for 24 hours when investigating such serious crimes as murder, the most heinous sexual assaults, kidnapping, human trafficking and others.\"", "The bill was approved by Illinois' governor, and took effect, on 30 December 2014.", "O'Connor, John.  \"Eavesdropping Bill Focuses on 'Private' Dialogue.\"\r\n    Associated Press.   7 December 2014.", "Fusco, Chris   \"State Eavesdropping-Law Fix to Head to Governor's Desk.\"\r\n    Chicago Sun Times.   4 December 2014.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]