["On December 15, the protest against the Citizenship Amendment Bill (CAB) took a violent turn in New Delhi when at least six buses were set ablaze and many private vehicles were damaged in and around Jamia Nagar area, confirm reports by The Indian Express, The News Minute and The Hindu.", "That same day spokesperson of BJP Mumbai Suresh Nakhua tweeted, “AAP MLA #AmanatullahKhan was seen in New Friends Colony in Delhi where violent protests took place & 2-3 buses were set on fire #AapBurningDelhi AAP showing it’s true colours.", "AAP MLA #AmanatullahKhan was seen in New Friends Colony in Delhi where violent protests took place & 2-3 buses were set on fire#AapBurningDelhi", "AAP showing it’s true colors pic.twitter.com/JD5Iprh0Ns", "— Suresh Nakhua 🇮🇳 ( सुरेश नाखुआ ) (@SureshNakhua) December 15, 2019", "Twitter user @TrulyMonica, a former journalist, quote-tweeted Delhi chief minister’s tweet and said, “Your MLA was part of the mob that torched the bus. And here on Twitter you are issuing peace appeals. How do you live with yourself .”", "Your MLA was part of the mob that torched the bus. And here on Twitter you are issuing peace appeals. How do you live with yourself 🤷🏻‍♀️ https://t.co/njUb1bCSZG pic.twitter.com/H6FDLAMaCw", "— Monica (@TrulyMonica) December 15, 2019", "@ArvindKejriwal Can you explain to citizens of Delhi why was #AAP MLA present at the violent protest?.", "— Vijay Goel (@VijayGoelBJP) December 15, 2019", "Since December 15, several people have tweeted linking Khan to the violent protests.", "A graphic of the AAP MLA addressing protesters began circulating online with the text blaming the party for the violence. In the background, one can spot a torched bus.", "Aam Admi Party tweeted an 84-second video in which Amanatullah Khan responded to the viral claims.", ".@AAPDelhi MLA @KhanAmanatullah‘s reaction on Jamia Incident.#BJPburningDelhi", "Watch & Share widely 👇 pic.twitter.com/l5jwQI9g8e", "— AAP (@AamAadmiParty) December 15, 2019", "In the video, he can be heard saying that a false claim is floating on social suggesting that buses were burnt in New Friends Colony in his presence. “I was at Shaheen Bagh on the way to Noida from Kalindi Kunj. There are no reports of buses torched in this area. The claim that buses were burnt in my presence is false,” said Khan.", "Alt News contacted a local from Abul Fazal Nagar, Mohammed Sami, who attended the protest in the Shaheen Bagh. Sami corroborated that on December 15 Amanatullah Khan was at Shaheen Bagh conducting a peaceful agitation. “I was at the protest from 4.30 pm to 5.45 pm,” he said.", "Sami mentioned that the protest took place less than a few metres away from the Woodland store in Shaheen Bagh.", "Firoz Ahmad, former president minority wing AAP, said that Khan was at the site of protest in Shaheen Bagh approximately from 1.30 pm to 6 pm on December 15.", "Ahmad also stated that he posted Facebook Live videos from Amanatullah Khan’s account. Alt News could find several Facebook Live videos posted from Khan’s account – 1.22 pm (duration 00:07:07), 1.34 pm (duration 00:00:09), 1.57 pm (duration 00:03:36), 2:52 pm (duration 00:01:23), 3.31 (duration 00:05:21).", "In the 1.57 pm (duration 00:03:36) video, a police officer can be spotted alongside Khan.", "As per a December 15 report (photo-essay) in The Indian Express, “An estimated 1,000 protesters clashed with police and at least six buses and over 50 vehicles were set ablaze in Mathura Road, New Friends Colony, Jamia Nagar and Sarai Julena on Sunday.” This report contains several images by photographer Gajendra Yadav.", "Speaking with Alt News, Yadav said that he was on-ground on December 15 from 10 am to 6 pm. According to him, the vehicles were burnt at around 4 pm. “The violent protests took place within a 4-kilometre radius from the location where Amanatulla Khan was protesting. However, according to my observation, the protests in Shaheen Bagh were peaceful in nature,” said Yadav.", "The journalist further stated, “The men who were burning the buses and destroying private vehicles didn’t look like students. Many of them were drunk.”", "Alt News performed a keyword search on Twitter and found photographs uploaded by Sidharth Ravi and Kallol Bhattacherjee, journalists from The Hindu. According to these posts, the buses we set ablaze at around 4:45 pm. Sidharth Ravi confirmed the location to Alt News as Mata Mandir Road, New Friends Colony.", "Bus set on fire by protesters, tear gas shelling on in Delhi @THNewDelhi pic.twitter.com/fqmX94XdXF", "— Sidharth Ravi (@SidRavii) December 15, 2019", "“The protests got violent around 4.15 pm,” said Ravi, who was reporting from Jamian Nagar area on December 15 from 2 pm to 6.30 pm. “At least five buses were torched in Mathura Road, Mata Mandir and Sarai Julena,” he added. Ravi said that he did not spot Amanatullah Khan while reporting from these areas. According to him, the violent protests did not have on-ground leaders.", "Alt News spoke with Jamia police, according to them no buses were burnt in their jurisdiction but were torched in New Friends Colony.", "As per multiple witnesses, Amanatullah Khan was present at Shaheen Bagh from approximately 2 pm to 6 pm. There are no reports of buses being torched in Shaheen Bagh by the media.", "Therefore, the claim that the AAP MLA was seen in New Friends Colony where the violent protests took place or that he was a part of the mob that torched buses is false.", "On December 16, BJP filed an FIR against Dy CM of Delhi Manish Sisodia, AAP MLA Amanatullah Khan and other AAP leaders for being involved in riots at Jamia Millie Islamia on the previous day.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]