["About this rating", "In June 2018, a shocking revelation appeared on social media about a well-known and well-worn song called \"Electric Boogie (The Electric Slide)\" — the popular dance song was apparently written about a sex toy:", "Although many shared this rumor as if it were a fact, this claim is based on little more than an interpretation of the song's lyrics:", "It's Electric!", "You can't see it\nIt's electric!\nYou gotta feel it\nIt's electric!\nOoh, it's shakin'\nIt's electric!", "Jiggle-a-mesa-cara\nShe's a pumpin' like a matic\nShe's a movin' like electric\nShe sure got the boogie", "You gotta know it\nIt's electric\nBoogie woogie, woogie!\nNow you can't hold it\nIt's electric\nBoogie woogie, woogie!\nBut you know it's there\nYeah here there everywhere", "As this rumor picked up steam, Aazios.com published an article reporting that the song's writer, Neville \"Bunny Wailer\" Livingston, had confirmed the subtext of its lyrics:", "Writer Confirms \"The Electric Slide\" Is About a Vibrator", "\"I'm surprised it took people this long to figure out\" the source tells us he said. Apparently Livingston wrote the song after a girlfriend told him she didn't need him because she had a toy she nicknamed the \"electric slide\"", "This was not a reliable story, as the alleged \"confirmation\" came from an anonymous third party and not from Bunny Wailer (Neville Livingston), the song's writer, despite the wording of the article's title. The article also did not provide any information about how the source was contacted, nor any explanation for why the source would remain anonymous. In other words, we are highly skeptical that this quote truly came from a source close to Wailer, and we strongly suspect that this story was invented to take advantage of a viral rumor.", "In fact, Wailer specifically denied this rumor in a statement to EDM:", "At no time have I ever lent credence to a rumor that the song was inspired by anything other than Eddie Grant’s Electric Avenue. To state otherwise is a falsehood and offends my legacy, the legacy of the singer Marcia Griffiths, and tarnishes the reputation of a song beloved by millions of fans the world over.", "Marcia Griffiths, who performed on the song, also denied the rumor. The singer told The Blast that the \"Electric Boogie\" was about positive vibrations, not vibrators:", "“I don’t sing about vibrators … I sing to teach, educate and uplift.”", "She says the 80’s hit is about “positive vibrations, not vibrators,” and that when she called Wailer to find out what was going on, he had no clue about the rumor.", "Unsurprisingly, our search of news articles, musical histories, magazines and album reviews for any indication whatsoever that this song was written about a sex toy yielded no results.", "Wailer spoke a little about the creation of the song in an August 2009 interview with the Jamaica Gleaner. And no, he didn't mention vibrators.", "He wrote the song in the 1970s for childhood friend Marcia Griffiths, but it didn't become a hit until several years later:", "When Bunny Wailer wrote Electric Boogie for Marcia Griffiths, the track crackled with the energy of childhood friendship then intermittent contact in later years as their musical paths crossed (Wailer remembers Griffiths coming to Camperdown High to sing as a teenager, then auditioning her as part of a group at Studio One).", "And, as he tells it, it seems that Wailer was plugged into the current of popular music of the late 1970s when Griffiths recorded Electric Boogie, and the amperage of music trends to come, as his prediction of a hit, even if it took a decade, became reality.", "Wailer went back to work on \"Electric Boogie\" in the 1980s in an attempt to capture the popularity of songs such as Eddy Grant's \"Electric Avenue.\" In his interview with the Gleaner, Wailer said that Grant never fully explained what listeners were supposed to do (other than \"take it higher\") after they \"rocked down to Electric Avenue,\" and suggested that it would be the perfect place to do the Electric Boogie:", "\"There was this track at the time being played called Electric Avenue (by Eddy Grant). That was the most popular song then. So me sey if me ago think pop, me haffi start smell roun' dem kitchen deh. So you going down Electric Avenue to do what? Because him don't stipulate. So me sey him mus ago do the Electric Boogie. So me jus' start formulate the song,\" Wailer said.", "You can watch the \"Electric Boogie,\" which was certainly not about vibrators, in the video below:", "Khan, Alya.   \"Iconic Song 'The Electric Slide' Is Rumored to be About a Vibrator. [Update]\"\r\n    EDM.com.   27 June 2017.", "Cooke, Mel.   \"'Electric Boogie' Strikes After 10 Years.\"\r\n    Jamaica Gleaner.   9 August 2009.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]