["By Robert Farley", "Posted on September 13, 2019", "Making a point about Defense Department waste, Democratic presidential candidate Andrew Yang related a secondhand story about a Navy fighter pilot who said that airmen routinely dumped fuel into the Pacific Ocean at the end of the fiscal year as a way to preserve the following year’s fuel budget. But the story doesn’t add up.", "Yang allowed that he could not verify it. Neither could we. The Navy denies it. And Navy budget experts we interviewed said that’s not how the department’s budget works.", "Yang related the anecdote at CNN’s “Climate Crisis Town Hall” on Sept. 4.", "Yang, Sept. 4: We’re spending $750 billion that we know of on our military industrial complex every year. And I’m going to share a story that I heard secondhand, so I can’t verify it. But there was a Top Gun, a fighter pilot, who said that his least favorite time of the year is at the end of the fiscal year, because he flies over the Pacific Ocean and dumps oil into the ocean. Now, why is he doing that? Because they have to use all the oil that’s budgeted, or else they won’t get the same amount budgeted the following year. So this broke his heart, broke my heart to even hear this story. What we have to do is, we have to take some of the $750 billion and start channeling it towards our infrastructure, which will be an evergreen need.", "We reached out to Yang’s press office for more detail, and for the name of the pilot who is alleged to have made this claim, but we didn’t get a response.", "The Navy said the story isn’t true.", "“U.S. Navy aviators do not dump fuel to preserve budgets,” Cmdr. Ron Flanders, a spokesman for Naval Air Forces, told us via email. “Navy squadron budgets are based on flight hours, not fuel consumption. U.S. Navy aviators only dump fuel during emergencies to ensure safety of flight.”", "The story also had other naval experts scratching their heads.", "Charles Nemfakos, who served a long career in the Navy and was the senior civilian official for the Office of the Assistant Secretary of the Navy for Financial Management and Comptroller from 1998 to 2001, said the story Yang related must have resulted from a miscommunication.", "“We do budget by number of flying hours per mission,” Nemfakos told us via email. “The flying hour calculated budget cost by type/model/series has a lot of components, including fuel. The pilot in question certainly would have known that the Top Gun school could not significantly fudge the flying hour cost by dumping at the end of the year. What he may have been trying to say is that he felt they were doing unnecessary flying at the end of the year to keep flying hour levels up. Since I never experienced the aviation community underflying their planned program short of maintenance issues, I am not sure what he was trying to say. I would venture there was a communication problem.”", "Besides, he said, “I am sure the enviros in California would have raised hell if indiscriminate dumping was a practice.”", "“I have not heard anything to this effect,” Richard Danzig, the former Navy secretary under President Bill Clinton, told us via email. “End of year budget reckonings do encourage last minute spending, but patterns I have heard about involve stockpiling things to be used in the future not discarding things.”", "To be sure, some in-air jettisoning of fuel does happen. Aviation experts say that in some cases when planes need to make emergency landings, there is a need to offload the weight of fuel to facilitate a safe landing.", "“Fuel dumping is common on both large commercial widebody airliners and virtually all military planes,” according to Aerospaceweb.org, a nonprofit website operated by engineers and scientists in the aerospace field. “Many aircraft require the ability to dump fuel because of landing weight restrictions imposed by the manufacturers. Although a plane may be able to takeoff at a certain weight, its structure and landing gear may only be able to withstand the impact of landing at a much lower weight. This difference between maximum takeoff weight and maximum landing weight may be tens of thousands of pounds or even over a hundred thousand pounds for very large planes. In other situations, an aircraft may be at an acceptable landing weight but forced to make an emergency landing at a runway that is too short. It may be necessary to dump fuel to reduce the plane’s weight low enough in order to make a safe landing on a shorter field.”", "“It is easy for fighter aircraft to dump fuel, but as the spokesman said, it is usually done in emergencies,” Dave “Bio” Baranek, a retired naval flight officer, told us via email. Other times, he said, it is dumped to adjust aircraft weight for landing.", "Sometimes, pilots perform what is known as “dump-and-burn” in which jettisoned fuel is ignited using a plane’s afterburner, a popular maneuver at air shows.", "Baranek, who was an adviser for the movie “Top Gun” and flew aerial sequences used in the film, wrote about the visual effects of dumping fuel in his book, “Topgun Days: Dogfighting, Cheating Death, and Hollywood Glory as One of America’s Best Fighter Jocks.“", "“While setting up for a filming pass, the camera crew had difficulty spotting the gray F-14 against the mountainous background,” he wrote. “Over the radio, Rat asked the pilot to blip the fuel dump switch and make a mini-cloud. The resulting effect of the atomized fuel swirling in the Tomcat’s vortices looked so good that this technique was used several times in the finished film.”", "Here’s how it looked in the film:", "At high altitudes, most jettisoned fuel evaporates before reaching the ground.", "“Once released, the fuel trails behind the aircraft and creates a pattern that looks much like a contrail,” the Aerospaceweb.org article, which was written by aerospace engineer Jeffrey Scott, states. “Modern aviation fuel comes in many varieties but all are derivatives of kerosene. Kerosene evaporates rapidly in the atmosphere and very little typically survives in liquid form to reach the Earth’s surface. The exact evaporative characteristics of dumped fuel depends on a number of factors like the altitude at which it was released, the atmospheric temperature, and the dumping pressure. Kerosene dumped at high altitude on a warm day tends to evaporate fastest.”", "According to a Federal Aviation Administration document, “Most of the fuel that is dumped turns into vapor within a few minutes. If jettisoned above 5000 feet in above freezing temperature calculations show that 98% will evaporate before reaching the ground. The fuel vapors rapidly dissipate and diffuse. This could contribute to photochemical oxidant pollution, smog. The portion that remains in droplet form could lead to condemnation of water, and possibly cause some local rain. When these droplets settle to the ground, usually they are spread over a wide area, minimizing their effect.”", "Baranek, the retired naval flight officer, told us pilots try to avoid dumping fuel.", "“Pilots are aware of the environmental impact of dumping fuel and make every attempt to avoid doing so,” he said. “When they do dump fuel, they attempt to dump it above an altitude of 6,000 feet so that it can atomize and be scattered before hitting the ground. The dumping in the movie ‘Top Gun’ was obviously below 6,000 feet, but it was a very brief dump, not much fuel.”", "Flanders, the Naval Air Forces spokesman, said, “Depending on the area of operations, the Navy has guidelines which govern the jettisoning of fuel for safety in flight (including minimum altitudes). In times of emergency, pilots may be forced to jettison fuel below these prescribed minimums. The Navy always seeks to balance operational requirements with being good stewards of our environment.”", "Baranek told us he was never aware of any Navy pilots dumping fuel at the end of the fiscal year to preserve the following year’s fuel budget.", "“In my experience, aviators would use available fuel for training (i.e., use it to fly) before dumping it,” Baranek said.", "The difficulty in fact-checking an anonymous secondhand claim like this, of course, is that it is nearly impossible to disprove. But the Navy and several former members of the Navy who were in positions of expertise say they never heard of such a practice, and that the accounting practices in the Navy created no such incentive. Yang himself noted that he could not verify the story. Nonetheless, he did relate the anecdote — one that, if true, suggests military waste and environmental indifference — in a nationally televised address.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]