["About this rating", "A video purportedly showing a person scaring Donald Trump by shouting \"Allahu Akbar\" at a 2016 presidential campaign rally racked up more than 2 million views within ten days of its posting to Facebook by user Garba Abdullahi on 5 August 2018:", "The visuals in this footage were genuine and depicted a scene in which a protester rushed the stage at a rally on 12 March 2016 in Vandalia, Ohio. The audio in this Facebook clip, however, was manipulated to make it sound as if Trump had been scared by someone shouting \"Allahu Akbar\" (an Arabic phrase used by Muslims, meaning \"Allah is [the] greatest\").", "We examined several contemporaneously published versions of this footage posted by news outlets such as CNN, ABC News, CBSN,  the New York Daily News, and NBC News and found that none of these videos contained the \"Allahu Akbar\" exclamation featured in the viral Facebook video.", "The following clip, for instance, was posted to NBC News' YouTube page on 14 March 2016:", "The protester who touched off the incident was identified as 22-year-old Thomas DiMassimo:", "A Fairborn man with a history of protesting vaulted over waist-high metal railings, broke through two security staff and nearly got on stage near the end of Saturday’s Donald Trump rally near the Dayton International Airport.", "Thomas Dimassimo, 22, was arrested for disorderly conduct and inducing panic, according to the Montgomery County Sheriff’s Office. He was released from the county jail Saturday afternoon.", "Although news reports at the time made no mention of anyone's shouting the phrase \"Allahu Akbar,\" a baseless rumor holding that Dimassimo was a member of ISIS did circulate in the days following the protester's arrest. The claim, which was largely based on an edited video of Dimassimo featuring Arabic music, was even pushed by Trump himself:", "Dimassimo denied being a member of ISIS, and authorities did not  state that he was a member of ISIS, either at the time of his arrest or afterwards:", "When asked whether he'd planned on attacking Trump if he'd been able to reach him, DiMassimo said he had not.", "\"No, not at all. There would have been no point. Donald Trump is 6 foot 3. I'm 5 foot 9, maybe. He's a giant man surrounded by thousands of followers, 12 Secret Service and a former Ohio State offensive lineman. That would have accomplished nothing.\"", "\"But again it was more important for me to show that there are people out there who aren't afraid of Donald Trump. He says scary things. He lets his people do scary things. He's threatened Mexico, Islam, you name it, and yet I'm unafraid. And if I can be unafraid enough to go take his podium away from him, then we all can be (un)afraid enough to not let this man walk into the White House.\"", "DiMassimo vehemently denied belonging to ISIS ... When asked whether he was a Christian, [DiMassimo] said he was.", "\"I am not a member of ISIS. I have no known ties to ISIS. I've never been out of the country. I only speak English,\" DiMassimo said.", "Savidge, Martin.   \"CNN Exclusive: 'Trump is a Bully,' Says Man Who Rushed Stage.\"\r\n    CNN.   14 March 2016.", "Kelley, Jeremy.   \"Arrested Man Has a History of Protests.\"\r\n    NBC News.   12 March 2016.", "Abdullah, Halimah.   \"Secret Service Chief: Tense Rallies Create 'Challenges.'\"\r\n    NBC News.   15 March 2016.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]