["The photo has been shared more than 200 times since it was published in this Facebook post on April 24, 2020.", "The post's lengthy caption describes the bodies as elderly COVID-19 patients who were euthanised by their governments.", "GRAPHIC", "Show", "Hide", "In a mix of Tagalog and English, the caption states in part: \"Do you know why there are many dead in other countries and they're mostly the elderly? It's bcoz their governments are practical. They are thinking that if the government gives proper attention and care to seniors or the elderly, at the end the effort will be useless because they are already unproductive, so they are removed from ventilators. In short euthanasia is what they're doing that's why the dead are strewn.\"", "The same photo was also shared here and here on Facebook alongside similar claims.", "The claims are false.", "A reverse image search on Google found that the photo was taken by an AFP photographer in the aftermath of a stampede that killed thousands of pilgrims during the hajj in 2015 in Saudi Arabia.", "The hajj is one of the world's largest annual religious gatherings and one of the five pillars of Islam that all Muslims must undertake at least once in their lives.", "The caption of the AFP photo states in part: “Saudi emergency personnel stand near bodies of Hajj pilgrims at the site where at least 717 were killed and hundreds wounded in a stampede in Mina, near the holy city of Mecca, at the annual hajj in Saudi Arabia on September 24, 2015.”", "GRAPHIC", "Show", "Hide", "Below is a screenshot comparison of the photo in the misleading posts (L) and the AFP photo (R):", "GRAPHIC", "Show", "Hide", "The claim that countries with high COVID-19 death tolls are euthanising elderly patients is a hoax and is not supported by reliable media or human rights reports, AFP reported here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]