["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A South Korean official shows the seismic wave of North Korea's nuclear test on May 25, 2009", "Shortly after North Korea failed to launch a missile in an attempted show of force, one of the U.S. congressmen who keeps a particularly close eye on the erratic dictatorship had a warning.", "North Carolina Republican Sen. Richard Burr, the chairman of the Senate Intelligence Committee, told a group of constituents at a meeting in Youngsville, N.C., that North Korea’s latest actions were \"something to really be concerned about.\"", "Burr went on to explain two reasons for his warning. One, he said, is that North Korean leader Kim Jong Un might be crazy. The other, he said, is that Kim has significantly ramped up missile development and testing since taking over for his father, the late Kim Jong-il.", "\"When you do things like he does, you automatically assume he’s crazy,\" Burr said of Kim Jong Un. \"The pace of missile development between his father’s term and his term has increased the testing about twenty-fold.\"", "There has been plenty of bluster and confusion surrounding the country’s missile launch lately – including the launch itself, a pre-launch parade replete with new military technology, and the Trump administration saying it had sent an aircraft carrier strike force to the area when, in reality, the ships were thousands of miles away and sailing in the opposite direction.", "So in the midst of so much noise, we wanted to know if Burr was right.", "Specifically, we looked into his claim that \"the pace of missile development between (Kim Jong Il and Kim Jong Un) has increased the testing about twenty-fold.\"", "A tiny but well-armed country", "In terms of troops, North Korea has one of the world’s largest militaries, along with the United States (a major adversary), China (its biggest ally) and India.", "Kim Jong Il wasn’t hesitant to build and test missiles, much to the dismay of neighboring countries. So increasing missile activity by a factor of 20 would require serious commitment by the younger Kim.", "Burr’s office didn’t respond when we asked where he got his information. He is, of course, privy to all sorts of secret reports and briefings we don’t have at our own disposal. He’s the chairman of the Senate Intelligence Committee, which oversees the 17 U.S. spy agencies.", "But we don’t think he would have unveiled classified information. And from the information that is public, it appears Burr is more or less correct.", "Missile testing and development", "We interviewed multiple North Korea experts, none of whom said they could verify the numerical accuracy of Burr’s claim – especially as it relates to missile development. Missile tests can be counted, but it’s harder to quantify the speed at which new technologies are being developed and perfected.", "\"Perhaps saying the ‘pace of missile development’ is not quite accurate wording, but the pace of testing has indeed been unprecedented under Kim Jong Un,\" said Jean H. Lee.", "Lee is a former journalist who covered North Korea and now works for the Woodrow Wilson International Center for Scholars. She said even failed tests are worrisome because North Korea is trying to create a nuclear-armed intercontinental ballistic missile that could hit the United States.", "\"With every test, they get closer to mastering that technology,\" she said.", "We couldn’t find any report from the Department of Defense that might vouch for Burr’s numbers. But we did find a February speech by Admiral Harry Harris, the head of the DoD’s Pacific Command. He spoke about North Korea’s \"aggressive weapons test schedule\" and a growing missile threat in the Pacific, which is in keeping with the general theme of Burr’s claim.", "The North Korea experts we interviewed all said something like Lee’s assessment: That Burr is correct to say Kim Jong Un put a greater focus on missiles, even if it’s hard to define how much.", "\"The range of their missiles is being extended,\" said T.J. Pempel, a University of California, Berkeley, political science professor who specializes in northeast Asia. \"They have substantial submarine launched missiles; they have ICBMs. The frequency and number of their tests is also going up.\"", "Joseph Bermudez, an expert with the North Korea analysis group 38 North who has testified before Congress and the United Nations on the country’s missiles, said Burr is right about the increased pace of testing.", "One of Bermudez’s colleagues at 38 North put together a timeline of missile tests by North Korea, along with an assessment that nearly backs up Burr’s point – at least about testing, if not about development. It said North Korea tested only one missile in 2006 (under Kim Jong Il) but tested 15 in 2014 (under Kim Jong Un).", "In 2016, the DoD’s annual report to Congress made a similar point.", "\"Kim Jong Un seems to prioritize the development of new weapons systems, as demonstrated by his numerous appearances with military units and research and development organizations,\" the report read.", "But Bermudez said Burr’s not necessarily right to say an increase in testing equates to breakthroughs in development.", "Every missile program requires research and development, testing, training, tweaking and more testing. It’s not a fluid timeline, Bermudez said. There are spikes in activity surrounded by relatively dormant periods.", "\"Now if you have multiple missile programs going on, these cycles overlap,\" he said. \"... It might give the false impression that something is happening that isn't happening.\"", "Furthermore, he said, many North Korean missile tests are conducted for political reasons, intended to send a message instead of to further research and development.", "That’s another factor making it difficult to tell if the pace of development has driven the increase in the pace of testing, as Burr had claimed.", "Our ruling", "Sen. Richard Burr said that in North Korea, \"the pace of missile development between (Kim Jong Il and Kim Jong Un) has increased the testing about twenty-fold.\"", "Experts say missile testing has certainly increased, and at least one analysis shows that increase was close to what Burr said.", "What’s less clear is if the increased testing has gone hand-in-hand with increased development, or if the tests aren’t moving the country’s missile program forward as much as they might seem.", "We rate this claim Mostly True.", "The News & Observer article quoting Burr on North Korea, April 18, 2017, \"Sen. Burr: Congress, Trump ‘approached the health care bill the wrong way’\"", "Email interview with TJ Pempel, political science professor at U.C. Berkeley", "Email interview with Jean H. Lee, North Korea expert at the Woodrow Wilson International Center for Scholars", "Phone interview with Joseph Bermudez, a North Korea expert and analyst for 38north.org", "WNYC radio segment, April 17, 2017, \"Tenions mounts with North Korea\"", "Annual report to Congress on North Korea by the Department of Defense, given Jan. 5, 2016", "Pacific Command, \"WEST 2017 Keynote: The View from the Indo-Asia-Pacific\" speech by Adm. Harry B. Harris Jr., Feb. 22, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]