["About this rating", "On 22 May 2018, the Facebook page \"Felicidad\" shared a video which they claimed shows a woman abandoning her son on the side of the road because her partner told her to do so. The post also posed a hypothetical question to viewers, asking them if they would be able to leave their child \"hungry and without a roof\" over their head in the same situation:", "This woman abandoned her son on the street because her partner asked her. Would you be able to leave your son hungry and without a roof to sleep?", "This video (which can be viewed in full at the bottom of this article) racked up more than 250,000 shares and 22 million views within a day of its initial posting. And although the footage is genuine, its accompanying backstory is not.", "This video was taken in the Zhudong Township of Taiwan and originally went viral in early April 2018. However, the woman in the video did not abandon her son to starve and sleep on the street due to her partner's request; she quarreled with her child after he refused to leave a park.", "A contemporaneous article published by Chinese-language news outlet United Daily News reported that the woman, identified only by the surname Xiao Xing, was trying to get her three children to leave a park after it started to rain. According to the story, she only \"pretended\" to drive away and the incident was reported to child services, but it is unclear if the investigation found the parent to be guilty of negligence or abuse.", "What is clear, however, is that this child was not left to starve on the street. Police reported that the boy was not physically harmed during the incident and that he was eventually brought home from the park.", "UDN.   \"管教過當！男童哭趴後車廂 母不甩踩油門遭人全記錄\"\r\n    3 April 2018.", "Donovan. Francesca.   \"Boy Clings To Mother’s Car As She Drives Off ‘As Punishment.’\"\r\n    Unilad.   5 April 2018.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]