["About this rating", "On 24 October 2016, the conspiracy-mongering web site WhatDoesItMean.com published an article reporting that former Clinton Foundation CEO Eric Braverman had sought asylum in Russia for reasons presumably related to knowledge he gained working for that charitable organization (purportedly supported by an e-mail WikiLeaks released in October 2016):", "An extraordinary Security Council (SC) report circulating in the Kremlin today says [on 24 October 2016] President Putin was “officially presented” with a Main Directorate for Migration Affairs (GUVM) of the Ministry of Internal Affairs (MVD) “file for review” relating to a request for “urgent and immediate” political asylum requested by an American citizen named Eric Braverman—who was the former CEO of the Clinton Foundation, and is known as the man who can expose “The Real Hillary Clinton Scandal”.", "Requests for the granting of political asylum in the Federation, this report explains, is regulated by a separate government resolution rather than the Law on Refugees and is issued to those seeking “asylum or protection from persecution or a real threat of becoming a victim of persecution” in their home country for “social-political activities or convictions that do not contradict the democratic principles recognized by the international community and norms of international law”—and though Russia has the world’s highest number of asylum applications, political asylum requests are very rarely granted.", "In his apparent knowing of these facts, however, this report continues, Eric Braverman, yesterday (23 October), arrived at the Consulate of Russia in New York City and presented his “urgent and immediate” request for asylum on a visa application—as is “protocol/custom” because the Federation does not accept mail or electronic visa applications from residents of the continental United States.", "It wasn't long before the claim filtered up through conspiracy theory-oriented message boards to open social media and fringe web sites, with many repeating the implausible claim verbatim. But the rumor's purportedly shocking details originated with (and were reported by no source other than) the fake news site WhatDoesItMean.com, described by RationalWiki thusly:", "Sorcha Faal is the alleged author of an ongoing series of \"reports\" published at WhatDoesItMean.com, whose work is of such quality that even other conspiracy nutters don't think much of it.", "Each report resembles a news story in its style but usually includes a sensational headline barely related to reality and quotes authoritative high-level Russian sources (such as the Russian Federal Security Service) to support its most outrageous claims. Except for the stuff attributed to unverifiable sources, the reports don't contain much original material. They are usually based on various news items from the mainstream media and/or whatever the clogosphere is currently hyperventilating about, with each item shoehorned into the conspiracy narrative the report is trying to establish.", "Whatdoesitmean.com has perpetuated a number of baseless Clinton conspiracy theories during the 2016 election including falsehoods holding hacker Guccifer, Democratic National Committee (DNC) staffer Seth Rich, UN official John Ashe, and the father of a physician purportedly responsible for leaking Hillary Clinton's (falsified) health records were killed off by her shadowy operatives.", "On 18 January 2017, a news outlet reported Braverman had taken a new job (in Menlo Park, not Moscow):", "Eric Braverman, the former CEO of the Clinton Foundation, has been hired to oversee the non-investment side of the family office of Alphabet Inc. Executive Chairman Eric Schmidt and his wife, Wendy.", "Braverman will be in charge of the philanthropic arm of the Menlo Park-based Eric and Wendy Schmidt Group, an official with the organization told the Silicon Valley Business Journal. The group has given away hundreds of millions of dollars for environmental and other causes.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]