["About this rating", "Mitch McConnell did express opposition to a new Russia investigation, which can be interpreted as including opposition to the appointment of a special counsel.", "Mitch McConnell never said he would \"obstruct\" such an appointment, and would not legally have the power to block it.", "On 10 May 2017, Addicting Info reported that Republican Senate Majority Leader Mitch McConnell had vowed to block the appointment of an independent counsel to investigate Russian efforts to interfere in the United States' 2016 elections, along with alleged collusion between the Trump campaign team and Russia:", "Siding with Trump’s Attorney General Jeff Sessions and Trump’s spokesperson, McConnell told America from the floor of the Senate that he sees no reason to assign an independent special prosecutor or create a bipartisan committee to get to the bottom of Trump’s relationship to Russia.", "The story was published the day after President Donald Trump fired Federal Bureau of Investigation director James Comey, and a week before Deputy Attorney General Rod Rosenstein ultimately appointed former FBI director Robert Mueller as special counsel.", "The Addicting Info article does not actually include a quote from Mitch McConnell, but does allude to his remarks in the Senate on 10 May. The relevant statement can be read here, and watched here:", "This is the only point at which McConnell addresses the prospect of a new investigation into Russian election interference (of the kind ultimately started by Robert Mueller):", "Two investigations are currently ongoing: The Senate Intelligence Committee's review of Russian active measures and intelligence activities and the FBI investigation disclosed by Director Comey.", "Today we will no doubt hear calls for a new investigation, which could only serve to impede the current work being done to not only discover what the Russians may have done but also to let this body and the national security community develop the countermeasures ad warfighting doctrine to see that it doesn't occur again.", "Partisan calls should not delay the considerable work of Chairman Burr and Vice Chairman Warner [of the Senate Intelligence Committee]. Too much is at stake.", "These remarks make it clear that McConnell opposes setting up another investigation, and although he didn't explicitly refer to a special prosecutor or special counsel, it would be a reasonable interpretation of his remarks to say he would also oppose the appointment of a special counsel, given the many calls for such an investigation. However, he did not say he would \"obstruct any effort to hire an independent special prosecutor,\" or any words to that effect.", "Furthermore, it's not clear how Mitch McConnell would have even had the capacity to block efforts to hire a special prosecutor, a position now properly referred to as a \"special counsel.\" By law, the Attorney General or Deputy Attorney General is authorized to appoint a special counsel — who does not have to be vetted or confirmed by the Senate or House of Representatives.", "And that is exactly what happened: Deputy Attorney General Rod Rosenstein, acting in lieu of Attorney General Jeff Sessions, who has recused himself from the Russia investigation, named former FBI Director Robert Mueller as special counsel on 17 May 2017.", "The Addicting Info article accurately describes Mitch McConnell's opposition to a new Russia investigation, following the firing of James Comey.  However, it offers nothing to support the claim, in its headline, that the Senate Majority Leader had said he would \"obstruct any effort\" to appoint a special counsel, because the Senate Majority Leader never said that.", "Code of Federal Regulations.  \"Part 600 - General Powers of Special Counsel.\"\r\n  Government Publications Office.  Retrieved: 29 May 2017.", "Congressional Record.  \"Legislative Session (Senate - 10 May 2017).\"\r\n  Congress.gov.  10 May 2017.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]