["With India waking up to news of the Indian Air Force bombing JeM terror camps at Balakot in Pakistan in the early hours of February 26, multiple news channels have broadcasted a video, purported to be of IAF jets inside Pakistani territory. India Today has claimed that this video is the first visual of India’s cross-border strike which was conducted at around 3:30 am. Other news channels have broadcasted the video as taken in the aftermath of the strike.", "“What you see on your screens right now is the Pakistani Air Force scrambling post the IAF multiple jets going in and striking jaish camps. The extent of damage right now we dont know, but what we have are first pictures, this is first footage of the aftermath we are told, of the strike“, said the News18 anchor in the video clip, the screenshot of which has been posted above. The tweet was later deleted.", "The footage has been broadcasted by several news channels, including India Today, Economic Times, Aaj Tak, Times Now and News18. The video has also been relayed by the JioTV Twitter handle.", "The video shows a fighter jet deploying flares. It has been used extensively as ‘real’ footage of the cross-border operation carried out by the Indian Air Force against Pakistani territory. “On your screens right now, the big picture, the big video that India Today has accessed of one of these jets dropping bombs, dropping 1000 kilogram bombs at 3:30 am on JeM terror camps in Balakot area. This is first and exclusive on India Today”, said the anchor on the channel as these visuals played out.", "Expectedly, the video has been shared widely on Twitter and Facebook. For instance, the tweet below posted by a social media user was retweeted over 600 times.", "Supreme Court banned Pataki on Deepawal[/embedi but Indian army celebratedit in a majestic way. #Surgicalstrike2 pic.twitter.com/zEaR5Op6dS", "— Chakravarty Sulibele (@astitvam) February 26, 2019", "On Facebook, it has been viewed over 225,000 times alone from the page The India Eye, which has posted an extract from a India TV broadcast.", "भारतीय वायुसेना ने सीमा पार जाकर उड़ाए जैश के कई ठिकाने", "भारतीय वायुसेना ने सीमा पार जाकर उड़ाए जैश के कई ठिकाने… वायुसेना ने मिराज 12 जेट से आतंकी कैम्पों पर बरसाए 1000 किलों बम", "Posted by The India Eye on Monday, February 25, 2019", "According to reports, the air strike by the Indian Air Force on JeM terror camps was conducted at around 3:30 am on February 26, 2019. Alt News found that this video, used by multiple news organisations reporting the attack by IAF, was first posted in 2017.", "In September 2017, a YouTube channel uploaded a video titled ‘Flares at night Paf F-16’. The video is posted below. It can be seen from 0:34 onwards that a part of this very video has been used by the news channels.", "Moreover, Alt News found that the same video was posted by a Pakistani Facebook page on February 24. It had been posted by the page Fans Of Imran Khan. It was also tweeted by a Pakistani user on February 25, with the narrative that it showed Pakistani fighter jets engaged in a military exercise in the Cholistan region.", "The fighter aircraft of Pakistan Air Force at midnight demonstrated tactical preparedness by releasing flares in Cholistan say the channels of military enthusiasts. pic.twitter.com/rUjgm7jqSw", "— Ibrahim Qazi (@miqazi) February 25, 2019", "This conclusively establishes that the video is NOT representative of the cross-border operation conducted by the IAF, since it was already on social media from 2017. The question then arises- how did this video end up being broadcast as footage of the operation, repeatedly and relentlessly by multiple media outlets?", "Alt News found that the video, used by multiple news organisations in the wake of the attack, was posted by a Pakistani Twitter user early morning at around 6 am on February 26, claiming that it showed Pakistan fighter aircraft ‘retaliating’ against the IAF.", "BREAKING: Pakistani JF17 immediate retaliate back to Indian Air Force volition at Line of Control.", "Pakistan Retaliate Karne Ka Soche Ga Nahi, Pakistan Retaliate Karega!! #PMIK pic.twitter.com/37OSr3e3a0", "— Arsalan Siddiqy (@ArsalanISF) February 26, 2019", "The video was also posted by a Pakistani journalist at 10:35 am on February 26, after which it was likely picked up by the Indian media, without due verification.", "Donate Now", "Arjun Sidharth is a writer with Alt News. He has previously worked in the television news industry, where he managed news bulletins and breaking news scenarios, apart from scripting numerous prime time television stories. He has also been actively involved with various freelance projects. Sidharth has studied economics, political science, international relations and journalism. He has a keen interest in books, movies, music, sports, politics, foreign policy, history and economics. His hobbies include reading, watching movies and indoor gaming.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "Amid the ongoing Israel-Palestine conflict, media outlet Times Now put out a report claiming that…", "A 45-second video clip is being shared widely on social media where a group of…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…"]