["The video, which is two minutes, 39 seconds long, was posted to Facebook here on April 14, 2019. It has been viewed around 60,000 times and shared more than 1,600 times since.", "It shows a woman wearing a white-and-blue sari being interviewed by a man with a microphone, surrounding by a jeering crowd. She can be heard saying in Bengali language:", "\"I will not tolerate any undue intervention from the central government. People in West Bengal will live their lives peacefully.\" West Bengal is a state in eastern India.", "Later in the video, the woman addresses a crowd of people, some of whom are wearing scarves and caps, which are symbols of Islam.", "She says to them: “I will give you everything. All the welfare projects will be diverted to you and only you.”", "Hundreds of thousands of Muslim Rohingya have fled Myanmar, according to the UN, and some now live in India. Here is an AFP report on Rohingya in India.", "Below is a screenshot of the misleading post:", "The post’s English-language caption reads: \"Must watch.... Trinamul leader KAKOLI GHOSH DASTIDAR supports ROHINGYA Muslims unabashedly. Police also openly supports her.", "\"Says, will not allow RAM naam, Hari naam to be chanted. Openly threatens Reporter calling for cancellation of his licence. Where is West Bengal heading to....Shame on us.\"", "\"Trinamul\" refers to the All India Trinamool Congress (TMC), the ruling party in the eastern Indian state of Bengal. Here is the party’s official Twitter page.", "Kakoli Ghosh Dastidar is a TMC member of parliament, this is her verified Twitter profile. As reported by NDTV here, she is running for reelection in West Bengal in polls to be held on May 19 – part of India’s six-week national election.", "And finally, “RAM naam, Hari naam” refers to the Hindu god Lord Rama.", "The same clip was also also posted to Facebook alongside similar claims here, here and here.", "However the video does not show a speech by Dastidar; it actually shows a street play staged more than a year ago by members of India’s ruling Bharatiya Janata Party (BJP).", "The woman in the video is actually Aditi Mukherjee, who describes herself on her Facebook profile here as the secretary of “Mohila Morcha”, the women’s wing of the BJP in West Bengal.", "Mukherjee shared a full three minute, 26 second version of the video on Facebook here without a caption on April 24, 2018.", "The exact same video was also published on Facebook here by another user called Sanghamitra Chaudhuri, who describes herself on her profile as the State Vice-President of the BJP women’s wing in West Bengal.", "The post, dated March 23, 2018, is embedded below. Its caption reads, in part: “Street play ‘Infiltration’ enacted at Red Road today. Organised by Bharatiya Janata Mahila and Yuva Morcha. With Locket Chatterjee. Aditi Mukherjee...”", "The caption also contains several other names, many of whom are also affiliated with the BJP, according to their Facebook pages.", "For example, part of the caption says: “Video Courtesy: Abhijit Paul”. On his Facebook page here, Paul says he is a BJP official.", "And in a second video published alongside the footage of the play by Chaudhuri, the man holding the microphone introduces himself as Jayanta Roy and says the group is standing at a refugee camp in Baruipur, a city in West Bengal.", "Roy shared Chaudhuri’s post here on his Facebook page on March 24, 2018, with a comment that says, in English: “Jayonto the play was good congrats”.", "The image below contains three rows, comparing various close-up pictures of:", "1. The woman in the video in the misleading Facebook post\n\t2. Aditi Mukherjee, the BJP activist\n\t3. Kakoli Ghosh Dastidar, the TMC politician", "The photos of Mukherjee and Dastidar have been taken from publicly shared images on their Facebook and Twitter pages. Here is Dastidar’s Facebook page.", "Examining the pictures closely shows that woman 1 and 2 are the same person, while woman 3 has a different face shape:", "The play was mentioned by Indian newspaper The Tribune in this report dated May 7, 2018. The section in question says:", "“The BJP has alleged that one of its workers, Aditi Mukherjee, is being harassed by the police for playing Mamata Banerjee in a street play on the Rohingya issue.", "“The actress says she was asked by the CID to appear at the state police headquarters at Bhawani Bhawan. 'The Chief Minister likes to lambast the Central Government for destroying democracy. But look at the state of democracy in her own state,' remarked BJP’s Shamik Bhattacharya.”", "The play was also mentioned in this diary column published May 12, 2018, in another Indian newspaper, the Sunday Guardian.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]