["Honoree Carol Burnett accepts her award onstage at \"The Paley Honors: A Special Tribute to Television's Comedy Legends\" at the Beverly Wilshire Hotel, Thursday, Nov. 21, 2019, in Beverly Hills, Calif. (AP)", "A viral story prematurely declared actress Carol Burnett dead and falsely described her as a supporter of President Donald Trump.", "Oh, it misspelled her name in the headline, too.", "\"Carol Burnette dead at 89 — a huge Trump supporter lost,\" said a headline on AJUAnews.com.", "A small box in the corner of the image says it is satire, but it’s possible to miss that small warning when scrolling on Facebook.", "AJUAnews is a hoax news site that has a track record of republishing false, satirical stories without their original context. It also tries to redirect readers to links for anti-virus software.", "The Facebook post was flagged as part of the company’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The article appears to have been copied from another website with a similar satire label, Conservative Tears, which is part of Christopher Blair’s network of satirical sites.", "There are several cues that the story is false. One sign is the misspelled surname. The story also says she was born in 1934 and was 89 in December, which is mathematically impossible.", "We found no evidence that Burnett was a \"huge Trump supporter.\"", "Burnett told Larry King in February 2016 that she doesn’t endorse candidates. When he asked her, \"if I say ‘Donald Trump’ do you comment?\" she laughed in response and said \"that’s my comment.\"", "She told Conan O’Brien in 2018 that political comedy wasn’t her thing.", "\"It never occurred to me to be political, I really wasn’t thinking about it — it just wasn’t my bag,\" she said, speaking about the Carol Burnett show.", "So what is Burnett actually up to? USA Today interviewed her in late December and reported that she will appear in the reboot of \"Mad About You\"  and has an upcoming Netflix film, \"Sorta Like a Rock Star.\"", "A story said that Carol Burnett is dead and was a Trump supporter, but we found no evidence to back up either statement. Burnett lives. We rate this story Pants on Fire.", "AJUA News, Carol Burnette Dead at 89 – A Huge Trump Supporter Lost, Dec. 18, 2019", "Conservative Tears, Carol Burnette Dead at 89 – A Huge Trump Supporter Lost, Dec. 14, 2019", "Snopes, No, Comedian Carol Burnett is Not Dead, Dec. 16, 2019", "USA Today, Carol Burnett on 'Mad About You' return, Dec. 28, 2019", "Larry King, Interview with Carol Burnett, Feb. 8, 2016", "TBS, Carol Burnett: Political Comedy Wasn’t My Bag - CONAN on TBS, May 22, 2018", "PolitiFact, Fake news site republishes hoax story about Ocasio-Cortez, Omar and Medicare, Jan. 2, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]