["A Feb. 21 Facebook post uses disturbing images from the fictional horror movie trailer “Thanksgiving” to promote baseless QAnon conspiracy theories about a “deep state” responsible for sex trafficking and cannibalism.", "“The choice to know will be yours, the truth is out there. WWG1WGA,” it reads.", "The vague warning and QAnon-related acronym are accompanied by three images that appear to show naked human bodies served like turkeys on a dinner table. Two of the images show children tied to chairs at the table.", "These images are shocking, but they are not evidence of satanism and illegal activity, as the post implies. These images come from the set of a 2007 film trailer.", "One Facebook user connected the dots between the images and \"Thanksgiving,\" but more expressed disgust and support for the conspiracy theory in the comments.", "More:Fact check: Viral image claiming to be a blue Philippine owl is doctored", "The Facebook user that posted the image has shared many QAnon-related posts over the last week. He did not respond to USA TODAY's request for comment.", "“WWG1WGA” is a QAnon conspiracy theory acronym for the phrase “Where We Go One We Go All.”", "QAnon is a baseless, far-right conspiracy theory that promotes the existence of a “deep state” of liberal leaders that run the U.S. government, media and economy. Followers believe now-former President Donald Trump is a savior, uniquely able to defeat a reigning “cabal” of satanic pedophiles.", "In the first half of 2020, membership in QAnon social media groups increased from about 155,000 to more than a million members.", "Fact check:Image claiming to show 2016 Ted Cruz tweet on climate change and Texas is fabricated", "The images comes from “Thanksgiving,” a trailer for a fake Thanksgiving-themed horror movie that was shown within the 2007 action-horror-thriller film “Grindhouse.”", "“Quentin Tarantino and Robert Rodriguez's homage to exploitation double features in the '60s and '70s with two back-to-back cult films that include previews of coming attractions between them,” IMDB describes \"Grindhouse.\"", "“Thanksgiving” was one of the previews created and shown between those segments. It was never made into a real movie.", "The piece was directed by horror director Eli Roth, who is famous for his work in \"Cabin Fever,\" \"Inglourious Basterds\" and \"Hostel.\"", "Roth and Tarantino are famous for creating films with unique extreme violence, vulgarity and dark humor.", "A behind-the-scenes video of the trailer's filming is available on YouTube. The grotesque images from the post are from the “Thanksgiving” set and visible on the fan site The Quentin Tarantino Archives.", "Fact check:No indication Tom Brady will accept — or snub — White House visit", "USA TODAY attempted to contact Roth through his entertainment company Crypt TV but did not receive a response.", "We rate posts that tie grotesque images of naked human bodies staged as food on a dinner table with the QAnon slogan \"WWG1WGA\" as FALSE, based on our research. The images come from the set of 2007 horror film trailer \"Thanksgiving\" and are not evidence of the baseless conspiracy theory.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook."]