["It's no secret that conservative talk show host Sean Hannity has issues with the Obama administration's direction on national defense.", "On the eve of a global summit in New York, Hannity questioned the wisdom of the Obama administration's commitment to reducing the nation's nuclear arsenal.", "\"Here is the situation,\" Hannity said during a Fox News interview with Sen. John McCain on Sept. 22. \"We've got (Iranian president Mahmoud) Ahmadinejad, just on the heels of coming to New York, again denying that the Holocaust took place. Our own National Security Agency says that their nuclear ambitions are advancing, and at the same time we see what happens — we are slashing our own nuclear arsenal.\"", "We decided to look into Hannity's statement, if only to put it into proper context.", "First off, during a speech on Sept. 18, Ahmadinejad did again question whether the Holocaust was a \"real event,\" and said that the Jewish state of Israel was created out of \"a lie and mythical claim.\" And intelligence reports do, in fact, suggest that while Iran does not yet have nuclear weapons, and claims not to be pursuing them, it has made progress in its ability to enrich uranium and might only be a few years away from developing nuclear weapon capabilities.", "As for the United States slashing its nuclear arsenal, that's also true.", "In fact, it's been true for a couple decades, ever since the Cold War ended. Under treaty agreements that started under President Ronald Reagan, and due to retirement of old weapons, the United States and Russia have been steadily cutting the number of nuclear weapons that are ready to be used either from bombers, submarines or ground-based missile silos.", "The current treaty that covers the counting and verification of nuclear weapon reductions is called START (Strategic Arms Reduction Treaty), and it expires in December. It has resulted in the reduction of some 80 percent of all strategic nuclear weapons.", "President Barack Obama has said that his goal is to reduce nuclear weaponry in the United States and Russia even further.", "During the presidential campaign, Obama promised \"deep, verifiable reductions in all U.S. and Russian nuclear weapons — whether deployed or nondeployed, whether strategic or nonstrategic — and to work with other nuclear powers to reduce global stockpiles dramatically by the end of an Obama presidency.\"", "In his defining speech on nuclear weapons as president, Obama in April spoke to an audience in Prague about his long-term vision for a world free of nuclear weapons.", "\"So today, I state clearly and with conviction America's commitment to seek the peace and security of a world without nuclear weapons,\" Obama said. \"I'm not naive. This goal will not be reached quickly — perhaps not in my lifetime. It will take patience and persistence. But now we, too, must ignore the voices who tell us that the world cannot change. We have to insist, 'Yes, we can.'\n\n\nIn July, Obama met with Russian President Dmitry Medvedev in London to set up the framework for a new START treaty. And both sides have committed to seeking a new agreement by the end of the year to make further reductions in their nuclear arsenals. Currently, the U.S. and Russian arsenals comprise about 95 percent of all the nuclear weapons that are known to exist in the world.", "But neither side is talking about eliminating its nuclear arsenal any time soon. The number of weapons possessed by both sides is, and would remain under any new treaty, enormous relative to the number of weapons possessed by other countries.", "So Hannity is clearly right that the United States is reducing its nuclear arsenal. It was even one of Obama's\n\ncampaign promises\n\n. But the statement implies that this is a change in strategy under Obama. In fact, it is a continuing policy that began under President Reagan (a Hannity favorite). And while Obama may talk of a nuclear free world, it's in long-range terms. So we find Hannity's claim Mostly True.", "Obama Campaign Web site,\n\n\"Confronting 21st Century Threats\"", "Natural Resources Defense Council,\n\nGlobal nuclear stockpiles, 1945-2006", "Time,\n\nObama's Speech in Prague, April 5, 2009", "Time,\n\n\"Reducing Nuclear Weapons: How Much Is Possible?\"\n\nby Eben Harrell, April 9, 2009", "Council on Foreign Relations,\n\nTask Force Report, U.S. Nuclear Weapons Policy\n\n, April 1009", "New York Times,\n\nOp-Ed: A Better Missile Defense for a Safer Europe\n\n, by Robert M. Gates, Sept. 19, 2009", "White House Web site,\n\n\"Fact Sheet on U.S. Missile Defense Policy: A 'Phased, Adaptive Approach' for Missile Defense in Europe,\"\n\nSept. 17, 2009", "CQ Transcripts, Sean Hannity Interviews Sen. John McCain on Fox News, Sept. 22, 2009", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]