["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "There are few things worse than belittling military service, and an ad from the Democratic Congressional Campaign Committee accuses U.S. Rep. Andy Barr of doing just that.", "The Republican is running for re-election in Kentucky’s 6th Congressional District against Marine veteran Amy McGrath.", "The DCCC launched the ad \"Doing Right\" on Oct. 8, and it accuses Barr of brushing off the significance of military service. The ad ran from Oct. 9 to Oct. 15.", "After criticizing Barr for allegedly giving tax breaks to corporations, the ad says Barr was \"even dismissing the importance of military service\" while onscreen text displays a quote from him that reads: \"We both served our country. I’ve served in a position where ideas matter.\"", "So did Barr actually dismiss military service when compared with serving in political office? Not exactly.", "The DCCC’s ad cites an article from the Louisville Courier Journal, which references an interview Barr gave to the New York Times.", "At one point, Barr seems to compare his political experience in government with McGrath’s military service.", "The DCCC ad ends his quote with Barr saying that he’s \"served in a position where ideas matter.\"", "But, it isn’t the complete quote: \"We both served our country. I’ve served in a position where ideas matter. My opponent has served her country in the military, where execution matters.\"", "The ad stops short of finishing Barr’s quote and makes it look like he said something more damning – that political office experience is more important than serving in the military.", "Barr didn’t say that, but he did compare the two.", "The Barr campaign says that the charge is a lie and pointed to his work on behalf of veterans.", "\"A member of Congress serves his / her constituents,\" spokeswoman Jodi Whitaker said. \"They get people their Social Security checks, Medicare payments, veteran benefits.\"", "A DCCC ad says Barr is belittling military service while emphasizing the role of holding political office.", "Barr did compare military service with being a politician. But the ad doesn’t present the full quote, making what Barr said appear to be much worse than it was.", "We rate it Mostly False.", "DCCC ad, Oct. 8, 2018", "Louisville Courier Journal, \"Andy Barr compares politics to veteran's career: 'We both served,\" Aug. 16, 2018", "New York Times, \"In Kentucky House Race, a Battle of Ideology vs. Résumé,\" Aug. 16, 2018", "Email interview, Jodi Whitaker, spokesperson for Andy Barr, Oct. 22-23, 2018", "Email interview, Jacob Peters, spokesperson for the Democratic Congressional Campaign Committee, Oct. 23, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]