["About this rating", "Will Smith and Jada Pinkett Smith reportedly donated $150,000 to the 2015 \"Million Man March.\"", "Will Smith and Jada Pinkett Smith did not give $150,000 to Minister Louis Farrakhan to \"further his goal of murdering white people.\"", "On 9 September 2015, Minister Louis Farrakhan announced on Facebook that actor Will Smith and his wife Jada Pinkett Smith had donated $150,000 to help cover the cost of the \"Justice or Else! Million Man March\" event planned for 10 October 2015:", "While neither Will Smith nor Jada Pinkett Smith commented on the announcement, their donation was seemingly confirmed on Twitter by Brother Jesse, a journalist and Million Man March supporter:", "Shortly after news of the reported donation broke, several conservative media outlets picked up on the story and asserted that Will Smith had donated to a \"black Muslim\" who planned to \"kill all whites.\" Many of these stories were posted along with a photograph of Will Smith in a kaffiyeh:", "Reports have begun to surface that Smith and his wife, Jada Pinkett-Smith, have given a huge sum of money to Louis Farrakhan, the leader of the radical group “Nation of Islam.” Nation of Islam also has ties to the Black Panthers, a black power movement that borders on being terrorist organization.", "That should be interesting to explain on their tax returns.", "Farrakhan is proudly stating that Smith gave $150,000 to his “Justice ... or Else!” march. This march, which is theoretically supposed to honor the 20-year anniversary of Farrakhan's Million Man March, will take place on October 10 in Washington D.C.", "The reality is that this event will most likely be used to call for violence against the police and could well lead to rioting and more than a few arrests.", "The image of Will Smith in a kaffiyeh was not a genuine photograph of the actor. It was a piece of artwork created by Mohammad Kanoo:", "His series \"A Question of Identity\" (2012) presents a range of recognizable international public figures — political leaders and celebrities — dressed in the traditional kandoorah and ghutra for the men, and for the ladies in the abayya and hijab, once again using disjunction as a means of engaging viewers. Using Photoshop, Kanoo gives us an idea of what politicians such as Barack Obama, George Bush and Margaret Thatcher, and celebrities like George Clooney, Oprah Winfrey and Paris Hilton, would look like \"out of their comfort zone,\" that is, if they adopted an Arab sartorial identity.", "Will and Jada Pinkett Smith's reported donation would go towards sponsoring the \"Justice Or Else! Million Man March\" event, not to Louis Farrakhan personally. And while Minister Farrakhan is the leader of the Nation of Islam (and did once say that \"if the federal government will not intercede in our affairs, then we must rise up and kill those who kill us”), those are the views of an individual and not the official position of the organization.", "Farrakhan's controversial positions have inspired criticism of his involvement ever since the first \"Million Man March\" in 1995:", "March supporters point out that instead of the stereotypes, often perpetuated by the media, of criminals, druggies or dropouts, most African-American men are hardworking people with families and communities. And many are troubled themselves by the reality that some black men have not measured up to their responsibilities.", "\"I have taken the position that this march is directed first at the African-American community, and secondly at the nation at large,\" said Ron Walters, a professor at Howard University.", "But both the nation and the African-American community have reservations. Not with the message, but with the messenger: Farrakhan.", "The controversial head of the nation of Islam is, to many, a racist and separatist. A number of black churches, especially Baptists, have refused to endorse his march.", "\"If it had originated from our end, we would be there,\" said Levi Chaplin of Pleasant Lane Baptist Church. \"But we can't support somebody that talks against us in one breath, and in one breath hugs us. I mean, that's not right.\"", "Will Smith and Jada Pinkett Smith may have donated to an event sponsored by Farrakhan's organization, but the associated cause was supporting equal rights for the black community and not funding the murder of white people.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]