["On March 2, Twitter user @IndianInterest tweeted two satellite images with a claim that the building, reportedly bombed by the Indian Air Force in Balakot, was demolished. In a series of tweets, he refers to the source of the image along with the co-ordinates.", "Here are the 2 satellite images, old and new, side-by-side, for comparison.", "Left: Dated Google satellite image of building @ 34.433055, 73.324516", "Right: Today’s satellite image.", "The building’s pulverized. Roofing’s gone. Terrain is pock-marked with craters. #BalakotAirStrike pic.twitter.com/dNPsTdpChF", "— The Indian Interest (@IndianInterest) March 2, 2019", "According to the user, the image on the left was taken from Google Maps whereas the right one was taken from Zoom Earth. He suggested that the image on the left was before the air strike while the right was of the same building, which now stands ‘pulverized’ after the strike.", "Pic 2 from https://t.co/nnvbpxwVpj, dated today.", "The building’s destroyed, reconstruction efforts visible.", "— The Indian Interest (@IndianInterest) March 2, 2019", "The same images that were posted by Indianinterest were used in a broadcast by Zee News on March 3, 2019. “बड़ी खबर हम आपको दिखा रहे है जी हम आपको सॅटॅलाइट इमेजे देखा रहे है। बालाकोट स्ट्राइक की। यह जवाब है उन लोगो को जो सबूत मांगते है। (We bring you big news. Yes, we are showing you the satellite images of Balakot air strike. This is an answer to those who demand evidence -translated) “, said the Zee News anchor presenting the satellite images of the alleged bombsite in Jaba, Balakot. According to the broadcast, the image on the left where the building had an intact rooftop was taken on February 23, 2018, whereas the image of same building on the right in which the rooftop was demolished was of February 26, 2018. Throughout the broadcast, it was claimed that these were the satellite images of the site bombed which now stands demolished after the air strike carried out by the Indian Air Force.", "The satellite image broadcasted by Zee News as the most recent was taken from Zoom earth, which uses imagery by Bing Map. However, Zee News failed to check the FAQ section of Zoom Earth which states, “Only NASA images (where clouds are visible) are updated daily. Bing Maps images (where buildings are visible) are not updated daily and are several years old.”.", "From the FAQ, it is clear that the close-up images which showed buildings and structures that were initially used by @IndianInterest and later by Zee News are not appropriate for comparison, as these are images may be several years old.", "In the course of this article, we will explain how we were able to confirm that an older satellite image was indeed passed off as recent based on which it was claimed that the site was demolished after the air strike.", "Based on a lead given to Alt News by an individual named Vinay Kumar Kate, we found the satellite images viral on social media. We then placed the zoomed-out satellite images, which were shown in the Zee News broadcast in a side-by-side comparison below.", "In the collage above, the image on the left was taken from Google Maps whereas on the right one was taken from Zoom Earth. While the imagery on the right is dated April 25, 2018, the Zee News broadcast presented it as February 23, 2019. We were able to confirm this by the dated imagery available on Google Earth application.", "In order to figure out how old the images are, we juxtaposed pictures of buildings near the site that Zee News alleged as the bombsite to see the changes that the buildings have gone through over the years. The image shown below is the latest satellite image of the area around the site of interest and has been taken from Google Earth and is dated April 25, 2018.", "This is the Zoom Earth satellite image of the same site, which doesn’t have a specified date. Within the image, it is clearly stated, “No daily images available here”.", "In order to show that the Zoom Earth satellite image consists of old imagery, we will compare the building marked as ‘2’ in the above images, and show how it has changed over the years.", "Over the years, the rooftop of the highlighted building went through considerable amount of change. The first image, from the left, with a plain rooftop, is dated April 27, 2014. Moving on to the year 2016, we could see an imprinted Pakistani flag and text, “GHS-JABA”, on the rooftop. Similarly, the latest image available on April 25, 2018, also has the imprinted flag and text as it is. These three images have been juxtaposed and posted below for comparison.", "However, the image that Zee News broadcasted and claims to be taken after the recent air strike has a plain rooftop sans the imprinted flag and text. The fact that the image has a plain rooftop in the above satellite image from Zoom Earth, suggests that it belongs to a period (2013-2014) when the alleged site was under construction.", "Paul Neave, who created the Zoom Earth application, also put out a series of tweets where he reiterated that images available on the website are several years old.", "The second image is from https://t.co/N7X3j7NHVr (which I created) and it uses Bing Maps for high resolutions, not daily imagery. It states that in the screenshot “no daily images available here”", "— Paul Neave (@neave) March 6, 2019", "Members of International media organisations who reported from the ground also claimed that the site claimed by Zee News as the bombed site was in-fact not the bombed site. The location pointed out as JeM training camp in the broadcast is five kilometers away from the madrasa located on the hilltop of Jaba.", "Gerry Doyle, a journalist working with news agency Reuters, who also co-authored a story on the satellite images of the actual bombed site in Jaba, Balakot, in a tweet said, “the one on the right is not after the attack, I promise you. again, the total lack of tree cover is a giveaway.”", "the one on the right is not after the attack, I promise you. again, the total lack of tree cover is a giveaway. you can look at the high res image from march 4 here: https://t.co/KmXMuRILus", "— Gerry Doyle (@mgerrydoyle) March 6, 2019", "Alt News was able to find the satellite images provided in the Reuters story on Google Maps.", "We found that the site depicted as the bombed site in the Zee News broadcast is at least 5 kilometers away from the targeted site.", "On March 4, BJP MP Giriraj Singh tweeted a news clip from the Zee News broadcast saying, “यह तस्वीरें साफ-साफ बता रही है कि भारतीय वायुसेना ने पाकिस्तानी आतंकी ट्रेनिंग कैंप के परखच्चे उड़ा दिए। This pictures clearly show that the Indian Air Force had destroyed the Pakistani terrorist training camp (-translated)”.", "यह तस्वीरें साफ-साफ बता रही है कि भारतीय वायुसेना ने पाकिस्तानी आतंकी ट्रेनिंग कैंप के परखच्चे उड़ा दिए। pic.twitter.com/J1ax41fOIB", "— Shandilya Giriraj Singh (@girirajsinghbjp) March 4, 2019", "BJP Yuva Morcha National Vice President Santosh Ranjan Rai and Gaurav Pradhan, who has pushed out misinformation multiple times in the past, also made the identical claim.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "Amid the ongoing Israel-Palestine conflict, media outlet Times Now put out a report claiming that…", "A 45-second video clip is being shared widely on social media where a group of…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…"]