["About this rating", "Following the 2018 U.S. midterm elections, in which Democrats succeeded in taking back control of the U.S. House of Representatives, pro-Republican memesters tried to soften the blow by attempting to pass off the claim that “Every single one” of the candidates former President Barack Obama had campaigned for lost their races:", "While differing definitions of the term “campaigned for” could change this analysis somewhat, no reasonable definition of “campaigned for” would make the claim that “every single person Barack Obama campaigned for lost\" accurate.", "The strictest definition of \"campaigned for\" would mean Obama's appearing in person with the candidate in question at one or more campaign events. Under this definition, the former president campaigned for numerous candidates who won their races. On 22 October 2018, for example, Barack Obama appeared at a Las Vegas campaign rally with Jacky Rosen, who would go on to flip a Senate seat in Nevada from red to blue by beating incumbent Republican Dean Heller:", "And he’s here: @RosenforNevada just introduced @BarackObama, who told the crowd to “sit down because I’ve got a lot to say.” Someone shouted “we miss you!”\n“I miss you too,” he said. pic.twitter.com/2HUY3L5cVq", "— Ramona Giwargis (@RamonaGiwargis) October 22, 2018", "As another example, on 5 November 2018 Barack Obama made a campaign appearance on behalf of Virginia Senate candidate Tim Kaine, who won his bid for reelection, and Virginia House candidate Jennifer Wexton, who also won her race and flipped Virginia’s 10th district from red to blue:", "Former Pres. Barack Obama arrived at Virginia campaign office with doughnuts for campaign staff.", "\"Either this crowd likes you or they like doughnuts,\" Tim Kaine says. https://t.co/rOTlw3XZzt pic.twitter.com/EXiHJV3XYV", "— ABC News (@ABC) November 6, 2018", "Gubernatorial races were a different story. Most notably, Obama campaigned in Georgia for Stacey Abrams, who has likely been defeated by Brian Kemp, and he campaigned for Florida's Andrew Gillum, who lost to Ron DeSantis.", "A broader definition of \"campaigned for\" would include candidates who received an endorsement from the former president. Barack Obama issued two waves of endorsements, first in August 2018 and then in October 2018. In total, Barack Obama offered 342 endorsements for the 2018 midterm elections, with many of these endorsements resulting in substantive victories for Democrats.", "As an example, we will analyze the outcome of the endorsements Obama made for Congress. For the U.S. Senate, Obama endorsed five candidates: Kyrsten Sinema in Arizona, Senator Bill Nelson in Florida, Senator Tina Smith in Minnesota, Jacky Rosen in Nevada, and Senator Tammy Baldwin in Wisconsin. Smith, Rosen, and Baldwin each won their respective races.", "For the U.S. House of Representatives, Obama endorsed 69 candidates, including 20 of the 28 candidates responsible for snatching up GOP-held seats and securing Democratic control of the House: Jennifer Wexton (VA-10), Mary Scanlon (PA-05), Susan Wild (PA-07), Jason Crow (CO-06), Debbie Mucarsel-Powell (FL-26), Sharice Davids (KS-03), Dean Phillips (MN-03), Max Rose (NY-11), Chrissy Houlahan (PA-06), Colin Allred (TX-32), Sean Casten (IL-06), Haley Stevens (MI-11), Antonio Delgado (NY-19), Lizzie Pannill Fletcher (TX-07), Cindy Axne (IA-03), Abby Finkenauer (IA-01), Lauren Underwood (IL-14), Tom Malinowski (NJ-07), Angie Craig (MN-02), and Abigail Spanberger (VA-07).", "In terms of endorsements, an analysis by the Brookings Institute found that President Donald Trump’s Congressional picks underperformed relative to those of Barack Obama:", "As we can see from the bar graph below, Trump endorsed 75 House and Senate candidates, of whom 42 or 55 percent won. With this rate, Trump performed better than Vice President Mike Pence, for whom nearly 50 percent won, but fell behind Obama’s and Biden’s endorsees.", "Because multiple individuals with whom Barack Obama appeared with at campaign events did win their races, the claim that \"everyone\" Obama campaigned for lost their races is self-evidently false.", "Parks, Miles.   \"Obama Endorses More Democratic Midterm Candidates — From Congress to State Houses.\"\r\n    NPR.   1 October 2018.", "Ballotopedia.   \"Endorsements by Barack Obama.\"\r\n    Accessed 8 November 2018.", "The New York Times.   \"Senate Election Results: Republicans Keep Majority.\"\r\n    8 November 2018.", "Scott, Dylan et al.   \"Here Are the House Seats Democrats Have Flipped So Far in the 2018 Elections.\"\r\n    Vox.   7 November 2018.", "Kamarck, Elaine.   \"Trump Endorsed 75 Candidates in the Midterms. How Did They Fare on Election Day?\"\r\n    Brookings Institute.   7 November 2018.", "Update [13 November 2018]: This post originally incorporated analysis from the Brookings Institute that was later corrected. This update includes the corrected numbers provided in an update by Brookings.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]