["About this rating", "In the early days following the Nov. 3, 2020, general election, U.S. President Donald Trump and his surrogates undertook an effort to spread disinformation that undermined voter confidence in the democratic process as it became clear that Trump's political rival Joe Biden would become the president-elect.", "When television networks announced that Biden was the projected winner of the presidential race, having amassed the majority of electoral college and popular votes, Trump's personal attorney, Rudy Giuliani, stood at a podium to hold a news conference in a strip mall parking lot outside Four Seasons Total Landscaping in Philadelphia.", "Giuliani was flanked by a man claiming to be a Philadelphia resident and GOP poll watcher in Pennsylvania who wasn't allowed to observe ballots being counted — but it turned out that man was Daryl Brooks, who has frequently run unsuccessfully for political office in New Jersey.", "The news conference followed a tweet from Trump that appeared to suggest a ritzier, well-known downtown location — namely the luxury Four Seasons Hotel and Resorts.", "But that was not to be the case. Although some believed that Giuliani held the news conference in the wrong location, The New York Times chalked it up to a miscommunication.", "The event was always supposed to be held in the landscaping business parking lot, about 10 miles from the Four Seasons hotel, because the area is in a politically \"friendlier\" part of the city, according to the Trump campaign. But the wrong information made its way to Trump, resulting in the tweet above. As The New York Times reported, \"Mr. Giuliani and the Trump campaign adviser Corey Lewandowski told the president on Saturday morning their intended location for the news conference and he misunderstood, assuming it was an upscale hotel, according to multiple people familiar with the matter.\"", "Trump later reposted the message with the correct location and time information.", "The mix-up resulted in a day of memes on social media, both because of the vast difference between the luxury hotel and the landscaping business parking lot, and because of what other businesses were situated nearby.", "The chain of events, which many found comical, prompted readers to ask us about it, with many simply wondering if it's true at all that the news conference was held in a parking lot instead of a fancy name-brand hotel. It is true.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]