["Who sends a dog to do their bidding? A cute, ribbon-in-its-hair Yorkie named Spike, at that?", "Mitt Romney.", "Yes, in his latest round of yapping with rival Mike Huckabee, Romney sent Iowa voters a mailer that assails Huckabee's tax record and, more notably, features many adorable pictures of Spike:", "\"Dear Iowa Republican ... \" it begins, \"At the risk of making Chuck Norris angry, I must disagree with his endorsement of Mike Huckabee for President. (Please stick with me here. If putting Chuck Norris in a television ad makes sense, a dog responding in a mailing makes just as much sense.)\"", "It's signed: \"Bow wow, Spike\" with a paw print.", "Now we know Iowa is passe, but given New Hampshire's antitax climate, we wouldn't be surprised to see this attack ad in a few Nashua mailboxes. And we can't help but give Romney points for humor. This is the joke attack ad style the Hillary Clinton campaign missed out on when it dug up quotes from Sen. Barack Obama's kindergarten teacher to prove he's been aiming for the White House longer than he admits.\n\n(True!)", "But, back to Spike. He attacks Huckabee for \"all the different taxes\" he raised as governor of Arkansas, including the one that really gets him: the tax on dog groomers. (We checked Huckabee's record on the other tax increases\n\nhere.\n\n)", "\"Sales tax. Gas tax. Groceries tax. Even the tax on nursing home beds. Fine,\" Spike writes. \"But he went too far when he taxed the people who make me beautiful!\"", "Would you believe Spike is barking up the right tree?", "A number of services were made subject to the Arkansas state sales tax with Act 107 of the 2003 legislative session. Wrecker and towing services. Body piercing, tattooing and electrolysis services. Locksmith services. And, pet grooming and kennel services.", "As of July 1, 2004, charges for those services and nine others named in the legislation are subject to a 6 percent state sales tax, all part of an effort to generate revenue to balance the budget in the face of a dramatic projected budget shortfall.", "\"Like most states at that time, revenues were dropping, so they levied (additional taxes),\" said Tom Atchley, excise tax administrator for the Arkansas Department of Finance and Administration.", "Act 107 became law on Feb. 12, 2004, without a signature from then-Gov. Huckabee, who has said he had little choice but to accept the tax increases because Arkansas state law requires a balanced budget.", "Still, no bones about it, Spike makes a solid case. And Romney scores a funny jab. If you'd like to see the mailer, which is worth a peek, it's posted at the\n\nWashington Post\n\nblog \"The Trail\"\n\nhere.", "But because Huckabee didn't sign the law, we can't say Huckabee himself put a tax on dog groomers. But he didn't stop it either, so we rule Spike's statement Mostly True.", "New York Times,\n\nHuckabee's Stature Rises, Mobilizing Tax Critics\n\nby Leslie Wayne, Dec. 2, 2007", "Bureau of Legislative Research,\n\nSummary of General Legislation,\n\n84th General Assembly of the State of Arkansas, Second Extraordinary Session 2003", "Arkansas State Revenue Tax Quarterly,\n\nVolume X, No. 4,\n\nOctober, November and December 2004", "State of Arkansas,\n\nAct 107 of the 2nd Extraordinary Session,\n\n2003", "Interview with Tom Atchley, excise tax administrator for the Arkansas Department of Finance and Administration, Jan. 4, 2008", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]