["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A TV ad running in eight states blames President Barack Obama for sending stimulus money overseas while Americans are out of work.\n\n\"Tell President Obama, American tax dollars should help American taxpayers,\" the narrator says. Instead, $2.3 billion in tax credits funded jobs in Mexico, Finland and China, the ad claims.\n\nWe checked all three examples — and found the ad incorrectly describes them all. \n\n(We've also checked many other exaggerations about the stimulus.)\n\nAmericans for Prosperity, a group dedicated to \"educating citizens about economic policy\" that works closely with tea party activists and has been funded by the conservative Koch family, released the ad April 26, 2012.\n\nHere’s the string of claims, starting with an image of the president signing a bill:", "Washington promised to create American jobs. We passed their stimulus. But that's not what happened. Fact: Billions of taxpayer dollars spent on green energy went to jobs in foreign countries. The Obama administration admitted the truth, that $2.3 billion of tax credits went overseas, while millions of Americans can't find a job. $1.2 billion to a solar company that's building a plant in Mexico. Half a billion to an electric car company that created hundreds of jobs in Finland. And tens of millions of dollars to build traffic lights in China.", "Sounds like a scandal and an outrage. Is that what happened?", "For this fact-check, we’re focusing on whether \"tax credits\" that \"went overseas\" included \"$1.2 billion to a solar company that's building a plant in Mexico.\" (In other fact-checks, we found the Finland claim False, and the China claim Mostly False.)\n\nThe ad listed two sources for its Mexico claim, the Energy Department and PV Magazine. We tracked those down, then chatted with the companies involved.\n\nTwo programs, two projects\n\nWe’ll start with what’s true: An American solar company, SunPower, was approved for federal stimulus money. It also opened a solar panel plant in Mexico.\n\n(Or, rather, it moved its Mexican manufacturing from Chihuahua to a building it’s leasing in Mexicali, said company spokeswoman Natalie Wymer.)\n\nThat’s where the claim’s relationship to the truth ends.\n\n• The company didn’t get tax credits, but a $1.2 billion loan guarantee. What’s the difference? The Energy Department expects the loan to be paid back — with interest.\n\n• That loan guarantee wasn’t for the Mexico plant — a separate project with its own funding — but to build the California Valley Solar Ranch in San Luis Obispo, Calif. Construction on the California project has already started, with the Energy Department projecting 350 construction jobs and 15 permanent ones. Pacific Gas & Electric Co., the state’s largest utility, will ultimately buy the power.\n\n• Most of the solar panels for the California project will come from SunPower’s California manufacturing facility in Milpitas, though given the size of the project, they’ll also come from the company’s plants in Mexico and Asia, Wymer said.\n\n• SunPower no longer owns the California Valley Solar Ranch project. The solar project — and the loan guarantee — belong to New Jersey company NRG Energy. That’s the company that will get the federal loan money, and be responsible for repaying taxpayers.\n\nOur ruling\n\nA TV ad from Americans for Prosperity says billions of tax dollars spent on green energy went to jobs in foreign countries. It claims that stimulus bill tax credits went overseas, such as \"$1.2 billion to a solar company that's building a plant in Mexico.\" The ad even cites sources for its claim.\n\nBut those same sources, plus a few phone calls, quickly bring down the ad’s house of cards. Sure, taxpayer money was originally approved for a California solar company that also happened to open a plant in Mexico. But that loan — not tax credits, as the ad claims — will go to a New Jersey company for a solar project in California, employing construction workers in the state, using mostly California-built solar panels, to create solar power that’ll be purchased by a California utility.\n\nThat’s a completely different story. The ad strings together alarming-sounding tidbits about actual stimulus projects to create the impression of something else entirely — in a way that’s ultimately ridiculous. And that earns our lowest rating, Pants on Fire.", "Americans for Prosperity, \"AFP Wasteful Spending Ad,\" April 26, 2012\n\nAmericans for Prosperity, \"AFP Ad Scrutinizes Wasteful Use of Taxpayer Dollars,\" April 26, 2012\n\nPolitiFact, \"Ad says stimulus tax credits funded jobs in Finland,\" May 3, 2012\n\nPolitiFact, \"Ad says stimulus tax credits funded traffic lights in China,\" May 3, 2012\n\nNew Yorker, \"Covert operations: The billionaire brothers who are waging war against Obama,\" Aug. 30. 2010\n\nNPR, \"Who's raising money for tea party movement?\" Feb. 19, 2010\n\nLos Angeles Times, \"Koch brothers now at heart of GOP power,\" Feb. 6, 2011\n\nAmericans for Prosperity, \"About Americans for Prosperity,\" accessed Nov. 11, 2011\n\nWashington Times, \"'Green' jobs no longer golden in stimulus,\" Sept. 9, 2010\n\nPV Magazine, \"SunPower to open Mexican plant,\" Aug. 8, 2011\n\nEnergy Department Loan Programs Office, \"DOE Offers Conditional Commitment for $1.187 Billion Loan Guarantee, Support California Solar Generation,\" April 12, 2011\n\nEnergy Department Loan Programs Office, \"DOE Finalizes $1.2 Billion Loan Guarantee to Support California Solar Generation Project,\" Sept. 30, 2011\n\nEnergy Department Loan Programs Office, \"NRG Solar (California Valley Solar Ranch),\" accessed May 1, 2012\n\nCalifornia Valley Solar Ranch, accessed April 30, 2012\n\nSunPower, \"SunPower Announces New Solar Panel Manufacturing Facility,\" Aug. 5, 2011\n\nInterview with Natalie Wymer, senior director, SunPower corporate communications, May 1, 2012\n\nSunPower, \"SunPower's and Flextronics' New Solar Manufacturing Plant Creates Jobs, Economic Benefits and Clean Affordable Energy,\" April 12, 2011\n\nSunPower, \"SunPower and Total Partner to Create a New Global Leader in the Solar Industry,\" April 28, 2011\n\nSunPower, \"NRG Energy, SunPower Invite Community Leaders to Ceremonial Groundbreaking for 250-Megawatt California Valley Solar Ranch,\" Nov. 10, 2011\n\nSunPower, \"SunPower Announces Agreement to Acquire Tenesol SA,\" Dec 23, 2011\n\nNRG Energy, 10-K filing, Feb. 28, 2012", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]