["The photos have been circulating on Facebook and Twitter in various countries, including Australia, Pakistan and South Africa.", "“Still think corona is a joke????” reads the caption on one Facebook post, shared more than 190 times since it was published on March 23.", "The accompanying photos show rows of coffins lined up in a warehouse-style building, as bystanders look on.", "The photographs have been widely shared alongside pleas to “protect your families” or “stay home” to curb the virus, which has killed more than 20,000 people and forced one third of the world’s population into lockdown.", "AFP ran a reverse image search and traced the three photographs circulating on social media to news reports from October 2013, when more than 360 people died after their boat capsized near the Italian island of Lampedusa.", "The mostly Eritrean victims were among approximately 500 African migrants travelling on a boat heading for the shores of Europe.", "Since 2014, more than 20,000 people have died while making the perilous Mediterranean crossing, according to the UN’s International Organization for Migration.", "The first of the three photographs in the montage was taken by Italian photographer Roberto Salomone on October 9, 2013. According to AFP archives, the picture shows Italy’s then-prime minister Enrico Letta and Lampedusa’s mayor Giusy Nicolini standing by coffins of victims of the disaster.", "The second image was captured by AFP photographer Alberto Pizzoli. He said he was shocked to learn his picture was being shared in a “fake” context.", "“This image was taken in Lampedusa on October 5, 2013. I was there and I remember that place, which is an airport hangar,” he told AFP Fact Check.", "AFP traced the third photo to the archives of news agency Reuters. It was taken by photographer Antonio Parrinello on October 5, 2013, also in a hangar of Lampedusa airport.", "Some of the misleading posts also include captions claiming that Italy is “running out of coffins” and struggling to cope with demand for cremations.", "“Cremation takes about an hour meaning only 24 bodies a day not, just a drop in the ocean (sic),” the caption reads.", "More than 8,100 people have died from COVID-19 in Italy, making it the country with the most reported deaths from the disease.", "A journalist from AFP’s Rome bureau said claims that Italy could only cremate 24 bodies per day were “fanciful”, as the country has a large number of cremation facilities.", "The Altair Spa group, which runs 17 cremation facilities in north-central Italy, covering the worst-hit areas, said on Facebook on March 24 that the situation was “difficult” but “still manageable with professionalism and seriousness”.", "AFP reported that the flood of victims has forced the city of Bergamo in Italy’s northern epicentre of the pandemic to send bodies to less burdened crematoriums in neighbouring towns.", "Italian newspaper La Reppublica published a photograph of army trucks transporting coffins out of Bergamo’s cemetery last week.", "Bergamo, non c'è più posto: 70 mezzi militari portano le salme fuori dalla regione [aggiornamento delle 00:20] https://t.co/Fz5gaBxee0", "\"The large number of victims has meant that Bergamo’s crematorium could not cope on its own,\" mayor Giorgio Gori said in a statement.", "AFP has previously debunked social media posts purporting to show the coffins of novel coronavirus victims.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]