["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "At the Conservative Political Action Conference, an annual pep rally for the political right, former Massachusetts Gov. Mitt Romney complained that the economy had not recovered under President Barack Obama. He said, \"Today there are more men and women out of work in America than there are people working in Canada. And in the month of January, Canada created more new jobs than we did.\"", "We’ll look separately at these two claims, which came from his CPAC speech on Feb. 11, 2011. In this item, we’ll analyze the claim that \"in the month of January, Canada created more new jobs than we did.\"", "We found the relevant data for Canada at the website of Statistics Canada. For the month concluding in January 2011, Canada created a net 69,200 jobs.\n\nFor the U.S. numbers, we turned to the Bureau of Labor Statistics and found Romney is correct. Over the same period, the U.S. created a net 36,000 jobs. So the U.S. created about half as many jobs even though it is nine times larger than Canada.\n\nIt's worth noting that U.S. job growth was substantially stronger than Canadian job growth in each of the previous three months. In October, the U.S. economy created 171,000 jobs, compared to just 3,000 for Canada. In November 2010, the U.S. economy created 93,000 jobs, compared to 15,200 for Canada. And in December 2010, the U.S. created 121,000 jobs, compared to 22,000 for Canada. But on a per capita basis, in recent months U.S. job creation exceeded Canada's only in October.", "January happened to be a month when U.S. job creation was especially low and Canadian job creation was especially high, but it is the most recent month and it reflects the general pattern when you account for population. We find the claim True.", "Mitt Romney, speech to the Conservative Political Action Conference, Feb. 11, 2011\n   \nBureau of Labor Statistics, \"Labor Force Statistics from the Current Population Survey\" (main search page), accessed Feb. 11, 2011\n\nStatistics Canada, \"Table 1: Labour force characteristics by age and sex,\" Feb. 4, 2011\n   \nStatistics Canada, Canadian population estimates, June 28, 2010\n   \nE-mail interview with Eric Fehrnstrom, spokesman for Mitt Romney, Feb. 11, 2011", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]