["Twitter user @pokershash posted an image of children holding the flags of India and Bangladesh. He shared the photographs with the message, “Rampurhat Girls’ High School in West Bengal celebrated Independence Day with a Bangladeshi flag”. He also claimed that TMC MLA Asish Banerjee was present at the school function.", "Rampurhat Girls’ High School in West Bengal celebrated Independence Day with a Bangladeshi flag. TMC MLA Asish Banerjee(pic2) was also present at the function. 1st ads in Bangladesh then Bangladesh Actors in rally and now this, much love for core voters of didi @mamataofficial pic.twitter.com/MnamCB2MTX", "— Shash (@pokershash) August 16, 2019", "Another user Sourish Mukherjee tweeted a 44-second video clip of the said event and suggested that the national anthem of Bangladesh was sung during Independence Day celebrations at the school in West Bengal.", "Did you know?", "The National Anthem of Bangladesh was sung at Rampurhat Girls’ School in Birbhum during #IndependenceDay celebrations..", "Step by step, the State of West Bengal is heading towards West Bangladesh…", "Wake up Hindus, if you don’t act now…Who will?? @tathagata2 pic.twitter.com/LxEA8wKwXQ", "— Sourish Mukherjee (@me_sourish_) August 16, 2019", "Journalist Abhijit Majumder quote-tweeted the video saying, “It would still have been fine to sing Tagore’s ‘Amar shonar Bangla’, but I see a Bangladesh flag there. Speechless :-)”.", "Alt News was able to access the 6-minute video of the school programme which includes the 44-second clip circulating on social media. In the complete footage, the Indian national anthem was played before the Bangladeshi national anthem. This has been clipped in the video shared online. At 0:32 minutes in the footage below, you can hear the Indian national anthem.", "Alt News spoke to several people at Rampurhat Girls’ High School who rubbished claims about promoting the national anthem and flag of Bangladesh during Independence Day celebrations.", "“It was a different program which started after the main Independence Day program. The total length of the group dance [skit] was 8 minutes. They have clipped the 44-second clip wherein the Bangladesh national flag is visible.”, said a staff member of the school, who was present at the event, on the condition of anonymity.", "In a conversation with Alt News, one of the teachers who had designed the theme of the skit explained, “It was a cultural program which took place after the Independence Day program and a speech by our Head Mistress [Chhaya Chatterjee]. As it was a unique day with Raksha Bandhan and Independence Day coinciding, We tried to produce a skit with elements incorporating both. One of the elements was how Bangladesh and Bengal used to be a single state and the partition had divided the people along religious lines. Since it was Raksha Bandhan, a day of brotherhood, we tried to show the lost brotherhood through songs of Rabindranath Tagore which are culturally important in both the countries. This included the national anthems [of India and Bangladesh] written by Tagore.”", "The teacher also told us about one of Tagore’s songs the students danced to – ‘Ek Sutre Badhiyachi Sohosroti Mon’, which translates to ‘Our hearts are tied to the same thread’. “The song was written after the British divided Bengal along religious lines. Through the song, Tagore encouraged Hindus in West Bengal to tie Rakhi to Muslims in East Bengal. It was a song that promoted unity.”", "Alt News further spoke to Chhaya Chatterjee, the Head Mistress of Rampurhat Girls’ High school, who also rubbished the claims circulating on social media. Chatterjee said, “The same skit has been performed at various levels. I don’t know why our school is being targeted”.", "In conclusion, the school girls performed a skit at a cultural program organised during Independence Day. Since Raksha Bandhan fell on the same day, the school administration incorporated both into the celebrations. After the main Independence Day program, the students danced to a song by Rabindranath Tagore which was written after the partition of Bengal and promoted brotherhood through the festival of Rakhi. The video of the program was clipped and presented on social media with a hate-filled narrative.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]