["About this rating", "If you browse Snopes.com, you'll likely come across the advice, \"If it seems too good to be true, it it probably is\" on pages about social media scams. While this platitude is certainly worth considering when browsing the internet, a few exceptions exist.", "The Germany-based search engine Ecosia claims to use its profits to plant trees around the world. Its home page even carries a tally of the number of trees that have reportedly been planted by Ecosia users:", "For many people, this business model may seem \"too good to be true\" and has led to some skepticism about the legitimacy of this company. A search on Google, for instance, results in several articles and blog posts questioning the legitimacy of the search engine and asking whether Ecosia is a scam.", "As far as we can tell, Ecosia is a legitimate search engine that truly uses a portion of its profits to help plant trees around the world.", "Ecosia was launched in 2009 by Christian Kroll. At the time, the search engine was partnered with the World Wildlife Fund (WWF) and promised to donate \"at least 80 percent of its income from sponsored links to WWF’s rainforest protection programme in Brazil’s Juruena-Apui region.\"", "WWF announced the partnership in a blog post:", "Those people unable to make it to the Copenhagen Climate Conference this month can still contribute to stopping climate change — by using a new search engine from their own computers.", "The same day the conference begins on Dec. 7, web users can start using a new green search engine called Ecosia. The new application, powered by Yahoo! and Microsoft’s Bing search engines, will allow internet surfers to protect about 2 square meters of Amazon rainforest just by clicking on sponsored links.", "Although users do not donate any money themselves, the company behind Ecosia will donate at least 80 percent of its income from sponsored links to WWF’s rainforest protection programme in Brazil’s Juruena-Apui region.", "“The green search engine is a very modern and inventive method of saving the world climate without a huge effort”, says WWF Germany’s director Eberhard Brandes.", "“Every year billions of dollars are being earned in the internet only from advertising revenue”, says Christian Kroll, founder of Ecosia. “There is a more eco-friendly way of using these huge profits: the money should better be used to fight global warming.”", "Since 2009, Ecosia has partnered with a number of other environmental organizations. The company reports it uses a portion of its profits to fund these organizations, who in turn work to plant trees around the world.", "Ecosia makes money the way most other search engines and websites do: through advertising revenue. While this money covers various business expenses, such as advertising and operational costs, Ecosia claims that the majority of its revenue goes toward funding tree-planting projects.", "Ecosia releases monthly financial reports so users can see exactly how the company is spending its money. The most recent full report comes from July 2019. The following report shows that 52% of its total income (approximately 80% of its surplus revenue) was invested in tree-planting projects; 5% was spent on advertising; 30% was spent on operational costs; and 12% went into company \"reserves,\" which are used to fund larger environmental investments:", "We have been unable to independently verify these numbers. However, we checked the websites of several of Ecosia's reported benefactors and found that many of these organizations list Ecosia as one of their partners. Dr. Simon Pfister, managing director of Green Ethiopia, an organization working to grow forests in Ethiopia that received approximately $150,000 from Ecosia in June 2019, told us that Ecosia accurately reported its donation in the company's financial report.", "Ecosia is also a Certified B Corporation. This means that Ecosia underwent a third-party evaluation that determined the company had an overall positive impact on its workers, community, and environment. According to the company:", "B Corp Certification doesn’t just evaluate a product or service; it assesses the overall positive impact of the company that stands behind it. And increasingly that’s what people care most about.", "Certified B Corporations achieve a minimum verified score on the B Impact Assessment — a rigorous assessment of a company’s impact on its workers, customers, community, and environment —and make their B Impact Report transparent on bcorporation.net. Certified B Corporations also amend their legal governing documents to require their board of directors to balance profit and purpose.", "The combination of third-party validation, public transparency, and legal accountability help Certified B Corps build trust and value. B Corp Certification is administered by the non-profit B Lab.", "Ecosia lets users plant trees by searching the web. In donating 80 percent of its surplus ad revenue, the search engine has raised almost $3 million for reforestation projects since its founding in December 2009. Ecosia's mission to cultivate a world where the environment doesn’t need protecting has it working to plant one billion new trees by the year 2020.", "By supporting high-impact reforestation efforts — as well as neutralising all CO2 emissions related to its search — Ecosia aims to achieve the highest positive environmental impact per dollar possible. By publishing its monthly donation receipts online, Ecosia aims to live up to its users’ demands for transparency. And by working to improve its charitable web service day after day, Ecosia aims to show the world that small changes can make a big difference.", "In its mission to plant one billion trees by 2020, Ecosia is working with experts and communities to reforest areas of the world that need it most. Sustainable, high-impact planting strategies mean improvements to the environment, local economies and social stability.", "Ecosia truly uses a large portion of its profits to fund tree planting projects. Of course, for anyone searching for an environmentally friendly search engine, planting trees isn't the only factor to consider. Ecosia is largely powered by Microsoft's Bing search engine. While Microsoft's global operations have been carbon neutral since 2012, the data centers powering Bing don't run entirely on renewable energy. Microsoft is working toward this goal, however, and expects to be driven by 100 percent renewable energy by 2023:", "In our data centers, we will continue to focus on R&D for efficiency and renewable energy. In 2016, we announced that we would power our data centers with more renewable energy, setting a 50 percent target by the end of 2018 and topping 60 percent early in the next decade while continuing to improve from there. We hit the first target nearly a year ahead of schedule, and today we are sharing the news that we will reach the 60 percent milestone before the end of this year. We’re therefore setting our next milestone on the path to 100 percent renewable energy, aiming to surpass the 70 percent target by 2023. We’ll also launch a new data-driven circular cloud initiative using the Internet of Things (IoT), blockchain and artificial intelligence (AI) to monitor performance and streamline our reuse, resale and recycling of data center assets, including servers.", "For comparison's sake, Google announced in 2017 that its search engine was being powered by 100% renewable energy.", "While Microsoft may not be at quite at 100% renewable energy yet, Ecosia claims that its own servers run on clean power thanks to its new solar plant. Additionally, Ecosia's carbon footprint is lessened due to its involvement with various tree-planting projects around the world. The company says:", "Renewable energy: Did you know that the CO2 footprint of an average search is estimated at 0.2 grams? Not so with Ecosia. We recently built our own solar plant, so that we can run our servers on clean power. This is even better than buying renewable energy from existing plants, as the plant can deliver clean energy to the grid and replace electricity derived from fossil fuels.", "Carbon-negative: By planting trees and offsetting its energy use with renewables, each search with Ecosia actually removes 1 kg of CO2 from the air, which makes Ecosia a carbon-negative search engine. Here’s the math: an average search generates around 0.005 € of revenue. It costs roughly 0.25 € to plant a tree, which means that Ecosia can plant one tree every 50 searches. On average, these trees will each remove 50 kg of CO2 during an expected 15 year lifetime.", "To sum up: Ecosia makes money through advertisements on its search engine. While a portion of that money is used to fund the operational costs of the business, about 80% of its surplus revenue is donated to environmental organizations and tree-planting projects around the world.", "Smith, Brad.   \"We're Increasing Our CarbonFee as We Double Down on Sustainability.\"     Microsoft.   15 April 2019.", "Google.   \"100% Renewable is Just the Beginning.\"\r\n    Retrieved 27 August 2019.", "Ecosia.   \"Financial Reports and Tree-Planting Receipts.\"\r\n    15 May 2019.", "World Wildlife Fund.   \"Clicks to Help Save Amazon.\"     3 December 2009.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]