["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "The Wisconsin DNR confirmed high levels of \"forever\" foam chemicals in Starkweather Creek, where it empties into Lake Monona in Madison. (Wisconsin Department of Natural Resources.)", "The Trump Administration did release a statement opposing the PFAS Action Act", "But the ad does not take into consideration previous legislation that Trump signed into law, which does combat the chemicals", "For years, states across the country have waged a battle against the \"forever chemicals\" that have leached into water used for drinking.", "The technical term is per- and polyfluoroalkyl substances -- or, in the political lexicon, PFAS.", "Federal lawmakers have been pushing for regulation of the chemicals, despite indications that President Donald Trump may veto a bill that would designate the chemicals as hazardous substances and regulate their cleanup.", "That became the target of a television ad, which began airing in mid-May 2020, from the League of Conservation Voters.", "The ad features Elizabeth Neary, a pediatrician and public health advocate, standing in front of a backdrop featuring trees and a body of water. The ad features news clippings from Wisconsin publications and maps of contamination sites, while she says, in part:", "\"Toxic chemicals that cause cancer are in the water right here. There are dozens of water danger zones like it that put Wisconsin at risk. The plans to clean it up were opposed by Donald Trump. … Donald Trump has real consequences for our health.\"", "So, does Trump oppose such cleanup plans?", "It’s more complicated than it seems.", "He could well block the current bill, but in December 2019 signed a bill that included legislation on PFAS.", "Let’s dig in.", "\"Forever\" chemicals remain in the environment and the human body and don’t break down over time, hence their nickname, according to an April 27, 2020 article from the Milwaukee Journal Sentinel.", "There are more than 5,000 of the compounds, linked to cancer or other health issues, that collect in the human body, either through the consumption of food or water containing the chemicals.", "PFAS are used for their water- and stain-resistant qualities, in products such as clothing and carpets, nonstick cookware, packaging and firefighting foams. Though PFAS are generally no longer in use, they remain in the environment, and cause contamination issues.", "When we asked the League of Conservation Voters for comment, they provided citations for all of the claims in the video, including several sources that pointed to the evidence of the chemicals in the state.", "One of the most notable PFAS sites in Wisconsin is near Marinette, where Johnson Controls/Tyco tests fire fighting foams. The company stopped testing the foams outdoors in 2017, and now has a system to ensure that the foam is not flushed into sewers or bodies of water after tests. PFAS have also been found in Madison and Milwaukee near airports where military units use fire fighting foam containing PFAS.", "There is really no dispute PFASs are there and need attention. Thus, the focus of this fact-check is on the League’s claims about Trump’s position.", "H.R. 535, also known as the PFAS Action Act, was proposed in January 2019, according to congress.gov and passed 247-159 by the U.S. House in January 2020. The yes votes were primarily Democrats, while the no votes were primarily Republicans.", "There has been no action scheduled on the bill in the U.S. Senate, where it waits in committee. If the Republican-controlled Senate passed the bill, it would go to Trump.", "But the Trump administration has already signalled opposition to the bill. Indeed, in the ad, a news clipping is shown, referring specifically to the bill, and the administration’s response letter.", "In a Jan. 7, 2020 statement of policy, the administration says the bill would create significant risk of lawsuits, set unreasonable timelines and precedents and impose hefty costs on federal, state and local governments.", "The statement suggests that decisions regarding the regulation of PFAS be left to the Environmental Protection Agency:", "\"The regulatory process works best when EPA and other agencies are free to devise regulations based on the best available science and careful consideration of all the relevant facts.\"", "So, Trump’s administration has stated opposition to this bill.", "But is it the only piece of PFAS-related legislation?", "No.", "In December 2019, Trump signed into law the National Defense Authorization Act for Fiscal Year 2020, which included action on PFAS.", "The law requires companies where PFAS are manufactured or used to track and collect data on the chemicals and establishes some limits for them, in addition to requiring testing of drinking water wells, according to the EPA website.", "The act also added some types of PFAS to the Toxic Release Inventory, which is a public database of toxic chemical releases and pollution prevention activities reported by companies. The act directs that PFAS contamination be addressed in both communities and near military bases, a common source of the chemicals, according to a March 20 Bloomberg Law analysis.", "In an ad that aired in Wisconsin, the League of Conservation Voters claimed Trump has opposed plans to clean up \"toxic chemicals that cause cancer (that) are in the water …. (and) put Wisconsin at risk.\"", "Trump’s administration is opposed to the pending PFAS Action Act, and the ad made clear that is the measure it was referring to. That said, he has signed another measure that addresses the chemicals. Indeed, some parts of the proposed law overlap with what was signed.", "We rate the claim Half True.", "League of Conservation Voters, \"Donald Trump has real consequences for our health,\" May 18, 2020", "Milwaukee Journal Sentinel, \"Johnson Controls to provide safe drinking water to more Marinette homes,\" April 15, 2020", "Congress.gov, \"H.R.535 - PFAS Action Act of 2019,\" Jan. 14, 2019", "White House statement of Administration Policy, Jan. 7, 2020", "EPA, \"Addition of certain PFAS to the TRI by the National Defense Authorization Act,\" May 28, 2020", "Bloomberg Law, \"INSIGHT: Congress confronts PFAS in National Defense Authorization Act - What you need to know,\" March 20, 2020", "Journal Sentinel, \"What you should know about PFAS,\" April 27, 2020\nEPA, \"Toxic Release Inventory Program,\" June 5, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]