["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Bill Kristol discusses the events in Ukraine on ABC's \"This Week.\"", "The violent uprising taking place in Ukraine and the decision of President Viktor Yanukovych to flee the nation’s capital of Kiev dominated much of the talk on the Sunday shows.", "On ABC’s This Week, conservative pundit and Weekly Standard editor Bill Kristol connected the recent events in Ukraine to the country’s November 2004 revolution against alleged electoral fraud. Kristol argued that the United States has a responsibility to help out nations like Ukraine more than they have in the past.", "\"Ten years ago there was the Orange Revolution in Ukraine, it was the first color revolution in spite of other efforts around the world. … All honor to the people of the Ukraine,\" Kristol said. \"That first revolution unfortunately slipped away. I think that’s partly our fault, the west Europeans’ fault. We didn’t do as much as we could have to help the newly democratic Ukraine.\"", "Whether or not the United States helped Ukraine enough a decade ago is a matter of opinion. But we can check Kristol’s assertion about the Orange Revolution and its place in history.", "Kristol didn’t return our request for comment.", "What is a color revolution?", "Eastern European uprisings have taken on many names. Czechoslovakia nonviolently overthrew its Communist government in 1989 in what was known as the Velvet Revolution.", "But the \"color revolutions\" speak to a more specific group of revolutions that came well after the original fall of Soviet Union, experts told us. They're associated with colors in a broad sense.", "\"Color revolutions came to denote pro-western government coming to power in former Soviet republics,\" said Anton Fedyashin, a Soviet history professor at American University. \"None of them have succeeded in the long run.\"", "Experts generally identify three color revolutions:", "Rose Revolution, Georgia, 2003", "Orange Revolution, Ukraine, 2004", "Tulip Revolution, Kyrgyzstan, 2005", "The first color revolution took place in Georgia in November 2003, when Georgian protesters overthrew the government of Eduard Shevardnadze and elected 35-year-old U.S. educated Mikheil Saakashvili. (The name, Rose Revolution, comes from the flower, but it is considered a \"color\" revolution.)", "Ukraine’s Orange Revolution came a year later and ended when opposition leader Viktor Yushchenko was elected president. (Yuschenko defeated Yanukovych, Ukraine’s now-deposed leader.) The revolution was originally branded \"orange\" because that was Yuschenko’s signature campaign color.", "So Kristol was wrong when he said Ukraine’s revolution was first. But Donnacha Beacháin, a Dublin City University government professor who published a book on the color revolutions, did say Ukraine’s revolution attracted much more attention than Georgia’s due to the nation’s larger population.", "Our ruling", "Kristol said the Ukraine Orange Revolution \"was the first color revolution.\" It was the biggest color revolution, but experts say nobody considers it the first. Georgia’s Rose Revolution took place a year earlier.", "We rate Kristol’s claim False.", "This item was updated at 6:51 p.m., Feb. 23, 2014, to note that the \"color\" revolutions speak more to a group of revolutions that have loose ties to colors -- than actual revolutions with colors in their names.", "Email interview with Donnacha Beacháin, Dublin City University government professor, Feb. 23, 2014", "Foreign Policy, \"Why the color revolutions have failed,\" March 18, 2013", "GeoHive, \"Overview of the world’s nations and their population,\" accessed Feb. 23, 2014", "New York Times, \"Archrival is freed as Ukraine leader flees,\" Feb. 22, 2014", "New York Times, \"Ukraine Parliament moves swiftly to dismantle president’s government,\" Feb. 23, 2014", "Phone interview with Anton Fedyashin, American University history professor, Feb. 23, 2014", "Phone interview with Lincoln Mitchell, Columbia University’s Harriman Institute associate, Feb. 23, 2014", "Slate, \"Garden party or uprising?\" Jan. 20, 2011", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]