["A year-old report of two restaurant owners in the UK booked for serving food mixed with human faeces to their customers have been revived on social media. It has been claimed that the Muslim owners served the contaminated food to non-Muslim customers. It is noteworthy that the article carries no such claim.", "BEWARE WHERE YOU ORDER YOUR FOOD‼ Not just spit, but u can find excreta in your food! Hotel owners Abdul Basit & Amjad in UK, arrested for serving human excretia to their Non – Musl!m customers! They mixed it in the food sold to non – Musl!ms ! 🤮 https://t.co/wahnNx5M0z", "— Ashtalakshmi 🇮🇳 (@Ashtalakshmi8) June 30, 2021", "Former CBI interim chief M Nageswara Rao also shared the Newstrack article from last year however, he did not claim that only non-Muslim customers were given the food. But his tweet termed the owners “religious fanatics”, hinting that the act was communally motivated.", "This news is very important for all of us and our family members, because we all eat outside in dhabas, restaurants, hotels etc, and we will never know or pay attention to whether the cooks, owners etc of dhaba, restaurant, hotel are religious fanatics. https://t.co/3xp3txxTp8", "— M. Nageswara Rao IPS(R) (@MNageswarRaoIPS) June 29, 2021", "A screenshot of Rao’s tweet is widespread on Facebook. It was shared on a group called India Against Urban Naxals.", "This slideshow requires JavaScript.", "Instagram page Nation Above Self also shared the story writing ‘jihad at rise’.", "On April 24, 2020 Zee News published a report titled, “(Kabab was served with bodily waste, the mentality of Jamaatis prevails even abroad) कबाब में परोसते थे शरीर की गंदगी, विदेश में भी वही जमाती मानसिकता.” The report has now been updated. The initial version said, “How far can you be saved from religious fundamentalism? Not just in India, but such a mentality is spread worldwide. Two youths in Britain, Mohammad Abdul Basit and Amjad Bhatti serve human bodily waste to non-Muslim customers.” The article received 12,000 shares and 14,000 likes on Facebook where it was shared with the caption, “They used to misbehave with non-Muslims, the truth has come out (गैरधर्म के लोगों के साथ करते थे नीच हरकत, ऐसे सामने आया सच.)”", "The article further stated, “There were two restaurant owners here [in Britain] – Mohammad Abdul Basit and Amjad Bhatti. According to reports, they used to mix human faeces in the food and serve it to non-Muslim customers. The duo was running their restaurant for a long time in Nottingham.” The story doesn’t state when the incident took place.", "The original Zee News article is still available on msn.com. An archived link of the same can be viewed here. A screenshot of an excerpt from the article (posted below) shows that Zee News claimed that the restaurant used to prepare two kinds of dishes and people from non-Muslim religions were served food with human faeces.", "Zee News later updated its report claiming that cases of such food contamination are not only reported in India but also in England. The URL of the article still reads “tablighi jamaat mentality”.", "Zee News’s story is based on a message viral since April 21, 2020. The message carries a link to UK-based Daily Mail which is not a part of the Zee News story. This is perhaps why the story neither mentions a source nor the date when the incident occurred. Daily Mail’s report is from September 2015.", "In this report, we will fact-check two claims separately –", "1. Was the food contaminated based on a person’s religion?", "2. Was human faeces intentionally added to the food?", "The Daily Mail report does not state that the restaurant owners used to serve unhygienic food to non-Muslim customers. We found that BBC and The Guardian had also reported the incident in 2015. These reports also don’t carry the religious angle. Therefore, the first claim is false.", "Now let’s talk about the second claim. According to the report in Daily Mail, the food was indeed contaminated with human faeces however this wasn’t intentional but due to “inadequate hand-washing techniques by the staff.” The report states, “Mohammad Abdul Basit and Amjad Bhatti, of the Khyber Pass takeaway in Nottingham, were responsible for an outbreak of E.coli that saw 142 customers fall seriously ill.” Justice Jeremy Lea, who gave the duo a four-month jail sentence and a fine of £25,000, has been quoted in the report as saying, “What was going wrong here was the poor handwashing with soap and clean water to reduce the risk of contamination.”", "The report published by The Guardian states, “More than 100 takeaway customers were sick for up to two months with a rare strain of E coli – after staff did not wash their hands when using the toilet, a court heard.” The report also quoted the prosecutor – “Nine of the 12 members of staff who handle food at the takeaway were found to have traces of the bacteria, and one of the defendant’s daughters fell ill.”", "BBC’s report carries a statement of Paul Dales, from Nottingham City Council’s food, health and safety team – “It’s clear that hand-washing practices by some workers were wholly inadequate and this led to food becoming contaminated.” The court ordered that the restaurant owners would be suspended for 12 months.", "Therefore, the claim that human faeces was intentionally added to the food is also false.", "We found that the restaurant ‘The Khyber Pass’ is now functional. However, it does not have great reviews on tripadvisor.com. Several people complained of unhygienic standards.", "To sum it up, Zee News carried a manufactured version of a true incident from 2015. While two restaurant owners in Britain were indeed found guilty of serving food contaminated with human faeces, this was neither religiously motivated nor was contamination intentional. As laid earlier, the court found that the restaurant staff did not wash their hands properly after using the toilet.", "Donate Now", "Priyanka Jha specialises in monitoring and researching mis/disinformation at Alt News. She also manages the Alt News Hindi portal.", "A purported video of a Muslim man beating a temple priest with a bat is…", "A picture depicting the Pakistani flag apparently bigger in size and apparently placed higher than…", "Amid the ongoing war between Israel and Hamas, a video of a fleet of cars…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "A claim that Nobel laureate Amartya Sen has passed away went viral on social media…"]