["Bihar assembly elections have grabbed public attention but by-polls in 11 states are also due in the first week of November. Dubbaka assembly constituency in Telangana is headed for by-elections on November 3. Several social media users have posted a video of a man distributing cash to people with the claim that leaders of ruling party Telangana Rashtra Samithi (TRS) are distributing cash in Dubbaka ahead of the polls.", "BJP leader N Ramchander Rao posted the video on November 1. Since then it has gained close to 9,000 views. (archived link)", "This is Dubbaka bye elections or Dabbu ku bye elections. TRS up to its real colour. @JPNadda @bandisanjay_bjp @kishanreddybjp @drlaxmanbjp @apjithender @vivekvenkatswam @Arvindharmapuri @TelanganaDGP @ceotelangana pic.twitter.com/XoIJT1pigw", "— N Ramchander Rao (@RaoMlc) November 1, 2020", "Telangana Legislative Council leader Mohammad Ali Shabbir also posted this with the same claim. (archived link)", "TRS leaders distributing money among voters in Dubbak by-elections. Will Election Commission of India take some action or remain a mute spectator? #TRSbuyingvotes pic.twitter.com/vENF0tv7f8", "— Mohammad Ali Shabbir (@mohdalishabbir) October 26, 2020", "Alt News performed a reverse image search on Yandex using InVID and found that the video was uploaded earlier this year in January by a YouTube user.", "As per CVR News, a Telugu news channel, the video shows TRS leaders giving money to voters during municipal elections in Sathupalli. The video was uploaded on January 21.", "A similar report of money distributed to voters in Peddapalli and Sathupalli during the municipal elections was also broadcast by NTV.", "It is noteworthy that the Model Code of Conduct (MCC) set by the Election Commission (EC) is operational from the date that the election schedule is announced till the date that results are announced. The EC announced the date for Dubbaka bypolls in September and the election process will be completed by November 12. The video currently being shared was shot before the MCC for the upcoming bypolls came into force but when the rules were in place for Telangana municipal polls.", "Therefore, a nine-month video that shows TRS leaders distributing cash to voters was falsely linked with Dubbaka by-elections.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]