["Kareena Chatani, then 4, and Reese Pittman, then 3, in a pre-K class at Carlton Academy Day School in Tampa in 2012. (Cherie Diez, Tampa Bay Times)", "President Barack Obama recently headlined a White House Summit on Working Families. During his address, he made a striking -- and for families with young kids, rather terrifying -- claim about how much child care costs.", "\"In most parts of the country, it costs thousands of dollars a year,\" Obama said in the June 23, 2014, speech. \"In fact, in 31 states, decent childcare costs more than in-state college tuition. In 31 states -- in more than half the states.\"", "Really? It costs more than college? We decided to take a look.", "We tracked down the source of the claim -- a 2013 report by Child Care Aware of America, which describes itself as the \"nation’s leading voice for child care.\"", "After surveying child care providers in all 50 states, the report concludes that \"in 2012, in 31 states and the District of Columbia, the average annual cost for an infant in center-based care was higher than a year’s tuition and fees at a four-year public college.\" Among the 50 states, the costs for infant care in center-based care ranged from $5,467 in Alabama to $16,430 in Massachusetts. Tuition and fees ranged from $4,278 in Wyoming to $14,576 in New Hampshire.", "That seems pretty close to what Obama said. (We’re not going to quibble over the definition of \"decent\" -- while it’s a subjective term, \"decent\" seems roughly equivalent to \"average,\" which is how the study reported its figures.)", "Still, Obama’s claim oversimplifies the issue a bit.", "It’s worth noting some clarifying language in the report --\"for an infant in center-based care\" -- that is absent from Obama’s statement. This is actually the highest-cost example of the four cases the report looked at.", "If you look at the cost for a 4-year-old in center-based care -- rather than an infant -- it costs more than in-state college tuition and fees in 19 states. That’s 39 percent fewer states compared with statistics for infant care. (Generally, care for infants is more intensive, so costs tend to go down as children get older.)", "The report also looked at costs for home-based care, which is often a less expensive option for parents. For infants, the cost of home-based care is higher than college costs in 14 states. That’s a 55 percent reduction in states compared to Obama’s 31.", "And for 4-year-olds, the cost of home-based care is higher than college in 10 states. That’s a 68 percent reduction in states compared to Obama’s 31.", "So Obama chose the most dramatic number of the four presented by the report -- a bit of cherry-picking.", "Using infant care in centers \"as a comparison for the costs of college could be considered cherry-picking,\" said Stephen Wood, a research analyst for Child Care Aware of America. But he added that her group's study put emphasis on that comparison because it involved \"the most in-demand form of early childhood education (infants in centers) and the most in-demand form of post-secondary education (four-year public colleges).\"", "It’s also worth noting that Obama’s claim doesn’t factor in tax credits and federal assistance for child care.", "For instance, according to the child care group’s study, \"about 2.6 million children received federal subsidies through one of several funding sources including the Child Care and Development Block Grant, Temporary Assistance for Needy Families, and the Social Services Block Grant. Additional public funding that supports early care/education is allocated for programs such as child welfare initiatives and special education.\"", "In addition, the report says, \"parents and businesses can take advantage of tax credits for supporting child care, including the Earned Income Tax Credit, the Child Tax Credit, the Child and Dependent Care Tax Credit, and Dependent Care Assistance Programs.\"", "All of these would reduce the cost of child care for many families. Of course, there are also tax credits and federal grants on the college side of the equation, and it’s possible the benefits for college are bigger than those for child care. Still, since we don’t know the impact of discounts either for child care or college costs, it adds another layer of uncertainty into Obama’s seemingly crisp summary.", "Our ruling", "Obama said, \"In 31 states, decent child care costs more than college tuition.\"", "He’s chosen a statistic that originated in a wide-ranging survey of child care costs (albeit one published by an advocacy group). However, Obama has cherry-picked the most dramatic statistic of four presented in the report, allowing him to say 31 states, rather than as few as 10. He also ignores uncertainty about how federal aid and tax credits would affect the comparison. On balance, we rate the claim Mostly True.", "White House, remarks by President Barack Obama at the White House Summit on Working Families, June 23, 2014", "Washington Post, \"Start saving now: Day care costs more than college in 31 states,\" April 9, 2014", "Child Care Aware of America, \"Parents and the High Cost of Child Care 2013 Report,\" accessed June 27, 2014", "College Board, \"Trends in College Pricing 2013,\" accessed June 27, 2014", "Email interview with Michael Wiseman, research professor of public policy, public administration and economics at George Washington University, June 26, 2014", "Email interview with Stephen Wood, research analyst, and Judy L. Francis, spokeswoman for Child Care Aware of America, June 27, 2014.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]