["The message, shared several thousand times in late 2019 from the west coast of British Columbia to the prairies of Saskatchewan, is short and clear:", "“Caught using cell phone, or holding it while driving - $999 fine and 3 yr suspended license as of Jan.2020!”", "Identical versions of the post were also shared in Australia this year, and turned out to be misleading.", "In Canada, the claim is false. Only extremely serious cases involving accidents or deaths, which are dealt with in a criminal court, could lead to a three year license suspension.", "Canada’s distracted driving laws vary by province or territory, nearly all of which amended their respective highway traffic acts and equivalents to punish the use of cell phones while driving in the past 15 years.", "On February 1, 2020, rules will change in Saskatchewan, a province in the Canadian prairies. On that day, fines for distracted driving will increase from $280 to $580 for first-time offenders. The second offence in the same year will be met with a $1,400 fine, and $2,100 for a third offence.", "In January 2019, Nunavut, a territory covering part of the Canadian Arctic, became the last jurisdiction in the country to ban cellphone use while driving, though no penalties were initially introduced.", "“It is highly unlikely anywhere in Canada under anyone’s highway traffic act, anyone would be suspended for three years for the use of a cell phone,” Graham Miner, Director of Highway Safety for Prince Edward Island, a province in Canada’s maritimes region, told AFP.", "The Canadian Automobile Association published this summary of penalties in effect in all Canadian provinces and territories on June 1, 2019.", "In certain provinces, such as Prince Edward Island, Newfoudland and Labrador, or Ontario, fines range from as low as $300 to as high as $3,000.", "Milner said that police officers pulling over drivers on the road may only issue fines on the lower end of the range, which is $500 in PEI.", "However, he added, “If I choose to plead not guilty and I go to court and I am found guilty, the judge can then decide to give me a larger amount, but the judge cannot go above the $1,200 because that’s the maximum (in Prince Edward Island).”", "Kristine Bunker, communications coordinator for the Ontario Ministry of Transportation, confirmed to AFP in an email that the same system applies to Ontario. “If a driver chooses to pay this ticket without contesting the charge in court, the amount of the ticket would remain at $615,” she wrote in an email. The additional $115 is a victim surcharge and a court fee added to the minimum $500 fine, Bunker said.", "Distracted driving alone cannot lead to any license suspension in Alberta, Newfoundland and Labrador, Prince Edward Island, Nova Scotia, New Brunswick, Yukon, and Nunavut, though it may lead to points taken off the license, which could eventually lead to a license suspension.", "Although British Columbia does not have a law to suspend licenses on first offense, two distracted driving offences within 12 months may lead to a three to twelve month driving prohibition.", "In Quebec and Ontario, the use of a cell phone while driving can lead to a three day suspension on the first offense, seven day suspension on the second offense, and 30 day suspension on the third offense.", "The use of a cell phone while driving in Canada, Milner concluded, could only lead to a three year suspension if it was a factor in a criminal offense such as dangerous driving. “The only way I could ever imagine this is if it reached the criminal level. It must mean they were they were using their cell phone and someone got injured very bad or killed,” he said.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]