["About this rating", "On June 26, 2019, news sites such as the Daily Mail, the Sun, and the Metro published a video that supposedly showed a nearly mummified man named Alexander who was reportedly found in a cave in Tuva, a remote region in southern Siberia, by a pack of hunting dogs after a bear broke his spine.", "The video, which allegedly shows Alexander being treated at a hospital after his ordeal, is a bit graphic and may not be suitable for all audiences.", "According to The Metro, the video's backstory was as follows:", "A missing man has been described as a talking mummy after being pulled from the brink of death.", "Named only as Alexander, he was discovered by hunting dogs in a bear’s den a month after he vanished in a remote region of Russia.", "He has been rushed to hospital suffering with a broken spine after fighting the bear, according to local reports.", "He told them that he had survived the attack when the bear overpowered him and drank urine to survive.", "He said: ‘The bear preserved me as food for later.’ The dogs that found him refused to leave his side in the bear’s den in the mountain forests, leading hunters they were with to realise something was amiss.", "Before this video made it to the British tabloids, it circulated on Russian messaging apps with equally outlandish, unbelievable stories. The website Kaotic (which we won't link to due to its NSFW content) published the video claiming that it showed \"an old man ... on a gurney waiting for treatment from a terrible skin condition.\" The video was also shared as if it showed a man who had been buried alive, only to escape after a local cemetery was flooded by heavy rains.", "The bear-attack claim first gained media traction from the site EADaily, but even that site admitted the claim had not been verified. Shortly after holes emerged in this story, EADaily published an update explaining they had received the video from a single source (\"a rather famous businessman in Tuva\"), who had received it from some hunting friends, who claimed that they knew an eyewitness to the incident. In other words, this story originated with a friend of a friend of a friend, and no first-person accounts have confirmed the \"bear attack\" version of this story:", "And finally, how the video itself got into the editor: it was sent by a rather famous businessman in Tuva, whose name and surname we will not give at his request. He claims that he received information from his hunting friends, who know the eyewitnesses of the incident, but then the trail ends. Moreover, this same video is a friend of the hunters or friends of their friends launched on the social network, which led some Russian publications to quickly invent their own versions of what happened.", "Furthermore, officials in Tuva said that they were unaware of any such incident having taken place there, and that this person was not being treated at any area hospitals:", "A spokesman at the health ministry in Tyva Republic said: 'We cannot confirm the case happened in Tuva.", "'It was not registered by the Ministry of Health, the Emergencies Ministry or any other official body (in the region).", "'Most probably, it happened somewhere outside Tuva.'", "Speech on the background in the video appears not to be local language Tuvan.", "So what really is going on in this video? It's still unclear. Some have theorized that this person may have been abusing a drug such as Krokodil, which can cause \"extreme skin ulcerations, infections, and gangrene.\" Others suggested that this video may feature some sort of zombie movie prop.", "While it's not clear what this video shows, the claim that this nearly mummified man was rescued after a bear broke his spine and kept him in a cave for more than a month is unfounded.", "EADaily.   \"Александр из берлоги»: что удалось узнать EADaily к этому моменту.\"\r\n    27 June 2019.", "EADaily.   \"В Туве мужчина со сломанным позвоночником месяц жил в берлоге медведя.\"\r\n    20 June 2019.", "Allan, Julaine.   \"Krokodil, The Russian 'Flesh-Eating' Drug, Makes a Rare Appearance in Australia.\"\r\n    Medical Xpress.   20 June 2019.", "The Siberian Times.   \"Buried Alive? Trapped in Bear Den? Russian ‘Living Corpse’ Spurs Fake News Mania Worldwide.\"\r\n    26 June 2019.", "The Siberian Times.   \"Man Lives After Bear Breaks His Spine and Keeps Him as Food Inside Den.\"\r\n    26 June 2019.", "E-news.su.   \"Живая мумия из берлоги»: что удалось узнать к этому моменту\"\r\n    27 June 2019.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]