["A screenshot of a tweet claimed to have been posted by former US president Barack Obama is widely circulating on social media. The screenshot portrays that Obama tweeted a picture of him shaking hands with Indian prime minister Narendra Modi and wrote, “Today I am shamefull for a hand shake with this man…. #NarendraModi”. Alt News received multiple requests to fact-check the claim on our WhatsApp helpline (+917600011160) and on our official Android application.", "Multiple Twitter users (1,2,3) posted this screenshot and suggested that Obama made the tweet against the backdrop of the ongoing farmers’ protest.", "This slideshow requires JavaScript.", "Several Facebook users have also posted this screenshot.", "The viral screenshot by Obama has been morphed. A photograph of the world leaders from 2014 was used along with text to create the manufactured tweet.", "Several red flags point to the tweet’s ingenuity. We were unable to find any tweet by Obama addressing PM Modi on December 5. The screenshot also carries silly grammatical errors – misspells the words ‘shameful’ and ‘handshake’. Also, the word that should have been used in the tweet is ‘ashamed’ not ‘shameful’. The viral screenshot’s design doesn’t match Twitter’s layout. Alt News compared the viral tweet with the lastest tweet by Obama that carries a picture. Quite evidently, the text of the tweet is not properly aligned with the image in the morphed screenshot.", "Thus a manufactured tweet has been shared on social media portraying that former US president Barack Obama said that he is ‘ashamed’ to have shaken hands with PM Modi.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]