["About this rating", "Rep. George Faught rejected the idea that God does not have sovereignty over all activities in human life, including rape and incest.", "Faught did not actually say that \"rape and incest are God's will\"; that concept was an implication of what he stated.", "In March 2017, several articles reported Oklahoma state representative George Faught had declared that incest and rape were \"the will of God\" during a debate about abortion legislation:", "If Oklahoma state GOP Rep. George Faught has his way, rape will be on the path to being legal in the state. At least that’s what rapists are hoping for after Faught made a frightening statement on the subject during a debate on House Bill 1549, which restricts abortion.", "Democratic Rep. Cory Williams masterfully cornered Faught during the hearing by asking him if he believes rape and incest are the “will of God” since the legislation has no exceptions for either, meaning women would be forced to give birth to their rapist’s baby.", "Faught’s reply is absolutely appalling and demonstrates once again why women should never vote for Republicans, especially Republicans who want to base our laws on the Bible.", "“Well, you know, if you read the Bible, there’s actually a couple circumstances where that happened,” Faught said. “The Lord uses all circumstances. I mean, you can go down that path, but it’s a reality unfortunately.”", "Faught literally just used the Bible to justify rape. And then he used it to justify incest.", "The Republican representative from the 14th district of Oklahoma (Cherokee and Muskogee counties) was speaking on 21 March 2017 during a reading of House Bill 1549, of which he is a co-sponsor. The bill would make it illegal in Oklahoma for a medical professional to terminate a pregnancy because the fetus is expected to be born with a genetic disorder.", "A full video of the session is available here (the most pertinent section starts at 11:58:50). Here is the relevant exchange between Representatives Cory Williams and George Faught:", "Cory Williams: Representative, is rape the will of God?\nGeorge Faught: Well you know, if you read the Bible there's actually a couple of circumstances where that happened, and the Lord uses all circumstances. I mean, you can go down that path, but it's a reality, unfortunately.\nCW: Is incest the will of God?\nGF: Same answer - doesn't deal with this bill.\nCW: With all due respect, I think it absolutely is on point. You won't make any exceptions for rape, you won't make any exceptions for incest in this, and you are proffering divine intervention as the reason why you won't do that. And so I think it is very important, this body wants to know - myself, personally - whether you believe rape and incest are actually the will of God.\nGF: You know, it's a great question to ask and obviously if it happens in someone's life, it may not be the best thing that ever happened, you know, but - So you're saying that God is not sovereign with every activity that happens in someone's life and can't use anything and everything in someone's life, and I disagree with that.", "Faught did not explicitly say \"Rape and incest are God's will\", nor did he respond in the affirmative when asked these questions. However, he did say he could not agree with the proposition that God is not sovereign over \"every activity that happens in someone's life,\" implying that God's will does indeed extend to acts of sexual violence.", "Logically, this position requires the conclusion that rape and incest, along with all other actions and experiences, are God's will, although Rep. George Faught did not explicitly state this.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]