["In his first weeks in office, President Joe Biden signed a series of executive orders aimed at tackling the COVID-19 pandemic, addressing racial injustice and establishing environmental protections.", "The actions – reversing some of President Donald Trump's policies and trying to set a different tone in Washington – brought criticism from some users on social media who accused Biden of an over-reliance on executive orders.", "One viral image posted Feb. 12 to the Facebook page for Cloyd Rivers, which features conservative memes, purports to show Biden in the Oval Office with five large stacks of executive orders on the Resolute desk.", "\"History will show that a dumb ass with a pen is far more dangerous than a smart ass with a tweet,\" reads the text above the post, which has more than 800 shares and 2,600 reactions.", "Other users across Facebook sharedsimilarversions of the photo.", "USA TODAY was unable to reach the posters for comment.", "Fact check:There's no evidence Henry Ford said quote used to critique socialism", "A reverse Google search of the image results in no matches and reveals that it was digitally altered from a photo taken on Biden's first day in office.", "The original image was taken by New York Times photographer Doug Mills on Jan. 20, the day Biden was sworn in as the 46th president, and shows him signing directives to reverse Trump administration policies.", "\"President Biden signed executive orders during his first few minutes in the Oval Office on Wednesday,\" the photo's caption reads.", "In the authentic version of the photo, there is only one stack of documents, which consists of 17 executive orders, memorandums and proclamations, according to The New York Times.", "The social media version of the photo was digitally altered to include additional stacks of executive orders.", "On Jan. 20, Biden signed orders to require masks and social distancing on federal property, provide support to underserved communities and rejoin the Paris Agreement on climate change, USA TODAY reported. He stopped the construction of Trump's U.S.-Mexican border wall and reversed Trump's ban on travel from predominantly Muslim countries.", "According to the latest update from the U.S. Federal Register, a daily journal of federal government activity, Biden has signed a total of 30 executive orders since Jan. 20.", "Fact check: Altered 2014 image used to make false White House blackout claim", "An image claiming to show Joe Biden signing executive orders in the Oval Office is ALTERED, based on our research. The original image from Jan. 20 shows 17 executive orders, and the photo was digitally manipulated to add orders.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook."]