["A quote that says – “पोर्न देखने से ज़्यादा बच्चे पैदा होते हैं (Watching porn leads to the reproduction of more children)”, has been attributed to UP Chief Minister Yogi Adityanath. The statement is being circulated as a news broadcast by ABP News. Twitter handle kabirmerchant11 was among those who shared it.", "The same has also been posted on Facebook.", "Alt News found that the quote has also been shared by several individual users without the ABP News graphic plate.", "The same quote has been floating on social media since 2016.", "The earliest instances of the quote appeared on June 14, 2016, the same day several people shared a similar story published on a satirical website – mindthenews.com. Hyperlinking a Patrika report which quoted Adityanath as saying that Hindus being reduced to minorities will prove disastrous, the website published a satirical piece on the UP CM. According to the article, Adityanath said that Hindus should watch more porn to produce at least four children. mindthenews.com mentions in its ‘About’ section and in the introductory paragraph of the article – “articles on this website are fake and a work of fiction and not to be taken as genuine or true.“", "Alt News contacted ABP News editor Pankaj Jha who said, “It’s a fake graphic plate. We don’t use this font for text.” A comparison of the screengrab and a genuine ABP News graphic plate from its broadcast shows a clear distinction.", "There are also other red flags in the screenshot.", "1. The single quotation mark at the start of the sentence is vertically rotated.", "2. A direct quote should begin with double quotation marks and not single quotes.", "3. The ABP News logo is too close to the text.", "In the past, fake ABP News graphic plates have been used to target Rahul Gandhi, Smriti Irani and Sambit Patra.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]