["The photo of Pakistani Prime Minister Imran Khan has been shared nearly 3,000 times in this Facebook post published on August 20, 2020.", "The Urdu-language caption of the post translates as: “This man standing in a queue is not Nawaz Sharif who used to book the entire plane to go to London and America with his family with public money. This is Prime Minister of Pakistan Imran Khan. Imran Khan leaves for Karachi from Islamabad airport. See he is standing in the common people’s queue at the time of departure. This is new Pakistan. Love you Imran Khan.”", "Nawaz Sharif is a former prime minister of Pakistan.", "The photo, along with a similar claim, was also shared in August 2020 here, here, here, here and here on Facebook; and here, here and here on Twitter.", "However, the claim is false.", "A reverse image search on Google found an earlier version of the photo posted here on Twitter on April 28, 2017.", "That was published more than a year before Khan became the prime minister of Pakistan on August 18, 2018.", "Who is this ???\n\t\tThis is Head of Biggest Political Party of Pakistan.\n\t\tKoi Shak ???\n\t\tHona b Nahi Chayeia...\n\n\t\tProud of you @ImranKhanPTI pic.twitter.com/RpHdbzAeAE", "Below is a screenshot comparison of of the April 2017 photo (L) and the image in the misleading post published in August 2020 (R):", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]