["A video of a child repeatedly slapped and tortured by a woman is circulating on the Indian social media ecosystem. Facebook user Rahul Michael posted the video with the message, “Live murder इस को इतना शेयर करो कि यह पकडा जाय यह विडियो रूकना नही चाहिए ह आप को अपनी मां की कसम ह (Share this video to such an extent this person gets nabbed. The video shouldn’t stop) -translated”. A few other individuals have requested Alt News to verify the video on its official WhatsApp number.", "With a keyword search on Google, Alt News found a report published by the UK newspaper Daily Mail on July 19, 2018. The video is of a woman who slapped and strangled her six-month-old twin daughters on camera. The clip had gone viral in Saudi Arabia. It was confirmed by the Saudi Ministry of Labour and Social Development that the incident was genuine and the mother who is believed to be carrying out the attacks had been arrested, according to the report.", "The Spokesperson of the Saudi Ministry of Labour and Social Development had tweeted about the case asking people to help them track down the video. He later informed that the children had safely reached the Social Protection Unit in Jeddah.", "تم التوصل للاطفال من قبل وحدة الحماية الاجتماعية في جدة وسيتم اصدار بيان توضيحي.", "— خالد أبا الخيل (@kabalkhail22) July 17, 2018", "“He [the person who posted the videos online] was identified as a Yemeni man called Mohanad Al Hashdi who revealed that the mother was a Somali woman living in Saudi Arabia who is married to another Yemeni man. The couple had reportedly separated, leaving the woman in financial difficulties, and as a result, she had taken the video and sent it to her husband’s father in Yemen to warn him of the consequences for failing to ensure that she was paid money,” stated the report.", "This video has been circulating on Twitter and Facebook since 2018 with a similar false message indicating it to be from India.", "In conclusion, an old video from Saudi Arabia of a woman beating her children to threaten her separated husband was shared in the Indian social media ecosystem supposedly as of an incident which took place in India.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]