["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "This Jan. 23, 2020 file photo shows a patient receiving a flu vaccination in Mesquite, Texas. (AP Photo)", "The study featured in the article is from 2019 and the data for it was collected in 2017-18, so it doesn’t include COVID-19 information.", "In past fact-checks, experts said this connection between the flu vaccine and other viruses is still speculative.", "We have debunked plenty of misinformation about vaccines for COVID-19 that are in development. Next up: more false information tying COVID-19 to the seasonal flu vaccine.", "An April 16 article shared on social media carries the headline \"New study: The flu vaccine Is ‘significantly associated’ with an increased risk of coronavirus.\"", "Facebook flagged this story as part of its efforts to combat false news and misinformation on Facebook's News Feed. (Read more about our partnership with Facebook.)", "The article, from a self-described \"conscious media\" website, mainly cites a 2019 study from the U.S. Armed Forces Health Surveillance Branch that was published in the journal Vaccine in 2020. The study focused on Department of Defense personnel, who have high rates of flu vaccination, and examined whether being vaccinated for a seasonal flu could make someone more or less likely to catch other respiratory viruses.", "But the study found no connection between the flu shot and an increased risk of contracting COVID-19.", "That’s because the U.S. Armed Forces study’s data was referring to seasonal common coronaviruses in 2017-18, not the new coronavirus that causes COVID-19. (There are seven types of coronaviruses that can infect humans, of which the COVID-19-causing SARS-CoV-2 is one.) This was clarified in the full article, but is ambiguous in the headline.", "What’s more, Richard Watanabe, a preventative medicine professor at USC, told PolitiFact that the article doesn’t really provide \"strong support for anything they are claiming\" since the study found little correlation between the flu vaccine and such viruses.", "Even with regard to coronaviruses that predated SARS-CoV-2, the U.S. Armed Forces study concluded that further research is needed, as \"the overall results of the study showed little to no evidence supporting the association of virus interference and influenza vaccination.\" The study’s data had mixed results for individual respiratory viruses and found that vaccinated individuals were \"more likely to have no pathogen detected and reduced risk of influenza when compared to unvaccinated individuals.\"", "The article also leaves out parts of the study that question the data linking coronavirus cases to the influenza vaccine. For instance, the U.S. Armed Forces study referenced a study from 2013 that had similar results except there was \"no association between influenza vaccination and RSV, adenovirus, human metapneumovirus, rhinovirus or coronavirus.\"", "Edward Belongia, an infectious disease epidemiologist who worked on the 2013 study, explained to FactCheck.org that there is little scientific data to support the speculative theory of the flu vaccine increasing the risk of other respiratory viruses.", "While this article did specify that the U.S. Armed Forces study was testing common coronaviruses and not COVID-19, the headline was ambiguous and misleading. We rate this headline False.", "PolitiFact, No, the coronavirus vaccines in development haven’t killed children, July 1, 2020", "PolitiFact, Blog post wrong on what Bill Gates said about COVID-19 vaccine, May 20, 2020", "PolitiFact, No, COVID-19 vaccine wouldn't come with a 'mark', May 22, 2020", "PolitiFact, Flu shots aren't causing false positive COVID-19 tests, May 21, 2020", "Collective Evolution, New Study: The Flu Vaccine Is \"Significantly Associated\" With An Increased Risk of Coronavirus, April 16, 2020", "Collective Evolution, About Us, accessed on July 14, 2020", "Vaccine, Influenza vaccination and respiratory virus interference among Department of Defense personnel during the 2017–2018 influenza season, June 19, 2020", "Elsevier, Vaccine, accessed on July 15, 2020", "Clinical Infectious Diseases, Influenza Vaccination Is Not Associated With Detection of Noninfluenza Respiratory Viruses in Seasonal Studies of Influenza Vaccine Effectiveness, June 6, 2013", "Factcheck.org, No Evidence That Flu Shot Increases Risk of COVID-19, April 27, 2020", "U.S. Centers for Disease Control and Prevention, Human Coronavirus Types, accessed July 15, 2020", "Email exchange with Richard M. Watanabe, preventive medicine and physiology & biophysics professor, Keck School of Medicine of USC, July 15, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]