["The screenshot was published here on a page with 27,000 followers on July 4, 2018. It has been shared more than 6,000 times.", "Below is a screenshot of the misleading post:", "Under the username 'Sir David Attenborough', the text in the screenshot states:  “In the last 5 years the bee population has dropped by ⅓. If bees were to disappear from the face of the earth, humans would have just 4 years left to live. This time of year bees can often look like they are dying or dead, however, they’re far from it. Bees can become tired and they simply don’t have enough energy to return to the hive, which can often result in being swept away. If you find a tired bee in your home, a simple solution of sugar and water will help revive an exhausted bee. Simply mix two tablespoons of white, granulated sugar with one tablespoon of water, and place on a spoon for the bee to reach. You can also help by sharing this post to raise awareness.”", "Some of the text in the misleading post has been copied and published in other Facebook posts, including here and here. It was also repeated in this article published on July 4, 2018. The article has been shared more than 145,000 times, according to data from social media monitoring tool CrowdTangle.", "Below is a screenshot of the article:", "But the quotes attributed to Attenborough are false; he does not have any official public social media profiles on Facebook, Twitter or YouTube.", "After the misleading Facebook posts emerged in July 2018, the BBC issued a statement, carried by multiple newspapers for example here and here, stating Attenborough did not write the post, and asking Facebook to remove it.", "A BBC spokesperson told AFP in an email dated July 23: \"At the time what we said was that the page in question was nothing to do with Sir David Attenborough and following a request from the BBC to Facebook, the page no longer existed.\"", "The Food and Agriculture Organization of the United Nations has noted a global decline in bee populations.", "Amateur Beekeepers Association of NSW Biosecurity Officer, Bruce White, explained to AFP in an email dated July 23 how beekeepers use sugar to stimulate honey bees which can travel up to five kilometres to forage for nectar.", "“If the bee is cold or carrying no nectar she will benefit from being able to get sugar syrup as it will warm her body and give her energy to continue on her trip back to the colony or forage,” White explained in his email.", "“If colonies are starving or need stimulating to breed, beekeepers fed sugar syrup to colonies inside the colony in special feeders. Never feed bees honey as it can carry diseases specific to honey bees only.”", "The New South Wales Department of Primary Industries has issued guidelines for feeding bees sugar here.", "The DPI’s guidelines warn however, that “sugar, if used incorrectly, can be detrimental to bees, particularly due to yeast contamination.”", "“If the bees do not consume all the syrup within a few days there is an increasing threat of yeast growth in the syrup mixture within the feeders. Yeast at rising concentrations can be very toxic to bees and lead to an early death of the adult bees. It is important to keep and mix syrup in clean sterile containers. The feeders should be thoroughly cleaned and sterilised between feeds of sugar syrup. Any syrup with evidence of fermentation or which has a sour taste should be discarded and not fed to bees. Mix enough syrup for immediate use only,” the guidelines read.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]