["About this rating", "Voting in the 2020 U.S. Election may be over, but the misinformation keeps on ticking. Never stop fact-checking. Follow our post-election coverage here.", "In November 2020, as U.S. President Donald Trump made false claims about voter fraud and signaled that he would wage a legal battle to contest the results of the presidential election, an image started to circulate on social media that supposedly showed an oddly prescient passage from his book \"The Art of the Deal.\"", "This is not a genuine passage from \"The Art of the Deal.\"", "The above-displayed passage supposedly comes from Chapter 45 of The Art of the Deal. This is suspicious for two reasons: First, Trump is the 45th president of the United States. It would certainly be a strange coincidence to find such a relevant passage published in the 45th chapter of this book. Second, and more important, \"The Art of the Deal\" does not have a 45th chapter.", "A copy of The Art of the Deal available via Archive.org shows that this book, first published in 1987, only has 14 chapters:", "We searched the text of this book via Google Books and Archive.org to see if this passage appeared in some place other than chapter 45, but we could not turn up any results.", "The language used in this passage is also questionable. While this passage starts off somewhat plausibly, it quickly turns into something that was apparently written to mock Trump and his supporters. The closing line, for example, reads: \"This is essential to keep your brand healthy and keep the millions of chumps and losers, your base.\"", "While the above-displayed passage is not a genuine quote from The Art of the Deal, the book does talk about Trump's competitive nature. Here's a passage from the book's fifth chapter:", "\"I'm the first to admit that I am very competitive and that I'll do nearly anything within legal bounds to win. Sometimes, part of making a deal is denigrating your competition.\"", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]