["President Richard Nixon, right, discusses a California state park in 1972 as John D. Ehrlichman, Nixon's domestic affairs adviser, listens. (AP)", "There’s no evidence to support the allegation that Obama wiretapped Trump Tower.", "Nixon faced the prospect of impeachment not because of the Watergate break-in itself, but because he worked to cover it up and obstruct an investigation into it, historians said.", "Historians said it’s unknown whether Nixon personally ordered the break-in and wiretap.", "A widespread Facebook post is recycling the false claim that President Barack Obama wiretapped then-candidate Donald Trump — and comparing that unsubstantiated allegation to the scandal that brought down President Richard Nixon.", "\"Why was it a crime for Nixon to wiretap the Democrats at Watergate but OK for Obama to wiretap Republicans at Trump Tower?\" says the May 28, 2019, Facebook post.", "The post has been re-circulating as Trump accuses Obama of an unspecified crime. It was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "But there has never been any evidence to support Trump’s assertions on Twitter and elsewhere that \"Obama had (Trump’s) ‘wires tapped’ in Trump Tower\" before the 2016 election, no matter how many times Trump, his allies and bloggers online have said so. There still isn’t.", "Historians who have studied Nixon also told us that while Nixon tried to cover up the Watergate break-in, there isn’t conclusive evidence that he personally ordered the break-in.", "Trump first accused Obama of wiretapping Trump Tower, a skyscraper serving as the Trump Organization’s headquarters in New York City, in a pair of March 4, 2017, tweets.", "Terrible! Just found out that Obama had my \"wires tapped\" in Trump Tower just before the victory. Nothing found. This is McCarthyism!", "How low has President Obama gone to tapp my phones during the very sacred election process. This is Nixon/Watergate. Bad (or sick) guy!", "Trump and the White House wrongly claimed the allegation was backed by news reports, including from the New York Times.", "Lawmakers from both parties said they had seen nothing to substantiate the allegations, and an Obama spokesperson said in a statement that \"neither Barack Obama nor any White House official under Obama ever ordered surveillance of any U.S. citizen.\"", "Trump didn’t drop the issue, however. Similar claims soon popped up online. We debunked doctored photos of Obama in handcuffs and made-up articles claiming he had been indicted, arrested or caught fleeing the country.", "All were fabricated.", "The Republican chairman and the top Democrat on the Senate Intelligence Committee said in a joint 2017 statement that they saw \"no indications that Trump Tower was the subject of surveillance.\"", "Days later, former FBI Director James Comey and former National Security Agency Director Mike Rogers both testified that there was no information to support Trump’s original tweets.", "Then, the Justice Department said in a court filing retrieved through a Freedom of Information Request that they \"have no records related to wiretaps as described\" by Trump.", "Finally, Justice Department Inspector General Michael Horowitz, testifying about his 2019 report on the origins of the Russia investigation later led by Special Counsel Robert Mueller, said his review found no proof that Trump Tower or Trump’s phone had been wiretapped.", "Did the FBI try & overthrow the presidency?—No Tap phones at Trump Tower?—NoPlant informants/spies?—NoThe IG report makes clear the Mueller investigation was NOT a “scam” conducted by “scum,” but an essential response to a serious attack on our democracy. pic.twitter.com/X6EMJ39whl", "Even Trump, speaking to Fox News’ Sean Hannity in 2019, said he made the allegation \"on a little bit of a hunch.\"", "The FBI did conduct legal, court-ordered surveillance of Trump campaign adviser Carter Page as part of the broader Russia investigation that Horowitz determined was justified. Horowitz found some errors in the FBI’s application for a FISA warrant to surveil Page.", "But that’s different from the secret, warrantless wiretapping that was found at Watergate.", "The Facebook post also botched the history surrounding Nixon’s resignation, experts said.", "Nixon resigned in the face of a likely impeachment after he was caught working to cover up a 1972 break-in and wiretapping at the Democratic National Committee’s headquarters.", "The arrest of five burglars at the Watergate complex in Washington, D.C., where the headquarters was located, kicked off a series of events that led to Nixon’s resignation.", "But it’s not clear that Nixon directed the break-in himself, experts said.", "\"There is no good evidence that Nixon knew about the Watergate break-in before the burglars got caught, nor is there any good evidence that he knew that anyone from his reelection campaign was planning to bug Democratic headquarters,\" said Ken Hughes, a historian at the University of Virginia’s Miller Center and an expert on Nixon’s recordings.", "There’s no tape or memo tying Nixon to the break-in, said David Greenberg, professor of history and journalism at Rutgers University and author of a book on Nixon.", "There's some evidence to suggest Nixon knew, but it’s inconclusive.", "For starters, Nixon acknowledged in a memoir that he was generally comfortable with burglary and wiretapping, Greenberg told us. And in a recording days after the break-in, Nixon said, \"My God, the committee isn’t worth bugging, in my opinion. That’s my public line.\"", "Finally, Watergate-conspirator Jeb Magruder also said Nixon was aware of the plot, Greenberg said. Those comments came in an interview in 2003, decades after Magruder wrote in a memoir that he didn’t know if Nixon had advance knowledge.", "\"Whether he authorized the break-in and illegal wiretap is unknown,\" Greenberg said, adding that \"regardless of whether Nixon knew, no one disputes that it was an illegal wiretap.\"", "So why did Nixon orchestrate a cover-up? Hughes said it was because the masterminds of the Watergate break-in — former CIA agent E. Howard Hunt and FBI agent G. Gordon Liddy — had been involved in \"other nefarious schemes that Nixon did order.\"", "\"Nixon ordered the cover-up because an unobstructed investigation of Hunt and Liddy’s crimes would lead back to his own,\" Hughes said.", "Among other things, those crimes would have included a never-implemented order to break into the Brookings Institution, a Washington think-tank, Hughes said.", "The \"plumbers,\" as Nixon’s team of former CIA and FBI agents were called, also broke into the office of the psychiatrist working for Daniel Ellsberg, the analyst who leaked the government’s secret history of the Vietnam War.", "President Gerald Ford eventually pardoned Nixon, so he was \"never formally charged with any crimes or brought to trial,\" Greenberg said.", "But he probably could have been prosecuted for obstruction of justice and conspiracy, Hughes said, noting that members of his inner circle were indicted on those charges.", "A Facebook post said: \"Why was it a crime for Nixon to wiretap the Democrats at Watergate but OK for Obama to wiretap Republicans at Trump Tower?\"", "There’s no evidence to support the allegation that Obama wiretapped Trump Tower. Plus, historians told us that while Nixon tried to cover up the Watergate break-in, there’s no conclusive evidence that he actually ordered the wiretapping to take place.", "We rate this post False.", "Facebook posts, May 28, 2019", "C-Span, \"DOJ Inspector General Michael Horowitz Defends Report, Highlights FISA Problems,\" Dec. 11, 2019", "The Washington Post, \"Michael Horowitz just shot down a bunch of Trump conspiracy theories,\" Dec. 11, 2019", "Vox, \"9 questions about Watergate you were too embarrassed to ask,\" Nov. 25, 2019", "Fox News on YouTube, \"‘Hannity’ Exclusive: Trump says tables have turned in Russia probe,\" April 25, 2019", "History.com, \"The Watergate Scandal: A Timeline,\" Oct. 9, 2018", "U.S. Senate Select Committee on Intelligence, \"Joint Statement from Senate Intel Committee Leaders on Wiretapping Evidence at Trump Tower,\" March 16, 2017", "Politico, \"Congress' wiretap slap leaves White House fuming,\" March 16, 2017", "American Oversight, \"DOJ Confirms Trump Lied in ‘Wiretap’ tweets,\" Dec. 2, 2017", "MSNBC, \"Did Nixon really order the Watergate break-in?\" Aug. 9, 2014", "The New York Times, \"Jeb Magruder, 79, Nixon Aide Jailed for Watergate, Dies,\" May 16, 2014", "Excerpts from \"The Nixon Defense: What He Knew and When He Knew It,\" 2014", "History.com, \"Watergate Scandal,\" Oct. 29, 2009", "The New York Times, \"The Unsolved Mysteries of Watergate,\" June 5, 2005", "Excerpts from \"An American Life: One Man’s Road to Watergate,\" 1974", "PolitiFact, \"A closer look at Michael Flynn’s reversal of legal fortune,\" May 8, 2020", "PolitiFact, \"Fact-checking Barr’s dispute of inspector general’s report on the FBI, Russia probe,\" Dec. 11, 2019", "PolitiFact, \"No, Nixon was never officially impeached. He resigned first,\" June 13, 2019", "PolitiFact, \"No, Barack Obama did not flee the country because of criminal activity,\" April 5, 2018", "PolitiFact, \"No, Obama not facing indictment for spying on Trump,\" Feb. 12, 2018", "PolitiFact, \"A timeline of Donald Trump’s false wiretapping charge,\" March 21, 2017", "PolitiFact, \"Donald Trump says he learned Obama tapped his phones from the New York Times,\" March 16, 2017", "PolitiFact, \"It's a trap! Story that FBI issued warrant for Obama in Trump wiretapping case is fake,\" March 13, 2017", "PolitiFact, \"Image of Obama in handcuffs for wiretapping Trump is fake photo,\" March 9, 2017", "PolitiFact, \"Did Donald Trump invent claim that Barack Obama tapped his phone?\" March 6, 2017", "PolitiFact, \"Why the White House defense of Trump wiretap accusation is misleading,\" March 5, 2017", "Email interview with Ken Hughes, historian at the University of Virginia’s Miller Center, May 20, 2020", "Email interview with David Greenberg, professor of history and journalism at Rutgers University and author of a book on President Richard Nixon, May 20, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]