["About this rating", "In February 2017 dubious web sites reported that a British couple lost custody of their children for \"co-sleeping\" -- with those sites downplaying the real mistreatment that led to the judge's decision against the parents.", "The story involved a child welfare custody hearing. The judge in the case, Peter Greene, ruled that a couple's young sons should be placed for adoption, citing concerns for their physical safety. Despite a previous hearing and court-approved supervision, the couple had not properly addressed the safety concerns, Greene ruled.", "A Telegraph article suggested that Greene's ruling was linked to his determination that the mother \"ignored advice against co-sleeping,\" or letting the children (born in 2014 and 2015) sleep in the same bed as the couple:", "I accept the evidence from the hospital and the other witnesses that the mother failed to act on advice in respect of the feeding and in respect of co-sleeping. Those matters are perhaps more significant in this case than they might be otherwise simply because of the fact that it is only a year since very similar concerns were raised. One of the most important aspects of both matters are the mother's failure to accept advice and failure to act on advice. The evidence of the health visitor seemed to sum it up by saying in so many words that the mother always thinks that she knows best.", "Other web sites then presented the case as an example of judicial overreach. However, those sites failed to mention this statement from the court transcript regarding the mother's behavior concerning the older child (identified as B) and later with her younger son (identified as BJ):", "Despite the findings in previous care proceedings that the mother had been reluctant to take advice and had, in particular, ignored advice against co-sleeping, the hospital only two months after those proceedings had ended were reporting that they had real concerns that the mother was rejecting their advice about feeding, that BJ was losing weight as a result and also that she was continually ignoring their advice against having him in bed with her and he was found asleep in her bed on a number of occasions. Their concerns were so great that, rather than allow BJ home after two days as had been originally intended, he was kept in for some two weeks. So a number of the concerns voiced at that stage were very similar to those which had been voiced a year earlier in respect of B.", "The court transcript also revealed that ongoing concerns over the childrens' welfare, rather than just co-sleeping activity, had prompted the hearing. At one point, the mother showed an observer a bruise on the BJ's calf. Initially she blamed \"a strap on his swing seat\" for the bruise, but a subsequent hospital examination revealed that the 4-month-old boy had also suffered a broken wrist and a bruised shoulder. All three injuries were attributed to \"non-accidental causes.\"", "When asked about the injuries, the mother at first offered no explanation. Later, she blamed the boys' father, and then the oldest son.", "However, Greene said, the father could not have been responsible because he was away from the children at the time of the infant's injuries and was supervised whenever he was around the children. A medical expert testified that the injuries were consistent with the boy's being \"forcefully put against or slammed against something along those lines with a flat edge the top of a piece of furniture,\" something that the older son could not have done.", "Based on the evidence, Greene ruled that the baby's injuries were \"more likely than not to have been caused by careless or negligent handling by the mother,\" but that she did not deliberately mean to hurt him:", "I have already said that Mr. R has not put himself forward as a sole carer. I accept that both parents love the children and contact has been very good and enjoyable in many ways for the children, but, sadly, in respect of the mother, I accept the evidence of [witnesses] that the mother requires significant long term therapy to effect the necessary changes without which she will continue to be dismissive of advice and parent children in a way that is likely to cause them attachment disorders and fail to meet their needs or keep them safe.", "In all those circumstances and with a heavy heart, I approve the care plan with the only option being for permanency outside the family and make a care order to the Local Authority.", "The Transparency Project, which advocates for greater transparency in the British family court system, criticized the Telegraph for their \"misleading\" headline regarding the case and later called for corrections from not only that news site but also from the Daily Mail and the Independent as well.", "Transparency Project chair Lucy Reed told us by email that her organization is \"concerned that inaccurate or skewed reporting of the circumstances in which children are removed in child protection cases may directly impact on the way other parents engage with child protections services, and may make it more difficult for them to ask for help when needed, or to work with services to show they are safe parents.\"", "The Telegraph.   \"Mother Who Let Her Two Boys Sleep in Her Bed Has Them Taken Away by Judge.\"\r\n    12 February 2017.", "Khan, Sherab.   \"Mother Who Slept in Bed with Her Children Has Them Taken Away Over Safety Concerns.\"\r\n    The Independent.   13 February 2017.", "Gordon, Amie.   \"Two Young Sons Are Put Up for Adoption After Mother Who 'Always Thinks She Knows Best' Ignored Social Workers' and Professional Advice.\"\r\n    Daily Mail.   13 February 2017.", "Reed, Lucy.   \"Correction Request Re Inaccurate Headlines: Mother Who Let Her Two Boys Sleep in Her Bed Has Them Taken Away by Judge.\"\r\n    The Transparency Project.  15 February 2017.", "Arturo Garcia is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]