["Hong Kong has seen months of violent protests sparked by proposed legislation that would have allowed extradition to mainland China. At a protest on August 25 in Tsuen Wan, police fired tear gas and deployed water cannon after protesters threw petrol bombs, according to this AFP report.", "A photograph of an unarmed man pleading with a policeman with a gun at the Tsuen Wan protest was published here by the New York Times with the headline: “In Hong Kong, Protest Photo Evokes Memories of Tiananmen Era”.", "The misleading posts contain a composite image that combines a cropped version of the New York Times photograph, and another wide shot of the same scene, with a series of small photographs purporting to show the same man attacking police with a small projectile.", "The composite image has a caption in traditional Chinese characters and a People’s Daily Weibo watermark in the middle at the bottom. The word: “performance” is written across the middle, and “8.25 Tsuen Wan” is written in the top left.", "The writing across the lower part of the composite image says:", "“One moment throwing a brick; the next moment kneeling down in the street,\n\t“It looks you are a member of the mob,\n\t“I’d give you a 100 for your performance”.", "China’s state-run People’s Daily posted the picture here on Chinese social media site Weibo on August 26, 2019, and the post has been shared for more than 3,000 times.", "Below is a screenshot of the People’s Daily Weibo post:", "The post’s caption says: “Comment: Put down the arrogant mob. Pretend to kneel down, with evil intentions! The more ‘exquisite’ the acting, the more vicious and disgusting it will be. Thinking he was smart, he didn't expect his ugliness and violent acts to be caught on camera, and he will eventually pay for it. The mob is insane and the violence escalates again and again, which is outrageous. In dealing with the mob who will stop at nothing, Hong Kong police officers need to protect themselves, act precisely, and strongly put down the arrogant mob.”", "A hashtag -- #WatchTheActingOfThePeopleCausingChaosInHK# -- is posted at the end of the caption. Some 45,000 posts have been tagged with this hashtag, which have been viewed around 400 million times.", "Chinese media sites such as Global Times and Xinhua News Agency also posted the composite image on Weibo and Facebook, which can be seen here and here.", "Posts containing the same composite image, or some of the images in the picture, have also been posted alongside similar claims here and here on Facebook, and here and here on Twitter.", "But the claims are false; the composite image actually shows two different men -- who were both wearing grey vests -- at the Tsuen Wan protest.", "The four of the photographs in the composite image show the moment when an unarmed man in a grey vest pleaded with a police officer with a gun.", "The exchange can be seen in this AFP video from 0:21 to 0:29:", "Below are three screengrabs from the AFP footage showing the moments when the four images from the misleading picture were captured:", "Local media reported that the man was saying \"Don't fire!\" to police, according to this video published by TVB News.", "Below is a screenshot of the video where subtitles: \"Don't fire, don't fire\" can be seen in traditional Chinese characters:", "The other two images contained in the misleading picture have been taken from footage that has circulated widely online, for example here posted by NBC Bay Area on Twitter.", "The footage shows police officers retreating before the warning shot was fired. A man, also wearing a gray vest, can be seen at the beginning of the footage in front of a fence, near a street light, throwing a projectile.", "Below is a screengrab from the footage at 0:02 showing the moment when the two images from the misleading composite image were captured:", "In a video, posted here on Hong Kong public broadcaster RTHK's website, the two different men wearing grey vests can both be seen at the protest -- one can be seen from 0:04 to 0:06, and the other from 0:28 to 0:40.", "Embedded below is another video posted on one of RTHK's Facebook accounts with the same footage from 0:28, including both images of the two separate men:", "In the RTHK footage, the man seen from 0:03 of the video is wearing a grey vest, has a watch on his left arm, and is wearing trousers and thick white-soled shoes. He is not wearing glasses and a logo can be seen on the front of his vest.", "Below are two screenshots from the RTHK footage showing the man at 0:04 and 0:05:", "Later in the RTHK footage, the second man wearing a grey vest can be seen pleading with police. He is wearing a plain grey vest, black shorts, and shoes with black-and-white soles. He is wearing glasses and is holding a white umbrella in his left hand and a phone in this right hand.", "Below are screenshots from the same RTHK footage showing the second man in the grey vest at 0:04 and 0:05:", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]