["About this rating", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "In a seven-minute interview with \"Today's\" Savannah Guthrie on Jan. 25, 2021, Dr. Anthony Fauci said that wearing two layers of masks is likely to be more effective in slowing the spread of SARS-CoV-2, the novel coronavirus.", "Fauci is an immunologist and director of the National Institute of Allergy and Infectious Diseases who has led the White House COVID-19 task force since March 2020. Around the 5:30 mark in the segment below, Guthrie asked him if wearing two masks was better than one.", "“It likely does because this is a physical covering to prevent droplets and [the] virus to get in,” replied Fauci. “So, if you have a physical covering with one layer and you put another layer on, it just makes common sense that it likely would be more effective, and that’s the reason why you see people either double-masking or doing a version of an N95.”", "In the same interview, Fauci noted that a variant strain of the novel coronavirus that originated in the United Kingdom had made its way to over 20 states in the U.S. by late January 2021 — a strain that has shown to transmit more efficiently and could be more contagious and more deadly. And with a strain in South Africa that prompted a U.S. travel restriction to the nation, health officials warn that wearing masks and maintaining social-distancing measures is key in slowing the spread of COVID-19 as vaccines continue to be rolled out around the world.", "This science also confirms the efficacy of double-masking: A study published in July 2020 in the scientific journal Matter compared the differences in wearing surgical masks and cloth masks and found that the former can remove between 53 and 75% of particles when worn as designed. Cloth masks, by comparison, remove between 28 and 91% when worn properly. And a nylon overlay that covers the mouth improved these odds because it minimized gaps in coverage on the face.", "Matter", "Though the study did not specifically test the concept of double-masking, the researchers found that a nylon overlay also boosted the efficiency of poorly fitting cloth masks that might otherwise allow for particulate matter to reach the nose and mouth.", "The Centers for Disease Control and Prevention did not issue specific guidance on double-masking as of this writing, but it did advise that people wear masks in public and whenever they are around other people that do not live in their household. These recommendations included wearing masks that have two or more layers of washable, breathable fabric that completely covers the nose and mouth and fits snugly against the sides of the face without gaps.", "Madison Dapcevich is a freelance contributor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]