["About this rating", "In April 2015, the web site EM Toast published a humorous (and fictional) article reporting that the FDA had banned the sale of grape-flavored ice cream in the U.S. due to pet related hazards:", "Why You Can’t Buy Grape Ice Cream", "There is no such thing as grape ice cream.  The reason?  It has a lot to do with dogs, girls, the 1876 World's Fair,  pharmaceutical companies, and it\u0019s more complicated than you think.", "After his successful invention of the ice cream soda in 1874, Philadelphia\u0019s Robert Green began to tackle a request from his customers.", "Green boldly stated, in an 1876 interview with the Pennsylvania Inquirer, \"The people are tired of vanilla and chocolate.  They want something more.  When the children come up from the mines, they are not satisfied with the plain flavors anymore.  I will give them grape. The world's fair is coming.  The world will have grape ice cream.  This I decree.\"", "What Green did not know, is that grapes contain a special molecule Anthocyanin that prevents freezing.  Green\u0019s every attempt to create grape ice cream only produced one outcome — grape milk.  He was destined to fail, but in all the excitement with the fair, no one noticed.", "The EM Toast article was only initially shared a few hundreds times on social media, but an Imgur post based off the information contained in this fictional article went viral on 13 April 2015. While neither the Imgur post nor the EM Toast article included a disclaimer to indicate that the claim concerning an FDA ban on grape ice cream was false, several clues pointed to the article's fictional nature.", "First, the original article was published in the \"Short Fiction\" section of EM Toast. Second, although the EM Toast web site did not include a statement specifically declaring its humorous intent, its \"About\" page simply stated that \"We write what we want, when we want.\" Finally, grape-flavored ice cream is available at several ice cream parlors around the United States. Handel's Homemade Ice Cream and Yogurt, for instance, currently sells grape ice cream.", "The EM Toast spoof was based on the notion that the consumption of grapes and raisins has been linked to renal failure in dogs, although it is highly unlikely that phenomenon would ever lead to a ban on grape-flavored human treats by the FDA. Dogs are also problematic consumers of common ingredients such as chocolate, avocados, raisins, and macadamia nuts.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]