["About this rating", "On Feb. 13, 2020, as U.S. President Donald Trump and Democratic presidential candidate Michael Bloomberg traded jabs on social media, a photograph supposedly highlighting the height disparity between the two circulated on social media.", "Actor James Woods drew attention to the photograph on Twitter:", "Trump (who is reportedly 6 foot 3) had been mocking Bloomberg (who is reportedly 5 foot 8) on social media over his height. While Trump is certainly taller than Bloomberg, this photograph doesn't document the true height disparity between the two men. It was manipulated to make Bloomberg look small.", "The original photograph showed Trump, Bloomberg, and Jared Kushner at an event in New York in March 2013. It was taken by Paul Bruinooge/Patrick McMullan and is available via Getty Images along with the caption:", "NEW YORK, NY - MARCH 14: (L-R) Donald Trump, Mayor Michael Bloomberg and Jared Kushner attend The New York Observer 25th Anniversary at Four Seasons Restaurant on March 14, 2013 in New York City. (Photo by Paul Bruinooge/Patrick McMullan via Getty Images)", "We cropped the original photograph (left) in order to compare it to the doctored image (right):You can see the uncropped photograph on Getty Images.", "Although we're not able to independently verify the actual heights of these two individuals, it seems that their statures have been exaggerated over the years. While Bloomberg is currently listed on Google at 5 foot 8, the former mayor of New York once identified himself as 5 foot 7.", "Trump's 2016 White House physical listed him as 6 foot 3, but he was listed as 6 foot 2 on his 2012 driver's license.", "Regardless, it appears that height may be a leading issue in the lead-up to the 2020 elections:", "Chan, Sewell.   \"The Mayor's Tall Tales.\"\r\n    New York Times.   4 December 2006.", "Gabbatt, Adam.   \"A Tall Tale? Accuracy of Trump's Medical Report – and New Height Questioned.\"\r\n    The Guardian.   17 January 2018.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]