["The photo was published here on Facebook on January 12, 2020. It has been shared more than 300 times.", "Below is a screenshot of the Facebook post:", "The Tagalog-language post translates to English as: “ACCELERATING TAAL ERUPTION NEWS! / Close-up shot of Taal volcano spewing fire! / Credit to: Maam Lits Bautista / #arangkadangkabitenyo\".", "The photo was shared on the same day that the Taal volcano, situated on an island in the middle of a lake in the south of Manila, began emitting huge plumes of ash. The Philippine seismology agency subsequently issued an imminent \"hazardous explosive eruption” warning. Thousands of people were evacuated from the area and flight operations were temporarily suspended at Manila airport, following further reports of earthquakes, as reported by AFP here on January 13, 2020.", "The photo was also shared hundreds of times in other Facebook posts here and here, and on Twitter here, alongside a similar claim.", "The claim is false; this photo shows the eruption of Santiaguito volcano in Guatemala in 2009.", "A reverse image search on TinEye found this Getty Images page which describes the photo as a stock photo of the Santiaguito volcanic eruption in Guatemala in January 2009.", "Below is a screenshot of the photo on the Getty Images website:", "It is captioned: “January 3, 2009 - Santiaguito eruption, Guatemala. - stock photo”.", "Getty Images credits Stocktrek Images, Inc. as a contributor to this photo.", "On the Stocktrek Images, Inc. website, Martin Rietze has been credited as the photographer who took the image.", "Below is a screenshot of the Stocktrek Images page:", "The same photo can also be found on Rietze’s website, under the “GUATEMALA 30.12.2008-7.1.2009 / Santa Maria-Santaguito” section.", "Below is a screenshot of the photo on Rietze’s website:", "Below is a screenshot comparison of the photo in the misleading Facebook post (L) and the photo on Rietze’s website (R):", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]