["A coal truck drives through an railroad tressel near downtown Welch, W.Va. Coal brought a large population to the McDowell County in the 1940's. Now the population is shrinking and the county suffers from unemployment and poverty. (AP/Jon C. Hancock)", "Kendra Fershee, a Democrat who is challenging U.S. Rep. David McKinley, R-W.Va., took aim at the poverty rate in a Sept. 19 Facebook post.", "\"Poverty in WV is more than 5% higher than the national average,\" Fershee wrote in the post. \"The poor are getting (much) poorer and if you look at what my opponent is posting (stories about how great the economy is, using national statistics) he doesn’t even seem to know that there’s a problem in WV.\"", "She added, \"Are you ok with our state diving deeper into despair while our elected officials: vote for policy that drives wages lower, push to strip healthcare from poor people and people with pre-existing conditions, and then pat themselves on the back for a job well done? I’m not. This is unacceptable. But WE can fix it on Nov. 6.\"", "We wondered whether poverty in West Virginia is more than 5 percent higher than the national average. So we took a closer look.", "The post links to a Sept. 18 article in the Parkersburg News and Sentinel headlined, \"Poverty increases in W.Va.\" According to the article, \"About 336,000 West Virginians lived in poverty in 2017, 5.7 percent higher than the national average. West Virginia was among the top four states with poverty rates of 18 percent – Louisiana, Mississippi, New Mexico and West Virginia.\"", "To confirm the newspaper’s data, we turned to the original figures from the U.S. Census Bureau. The numbers check out: The U.S poverty rate was 13.4 percent, but the West Virginia poverty rate was 19.1. The difference: 5.7 percentage points.", "To be precise, however, Fershee should have said that the poverty rate in West Virginia is more than 5 percentage points higher than the United States as a whole -- not 5 percent higher. If it were 5 percent higher, the poverty rate in West Virginia would be about 14.1 percent, not 19.1 percent.", "So the poverty rate in West Virginia is actually higher than Fershee’s literal words suggested.", "In an interview, Fershee said that it’s important to note that \"the rest of the country is doing better, and West Virginia’s poverty rate has actually worsened,\" said Fershee.", "The historical data bears that out. Here’s a chart of the U.S. and West Virginia poverty rates going back to 2005.", "In 2012, the gap between the U.S. and West Virginia poverty rates was 1.9 percentage points. Five years later, the gap was 5.7 points.", "Fershee said, \"Poverty in WV is more than 5% higher than the national average.\"", "Only a slip-up in her mathematical terminology keeps this from being fully accurate. The poverty rate in West Virginia was 5.7 percentage points higher than the national rate, not more than 5 percent higher.", "We rate the statement Mostly True.", "Kendra Fershee, Facebook post, Sept. 19, 2018", "Parkersburg News and Sentinel, \"Poverty increases in W.Va.,\" Sept. 18, 2018", "U.S. Census Bureau, state and national poverty data, accessed Oct. 31, 2018", "Email interview with Eric Bowen, research professor in West Virginia University’s Bureau of Business and Economic Research, Oct. 23, 2018", "Email interview with Kendra Fershee, Democratic congressional candidate, Oct. 19, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]