["Photo from John Kasich's gubernatorial campaign shows him signing legislation imposing restrictions on puppy mills and large-scale breeders, in 2013", "Ohio Gov. John Kasich fell into a common trap while campaigning in his home state of Ohio the day before the primary election. He repeated a famous saying without checking it first.", "Explaining how he planned to fend off outside interests in his decision-making, the Republican presidential candidate invoked the 33rd president, saying, \"You know what Truman said -- ‘You want a friend in Washington, buy a dog.’ \"", "It does sound like one of the folksy, farm-charm quips for which Harry S. Truman is known. He’s the leader whose desk displayed the plaque reading, \"The buck stops here.\"", "But did Truman really say, \"You want a friend in Washington, buy a dog?' \" Or is it a myth that solidified through repetition, like a thousand witticisms wrongly attributed to George Carlin in email chains?", "PITCH IN $1, HELP POLITIFACT GET $15,000 IN MATCHING FUNDS TO HIRE A FACT-CHECKER", "The definitive information comes from the historians at the Harry S. Truman Library and Museum. Sam Rushay, supervisory archivist, told us, \"We have never been able to confirm or verify that President Truman ever wrote or said, ‘If you want a friend in Washington, get a dog,’ a quote that is often attributed to him.\"", "The most often cited source for the non-quote is from a work of fiction. In the play Give ‘em Hell, Harry, written by Samuel Gallu in 1975, Truman’s character says, \"You want a friend in life, get a dog!\"", "Previous investigators have found the mistake in a 1987 op-ed in the New York Times, and in a 1989 column by the New York Times’ Maureen Dowd. In both cases, the writers credited the quote to the real Truman, and substituted the word \"Washington\" for \"life.\"", "History proves that Truman was no fan of dogs. The Presidential Pet Museum’s website includes a page on \"President Truman’s Unwanted Dog, Feller,\" given to the White House as a gift from a supporter. The president gave the puppy away to his doctor, which didn’t play well in the press.", "A reporter asked Truman, \"Whatever happened to Feller?\"", "\"To what?\" Truman said.", "\"Feller, the puppy,\" the reporter said.", "\"Oh, he’s around,\" Truman answered.", "Our ruling", "Kasich told an Ohio crowd, \"You know what Truman said, ‘You want a friend in Washington, buy a dog.’ \" Though that statement is often attributed to Truman, there’s no evidence Truman ever actually said that.", "We rate Kasich’s statement False.", "Website, Snopes.com", "Website, Presidential Pet Museum, July 22, 2013", "Website, TheBark.com", "Website, QuoteInvestigator.com", "Email, Sam Rushay, supervisory archivist, Harry S. Truman Library and Museum", "Article, \"Prospects,\" New York Times, June 7, 1987", "Article, \"Bush’s fierce loyalty raises debate on whether it hinders his judgement,\" New York Times, Mar. 10, 1989", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]