["A set of photographs are being circulated on social media with the claim that Congress workers were thrashed in Punjab. “ठोको ठोको ताली ठोको (सिद्धू) कांग्रेसियों की धुलाई पंजाब मे 😅😅😅 IPL T20 के छक्के लगे (Clap your hands (Sidhu). Congressi were beaten in Punjab, got IPL sixes),” is the most widely used caption circulated with the images. From a Facebook page मै भी चौकीदार, the post received over 5,000 shares.", "Individual users on Facebook have also circulated the images (1, 2), drawing thousands of shares.", "Another claim floating on social media suggests that Congress MP Navjot Singh Sidhu was chased and thrashed by a crowd in Punjab. A Twitter handle, @sir_jenishpatel, was among those who circulated the images. He is followed by BJP Delhi spokesperson Tajinder Pal Singh Bagga and his post received over 500 retweets and more than 700 likes.", "From what it seems, the photographs are viral on WhatsApp as well.", "A simple reverse-image search on Google reveals that the images do not pertain to a recent event. The incident took place on September 25, 2016, when a group of around 10 youths, suspected to be Akalis workers, attacked a Congress bike rally in Ajnala, Punjab. Congress party workers had reportedly taken out a rally against drugs.", "According to Hindustan Times, “…the bike rally, led by District Congress Committee (rural) president Gurjit Singh Aujla, reached the community centre at Guru Ka Bagh. The youths allegedly started beating Congress workers with rods and baseball bats. “The attackers belonged to the ruling party, alleged Aujla in a press conference.”", "Congress MP Sidhu is not in the photograph. The man on the bike with the pink turban was “Congress (rural) district president Gurjeet Singh Aujla”, per a report by The Tribune.", "ABP News had also uploaded a video of the brawl.", "Old images and videos have recently resurfaced on social media with the claim that they represent a recent event. Alt News has debunked several such cases – a video of alleged EVM malfunction during 2017 UP civic polls was viral as that of Lok Sabha elections, a 2017 video from Gujarat was shared as PM Narendra Modi’s rally in Hyderabad, Atal Bihari Vajpayee’s funeral procession was viral as PM Modi filing nomination papers.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]