["About this rating", "On 27 July 2016, United Nations special rapporteur on the rights to freedom of peaceful assembly and of association Maina Kiai issued a statement upon concluding a 17-day fact-finding visit to the United States in which, among other observations, he lauded a U.S. Department of Justice practice known as \"consent decrees\":", "The Civil Rights Division of the Department of Justice has provided oversight and recommendations for improvement of police services in a number of cities with consent decrees. This is one of the most effective ways to reduce discrimination in law enforcement and it needs to be beefed up and increased to cover as many of the 18,000-plus local law enforcement jurisdictions.", "We'll delve into what consent decrees are and what they have to do with discrimination in law enforcement shortly. Suffice it to say regarding Mr. Kiai's statement that the two sentences above constitute the only mention of consent decrees in the entire 6,500-word document, but they didn't go unnoticed by Robert Romano, a writer for LifeZette (the news and lifestyle web site edited by talk radio host Laura Ingraham). His 4 August 2016 article, \"UN Backs Secret Obama Takeover of Police,\" led with the quoted passage, which Romano went on to interpret as follows:", "That was United Nations Rapporteur Maina Kai on July 27, a representative of the U.N. Human Rights Council, who on the tail-end of touring the U.S., endorsed a little-known and yet highly controversial practice by the Justice Department to effect a federal takeover of local police and corrections departments.", "The Obama administration has been pursuing the federal takeover of local police right under Congress' nose — and Republicans in Congress were apparently unaware it was happening.", "Here's how it works: the Civil Rights Division at the Department of Justice files a lawsuit in federal court against a city, county, or state, alleging constitutional and civil rights violations by the police or at a corrections facility. It is done under 42 U.S.C. § 14141, a section of the 1994 Violent Crime Control and Law Enforcement Act, granting the attorney general the power to prosecute law enforcement misconduct. The municipality then simply agrees to the judicial finding — without contest — and the result is a wide-reaching federal court order that imposes onerous regulations on local police.", "To put it less breathlessly, in this context a consent decree is a civil action pursued by the federal government against a local law enforcement agency to remedy violations of 42 U.S.C. § 14141, a section of the 1994 Violent Crime Control and Law Enforcement Act prohibiting police conduct \"that deprives persons of rights, privileges, or immunities secured or protected by the Constitution or laws of the United States.\"", "The rationale and history behind the statute is summed up in an article on the web site of the Leadership Conference on Civil and Human Rights:", "In 1994, Congress passed 42 U.S.C. 14141, the police misconduct provision of the Violent Crime Control and Law Enforcement Act of 1994. The provision authorizes the Attorney General to file lawsuits to reform police departments engaging in a pattern or practice of violating citizens' federal rights. The Division also enforces the Omnibus Crime Control and Safe Streets Act of 1968 and Title VI of the Civil Rights Act of 1964, which together prohibit discrimination on the basis of race, color, sex, or national origin by police departments receiving federal funds.", "Starting in the late 1990s, the Special Litigation Section began to conduct investigations and implement consent decrees and settlement agreements where evidence demonstrated a violation of the police misconduct statutes. The investigations addressed such systemic problems as excessive force, false arrest, retaliation against persons alleging misconduct, and discriminatory harassment, stops, searches, and arrests. The decrees require the police departments to implement widespread reforms, including training, supervising, and disciplining officers, as well as implementing systems to receive, investigate, and respond to civilian complaints of misconduct.", "Concrete examples of the use of consent decrees include reforms forced on the Detroit Police Department between 2003 and 2014 after a spate of 47 fatal police shootings of civilians in five years, and on the Los Angeles Police Department between 2001 and 2013, after accusations that officers in an anti-gang unit had beaten and framed suspects. The Washington Post reported in 2015 that of the 67 DOJ civil rights investigations of law enforcement agencies conducted since the statute was enacted, 26 resulted in binding agreements between the agency and the federal government — more than half of those in the form of consent decrees — for the purpose of addressing systemic police misconduct.", "The Post also stated that more than half of the binding agreements since 1994 were imposed during the Obama administration, which brings us back to the allegation with which we started — that this somehow amounts to a secret Obama \"takeover\" of police.", "It doesn't.", "For one thing, the use of consent decrees started in the mid-1990s, soon after the the Violent Crime Control and Law Enforcement Act was signed into law, and more than a decade before Obama was elected (nor, for that matter, has their use ever been \"secret\"). For another, it was Congress who gave the Justice Department this power by passing the 1994 legislation. And finally, these binding agreements — including consent decrees — are, by design, temporary, not permanent. They're not by any defensible stretch of the imagination a \"federalization\" or \"nationalization\" of local law enforcement entities. On the contrary, they're legal remedies implemented on a case-by-case basis to ensure local compliance with the civil rights laws of the land.", "The increase in the use of binding agreements between the DOJ and local law enforcement agencies during the Obama administration (there are currently eight such agreements now in force across the country) coincides with an increase in the use of deadly force by police, even as violent crime rates have gone down.", "Whether they're the best way to address police misconduct in the long run is an unsettled question, and up for debate. It can even be argued that — regardless of the rightness of the cause — the program is an example of overreach by the federal government, and ought not to be \"beefed up,\" contrary to what the United Nations rapporteur suggested, to cover more of the 18,000-plus law enforcement jurisdictions across the country. But an \"Obama takeover\" it is not.", "Kelly, Kimbrell, Childress, Sarah and Rich, Steven.  \"Forced Reforms, Mixed Results.\"\r\n  Washington Post.  13 November 2015.", "Kindy, Kimberly et al.  \"Fatal Shootings by Police Are Up in the First Six Months of 2016, Post Analysis Finds.\"\r\n  Washington Post.  7 July 2016.", "Romano, Robert.  \"UN Backs Secret Obama Takeover of Police.\"\r\n  LifeZette.  4 August 2016.", "Stroud, Matt and Rojanasakul, Mira.  \"A 'Pattern or Practice' of Police Violence in America.\"\r\n  Bloomberg.  27 May 2015.", "Weichselbaum, Simone.  \"The Problems with Policing the Police.\"\r\n  Time.  21 April 2015.", "\"Civil Rights Investigations of Local Police: Lessons Learned.\"\r\n  Police Executive Research Forum.  25 October 2012.", "\"Long Road to Justice.\"\r\n  The Leadership Conference.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]