["About this rating", "In October 2020, while answering a question about tax increases, Biden said there are “things you can’t do by executive order unless you are a dictator. We’re a democracy, we need consensus.”", "\"You can't legislate by executive order\" was not an accurate quotation of Biden's remarks, which were also taken out of context. Biden did not mention legislating. He was talking about actions he could not impose through executive order, in this specific case tax increases on the wealthy.", "Voting in the 2020 U.S. Election may be over, but the misinformation keeps on ticking. Never stop fact-checking. Follow our post-election coverage here.", "As U.S. President Joe Biden signed dozens of executive orders within his first few weeks in office, conservatives criticized his actions. Many of his orders were reversals of former President Donald Trump’s actions, including on immigration, the travel ban, the ban on transgender people serving in the military, the global gag rule on providing funding for abortions, climate policies, preserving Deferred Action for Childhood Arrivals (DACA), and more.", "Historically, presidents from both sides of the aisle have used executive orders extensively, and both sides have criticized the other for doing so. In early 2021, Republicans and conservative media relied on an old Biden quote to critique his flurry of executive actions.", "For example, Senate Minority Leader Mitch McConnell claimed that, “As recently as October, now-President Biden said you can't legislate by executive action unless you are a dictator. Well, in one week, he signed more than 30 unilateral actions.\"", "Fox News personality Sean Hannity posted on his blog, purporting to quote Biden: “‘I have this strange notion, we are a democracy … if you can’t get the votes … you can’t [legislate] by executive order unless you’re a dictator. We’re a democracy. We need consensus,’ said Biden.”", "Both commentators took Biden’s words out of context and made misleading claims about them.", "Biden made the comments in October 2020 during an interview with George Stephanopoulos. His remarks came in response to a question about whether tax increases on corporations and wealthy Americans would be delayed under his administration. Biden said:", "I gotta get the votes. [...] I have this strange notion. We are a democracy. Some of my Republican friends and some of my Democratic friends even occasionally say, well, if you can’t get the votes, by executive order you’re gonna do something. Things you can’t do by executive order unless you are a dictator. We’re a democracy, we need consensus.", "Conservatives added to his quote the suggestion that he was talking about “legislating” through executive order, when in fact Biden was talking specifically about things a president could not do through executive order, like tax reform.", "White House Press Secretary Jen Psaki was asked about this quote on Jan. 28 by reporter Rob Kearney, and she explained Biden’s words in context:", "KEARNEY: [...] in October Joe Biden said there were limitations on the use of executive actions, things he can’t do by executive order, unless you’re a dictator. We’re a democracy, we need consensus. I think you said earlier that some of these executive orders will be used to roll back some of the immoral things that the previous administration had done. If you’re quoting these things immoral, is that seeking consensus and unity? And then also, I mean, does it suggest that President Biden sees himself as perhaps a benevolent dictator?", "PSAKI: Well, Rob, I’m sure this wasn’t your intention, but I think you took the President’s comments a bit out of context. He was asked about tax reform and whether that could be done via executive order during the interview with George Stephanopoulos, which you’re referring to [...]", "PSAKI: And the President also said during an interview with columnists back in December that he didn’t think executive action should be used for everything. And that certainly is his point of view, but there are steps including overturning some of the harmful, detrimental, and yes, immoral actions of the prior administration that he felt he could not wait to overturn and that’s exactly what he did. Now, any historian will tell you that he walked into the presidency at one of the most difficult moments in history that required additional executive action in order to get immediate relief to the American people.", "The White House defended the high volume of executive orders in the first week of Biden's presidency, and not only in response to partisan critics. The New York Times ran an opinion piece headlined “Ease up on the Executive Actions, Joe.” Biden framed his executive actions as an effort to “undo the damage Trump has done.\" White House Communications Director Kate Bedingfield also tweeted that the Biden administration was working on getting legislation passed as well, \"Of course we are also pursuing our agenda through legislation. It’s why we are working so hard to get the American Rescue Plan passed, for starters.”", "Given that Biden’s words were not accurately quoted and were taken out of context, we rate this claim as “Mostly False.”", "Nur Nasreen Ibrahim is a reporter with experience working in television, international news coverage, fact checking, and creative writing.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]