["About this rating", "Griner is married to a woman, and Scalise has not supported marriage equality measures during his political career.", "Griner was not simply a responding officer, but rather a part of Scalise's security detail.", "On 15 June 2017, a post circulate claiming via social media asserting that police officer Crystal Griner (who had been wounded during the shooting of House Majority Whip Steve Scalise one day earlier) was a lesbian, and she risked her life to save a man who was opposed to her own marriage:", "The post maintained that Griner (a lesbian) saved Scalise (an opponent of LGBT rights), and ended with a \"that's right, haters\" message.", "Although elements of the post are accurate, on the whole it left out a lot of context and a complex backstory involving Griner, Bailey, their jobs, and the shooting incident.", "It is true that Griner is married to another woman, an incidental detail reported by gay publication Washington Blade:", "Capitol Police Officer Crystal Griner — a lesbian in a same-sex marriage — was among those wounded during a shooting this week in the Virginia suburbs and received a visit from President Trump during his trip to the hospital to see the victims.", "Griner was among the five people shooter James T. Hodgkinson wounded during an incident at the Republican congressional baseball practice. On the House floor, House Speaker Paul Ryan (R-Wis.) praised her as one of the officers who saved lives during the shooting where House Majority Whip Steve Scalise (R-La.) was badly wounded.", "According to CBS News, Griner and Special Agent David Bailey rushed Hodgkinson despite their own wounds. After being shot in the ankle, she was taken to MedStar Washington Hospital Center for recovery.", "Furthermore, both Griner and Bailey are black, and in the days after the shooting a quote attributed to Scalise describing himself as \"David Duke without the baggage\" re-entered the news cycle. Although that quote, too, was often presented in a facile manner, Scalise had come under fire for his purported links to white supremacist groups:", "[Scalise has] admitted to giving a speech to white supremacists.", "In 2002, Scalise spoke to the European Unity and Rights Organization, a group led by Duke, the former Grand Wizard of the KKK. \"He told me he was like David Duke without the baggage,\" Stephanie Grace, a long-time political reporter, told The New York Times in 2014 of her first meeting with Scalise. \"I think he meant he supported the same policy ideas as David Duke, but he wasn't David Duke, that he didn't have the same feelings about certain people as David Duke did.\" While Scalise admitted to the speech, he later claimed he didn't know their cause was white supremacy.", "Griner and Bailey were rightly hailed for averting what could have been a massacre, nut the pair were not merely responding officers acting in a moment of spontaneity; they were specifically assigned to protect Scalise as part of his security detail:", "A mass shooting during a congressional baseball practice could have been a full-blown “massacre,” Congress members say. Instead, two special agents put their lives on the line, potentially saving dozens of others.", "Capitol Police officers Crystal Griner and David Bailey are special agents on Rep. Steve Scalise’s security detail. Scalise was standing near second base in an Alexandria, Virginia park when the bullets began flying from behind the third base dugout, striking Scalise. While Scalise dragged himself to safety, Griner and Bailey lept into action. In an extended firefight, the two agents took down shooter James Hodgkinson while battling through injuries of their own. Both were taken to the hospital after the gunfight, and are recovering from their injuries, officials say ...", "Most congress members do not have their own security details. But high-ranking officials like Scalise, the House Majority Whip, are assigned security teams.", "Had Scalise not been present at the early-morning practice, neither Griner and Bailey would have been on the scene to intervene:", "If Scalise hadn’t attended with his security detail, lawmakers said, many of their colleagues likely would have been slaughtered by Hodgkinson.", "“Our lives were saved by the Capitol Police. Had they not been there I think it would have been a massacre,” Sen. Rand Paul said on CNN after the shooting. “The field, I mean, was basically a killing field.” But the Capitol Police officers weren’t the only ones credited with saving lives during the shootout.", "Despite Rep. Scalise's reported proximity to white supremacists during his political career (Scalise clarified that he disavowed any such ideology in 2014), friends said Bailey was devoted to his duty of protecting Scalise:", "“[Bailey] definitely takes his job very seriously. He works really hard and is committed to keeping the Whip safe and to serving,” [friend Danielle] Carpenter told The Daily Beast. “He is a leader in all ways. He is one of the best guys I’ve ever met—is kind to everyone and always makes sure that everyone feels safe and taken care of. Dave is really proud of his Brazilian and Jamaican heritage and you can tell he would do anything for family. He considers Congressman Scalise and his family as his own, so it is no surprise that he would make any sacrifice necessary to keep Whip Scalise safe.”", "Gore, Leada.   \"Watch Injured Capitol Hill Officer David Bailey Throw Out First Pitch At Congressional Baseball Game.\"\r\n    AL.com.   16 June 2017.", "Johnson, Chris.   \"Lesbian Officer Wounded In Va. Shooting, Visited By Trump In Hospital.\"\r\n    Washington Blade.   15 June 2017.", "Menza, Kaitlin.   \"Some Background On Steve Scalise, The Republican Congressman Who Was Shot This Morning.\"\r\n    Esquire.   14 June 2017.", "Weill, Kelly.   \"The Hero Cops Who Prevented a Congressional ‘Massacre.'\"\r\n    The Daily Beast.   14 June 2017.", "Wong, Scott.   \"Wounded Scalise Opens Up About Race.\"\r\n    The Hill.   2 April 2015.", "OnTheIssues.   \"Steve Scalise On The Issues.\"\r\n    Accessed 16 June 2017.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]