["The video has circulated on social media, including in this post on Facebook with a caption that reads: “The moment Borno state governor Zulum’s convoy was under attack the third time.”", "The post’s accompanying footage has been viewed more than 165,000 times since September 28, 2020, according to data provided by social media monitoring tool CrowdTangle.", "The post was published barely a day after fighters from the Islamic State West Africa Province (ISWAP) -- a splinter group of the Boko Haram jihadist group -- opened fire on the convoy of Governor Babagana Zulum of Borno state, in restive northeast Nigeria.", "Zulum’s convoy had previously suffered two similar attacks -- one on September 25, 2020, near the town of Baga on the shores of Lake Chad, and the other in July 2020 outside Baga.", "Nigerian activist Deji Adeyanju, who has had posts debunked by AFP Fact Check here and here, also published the same claim on Facebook.", "Adeyanju’s now-deleted video has spread to Twitter and Instagram, as well as on Nairaland, Nigeria's most-visited domestic social network. Many of the comments suggest online users believe the viral clip was filmed in Nigeria, while others were sceptical or dismissive.", "But AFP Fact Check found the claim to be false. Although insurgents have indeed launched several attacks on Zulum’s convoy this year, the viral footage has been shared in a misleading context.", "Using the InVID WeVerify tool, AFP Fact Check ran several reverse image searches on keyframes of the video. We found that the video clip features in this report published on January 18, 2020, on the website of Kenyan newspaper The Standard.", "According to the report, the clip shows Kenyan police dispersing crowds gathering for a political rally in Mumias, in the country’s western region of Kakamega.", "Kenya’s license plate numbers", "The white license plate numbers seen on vehicles in the video also provide additional clues.", "However, since the numbers appear blurry, AFP Fact Check used The Standard’s video with higher quality, as well as a similar video of the scene shot from a different angle by Kenya Citizen TV to verify the license plate numbers.", "The plate number starting with “KCS” is among one of the series of Kenya’s fourth generation of number plates.", "AFP Fact Check used the website of World License Plates, which collects license plates from various countries, to determine the plate numbers seen on the vehicles in the videos match those in Kenya and differ from those in Nigeria.", "Meanwhile, in The Standard’s video, we observed that the front plates of vehicles are black on white, while their rear plates are black on yellow. This matches the description of Kenya’s plates on the website of World License Plates, and our fact-checkers in Nairobi confirmed this to be the case.", "Using multimedia content from other countries to portray Nigeria is not uncommon in Africa’s most populous nation.", "AFP Fact Check has debunked many such misleading claims, including an image of a damaged portion of asphalt road in Thailand that was passed off as an example of shabby road networks in Nigeria’s southern region.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]