["A video of a crowd stripping the clothes off of a uniformed man is gathering a lot of traction on social media recently. The man in the police uniform can be seen wearing many layers of clothing under his shirt. Users claim the policeman’s name is Salim and he reportedly tried to steal clothes from a mall. The message being shared with the video targets the Muslim community.", "लखनऊ: मॉल में खरीदारी करने गए सिपाही सलीम की चोरी के आरोप में हुई पिटाई, ट्रायल रूम में वर्दी के नीचे चोरी कर तीन शर्ट पहन कर निकले सलीम की पोल खुली। Sudhar jao jihadiyo #Lucknow pic.twitter.com/Eca8DJh1k6", "— Saurav (@Saurav37383309) February 28, 2021", "Another Twitter user has shared this video identifying the man as Salim. (Archive link)", "Facebook user Shankar Chaudhary also posted this clip with the same claim. (Archive link)", "लखनऊ एक Shop में खरीदारी करने गये सिपाही सलीम की चोरी के आरोप में खूब हुई धुनाई ट्रायल रूम में वर्दी के नीचे चोरी कर तीन शर्ट पहन कर निकले पकडे़ गये ये कौम को कितना भी पढा़ लिखा दो कोई भी पदवी दे दो पर काम वही करेंगे जो इनके संस्कार है ऐसे लोगों के वजह से दूसरे पुलिस वाले भी बदनाम होते है", "Posted by शंकर चौधरी on Saturday, February 27, 2021", "Users are sharing it widely on Facebook and Twitter. A Facebook page titled ‘Khabar AB Tak Ki‘ also stated the policeman was named Salim.", "Live Hindustan tweeted this video reporting that a police officer was beaten by a crowd for stealing at a mall in Lucknow, Uttar Pradesh. However, there was no mention of the man’s religious identity.", "लखनऊ: मॉल में खरीदारी करने गए सिपाही की चोरी के आरोप में हुई पिटाई, ट्रायल रूम में वर्दी के नीचे चोरी कर तीन शर्ट पहन कर निकले सिपाही की पोल खुली। #UttarPradesh pic.twitter.com/oIcKCpoOcX", "— Hindustan (@Live_Hindustan) February 25, 2021", "Alt News performed a keyword search and came across a report by Jagran dated February 26, 2021. It states that this incident occurred in Lucknow, the capital of Uttar Pradesh. According to the story, “The police officer posted in the police line went to VMart on the pretext of shopping. After walking around the store for a while, he entered a trial room. It is alleged that the accused cop walked out wearing three shirts underneath his uniform. He tried to leave, triggering the alarm at the gate. The security guard stopped him, and several employees had gathered by then. Upon checking, they discovered that he was stealing clothes. Following this, some people started beating him. Others filmed the incident and posted it on social media, where it went viral.” According to the information in the article, Adesh Kumar was suspended.", "Bharat Samachar also identified the policeman as Adesh Kumar in its tweet on the incident.", "An Aaj Tak report quoting Lucknow Police Commissioner DK Thakur mentioned that Kumar was suspended when the theft came to light.", "Therefore, a video of a policeman named Adesh Kumar caught stealing clothes from a mall in Uttar Pradesh was falsely shared with an anti-Muslim spin, with users claiming his name was Salim. In a similar incident, a clip of an American food service worker caught spitting into a pizza was circulated under a baseless Muslim angle.", "Donate Now", "Kinjal Parmar holds a Bachelor of Science in Microbiology. However, her keen interest in journalism, drove her to pursue journalism from the Indian Institute of Mass Communication. At Alt News since 2019, she focuses on authentication of information which includes visual verification, media misreports, examining mis/disinformation across social media. She is the lead video producer at Alt News and manages social media accounts for the organization.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]