["About this rating", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "In February 2020, as the COVID-19 coronavirus disease continued to spread around the globe, a rumor circulated on social media holding that North Korea Supreme Leader Kim Jong Un had ordered the country's first COVID-19 patient to be shot dead:", "We have not been able to verify this rumor. Details about the alleged execution are scarce, and we have yet to see any substantiated reports about the person's purported death.", "The claim that Kim ordered the country's first coronavirus patient to be executed is likely related to a report from the South Korean newspaper Donga. On Feb. 13, Donga reported, citing sources from North Korea, that a bureaucrat who had been quarantined as a precautionary measure was executed after breaking quarantine to visit a public bath. Donga reports that this person was allegedly sentenced to death because the public's health was put at risk.", "This report comes from anonymous sources and does not provide specific details about the incident (such as the name of the public facility or the name of the official). While other outlets have picked up on this report, they all appear to be based on the same anonymous sources and lack any specific verifiable details.", "Verifying rumors from North Korea is difficult because the country has strict control over its media. As of this writing, North Korea maintains it has not had a single case of COVID-19 within its borders.", "The Associated Press reported on March 13:", "The top American general in South Korea said Friday he is fairly certain North Korea has not been spared by the COVID-19 outbreak that began in neighboring China, although the North has not publicly confirmed a single case.", "Speaking by video-teleconference from his headquarters in South Korea, Army Gen. Robert Abrams told reporters at the Pentagon that the North had halted military training for a month — including a 24-day hiatus in military flying — but has since resumed.", "\"It is a closed-off nation, so we can’t say emphatically that they have cases, but we’re fairly certain they do,” he said. \"What I do know is that their armed forces had been fundamentally in a lockdown for about 30 days and only recently have they started routine training again. As one example, they didn’t fly an airplane for 24 days.” He said they have resumed flying.", "Because we cannot confirm the accuracy of reports that claim Kim ordered North Korea's first COVID-19 patient to be executed, we've marked this claim as \"Unproven.\"", "Burns, Robert.   \"US General: ‘Fairly Certain’ North Korea Has COVID-19 Cases.\"\r\n    The Associated Press   13 March 2020.", "Kasulis, Kelly.   \"Alarm and Scepticism Over N Korea Claim of Being Coronavirus Free.\"\r\n    Al Jazeera   21 March 2020.", "Sung, Joo.   “코로나 예방차원 격리된 北관료, 몰래 대중목욕탕 갔다가 총살”\r\n    Donga.   13 February 2020.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]