["A video of an elderly man speaking in support of the Citizenship Amendment Act (CAA) is viral with the claim that he is Rizwan Ahmed, brother of actor Naseeruddin Shah.", "Rizwan Ahmed (Naseeruddin Shah’s brother) on CAA", "Brother of Naseeruddin Shah on CAA", "Posted by Pradeep Sharma on Saturday, 18 January 2020", "The same video has been shared on Facebook and Twitter, introducing the man as the present Nizam of Hyderabad, Prince Azmet Jah.", "Pl listen to the present Nizam of hyderabad and his Frank opinion about ovesi brothers and communists.", "Posted by Sathya Vageeswaran on Tuesday, 21 January 2020", "In the 3 minutes 24 seconds video, the man can be heard saying that no Muslim has ever faced any difficulty in India and they have reached the highest positions in the country. “Prime Minister and Home Minister keep saying that it is only for the infiltrators. The people who are protesting against it, do they want that we should give citizenship to all the terrorists coming in from Pakistan?” he asks.", "Times Now had invited Rizwan Ahmed for a panel discussion that was broadcast on December 20, 2018. The channel identified him as Naseeruddin Shah’s first cousin. Ahmed looks nothing like the man in the viral video. A collage of their photographs juxtaposed together makes it evident that they are different people.", "The video carries a logo of ‘Youth Media TV’. Alt News searched the corresponding YouTube channel and found that the video was posted on January 2, 2020, with the caption “आईआईटी कानपुर में आज लगे नारे,क्या देश का माहौल ख़राब किया जा रहा है? IIT-Kanpur Faiz poem News today” (Translation: Slogans were raised in IIT Kanpur today, is the situation in the country being disturbed? IIT-Kanpur Faiz poem News today).", "A reverse image search of one of the keyframes of the video revealed that the man is Vishva Hindu Parishad (VHP) leader Acharya Dharmendra.", "I was closely involved in the movement, but there was no training or planning-Acharya Dharmendra on Babri sting pic.twitter.com/3w6r7VEvps", "— ANI (@ANI) April 4, 2014", "In 2017, he was sentenced to one-year imprisonment by a Rajasthan court for making a hate speech in November 2008. That same year, Dharmendra again made it to headlines for commenting that a nuclear bomb should be dropped on Pakistan.", "A video of VHP leader Acharya Dharmendra extending support for the CAA is being shared in the name of Naseeruddin Shah’s brother, Rizan Ahmed.", "Donate Now", "Defence Correspondent turned fact-checker. Two times award winning journalist by Govt. of Goa.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]