["About this rating", "A Japanese water company installed two life-sized Spider-Man figurines on its office building, which can be viewed on Google Earth.", "This was not the real Spider-Man.", "Superhero sightings would be welcome news in a year as tumultuous as 2020. TikToker @hidden.on.google.earth asked in a video, \"is this real,\" while zooming in on a building in Google Earth. The TikTok video appeared to show a Spider-Man figure perched atop a building.", "The video itself had no coordinates or identifying location information. Multiple commenters asked \"where is this,\" but no one answered. However, a little bit of digging led us to StreetViewFun.com, which posted: \"Spiderman is here to save Japan.\" The building Spider-Man was seen perched atop in Google Street View was located in the city of Ichinomiya in Aichi Prefecture, Japan.", "The video that showed Google Earth only revealed one Spider-Man, but in fact, two figurines clung to the building.", "Courtesy: Google Maps", "A view of the front of the building revealed a second Spider-Man, which from afar looked to be the character Venom. However, it was not Venom, at least according to a company's website.", "Courtesy: Google Maps", "The two Spider-Man figurines were part of the Mitani Equipment Industry Co., Ltd. building. On the company website, a translation from Japanese said they specialize in \"water supply and drainage equipment, air conditioning equipment, sewerage, etc., mainly in Ichinomiya City, Aichi Prefecture.\"", "We also roughly translated the company's explanation of the two Spider-Man figures:", "The two Spider-Mans are landmarks. Spider-Man on the roof of the company is staring at the Meishin Expressway, which runs right next to him, and is watching over the safety of your traffic. Never stare at it while driving or take a picture with your smartphone. Please try to drive safely today as well. Thank you for your work!", "And the black Spider-Man who climbs the wall in front of the company follows the spider's web that was stretched around and goes to grab the signboard of our company (Mitani Equipment Industry Co., Ltd.). At our company, which constantly pursues new things and takes on challenges without being bound by common sense, we will never forget this playfulness. Please visit us when you pass by.", "The Waygood! blog spotted Spider-Man on the Mitani building, as did Twitter user @nabe_kensuke. The picture on the left was from the company website:", "One Spider-Man can also be viewed on Google Street View from the expressway.", "We previously reported on other purported Google Earth finds, including zombies in Finland, \"Titanic\" in Japan, and a dead body spotted on satellite imagery.", "Jordan Liles is a Senior Reporter who has been with Snopes since 2016.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]