["About this rating", "The myth that a single volcanic eruption puts more CO2 into the atmosphere than all of mankind to date, let alone 10,000 times more, is one of the most pervasive as well as one of the most demonstrably false climatological claims out there. It stems, ultimately, from a geologist named Ian Rutherford Plimer, infamous for writing a widely discredited book titled Heaven and Earth, which attempted to argue that humans have had an insignificant effect on global climate.", "In a 2009 editorial written for Australia’s ABC news, he echoed a sentiment he had argued with similar inelegance in his book by providing the following statement, widely spread nearly word-for-word in climate skeptic circles, without any supporting citation: \"Over the past 250 years, humans have added just one part of CO2 in 10,000 to the atmosphere. One volcanic cough can do this in a day.\"", "This brief statement — a mere 28 words — yields a remarkably dense buffet of spurious claims and outright falsehoods. It also is rife with ambiguity. What numbers is he actually comparing? What is a volcanic “cough”? From a fact-checking standpoint, there are no interpretations of Plimer’s second sentence that can produce a factual assertion. The only way to make the first sentence work is with a scientifically useless comparison. All other interpretations fall well short of reality.", "That useless comparison would be the total mass of carbon dioxide released to the atmosphere by human activity (roughly calculated here by taking the roughly 120 ppm rise in CO2 since pre-industrial times converted into 936.5 gigatons of carbon dioxide gas) compared to the total mass of the entire atmosphere (estimated to be around 5,100,000 gigatons). This yields roughly 1 part post-industrial CO2 rise in 10,000 parts of the entire atmosphere.", "As CO2, in total, makes up only about 0.06% by mass of the atmosphere and 0.04% by volume, this is not exactly revelatory. The question is not about how much other stuff is in the atmosphere. Rather, the question is about how much stuff humans are adding that wouldn't already be in the atmosphere, and, as a result, what the the potential for that amount would be to affect climate — a topic for which there is a wide scientific consensus.", "The erroneous interpretation that many have made from Plimer’s statement would be the assertion that the total amount of carbon released by humanity throughout all time (represented here as gigatons or petagrams of carbon, not carbon dioxide) represents only 1/10,000th (0.01%) of the total mass of carbon dioxide in the atmosphere. These numbers do not check out, even when checked against collected data that ends in the year 2000, according calculations provided by the federally-funded Carbon Dioxide Information Analysis Center:", "According to Houghton and Hackler, land-use changes from 1850-2000 resulted in a net transfer of 154 PgC to the atmosphere. During that same period, 282 PgC were released by combustion of fossil fuels, and 5.5 additional PgC were released to the atmosphere from cement manufacture. This adds up to 154 + 282 + 5.5 = 441.5 PgC, of which 282/444.1 = 64% is due to fossil-fuel combustion.", "Atmospheric CO2 concentrations rose from 288 ppmv in 1850 to 369.5 ppmv in 2000, for an increase of 81.5 ppmv, or 174 PgC. In other words, about 40% (174/441.5) of the additional carbon has remained in the atmosphere, while the remaining 60% has been transferred to the oceans and terrestrial biosphere.", "The 369.5 ppmv of carbon in the atmosphere, in the form of CO2, translates into 787 PgC, of which 174 PgC has been added since 1850. From [...] above, we see that 64% of that 174 PgC, or 111 PgC, can be attributed to fossil-fuel combustion. This represents about 14% (111/787) of the carbon in the atmosphere in the form of CO2.", "A more scientifically valid approach, perhaps, would be to compare annual volcanic emissions fluxes to annual anthropogenic fluxes, as the carbon cycle is an ever-shifting network of sources and sinks of CO2 that need to be accounted for. A 2013 review attempted to estimate the annual contribution of CO2 emitted from all volcanoes (active and passive) and other tectonic sources on Earth per year, coming up with a figure of 540 megatons per year (note that these measurements, unlike the ones above, represent the total mass of CO2 not solely the carbon component):", "[CO2 from the plumes of actively erupting volcanoes]:", "Using the available data from plume measurements from 33 degassing volcanoes we determine a total CO2 flux of 59.7 Mt/yr. Extrapolating this to ~150 active volcanoes produces a total of 271 Mt/yr CO2.", "[CO2 passively vented by active volcanoes]:", "Extrapolation of the measured 6.4 Mt/yr of CO2 emitted from the flanks of 30 historically active volcanoes to all 550 historically active volcanoes produces a global emission rate of 117 Mt/yr.", "[CO2 from other volcanic sources]:", "Perez et al. (2011) calculated the global emission from volcanic lakes to be 94 Mt/yr CO2. The sum of these fluxes produces an updated estimate of the global subaerial volcanic CO2 flux of 474 Mt/yr. Emissions from tectonic, hydrothermal and inactive volcanic areas contribute a further 66 Mt/yr to this total [...], producing a total subaerial volcanic emission of 540 Mt/yr.", "While the authors of this study note that this is an exceedingly rough estimate, they also point out that it is orders of magnitude lower than estimates of the annual flux of CO2 added to the atmosphere through human activity, currently estimated to be around 35,000 Mt/year:", "The global subaerial CO2 flux we report is higher than previous estimates, but remains insignificant relative to anthropogenic emissions, which are two orders of magnitude greater at 35,000 Mt/yr.", "Once again, the actual numbers bear no resemblance to Plimer’s claims. It would have to be a pretty heavy volcanic “cough” from a “single volcano” to, by itself, increase Earth’s annual volcanic CO2 flux by a factor of 65.", "Absurdity notwithstanding, numerous online claims reference specific volcanic eruptions purported to have added more than the total emission of anthropogenic carbon ever released (a value, estimated above, to be more than 282 Gt of carbon). The most commonly cited are the 15 June 1991 eruption of Mt Pinatubo and the 18 May 1980 eruption of Mount St Helens. According to the United States Geological Survey (USGS), Mount St. Helens released 0.01 Gt to the atmosphere and Mount Pinatubo released 0.05 Gt. Put another way:", "There is no question that very large volcanic eruptions can inject significant amounts of carbon dioxide into the atmosphere. The 1980 eruption of Mount St. Helens vented approximately 10 million tons of CO2 into the atmosphere in only 9 hours.", "However, it currently takes humanity only 2.5 hours to put out the same amount. While large explosive eruptions like this are rare and only occur globally every 10 years or so, humanity's emissions are ceaseless and increasing every year.", "A more accurate rendering of Plimer's claim would be something like “3500 Mount St Helens-scale volcanic 'coughs' in a single day might be able to produce as much CO2 as humans have added to the atmosphere through the burning of fossil fuels to date.” Such a headline would be unlikely to have the same effect as the original one, however.", "Cook, John.   \"101 Responses to Ian Plimer's Climate Questions.\"\r\n    Skeptical Science.   9 May 2012.", "Monbiot, George.   \"Ian Plimer's Volcano Claims Vaporise Under Questioning on Australian TV.\"\r\n    The Guardian.   16 December 2009.", "Pilmer, Ian.   \"Legislative Time Bomb.\"\r\n    ABC News [Australia].   13 August 2009.", "Cook, John, et al.   \"Quantifying the Consensus on Anthropogenic Global Warming in the Scientific Literature.\"\r\n    Environmental Research Letters,   15 May 2013.", "Carbon Dioxide Information Analysis Center.   \"Frequently Asked Global Change Questions.\"", "Houghton, Richard A.   \"Carbon Flux to the Atmosphere from Land-Use Changes 1850-2005.\"\r\n    A Compendium of Data on Global Change,   2008.", "Burton, Michael R. et al.   \"Deep Carbon Emissions from Volcanoes.\"\r\n    Reviews in Mineralogy and Geochemistry.  13 February 2013.", "Perez, Nemesio M., et al.   \"Global CO2 Emission from Volcanic Lakes.\"\r\n    Geology.   February 2011.", "Friedlingstein, P. et al.   \"Update on CO2 Emissions\"\r\n    Nature Geoscience.   21 November 2010.", "United State Geological Survey.   \"Volcanoes Can Affect the Earth's Climate.\"\r\n    Accessed 24 March 2017.", "Update [June 29, 2022]: Updated SEO/social.", "Dan Evon is a former writer for Snopes.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]