["The 30-second video was posted in this Twitter post on July 18, 2019 where it has been viewed some 2,800 times.", "Below is a screenshot of the misleading post:", "The video shows a man, woman and child running across a badly eroded bridge as storm waters rush underneath. The bridge then collapses and the three people appear to fall into the river below. The camera then pans to the left and shows a vast expanse of water.", "The caption alongside the post reads “OMG It is very very scary #AssamFloods #AssamIsInPain #Assam.”", "India's Assam state was hit by flooding that killed dozens of people in July 2019.", "The same video as is used in the misleading post was also posted here and here on Twitter, with similar claims it showed an incident in Assam.", "The same video was posted on Youtube on June 17, 2018 and viewed some 25,000 times alongside claims that the footage showed an incident in the southwestern Indian state of Kerala.", "But the claims are all false; the video has actually circulated online since 2017 and shows an incident in Bihar state.", "A reverse image search using keyframes obtained through the InVid video analysis tool led to multiple Indian news organisation reports from August 2017 which used the same video.", "Indian outlet Asian News International (ANI) published this one-minute-and-five-second video report on the incident on its Youtube channel on August 17, 2017, which contains a longer version of the video.", "A clip showing the same incident was also published on news website Quint, which credits ANI.", "The description of the video posted by ANI says: “A shocking incident, in which three people were feared drowned after a bridge connecting a village collapsed, was recorded on camera in Bihar’s Araria district.”", "Below is a comparison of screenshots of the misleading video clip posted on Twitter (L) and the video published by ANI (R):", "An article published on August 18, 2017 on the website of The Hindu, an Indian English-language newspaper, shows the ANI video and says the incident took place in Bihar’s Araria district.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]