["Jeffrey Epstein's connections to former President Bill Clinton and to President Donald Trump have provided the basis for unfounded conspiracy theories about Epstein's death.", "By Angelo Fichera and Saranac Hale Spencer", "Posted on August 15, 2019 | Updated on December 23, 2021", "In the absence of information about how sex offender Jeffrey Epstein managed to die in prison by an apparent suicide on Aug. 10, outlandish conspiracy theories have cropped up across the political spectrum.", "Among the more prominent theories are claims that the Clintons or President Donald Trump is somehow involved. Trump himself shared a comedian’s tweet peddling the baseless suggestion that former President Bill Clinton and former Secretary of State Hillary Clinton were responsible.", "When a reporter asked Trump about that on Aug. 13, the president said he had “no idea” if the Clintons were involved and referenced trips that Bill Clinton had taken on Epstein’s plane.", "It’s true that Clinton had ties to Epstein, a wealthy financier who stood accused of sexually abusing dozens of young girls, and that the former president had traveled on Epstein’s plane. But Epstein had ties to Trump, too, and to other politicians who have been named in recently released court documents.", "The relationships to Clinton and Trump don’t explain Epstein’s death, and the conspiracy theories being used as political weapons are, of course, unsubstantiated. Here’s what we know about those connections.", "Jeffrey Edward Epstein was found unresponsive in his cell at a federal prison in New York at about 6:30 a.m. Aug. 10, according to the Federal Bureau of Prisons, which said life-saving measures were initiated before Epstein was transported to a local hospital and pronounced dead. The Federal Bureau of Prisons deemed the death an “apparent suicide.”", "Epstein was reportedly on suicide watch following a July 23 incident in which he was found semiconscious with marks on his neck, but was taken off suicide watch days before his death. The New York City Chief Medical Examiner’s Office performed an autopsy on Aug. 11, saying in a statement that its determination is still “pending further information.” Update, Aug. 19: The office then said in an Aug. 16 statement that the official cause of death for Epstein was “hanging” and that the manner of death was “suicide.”", "Attorney General William Barr, who said he was “appalled” that the death occurred under the federal prison’s watch, has instructed the FBI and the Justice Department’s inspector general to investigate. He has cited “serious irregularities” at the facility. Members of Congress have also demanded answers.", "A financier who got his start at Bear Stearns, Epstein lived in exorbitant luxury. He reported total assets of $559 million to the court when he was requesting bail in July and owned five lavish properties at the time of his death.", "His primary home was on a private island in the Caribbean, but he also had a six-story mansion assessed at $75 million in New York City, a ranch in New Mexico, a gated house in Palm Beach and an apartment near the Arc de Triomphe in Paris. Before his downfall, Epstein would shuttle a bevy of famous friends between the houses and around the world on his private jet — among them were Prince Andrew, actor Kevin Spacey, former President Bill Clinton and, at least once, President Donald Trump.", "The earliest reference that we were able to find of a connection between Bill Clinton and Epstein was in 1995, when the president was running for reelection. Epstein reportedly attended a fundraising dinner for Clinton in Palm Beach, Florida, with about a dozen other people hosted by wealthy businessman Ronald Perelman.", "The following year, about a month before Clinton’s reelection in November 1996, Epstein gave $20,000 to the Democratic National Committee — it was one of about 450 contributions of that size that the DNC collected from individuals in that two-year election cycle, according to records from the Federal Election Commission. Epstein’s prior political contributions also had favored Democratic candidates or causes (although not exclusively), and he typically gave $1,000 donations.", "Before the next presidential election in 2000, Epstein gave $20,000 to the Democratic Senatorial Campaign Committee, $20,000 to a PAC that supported Hillary Clinton’s bid for the Senate, and $25,000 to another Democratic committee supporting Senate candidates, along with several other smaller contributions.", "By 2002, after Clinton had left office, the former president began to be listed as a passenger on Epstein’s private plane, a fact confirmed by Clinton’s spokesman on Twitter in July. Between Feb. 9, 2002, and Nov. 4, 2003, we counted a total of six trips; two of them were just one-way flights, though. In all, there were a total of 26 flights taken during the six trips, since several trips included multiple stops.", "The flight logs for Epstein’s plane were recently unsealed in a lawsuit brought by one of his accusers.", "Here’s what we found:", "Shortly after Epstein’s death, Trump sowed confusion about Clinton’s use of the plane, saying to reporters:", "Trump, Aug. 13: I know he was on his plane 27 times and he said he was on the plane four times. But when they checked the plane logs, Bill Clinton — who was a very good friend of Epstein — he was on the plane about 27 or 28 times. So why did he say “four times”?", "And then the question you have to ask is: Did Bill Clinton go to the island? Because Epstein had an island that was not a good place, as I understand it. And I was never there. So you have to ask: Did Bill Clinton go to the island? That’s the question. If you find that out, you’re going to know a lot.", "There is no evidence that Clinton visited Epstein’s private island in the Caribbean. None of the flight logs list Clinton as a passenger on a Virgin Islands-bound plane, and the former president’s spokesman said in July that Clinton “has never been to Little St. James Island.”", "The president has also advanced the widely debunked conspiracy theory that the Clintons have killed dozens of their political adversaries — he retweeted a post that included the hashtags #ClintonBodyCount and #ClintonCrimeFamily.", "When the myth-busting website Snopes addressed this conspiracy theory back in 1998, it had already been around for 20 years, according to the Snopes story. So, the conspiracy theory just passed the 40-year mark and keeps growing with new deaths each time someone remotely related to the Clintons dies.", "Recently, we debunked a claim that tried to tie the 2017 suicide of a surgeon to the Clintons. The doctor’s death shared only this thin connection to them: He had worked in Haiti following the devastating 2010 earthquake and co-authored an opinion piece that was critical of the humanitarian response. At the time, Hillary Clinton was secretary of state, and the Clinton Foundation had undertaken some projects to rebuild Haiti. As we wrote, there was no direct connection between the doctor and the Clintons, and the New York City Police Department confirmed that the death was a suicide.", "Earlier in the timeline of the conspiracy theory is the death of Vince Foster, who had worked with Hillary Clinton as a lawyer in Arkansas and was a deputy in the White House counsel’s office during the Clinton administration. Foster killed himself in a park in Northern Virginia in 1993 after telling his sister he was depressed and seeking anti-depressants from his family doctor. Two law enforcement investigations, two congressional inquiries and an investigation led by independent counsel Ken Starr concluded that Foster died by suicide.", "Still, though, the suggestion that Foster was killed by the Clintons persists.", "We asked conspiracy theory researcher Karen Douglas, a social psychology professor at the University of Kent, why certain theories have such staying power. But there isn’t a clear answer.", "“Conspiracy theories are likely to be more successful when they confirm what people want to believe,” Douglas said through email. “They are also likely to be successful if they are interesting/exciting and offer a ‘big’ explanation for a ‘big’ event.”", "In this case, the “‘big’ event” is just a list of people who have had some connection to the Clintons and also died.", "For Epstein, it’s true that he knew the Clintons — he reportedly hosted a dinner party in 2003 to honor Bill Clinton (although Clinton didn’t actually show up), and one of his charities, called The C.O.U.Q. Foundation, gave $25,000 to the Clinton Foundation in 2006 — but there is no evidence linking his death to them.", "Contemporaneous photos and videos dating back nearly three decades depict a social relationship between Trump and Epstein — both of whom owned homes in Palm Beach. Trump bought his Mar-a-Lago estate in 1985, and Epstein purchased his mansion there in 1990.", "A November 1992 video shows Trump and Epstein greeting one another and laughing together while at a party at Mar-a-Lago. The video, unearthed by MSNBC’s “Morning Joe” last month, depicts a more friendly relationship than the one Trump conveyed after Epstein’s July indictment.", "“I knew him like everybody in Palm Beach knew him. I mean, people in Palm Beach knew him. He was a fixture in Palm Beach,” Trump said at the White House on July 9. “I had a falling out with him a long time ago. I don’t think I’ve spoken to him for 15 years. I wasn’t a fan.”", "Trump also spoke more positively about Epstein in 2002, when New York magazine profiled Epstein as an “international moneyman of mystery.”", "“I’ve known Jeff for fifteen years. Terrific guy,” Trump said then. “He’s a lot of fun to be with. It is even said that he likes beautiful women as much as I do, and many of them are on the younger side. No doubt about it — Jeffrey enjoys his social life.”", "Phone numbers for Trump were found in Epstein’s so-called “black book,” which Gawker published in 2015, and the president’s name once appeared on a list of attendees for an Epstein dinner party. Photos from Getty Images show Epstein and Trump together at Mar-a-Lago in January 1997 and again in 2000.", "Such examples of their connection have become social media fodder in the days since Epstein’s death, reminding users of the relationship. Others tried to link the connection directly to Epstein’s death. One liberal Facebook group, for example, shared a screenshot from a 2016 lawsuit by a woman who accused Trump and Epstein of raping her in 1994, with the caption: “This is why Jeffrey Epstein died.”", "That lawsuit, which was originally filed in California in April 2016 by a woman using the pseudonym Katie Johnson and later filed in New York, alleged that she was sexually abused at age 13 by both Trump and Epstein at a series of parties at Epstein’s home in Manhattan. Trump in a 2016 statement denied those claims to RadarOnline.com: “The allegations are not only categorically false, but disgusting at the highest level and clearly framed to solicit media attention or, perhaps, are simply politically motivated. There is absolutely no merit to these allegations. Period.”", "The woman dropped her lawsuit on Nov. 4, 2016, four days before the 2016 presidential election. She shared her story the same day in an interview with DailyMail.com, claiming she was first brought to the Epstein residence by a woman she met in New York who promised to help her pursue a modeling career. The claims were never proven.", "Some of the recent explosive allegations against high-profile figures in the Epstein case were made public the day before Epstein’s death — and they stemmed from records (including Epstein’s flight logs) filed in a court case involving a woman who said she was introduced to Epstein while working at Trump’s Mar-a-Lago.", "Virginia Giuffre sued Epstein’s longtime associate, Ghislaine Maxwell, in 2015 for defamation before settling in 2017. In court filings, Giuffre has said she was underage and working at Mar-a-Lago when she was recruited by Maxwell to provide massages and sex to Epstein; in a 2016 deposition, Giuffre said she never witnessed Trump having sex with underage women.", "The flight logs showed that Trump flew on Epstein’s plane at least once — from Palm Beach to Newark, New Jersey, in January 1997.", "There are unconfirmed reports that Trump “banned” Epstein from Mar-a-Lago at some point, but the precise details of Trump and Epstein’s “falling out,” as Trump has called it, aren’t clear. The Washington Post recently reported on a 2004 feud between the two over a waterfront mansion in Palm Beach. Trump eventually outbid Epstein at an auction for the property — not long before a local police investigation into Epstein began.", "For more about claims we’ve debunked relating to Epstein’s death, see “Misinformation Flows Following Epstein’s Death.”", "Update, Nov. 30: Business Insider has compiled a database with information on 2,618 flights made by Epstein’s planes between 1995 and July 6, 2019, including newly released flight records from the Federal Aviation Administration. The new flight records don’t include passenger information, though, so we don’t know who was traveling on Epstein’s planes.", "Update, Dec. 23: Additional flight logs became public during the trial of Epstein’s former girlfriend Ghislaine Maxwell. They showed that Trump had taken four trips on Epstein’s plane in 1993 and he had taken one trip each in 1994, 1995 and 1997. None of the flights were to Epstein’s island.", "“Epstein & Trump At Mar-A-Lago.” Getty Images. 1 Jan 1997.", "“Trump, Knauss, Epstein, & Maxwell At Mar-A-Lago.” Getty Images. 12 Feb 2000.", "“Inmate Death at the MCC New York.” Press release, Federal Bureau of Prisons, U.S. Department of Justice. 10 Aug 2019.", "“Inside a 1992 party with Trump, Jeffrey Epstein.” MSNBC. 17 Jul 2019.", "Jane Doe v. Donald J. Trump and Jeffrey E. Epstein. U.S. District Court, Southern District of New York. Complaint. 1:16-cv-07673-RA. 3 Oct 2016.", "“Jeffrey Epstein Charged In Manhattan Federal Court With Sex Trafficking Of Minors.” Press release, U.S. Attorney’s Office for the Southern District of New York. 8 Jul 2019.", "Katie Johnson v. Donald J. Trump and Jeffrey E. Epstein. U.S. District Court, Central District of California. Complaint. 5:16-cv-00797-DMG-KS. 26 Apr 2016.", "Parry, Ryan. “EXCLUSIVE: Trump’s 13-year-old ‘rape victim’ dramatically DROPS her case.” DailyMail.com. 4 Nov 2016.", "Reinhard, Beth, et. al. “Donald Trump and Jeffrey Epstein partied together. Then an oceanfront Palm Beach mansion came between them.” Washington Post. 31 Jul 2019.", "“Remarks by President Trump and Amir Al Thani of the State of Qatar Before Bilateral Meeting.” WhiteHouse.gov. 9 Jul 2019.", "“Remarks by President Trump Before Air Force One Departure.” WhiteHouse.gov. 13 Aug 2019.", "“Statement from Attorney General William P. Barr on the Death of Jeffrey Epstein.” Press release, U.S. Department of Justice. 10 Aug 2019.", "Thomas Jr., Landon. “Jeffrey Epstein: International Moneyman of Mystery.” New York magazine. 28 Oct 2002.", "Federal Election Commission. Individual contributions — Jeffrey Epstein. Accessed 14 Aug 2019.", "Ureña, Angel (@angelurena). “Statement on Jeffrey Epstein.” Twitter. 8 Jul 2019.", "Flight logs for Jeffrey Epstein. Nov. 1995 – Aug. 2013.", "Fichera, Angelo. “False Story Ties Clintons to Doctor’s Death.” FactCheck.org. 18 May 2018.", "Office of Independent Counsel. Report on the Death of Vincent W. Foster, Jr. 10 Oct 1997.", "Douglas, Karen. Professor of social psychology, University of Kent. Interview with FactCheck.org. 14 Aug 2019.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]