["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "As chair of the House Intelligence Committee, U.S. Rep. Adam Schiff, D.-Calif, has had an outsized presence in the Democrats’ impeachment inquiry, drawing disparaging comments from President Donald Trump and some of Trump’s supporters.", "A recent Facebook post mocking Schiff claims that he’s tied to George Soros, the wealthy and, in some quarters, often vilified Democratic fundraiser.", "\"You can’t make this up,\" reads the text over photos of Soros, Schiff, a woman identified as \"Melissa Schiff Adam’s sister,\" and a man identified as \"Robert Soros son of Geroge Soros; married to Adam Schiff’s sister.\"", "This post, published to Facebook on Oct. 7, was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Because you actually can make this up.", "The photos are genuine, and it’s true that Robert Soros is George Soros’s son. He also married a woman named Melissa Robin Schiff in May 1992. In September 2017, the New York Post reported that they were estranged and divorcing.", "But Melissa Schiff is not Adam Schiff’s sister. The wedding announcement that ran in the New York Times back in 1992 identifies her parents as Marlene Schiff and Haskel Schiff, both of New York.", "Adam Schiff was born to Edward and Sherrill Schiff in Framingham, Mass., according to this 2017 U.S. News & World report article. The Jewish Journal reported that year that Schiff was the youngest of two sons born to the couple.", "Claims about Schiff’s connection to Soros have been swirling since at least early last year. Back then, the congressman told FactCheck.org that he has just one sibling — his brother — and has no known family relationship to Melissa Schiff.", "We rate this Facebook post Pants on Fire.", "Facebook post, Oct. 7, 2019", "NPR, Adam Schiff, the surprising face of the impeachment inquiry tinto President Donald Trump, Oct. 10, 2019", "New York Times, How vilification of George Soros moved from the fringes to the mainstream, Oct. 31, 2018", "New York Post, Soros kid’s divorce may cost him his art collection, Sept. 6, 2017", "New York Times, Weddings; Melissa Schiff, Robert D. Soros, May 24, 1992", "U.S. News & World Report, 10 things you didn’t know about Adam Schiff, April 10, 2017", "Jewish Journal, The making of Adam Schiff: Why is this man taking on the president, April 12, 2017", "FactCheck.org, Adam Schiff and George Soros not in-laws, Feb. 8, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]