["About this rating", "Who is the greatest basketball player of all time? According to a social media posts from December 2018, former Chicago Bulls superstar Michael Jordan settled the debate once and for all when he stated that \"LeBron James is the GOAT [greatest of all time] in my eyes\":", "I see a lot of people saying \"Zion Williamson is the next LeBron James\" I don't see it to be honest. In my opinion, there will NEVER be another LeBron James, he's one of a kind. The combination of being 6'8\" 250+ pounds, running faster than a deer, having athleticism off the charts, the highest basketball IQ, being the best leader ever, crazy court vision, one of the best passers of all time, a rebounder, an elite defender AND possess the ability to score 30 or more in his sleep are attributes that won't be duplicated in a player ever again. LeBron James is the GOAT in my eyes.", "This is not a genuine quote from former NBA standout Michael Jordan.", "Fans, pundits, and former players have argued the \"GOAT\" question ad nauseam since James took his talents to the NBA's Cleveland Cavaliers in 2003, so if Jordan had truly called James \"the GOAT,\" this quote likely would have been splashed across the home pages of sports-themed websites at the time.", "For example, when Jordan starred in a commercial touting a match-up between GOAT contenders of a different sport, football stars Aaron Rodgers and Tom Brady, the October 2018 promotion (as well as James' response to it) was covered by ESPN, the Washington Post, and men's magazine GQ. Yet we were unable to find mention of the putative Jordan quote about LeBron James reported by any credible news outlet.", "We have not been able to determine who created this fabricated quote, but the meme originally  claimed that Jordan made these comments in an article published on the Bleacher Report website. Our search of that site yielded no results for this statement, however.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]