["About this rating", "A years-old satirical article reporting that a woman named Gladys Baker Morris had filed a paternity action lawsuit alleging she was the biological daughter of President John F. Kennedy and Marilyn Monroe recirculated online in October 2018 after it was picked up by disreputable websites such as Newsline.com:", "A 56-year-old woman has presented a paternity action lawsuit this morning before the California state court, alleging that she is the biological daughter of Marilyn Monroe and former President of the United States, John Fitzgerald Kennedy.", "Gladys Baker Morris spent most of her life believing that Marilyn Monroe’s cousin, Meredith Baker, was her biological mother.", "In March 2014, while on her deathbed, her “mother” told her that she had actually been adopted and that her biological parents were incredibly famous.", "“My mother confessed to me on her deathbed, that my real mother was in fact, Marilyn Monroe,” Ms. Morris told reporters. “She told me that Marilyn was afraid that the Kennedy brothers would have her and her baby killed if they learned of her pregnancy, so my mother had given birth in secret and hidden me away as soon as I was born.”", "This was not a genuine news story but rather a verbatim reproduction of a junk news article originally published on the notorious World News Daily Report website back in February 2016. Since then, this article has been rehashed or outright plagiarized by a number of dubious publications, such as Your News Wire, The Unknown But Not Hidden, Underground Science, and Now 8 News.", "The woman pictured above is not Gladys Morris Baker, nor did she file a lawsuit claiming that she was the daughter of Marilyn Monroe and JFK. This woman is actually Susan Griffiths, a professional Marilyn Monroe impersonator who has appeared in numerous films and TV shows as the iconic actress:", "As World News Daily Report states in their disclaimer, all of their content is \"entirely fictional and any resemblance between them and any persons, living, dead, or undead is purely a miracle.\"", "World News Daily Report.   \"Woman Claims She Is the Daughter of Marilyn Monroe and JFK.\" \r\n    22 February 2016.", "Stern, Carly.   \"Meet the 50-Year-Old Marilyn Monroe Lookalike Who Has Made $4 MILLION Impersonating the Buxom Blonde Bombshell in Movies, TV Shows, And Ads.\" \r\n    Daily Mail.   1 October 2015.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]