["About this rating", "On 27 January 2016, Newslo published an article about the #OscarsSoWhite controversy, claiming that blogger Bristol Palin said that Oscar nominations excluded people of color because all black people look alike:", "Abstinence advocate and culture war blogger Bristol Palin recently lashed out at black actors who have complained that the slate of nominees for this year’s Oscars were all white. In a blog post on Tuesday, Palin said she agreed with Fox News contributor Stacey Dash’s opinion that both Black History Month and the BET network should not exist as special privileges for the black community.", "“Stacey Dash couldn’t be more right,” Palin commented on her post. “What more do black people want? They complained about slavery – we abolished it. They complained about oppression in the 60’s – we made sure there was no more of it. Then they started bitching about how America has never had a black president – we gave them Obama. Now they’re trying to make it look like we’re intentionally depriving them of money and fame. I mean, come on, people! You’ve got drug dealers, you’ve got rap and hip-hop singers, you’ve got just as much money as white people, and not to mention, your numbers are growing. It seems to me like we ought to be complaining about you, not the other way around! ... even if there were black actors who are good enough” to be nominated for an Academy Award, “it’d be too difficult to choose one, since they all look alike.” “How do you tell apart Lawrence Fishburne from Samuel L. Jackson? You don’t! At least I can’t. I mean, if I didn’t know any better, I’d think Sam Jackson played Morpheus in the Matrix Trilogy. So, don’t be talking about the Oscars when you clearly don’t deserve one.”", "The material in the first paragraph referenced an actual post on Bristol Palin's Patheos blog (titled \"Rappers Agree with Stacey Dash\"). Palin wrote:", "We shouldn’t segregate ourselves or limit Black History Month to one month a year. I wish things were really colorblind… I don’t know what we can do as a society to come together as one.", "Ss far as what I have seen about the #OscarSoWhite Controversy, it seems Jada Smith started it because her husband wasn’t getting nominated. I don’t know how other people think about it, but I hope my son sees early on – that not everyone gets a trophy.", "The fact that the first part was real led readers to believe that the subsequent content was also legitimate. However, the first paragraph of the Newslo article was the only portion that wasn't fabricated.", "Articles on the self-styled \"hybrid\" news site Newslo (and related sites Religionlo and Politicalo) take controversial news items and then add attention-grabbing embellishments. Newslo and related sites' pages maintain an interactive feature allowing readers to \"Show Facts\" or \"Hide Facts\":", "All Newslo, Politicalo, and Religionlo articles are by default rendered in \"Hide Facts\" mode, concealing the highlighted fabrications from readers. In addition to the \"Show Facts/Hide Facts\" feature, Newslo's disclaimer admitted:", "Newslo is the first hybrid News/Satire platform on the web. Readers come to us for a unique brand of entertainment and information that is enhanced by features like our fact-button, which allows readers to find what is fact and what is satire.", "Previous Newslo, Religionlo, and Politicalo articles that prompted similar social media confusion included items claiming Marco Rubio said women should be placed in custody if it was suspected they were considering an abortion (and that Zika was a punishment from God), Pat Robertson said gay people should wear specific colors by which heterosexual people could visually identify them, Pastor John Piper decreed bikini waxes a sin in the eyes of God, David Bowie was alive but held hostage by operatives of Satan, Ted Cruz said God would not have allowed Antonin Scalia to die at a time that was potentially not politically dicey, and a Republican lawmaker proposed saliva-based \"hunger tests\" for food stamp recipients.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]