["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "This Facebook post wrongly claims that a Pepsi employee contaminated the company's products.", "Sifting through the family photos, news stories, \"personal news\" and scams that populate our social media accounts is not for the faint-hearted, or for people trying to cut down on screen time. Among the updates from friends and hot takes from pundits, there are often grim, fear-mongering warnings that are just, well, wrong.", "\"There’s news from the police,\" reads one such Facebook post from Jan. 9. \"Its (sic) an urgent message for all. For the next few weeks please do not drink any product from PEPSI like Pepsi, Tropicana juice, Slice, 7up etc. A worker from the company has admitted that he added his blood contaminated with AIDS. Watch MDTV. It was on yesterday on Sky News. Please forward and warn others too.\"", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "\"This is false,\" PepsiCo said in an email after PolitiFact wrote seeking more information about the claim.", "Sky News did not respond to an email asking if the network had aired a segment, like the Facebook post claims, but we couldn’t find any evidence of such a story on its website. In fact, we couldn’t find any credible articles about this so-called \"urgent message.\"", "But for what it’s worth: You can’t get HIV from consuming food handled by someone with HIV, according to the Centers for Disease Control and Prevention. \"Even if the food contained small amounts of HIV-infected blood or semen, exposure to the air, heat from cooking, and stomach acid would destroy the virus.\"", "We rate this claim Pants on Fire!", "Facebook post, Jan. 9, 2019", "Email correspondence with Gina Anderson, PepsiCO, Jan. 18, 2019", "Centers for Disease Control and Prevention, HIV Transmission, visited Jan. 22, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]