["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "James O’Sullivan, a special agent with the Georgia Bureau of Investigation, died at his home in Metter, Ga., on Dec. 14.", "His obituary did not say a cause of death. But online, some social media users are spreading unfounded conspiracy theories that he was killed in connection with the presidential election.", "\"They k_nock_ed him off for investigating the Georg!a e1ect!on$,\" one Facebook post said.", "\"Do you all remember Georgia Gov. Kemp’s daughter’s boyfriend who died in the car crash the day after Kemp called for a signature audit in Georgia?\" another post said. \"Do you all remember the death of his daughters boyfriend was under investigation by the Georgia Bureau of Investigation? Well the lead investigator, James O’Sullivan just died Monday of an ‘apparent suicide’ in his home. THE INVESTIGATOR IS DEAD… of an ‘apparent suicide.’\"", "These posts were flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "We’ve already looked into another claim related to the person the second post described as \"Kemp’s daughter’s boyfriend.\"", "Harrison Deal — a campaign staffer for Sen. Kelly Loeffler, R-Ga., and a close friend of Georgia Gov. Brian Kemp’s daughter — died in a traffic collision on Dec. 4.", "A spokesperson for the police department in the town where Deal died said a flatbed truck struck his vehicle from behind, causing him to hit another vehicle and catch fire. Social media posts claimed without evidence that President-elect Joe Biden had Deal murdered because Kemp had called on the Georgia secretary of state’s office to conduct a signature audit of ballots there.", "The coroner in Candler County, where Metter is located, told NBC News affiliate WSAV on Dec. 17 that O’Sullivan’s death remains under investigation.", "But we found nothing to support the claims that he was killed because of that investigation, or the election.", "And O’Sullivan wasn’t investigating Deal’s death, according to the Georgia Bureau of Investigation.", "\"There is no GBI investigation,\" the agency said on Twitter. \"No GBI agent or GBI regional investigative office is investigating.\"", "On Dec. 16, the bureau addressed the allegations about O’Sullivan’s death on Twitter.", "\"A GBI agent passed away this week and there are online rumors that it was somehow connected to the election,\" the bureau said. \"This baseless claim is irresponsible & reckless. It is hurtful to the agent’s family and co-workers. Please be mindful of the things you write, repeat, or share — especially when there is absolutely no truth in them.\"", "We rate this Facebook post False.", "This fact check is available at IFCN’s 2020 US Elections #Chatbot on WhatsApp. Click here, for more.", "Facebook post, Dec. 16, 2020", "Facebook post, Dec. 17, 2020", "James O’Sullivan obituary, Dec. 17, 2020", "PolitiFact post, Police say Loeffler aide died in a traffic collision, Dec. 8, 2020", "Georgia Bureau of Investigation tweet, Dec. 16, 2020", "Georgia Bureau of Investigation tweet, Dec. 17, 2020", "WSAV, Baseless election theories shadow death of local GBI agent, Dec. 17, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]