["A video of a young girl is presently being circulated on social media. It is claimed that this video is of the 8-year old who was raped and murdered in Kathua, Jammu in January, and that this is her last video before she was killed. The video has been posted below.", "A number of users on Facebook have shared this video believing the girl in the video is the Kathua victim. She is reciting a poem, ‘suna tha behad sunehri hai Dilli…’", "Apart from Facebook, this video has also been posted and shared by users on Twitter. It has also been uploaded by multiple users on YouTube.", "It turns out that this video is NOT of the Kathua victim. In fact, this video had first been uploaded in July 2017. The Kathua victim had been killed in January 2018. The video of this young girl was first uploaded by Imran Pratapgarhi, who is a poet. Pratapgarhi had written the poem that is being recited by this girl in the video. He himself had uploaded it on his Facebook page on July 18, 2017.", "After this video became viral in the last couple of days, Pratapgarhi posted a clarification on his Facebook page in which he said that this girl in the video is not the Kathua victim, and that this video had been sent to him by a fan through WhatsApp, which he had subsequently posted on his Facebook page. Pratapgarhi added that this poem had been written in memory of Najeeb Ahmed, a JNU student who went missing in 2016.", "18 July 2017 को मैंने इस नन्ही सी फैन की ये वीडियो पोस्ट की थी, इसे उस वक्त मेरे किसी चाहने वाले ने व्हाट्सअप पर भेजा…", "Posted by Imran Pratapgarhi on Sunday, April 15, 2018", "The Kathua rape and murder case has shaken the conscience of the nation. In such a scenario, such videos seek to emotionally manipulate social media users who are advised to be circumspect and to try to verify the authenticity of such posts.", "Donate Now", "Arjun Sidharth is a writer with Alt News. He has previously worked in the television news industry, where he managed news bulletins and breaking news scenarios, apart from scripting numerous prime time television stories. He has also been actively involved with various freelance projects. Sidharth has studied economics, political science, international relations and journalism. He has a keen interest in books, movies, music, sports, politics, foreign policy, history and economics. His hobbies include reading, watching movies and indoor gaming.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "Amid the ongoing Israel-Palestine conflict, media outlet Times Now put out a report claiming that…", "A 45-second video clip is being shared widely on social media where a group of…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…"]