["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Math and English are part of the Common Core standards for public schools.", "In June 2010, Wisconsin became one of the first states to adopt Common Core, a set of national education standards for English and math. Over time, nearly every state jumped aboard. Not much controversy.", "But more recently, Common Core has come under attack from conservatives around the country. U.S. Senate Republicans, for example, tried in April 2013 to kill federal funding for the program, calling it an interference with local control of public schools. In Wisconsin, GOP state lawmakers set hearings to review the standards; the next is Oct. 30, 2013.", "At the first hearing, on Oct. 3, 2013, state schools superintendent Tony Evers -- the official who decided Wisconsin would adopt Common Core -- told a reporter that the pushback in Madison and elsewhere \"is all about what's going on in Washington. It's all about controlling the message and the next (presidential) election.\"", "The same day, state Rep. Sondy Pope (D-Cross Plains) took a break from the hearing to defend Common Core on \"The Devil's Advocates\" talk show on WXXM-FM (92.1) in Madison.", "Asked whether Common Core means schools are forced to teach children based on \"federalized standards,\" Pope said, \"absolutely not.\"", "\"This is not from the federal government. This is not ‘ObamaCore.,’\" she said. \"This came straight from the (National) Governors Association, of which (Gov. Scott Walker) is a member, and the state school chiefs -- the superintendents -- association, absolutely separate from anything that the federal government was doing.", "\"They do not have their fingerprints on this thing at all.\"", "Is Pope right that Common Core didn’t come from the federal government and that federal officials don’t have their fingerprints on it?", "Common Core and its origins", "Adopted by 45 states, the Common Core State Standards came out of years of discussion between private nonprofit groups and state education departments. The goal: to better prepare students for college and careers and ensure that students in different states learn the same academic concepts.", "In Wisconsin, the standards will be aligned with a new standardized test that will roll out in 2014.", "Common Core’s website explicitly states that the federal government was not involved in developing the standards. And there is other evidence to support that.", "As PolitiFact Florida has noted, the Council of Chief State School Officers -- a national organization of public officials who head state education departments -- discussed developing common standards during its annual policy forum in 2007, a year before Barack Obama won the presidency. In 2009, the council and the National Governors Association agreed to create the Common Core State Standards, developed them with the help of teachers, parents, and experts, and unveiled them in 2010.", "So, Pope is accurate on the first part of her claim, that Common Core did not come from the federal government.", "Federal involvement", "PolitiFact Florida also addressed the second part of Pope’s claim -- that federal officials \"do not have their fingerprints\" on Common Core. Our colleagues found that, although Common Core is voluntary for states to adopt, the federal government has had a role in encouraging them to adopt the standards.", "To get grants from Race to the Top -- Obama’s signature education program -- or waivers from the mandates of No Child Left Behind -- an education reform law adopted under President George W. Bush -- states have to prove they have standards to prepare students for college and work. They don’t have to adopt the Common Core Standards, but that works as one way to qualify for grants or waivers.", "There was a rush by states to adopt Common Core by August 2010 because establishing standards won them points in the competition for a share of the billions in Race to the Top grants.", "Tom McCarthy, a spokesman for Pope, acknowledged \"there really wasn’t a credible alternative to Common Core\" at the time.", "So, the federal government didn’t force Common Core on the states, but it did create incentives for states to adopt the standards.", "Our rating", "Pope said: Common Core \"is not from the federal government,\" they \"do not have their fingerprints on this thing at all.\"", "Federal officials did not initiate the state standards for public schools or force them on the states. But they have given states financial incentives to adopt the standards.", "For a statement that is accurate but needs clarification, we give Pope a Mostly True.", "If you would like to comment on this item, you can do so on the Journal Sentinel’s web page.", "WXXM-FM,  \"The Devil's Advocates\" show interview (quote at 5:30) of state Rep. Sondy Pope, Oct. 3, 2013", "Interview and email interview, state Rep. Sondy Pope spokesman Tom McCarthy, Oct. 4 and 22, 2013", "Interview and email interview, Cato Institute Center for Educational Freedom associate director Neal McCluskey, Oct. 7 and 21, 2013", "Email interview, Bellwether Education Partners co-founder and partner, Andrew Rotherham, Oct. 6, 2013", "Milwaukee Journal Sentinel, \"Wisconsin hearing repeats debate over Common Core school standards,\" Oct. 3, 2013", "Wisconsin Department of Public Instruction, news release, June 2, 2010", "Wisconsin Department of Public Instruction, Superintendent Tony Evers letter, Aug. 16, 2010", "PolitiFact Georgia, \"Common Core opponent goes too far with claim about data collection,\" June 17, 2013", "PolitiFact Florida, \"Rick Santorum says Barack Obama wants to 'nationalize curriculum,'\" Aug. 30, 2012", "Common Core State Standards Initiative, \"Frequently asked questions\"", "USA Today, \"Common Core standards drive wedge in education circles,\" May 1, 2012", "Washington Post, \"Common Core Standards attacked by Repubicans,\" April 19, 2013", "Interview, Wisconsin Department of Public Instruction Common Core State Standards team director Emilie Amundson, Oct. 22, 2013", "New York Times, \"Many states adopt national standards for their schools,\" July 21, 2010", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]