["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Moderna has applied for emergency use authorization from the FDA for its vaccine against COVID-19.", "Neither the Trump administration nor the incoming Biden administration has announced plans to make the vaccine mandatory, if the vaccine is authorized.", "States, not the federal government, have the general authority over vaccination laws.", "A Facebook post about Moderna’s COVID-19 vaccine is filled with falsehoods.", "The Dec. 8 post alleges that infectious disease expert Dr. Anthony Fauci, Microsoft co-founder Bill Gates, billionaire George Soros, and the late financier and convicted sex offender Jeffrey Epstein are all connected to Moderna Inc.", "Moderna is a Massachusetts-based biotech company that’s developing a vaccine against COVID-19. But none of the alleged connections mentioned in the post are true. We rated that aspect of the claim Pants on Fire, when it surfaced in a separate post in August.", "The August and Dec. 8 posts also claim that \"if all goes ‘well’ it'll become federal law to get the vaccine.\" Is that part true? No.", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Moderna at the end of November said it would ask the U.S. Food and Drug Administration to grant emergency use authorization for its vaccine, based on Phase 3 study data indicating that the vaccine was 94.1% effective against COVID-19.", "The company itself has no authority to make its vaccine mandatory. The Trump administration has not said it would make any COVID-19 vaccine mandatory. President-elect Joe Biden has not said he would mandate it either.", "The federal government has invested more than $9 billion in vaccine deals with multiple private companies. The agreements vary in scope; some are only for the purchase of vaccines, others provide funding for the research, manufacturing and purchase of vaccines. But the messaging from the Trump administration so far has been about voluntary vaccination. A report from the U.S. Health and Human Services Department talks about \"ensuring that every American who wants to receive a COVID-19 vaccine can receive one.\"", "Dr. Anthony Fauci, the director of the National Institute of Allergy and Infectious Diseases and a member of the White House Coronavirus Task Force, was asked at a town hall in August if he’d support a nationwide mandate of a COVID-19 vaccine.", "\"No, definitely not,\" said Fauci, who has accepted an offer by the Biden administration to stay on in his director role and act as a White House medical adviser. \"You don't want to mandate and try and force anyone to take a vaccine. We’ve never done that. You can mandate certain groups of people, like health care workers, but for the general population you can’t. … We don't want to be mandating from the federal government to the general population. It would be unenforceable and not appropriate.\"", "ABC News’ George Stephanopoulos asked Biden during an October town hall if he would mandate that people take a COVID-19 vaccine. Biden said it would depend, but offered that, \"I would think that we should be talking about — depending on the continuation of the spread of the virus, we should be thinking about making it mandatory.\" He then noted that such a mandate would not be enforceable.", "Biden has since taken an unequivocal stance against requiring it. When a reporter asked Biden on Dec. 4 if a COVID-19 vaccine should be mandatory, Biden replied, \"No, I don't think it should be mandatory. I wouldn't demand it to be mandatory, but I would do everything in my power, just like I don't think masks have to be made mandatory nationwide.\"", "Biden said he’d do everything in his power as president of the United States to \"encourage people to do the right thing.\" He takes office Jan. 20.", "A May 2019 report from the Congressional Research Service says that federal authority on vaccinations is limited. It is the states that have the general authority, within constitutional limits, to enact laws requiring vaccination. All 50 states and the District of Columbia, for example, have laws requiring certain vaccines for students, though such laws allow some exemptions.", "Based on the principles of federalism, the Supreme Court has interpreted the 10th Amendment as preventing the federal government from commandeering or requiring states to carry out federal duties. \"In the context of vaccination, this principle prevents Congress from requiring states or localities to pass mandatory vaccination laws,\" the report said. The federal government, however, could provide incentives to states to enact vaccination laws.", "A Facebook post about Moderna’s COVID-19 vaccine said, \"if all goes ‘well’ it'll become federal law to get the vaccine.\"", "Moderna has applied for emergency use authorization from the FDA for its vaccine against COVID-19. But neither the Trump administration or the incoming Biden administration has announced plans to make the vaccine mandatory, if the vaccine is authorized. There is no indication the federal government intends to mandate vaccination against COVID-19; in fact, leaders in both administrations have said they oppose it.", "Finally, states, not the federal government, have the general authority over vaccination laws.", "We rate the post False.", "RELATED: Fact-checking Facebook post comparing COVID-19 vaccine research to HIV, cancer, common cold", "Facebook post, Dec. 8, 2020, archived version https://archive.is/sF8q7", "Moderna, Moderna Announces Primary Efficacy Analysis in Phase 3 COVE Study for Its COVID-19 Vaccine Candidate and Filing Today with U.S. FDA for Emergency Use Authorization, Nov. 30, 2020", "Congressional Research Service, An Overview of State and Federal Authority to Impose Vaccination Requirements, May 22, 2019", "HHS.gov, From the Factory to the FrontlinesThe Operation Warp Speed Strategy for Distributing a COVID-19 Vaccine", "Rev.com, Joe Biden Speech on 2020 Job Numbers & Economy Transcript, Dec. 4, 2020", "C-SPAN, Dr. Fauci Discusses the Pandemic with George Washington University, Aug. 19, 2020", "CNN Transcripts, Interview with President-Elect Joe Biden and Vice President- Elect Kamala Harris. Aired 9-10p ET, Dec. 3, 2020", "Twitter, @Todayshow tweet, Dec. 4, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]