["On May 1, Prime Minister Narendra Modi held a rally at Udupi in Karnataka, one among the 21 rallies he is scheduled to hold in the state ahead of voting for the assembly election on May 12. As part of the campaign blitzkrieg, PM Modi’s supporters erupted on social media, posting a video of the Prime Minister’s road show in Udupi, asserting there is a wave of support in his favour among the people of Udupi and Karnataka in general. The video shows heavy turnout and an enthusiastic and charged up crowd welcoming the Prime Minister as he rallies through the town. Among those who shared this video was Bharat Raut, BJP office bearer from Maharashtra, calling it ‘Modi magic’.", "Udupi, Karnataka just now. See the Modi Magic pic.twitter.com/bJBmoqR1Az", "— Bharat Raut (@BharatRaut_BJP) May 3, 2018", "Update: Ashoke Pandit, filmmaker and vocal supporter of PM Modi too had posted this video on May 3 but has now deleted it.", "@narendramodi Magic. #KarnatakaElection2018 pic.twitter.com/tUEmHKRRlu", "— Ashoke Pandit (@ashokepandit) May 3, 2018", "A number of right-wing handles on Twitter have shared this video on their timelines. One Twitter user Pawan Durani who is followed by PM Modi on the platform also tweeted this video. Social media users on Facebook too shared it as PM Modi’s road show in Udupi. Among them was Anil Sharma, former BJP MLA from Delhi.", "Here again, the manner in which the video has been shared on social media i.e. via uploads by individual users suggests that this video claimed to be of Udupi may be circulating on WhatsApp. The battle of Karnataka is heating up with political parties in the fray utilising social media to the hilt in an attempt to build favourable opinion. PM Modi’s enthusiasts have gone overboard on this occasion. The video in question is NOT from Udupi, Karnataka.", "Alt News did a frame-by-frame analysis of the video shared as that of Udupi. In one of the frames, a signboard can be seen which says ‘Royal Sarees/M C Sarees’.", "Through a simple Google search, we found ‘M C Sarees’ is a shop located in Madanpura, Varanasi. We used Google videos with the key words “Varanasi ‘road show’ Modi Madanpura” and the search results threw up a number of videos. One of these videos has been posted below.", "In the video posted above, it can be seen that PM Modi is handed a bouquet a flowers after which a hat is flung at him, which he then dons. The same set of events also occur in the video currently viral as that of Modi’s rally in Udupi. In this second video of March 4, 2017 posted above, the signboard of ‘M C Sarees/Royal Sarees’ can also be seen in the background.", "Such instances of videos taken out of context and presented with a false claim is a tried and tested tactic on social media. A wave is sought to be manufactured in favour of a party or leader through optics by portraying huge turnout and support on social media platforms. Whether this tactic works electorally is an open question, but that has not prevented political parties from trying to influence voters and citizens in this manner, as can be seen in this instance where a one-year old video of PM Modi’s rally in Varanasi is presented as political support in Udupi in 2018.", "Donate Now", "Arjun Sidharth is a writer with Alt News. He has previously worked in the television news industry, where he managed news bulletins and breaking news scenarios, apart from scripting numerous prime time television stories. He has also been actively involved with various freelance projects. Sidharth has studied economics, political science, international relations and journalism. He has a keen interest in books, movies, music, sports, politics, foreign policy, history and economics. His hobbies include reading, watching movies and indoor gaming.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]