["A television ad criticizes Nevada Democratic Senate candidate Catherine Cortez Masto for using her position as the state’s attorney general to benefit her \"special-interest allies.\"", "Freedom Partners Action Fund, which is backed by the Koch Brothers, is spending $1 million on ads attacking Cortez Masto over a deal she made with Washington, D.C., law firm Cohen Milstein to represent the state in 2009.", "\"Lost homes, lost jobs, lost hope — the housing crisis hit Nevada hardest. But during the crisis, Catherine Cortez Masto gave a sweetheart contract worth millions to a D.C. law firm, that then donated thousands to her political campaigns,\" the ad says.", "The ad itself is mostly accurate in describing an arrangement with an out-of-state law firm taking in millions of dollars it won in fighting court cases on behalf of Nevada, while the state’s attorney general received around $2,600 in campaign donations from several of the firm’s lawyers.", "But there are a few layers of context that need to be unpacked.", "Contingency fees", "Cortez Masto has focused her 2016 Senate campaign on her response to the foreclosure crisis. She touts her involvement with large settlements totalling around $1.9 billion for Nevada homeowners suffering after the 2008 economic recession.", "She wasn’t working alone. While she was attorney general, she arranged an agreement with a powerful Washington, D.C., law firm, Cohen Milstein, in 2009 to assist on deceptive lending practice litigation.", "The ad takes issue with the contract’s structure — Cohen Milstein would be paid with a contingent fee, only awarded if a settlement they helped litigate was reached.", "Many states, including Nevada, take advantage of these contracts because they don’t require up-front costs and allow overworked or understaffed state attorneys to bring in ‘hired guns\" to take on well-financed private corporate lawyers.", "Nevada law prohibits employing any outside attorney unless the Attorney General’s office is \"disqualified\" to represent state interests, but Cortez Masto has argued that the state’s relatively small Attorney General’s office and massive statewide budget cuts necessitated use of outside counsel to help with high-profile litigation against, say, large financial institutions.", "But use of contingent-fee contracts have recently come under fire, with critics saying the arrangements pervert the priorities for state attorneys general by focusing on cases with a potentially larger payoff than those that serve the public.", "\"This has gotten out of hand,\" former Massachusetts attorney general Scott Harshbarger told the New York Times in 2014. \"And it seriously threatens the perception of integrity and professionalism of the office, as it raises the question of whether attorneys are taking up these cases because they are important public matters, or they are being driven more by potential for private financial gain.\"", "Masto did indeed take campaign contributions from six lawyers at Cohen Milstein during her re-election campaign in 2010, nearly a year after the Cohen Milstein contract was approved.", "The six donated a total of $2,650 to the Democrat, with all coming after the general election.", "Those donations represented a drop in the bucket for Masto, who raised close to $460,000 through that election cycle. Her opponent, Republican lawyer Travis Barrick, only reported raising $15,000 and lost in a landslide.", "Do those donations really make Coretz Masto’s arrangement with Cohen Milstein a \"sweetheart deal?\"", "Who benefits?", "The Cohen Milstein contract was certainly beneficial for both the firm and state coffers. But the deal itself was more modest than similar arrangements in other states.", "The firm helped arrange a separate settlement with Bank of America that netted the state an extra $38 million. Cohen Milstein got $5.6 million in fees.", "Lawyers from Cohen Milstein didn’t return calls to PolitiFact, but records from the state Controller’s Office show six payments to the law firm totalling around $12.7 million between 2009 and 2014.", "The Cortez Masto campaign said the firm was hired through a competitive bidding process.", "The contract itself was approved with no controversy or discussion by the state’s Board of Examiners, which includes Republican Gov. Jim Gibbons.", "The contract was also designed without a cap on the amount of litigated fees that could be collected, which was criticized by lawmakers who successfully strengthened state law and added more oversight over contracts with outside counsel in 2015.", "Republican Sen. Greg Brower, who sponsored the bill, said during a legislative meeting that Cortez Masto’s office likely violated state law through continual overuse of contingent-fee contracts.", "\"There is a feeling on the part of many observers that the Office of the Attorney General has been essentially abdicating its oversight and discretion over when and how to settle cases to the private law firms it has hired,\" he said.", "Cortez Masto did not start the practice of using outside lawyers. Nevada has historically sought outside counsel on big cases, such as the settlement with big tobacco companies in the late 1990s.", "Before 2015, the Attorney General’s office arranged the contracts with little outside oversight, but the state generally offered less lucrative rates for outside lawyers than other states.", "Suits and countersuits", "The legality of the arrangement with Cohen Milstein has been questioned several times.", "With the assistance of Cohen Milstein, Nevada sued Florida-based Lender Processing Services in 2009 over questionable practices around mortgage loan documents.", "LPS counter-sued, claiming that the contract between the state and Cohen Milstein violated state law surrounding hiring of outside counsel. The case went far enough that possible sanctions against Cortez Masto’s office were brought up by a district-level judge and oral arguments were held at the state Supreme Court. The two parties settled for $5.5 million before the state Supreme Court issued a ruling.", "Major homebuilders Pulte Homes Inc. and Lennar Corp. also filed a lawsuit against the state in 2010 after Cohen Milstein was \"deputized\" to go after the companies, saying the firm couldn’t represent a separate labor union and the state. The case was later settled with the state receiving $475,000 and Pulte not admitting to any wrongdoing.", "Even with the new rules, Nevada continues to employ outside counsel for certain high-profile legal challenges. Current Attorney General Adam Laxalt hired another well-known law firm based out of Washington, D.C. — Bancroft PLLC — to represent the state in a lawsuit against the state’s new quasi-voucher program.", "Our ruling", "A Freedom Partners Action Fund ad claims Cortez Masto \"gave a sweetheart contract worth millions to a D.C. law firm that then donated thousands to her political campaigns.\"", "The general contours of the ad are accurate. As attorney general, Cortez Masto entered into a contingency-fee contract with Cohen Milstein for outside counsel on lawsuits filed against companies involved in the foreclosure crisis. She then received campaign contributions amounting to $2,650 from at least six lawyers at the firm — technically this is \"thousands,\" but the ad's vague language overplays the scale of those donations compared to her total haul.", "We take issue with the ad's \"sweetheart\" description of the deal, as the firm was chosen through a bidding process that was reviewed and approved externally. Lost in the ad is how the extra help was sought amid budget cuts at the Attorney General's office, and Nevada benefited from the lawsuits.", "Because some additional context is needed, we rate the statement Half True.", "Email interview with Catherine Cortez Masto spokesman Zach Hudson, May 27, 2016", "Email interview with Freedom Partners Action Fund spokesman Brian Anderson, May 2, 2016", "Las Vegas Sun, \"New ads take aim at U.S. Senate candidate Cortez Masto,\" May 2, 2016", "Reno Gazette-Journal, \"Fact Checker change: Cortez Masto ad correct,\" March 23, 2016", "Reno Gazette-Journal, \"Reno Sen. Greg Brower resigns seat effective Feb. 20,\" Feb. 9, 2016", "Las Vegas Review-Journal, \"Law firm hired to help defend Education Savings Account program,\" Sept. 17, 2016", "Reno Gazette-Journal, \"Transparency on hiring outside counsel can boost economy,\" April 1, 2016", "New York Times, \"Lawyers Create Big Paydays by Coaxing Attorneys General to Sue,\" Dec. 18, 2014", "Nevada Attorney General, \"ATTORNEY GENERAL MASTO ANNOUNCES SETTLEMENT IN LENDER PROCESSING SERVICES, INC. CASE,\" Feb. 14, 2014", "Forbes, \"Judge Sanctions Nevada AG Over Class-Action Lawyer Attack On Mortgage Lender,\" Jan. 30, 2014", "Law360, \"Most Feared Plaintiffs Firm: Cohen Milstein,\" Nov. 5, 2014", "Associated Press, \"Nevada AG sanctioned in lender fraud civil lawsuit,\" Jan. 31, 2014", "Pahrump Valley Times, \"Kulkin announces bid for lieutenant governor,\" Oct. 30, 2013", "Wall Street Journal, \"What Doesn't Stay in Vegas: Nevada's AG and the trial bar could scuttle a foreclosure settlement,\" June 11, 2013", "Las Vegas Review-Journal, \"Nearly 20,000 Nevada homeowners get average of $97,000 in mortgage relief,\" May 21, 2013", "Nevada News Bureau, \"Controversy Over State Use Of Outside Legal Counsel Expands To Robo-Signing Lawsuit,\" Feb. 2, 2012", "Husch Blackwell, \"Contingency Fee Plaintiffs’ Counsel and the Public Good,\" Winter 2011", "Associated Press, \"Nevada's boom and bust leaves 167,000 empty houses,\" March 27, 2011", "Las Vegas Sun, \"Homebuilder Pulte agrees to pay $475,000 in settlement with Nevada AG,\" Jan. 11, 2011", "Las Vegas Sun, \"Nevada AG sues Bank of America for home loan, foreclosure practices,\" Dec. 17, 2010", "Las Vegas Sun, \"Homebuilders Pulte and Lennar sue AG over hiring of law firm to probe lending,\" March 11, 2010", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]