["About this rating", "A Florida man was arrested after he poured gasoline into a hotel room and an automobile with the professed intent of killing child molesters.", "The suspect did not kill anyone, set people or property on fire, or burn anyone alive on a barbecue.", "On 9 June 2018, the Neon Nettle fake news site published an article reporting that a man had been arrested in Florida for \"'Barbecuing' Pedophiles to Death\":", "A Florida man has been arrested after he was caught rounding up pedophiles and burning them alive on a barbecue.", "50-year-old Jorge Porto-Sierra confessed to police that he wanted to \"barbecue all the child molesters and kill them\" when he was taken into custody.", "He has now been charged with four counts of premeditated murder and remains in custody pending trial.", "It is true that a man named Jorge Porto-Sierra was arrested in Kissimmee, Florida, in March 2018 on charges that he attempted to kill people he claimed were sex offenders.  However, contrary to Neon Nettle's fabricated reporting, Porto-Sierra  didn't actually kill anyone or set anyone on fire, much less \"burn pedophiles alive on a barbecue.\"", "As noted in news reports, Porto-Sierra dumped gasoline into a hotel room and an automobile with the professed intent of killing child molesters, but in neither case did he set people or property alight, and in both cases his intended victims escaped alive:", "Two victims who were in a room said Jorge Porto-Sierra ran up to their door with a red gas can in his hand, according to the affidavit. The victims said Porto-Sierra was screaming “You’re going to die child molester,” the affidavit said.", "He began pouring gasoline at the door, broke a window and dumped more gas inside the room, the affidavit said.", "The two victims escaped through a back window, fearing for their lives, according to the report.", "Porto-Sierra then attacked two people in a car, prosecutors allege. He rammed their vehicle three times with his car, got out and poured gasoline inside, the affidavit said.", "Porto-Sierra admitted to the acts and said “they raped kids ... they deserve to die,” the report said.", "When the deputy asked him why he didn’t light the car and room on fire, he replied “because you got here too soon,” the report said.", "According to the Orlando Sentinel, records show that three of the intended victims were sex offenders.", "Porto-Sierra was taken to the Osceola County jail and faces a slew of charges, including four counts of attempted murder.", "Neon Nettle is a notorious fake news site with a predilection for publishing sensationalized and exaggerated (if not completely fabricated) stories about pedophiles. True to form, Neon Nettle added multiple false elements to this particular report to enhance its luridness.", "Greenberg, Jay.   \"Man Arrested for 'Barbecuing' Pedophiles to Death.\" \r\n    Neon Nettle.   9 June 2018.", "Harris, David.   \"Man Accused of Trying to Light Sex Offenders on Fire, Deputies Say.\"\r\n    Orlando Sentinel.   7 May 2018.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]