["About this rating", "Several high-profile European leaders do not have biological children.", "A majority of European leaders have biological children of their own, and others have stepchildren from their spouses' previous marriages.", "On 14 May 2017, the Washington Examiner published a piece article titled “Emmanuel Macron and the Barren Elite of a Changing Continent,” which characterized Europe as being “governed by childless Baby Boomers”:", "Emmanuel Macron founded a new party, and his election as France's president is said to herald the \"revival of Europe.\" Interestingly, Macron has no children. This is not that notable in itself. After all, George Washington had no biological children. But across the continent Macron wants to bind closer together, there's a stark pattern:", "German Chancellor Angela Merkel also has no children. British prime minister Theresa May has no children. Italian prime minister Paolo Gentiloni has no children. Holland's Mark Rutte has no children. Sweden's Stefan Lofven has no biological children. Luxembourg's Xavier Bettel has no children. Scotland's Nicola Sturgeon has no children. Jean-Claude Juncker, president of the European Commission, has no children.", "This is too remarkable to ignore. While Macron is young -- 39 years old -- the rest of Europe is being governed by childless Baby Boomers.", "Breitbart News amplified this list in a post on the same topic two months later:", "The list goes on ... Latvia’s childless president is Raimonds Vējonis, Lithuania’s childless president is Dalia Grybauskaitė, and Romania’s childless president is Klaus Werner Iohannis.", "Breitbart highlighted these leaders to make a deep-state conspiracy talking point: “They are not part of a family and have come to see all their attention focused on one dominant and all-powerful social unit to which they pay obeisance and give their complete and devoted attention: The State.” The Examiner posited a different but equally unsubstantiated thesis: “contemporary childless leaders, however ascendant they feel today, may be the last gasp of secularism ... The future is won by those who show up, and only the religiously orthodox are having children.”", "Without addressing these speculative claims, we note first that both articles’ accounting of European leaders’ children is not 100% accurate; second, their lists are written to exclude the stepchildren of those leaders; and third, their lists ignore, for the sole purpose of making a faulty point, the majority of European leaders with multiple biological children. Below is a table of the leaders mentioned in those articles (which includes Jean-Claude Juncker, who doesn't actually head any country), along with the number of biological or stepchildren each has in their family:", "Posts such as the Examiner’s and Breitbart’s entirely ignore stepchildren, even in cases (like Macron's) when those leaders are reportedly quite close with a spouse's children. For example, Angela Merkel has two stepchildren from her husband’s first marriage, but her husband has made it a stated point to avoid news media coverage of their family life.", "In other cases, the reports are factually incorrect or outdated. Breitbart made the claim that Raimonds Vējonis was the “childless president” of Latvia, despite the fact that he is married with two children. References from 2017 were correct in stating that previous Italian prime minister Paolo Gentiloni had no children, but in 2018 Giuseppe Conte took office, and he has a son from a previous marriage.", "Additionally, these posts cast leaders' childless statuses as intentional, discounting cases in which those persons have tried unsuccessfully conceive children. In September 2016, for example, Scottish leader Nicola Sturgeon opened up to the BBC about having a miscarriage while deputy first minister of Scotland: “Sometimes ... having a baby just doesn't happen -- no matter how much we might want it to,\" she said.", "Furthermore, Europe includes far more countries than the 13 chosen to make a point about the continent's supposedly “barren elite.” While Breitbart did say “the list goes on” before incorrectly introducing the president of Latvia as childless, their list really did not “go on”. Below is a table of the 18 remaining European Union countries ignored in these posts, as well as the numbers of their leaders' copious progeny:", "The assertion that most European leaders are childless is false, and the claims presented by the Washington Examiner and Breitbart News cherry-picked countries, misstated facts, and ignored stepchildren in order to make dubious speculative points.", "MacPherson, James.   \"Emmanuel Macron and the Barren Elite of a Changing Continent.”\r\n    Washington Examiner..   14 May 2017.", "Malloch, Theodore Roosevelt .   \"MALLOCH: The Tragedy of the European Family.\r\n    Breitbart News..   22 July 2017.", "Collins, Lauren.   \"Emmanuel Macron and the Modern Family.\"\r\n    The New Yorker.   5 May 2017.", "Hujar, Marc.   \"Das Phantom.\"\r\n    Der Spiegel.   1 February 2006.", "Pearson, Allison.   \"Theresa May Interview: 'I Probably Was Goody Two Shoes at School’.\"\r\n    Telegraph.   21 December 2012.", "Squires, Nick.   \"Who Is Giuseppe Conte, Italy's Next Prime Minister?\"\r\n    Telegraph.   21 May 2018.", "DutchNews.nl.   \"Ten Things You Didn’t Know About Prime Minister Mark Rutte.\"\r\n    3 November 2015.", "Expressen.   \"Stefan Löfven Talar Ut Om Sin Kärlek Till Ulla.\"\r\n    16 June 2012.", "Hennebert, Jean-Michel.   \"Je Suis Surpris De Devenir Bourgmestre.\"\r\n    L’essential.   11 October 2011.", "BBC News.   \"Nicola Sturgeon Miscarriage: First Minister Reveals Baby Loss.\"\r\n    4 September 2016.", "Collier, Mike and Mary Sibierski.   \"Latvia Elects Vejonis, Eu's First Green President.\"\r\n    Agence France Presse.   3 June 2015.", "Phelan, Jessica.   “All the Single Leaders: The World’s Most Eligible Heads of State.\"\r\n    PRI.org.   31 January 2014.", "EVZ.ro.   \"Carmen Johannis, Sfetnicul Din Umbră.\"\r\n    16 October 2009.", "Schult, Christoph.   \"Juncker's Plan to Succeed Himself.\"\r\n    Spiegel Online.   15 July 2013.", "Soussi, Alesdiar.   \"Newsmaker: Alexander Van der Bellen.\"\r\n    The National.   26 May 2016.", "Cerukus, Laurens.   \"Charles Michel Welcomes Baby Girl Jeanne.\"\r\n    Politico.   21 January 2016.", "24chasa.bg.   \"Новата първа дама - връстничка на Мелания Тръмп.”\r\n    14 November 2016.", "tportal.hr.   \"Suprug Kolinde Grabar Kitarović Konačno Izašao Iz Sjene.”\r\n    18 August 2014.", "presidency.gov.cy.   \"Bio.”\r\n    Accessed 26 November 2018.", "tdoma.cz.   \"Kateřina Zemanová: Největší Prezidentova Chlouba.”\r\n    26 January 2013.", "Weimann, Annelise.   \"Lars Løkke Rasmussen Forsømte Familien.\"\r\n    Billed Bladet.   24 December 2009.", "Ubaleht, Marianne.   \"Kersti Kaljulaid Ujub Presidendiakvaariumis Üksinda: Nad on Kõik Mu Seljataga Olemas, Mu Perekond.\"\r\n    Kroonika.   28 September 2016.", "yle.fi.   \"Finland's Presidential Couple Welcomes Baby Boy.”\r\n    3 February 2018.", "in.gr.   \"Ποιος είναι ο Προκόπης Παυλόπουλος, ο έβδομος Πρόεδρος της Δημοκρατίας.”\r\n    18 February 2015.", "Xinhua.   \"Hungarian PM Nominates Janos Ader as President.”\r\n    17 April 2012.", "Boland, Rosita.   \"New Lady of the Áras.\"\r\n    The Irish Times.   5 November 2011.", "eve.com.mt.   \"Malta’s New President: Inauguration Day”\r\n    4 April 2014.", "tvn24.pl.   “‘Pierwsza Córka’ Kinga. W Kampanii U Boku Ojca, Chwaliła ‘energię, Uczciwość I Dobre Serce’.”\r\n    25 May 2015.", "Sabato.   “Quem é a Mulher Que Não Quer Ser Primeira-dama?”\r\n    9 March 2016.", "prezident.sk.   “Biography.”\r\n    Accessed 26 November 2018.", "revijaobrazi.si.   “Borut Pahor.”\r\n    13 November 2009.", "Diez Minutos.   “Así es Begoña Gómez, la mujer de Pedro Sánchez.”\r\n    1 June 2018.", "Correction [28 November 2018]: Corrected to reflect that Leo Varadkar is the head of state in Ireland.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]