["The photo was posted on Facebook on June 12, 2020, showing Cher posing next to her mother Georgia Holt. The post, shared 69,000 times, reads: “OMG.. 74-year-old Cher with her 94-year-old mother.”", "The same photo was also shared on Facebook here, here, here and here, with users praising the pair’s youthful appearances.", "But the posts are misleading. A reverse image search showed an article published on the website of British newspaper Daily Mail on June 21,  2012, with the headline: “Never too old for leggings! Cher defies her 66 years as she steps out in skintight pants”.", "The photo caption reads: “Good genes: It is obvious Cher gets her youthful looks from her mother, Georgia Holt, 86 after she posted a picture of them before they met Barack Obama earlier this month.”", "The image was among a set tweeted by Cher on June 7, 2012, before she met Obama with a friend and family.", "http://t.co/zBdflcbd http://t.co/7kBtvyQu http://t.co/gBBw0MwR http://t.co/epG6U82e B4 these pics.Chaos!\n\t\tSuch Fun", "Cher regularly tweets about Holt and four years ago, she posted this image and said: “This is what 70 & 90 looks like in my family… Mom has NO MAKE UP ON”.", "A more recent post on Cher’s twitter account, from December 11, 2018, showed a photo of Holt at the age of 92.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]