["About this rating", "Richard Wayne Penniman, better known as Little Richard, was one of the seminal figures in the history of rock 'n' roll music, known for signature songs such as \"Tutti Frutti\" and \"Long Tall Sally\" that featured his \"charismatic showmanship and dynamic music, characterized by frenetic piano playing, pounding back beat and raspy shouted vocals.\"", "A black-and-white video clip widely circulated on Facebook purports to show a preternaturally talented 10-year-old Richard playing and singing an intricate boogie-woogie piano piece for a couple of uniformed soldiers and a woman:", "Although Richard Penniman was undeniably musically talented as a youngster, he is not the child seen in this clip. This video is an excerpt from the 1946 post-war film \"No Leave, No Love,\" starring Van Johnson, Keenan Wynn, and Pat Kirkwood, and the piano-playing wunderkind featured in the movie is Frank “Sugar Chile” Robinson:", "Frank was tiny when he showed unusual gifts for singing the blues and playing the piano. Neither of his parents were musical but the family of nine did own a piano that had been left at the house by an aunt. The story goes ‘Sugar Chile’, who was the youngest of the seven children, would climb up onto the piano bench and taught himself to play what he heard on the radio.", "At just three years old he won an under-18 talent contest — you can imagine everyone’s eyes popping out of their head when a toddler sat down at the piano and began to sing and play the blues. Naturally, he was in great demand to record and perform.", "In fact, Robinson was just seven years old when he appeared in \"No Leave, No Love.\" Here's a better and more complete version of his sequence in that film, playing a popular piece of the time known as \"Caldonia\" (or \"Caldonia Boogie\"):", "Mayer, Alica.   \"Frank ‘Sugar Chile’ Robinson: The Child Prodigy Who Walked Away from It All.\"\r\n    The Film Colony.   18 January 2016.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]