["In her early campaign appearances, Gov. Sarah Palin has repeatedly boasted about her role in advocating a new natural gas pipeline in Alaska.", "And she has not always stuck to the truth, as we explain\n\nin a story here\n\n.", "This is her at a campaign appearance in Fairfax, Va., on Sept. 10, 2008: \"I'm ready to join John McCain in Washington so we can end the corrupt practices of the abuse of earmarks once and for all. We'll do that. Through competition as governor, I got agreements to build a nearly $40-billion natural gas pipeline. That's going to help all of you.\"", "A commitment to build new natural gas pipeline from Alaska's remote but resource-rich North Slope would indeed be quite an accomplishment. Alaskans have been seeking it for some three decades.", "As Palin campaigned for governor, she sharply criticized her predecessor's plan to have major oil companies build the pipeline. After she was elected governor, she sought competing proposals. In August 2008, the Legislature accepted one from TransCanada Corp., a Calgary-based company.", "Under a plan Palin spearheaded, TransCanada will get $500-million in state funds to design and seek approvals for the pipeline. But they are not obligated to build it. Financing and approvals are far from certain, and the company can back out even if those contingencies come through.", "Several experts we spoke to were skeptical that TransCanada's plan would come to fruition.", "\"I'll believe it when I see it,\" said Sarah Ladislaw, a fellow specializing in Western Hemispheric energy issues at the Center for Strategic & International Studies.", "Palin has repeatedly mischaracterized the agreement with TransCanada. In a news conference in Alaska on Aug. 1, 2008, she said the state never before had \"commitments to build this line. Now we do.\"", "In its news story the next day, the\n\nAnchorage Daily News\n\nwrote: \"That's incorrect. TransCanada has not promised to actually build the gas line, one of the state's grandest and most frustrated economic development dreams. The state license ... is not a construction contract and does not guarantee a pipeline will be built. Rather, it's an exclusive deal under which the state will provide up to $500-million plus other incentives, such as a coordinator to speed up permits, in exchange for TransCanada doing its best to secure the customers, financing, and U.S. and Canadian regulatory clearances.\"", "Palin also frequently says the pipeline would cost \"nearly $40-billion,\" as she did in this claim. We're not sure where she got that figure — neither her office in Alaska nor the McCain campaign returned our calls to tell us. TransCanada estimates the cost at $26-billion.", "Yes, there could be cost overruns. But experts were skeptical the price could reach Palin's estimate.", "Palin's accomplishment sounds impressive in her words — far more than it actually is. The agreement she reached — with the help of the Alaska State Legislature — is not a commitment to build, but rather a commitment to begin planning the massive project. Palin's claim suggests that construction is assured, but that's just not true. And if it were, it wouldn't be a $40-billion pipeline. Those are two significant flaws in this claim Palin makes repeatedly.", "Still, there is a new agreement that was forged with Palin as governor, so we rate her boast as Barely True.", "BlogsForJohnMcCain.com,\n\nVP Nominee Sarah Palin Delivers Campaign Weekly Radio Address\n\n, Sept. 6, 2008, accessed Sept. 10, 2008", "Alaska Governor's Office,\n\nPalin Signs AGIA License Bill\n\n, Aug. 27, 2008, accessed Sept. 10, 2008", "Alaska Governor's Office,\n\nFrequently Asked Questions Regarding the Alaska Gasline Inducement Act and the AGIA Process\n\n, accessed Sept. 10, 2008", "Alaska Department of Natural Resources,\n\nExecutive Summary of AGIA\n\n, March 5, 2007, accessed Sept. 8, 2008", "Alaska Independence Party,\n\nQuestions and Answers About Alaskan Independence\n\n, accessed Sept. 9, 2008", "Foster Natural Gas Report, Alaska Governor Offers Inducements to Build Gas Line in Exchange for Meeting Benchmarks, March 9, 2007", "Anchorage Daily News,\n\nTransCanada Gets Senate's OK\n\n, Aug. 2, 2008, accessed Sept. 10, 2008", "Anchorage Daily News,\n\nRebel Status Has Fueled Front-Runner's Success\n\n, Oct. 24, 2006, accessed Sept. 10, 2008", "Anchorage Daily News,\n\nCandidate Palin Casts Herself as a Republican Party Iconoclast\n\n, Aug. 11, 2006, accessed Sept. 10, 2008", "Boston Globe,\n\nParties Jockey to Guide Flood of Data About Palin\n\n, Sept. 10, 2008", "Alyeska Pipeline,\n\nPipeline Facts\n\n, accessed Sept. 9, 2008", "Interview with Alaksa State Sen. Bill Wielechowski, Sept. 8, 2008", "Interview with Alaska State Sen. Lyda Green, Sept. 8, 2008", "Interview with Sarah Ladislaw, fellow, Energy and National Security Program, Center for Strategic & International Studies, Sept. 9, 2008", "Interview with Edward Chow, senior fellow, Energy and National Security Program, Center for Strategic & International Studies, Sept. 9, 2008", "Interview with Scott Lewis, editorial research director, Engineering News-Record, Sept. 9, 2008", "Interview with Jay McCauley, vice president, Society for Industrial Archeology, Sept. 9, 2008", "E-mail interview with Cecily Dobson, spokeswoman for TransCanada Corp., Sept. 9, 2008", "Bureau of Labor Statistics,\n\nInflation Calculator\n\n, accessed Sept. 9, 2008", "Halfhill.com,\n\nTom's Inflation Calculator\n\n, accessed Sept. 9, 2008", "Westegg.com,\n\nThe Inflation Calculator\n\n, accessed Sept. 9, 2008", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]