["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A fly made an unexpected cameo during the vice presidential debates on Oct. 7, alighting onto Vice President Mike Pence’s head and settling in for about two minutes.", "An image being shared on social media makes it look like another fly landed on the shoulder of Supreme Court nominee Amy Coney Barrett during the first day of her confirmation hearings.", "\"Is that a mis-placed lapel pin?\" one account sharing the image wrote. \"Nope. A fly got in, and look where it landed.\"", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "In the image, the fly appears on Barrett’s right shoulder and a timestamp says 2:08 p.m. Eastern time.", "We watched the footage of the hearing posted by C-SPAN, and no fly appears on her shoulder during that time. You can see for yourself starting around the 5:14:00mark here, or starting around the 6:06:25 mark here.", "Kirby Taylor, the user who posted the image on Facebook, told USA Today that it was a joke. She had been watching the hearing at home when a fly landed on the screen. Taylor took a photo and posted it to Facebook.", "But the photo has taken on a life of its own. Taylor’s post was shared more than 13,000 times and other users have taken the image and posted it on their own Facebook pages with captions like \"Fly strikes again\" and \"Once again. Nature’s way of making things happen.\"", "Even celebrity blogger Perez Hilton weighed in, posting: \"Was this another fly or are my eyes seeing things????\"", "We rate this post False.", "Facebook post, Oct. 12, 2020", "The New York Times, A fly sat atop Mike Pence’s head for two minutes during the V.P. debate, Oct. 7, 2020", "C-SPAN, Confirmation hearing for Supreme Court nominee Judge Amy Coney Barrett (Day 1), Oct. 12, 2020", "The Washington Post, First day of Amy Coney Barrett’s Supreme Court confirmation hearing, Oct. 12, 2020", "USA Today, Fact-check: Image showing fly on Amy Coney Barrett’s shoulder during hearing posted as joke, Oct. 14, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]