["An image purporting to show a genuine press release from the office of Australia's Victoria Premier Daniel Andrews has been shared in multiple Facebook posts following his admission to hospital after an injury. The supposed statement, however, was not released by Andrews's office and was created by internet users as parody.", "The image was published on Facebook here on March 9, 2021. The purported press release is also dated March 9 and features an official letterhead from Andrews’s office.", "“Early this morning, I was admitted to hospital after slipping and falling on wet and slippery stairs. A CT scan revealed several broken ribs, but did not find a heart or a soul,” the text reads.", "“Subsequent medical advice is I remain in Intensive Care for the next few days. And as you know, I ALWAYS listen to the best health advice!", "“I am lucky to have somehow gotten a bed in ICU, given we are in a pandemic and under a State of Emergency. I look forward to meeting all the covid patients in ICU while I am here, but so far I haven't seen any.”", "The purported statement adds that Andrews refused a Covid-19 vaccine because he is “not stupid enough to actually undergo experimental gene editing”.", "The post circulated shortly after Andrews was admitted to hospital after sustaining a spinal injury from a fall, as reported by local news outlets ABC, 9 News and The Age.", "The image of the purported press release was also published on Facebook here, here, here, and here.", "However, the image does not show a genuine press release.", "A keyword search found that the real press release issued following Andrews’ injury was published on the premier’s official website here on March 9, 2021.", "The press release reads, in part: “Early this morning, I was admitted to hospital after slipping and falling on wet and slippery stairs. A CT scan has revealed several broken ribs and vertebrae damage, and subsequent medical advice has recommended I remain in intensive care for the next few days.", "Cath, the kids and I are extremely grateful to the Ambulance Victoria paramedics who showed such care and kindness to our family this morning, as we are to the clinicians who have taken care of me today.”", "Below is a comparison between the fake statement (L) and the genuine press release (R):", "Some Facebook users, for example this post, shared the image and noted clearly in the caption that the purported press release was created as parody.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]