["About this rating", "In September 2020, a false rumor saying that Netflix CEO Reed Hastings had been arrested on child pornography charges was widely circulated on social media. While that rumor was entirely made up out of whole cloth, the pushers of that misinformation at least correctly identified the CEO of the streaming giant.", "A few days after that rumor went viral, an even more incorrect version started to make its way around the internet. This time, social media users claimed that it was actually Netflix CEO \"Kim Martin Morrow\" — who is nonexistent — had been arrested for child pornography charges:", "There's absolutely no truth to this claim.", "For starters, Kim Martin Morrow is not the CEO of Netflix. The streaming service has two CEOs, Reed Hastings and Ted Sarandos, neither of whom are named Kim Martin Morrow. We were also unable to find anyone by the name of Kim Martin Morrow serving in any of the other high-ranking positions at Netflix.", "We were also unable to find any news reports about a Kim Martin Morrow being arrested on child pornography charges. It appears that this name, as well as this rumor, were once again simply made up out of whole cloth.", "The false rumor that Netflix CEO Reed Hastings (or in this case, the fictional Kim Martin Morrow) was arrested for child pornography, started circulating in the wake of a controversy concerning the streaming service's sexualized promotional materials for the movie \"Cuties.\"", "While it's true that Netflix promoted this movie with a questionable poster, much of the criticism against the movie is based on misunderstandings and misinformation. You can read more about the \"Cuties\" controversy here.", "Truitt, Brian.   \"'Cuties': Here's Why the Controversial Netflix Film Became a Combatant in America's Culture War.\"\r\n    USA Today.   15 September 2020.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]