["The claim was published in this Facebook post on July 28, 2020.", "The post's text reads: \"'Cigarette smoking does not cause cancer' —Centers For Disease Control (CDC), 1958. 'Vaccines do not cause autism.' —Centers For Disease Control (CDC), 2012.\"", "The post was published during the ongoing novel coronavirus pandemic. Scientists around the world have been racing to develop a vaccine for COVID-19, the disease caused by the virus, as reported by AFP here.", "An identical claim was shared on Facebook here, here, here, and here.", "The claim, however, is false.", "A spokesperson for the CDC told AFP that by 1958, the US government had determined that smoking was a causative factor in lung cancer.", "In the 1950s, the CDC was named the Communicable Disease Center and focused on communicable diseases.", "Non-communicable diseases, such as cancer and related risk factors, were addressed by the U.S. Department of Health, Education, and Welfare (HEW), the precursor to the current Department of Health and Human Services.", "“As noted in the 2000 U.S. Surgeon General’s Report, several activities by then Surgeon General, Dr. Leroy Burney, who reported to the Director of HEW, reinforced the U.S. Government’s stance on the growing scientific association between smoking and cancer,” the spokesperson said in an email on July 30, 2020.", "“Specifically, the report notes: ‘The Surgeon General first brought the Public Health Service into the scene by establishing a scientific study group in 1956 to appraise the effects of smoking on health. The study group determined that there was a causal relationship between excessive smoking of cigarettes and lung cancer. Surgeon General Leroy E. Burney issued a statement in 1957 that ‘the weight of the evidence is increasingly pointing in one direction: that excessive smoking is one of the causative factors in lung cancer.’”", "A keyword search on Google for the quote “Cigarette smoking does not cause cancer” did not identify any documents related to the CDC.", "This page on the CDC’s website notes that vaccines do not cause autism.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]