["About this rating", "Eating nothing but potatoes and butter, in sufficient quantities, could keep a person alive for an indeterminate period of time.", "Whether a person could remain healthy in the long term on such a dietary regimen would depend upon on other health factors.", "The idea that potatoes can be a catch-all form of sustenance for human beings has been popularized at various times by public campaigns and movies, but health experts are split on the potential impact of \"surviving\" on just one type of food.", "This claim has been widely circulated online in meme form, with the slight modification of adding butter to the \"menu\" of the all-potato diet:", "Katherine Basbaum, a cardiovascular dietitian for the University of Virginia health system, is skeptical of this meme's assertion. She told us that potatoes and butter would provide enough macronutrients for the body at a \"very basic level,\" but added that remaining alive and remaining healthy are two very different things:", "There's a big difference between what your body needs to survive and what your body needs to work as best as it possibly can — to be as efficient, to be as healthy, to be as strong and it possibly can. There's a big difference between that and merely surviving. If you were hard-pressed and you had to do it, you could absolutely survive on it. Is it nutritious? Is it healthy and balanced? Absolutely not.", "Dana Hunnes, senior dietitian at Ronald Reagan UCLA Medical Center, disagreed slightly. She told us that this type of diet could be sustainable for persons who consumed enough potatoes to support their body weight and muscle mass. However, she said she would advise anyone looking to pursue that kind of regimen to instead eat a wider variety of fruits and vegetables.", "\"You can certainly survive healthily — it's been done,\" Hunnes said. \"Would I recommend it for people? No. Because I think you'd be bored in that diet.\"", "At least two public campaigns have touted the supposed merits of an all-potato diet. In 2010 Chris Voigt, head of the Washington State Potato Commission, promoted the merits of tubers by living off of them for two months.", "\"I'm not encouraging anyone to go on this crazy diet, nor would my doctor,\" he said at the time. \"This diet was just a bold statement to remind people that there is a lot of nutrition in a potato.\"", "Voigt lost 23 pounds during that experience and denied rumors that he had abandoned his plan early.", "That type of short-term effort, Basbaum said, was unlikely to cause a person much damage provided that they not only had a clean bill of health but also no family history or risk of heart or kidney disease.", "Butter, she told us, is extremely high in saturated fats and can lead to unhealthy cholesterol levels.", "\"If somebody came in here saying, 'I heard about this potato and butter diet,' I would tell them not to touch it with a 10-foot pole,\" she said.", "Similarly, potatoes on their own are rich in potassium but are best enjoyed in moderation because of the threat they pose to the kidneys, which manage potassium intake for the body.", "\"If someone goes from a regular balanced diet getting the normal amount of potassium to just eating potatoes (like 20 a day or whatever), that's dangerous. It's not a good idea. You're overloading your kidneys with all of this potassium,\" Basbaum said. \"If you have someone with pre-diabetes or diabetes or at risk for developing Type 2 diabetes, I don't really want to put them on an all-starch diet. You're risking increased levels of blood sugar and the body producing way too much insulin for your own good.\"", "Six years after Voigt's efforts, an Australian man, Andrew Taylor, also made news when he announced that he lost 114 pounds after spending the year eating around eight or nine pounds of  potatoes per day on a \"spud fit\" diet.", "Taylor posted before-and-after pictures touting his weight loss, but Basbaum did not interpret the results as being fully positive.", "\"As a dietitian I don't look at that picture and [say] 'That dude lost a bunch of weight, good for him,\" she said. \"I look at the before and after photo and I can tell this guy is malnourished. You can see the wasting in his shoulder and his clavicle area. You can see that he's lost muscle tone, he's got barely any muscle tone in his arms. Obviously I couldn't diagnose him, but we do nutrition-based physical exams with our patients and you can tell that that guy wasn't optimum health. Not by a long shot.\"", "Heavily-restricted diets gain popularity, Hunnes told us, because some people are seeking \"the magic bullet\" to keep them healthy.", "\"If someone says anecdotally, 'This works for me,' I think there's a lot of power in people being able to see with their own eyes what's happening to someone else,\" she said. \"I think that's the makings of a fad, particularly if a celebrity gets caught on to it or if a person has a lot of followers on Facebook or Instagram social media, posting those types of images is very powerful for people.\"", "For her part, Basbaum said that restricting oneself to that extent gives some dieters a feeling of control because it limits their margin of error.", "\"But at the end of the day, these diets that ask you to either eat only one thing or ask you to eliminate an entire nutrient — take no fat or no carbohydrates at all — they don't work. They work for a time just like all diets,\" she added. \"But they don't work for everybody and they're not sustainable. What happens when you go off of it?\"", "In popular culture, the popular novel The Martian (which was adapted into a 2015 feature film) featured a subplot in which stranded astronaut Mark Watney grew potatoes on the surface of Mars and ate them to keep himself alive. Subsequent research by the International Potato Center (CIP) in Peru produced \"encouraging results\" regarding the prospect of growing potato crops on the red planet.", "\"With this study, we have the basis for contributing to the so-called 'Bioregenerative Food System' proposed by space agencies, based on a space agriculture using local resources — such as soil — in future missions to Mars,\" lead researcher David Ramirez said at the time.", "Pawlowski, A.   \"'Spud Fit': Man Loses 115 Pounds Eating Nothing But Potatoes for a Year.\"\r\n    The Today Show.   19 December 2016.", "BBC News.   \"Is a Potato-Only Diet Good for You?\"\r\n    29 November 2010.", "Saltzman, Sammy.   \"Chris Voigt Ends Potato-Only Protest Diet: Why?\"\r\n    CBS News.   30 November 2010.", "International Potato Center.   \"Crop Harvested Under Red Planet Conditions Will Set Course for Martian Farming.\"\r\n    18 December 2015.", "International Potato Center.   \"Research Reveals Potential for Growing Potatoes on Mars, And Challenging Areas of Earth.\"\r\n    9 February 2018.", "Arturo Garcia is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]