["About this rating", "On 17 June 2017, comedian and \"The View\" co-host Whoopi Goldberg was the subject of an article by a disreputable, but prolific, web site. According to the \"satirical\" TheLast LineOfDefense.org, Goldberg was \"humiliated, handcuffed and dragged out of the TV studio\" after being arrested by federal officials:", "Goldberg has been breeding Pugs, French Bulldogs, Sharpeis and Shitzus from the same sets of parents for nearly 25 years, replacing mom or dad in the line with a son or daughter when she lost one. Veterinary experts say the dogs being produced might look cute, but they are a fragile mess waiting to snap at the first real sign of stress in their lives.", "Like everything else The Last Line of Defense publishes, the story is false, as explained in its blisteringly disdainful disclaimer:", "In a cynical world where the news of the day often seems fake, The Last Line of Defense offers today's busy conservative a place to go to read things they'll enjoy and congregate with a bunch of people they agree with. So while everything on this site is a satirical work of fiction, we are proud to present it to those who will have called it real anyway.", "Goldberg, an outspoken critic of President Donald Trump's administration, has been repeatedly portrayed in a false light throughout 2017 by various dubious and disreputable web sites and publications.", "As far as her connection to animals, Goldberg has shown an affinity for animals in need: in 2011 she adopted a cat that had been reportedly thrown out of a car window by its previous owners, and in 2015 she took in a blind and deaf dog, Bear, after he was featured in a segment on her show.  She has not used either the cat or the dog to start a puppy mill.", "Jamieson, Amy.   \"Whoopi Goldberg Adopts Kitten Thrown from Car in N.Y.C.\"     People.   25 August 2011.", "WPVI-TV.   \"Whoopi Goldberg Visits Shelter of Adopted Dog Featured on 'View' in Chester Springs.\"\r\n    11 October 2015.", "Arturo Garcia is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]