["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Rumors have smoldered online for years that the Clinton family murders its political enemies. We’ve debunked some, such as the claim that investigators found the remains of missing women in steel barrels on Bill and Hillary Clinton’s property. Or that a doctor was murdered after criticizing the Clinton Foundation. (There are more.)", "On Aug. 13, a Facebook post alleged yet another victim of the political family.", "\"I’m Suzanne Coleman,\" reads the text above a black-and-white photo of a woman. \"After having an affair with Bill Clinton I became pregnant. Then my body was found with a gunshot wound to the back of my head. It was ruled a suicide and no autopsy was allowed. I was 7 months pregnant.\"", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "That’s because there’s no credible evidence supporting the idea that Coleman was killed after having an affair with Bill Clinton. In fact, the rumor was discredited as early as the 1992 presidential campaign. Here are the facts.", "Susan Coleman, not Suzanne Coleman as the Facebook post says, was a former law student of Bill Clinton at the University of Arkansas. Clinton taught there after earning his law degree in 1973. Coleman committed suicide in 1977, according to numerous published reports.", "During the presidential election that year, a young conservative named David Bossie \"was dispatched to sniff around Bill Clinton’s sex life by the Republican operative Floyd Brown, the founder of Citizens United,\" according to a 2016 story in the Atlantic.", "Bossie and a retired police officer named Jim Murphy were working for Brown as they tried to confirm Coleman shot herself \"following a love affair with her law professor, Bill Clinton, that left her pregnant,\" CBS reported, according to the Washington Post.", "Murphy and Bossie, who helped run Donald Trump’s 2016 presidential campaign, followed Coleman’s mother to an Army hospital in Georgia, according to CBS, and \"burst\" into the room where her husband was being treated for a stroke \"and began questioning the shaken mother about her daughter’s suicide.\"", "CBS Evening News reported that the investigation stemmed from an anonymous letter mass mailed to news organizations but that Coleman’s family \"maintained there was no truth to this, and said reporters who had investigated the letter found it to be a nasty hoax,\" according to UPI.", "After reading a transcript of the CBS News report, then-president George H.W. Bush ordered his campaign to file a complaint with the Federal Election Commission against Brown, \"the hard-ball political ad man who has gone from being seen as (an) asset to a liability,\" UPI reported.", "Searching the Nexis news archive for stories that could corroborate the allegations made in the Facebook post, we found none. We rate it False.", "Facebook post, Aug. 13, 2019", "PolitiFact, \"Says investigators have found remains of missing women in steel barrels buried on Bill and Hillary Clinton’s property,\" June 26, 2017", "PolitiFact, \"No, a doctor was not murdered after criticizing the Clinton Foundation,\" Oct. 22, 2018", "PolitiFact, \"Facebook post shares photo of actor and claims he is Chelsea Clinton’s ‘dead bodyguard,’\" March 1, 2019", "PolitiFact, \"Blogger falsely ties death of U.N. official to Clintons,\" June 30, 2017", "PolitiFact, \"No evidence woman who died in home explosion was to testify against Clintons,\" July 18, 2018", "The Washington Post, \"A firefighter’s blazing trail,\" Nov. 13, 1997", "The Atlantic, \"Meet the new Bossie, same as the old Bossie,\" Sept. 6, 2016", "UPI, \"Bush files FEC complaint against ‘Willie Horton’ creator,\" July 15, 1992", "The Daily Beast, \"Clinton nemesis David Bossie now after Obama’s Democrats,\" July 14, 2017", "St. Louis Post-Dispatch, \"Bush trying to stop ‘despicable’ support complaint will be filed with election; panel,\" July 15, 1992", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]