["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Mark Cuban, shown here at a SXSW event in 2016, wrote a tweet about Twitter drawing a fact-check (PHOTO: Ricardo B. Brazziell, Austin American-Statesman).", "Texas businessman and possible 2020 presidential aspirant Mark Cuban, who backed Hillary Clinton for president in 2016, challenged Kellyanne Conaway’s defense of President Donald Trump’s frequent Twitter posts by suggesting most Americans aren’t Twitter-philes.", "Cuban was reacting to a June 30, 2017, Fox News tweet quoting the White House counselor saying the president conveys his ideas through social media \"because the middle man can't be trusted.\"", "\"This is backwards,\" Cuban tweeted back. \"Twitter reaches only ~ 15pct of population,\" Cuban said, adding: \"For a tweet to reach the general population the MSM (mainstream media) has to report on it.\"", "Reporting matters. But it’s a reach to dismiss Twitter, which says its mission is to \"give everyone the power to create and share ideas and information instantly, without barriers.\" The California-based platform, which permits individuals and groups to post brief messages generally viewable to anyone who cares to peek, became a durable social-media phenomenon after its embrace at Austin’s South by Southwest in 2007.", "As of July 2017, the president’s @RealDonaldTrump Twitter account had more than 34 million followers. By then, Trump’s predecessor, Barack Obama, had 92 million followers, a \"followership\" built over many more years in politics.", "So, do just 15 percent of Americans see Twitter directly?", "Cuban’s backup", "Twitter itself says that as of the end of June 2017, it had 328 million monthly active users. The company said that 79 percent of Twitter accounts were based outside the United States.", "When we asked Cuban the basis of his cited 15 percent figure, he said by email that he saw it in a report in 2016. He said we could confirm the number by talking to any analyst of Twitter’s stock or by engaging the company.", "A stock analyst", "Our emails to Twitter media representatives went unanswered, but we connected with Perry Gold, a New York-based stock analyst identified by Twitter Inc. as one of more than 30 analysts of its stock.", "Gold, of MoffettNathanson LLC, a media and telecommunications research firm, pointed out internal metrics made public by Twitter covering the first quarter of 2017. In the four months, according to the figures, Twitter had 70 million monthly active U.S. users, up 3 million from the last four months of 2016, the company noted in an April 2017 letter to shareholders.", "Our run at perspective: The U.S. population was 323 million as of July 2016 including nearly 249 million residents age 18 or older, according to the U.S. Census Bureau. So you could assert, roughly, that 22 percent of all Americans engaged with Twitter in the first few months of 2017. Removing minors from the population count leaves you with nearly 249 million residents, perhaps opening the way to estimate that up to 28 percent of U.S. adults used Twitter in the year’s first quarter--again, a rough estimate.", "Gold also pointed out that according to a June 2017 ranking of digital media platforms by Comscore, a cross-platform measurement company, Twitter that month ranked 13th nationally with 110,290,000 unique U.S. visitors/viewers. At No. 1, per Comscore, Google had 241,433,000 unique U.S. visitors/viewers.", "Another speculative calculation: If you assume the Google count reflects nearly every U.S. user of the Internet, then you could say the count of Twitter’s unique visitors/viewers was about 46 percent of all the U.S. online population for the month.", "Experts caution", "We sought independent expert analysis from professors pointed out by Kathleen McElroy of the University of Texas including Dhiraj Murthy, author of a book on Twitter for social communication, who called \"monthly active users,\" the indicator aired by Twitter, \"a very difficult metric with lots of limitations as even bots or quite occasional users can be incorporated into these numbers, depending on how calculations are done.\"", "Most research agrees, Murthy said by email, that most tweets go unread or passed along.", "Meredith Clark, an assistant professor of journalism at the University of North Texas, and a University of North Carolina \"big data\" colleague, Deen Freelon, each suggested we consider the results of a Pew Research Center survey of 1,520 U.S. adults taken in March-April 2016 finding that while 79 percent of online Americans reported using Facebook, 24 percent reported using Twitter.", "\"On a total population basis (accounting for Americans who do not use the internet at all),\" Pew wrote, that means 68 percent of U.S. adults are Facebook users and 21 percent use Twitter.", "SOURCE: Web post, \"24% of online adults (21% of all Americans) use Twitter,\" Pew Research Center, Nov. 10, 2016", "Per Twitter, survey respondents were asked: \"Do you ever use the internet or a mobile app to use Twitter?\" While 24 percent said yes to the query, 75 percent had not ever done so, Pew found.", "\"Roughly one-quarter of online adults (24%) use Twitter, a proportion that is statistically unchanged from a survey conducted in 2015 (23%).", "\"Younger Americans are more likely than older Americans to be on Twitter. Some 36% of online adults ages 18-29 are on the social network, more than triple the share among online adults ages 65 and older (just 10% of whom are Twitter users).", "\"Twitter is also somewhat more popular among the highly educated: 29% of internet users with college degrees use Twitter, compared with 20% of those with high school degrees or less,\" Pew said.", "Both professors saw potential complications in Cuban’s statement.", "Clark said by email: \"Cuban's claim rests on the assumption that everyone has an equal probability of seeing any other user's tweets, which we don't, because of Twitter's algorithms and our own decisions on whom to follow, re-tweet, mute, block, etc.,\" Clark wrote.", "Freelon elaborated: \"Philosophically, your rating of Mr. Cuban's statement may depend on how the term ‘reach’ is defined. Limiting the focus to people who see a tweet directly on Twitter is one approach,\" he wrote, \"but some tweets get seen because they’re mentioned in news coverage or discussed elsewhere online. Freelon said a \"liberal definition of the term ‘reach’ pulls in many more people. Exactly\" how \"many is probably impossible to say with any degree of certainty.\"", "Our ruling", "Cuban said: \"Twitter reaches only 15 percent of the population.\"", "A 2016 survey and more recent Twitter metrics suggest that around 21 percent of U.S. residents at least peek at tweets. Cuban’s larger point--that most of us are not Twitter-locked--holds up.", "We rate the claim Mostly True.", "MOSTLY TRUE – The statement is accurate but needs clarification or additional information. Click here for more on the six PolitiFact ratings and how we select facts to check.", "Twitter accounts, President Donald Trump and former President Barack Obama (accessed July 20, 2017)", "Truth-O-Meter article, \"Steve Adler wrongly claims first tweet was sent from Austin,\" PolitiFact Texas, May 20, 2016", "Web page showing Twitter statistics, \"It's what's happening,\" Twitter.com, last updated June 30, 2017 (accessed July 20, 2017)", "Emails, Mark Cuban, July 5, 2017", "Phone interview, Perry Gold, analyst, MoffettNathanson LLC, July 14, 2017", "Web pages and document, Twitter Inc., \"Selected Company Metrics and Financials,\" first quarter of 2017; letter to shareholders, April 26, 2017 (accessed July 20, 2017)", "Web page, \"Quick Facts, United States,\" U.S. Census Bureau, undated (accessed July 20, 2017)", "Web post, \"Latest Rankings, Top 50 Multi-Platform Properties (Desktop and Mobile),\" Comscore, June 2017 (accessed July 20, 2017)", "Email (excerpted), Meredith Clark, assistant professor, Frank W. and Sue Mayborn School of Journalism, University of North Texas, July 20, 2017", "Emails, Deen Freelon, associate professor of media and journalism, University of North Carolina-Chapel Hill, July 20, 2017", "Web post and report, \"Social Media Update 2016,\" \"Social Media Update 2016,\" Pew Research Center, Nov. 11, 2016", "Email, Dhiraj Murthy, associate professor of journalism and sociology, University of Texas, July 20, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]