["About this rating", "Health officials in China have started using anal swabs in certain situations to test people for COVID-19.", "As of this writing, nasal and throat swabs are still the most common for COVID-19 tests.", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "In January 2021, social media users were a bit surprised to see reports circulating that health officials in China had started using anal swabs to test for COVID-19:", "Generally speaking, this is true. Chinese state media outlets have reported that anal swabs have been used to test for COVID-19. It should be noted, however, that these tests are only being used in specific situations, and that throat and nasal swabs are still the preferred method.", "The Washington Post reported:", "Chinese state media outlets introduced the new protocol in recent days, prompting widespread discussion and some outrage. Some Chinese doctors say the science is there. Recovering patients, they say, have continued to test positive through samples from the lower digestive tract days after nasal and throat swabs came back negative.", "[...]", "Even Chinese doctors in support of the new tests said the method’s inconvenience meant it only made sense to use in select groups, such as at quarantine centers.", "“If we add anal swab testing, it can raise our rate of identifying infected patients,” Li Tongzeng, an infectious-disease specialist at Beijing You’an Hospital, said on state-run broadcaster CCTV on Sunday. “But of course considering that collecting anal swabs is not as convenient as throat swabs, at the moment only key groups such as those in quarantine receive both.”", "Tongzeng said that anal swabs \"can increase the detection rate of infected people\" as traces of COVID-19 remain longer in fecal matter than in the respiratory tract. Still, this method is only being used in certain situations, and primarily with people who are already under quarantine.", "Reuters writes:", "Anal swabs require inserting a cotton swab 3 to 5 centimetres (1.2 to 2.0 inch) into the anus and gently rotating it. Last week, a Beijing city official said that anal swabs were taken from over 1,000 teachers, staffers and students at a primary school in the city after an infection had been found. Their nose and throat swabs and serum samples were also collected for testing.", "Additional tests using anal swabs can avoid missing infections, as virus traces in faecal samples or anal swabs could remain detectable for a longer time than in samples taken from upper respiratory tract, Li Tongzeng, a respiratory and infectious disease doctor in Beijing city, told state TV last week. He added that such samples are only necessarily for key groups such as those under quarantine.", "While anal swabs may help detect COVID-19, there's still no evidence that the disease can be spread via fecal matter.", "Yang Zhanqiu, a pathologist at Wuhan University, told the Global Times: \"There have been cases concerning the coronavirus testing positive in a patient’s excrement, but no evidence has suggested it had been transmitted through one’s digestive system.\"", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]