["About this rating", "On 31 May 2018 Huffington Post reporters Andy Campbell and Jesselyn Cook published an article about Nathan Larson, a Independent candidate from Charlottesville, Virginia, who was running for House seat in the U.S. Congress.  The story was headlined \"Congressional Candidate in Virginia Admits He’s a Pedophile\" and opened as follows:", "Nathan Larson, a 37-year-old accountant from Charlottesville, Virginia, is running for Congress as an independent candidate in his native state. He is also a pedophile, as he admitted to HuffPost on [31 May 2018], [and] has bragged in website posts about raping his late ex-wife.", "In a phone call, Larson confirmed that he created the now-defunct websites suiped.org and incelocalypse.today — chat rooms that served as gathering places for pedophiles and violence-minded misogynists like himself. HuffPost contacted Larson after confirming that his campaign website shared an IP address with these forums, among others. His sites were terminated by their domain host on [29 May 2018].", "On the phone, he was open about his pedophilia and seemingly unfazed about his long odds of attaining government office.", "“A lot of people are tired of political correctness and being constrained by it,” he said. “People prefer when there’s an outsider who doesn’t have anything to lose and is willing to say what’s on a lot of people’s minds.”", "When asked whether he’s a pedophile or just writes about pedophilia, he said, “It’s a mix of both. When people go over the top there’s a grain of truth to what they say.”", "Huffington Post quoted a \"manifesto\" in which Larson described Adolf Hitler as a “white supremacist hero,\" urged the repeal of the Violence Against Women Act, and stated that “[citizens] need to switch to a system that classifies women as property, initially of their fathers and later of their husbands.” Cook and Campbell also quoted message board posts in which Larson purportedly \"repeatedly expressed a desire to have sex with infants and children, including his own daughter.\"", "Huffington Post was not the first news site to cover Larson's ideology. In March 2017, the Washington Post reported that Larson, who was then seeking state office, had served time in prison for threatening to kill the President of the United States and was running on a platform that included the legalization of child pornography:", "When accountant Nathan D. Larson was talking to voters and collecting signatures to qualify as a candidate for Virginia’s House of Delegates, he left out some unusual details from his résumé:", "In 2009, he pleaded guilty to threatening to kill the U.S. president, an admission that led to 16 months in federal prison and three years of supervised release. Since then, among other things, he has advocated for legalizing incestuous marriage and making it harder to win a court restraining order against an allegedly abusive spouse. Larson’s criminal record precluded him from running for office until [2016], when Virginia Gov. Terry McAuliffe (D) restored voting and other civil rights to thousands of convicted felons across the state.", "Larson, 36, says his candidacy is rooted in a genuine desire to bring positive changes to Virginia. He called a letter he sent to the Secret Service in 2008 that warned of his imminent plans to assassinate either President George W. Bush or President Barack Obama an act of civil disobedience meant to call attention to what he believes is the tyranny of the U.S. government.", "“It doesn’t allow people to secede or do anything like that,” Larson said. “If people want to break away from the majority, they’re not allowed to do that.”", "His platform includes legalizing child pornography as well as incestuous marriage; allowing men to have multiple wives and physically discipline them; repealing the 19th Amendment; and abolishing state funding for girls and women to attend high school and college.", "Even earlier, on 16 December 2015, a Colorado Springs Independent article on a court case pertaining to the custody of Larson's then-infant daughter mentioned Larson's acknowledgement that he was \"physically attracted to children\":", "Nathan Larson, who acknowledges being physically attracted to children, raised eyebrows in El Paso County when he began his quest to seek custody of his infant daughter.", "The 35-year-old part-time accountant, who lives with his parents in Virginia, traveled to Colorado Springs in October [2015] for a jury trial. Larson hoped to prove he would be a fit parent in what's called a dependency and neglect case. The case, which is not criminal, couldn't terminate his parental rights. But it could prevent him from immediately taking custody of his baby daughter (who currently lives locally with her maternal grandparents), if he were found to be a danger to the girl.", "The jury, presented with a barrage of evidence of Larson's pedophilic desires as well as his own admission, unsurprisingly decided he shouldn't be left in charge of the girl ... Larson, however, was free to continue seeking custody so long as he followed the orders of a judge. According to Larson, who sent the Independent several emails following up on the matter, the judge ordered that he could not be trusted with his daughter unless \"a risk assessment said it would be okay.\"", "That news outlet quoted a contemporaneous email received from Larson confirming the filing of paperwork to sever his parental rights in which he referenced being \"attracted to kids\" and \"question[ing] the harmfulness of adult-child sex\":", "I had a psychological evaluation of this sort done a few years ago, and the recommendation was that I not be allowed to be around kids unsupervised ... It's evident that when a patient says that he is attracted to kids, and that he questions the harmfulness of adult-child sex, the standard procedure of mental health workers is to recommend against allowing unsupervised contact with kids. But it's hard to raise a kid without being able to see her outside the presence of a social worker.", "The Colorado Springs Independent had also reported on Larson's custody case a month earlier (\"When Dad Is a Pedophile\"), quoting statements and online comments about adult-child sex that Larson identified as his:", "Larson says he doesn't think he would molest his own daughter but isn't sure, since he's \"never been in that kind of situation before.\" He does, however, think it's OK for adults to engage in sexual acts with children, as long as there is what he refers to as \"consent,\" although the age at which a child can \"consent\" to such activities depends on the child, he says, because some children are \"precocious.\"", "\"The way I feel about it is that if I had a son, I don't think I would have any interest in engaging in those activities with him,\" he wrote. \"My attitude would be, if he's going to [be] involved in incestuous activities, that may as well be with a sibling or his mother or something.\"", "That article surmised that \"Larson doesn't seem clued in to the repulsion people commonly feel toward child molesters and said \"he had held out hope that the jurors would see his point of view, especially since he had only met the girl once, in a supervised visit.\" At the time of publication, Larson's spouse was deceased, and the circumstances of their \"rocky marriage\" were evidenced in court:", "In an email that was an exhibit for the case, however, Larson admits to abuse, including raping Finn, and apologizes that his desire to molest their children caused Finn stress.", "\"It didn't concern me that given my history of raping you, as well as the gravity of what I was proposing doing with the children, I might irreparably destroy our relationship and any prospect of my ever seeing the children (especially unsupervised),\" he wrote.", "As for Larson's congressional campaign, his nathanlarson.org web site was not operational as of 1 June 2018, although archived versions of it were captured a few weeks earlier, and separate election-related sites still listed Larson as a candidate in Virginia's 10th congressional district.  Larson eventually withdrew from the race before the general election.", "Cook, Jessalyn and Andy Campbell.   \"Congressional Candidate in Virginia Admits He’s a Pedophile.\"\r\n    Huffington Post.   31 May 2018.", "Olivo, Antonio.   \"He Threatened to Kill the President. Now He Is Seeking Public Office.\"\r\n    The Washington Post.   8 March 2017.", "Stanley, J. Adrian.   \"Nathan Larson Says He Won't Seek Custody of Baby.\"\r\n    Colorado Springs Independent.   16 December 2015.", "Stanley, J. Adrian.   \"When Dad Is a Pedophile.\"\r\n    Colorado Springs Independent.   11 November 2015.", "NathanLarson.org.   \"About Nathan Larson for Congress.\"\r\n    Archive accessed on 1 June 2018.", "Vote Smart.   \"Nathan Larson's Biography.\"\r\n    Accessed 1 June 2018.", "Wikipedia.   \"Virginia's 10th Congressional District Election, 2018.\"\r\n    Accessed 1 June 2018.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]