["About this rating", "First Alabama tried to redefine the value of pi to 3. Then Kansas removed the requirement for teaching evolution in its public schools. We thought it couldn't get any worse, but then Mississippi came along and proved us wrong:", "13 August 1999", "Jackson, MS — Bolstered by the state of Kansas' recent measure removing the requirement for the teaching of evolution in public schools, yesterday afternoon the Mississippi legislature passed a bill eliminating fractions and decimal points from the mathematics curriculum of all public secondary schools in the state.", "\"Despite the coincidental timing of the measure, this was no whim,\" asserted Mississippi state senator Cassius de Spain. \"We'd had the issue under consideration for several months now.\"", "The bill, which cleared the Mississippi Senate by a vote of \"a lot\" to \"a little\" (with \"this many\" senators abstaining) after some initial confusion over how many votes constitute a \"majority,\" directs public secondary schools in Mississippi to emphasize whole number arithmetic in mathematics courses and orders the removal of questions involving non-integer mathematics from standardized state tests after 1999. The fate of percentages remains undetermined as educators attempt to work out an alternative scoring method for tests.", "Judith Sutpen, chairperson of the Mississippi Senate Education committee, defended the legislature's action against charges that it was motivated by \"controversial religious beliefs.\"", "\"This has absolutely nothing to do with religion,\" she told reporters at a press conference Friday morning. \"We're simply seeking to make mathematics more accessible to schoolchildren by\nde-emphasizing the elements that so many of them find confusing. It makes no sense to try to train our students how to think logically, then present them with nonsensical concepts such as 'irrational' and 'imaginary' numbers.\"", "Senate minority leader Cora Tull indicated that religion did play a part in the passage of the legislation, however, maintaining that \"if cardinality is good enough for the Catholic church, it ought to be good enough for the children of the great state of Mississippi.\" She added that \"'improper fractions' have no place in any respectable school system, public or private.\"", "Freshman senator John Sartoris of Brookhaven elaborated on the reasons for his colleagues' support of the bill: \"We're sick and tired of hearing about how everything in our culture, from art to entertainment to education, is aimed at the 'lowest common denominator' of society. We're took aggressive action to do something about it yesterday by eliminating that denominator.\"", "School librarians expressed concern about whether they will be able to continue categorizing books according to the Dewey decimal system once the law goes into effect, but Jason Compson, chief librarian for the Greater Biloxi School District, opined that \"anyone who couldn't beat that pinko Truman doesn't deserve a place of honor in our schools' libraries anyway.\"", "Several senators indicated that an additional measure aimed at removing \"irregular verbs\" from English classes might be in the offing.", "Additional information:", "More information about this page", "McCannon, Shreve.   \"Mississippi Gets the Point.\"\r\n    Yoknapatawpha County Register.   13 August 1999   (p. 1).", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]