["“You Can be Fined $2,500 And Banned From Driving For Smoking While You Drive In Canada, Starting Today,” reads the headline of an article from toronto-ontario.news dated September 2, 2020.", "The article claims that “smoking while driving in Canada is officially illegal” in the provinces of Ontario, Newfoundland and Labrador, Nova Scotia, New Brunswick, Quebec, Alberta, Saskatchewan, British Columbia, and Manitoba. The list did not include Prince Edward Island and the three Canadian territories.", "Although the article is dated from September, Facebook says it was shared at least 6,300 times since February 8, 2021, including by a Facebook page called “Only In Canada,” which has the same logo with and promotes content from the toronto-ontario.news website.", "Though it appears to be a local Canadian page, examining the Facebook transparency report shows that the page administrators seem to be in Kosovo:", "The page is among a series of websites which appear to be local Canadian pages but are not, and have been debunked by AFP Fact Check for false claims about fines for using cellphones in a car, food recalls and immigration.", "The governments of Ontario, Quebec, British Columbia, Newfoundland and Labrador and New Brunswick told AFP in separate emails that no mention of a $2,500 penalty or driving ban can be found in their respective road safety codes.", "In addition, references to such penalties for smoking while driving cannot be found on the websites of the Nova Scotia, Alberta, Saskatchewan or Manitoba governments either.", "AFP Fact Check examines the laws in each province.", "A spokesman for Ontario’s Ministry of Transportation said in an email that “there is no provision in the Ontario Highway Traffic Act that specifically prohibits smoking in motor vehicles.”", "However, he said it is illegal under the Smoke-Free Ontario Act to smoke tobacco or cannabis in a vehicle if a person younger than 16 is present. The offence may lead to a fine up to $1,000.", "In Quebec the situation is the same as Ontario. The province’s Highway Safety Code has no prohibition on smoking while driving, but the Tobacco Control Act states that smoking is prohibited in “motor vehicles in which a minor under 16 years of age is present,” a spokeswoman for the Quebec Ministry of Transportation said.", "The fine starts at $250 for the first offense and can rise up to $1,500 for subsequent offenses.", "On the west coast, a spokeswoman for the BC Ministry of Public Safety and Solicitor General said that under the Motor Vehicle Act, Section 231.1, nobody can smoke in a vehicle “that is occupied by a person under the age of 16.” She added that the fine for violators is $109 but “no driving ban or vehicle impoundment applies for this offence.”", "“The information contained in this article is not accurate,” a spokeswoman for the Newfoundland and Labrador Department of Health and Community Services said that “since 2011, the provincial Smoke-free Environment Act prohibits smoking in a motor vehicle when a person under the age of 16 is present. Otherwise, smoking can be permitted.”", "The fine upon conviction can be between $50 and $500, but starts at $500 for “an operator, employer or owner,” she said.", "In the Maritimes province of New Brunswick, “there is nothing in the Motor Vehicle Act that references smoking while driving,” a spokeswoman for the New Brunswick Department of Justice and Public Safety said.", "The Smoke-free Places Act states that “no person shall smoke in a vehicle while another person in the vehicle is under the age of 16 years,” and that violators could face “a fine of not less than $140 and not more than $1,100.”", "The Alberta Traffic Safety Act makes no mention of smoking while driving. The government specifies on a webpage about distracted driving that smoking is “not specifically restricted under the law.”", "Alberta also recently warned on its website that “false information has been circulating about supposed changes to Alberta’s distracted driving laws.” It added that “these rumors around new rules and stricter penalties are false. Alberta’s distracted driving laws and penalties are not changing at this time.”", "The Nova Scotia Smoke-free Places Act states that “no person shall smoke in a motor  vehicle when any person under the age of 19 years is present in the vehicle regardless of whether any window, sunroof, cartop, door or other feature of the vehicle is open.”", "The Act says that violators could face “a fine of not more $2,000.”", "A webpage dedicated to penalties for distracted driving by Saskatchewan Government Insurance (Saskatchewan driver’s licence and vehicle registration service, SGI) mostly mentions the use of cellphones.", "When the province implemented new distracted driving measures in early 2020, SGI spokesperson Tyler McMurchy told the Canadian Broadcasting Corporation: “There is no law specifically against switching radio stations, drinking a coffee, or smoking a cigarette while you drive… It’s the driving behavior that results from anything that is a potential distraction.”", "Manitoba’s Highway Traffic Amendment Act says: “No person shall smoke tobacco or have lighted tobacco in a motor vehicle while another person who is younger than 16 years of age is in the vehicle” and that offenders are punishable by a fine of “not more than $1,000.”", "A summary of the penalties incurred for cell phone/distracted driving offenses in each province can also be found on the Canadian Automobile Association website.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]