["New York Sen. Kirsten Gillibrand speaks during the first day of the Democratic National Convention on July 25, 2016, at the Wells Fargo Center, Philadelphia, Pa. (TNS)", "New York Democratic Sen. Kirsten Gillibrand put Hillary Clinton’s stance on women’s issues front and center at the first night of the Democratic National Convention.", "Gillibrand offered Clinton as a person who would bring America into the 21st century, and played off a popular television series about advertising executives in the 1960s where women were relegated to making coffee.", "\"Our policies are stuck in the Mad Men era,\" she said. \"We are the only industrialized nation that does not guarantee workers paid family leave. Many women can't even get a paid day off to give birth.\"", "Gillibrand’s comparison of America to the rest of the industrialized nations is a familiar Democratic talking point.", "Bernie Sanders has said it. So has President Barack Obama. Twice.", "The claim rates Mostly True, and here’s why.", "What America has", "Under the Family Medical Leave Act, employers with 50 or more workers must allow parents 12 weeks of job-protected leave annually to care for a newborn. While this means those individuals can take the time off without fear of losing their job, in most cases the leave is unpaid.", "There are a couple of exceptions. California, New Jersey and Rhode Island offer paid family leave through employee-paid payroll taxes.", "Some employers choose to provide paid maternity leave, but that touches only about 13 percent of workers according to the Bureau of Labor Statistics.", "What other countries have", "The Organization for Economic Cooperation and Development studied paid maternity leave for about 34 OECD countries -- advanced nations -- and seven additional European Union countries. On average across OECD countries, mothers are entitled to 17 weeks of paid maternity leave.", "The United States is the only country with no national law to provide that benefit.", "According to the International Labor Organization, an agency of the United Nations, the United States and New Guinea are the two countries out of 170 that provide no cash benefits of any kind to women during maternity leave.", "Of the 41 other developed countries highlighted by the report, the United States also mandates the shortest period of time off — 12 weeks.", "Parents do particularly well in Australia and the United Kingdom, where they are eligible for a full year, although not all of that is paid leave.", "The main caveat when looking at other nations is that some of them limit who is eligible.", "In Canada, temporary workers can’t get cash benefits. Canada also excludes migrant workers and people who own more than 40 percent of their business. Norway and Switzerland exclude home workers, and some civil servants don’t get any benefits in Japan.", "The International Labor Organization sets a standard for what countries should provide in a benefits package: 1) Women should receive at least 14 weeks off; 2) They should be reimbursed at least two-thirds of their previous earnings; and 3) The benefit should be paid almost entirely by the state through public funds or Social Security.", "The United States is the only developed country to meet none of the benchmarks (and one of just 14 studied worldwide that didn’t check off any of the three). But six other countries fall short of at least one goal.", "Our ruling", "Gillibrand said that America is the only industrialized that doesn't guarantee workers paid family leave. If you don’t live in one of two states that require paid family leave, or work for an employer that voluntarily offers it, you can take time off when a little one arrives, but you won’t get paid.", "All other developed countries surveyed by the International Labor Organization mandate at least some paid maternity leave. Another international study by the Organization for Economic Cooperation and Development found the same thing.", "There are some exclusions and limits in some countries, so the benefit is not universal.", "On balance, the statement holds up and we rate it Mostly True.", "https://www.sharethefacts.co/share/a1644f61-7467-4b83-bced-b2c7ac9f3126", "Democratic National Convention, Sen. Kirsten Gillibrand, July 25, 2016", "International Labor Organization, \"Maternity and Paternity at Work,\" 2014", "Organization for Economic Cooperation and Development, Trends in parental Leave Policies since 1970 and update, 2015", "Institute for Women’s Policy Research, \"Paid Parental Leave in the United States: What the Data Tell Us about Access, Usage, and Economic and Health Benefits,\"January 2014", "Bureau of Labor Statistics, Employee Benefit Survey, March 2014", "PolitiFact, Barack Obama says United States only developed country without paid maternity leave, Jan. 21, 2015", "PolitiFact, Bernie Sanders says 'every other major country' has family paid leave except United States, Oct. 14, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]