["The budget deficit has fallen by two thirds since 2009/10, just before the Coalition came into power.", "That's correct.", "In 2010 the budget deficit was running at over 10% of the UK’s GDP.", "That's correct.", "“We inherited in 2010 a budget deficit that was running at over 10% of our GDP and we have brought that down by two thirds over the last six years.”", "Philip Hammond, BBC Radio 4, 24 November 2016", "Those figures are correct.", "In 2009/10, the year before the coalition government came into power, government borrowing equalled just over 10% of UK’s gross domestic product (GDP), the value of what we produced as an economy that year. In 2015/16 it equalled 4% of GDP, and it’s forecast to fall to 3.5% in 2016/17, a fall of near enough two thirds.", "‘Public sector net borrowing’ is the headline measure of the government’s budget deficit. It’s the difference between the government’s income (mainly taxes) and everything it spends on public services, investment, and debt interest.", "One reason for the fall in borrowing as a proportion of GDP since 2010 is that the government spent less. The cash value of the government’s deficit fell by about half. In 2009/10 the government borrowed about £155 billion; in 2015/16 it borrowed about £76 billion.", "Another reason why borrowing fell as a percentage of GDP was that GDP got bigger. The cash value of UK GDP rose by almost a quarter, from about £1,530 billion in 2009/10 to about £1,880 billion in 2015/16.", "The Coalition government had said it was going to reduce the deficit by more than that. In its first budget, it said that it would eliminate what’s called the ‘cyclically-adjusted current budget deficit’ by 2015/16.", "That’s a narrower measure of the government’s deficit. It doesn’t include investment spending, and it’s adjusted to take into account of whether the economy is in a ‘boom’ or ‘bust’ period. Over the past 10 years, the cyclically-adjusted current deficit has been about half of public sector net borrowing.", "By focusing on the cyclically-adjusted current budget deficit, the coalition government aimed to avoid creating an incentive to cut investment spending unnecessarily, and to give itself the flexibility to deal with potential economic crises.", "But the cyclically-adjusted current budget deficit wasn’t eliminated. It did roughly halve, falling from a cash value of about £72 billion in 2009/10, to about £38 billion in 2015/16.", "By implication, the broader measure ‘public sector net borrowing’, which Mr Hammond was referring to, didn’t fall by as much as the Coalition hoped for either.", "Full Fact fights for good, reliable information in the media, online, and in politics.", "Bad information ruins lives. It promotes hate, damages people’s health, and hurts democracy. You deserve better.", "Full Fact, 17 Oval Way, London, SE11 5RR", "Full Fact is a registered charity (no. 1158683) and a non-profit company (no. 06975984) limited by guarantee and registered in England and Wales. © Copyright 2010-2023 Full Fact. Thanks to Bytemark for donating our web hosting.\n                        \n                        Privacy, terms and conditions."]