["“CDC Exposed: Inflated Covid Deaths By 1600% Throughout The Election, ‘Violated Multiple Federal Laws’ Peer-Reviewed Study Finds,” says the headline of an article published on February 9, 2021 by conservative news site 100% Fed Up.", "Articles from 100% Fed Up and Gateway Pundit both cite a story from the National File.", "The three articles have been shared more than 33,000 times in total on Facebook, according to social media monitoring tool CrowdTangle.", "The stories cite as evidence for the claim a 25-page paper issued by “An Institute for Pure and Applied Knowledge,” (IPAK) which levels the accusation: “The existing Covid-19 fatality data, which has been so influential upon public policy, may be substantially compromised regarding accuracy and integrity, and illegal under existing federal laws.”", "The paper concludes that had the CDC used 2003 guidelines -- which were in effect up until Covid-19 hit -- the total death toll from the disease would be approximately 16.7 times lower than what is currently being reported.", "This amounts to an increase of 1,567 percent, using the data IPAK presented.", "“Federal agencies that make changes to how they collect, publish, and analyze data without alerting the Federal Register and OMB as a result, are in violation of federal law,” the paper also says.", "“We believe this deliberate decision by the CDC and NVSS to deemphasize pre-existing comorbidities, in favor of emphasizing Covid-19 as a cause of death, is in violation of 44 U.S. Code 3504 (e)(1)(b),” the report says, referring to the National Vital Statistics System which falls under the CDC’s National Center for Health Statistics (NCHS).", "The Covid-19 toll has been the subject of multiple false claims, including that the US health authorities revised down the number of deaths caused by the pandemic.", "Bob Anderson, chief of mortality statistics at NCHS, told AFP in a phone interview that the claim “doesn’t have any validity.”", "In an email, he added: “Under the previous guidelines (issued in 2003), the number of Covid-19 deaths would not be substantially different. This is because the new guidance is essentially the same as the old. The only difference is that the new guidance focuses specifically on Covid-19.”", "Anderson explained that the authors of the report incorrectly assume that, under the 2003 guidelines, only death certificates listing Covid-19 with no other simultaneous diseases or contributing causes -- called comorbidities -- should be counted in the total toll, and if comorbidities are present then Covid-19 can’t be counted as the underlying cause.", "“Very few death certificates overall report only one condition, because the guidance (both old and new) instructs the certifier to report the chain of events leading to death. Most of the time, the chain has multiple links.”", "In the phone interview, Anderson said, “We still ask physicians to provide a chain of events leading to death, so a causal pathway… start with the immediate cause and work back to the underlying cause. That hasn't changed.”", "The authors also conflate a coding change with a guidance change, he added.", "NCHS put out an alert to the states on March 24, 2020 to notify them that there was going to be a new International Classification of Diseases (ICD) code. On April 2, the agency released new guidance -- not rules -- for certifying Covid-19 deaths, updating the 2003 version, Anderson said.", "All causes of deaths have ICD codes, and as Covid-19 didn’t exist before, a new code was needed, Anderson explained.", "Sarah Wetter, an attorney with the The Network for Public Health Law, explained in an email that the changes fall in line with federal law, and that the articles’ claims are “simply not true.”", "“While the federal rulemaking procedure does typically require a process for public notice and commentary, the CDC did not make a new rule, or even revise an existing rule in this instance. CDC simply issued a new code, and guidance on how to use it, for reporting Covid-19 as the cause of death on death certificates, given that it is a new disease.”", "Even if there were such a requirement, “it would likely be waived under emergency circumstances” like the Covid-19 crisis, Wetter said.", "Robert Gatter, health law professor at the Saint Louis University School of Law, agreed: “Reporting that a new diagnostic code is available, and should be used, and giving some guidance as to how it should be used is completely within the authority that's listed” in the law, he said.", "“Even if there was a ground for disagreeing with how that guidance was worded, it's a far cry to then say, ‘Oh, so you have failed to ensure integrity,’” referring to statistics standards required by the statute the CDC is alleged to have violated.", "In order to understand the CDC’s guidance, people need to read the website thoroughly, not “cherry pick a couple of things on the dates that serve you,” Gatter said.", "He said the claims are an attempt to suggest that “the information coming out from the government, if it doesn't support my view of Covid, must be a conspiracy.”", "Anderson added: “There's no federal law governing how death certificates should be filled out… So this idea somehow CDC violated the law by making these changes is ridiculous.”", "The accusation that the CDC inflates Covid-19 death counts is not new -- AFP debunked a similar false claim in August 2020.", "More than 495,000 Americans have died from Covid-19 at the time of this article’s publication.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]