["According to the article, Pelosi violated a federal law that requires the speaker to preserve every speech “given before Congress” for the National Archives, and will have to pay a $40,000 fine.", "Pelosi’s deputy chief of staff, Drew Hammill, told AFP by email that Pelosi had not been charged or financially punished for her actions.", "When contacted by AFP, the Justice Department declined to comment.", "The original post, from a subsidiary of satire group America’s Last Line of Defense, is clearly labeled as parody, but the popular copycat version is not. Accordingly, many Facebook users have shared the article believing it to be true.", "The National Archives and Records Administration -- which retains historical records for Congress -- said it expected the White House to send Trump’s version of the speech to them. The document that Pelosi tore up was a copy of the president’s remarks.", "Countering the claim that the speaker had breached record-keeping rules by destroying the document, a spokeswoman for the National Archives suggested there was no requirement to submit a copy to the agency.", "“The rules governing those records are not determined by federal laws or overseen by NARA, but rather by each Chamber’s agreed upon rules,” said an emailed statement.", "Regardless, Representative Matt Gaetz, a Republican from Florida, sought legal action when he filed an ethics complaint against Pelosi on February 5.", "His complaint urged the House Committee on Ethics to request a criminal referral for Pelosi’s “potential violation” of 18 US Code section 2071, which bans “willfully” destroying records filed in a public office.", "Several versions of Gaetz’s accusations have spread on social media, including this tweet with more than 8,000 retweets.", "A.J. Kramer, a federal public defender who has previously litigated on this statute, called the claim “a bunch of nonsense.”", "“As I understand it, that was a copy of the speech. It wasn’t filed or deposited with any clerk or officer of any court of the United States,” Kramer said.", "Pelosi ripping up her personal copy “wouldn’t come even close to violating the statute,” Kramer said.", "“There was no violation,” he added.", "Trump himself retweeted a misleading video that included footage of Pelosi ripping up her copy of the February 4 remarks several times after key moments of the speech. In fact, she did so only at the end.", "The more than five-minute video -- originally posted by the president's director of social media, Dan Scavino -- implies that in ripping up the speech, Pelosi was criticizing the people Trump spoke of and honored in his remarks.", "Pelosi has meanwhile accused Trump of using “the Congress of the United States as the backdrop for a reality show,” and said that she “tore up a manifesto of mistruths.”", "Trump is also in the habit of tearing up official documents, POLITICO reported in 2018. But since the Presidential Records Act requires that the White House preserve all documents that pass through Trump’s hands, his staff often has to tape the pieces back together to make sure the president did not break the law.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]