["A screenshot of a supposed broadcast which attributes a quote to rape-accused Bishop Franco Mulakkal is getting shared on social media – “Whatever happened between me and nun, it is not rape. It is the Holi Ritual of enlightenment to feel the Magical Existence of Holi Jesus at the end of the act.” While posting the screenshot, one Facebook user Rajesh Anubhav commented, “भाई तर्क तो लाजवाब है कोर्ट ने भी मान लिया क्या? (Brother’s logic is amazing. Did the court also agree? -translated)”. Franco Mulakkal, a bishop with a Jalandhar diocese, accused of raping a nun at a convent, will be reportedly facing trial at a Kerala court this November.", "भाई तर्क तो लाजवाब है कोर्ट ने भी मान लिया क्या?", "Posted by Rajesh Anubhav on Sunday, 3 November 2019", "A few more users on Facebook shared the image with an identical narrative.", "Alt News had earlier debunked this fake quote ascribed to Mulakkal in September 2018. Parody handle Unpaid Times was the first to tweet the screenshot that carried the quote attributed to the Bishop. The Twitter biography of Unpaid Times clearly states that it is an “Indian Satirical News Website”. However, as it happens ever so often, many people fall for such satire and circulate the information believing it to be true.", "‘Whatever happened between me and nun, it is not rape. It is the Holi Ritual of enlightenment to feel the Magical Existence of Holi Jesus at the end of the act’: Bishop Franco Mulakkal, accused of Rape. pic.twitter.com/F6E7hVMK3q", "— The UnPaid Times (@UnPaidTimes) September 12, 2018", "In 2018, Madhu Kishwar had also tweeted the screenshot. The tweet has still not been deleted.", "Awesome! May more & more skeletons come pouring out of the safe vaults of Christianity so people are disabused of their naive notions about the Church pic.twitter.com/PQqHmrnEsL", "— MadhuPurnima Kishwar (@madhukishwar) September 17, 2018", "In conclusion, a screenshot attributing a fake quote to rape-accused Franco Mulakkal that was first shared by a parody handle is again circulating on social media.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]