["About this rating", "On 17 April 2017, a video was posted to the Facebook page \"I'm From Denver\", showing what appears to be an unidentified flying object. The video, which came with a claim that it was spotted over southern Colorado, was shared more millions of times:", "Because the page didn't say exactly where in southern Colorado the video was allegedly filmed, we couldn't check with local authorities to verify whether residents actually saw something that looked extraterrestrial in the night sky and caused alarm. However, as the video shows something rather outlandish happening, one would expect it to have been covered by the local news media, but there were no reports in Colorado matching the description of such a sighting (although the southern Colorado region known as San Luis Valley is an apparent hotspot for UFO sightings).", "This video, in fact, didn't originate in Colorado, but was initially reported in March 2017 with people claiming they had seen the alien craft somewhere over Sonora, a Mexican state that touches the United States border:", "https://youtu.be/rVeZfKi48Mw\n\nHumans have had no known contact with extraterrestrials; however, we aren't sure whether the video was computer generated or the result of a light trick. There were tabloid media reports out of Mexico that claimed residents saw the object and were frightened by it, but they didn't quote any sources. Meanwhile, the use of drones using LEDs to create light shows (or troll the credulous) is a well-known pastime.", "Gabe Hash, a Spanish-language YouTube personality who delves into unexplained phenomena, claimed he could explain the video with the help of two computer-savvy volunteers who were able to recreate the effect in less than a day using a program called Adobe After Effects:", "https://youtu.be/Kl7McZBdpk0\n\nIn the video, Hash cast doubt on the idea that the lights seen in the video were real as opposed to computer generated, saying (in Spanish):", "The post says that the object was seen by residents. But that's not true, since there is no other proof besides this video and no official mention of the event. Secondly, the video is only 30 seconds long and nobody is talking while the person is recording it, meaning that it meets all the characteristics of an animation. Most of the video is blurry and as I've said below, this is done to camouflage the animation ... In conclusion, in our opinion the video is fake and just an animation rendered via computer. Judge for yourselves.", "Vincent, James.   \"This Flying 1,000 Watt Spotlight Drone Creates Eerie, Beautiful Footage.\"\r\n    The Verge.   17 October 2017.", "Torres, Kevin.   \"UFO Sightings Are Common in Tiny Colorado Town.\"\r\n    KDVR-TV.   24 January 2016.", "El Grafico.   Difunden en Redes a Luminoso Objeto Volador y Causa Terror.\"\r\n    17 April 2017.", "Speigel, Lee.   \"TV Station Refuses to Comment on UFO Over San Diego.\"\r\n    Huffington Post.   5 May 2015.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]