["About this rating", "Televangelist Pat Robertson has a history of making controversial remarks in the wake of both human-made and natural disasters. In October 2017, for example, he placed some of the blame for a mass shooting in Las Vegas on Americans who, in Robertson's view, showed disrespect to law enforcement, U.S. President Donald Trump, and the American flag. The televangelist has also blamed the sinful for provoking God's anger after natural disasters, such as the catastrophic earthquake in Haiti in 2010.", "So when social media users came across an article in April 2019 that claimed Robertson had said the fire at Notre Dame Cathedral in Paris was the result of \"Hell bubbling over with homosexuals,\" some readers found the headline plausible:", "Moments after reports came in that the famed Notre Dame Cathedral in Paris was burning, televangelist Pat Robertson took to the CBN airwaves to advance a theory to viewers that the fire that engulfed the legendary parish was a result of “Hellfire spilling over from all the gays burning in it’s darkest recesses.”", "“It was bound to happen. This is all written in the Bible. We as a society just let everything be gay this and gay that,” lamented the minister. “Soon enough, there’s just too many homosexuals, and when all those surplus homosexuals started to die, Hell commenced with a burning so bright, so intense, there was bound to be some that would spill over to the Earth.”", "This text did not originate with a genuine news report, and this quote was not actually spoken by Robertson. This item was originally published on the satirical website Brown Valley Observer.", "The website explains the nature of the content in the \"About Us\" page:", "\"This is an entertainment website written to satirize news events, politics, and popular faces and ideas, and to provide commentary on social attitudes and trends.", "While familiar names of celebrities and other media figures are used, all news stories contained within are fictional in nature. Most of the words and actions attributed to these figures are created entirely by the author, who has tiny, feminine hands, and who was once friendzoned by his own sister.", "The purpose of this site is to entertain. Failing that, we’ll settle for “annoy”. We’re not a particularly proud publication.", "The Brown Valley Observer wasn't the only satirical outlet to target Robertson after the fire at Notre Dame. The website alternative-science.com published a similar jape claiming that Robertson said the fire never would have occurred if Notre Dame Cathedral had been built in \"Donald Trump’s America.\" Again, this was a fake quote.", "Zajac, Andrew.   \"Haiti Earthquake: Televangelist Pat Robertson Links Quake to 'Pact with the Devil.'\"\r\n    Los Angeles Times.   14 January 2010.", "Horton, Michael.   \"Yes, Pat Robertson Blamed the Vegas Shooting on ‘Disrespect’ for Trump and the National Anthem.\"\r\n    The Washington Post.   3 October 2017.", "Schlarmann, James.   \"Pat Robertson Says God Wouldn’t Have Let Notre Dame Burn If It Was In ‘Trump’s America.’\"\r\n    Alternative Science.   17 April 2019.", "Brown Valley Observer.   \"Pat Robertson Claims Notre Dame Cathedral Fire the Result of \"Hell Bubbling Over With Burning Homosexuals.\"\r\n    15 April 2019.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]