["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "It’s not an easy time to be a supporter of the health care law. There’s rage at every turn, for the millions of policy cancellation notices in Americans’ mailboxes, for the faulty online marketplace, and for President Barack Obama’s leadership in general.", "David Axelrod, Obama’s former campaign strategist and adviser, tried batting down the dearth of bad press with some positive statistics about the law Thursday on MSNBC’s Morning Joe.", "The law allows young adults under 26 to stay on their parents’ plan, prohibits insurers from refusing coverage to children with pre-existing conditions, and eliminates lifetime caps, Axelrod said.", "Plus, \"8.5 million Americans have gotten rebate checks because their insurance companies were spending too much money on executive bonuses and administrative costs and not enough on health care.\"", "Shortly after his segment, Axelrod took to Twitter and said he was talking about rebates sent in 2013.", "We wanted to know if his point is accurate.", "You’re probably wondering who got free money from their insurance companies, and why, because it likely wasn’t you.", "One of the health care law’s many requirements demands health insurance companies spend at least 80 percent of each dollar they charge in premiums on medical care, not for administrative purposes. Policy wonks know it as the medical loss ratio, or the 80/20 rule (for larger employers, it’s more like the 85/15 rule, but that’s more than we need to know for this fact-check).", "Some Americans know it as the way they got paid by their insurer. If a company spends less than 80 percent on medical services, it must return the difference to the consumer either as a cash payment or as a reduction in future payments.", "Two-thirds of insurance companies were already meeting the ratio without a policy change, according to a 2011 Government Accountability Office study, though compliance varied upon policy type. For example, 77 percent of companies that sold to large employers with more than 100 employees met the 80/20 rule, while only 43 percent of companies serving customers in the individual market were in compliance. The ratio does not apply to self-funded plans.", "Insurance companies had to report their premiums and spending for the first time in 2011. Companies returned $1.1 billion in total rebates to 13.1 million policyholders in 2012, according to Centers for Medicare and Medicaid Services data.", "Companies returned about half as much in rebates in 2013 to 8.85 million policyholders (Axelrod was citing the agency’s original estimate of 8.5 million recipients). The average rebate was $98.", "So Axelrod is on somewhat solid ground here. But there’s a caveat.", "While 8.85 million policyholders were due rebates, it doesn’t mean people are getting checks as Axelrod claimed. Our colleagues at PolitiFact  pointed this out in a statement from Obama over the summer. (Obama also tried to put a dollar amount on the checks, which led to a rating of Half True.)", "About one-third, or 2.9 million people, received rebates for coverage in the individual market in 2013 (the proportion was about the same in 2012). That means they physically got a check. The rest of the rebates went to the small and large employers who manage health insurance plans for their employees.", "Employers and employees often share the cost of health insurance, with employers picking up the bulk of the cost. In those cases, the rebate goes to the employer because they buy the insurance. But the law requires that the rebate be split proportionately. Employers can pay their employees in a lump sum, reduce future premiums or act by \"applying the rebate in a manner that benefits its employees,\" such as shoring up the health fund or offering better benefits.", "Again, the rebates came but they doesn’t mean it trickled down to policyholders in the form of a check.", "Our ruling", "Axelrod said, \"8.5 million Americans have gotten rebate checks because their insurance companies were spending too much money on executive bonuses and administrative costs and not enough on health care.\"", "He is correct on the number of rebates. However, like Obama before him, Axelrod’s claim isn’t clear on the fact that these checks are mostly going to employers who run plans for their workers, not individual Americans. Employers can then choose to pay their employees in a lump sum, reduce future premiums or act by \"applying the rebate in a manner that benefits its employees,\" such as shoring up the health fund or offering better benefits.", "We rate the statement Mostly True.", "Interview with Tim Skoczek, David Axelrod chief of staff, Nov. 21, 2013", "Interview with Timothy Jost, Washington and Lee University law professor, Nov. 21, 2013", "Interview with Alicia Hartinger, CMS spokeswoman, Nov. 21, 2013", "Interview with Clare Krusing, America’s Health Insurance Plans spokeswoman, Nov. 21, 2013", "PolitiFact, \"Barack Obama says millions benefit from insurance company rebates,\" July 24, 2013", "Associated Press, Fact Check: Obama spins health insurance rebates, July 19, 2013", "Centers for Medicare and Medicaid Services, Health care law saves consumers over $1 billion, June 21, 2012", "Centers for Medicare and Medicaid Services, 2012 MLR rebates by state, Aug. 1, 2013", "Kaiser Family Foundation, Explaining Health Care Reform: Medical Loss Ratio, February 29, 2012", "U.S. Government Accountability Office, Private Health Insurance: Early Indicators Show That Most Insurers Would Have Met or Exceeded New Medical Loss Ratio Standards, October 2011", "Centers for Medicare and Medicaid Services,  2012 MLR Rebates by State and Market, June 2013", "Centers for Medicare and Medicaid Services, The 80/20 Rule: Providing Value and Rebates to Millions of Consumers, June 2012", "Centers for Medicare and Medicaid Services, \"List of health insurers owing rebates in 2012,\" Nov. 26, 2012", "U.S. Labor Department, Guidance on Rebates for Group Health Plans Paid Pursuant to the Medical Loss Ratio Requirements of the Public Health Service Act, December 2, 2011", "Washington Post - The Fact Checker, President Obama’s claim that Americans saved $3.4 billion in health-care premiums, July 19, 2013", "America’s Health Insurance Plans, \"Medical loss ratio: What you need to know,\" Dec. 5, 2012", "The New York Times, \"Insurance rebates seen as early benefit of the health law,\" July 31, 2012", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]