["About this rating", "Rep. Darrell Issa did retreat from protesters with whom he normally holds question-and-answer sessions after speaking briefly with at least two.", "Issa did not \"hide\" on the rooftop of his Vista office; he was in plain view.", "On 30 May 2017, blogs began reporting that Rep. Darrell Issa (R-California) \"hid\" from constituents by standing on the roof of his office in Vista, a city in northern San Diego County. The stories were prompted by a tweet posted by Mike Levin, a Democrat who is challenging Issa in 2018, which showed a picture of Issa on the roof holding his phone along with a caption that indicates he was \"too afraid\" to speak with constituents.", "PoliticsUSA.com reported:", "Rep. Darrell Issa (R-CA) was so afraid of a group of protesters that he hid on the roof of his district office instead of listening to his constituents.", "Issa’s opponent Mike Levine tweeted a picture of Issa hiding on his district office roof to avoid angry questions from people about health care:", "Yes, this is really @DarrellIssa on the roof of his district office building. Too afraid to come speak with assembled constituents below. pic.twitter.com/wCYRjO8Ev8", "— Mike Levin (@MikeLevinCA) May 30, 2017", "Issa tweeted that he spoke to protesters who had gathered at 10 a.m. local time outside his district office, though an organizer said it was strange to seen him on the rooftop. Issa tweeted he was simply taking pictures of the crowd after chatting with them:", "Spent the morning talking with constituents gathered outside the office today, then popped upstairs to take a quick pic! pic.twitter.com/K2CFdenOIj", "— Darrell Issa (@DarrellIssa) May 30, 2017", "Mike Levin, an environmental attorney running against Issa in 2018, said he stands by his comment and believes that although Issa didn't technically hide, he did avoid rally attendees gathered outside his office by retreating from them. Levin told us:", "He preferred to be up on the roof taking pictures of his constituents rather than talking to them. So I stand by what I said 1,000 percent. Was he figuratively hiding? Absolutely.", "Protest organizer Ellen Montanari said Issa did speak to at least two protest attendees, including herself and one other person, from what she saw. But the congressman didn't spend the morning jovially chatting with them, as he characterized in his tweet. Issa spokesman Calvin Moore told us via e-mail:", "The Congressman came down today to talk with the protestors gathered and answer some of the questions they might have. (They’ve been pretty adamant about town halls, so he thought they’d relish at the opportunity to answer some questions then and there). He spent some time talking to a few of those gathered regardless then headed upstairs to take a pic of everyone.", "Montanari told us in a phone interview that things unfolded with a bit more hostility than Moore let on. Since late January 2017, protesters have been gathering outside Issa's Vista office every Tuesday. Normally he comes out and she offers him a microphone, which he uses for impromptu question-and-answer sessions. On 30 May, however, Montanari told us that Issa was less talkative and more accusatory:", "I saw Rep. Issa across the street before our rally started. He’s come down to speak with us a number of times. I went over to shake his hand, and he said, 'step away, you're a protester.' I said 'no, I’m a constituent.' He went on to just blast me. Our whole point is that we want to hear form him, and he has in the past been rude and condescending, but nothing like this. He was being incredibly disrespectful to me, and the rally participants. I listened to him for a little while and he turned on his heel and walked away. I walked back and I decided he was not interested in talking with us, he was more interested in talking at us. It's our rally, the people paid for the microphone, and so I decided that if he was going to be a bully he was not going to get the microphone.", "Montanari said he stopped to chat with at least one other participant before going back into his office,  appearing on the rooftop, then coming back out with a piece of cake which he gave to a supporter of President Donald Trump, who also attends as a counter-protester:", "There’s one Trump supporter who comes every week — we know him, we’ve gotten to be buddies. [Issa] came out and delivered a piece of cake to him. It was a bit ironic because this guy has some serious health issues. I’m looking at the optics of this thinking, 'with one hand you’re offering him a piece of cake and with the other you are taking away his health care.'", "It was a photo op for him, he had a photographer with him. it’s not like he was being particularly nice to [the Trump supporter]. It should have been anything other than cake, because the historical significance of this was not lost on anyone.", "Montanari characterized Issa's standing on the rooftop and taking pictures of the crowd as \"surreal\":", "I grew up in D.C. and I've never seen anything like that, ever. It was about as random as they come.", "The incident took place after protesters were given tighter restrictions by the city for their weekly rallies, including being moved across the street from the office instead of standing on the sidewalk directly out front, and limitations being placed on amplified sound. Montanari characterized the 30 May 2017 rally as having \"really escalated.\"", "When we asked Moore why Issa had chosen this particular day to take pictures of protesters from the roof, Moore responded:", "Who cares?", "According to San Diego Union Tribune reporter Joshua Stewart, Issa called him the day of the roof controversy, labeled him an \"operative\" for his opponents, and then hung up on him.", "I just received an unprompted call from @DarrellIssa who said he tried, unsuccessfully to speak with protesters outside his district office.", "— Joshua Stewart (@jptstewart) May 30, 2017", ".@DarrellIssa said the protesters wouldnt' speak with him, so he went up to the roof and took pictures.", "— Joshua Stewart (@jptstewart) May 30, 2017", ".then @DarrellIssa called me an \"operative\" for his opponents, and \" It's interesting that the paper has become as small as your words.”", "— Joshua Stewart (@jptstewart) May 30, 2017", "Then @DarrellIssa hung up on me.", "— Joshua Stewart (@jptstewart) May 30, 2017", "While Issa didn't technically \"hide\" on the roof (he was in plain view), it seems that he did retreat from protesters who did not want to speak with him.", "Figueroa, Teri, and Stewart, Josh. \"Issa Appears on Rooftop as Hundreds Protest Outside His Vista Office.\"\r\n  San Diego Union Tribune. 30 May 2017.", "Figueroa, Teri. \"As Protests Continue, Restrictions Tighten.\"\r\n  San Diego Union Tribune. 22 May 2017.", "Stewart, Joshua. \"Issa's Reactions Trigger Social Media Storm.\"\r\n  San Diego Union Tribune. 17 May 2017.", "Easley, Jason. \"Darrell Issa Hides on a Roof to Because He Is Too Afraid to Face People Angry About Trumpcare.\"\r\n  PoliticsUSA.com. 30 May 2017.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]