["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Democratic National Committee chair Debbie Wasserman Schultz is shown speaking in Florida in 2012.", "A law professor running against U.S. Rep. Debbie Wasserman Schultz of South Florida says she is in the pocket of big banks and isn’t looking out for consumers who get crushed by debt from payday loans.", "\"My opponent, after taking hundreds of thousands of dollars from Goldman Sachs and other Wall Street banks, has voted to prevent the Consumer Financial Protection Bureau (CFTP) from regulating payday loans and addressing racial discrimination in car loans,\" said Tim Canova on his website.", "Canova, a first-time candidate and professor at Nova Southeastern University, is challenging Wasserman Schultz in the August Democratic primary in a Broward/Miami-Dade district. The race has drawn national attention because Wasserman Schultz is the Democratic National Committee chair.", "Did Canova accurately describe her donations from banks and her votes related to payday loans and car loans?", "There is some truth to his attack, but each one requires explanation.", "Donations from Wall Street banks", "Canova’s campaign pointed to donations from banks, securities/investment firms and finance/credit companies to Wasserman Schultz’s campaign committee and her political action committee, or PAC.", "At PolitiFact Florida’s request, the Center for Responsive Politics compiled the large individual donations (more than $200) and donations to her PAC starting with her 2006 election. The center found she received $309,020 from commercial banks, which represented about 2 percent of the total; $408,450 from securities/investment firms, and $325,850 from finance/credit companies.", "Her leadership PAC, Democrats Win Seats, received donations from the Goldman Sachs PAC: $5,000 in 2016 and $10,000 in 2014.", "Wasserman Schultz spokesman Sean Bartlett pointed to donations only to her campaign and plucked out what he said were the \"big bank\" donations. That totaled $15,400, including $4,000 from Goldman Sachs.", "But the Center for Responsive Politics shows a longer list of bank donations even if we only examine her campaign committee. It shows $171,303 for \"commercial bank\" industry donations.", "Payday loan bill", "Payday loans are small, short-term loans that borrowers promise to repay out of their next paycheck at a high rate of interest. It is a controversial industry that targets the poor and is disproportionately located in minority communities.", "For years, payday loans were unregulated by the federal government, although some states had their own laws.", "President Barack Obama took a step toward regulating the industry when he signed a bill in 2010 that included the creation of the Consumer Financial Protection Bureau. Republicans have targeted the bureau for years.", "Enter some Democrats into the fray -- including Wasserman Schultz, who has gotten about $68,000 from payday lenders, according to the Center for Responsive Politics.", "Wasserman Schultz is among Florida lawmakers who have defended Florida’s payday law despite the fact that some consumer advocates have bashed it and say it traps the poor in a debt cycle. Wasserman Schultz’s position is to give precedence to the state law, her spokesman said.", "On the federal level, the bureau released an outline of payday loan rules in March 2015 and is expected to announce a more complete proposal within the next several months. Congress doesn’t have to approve it but can introduce legislation to kill it.", "All but one member of Florida’s congressional delegation (Tom Rooney) signed a letter in April 2015 pushing back against the proposed rules. Instead, they want the bureau to look at Florida’s law as a model.", "That led U.S. Rep. Dennis Ross, a Florida Republican, to file the \"Consumer Protection and Choice Act,\" H.R. 4018 in November. Half of the 24 cosponsors are from Florida, including Wasserman Schultz, and nine of the cosponsors are Democrats.", "Canova’s website said Wasserman Schultz \"voted\" on the bill, but it was only referred to a committee without a vote. (After we pointed that out to Canova senior adviser Richard Bell, the campaign changed the website to say \"co-sponsored\" instead of \"voted.\")", "The bill states that if the bureau determines that a state’s law meets the federal requirements, then only state law will apply. It would also delay federal regulations for two years, which would allow states to come up with their own laws.", "More than 200 consumer or civil rights groups -- including the NAACP, National Council of La Raza, Southern Poverty Law Center and the Consumer Federation of America -- wrote a letter to Congress urging them to defeat the bill. They argued that the bill favors an \"industry-backed Florida law\" and would hurt consumers.", "Florida’s 2001 payday loan law was a compromise and included protections that were intended to help the poor avoid an endless cycle of debt. But the loans leave consumers stuck on a debt treadmill in Florida, where they have racked up $2.5 billion in fees since 2005, according to the Center for Responsible Lending’s March report. In the past year, the average Florida payday loan had an annual rate of 278 percent.", "Richard Cordray, head of the Consumer Financial Protection Bureau, disputed Ross’ description of Florida’s law as the \"gold standard\" during a congressional hearing on March 16.", "In Florida, \"these loans are still being made above the 300 percent, and they are being rolled over on average nine times,\" Cordray said.", "Bartlett argued that Wasserman Schultz has fought against \"abusive payday lending practices\" and pointed to her vote on a separate bill in 2015. She voted against HR 766, the Financial Institution Customer Protection Act, which opponents argued would have prevented the Justice Department from going after the financial industry.", "Racial discrimination in car loans", "Canova also said Wasserman Schultz prevented action to stop racial discrimination for car loans. This part of Canova’s attack relates to a 2013 bulletin from the Consumer Financial Protection Bureau, which recommended steps for auto lenders to avoid discrimination. The bulletin was intended to provide clarity about existing law.", "But the House of Representatives pushed back against the bureau by passing a bill to nullify the bulletin. The bill passed the House 332-96 in November 2015 and hasn’t had a vote in the Senate. Wasserman Schultz was one of 88 Democrats who voted in favor of it, while 96 Democrats opposed it.", "Proponents of the bill -- including auto dealers -- said the bureau’s efforts would increase costs for consumers. Groups that represented minorities wanted the new guidelines.", "\"This legislation in no way prevented the CFPB from addressing racial discrimination in car loans, and the congresswoman does not support that as a policy position,\" her spokesman said.", "The bill hasn’t been acted on, and discrimination investigations can continue. A few months after the House vote, Toyota agreed to a $21.9 million settlement to black and Asian buyers.", "Our ruling", "Canova says Wasserman Schultz \"after taking hundreds of thousands of dollars from Goldman Sachs and other Wall Street banks, has voted to prevent the Consumer Financial Protection Bureau from regulating payday loans and addressing racial discrimination in car loans.\"", "Her campaign committee and PAC have taken $309,020 from commercial banks since her re-election campaign in 2006 -- about 2 percent of the total. That includes $15,000 in donations from Goldman Sachs to her leadership PAC.", "The payday loan bill hasn’t had a vote in the House yet, although Wasserman Schultz is a co-sponsor. The bill would not prevent the bureau from regulating payday loans entirely, but it would cede power to the states, including Florida, which has its own payday law that some advocates have criticized as weak.", "She voted for a bill that squashed bureau guidelines that were intended to provide clarity about the law on racial discrimination related to car loans.", "We rate this claim Mostly True.", "Tim Canova website, On the issues, Accessed March 24, 2016", "Govtrack, Consumer Choice and Protection Act, Referred to a House committee Nov. 16, 2015", "Thomas Library of Congress, H.R. 1737, Nov. 18, 2015", "YouTube, Committee on Financial Services Hearing: \"The Semi-Annual Report of the Bureau of Consumer Financial Protection,\" March 16, 2016", "Center for Responsive Politics, Democrats win Seats PAC 2016 cycle and 2014 cycle", "Center for Responsive Politics, Donations from commercial banks to Debbie Wasserman Schultz campaigns, 2006-2016 cycles", "Center for Responsive Politics, Payday lenders, Accessed March 28, 2016 (Lists amount for Wasserman Schultz as $63,000 but the Center is in process of updating amount to $68,100)", "Center for Responsible Lending, \"Perfect storm: Payday lenders harm Florida consumers despite state law,\" March 16, 2016", "U.S. Rep. Debbie Wasserman Schultz and most of the Florida delegation, Letter to Richard Cordray, April 28, 2015", "Americans for Financial Reform, Letter to Congress from multiple groups opposing H.R. 4018 , Dec. 15, 2015", "Federal Deposit Insurance Corporation, Guidelines for payday lending, November 2015", "Consumer Financial Protection Bureau, \"CFPB considers proposal to end payday traps,\" March 26, 2015", "Consumer Financial Protection Bureau, \"DOJ and CFPB reach resolution with Toyota Motor Credit to address loan pricing policies with discriminatory effects,\" Feb. 3, 2016", "Consumer Financial Protection Bureau, Bulletin on indirect auto lending, March 21, 2013", "Pew Charitable Trusts, Fact sheet on payday lenders, April 2014", "Tampa Bay Times The Buzz, \"Florida's payday lender law is no model, report concludes,\" March 24, 2016", "Huffington Post, \"DNC chair Debbie Wasserman Schultz is taking a ton of heat for helping payday lenders,\" March 10, 2016", "Huffington Post, \"DNC Chair Joins GOP Attack On Elizabeth Warren’s Agency,\" March 1, 2016", "Huffington Post, \"Meet the 88 Democrats who just voted to enable discrimination in car buying,\" Nov. 20, 2015", "Politico, \"Nonprofit group targets Wasserman Schultz over payday lenders,\" March 9, 2016", "Los Angeles Times, \"Politics of payday loans,\" (Accessed in Nexis) March 8, 2016", "New York Times, \"House Republicans Clash With Consumer Protection Unit Chief,\" March 17, 2016", "Washington Times, \"CFPB boss meets with Florida lawmakers to discuss uproar over payday regulations,\" Sept. 11, 2015", "Tampa Bay Times, \"Payday loan issue divides U.S. Senate candidates Murphy and Grayson,\" March 23, 2016", "Wall Street Journal, \"Rep. Debbie Wasserman Schultz’s Payday-Loan Stand Targeted in Ad Campaign,\" March 10, 2016", "Kansas City Star editorial board, \"It's ridiculous that the leader of the national Democratic Party is protecting payday lenders,\"", "New York Times Dealbook, \"Protection Bureau's Stormy Path to Reform the Auto Finance Industry,\" Dec. 2, 2015", "New York Times Dealbook, \"House Republicans Clash With Consumer Protection Unit Chief,\" March 16, 2016", "Miami Herald, \"Florida Congressional delegation criticizes proposed rules on paydaylending\" May 1, 2015", "Allied Progress, \"Debt trap Debbie,\" March 2016", "Automotive Lending, \"U.S. House passes bill revoking CFPB auto lending guidance,\" Nov. 18, 2015", "Washington Post The Fact Checker, \"Warren’s false claim that ‘auto dealer markups cost consumers $26 billion a year,’\" May 5, 2015", "PolitiFact, \"Carly Fiorina says Consumer Financial Protection Bureau has ‘no congressional oversight,\" Nov. 14, 2015", "Interview, Richard Bell, Tim Canova For Congress senior advisor, March 24, 2016", "Interview, Sean Bartlett, U.S. Rep. Debbie Wasserman Schultz spokesman, March 28, 2016", "Interview, Daniel Auble, Center for Responsive Politics senior researcher, March 28, 2016", "Interview, David Mayorga, Consumer Financial Protection Bureau spokesman, March 28, 2016", "Interview, Brandon Coleman, Center for Responsible Lending policy counsel, March 28, 2016", "Interview, Charlene Crowell, Center for Responsible Lending spokeswoman, March 28, 2016", "Interview, Karl Frisch, Allied Progress executive director, March 28, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]