["About this rating", "Florida residents who normally receive food stamps (SNAP) can continue to do so, and SNAP benefits have been improved in response to Hurricane Irma. Food stamps have also been extended beyond ordinary recipients under a program called Disaster-SNAP.", "Disaster-SNAP does not require individual households to have experienced power outages for any period of time, and maximum income limits apply. Benefits include no set payments of $197 per person; rather, allotments vary depending on household size.", "In September 2017, Facebook users spread several rumors about government benefits and assistance available to Florida residents in the aftermath of Hurricane Irma. One of these rumors involved the provision of food stamps for Floridians whose homes had experienced power outages of at least two hours in duration.", "A typical expression of the rumor read as follows:", "#FLORIDA", "If your power was out for more than two hours. You are eligible for food stamps. $197.00 per person. Go to www.myflorida.com/accessflorida ... Apply for benefits..create an account. Click on food stamps or snaps..DO NOT APPLY FOR CASH...Make sure you have a valid phone number so they can verify your zip code...", "A similar rumor claimed that the Federal Emergency Management Agency (FEMA), rather than the state of Florida, was overseeing food stamp benefits:", "FEMA assistance is available to those whose power was out for more than 2 hours they're eligible for food stamps 197 per person go to myflorida.com Access Florida apply for benefits create an account click food stamps or snaps do not apply for cash make sure you have valid phone number so they can verify zip code.", "A separate but related rumor held that FEMA was directly providing Floridians with $500 for food purchases:", "For those in need\nFEMA is giving $500 direct deposit that can be used for food. Apply at disasterassistance.gov\nFEMA 1-800-621-3362 or 1-800-462-7585", "None of these rumors was quite right, and they all seemed to be based on misunderstandings of a federal disaster relief program known as Disaster-SNAP (or D-SNAP), which was extended to parts of Florida on 22 September 2017.", "D-SNAP is a program that temporarily extends the benefits usually available under SNAP (Supplemental Nutrition Assistance Program, commonly known as food stamps) to individuals affected by natural disasters. One does not have to be an existing recipient of SNAP benefits in order to qualify for D-SNAP, but the latter program does incorporate maximum income limits. D-SNAP assistance typically lasts for one month, but Agriculture Secretary Sonny Perdue announced on 22 September that the program would be in place for two months in Florida.", "Recipients are provided with a temporary EBT card containing an amount of credit based upon household size and income.", "A one-person household with a gross monthly income of $1,664 or less would receive $194 in D-SNAP credit for one month (a figure that may be the source of the \"$197 per person\" claim in some Facebook rumors). An eight-person household (provided it has a gross monthly income of $4,151 or less) would be eligible to receive $1,169 in D-SNAP assistance (an average of $146 per person). A two-person household (provided it met the income requirements) would be eligible for $357 in benefits, or $179.50 per person. (There is no set benefit amount per person, a common element of the rumors which is misleading.)", "The extension of D-SNAP in Florida applies to certain counties. A county is considered eligible based upon the percentage of power outages experienced over a period of 72 hours, as well as the level of structural and flood damage suffered.", "So power outages do play a role in the provision of extended SNAP benefits, but only on the county level. Such benefits come with no requirement that an individual household must have experienced a power outage for \"more than two hours,\" or that applicants must provide photographic evidence of such outages.", "The appropriate place to apply for Disaster-SNAP assistance in Florida is the ACCESS Florida web page.", "Other assistance is available", "As well as Disaster-SNAP, existing food stamp recipients can avail themselves of certain other enhanced benefits in light of the damage and disruption caused by Hurricane Irma.", "According to the United States Department of Agriculture's Food and Nutrition Service, which oversees SNAP, regular Florida recipients can (as of 12 September 2017) temporarily use EBT cards to buy hot food (something they cannot normally do) and should have received their monthly allotment earlier than usual in September:", "USDA’s Food and Nutrition Service (FNS) recently approved a temporary waiver and supported other actions that will help households participating in the USDA’s Supplemental Nutrition Assistance Program (SNAP) in Florida, Georgia, and the Virgin Islands, and the Nutrition Assistance Program in Puerto Rico, to access food in the wake of Hurricane Irma, including:", "In addition to these modifications, several types of federally-provided assistance are available to those affected by disasters such as Hurricanes Irma and Harvey, both in Florida and in other states. These benefits include monetary assistance with rent and home repairs as well as funeral and medical care costs, as well as direct assistance such as FEMA's entering into lease agreements with owners of multi-family rental properties and performing repairs, with the aim of providing temporary accommodation for individuals.", "Variations in eligibility, rates of payment, duration of assistance, and type of assistance mean that it's virtually impossible to say how much an individual household or person might receive. Residents of states that have been affected by hurricanes and other disasters can check whether they are eligible for federal assistance, and apply for such assistance, by visiting DisasterAssistance.gov.", "The claim asserted in one of the Facebook rumors, that FEMA is offering individuals $500 via direct deposit to be used for purchasing food, has a grain of truth to it.", "As part of the assistance that the federal government provides to individuals and households in state where major disasters have been declared (as was the case in Florida), individuals who have lost their homes or been displaced can apply for what's known as Critical Needs Assistance, which consists of a one-time payment of $500, as explained by FEMA:", "FEMA may provide financial assistance to individuals and households who, as a result of the disaster, have immediate or critical needs because they are displaced from their primary dwelling. Immediate or critical needs are life-saving and life-sustaining items including, but not limited to: water, food, first aid, prescriptions, infant formula, diapers, consumable medical supplies, durable medical equipment, personal hygiene items, and fuel for transportation ... It is a one-time $500 payment per household.", "However, the state must first ask FEMA to authorize Critical Needs Assistance in specific counties particularly badly hit by a disaster, FEMA must then grant that authorization, and the individual must go through an application process. FEMA has authorized Critical Needs Assistance in certain Florida counties, which are listed on the FEMA web site.", "The Critical Needs Assistance application is available only to individuals who have lost their homes or been displaced, and who had previously resided in counties where FEMA has authorized Critical Needs Assistance.", "United States Department of Agriculture.  \"Disaster Supplemental Nutrition Assistance Program Income Eligibility Standards and Allotments:   October 1, 2016 – September 30, 2017.\"\r\n    11 August 2016.", "United States Department of Agriculture   \"USDA Eases Program Rules to Aid Florida, Other Irma-Stricken Areas.\"\r\n    12 September 2017.", "Florida Department of Children and Families.   \"DCF Information on Disaster SNAP (Food for Florida) as of September 14, 2017.\"\r\n    14 September 2017.", "Federal Emergency Management Agency.  \"Fact Sheet — Individuals and Households Program.\"\r\n    Accessed 15 September 2017.", "Federal Emergency Management Agency.  \"Fact Sheet — Critical Needs Assistance.\"\r\n    August 2017.", "Update [23 October 2017]: Added the fact that Disaster-SNAP was activated in parts of Florida on 22 September 2017.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]