["In one Facebook post that has been shared 5,000 times, and which we’ve archived here, the video is captioned: “Yesterday shooting in Alexander south Africa (Citizens vs foreigners ) say no to xenophobia”.", "The caption appears to be a reference to Alexandra, the Johannesburg township. Another post suggested the shootout took place in Cape Town.", "In March, parts of South Africa were hit by the latest in a long series of outbreaks of xenophobic unrest when protests against foreign-owned shops spilled into violence.", "Immigrants have frequently borne the brunt of anger resulting from chronic unemployment in South Africa, with locals accusing them of taking up scant jobs.", "As reported by AFP, some 300 Malawians were displaced from their homes in the city of Durban during the latest round of violence, and dozens asked to be repatriated.", "Online, many people in South Africa and beyond expressed anger over the latest attacks on immigrants.", "However, various old images began circulating again in social media posts about the most recent violence, as we noted in this AFP Fact Check.", "As for the video of the shootout, a few clues led Facebook users to believe it might be staged or show a movie scene:", "A tip-off from an AFP source in Cape Town suggested the video was filmed during the shooting of a movie in the city’s Parkwood suburb.", "A Facebook search of “Parkwood movie shoot” then led us to another video. It’s longer than the nine-second one shared in the post linking it to xenophobic violence.", "The nearly 90-second video, which we’ve archived here, was posted on March 26. It was captioned “New Movie being shot in Parkwood” and had more than 300 shares.", "As you can see, this video was shot at the same scene. In the background you can see the same green fencing and yellow graffiti on the wall. If you look closely you can also see that the participants in the shootout are the same, including the man wearing red trousers with a white stripe down the side.", "But in the longer video, you can clearly see camera operators walking around before the shooting starts, and a crowd gathered to watch the scene. After the shooting, the crowd cheer and applaud.", "As previously reported by AFP, Cape Town and its surrounding region are regularly afflicted by gang violence. Many of those commenting on the video expressed dismay at what they feared would be movie perpetuating that image or even glamorising it.", "As for the film itself, we’re still trying to contact the team behind it. We’ll update this post when they get back to us.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]