["By Saranac Hale Spencer", "Posted on May 3, 2019", "A doctored photo circulating on Facebook falsely claims that a California middle school congratulated President Donald Trump “on reaching his 10,000th lie.” The image came from an online generator that lets users enter their own text.", "On April 26, 2019, the Washington Post Fact Checker counted the 10,000th time President Donald Trump had made a false or misleading claim.", "Three days later, the paper published a story on the “milestone” and late night comedy show hosts picked up on it.", "Now, there’s a doctored photo circulating on Facebook claiming to show a middle school sign with this message: “Congratulations to President Donald Trump on reaching his 10,000th lie!!!!”", "It was shared 1,400 times in less than four hours after being posted. But the sign at Roosevelt Middle School in Oakland, California has never displayed that message, Cliff Hong, the school’s principal, told FactCheck.org. “We haven’t even used that sign in, like, two years,” he said.", "John Sasaki, spokesman for the Oakland Unified School District, said that, “as a district, we don’t put political messages on our signs.”", "The photo came from a website with a generator that allows users to put text on a picture of the school’s sign. Over the last couple of years, Hong said, he’s seen pictures of the sign circulating online with various messages on it, none of which had actually been posted outside of the school.", "This isn’t the first time we’ve seen a picture from an online generator spread misinformation. In 2015, we wrote about Islamophobic claims targeting Dearborn, Michigan, one of which included a fake message that had been typed onto a picture of a church sign.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on the social media network. Our previous stories can be found here.", "Kessler, Glenn, et al. “President Trump has made more than 10,000 false or misleading claims.” Washington Post. 29 Apr 2019.", "Hong, Cliff. Principal, Roosevelt Middle School. Interview with FactCheck.org. 1 May 2019.", "Sasaki, John. Spokesman, Oakland Unified School District. Interview with FactCheck.org. 1 May 2019.", "McCormack, Raymond. “Dearborn’s Anti-ISIS Rally.” FactCheck.org. 18 Dec 2015.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]