["A veiw of Copenhagen, Denmark. Opposing Internet graphics paint Denmark as either a paradise or hell on earth. We checked a claim from one of them. (Wikimedia Commons)", "Recently, Democratic presidential candidate Bernie Sanders has been pointing to Denmark as an example of an economically just country, including a mention in the first Democratic presidential debate.", "Since then, an Internet graphic has been circulating that compares the United States to Denmark, purportedly in the form of a first-hand account by a Danish teacher. The description is unflattering to Denmark, and a number of readers have asked us to take a look at it.", "The graphic talks about excessive taxes and crushing personal debt for residents of Denmark, but one element that caught our eye is a claim about suicide rates.", "\"Denmark’s suicide rate has averaged 20.8 per 100,000 (people) during the last five decades, with its highest level of 32,\" the graphic states. \"The American suicide rate averaged only 11.1 (per 100,000 people) during the last five decades and has never exceeded 12.7.\"", "We decided to take a closer look.", "We should first note that Snopes.com recently broke down each of the meme’s statistical claims. It found a mixed bag -- some claims were largely accurate, but many statements were unsupported or false. According to Scopes, the meme was originally posted on a blog called The Federalist Papers on Oct. 20, and seemed to be a cheeky response to an earlier meme that was favorable toward Denmark, reproduced below:", "Since the meme references \"the last five decades,\" we looked at the trends over that period from this chart by the World Health Organization.", "Denmark’s suicide rate (per 100,000 people)", "1960: 20", "1970: 22", "1980: 32", "1990: 24", "2000: 14", "2012: 8.8", "Source: The World Health Organization", "United States’ suicide rate (per 100,000 people)", "1960: 10.6", "1970: 11.5", "1980: 11.8", "1990: 12.4", "2000: 10.4", "2012: 12.1", "Source: The World Health Organization", "Using those numbers, Denmark’s average suicide rate over the last five decades is indeed about 20 people per 100,000. The average U.S. suicide rate in that timeframe is 11.5 people per 100,000.", "So the graphic has offered fairly accurate numbers. But a closer look at the data shows that they are presented in a misleading way.", "Reading the meme, one would think that Denmark has a much bigger suicide problem than the United States does. In reality, the latest statistics show exactly the opposite.", "Danish suicide rates peaked in the 1980s and have fallen significantly since then -- by almost three-quarters. By contrast, the U.S. rate has been largely static since the 1960s, rising modestly between 2000 and 2012.", "So by 2012, Denmark’s suicide rate was lower than the United States, not higher -- 8.8 people per 100,000 in Denmark, compared to 12.1 per 100,000 in the United States.", "When we reached Mikkel Clair Nissen, whose website was cited on the graphic, he said this line of query has interested him since Oprah Winfrey visited Denmark in 2009 and called Danes the happiest people in the world. To him, this clashed with Denmark’s historically high suicide rate. Nissen attributes more recent declines to the widespread use of antidepressants. Data from the Organization for Economic Cooperation and Development show Denmark with the highest rate of antidepressant use -- something that he expresses reservations about in his writings.", "It may be true that Denmark has reduced its suicide rate in part due to antidepressant use, but this seems tangential to the claim we’re checking -- that Denmark has a bigger suicide problem than the United States does.", "Our ruling", "An Internet graphic critical of Denmark claimed that Denmark’s suicide rate has been about twice as high as the United States’ over the past five decades.", "The numbers are accurate, but in the course of making a broader case against Denmark, the data is cherry-picked to make it seem as if Denmark has a much higher suicide rate than the United States. In reality, the rate today is about 50 percent higher in the United States, and in the United States the rate has been increasing somewhat in recent years.", "The statement contains an element of truth but ignores critical facts that would give a different impression, so we rate it Mostly False.", "American Foundation for Suicide Prevention, \"Facts and Figures\"", "Snopes.com, \"Does a 'brutal meme' about 'socialism' in Denmark paint an accurate portrait of life in that country for the middle class?\" Oct. 21, 2015", "National Center for Biotechnology Information, \"Suicide in the World,\" March 2, 2012", "Centers for Disease Control and Prevention, \"Suicide and Self-Inflicted Injury\"", "Centers for Disease Control and Prevention, \"Deaths: \"Final Data for 2013\"", "Associated Press, \"Americans living longer as most death rates fall,\" Oct. 8, 2014", "World Health Organization, \"Suicide rates: Data by country\"", "World Health Organization, Suicide rates in the USA", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]