["By Angelo Fichera", "Posted on June 9, 2020", "A meme is spreading a doctored image of the Lincoln Memorial covered in graffiti to falsely claim that protesters defaced the Lincoln statue. The image was taken from a thumbnail for a video on the conservative website the Daily Wire and shared as if real.", "There have been many images — some old, others old and manipulated — used to push misinformation about the protests against police brutality and racial injustice that have erupted across the country.", "In the latest example, a meme on Facebook and Instagram is spreading an image purportedly showing the Lincoln Memorial, specifically the Lincoln statue, blanketed in graffiti. Among the messages visible in the image are “BLACK + BROWN LIVES MATTER” and the hashtag “#BLM.”", "“The Lincoln Memorial,” the meme reads. “His head damaged and Defaced.” It further claims “[t]he Media is trying to hide this picture from you.”", "That’s not true. The photo was deliberately doctored and the vandalism in question didn’t happen.", "“That photo is a hoax,” Mike Litterst, a spokesman for National Mall and Memorial Parks, a part of the National Park Service, told us in an email.", "We traced the photo back to the conservative website the Daily Wire, where “The Michael Knowles Show” used it as a cover image for the video of its June 4 episode.", "Among other targets, the episode railed against the recent protests and was titled “With Malice Toward All” — a play on President Abraham Lincoln’s second inaugural address, which contained a line beginning, “With malice toward none, with charity for all.” (Knowles — beginning at 27:40 — reads the line and accuses the “left in America today” of having “completely reversed it.”)", "Knowles confirmed in an email to us that the image was created for his show.", "“The image you’re referencing did indeed come from the artists who create the thumbnail images for my show. Every day, my show is uploaded to our channel with artistic images, usually of the comedic or outrageous variety,” Knowles said. He cited other examples of such images, including a “muscular, shirtless President Trump as Hercules wrestling a bull.”", "“It would seem the drawing of a ridiculously defaced Abraham Lincoln statue, partially beheaded, was taken by someone on the Internet, cropped, stripped of the context of our show, and passed off as real,” Knowles added.", "As we’ve previously explained, National Mall and Memorial Parks did show in a May 31 tweet three instances of vandalism that occurred during protests the night before — including vandalism at the base of the Lincoln Memorial. It was nowhere near the Lincoln statue, and the spray paint only read, “Yall not tired yet?”", "“The only graffiti at the Lincoln Memorial was at the bottom of the steps at street level, far away from the statue (and it has been removed already),” Litterst said.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "“Ep. 557 – With Malice Toward All.” The Michael Knowles Show. Daily Wire. 4 Jun 2020.", "Knowles, Michael. Email to FactCheck.org. 9 Jun 2020.", "Litterst, Mike. Spokesman, National Mall and Memorial Parks. Email to FactCheck.org. 8 Jun 2020.", "National Mall and Memorial Parks (@NationalMallNPS). “In the wake of last night’s demonstrations, there are numerous instances of vandalism to sites around the National Mall. For generations the Mall has been our nation’s premier civic gathering space for non-violent demonstrations, and we ask individuals to carry on that tradition.” Twitter. 31 May 2020.", "“Second Inaugural Address of Abraham Lincoln.” Lillian Goldman Law Library, Yale Law School. Accessed 9 Jun 2020.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]