["By Angelo Fichera", "Posted on July 6, 2020", "Social media posts falsely assert that Ghislaine Maxwell — the recently arrested associate of Jeffrey Epstein — has tested positive for COVID-19 in jail. The story is the product of a website that says its work is satire.", "Ghislaine Maxwell, the longtime associate of Jeffrey Epstein, was arrested on July 2 and charged by federal prosecutors in Manhattan with aiding Epstein’s sexual abuse of minors.", "The U.S. Attorney’s Office for the Southern District of New York announced that Maxwell was charged with “enticing a minor to travel to engage in criminal sexual activity, transporting a minor with the intent to engage in criminal sexual activity, conspiracy to commit both of those offenses, and perjury in connection with a sworn deposition.”", "But officials have not said that Maxwell has tested positive for COVID-19 while in custody, despite a false claim on social media that began on a website that calls its work satire.", "The story first appeared on July 3 on brownvalleyobserver.com, under the headline, “Ghislaine Maxwell has tested positive for COVID-19 in New Hampshire jail, DOJ reports.” The story was shared more than 17,000 times on Facebook, according to CrowdTangle analytics data.", "The website’s disclaimer, however, describes it as an “entertainment website written to satirize news events, politics, and popular faces and ideas, and to provide commentary on social attitudes and trends.”", "But the claim has spread without that disclaimer, including in the form of a viral screenshot showing the headline with a Twitter comment seemingly suggesting Maxwell was going to be killed.", "A similar claim was also advanced in an image made to look like a screenshot of a news story from the BBC; the headline said Maxwell was “moved to intensive care as Coronavirus symptoms worsen.” The news organization did not report that story, and the date is listed as “11 July 2020” — which is still days away.", "Epstein, a financier and convicted pedophile, was found dead in his Manhattan prison cell in August 2019. At the time, he was facing federal charges of sex trafficking minors. His death was ruled a suicide.", "Maxwell, the daughter of British publishing magnate Robert Maxwell, was being held in a New Hampshire jail after her arrest, according to Reuters. On July 6, the Associated Press reported she had been transferred to the Metropolitan Detention Center in Brooklyn.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "Balsamo, Michael and Michael R. Sisak. “Maxwell moved to NY for Epstein-related sex abuse charges.” Associated Press. 6 Jul 2020.", "“Disclaimer.” BrownValleyObserver.com. Accessed 6 Jul 2020.", "“Ghislaine Maxwell Charged In Manhattan Federal Court For Conspiring With Jeffrey Epstein To Sexually Abuse Minors.” Press release, U.S. Attorney’s Office for the Southern District of New York. 2 Jul 2020.", "“Jeffrey Epstein Charged In Manhattan Federal Court With Sex Trafficking Of Minors.” Press release, U.S. Attorney’s Office for the Southern District of New York. 8 Jul 2019.", "John, Tara and Bianca Britton. “Who is Ghislaine Maxwell? The woman at the center of the Jeffrey Epstein scandal.” CNN. 2 Jul 2020.", "Wolfe, Jan. “Alleged Jeffrey Epstein accomplice Ghislaine Maxwell being held at ‘well-run’ jail, local lawyers say.” Reuters. 3 Jul 2020.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]