["About this rating", "Lester Holt did wear an earpiece during the first presidential debate of 2016.", "Lester Holt did not break the debate rules by wearing an earpiece.", "In the days following the first presidential debate between Hillary Clinton and Donald Trump in 2016, a series of rumors and conspiracy theories were circulated in an attempt to somehow prove that the night had been rigged by the Democratic presidential nominee. After failing to provide evidence for any of these baseless claims — Hillary Clinton didn't wear an earpiece, she didn't communicate with moderator Lester Holt via secrethand signals, she wasn't given the debate questions weeks in advance — conspiracy theorist Alex Jones turned his sights on the moderator, claiming that Lester Holt broke the debate rules by wearing an earpiece:", "Jones based his accusation on a clip of Holt sitting at the moderator's desk and fiddling with something in his ear. The image of Holt glancing over his shoulder while sitting in an apparently empty room gave the appearance that the debate moderator was hiding something.", "However, there was nothing to hide. Lester Holt clearly wore an earpiece during the presidential debate on 26 September 2016:", "Holt's wearing an earpiece during the debate did not break any rules set by the Commission on Presidential Debates. Under the CPD's guidelines, moderators are allowed to use earpieces so that they can be kept abreast of the time:", "During primary debates (including the Democratic debate Holt moderated in January) TV producers can speak with the moderator through earpieces, proposing followup questions and supporting the host. Some production teams are more hands-on than others.", "But it works differently at general election debates organized by the commission. The only person in Holt's ear will be the commission's longtime executive producer, Marty Slutsky, who has produced all of the debates since 2000.", "Slutsky keeps track of time and lets moderators know when they have to wrap up the debate.", "Stelter, Brian.   \"How Lester Holt Is Getting Ready for Monday's Debate.\"\r\nCNN Money.   26 September 2016.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]