["Side-by-side photographs on Facebook of President Donald Trump and his father Fred Trump attempt to show a family pattern of white supremacy.", "\"Donald Trump: A white supremacist...just like dad,\" reads large text in a post shared by the group Anti-Trump USA on Feb. 25.", "On Donald Trump's side, the post highlights his partial quote from a news conference that there were \"fine people on both sides\" after a white supremacist rally in Charlottesville, Va.", "Beneath a photo of Fred Trump, the text states he was \"arrested participating in KKK riot\" in 1927.", "The post contains some elements of truth about Fred Trump: He was arrested that year in connection with a clash between the KKK and police amid a parade in Queens. But the post goes beyond what is known about his actions to say he was \"participating.\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.) A spokesman for the White House did not comment for the story.", "The story of Fred Trump’s arrest at a KKK rally has challenged reporters even before his son entered the 2016 presidential race.", "The KKK riot broke out during the May 30, 1927, Memorial Day parade in Jamaica, Queens, N.Y., according to archives from The Brooklyn Daily Eagle.", "A week prior, police commissioner Joseph Warren was warned that the Klan intended to parade in hoods and gowns. Warren said they were not issued a permit to have a parade, but a report later said the KKK had permission from the Grand Army of the Republic, a veterans’ organization that had charge of the parade arrangements.", "However, on the day of the parade, police were unable to keep at least 1,000 Klansmen from participating. The New York Times stated that \"1,000 Klansmen and 100 policemen staged a free-for-all battle in Jamaica.\"", "Fred Trump, then 21, was arrested at the parade along with six others, according to the New York Times. (His address was listed as 175-25 Devonshire Road, Jamaica, which matched the 1930 Census.) However, unlike the other men arrested who faced various charges of assault and disorderly conduct, the Times reported that Trump \"was discharged.\"", "We checked other reports of the riot to find more information — and found some discrepancies. A May 31, 1927, Brooklyn Daily Eagle article named six prisoners and all but one, bystander Ralph Losee, were called \"avowed Klansmen\" by the police. But this article did not mention Trump's name.", "According to the Daily Star, Trump was \"dismissed on a charge of refusing to disperse from a parade when ordered to do so.\"", "A June 2, 1927, Long Island Daily Press article said \"seven of the berobed marchers\" were arrested. So Fred Trump might have been wearing a Klansman robe.", "Alberto Martinez, a history professor at University of Texas, Austin, wrote his own in-depth report on Fred’s arrest.", "\"Even if Fred Trump was involved in the riot, it doesn’t necessarily mean that he was a KKK member or marcher, because news reports and court records both specify that local spectators (men and women) got involved in disrupting the parade,\" Martinez wrote in an email.", "Additionally, he said, Fred Trump was the only one arrested who was promptly released without any charges.", "Martinez said the disposition of the police officers also made him question whether Fred Trump was involved.", "\"The Queens County Grand Jury accused the police ‘for the disgraceful assault not only upon the (KKK) marchers but innocent civilians along the line of the march’ in the parade,\" Martinez wrote.", "A police car hit and seriously injured Losee, the innocent bystander who was arrested, and several minors were injured by the police.", "The president of the Grand Jurors’ Association of Queens said, \"Atrocities were committed by the police which were unwarranted and which should be condemned.\"", "\"These points show that the police clashed not only with Klansmen but with innocent spectators, which again calls into question whether Fred Trump was necessarily a KKK marcher or a local spectator,\" Martinez wrote.", "A picture on Facebook claims Fred Trump was arrested for \"participating\" a KKK riot.", "Yes, Trump's father was arrested in connection with the KKK's appearance at a Memorial Day parade. The group's march led to a violent confrontation with police. However, there is not enough documentation to show Trump was participating. Unlike other men who were arrested that day, his charge was quickly dropped.", "The post stretches what is known about the events that day to leave a misleading impression. We rate this Mostly False.", "Facebook, post about Fred Trump and the KKK, Feb 25, 2019", "Snopes, \"Donald Trump’s Father Arrested at KKK Rally?\" Feb. 28, 2016", "New Standard Press, \"Fred Trump and the KKK,\" Jan. 1, 2017", "The New York Times, \"In Interview, Donald Trump Denies Report of Father’s Arrest in 1927,\" Sept. 22, 2015", "The Brooklyn Daily Eagle archives, \"Warren Ordered Police to Block Parade by Klan,\" May 31, 1927", "New York Times archives, \"Grand Jury Blames Police in Klan Row,\" July 28, 1927", "The New York Times archives, \"Warren criticizes ‘class parades,’\" June 1, 1927", "The Washington Post, \"In 1927, Donald Trump’s Father Was Arrested after a Klan riot in Queens,\" Feb. 29, 2016", "Vice, \"All the Evidence We Could Find About Fred Trump’s Alleged Involvement with the KKK,\" March 10, 2016", "Geni, \"Friedrich Trump,\" accessed March 25, 2019", "YouTube, \"President Donald Trump On Charlottesville: You Had Very Fine People, On Both Sides | CNBC,\" Aug. 15, 2017", "Email interview, Alberto Martinez, history professor at University of Texas, Austin, March 15, 2019", "Library of Congress, \"The Grand Army of the Republic and Kindred Societies,\" Sept. 13, 2011", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]