["About this rating", "A photograph of Martin Webster, the leader of the far-right National Front group, leaving a courthouse in 1979 after he received a fine and a suspended sentence for inciting racial hatred was recirculated on social media in May 2019 -- along with the claim that a young Nigel Farage, the Leader of the Brexit Party, could also be seen in the photograph walking next to Webster:", "We have not been able to definitively determine the identity of this person claimed to be Farage. However, it seems likely that this photograph shows former deputy chairman of the British National Front (NF) Richard Verrall and not Nigel Farage.", "This photograph was taken outside of Kingston Crown Court where Webster appeared in October 1979 to face charges for publishing material to incite racial hatred. The image is available via Getty Images and Alamy, but neither of these photographic agencies identified anyone seen in the photograph other than Webster. The other people were simply labeled as \"followers\" of Martin Webster.", "The caption provided by Alamy read as follows: \"Martin Webster, the National Front leader was given a six-month suspended sentence at Kingston Crown Court yesterday for inciting racial hatred. He was also fined 150 and ordered to pay 530 costs. He denied publishing abusive material likely to incite racial hatred. As he left the court he said: 'I will continue to campaign against colored immigration'. Photo shows Martin Webster seen leaving Kingston Crown Court with some of his followers.\"", "The person in question certainly resembles Nigel Farage, but the Brexit leader was only 15 years old at the time that this picture was taken. And while it's difficult to determine a person's age simply by looking at a single, old photograph, we note that Webster was 36 years old at the time, and the people surrounding him all appear to be older than teenagers.", "Our search for a picture of Farage at age 15 turned up empty. The closest we came was an image of an even younger Farage (approximately 11) and a photograph of the Brexit leader in his late 20s:", "In 2016, a schoolmate of Farage's told the Independent that the Brexit leader had an affection for the National Front during his younger years, bragged about how he shared initials with far-right group, and sang neo-Nazi songs about killing Jewish people. Whether or not this person's account was accurate, we have not found any credible reports documenting that Farage was actively involved with the National Front, especially to the point where he would have accompanied the group's leader to a courthouse.", "Nigel Farage was only 15 years old when this viral photograph was taken, and while he may have had a favorable view of the National Front at the time, we found no indications he was actively involved with the group as a teenager.", "So whom does this photograph really show? It seems likely that Webster was accompanied by former deputy chairman of the British National Front Richard Verrall. Here's an image of Verrall and Webster from 1980 (right) in comparison with the two men in the viral photograph:", "Not only is Verrall a more appropriate age to be the person accompanying Webster to court (he was 31 years old in 1979), he may have also had good reason to attend the trial alongside Webster.", "The National Front leader was facing charges after he published two articles that incited racial hatred in the group's paper, and Verrall was a writer who was known for creating hateful content. Verrall wrote a pamphlet entitled \"Did Six Million Really Die?\" and was also the editor of the far-right magazine Spearhead, which was a \"mouth piece\" for the National Front in the 1980s.", "The claim that this photograph shows Farage with Webster is based solely on the notion that one man in the image bears a passing resemblance to the Brexit leader. Farage, however, is likely too young to be this individual. Furthermore, we found no evidence that Farage was an active member of the National Front in his teenage years. These points, coupled with the fact that a similar-looking man named Richard Verrall was an associate of Webster's, and was at least tangentially connected to the trial linked to the photograph, have led us to conclude this item is miscaptioned.", "Davies, Nick.   \"NF Leader Fined for Inciting Racial Hatred.\"\r\n    The Guardian.   31 October 1979.", "Jeory, Ted.   \"Farage's Fascist Past? Nigel Boasted About His NF Initials and Sang 'Gas Them All,' Claims Schoolfriend.\"\r\n      Independent.   11 August 2016.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]