["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Democratic gubernatorial nominee Bill White recently tromped into touchy territory -- whether state law officers enforce federal immigration law.\n\nWhite, interviewed Oct. 15 by the Texas Tribune's Evan Smith, started down that road by saying Houston, where he was mayor, is not a \"sanctuary city.\" The term \"sanctuary city\" is rooted in the 1980s when some American churches provided sanctuary to thousands of unauthorized Central American migrants fleeing civil war in their homelands.\n\nIn a March article, we rated False a statement by the then-chairwoman of the Republican Party of Texas that as mayor, White \"offered sanctuary to illegal immigrants.\" A congressional report once listed Houston among localities with sanctuary policies, but the only overt action on White's watch was the decision, at the end of his six years in office, to join the Secure Communities program -- a federal initiative intended to make it harder, not easier, for illegal immigrants to remain in this country.\n\nIn the Tribune interview, White said: \"You don't have sanctuary cities by and large in the state of Texas — that's a myth, a complete myth and fabrication. We arrest people every day. (The Houston Police Department) arrests people every week who are non-citizens who commit crimes. The (Texas) Department of Public Safety, under Rick Perry, for the last 9-and-a-half years, has had standing orders that it would not do routine civil immigration work — would not inquire about immigration status for people unless they arrested people for crimes.\"\n\nWe wondered if White's right that state troopers have standing orders not to ask anyone's immigration status unless they're under arrest.\n\nWe asked White's campaign for back-up. In an e-mail, spokeswoman Katy Bacon stressed a May 2010 Tribune article and what the publication described as a relevant state document, \"Enforcement of Federal Immigration Statutes.\"\n\nThat document opens with a 1978 policy statement by then-U.S. Attorney General Griffin Bell, suggesting that local police forces \"do not stop and question, detain, arrest, or place 'an immigration hold' on any persons not suspected of crimes, solely on the grounds that they may be deportable aliens.\"\n\nThe document says, in part: \"As enforcement of U.S. immigration law is not the primary responsibility of the (DPS), the following policy is adopted to guide department members.\"\n\nIt goes on: \"Members of this department will not engage in the enforcement of federal Immigration statutes by conducting road checks or business and residence searches unless assisting appropriate federal officers who have properly requested such assistance.\" The next section states: \"Members may arrest aliens under the following situations: 1. When serving a valid warrant after checking to see that the warrant is current. 2. For violation of state laws the same as any U. S. citizen.\" The next section states: \"Members will not arrest without a warrant an alien solely on the suspicion that he has entered the country illegally.\"\n\nNext, we asked DPS to confirm the authenticity of the policy. In the meantime, we found similar text posted online by the Texas Sunset Advisory Commission in 2008. On what looks like two web pages from the DPS's internal website, guidance identical to what the Tribune published is presented under: \"General Manual, Chapter 5.\"\n\nIn addition, we found a \"statewide agreement\" on the Sunset site prefaced by an April 1, 1990, interoffice memo from Joe E. Milner, then the agency's director, stating that a lawsuit against DPS regarding arrests of illegal aliens \"has been settled. As part of that settlement, we are to provide all commissioned officers of the department with this attached statewide agreement, which enunciates our agreement and policy with regard to· the handling of illegal aliens.\"\n\nDated February 1990, the 16-point agreement says DPS shall not enforce federal civil statutes and regulations regarding immigration or question any person, including those stopped on traffic or criminal charges, \"about their right to be in or to remain in the United States\" or \"about their nationality, national origin or place of birth for the purpose of enforcing the civil immigration laws.\"\n\nTalk about clear-cut orders!\n\nWe wanted DPS's perspective on the document, in part because it appears to be more than 20 years old. What did it settle? Does it still apply? DPS spokesman Tom Vinger declined to comment on this front. Earlier, he said the policy published by the Tribune is \"outdated.\" His e-mail continues: \"All of our law enforcement policies are undergoing legal and best practices review, and will be updated as needed.\"", "We didn't land any document from DPS spelling out its policy. Instead, Vinger quoted DPS Director Steve McCraw saying that under DPS's \"operational policy,\" if an officer has \"reasonable suspicion that a person is in violation of a federal immigration law the department will refer that person\" to the U.S. Border Patrol or the Department of Homeland Security's Immigration and Customs Enforcement \"for immediate action.\"\n\n\"Can DPS troopers ask someone if they are here illegally when they pull someone over?\" McCraw said via Vinger. \"A trooper does not ask someone whether they are here legally or illegally when they are stopped; however, once a trooper has a reasonable suspicion that a federal violation has occurred, including immigration, the appropriate federal agency is contacted immediately to take appropriate action.\"\n\nHow long has this \"operational\" policy been in place? \"Several years,\" said Vinger. \"I don’t have a specific time frame.\"", "To recap, White didn't show us evidence of so-called standing orders forbidding officers to ask into anyone's immigration status unless they're under arrest. And DPS didn't cough up a document spelling out a different policy.\n \nHowever, the agency does say its officers do not ask into the legality of anyone's presence here. That seems to hint at standing orders. Without those orders in hand, though, we rate White's statement Half True.", "Dallas Morning News, news article, \"DPS tracked troopers' encounters with illegal immigrants,\" Aug. 12, 2007 (accessed Oct. 29, 2010)\n\nE-mail (excerpted), Katy Bacon, communications director, Bill White campaign, response to PolitiFact Texas, Oct. 29, 2010\n\nE-mails (excerpted), Tom Vinger, assistant chief of media relations, Texas Department of Public Safety, responses to PolitiFact Texas, Oct. 27, 2010 through Oct. 29, 2010\n\nTexas Department of Public Safety, response to Texas Sunset Advisory Commission including 1990 memo and statewide agreement on federal immigration policy, June 9, 2008 (accessed Oct. 29, 2010)\n\nTexas State Directory, 1990 edition, entry for Joe E. Milner, director, Texas Department of Public Safety, p. 239\n\nThe Texas Tribune, \"An Interview With Bill White,\" and \"An Interview With Gov. Rick Perry,\" posted Oct. 18, 2010 (accessed Oct. 27, 2010)\n\nThe Texas Tribune, news article, Houston, state cops have similar immigrant policy, and \"DPS Policy on Illegal Immigrants,\" document referencing Texas Department of Public Safety, May 4, 2010", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]