["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "With a health care vote in the Senate approaching, President Barack Obama discussed reform and compromise in an interview with the\n\nWashington Post\n\n.\n\n\nThe reporter asked Obama what his general thoughts were on compromise in the political process.\n\n\nObama launched into a defense of the health care bill, an area where some of his liberal supporters have accused him of compromising too much.\n\n\n\"Nowhere has there been a bigger gap in the perceptions of compromise and the reality of compromise than in the health care bill,\" Obama said.\n\n\nHe then listed several things he called for during the campaign that he considers to be part of the bill, including coverage for the uninsured, new rules for insurance companies, tax breaks for small businesses and measures that rein in growing costs.\n\n\n\"Every single criteria for reform that I put forward is in this bill,\" Obama said. \"It is true that the Senate version does not have a public option, and that has become, I think, a source of ideological contention between the left and the right. But I didn't campaign on a public option. I think it is a good idea. But as I said in that speech on Sept. 9 (on health care), it is just one small element of a broader reform effort. And so we don't feel that the core elements to help the American people that I campaigned on and that we've been fighting for all year have been compromised in any significant way.\"\n\n\nWe got an e-mail from a reader pointing out Obama's statement that he \"did not campaign on a public option.\" How can that be, the reader asked, when the public option was clearly part of Obama's platform?\n\n\nWe agree that the public option was part of Obama's platform. It's\n\na promise we've listed\n\nin our database of Obama's campaign promises.\n\n\nIt says that through a new health care exchange, \"any American will have the opportunity to enroll in the new public plan or an approved private plan, and income-based sliding scale tax credits will be provided for people and families who need it.\"", "But, we also have to say that the public option was not a very prominent part of Obama's platform. We added the promise in August after the public option became an intense part of the debate. We were able to find the proposal pretty quickly after looking in Obama's campaign literature, but he didn't discuss it very much during the campaign. That's true for both the general election and the Democratic primary.", "If you look for mentions of the public option in Obama's speeches or comments to voters, you'll find very few. In fact, Obama gave a major address in Iowa on May 29, 2007, outlining his health care plan in considerable detail. There's not one mention of the public option in his speech.", "The Democratic primary's big health care battle was over whether there should be\n\nan individual mandate\n\nthat required people to buy health insurance. Candidates Hillary Clinton and John Edwards said there should be a mandate; Obama was opposed. Obama said that people don't buy insurance because they can't afford it, not because they don't want to, and it was wrong to force them.\n\n\nWhen negotiations began on health care legislation in 2009, however, Obama changed his position and supported the mandate. (We gave him a\n\nFull Flop on our Flip-O-Meter\n\n.)\n\n\nSo during the campaign, the public option was not mentioned much.", "But since we track campaign promises, we believe candidates should be held accountable for all their promises, and that includes things they have in their campaign literature. It's up to voters to decide whether the public option --\n\nPromise No. 518\n\n-- is more or less important than Obama's other promises.\n\n\nObama's new claim is, \"I didn't campaign on a public option.\" We will stipulate that it was not a particularly prominent part of his overall platform for health care. But we find that the public option was part of Obama's campaign materials, and that counts. So we rate his statement Barely True.", "Washington Post,\n\nObama lists financial rescue as 'most important thing' of his first year\n\n, Dec. 23, 2009", "Washington Post,\n\ninterview with President Barack Obama (audio)\n\n, Dec. 22, 2009", "Obama health care plan", "New York Times, \"Obama calls for wider and less costly health care coverage,\" May 30, 2007", "CNN via New York Times,\n\nDemocratic debate transcript,\n\nNov. 15, 2007", "New Republic via CBS News,\n\nCautious Candidate, Cautious Plan,\n\nJune 3, 2007", "Hillary Clinton campaign, Health Care Plan", "New York Times,\n\nTranscript of Democratic debate in South Carolina\n\n, Jan. 21, 2008", "PolitiFact.com,\n\nBarack Obama on universal health care\n\n, Dec. 3, 2007", "CBS News,\n\nInterview with Barack Obama\n\n(8:55), July 17, 2009", "PolitiFact.com,\n\nBarack Obama on Hillary Clinton's health care plan\n\n, Feb. 27, 2008", "PolitiFact.com,\n\nBarack Obama mailer on Hillary Clinton's health care plan\n\n, Feb. 27, 2008", "CNN.com,\n\nMore campaign doings\n\n, Feb. 23, 2008", "New Hampshire Public Radio,\n\nInterview with Barack Obama,\n\nNov. 21 2007.", "Lowell (Massachusetts) Sun, \"For some, health insurance reform not so affordable,\" Aug. 26, 2007", "Boston Business Journal, \"Thousands balk at health law sign-up mandate,\" Nov. 12, 2007", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]