["“Here are some interesting points to think about prior to 2020, especially to my friends on the fence,” the post -- which includes a picture of Allen and has been shared here and here -- quotes him as saying.", "“Women are upset at Trump’s naughty words -- they also bought 80 million copies of 50 Shades of Gray,” it said, alongside criticism of defeated 2016 presidential candidate Hillary Clinton, her husband Bill, and their daughter, Chelsea.", "“We are one election away from open borders, socialism, gun confiscation, and full-term abortion nationally. We are fighting evil.”", "A post on Instagram by Trump’s son, Eric, in September 2019 includes a quote from the same comments shared on Facebook, alongside a photo of Allen.", "The misattribution of the quotes apparently dates to August 2019, when Tim Allen, a 60-year-old who works at a jewelry store in Virginia, published a post on his Facebook account.", "He told AFP by phone that he shared the post “a while ago” and got it “from somebody else” on Facebook, and that he was not aware his post had been attributed to the comedian.", "The actor Tim Allen, 66, best known for his starring role as Tim ‘The Toolman’ Taylor in the American sitcom, “Home Improvement,” and as the voice of Buzz Lightyear in the Toy Story movies, had nothing to do with the post.", "His publicist, Marleah Leslie, told AFP by email that it “was not written by my client Tim Allen.”", "The content shared on Facebook is similar to other material circulating online, such as this tweet, as well as this opinion piece and this Facebook post from singer and guitar player Ted Nugent published prior to the one by Tim Allen of Virginia.", "Some comments included with shares of the Facebook post refer to the actor as a “conservative in a land of liberals” or the “last man standing,” the name of his current sitcom, in which he plays a conservative character with snarky lines targeting Democrats.", "The comedian backed Republican presidential candidate John Kasich in 2015 and attended Trump’s inauguration in 2016.", "The Washington Post and Snopes are among other media organisations who have debunked the Facebook post.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]