["The conspiracy theory appeared in 2012 after some thought a mugshot of a man with that name looked like Mark Zuckerberg, but a simple comparison shows they’re not the same person.", "There is no one with the name Jacob Greenberg related to the Rockefeller family.", "An online conspiracy theory claims Facebook founder and CEO Mark Zuckerberg’s \"real\" name is Jacob Greenberg, and that he’s secretly the grandson of the late David Rockefeller and the family established an elaborate scheme to make money off of the social media network.", "The Facebook post features photos of Zuckerberg, Rockefeller and the Central Intelligence Agency logo.", "It reads:", "\"Did you know that Mark Zuckerberg’s real name is Jacob Greenberg? And he is the grandson of David Rockefeller. Zuckerberg is German for ‘sugar mountain.’ Their clandestine word for ‘Facebook’ No doubt: A mountain of information from which they can extract billions. The Rothschild’s own nearly 10% of all Facebook shares and FB was funded with $500,000,000 USD from a CIA owned bank, which is not a secret.\"", "All of this is nonsense. Zuckerberg’s \"real\" name is not Jacob Greenberg, his grandfather was not David Rockefeller, and there is no evidence of a money-making scheme involving the CIA.", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "RELATED: Meme way off in claim that the Rothschild family holds '80 percent of the world's wealth'", "Zuckerberg shares no relation to the Rockefeller family. He was born on May 14, 1984, in White Plains, N.Y.., to parents Karen and Edward Zuckerberg.", "A Facebook spokesperson told PolitiFact the Rockefeller claim is false.", "This bizarre theory appears to date back to 2012, when a man named Jacob Greenberg was arrested for marijuana possession in Arizona and some people thought his mugshot looked a lot like Zuckerberg.", "But a close look shows they’re not the same person. Zuckerberg was a billionaire at this point, so an arrest for drugs in Arizona would have been covered by local and national media outlets.", "Still, there are conspiracy theorists who say Zuckerberg is secretly the grandson of Maurice \"Hank\" Greenberg, who was once a member of the Rockefeller-founded trilateral commission, and who supposedly married one of Rockefeller’s four daughters. Maurice Greenberg did marry a woman named Corinne Phyllis Zuckerman, but she’s not David Rockefeller’s daughter and doesn’t appear to share any relation with the Rockefeller family — or with Mark Zuckerberg.", "We rate this Pants on Fire!", "Facebook post, June 18, 2020", "Mugshots.com, Jacob Greenberg mugshot, Feb. 17, 2012", "CNN, Hank Greenberg Fast Facts, April 16, 2020", "Snopes, Mark Zuckerberg's real name is Jacob Michael Greenberg and he is the grandson of billionaire David Rockefeller. Aug. 22, 2016", "Email interview, Dave Arnold spokesperson at Facebook, July 27, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]