["About this rating", "Elon Musk is not a big fan of Facebook, but does the Tesla and SpaceX CEO really plan on purchasing the social media platform just so he can delete it? That was the conceit of a satirical article published on the website alternative-science.com in March 2018:", "Today, Musk announced that he has reached out to Facebook and offered to buy every share of the company, effectively making him the sole owner of the social media platform. Musk was speaking to a gathering of SpaceX and Tesla investors and told the group even though he has deep misgivings about the site, he’d “do humanity a favor” and buy it.", "“I’ve got some cash to burn, so if Zuck wants to make a deal, he knows where to find me,” Musk told investors. “I’d make him a fair offer.”", "Musk showed the investors in the room an animated video that detailed his plans for Facebook. The video shows a SpaceX Falcon rocket blasting off into the sky. At one point the two solid boosters fall off and glide on a precise path down to the landing pad. Both rockets land perfectly square, and one ends up resting gently on a big red button labeled “DELETE.”", "This article has been shared hundreds of thousands of times on social media, and many readers appear to have mistaken in for a genuine news report.", "This piece was a purely satirical article published in the wake of Musk's decision to delete the Facebook pages of his Tesla and SpaceX companies in March 2018. At the time, Musk wrote on Twitter that the social media platform gave him the \"willies\":", "The Alternative-Science piece fooled a number of readers, even though the website includes multiple indicators that its content is satirical in nature. For one, the \"About\" section on the web site's Facebook page notes that its articles contain \"alternative facts\" that may not be \"true\" or \"accurate\":", "Alternative Science is the World Wide Internet's premier and most trusted location for alternative facts and embracing your feelings. Whether or not the scientific facts, studies, or statements represented on Alternative Science are technically \"true\" or \"accurate,\" savvy readers know that doesn't matter -- only what they feel should be true is.", "Alternative Science asks the question: \"Who needs science to prove anything?\"", "The article was also written by satirist James Schlarmann, who is also responsible for the political humor web site The Political Garbage Chute. A blurb about Schlarmann at the bottom of this article states that readers \"definitely should not give that much of a shit about his opinions.\"", "Telsa CEO Elon Musk truly said that Facebook gave him \"the willies,\" but he did not present a plan to a roomful of investors to buy the social media company, nor use rockets to push a giant delete button in order to get rid of it.", "Clifford, Catherine.   \"Elon Musk: Facebook 'Gives Me the Willies.'\"\r\n    CNBC.   26 March 2018.", "Schlarmann, James.   \"Elon Musk Offers to Buy and Then Delete Facebook.\" \r\n    Alternative-Science.com.   30 March 2018.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]