["Gov. Andrew Cuomo continues to defend his administration’s handling of COVID-19 in nursing homes following a high-profile independent investigation. Compared to the rest of the country, nursing home deaths linked to the virus are below average, Cuomo said.", "State Attorney General Letitia James revealed in a report on Jan. 28 that the death toll from the virus among residents of nursing homes had been undercounted in data released by the state Health Department. The report found that the Health Department had reported the overall number of COVID-19 deaths among all state residents accurately.  The administration had said it did not want to double count nursing home residents who died in hospitals. So their deaths in hospitals were not counted as part of the nursing home death toll. The administration has since said the numbers of people transferred from nursing homes to hospitals \"is an important data point.\"", "\"If you look at New York state, we have a lower percentage of deaths in nursing homes than other states,\" Cuomo said during a press briefing on Jan. 29. \"A third of all deaths in this nation are from nursing homes. New York state, we are only at about 28 percent - only. But we’re below the national average in number of deaths in nursing homes.\"", "We approached the Cuomo administration for the source of its data.", "The governor’s staff directed us to a statement from Dr. Howard Zucker, the state’s health commissioner, from Jan. 28.", "In response to the attorney general’s report, Zucker cited data from the Centers for Disease Control and Prevention and KFF, formerly the Kaiser Family Foundation, a nonpartisan source of health information.", "According to the Health Department, from March 1, 2020, to Jan. 19, 2021, there were 9,786 confirmed deaths of skilled nursing facility residents, including 5,957 in nursing facilities and 3,829 in hospitals. Zucker cautioned that the department’s audit is ongoing, but these figures represent audited data so far. The nursing home residents who died from COVID-19 account for 28 percent of New York’s 34,742 confirmed fatalities, which is below the national average, Zucker said.", "Zucker compared KFF data to CDC data to calculate that nationally 35 percent of total deaths affect nursing home residents.", "Across the country, KFF’s tally is 146,888 long-term care fatalities, as of Jan. 22. This figure includes some nursing home staff members, as well as residents, in the areas of the country where this data is reported. The CDC reported 423,519 total deaths as of Jan. 26, 2021.", "Adding the number of deaths of nursing home residents who had presumed cases of COVID-19 -- 2,957 -- brings the New York percentage of nursing home deaths to 29.8 percent, still below the national average, Zucker said.", "We asked a senior policy analyst with KFF about Cuomo’s claim.", "Priya Chidambaram, who studies COVID-19 in nursing homes, told PolitiFact on Feb. 5 that Cuomo’s claim is consistent with the available data.", "\"No matter which way you cut it, the New York share does appear to be lower than the national average,\" Chidambaram said.", "In October, we fact-checked Cuomo’s claim that New York was \"No. 46 out of 50 states... we're 46th in terms of percentage of deaths in nursing homes,\" and found it to be Mostly False. That’s because Cuomo was comparing New York to other states while not releasing data about deaths of nursing home residents in hospitals, which would have changed New York’s ranking.", "KFF also warns that because states report data differently, \"data cannot be compared between states.\"", "Comparing New York to a national average \"is a more fair reading of where New York ranks,\" Chidambaram said.", "We also spoke with Robert Applebaum, a gerontology professor who tracks COVID-19 nursing home data at Miami University, which has a partnership with AARP.", "\"I would say that our data continued to show that New York state deaths are on average, per hundred, below the national average by a fair amount,\" Applebaum said.", "People who study the virus in nursing homes warn that data can be incomplete. States have different procedures for collecting and reporting data, such as collecting information about residents and staff, as well as the types of care facilities that are included.", "The Covid Tracking Project, an independent research initiative, found that as of Jan. 28, the last data release before Cuomo’s statement, 157,069 long-term care residents, including assisted living facilities, and 423,645 people had died of the virus nationwide, presumed and confirmed cases. Long-term care residents represent 37 percent of total deaths in this case. In New York, 25.2 percent of total deaths involved long-term care residents, according to the Covid Tracking Project, though researchers caution that the data could represent an undercount.", "A week after Cuomo made his statement, the New York numbers changed significantly.", "The Cuomo administration released more data, through Feb. 4, about COVID-19-related deaths of people who lived in nursing homes. Presumed and confirmed virus-related deaths total 13,163, according to an analysis from the Empire Center, a conservative think tank that sued the administration for nursing home data. On Feb. 5, Cuomo announced overall deaths totaled 35,920, meaning the 36.6 percent of virus deaths were related to nursing homes. The Covid Tracking Project’s national average of deaths of long-term care facility residents, as of Feb. 7, was 36 percent. KFF calculated the national average of long-term care deaths as a percentage of total deaths at 37 percent, as of Feb. 8.", "At PolitiFact, we base our rulings on information available at the time the person we are fact-checking made the statement.", "Cuomo said that New York’s coronavirus-related death toll of nursing home residents was below the national average. Nationally, long-term care residents account for about 37 percent of COVID-19 deaths, according to KFF.", "Data from KFF, the federal government and New York state show that New York’s nursing home-related deaths, as a percentage of overall COVID-19 deaths, were below the national average at the time of Cuomo’s claim. Since then, new data about the deaths of all nursing home residents, regardless of where they died, raised the percentage of nursing home residents among the state's COVID-19 fatalities. It is still slightly below the national average calculated by KFF.", "While his statement is accurate, there are still inconsistencies among the states in how they calculate their nursing home data, and that needs to be taken into account.", "So we rate Cuomo’s claim Mostly True.", "Video, via WROC-TV and YouTube, Gov. Andrew Cuomo’s press briefing, Jan. 29, 2021.", "Phone interview, Melissa De Rosa, secretary to the governor, Richard Azzopardi, senior advisor  to the governor, Feb. 1, 2021.", "Statement from Dr. Howard Zucker, commissioner, New York State Department of Health, Jan. 28, 2021. Accessed Feb. 1, 2021.", "New York State Office of the Attorney General Letitia James report, \"Nursing Home Response to COVID-19 Pandemic,\" revised Jan. 30, 2021. Accessed Jan. 31, 2021.", "KFF, chart, \"Metrics in Long-term Care Facilities,\" Feb. 3, 2021. Accessed Feb. 3, 2021.", "Centers for Disease Control and Prevention, table, \"Trends in Number of COVID-19 Cases and Deaths in the US Reported to CDC, by State/Territory,\" Jan. 26, 2021. Accessed Feb. 3, 2021.", "Email interview, Erin Kissane, managing editor, the COVID Tracking Project, Feb. 4, 2021.", "Phone interview, Priya Chidambaram, senior policy analyst, KFF, Feb. 5, 2021.", "Phone interview, Robert Applebaum, Ph.D., professor of gerontology, director of the Ohio Long-Term Care Research Project, Miami University, Feb. 5, 2021.", "Associated Press via NBC4, \"New York’s True Nursing Home Death Toll Cloaked in Secrecy,\" Aug. 11, 2020. Accessed Feb. 7, 2021.", "Covid Tracking Project, \"Long-Term Care National Historic Data,\" Jan. 28, 2021. Accessed Feb. 7, 2021.", "Empire Center, \"The Cuomo Administration Releases More Data on Coronavirus Deaths in New York Nursing Homes,\" Feb. 6, 2021. Accessed Feb. 7, 2021.", "New York State Department of Health, \"Nursing Home and ACF COVID Related Deaths Statewide Data through February 04, 2021.\" Accessed Feb. 7, 2021.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]