["About this rating", "First lady Melania Trump unveiled a newly renovated White House Rose Garden on Aug. 22, 2020, posting images to Twitter of a neatly manicured space. The news sparked a backlash among those unhappy with the new design.", "People shared their opinion about the renovation on social media, alongside images showing the garden before and after the renovation. The \"before\" images were more colorful, showing spring flowers and crab apple trees in bloom. The \"after\" images featured more green with white and pastel blooms, and the crab apple trees were gone.", "The images prompted some people on social media to express passionate opinions about the garden's appearance. Some claimed Trump had \"ruined\" what amounted to a national legacy, and others expressed that they liked the new look.", "The hubbub over the Rose Garden renovation prompted Snopes readers to write in and ask about resulting internet rumors, namely that Trump had \"ruined\" the garden by ripping out trees planted by former first ladies. \"Did Melania Trump dig up all the roses in the White House rose garden and have the trees planted by Kennedy's removed?\" one reader asked.", "Other readers asked about social media posts claiming that Melania Trump had dug up historic rose bushes planted by every first lady since 1913. Here is an example of one such meme posted to Facebook:", "Both of these claims were misleading.", "It's true that the garden designed and planted during the Kennedy administration contained crab apple trees. But the trees removed in the renovation unveiled in August 2020 were not the same trees as the ones originally planted in the garden. And it's not true that the garden contained roses planted by every first lady since 1913.", "Landscape historian Marta McDowell, author of \"All the Presidents' Gardens,\" told us in a phone interview that the crab apple trees have been replaced three times since the original planting in the 1960s, and the tree type changed from one called Katherine to another called Spring Snow.", "Although the trees were pretty, McDowell said, they have always been problematic because as they grew they shaded out the roses, and \"if you want roses, you can't grow them in the shade.\"", "\"I'll miss the crab apple trees because they look good in the winter, but that's like saying, 'I like chocolate and you like vanilla,'\" McDowell said.", "In terms of the claim about Trump's removing rose bushes planted by every first lady since 1913, McDowell pointed to a landscape report completed in 2020 by the Committee for the Preservation of the White House, noting that flower plants in the garden have continually been removed and replaced.", "\"Is the garden outside your back door the same as it was 60 years ago? That's what people are suggesting,\" McDowell said, adding, \"Roses don't live that long.\"", "McDowell also stated that although the idea that current first lady Melania Trump dug up the Rose Garden planted by former first lady Jackie Kennedy made for good internet outrage, that was false framing of the conversation.", "It was former U.S. President John F. Kennedy who designed the Rose Garden when it was renovated in 1962, although he tapped his wife's close friend, horticulturalist Bunny Mellon, to accomplish the task. Mellon recounted that Kennedy approached her about the project after returning from a trip abroad:", "He and Mrs. Kennedy had just returned from a state visit to France, followed by stops in England and Austria. The President had noted that the White House had no garden equal in quality or attractiveness to the gardens that he had seen and in which he had been entertained in Europe. There he had recognized the importance of gardens surrounding an official residence and their appeal to the sensibilities of all people.", "He wanted to start, in the greatest haste, to remake the area near his office at the west end of the White House, known as the Rose Garden, into an area both useful and attractive. Would I design it for him? It was a startling request to say the least.", "Melania Trump said that the 2020 renovation \"returned the garden to its original 1962 blueprint designed by Bunny Mellon during the Kennedy Administration.\" Trump also said that the renovation improved utilities, infrastructure, and added a paved path, increasing access to the garden for people with disabilities.", "Photo: The White House", "The crab apple trees removed from the garden in 2020 were placed in the White House greenhouse and will be replanted elsewhere on the grounds. We sent questions to the White House about where those trees will be replanted and when. We also asked for records showing the original 1962 design referenced in Trump's statement but haven't yet received a response.", "As of April 30, 2021, more than 55,000 people have signed a Change.org petition urging first lady Jill Biden and second gentleman Doug Emhoff to \"Restore Jackie Kennedy's Rose Garden.\"", "\"Jackie's legacy was ripped away from Americans who remembered all that the Kennedy's meant to us,\" the petition reads. \"We want Jill Biden and Doug Emhoff to take this on and restore the Rose Garden to Jackie's oriiginal (sic) design.\"", "WhiteHouse.gov.   \"Readout from the Reopening of the White House Rose Garden.\"     22 August 2020.", "Mellon, Rachel Lambert.   \"President Kennedy's Rose Garden.\"     WhiteHouseHistory.org.   Accessed 24 August 2020.", "Committee for the Preservation of the White House.   \"The White House Rose Garden Landscape Report.\"     Accessed 25 August 2020.", "Robinson, Adia.   \"First Lady Melania Trump Unveils White House Rose Garden Restoration.\"     ABC News.   22 August 2020.", "Updated to note an April 2021 petition seeking restoration of Rose Garden design before Melania Trump's redesign.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]