["The photos were published in this Facebook post on July 24, 2019.", "Its Hindi-language caption translates to English as: “Weapons recovered from a mosque in Gujarat. What are these Muslims up to after all? Similar weapons would be recovered if all the mosques across the country were searched. See the black words of politics on white pages. Weapons are being seized from mosques, but the saffrons are being dubbed as terrorists.”", "Gujarat is a state in western India. \"Saffrons\" refers to Hindus; saffron is an important colour in the religion.", "Below is a screenshot of the misleading Facebook post:", "Some of the same photos were published on Facebook here, here, here and here with a similar claim, and on Twitter here and here.", "The claim is false. Police told AFP the weapons were confiscated from a hotel, not a mosque.", "Speaking to a journalist from AFP’s Delhi bureau by phone on August 2, 2019, Dineshbhai R. Rathore, head constable of the Kuvadava Road Police Station in the city of Rajkot in Gujarat, said:", "\"The stash of illegal weapons were confiscated from India Palace Hotel on Rajkot-Ahmedabad Highway, and not from any mosque.\"", "Some of the photos in the misleading posts have circulated online since March 2016 in reports about a stash of weapons police recovered from a novelty store operated inside a hotel on the Ahmedabad-Rajkot highway in Gujarat.", "A reverse image search on Google found one of the images was published in this news report published on March 5, 2016, by local news portal Gujarat Headline.", "Below is a screenshot of the report:", "The report’s headline states: “Rajkot: Stock of lethal weapons found from novelty store; 5 persons arrested.”", "The Gujarat Headline also posted some more pictures of the seized weapons here on Twitter on the same day:", "#Rajkot: stock of #lethal #weapons found from #Novelty #store; 5 persons arrested https://t.co/oJrQBHE7Sp #Gujarat pic.twitter.com/A9jRB77W2r", "A keyword search on Google subsequently found this report about the incident published by the Times of India on March 6, 2019.", "The first paragraph of the Times of India report states: “The Rajkot detection of crime branch (DCB) and Kuvadava Road police busted an illegal weapons racket that was being operated from a hotel near Kuchiyadad village of Chotila on Rajkot-Ahmedabad highway and arrested five persons. They also seized 257 lethal weapons including swords, and knives from the hotel.”", "The same photos and claim were debunked by Indian fact-check site Hoax Slayer on March 28, 2017 here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]