["About this rating", "A passing detail in Garrett M. Graff's chilling book Raven Rock: The Story of the U.S. Government’s Secret Plan to Save Itself — While the Rest of Us Die (Simon & Schuster, 2017) caught the eye of a vigilant Snopes reader, who wrote in to ask:", "In it, he mentions signs seen on Interstate Highways in the '50s that said, \"In case of enemy attack, this road will be closed to all but military vehicles.\" I don't remember ever seeing a sign like this, nor can I find any mention of them on Google. Did they exist?", "The subject is briefly broached on page xxii of the book's introduction, in which Graff recounts the history of U.S. efforts to prepare in advance for national catastrophes such as nuclear war:", "... America's concrete highways themselves grew out of the fear of attack — the 41,000 miles of interstates built under an Eisenhower program partly served to help the nation speed war materiel around the nation in case of a nuclear attack. The original name for the limited-access paved road network was the National System of Interstate and Defense Highways, and children of the era may recall the signs that sprouted up along the major roads that warned \"In case of enemy attack, this road will be closed to all but military vehicles.\"", "There should indeed be at least a few baby boomers who remember such signs, which according to contemporaneous press reports were erected along designated roadways as early as 1951 as part of a nationwide civil defense preparedness initiative launched by the Truman administration (making them older than Eisenhower's interstate highway system, which wasn't authorized until 1956). The effort was driven by two events:  the Soviet Union had conducted its first atom bomb test in 1949, and, North Korea, with the backing of both the U.S.S.R. and China, had attacked South Korea the following year, raising the specter of a nuclear confrontation.", "Beginning with the publication of a civil defense manual (nicknamed the \"Blue Book\" for the color of its cover) aimed at all levels of government in September 1950 and culminating later that year in the creation of the Federal Civil Defense Administration (FCDA, a precursor to today's FEMA), the Truman administration conceived an emergency management system that issued guidance from the top while delegating the nuts and bolts of implementation to state and local entities.", "For example, a section of the Blue Book calling for the creation of emergency transportation networks to facilitate both military and civilian use of the roadways didn't specify precisely how it was to be done:", "Routes should be designated through large urban centers, and plans and procedures made for dispatching convoys and operating traffic under controlled dispatch and priorities over the transportation network.", "Police training should include measures to be taken at the time of an alert, including the control of panic traffic, and the keeping of certain thoroughfares free from obstruction for both civilian and military movement.", "In addition, there must be provision for the limitation of movement of persons and vehicles, both during and after an emergency.", "Local civil defense coordinators charged with developing these plans set about the task with varying degrees of urgency. New York City was among the first municipalities to undertake planning for emergency traffic control, with Civil Defense Director Arthur W. Wallender announcing in February 1951 that the use of certain roadways would be restricted in the event of enemy attack, and unauthorized movement of civilian vehicles prohibited. On 9 February, the New York Times published a photograph of workmen erecting a sign on the outskirts of the city that read \"In the event of an enemy attack on New York City this highway will be closed to all traffic except civil defense & military vehicles.\"", "One of these signs shows up briefly (at the 3:19 minute mark) in the short film \"Our Cities Must Fight,\" produced for the federal government in 1951 by Archer Productions (the same outfit responsible for the nuclear survival training film now regarded as a quintessential example of Cold War kitsch, Duck and Cover):", "Press reports show that the implementation of local emergency transportation plans continued throughout 1951, though it's unclear how many of these included signage like New York City's. An example of one metropolitan area that did follow suit was Boston and environs, who announced their defense plan in the North Adams Transcript on 30 March:", "The first of a series of signs informing the public that the designated roads would be closed in the event of attack were erected yesterday on Route 1, the Newburyport Turnpike in Saugus.", "The signs, made by the state public works department, state: \"In the event of enemy attack on Boston this highway will be closed to all traffic except civil defense and military vehicles.\"", "Massachusetts civil defense officials offered insights into the reasoning behind restricting civilian traffic:", "The purpose of closing the highways to the public is to provide safe and efficient routes for orderly withdrawal of the civilian population and to expedite military vehicular movements with the least possible conflict.", "They further explained that:", "The decision to restrict traffic was based on experience in Europe during the last war when evacuees on foot and in vehicles clogged highways and impeded military and rescue traffic. The signs, it is believed, will educate the public in advance and will emphasize to motorists the importance of keeping non-essential traffic off primary roads in event of emergency.", "Some state and local governments took years to produce tangible results. For example, Maryland's emergency transportation plan wasn't rolled out until July 1953 and Virginia's \"closed in event of enemy attack\" signs didn't go up until 1954 — by which time some emergency management experts were rethinking the wisdom of restricting civilian access to highways. Among them was Eisenhower's FCDA Administrator Val Peterson, among whose top priorities was responding to the U.S.S.R.'s development of a hydrogen bomb.", "A 14 July 1954 editorial in the Syracuse, New York newspaper The Post-Standard reflected the shift in strategic thinking that had occurred:", "Evacuation of cities becomes urgent due to the growing hydrogen bomb power, says U.S. Civil Defense Administrator Val Peterson.", "The bomb has limited the choices to \"die, dig or get out\" and cities must develop plans for evacuation, Mr. Peterson emphasizes. Bomb shelters do not solve the problem, he admits, so Americans can die or get out.", "The choice is further limited by signs outside cities in this state proclaiming that in event of enemy attack the highways will be closed to all except essential traffic.", "By 1955, according to a Gannett News Service report, Peterson was openly calling for the signs to be torn down, a proposal that didn't sit well with some local civil defense directors:", "Federal Civil Defense Administrator Val Paterson says the signs are obsolete, reflecting a theory that was valid when the people of a city could only take shelter from atomic bombs.", "Now that bombs are more devastating and it is possible to give longer warning of an attack, highways should be kept open so the population of a threatened city can get into open country, according to Peterson,", "Lt. Gen. Clarence R. Huebner (USA, Ret.), New York State Civil Defense director, asserts that the signs \"are not obsolete.\" He contends that control over the highways will be needed for many purposes, including aid to bombed areas and movement of people under civil defense direction, in event of an attack.", "The signs will stay up as long as Huebner feels they are needed, say federal officials, because FCDA is only an \"advisory and coordinating agency\" and cannot issue orders to New York State.", "Stay up they did (at least for a few more years), but their extinction would be inevitable thanks to the reality of the H-bomb and the Eisenhower administration's stated preference for mass evacuation over \"duck and cover.\"", "By 1958, newspaper columnists like Pulitzer-winning Marquis Childs were ridiculing the signs as vestiges of a dysfunctional civil defense system:", "Still standing on many highways are the signs that read, \"In the event of enemy attack this highway will be closed to all but emergency traffic.\"", "The signs were put up when the biggest bomb was in the kiloton (measured in thousands of tons of conventional explosive) range and the idea was that rescue workers would come into the destroyed center of a city.", "Today the bombs are in the megaton (millions of tons of conventional explosive) range and the whole city is destroyed. Yet the signs stand as pathetic reminders of the sham of civil defense. The states will not pay to take them down and the federal Civil Defense Administration lacks the authority.", "In 1961, Virginia Sen. A. Willis Robertson (at that time the newly elected chairman of the joint Senate-House Defense Production Committee) characterized the signs as a waste of taxpayer money:", "Concerning the proposed fallout study, Robertson said, the committee hopes to \"safeguard public funds from the type of waste heretofore incurred in the erection all over the nation of highway signs concerning the closing of roads in the event of enemy attacks.\"", "We were unable to ascertain when the last of the \"highway closed in event of enemy attack\" signs finally came down, though we're fairly sure none survived beyond the 1960s, after which point the only published mentions of them we found were couched in the past tense. A February 1977 article in the Hamilton, Ohio Journal-News reminded readers that they had once existed, at the same time noting that they seemed to have \"faded from the highway landscape.\"", "Childs, Marquis.   \"Civil Defense Just Doesn't Exist Today.\"\r\n   St. Louis Post-Dispatch.   25 April 1958.", "Fay, Elton C.   \"Melancholy Air of U.S. Civilians Results from Dark Atomic Picture.\"\r\n   Associated Press.   12 February 1951.", "Graff, Garrett M.   Raven Rock: The Story of the U.S. Government’s Secret Plan to Save Itself — While the Rest of Us Die.\r\n   New York: Simon & Schuster, 2017.   ISBN 9781476735405, p. xxii.", "Lucas, Jim C.   \"What You Should Do in Case of 'Enemy' Air Attack on U.S.\"\r\n   Scripps-Howard News Service.   23 November 1956.", "Rogers, James.   \"Highway Civil Defense Signs Under Attack.\"\r\n   Gannett News Service.   9 March 1955.", "Associated Press.   \"Sen. Robertson Elected Chairman of Committee.\"\r\n   9 March 1951.", "Denton Journal.   \"30 Percent of State's Roads in Emergency Highway System.\"\r\n   3 July 1953.", "Dept. of Homeland Security.   \"Civil Defense and Homeland Security: A Short History of National Preparedness Efforts.\"\r\n   September 2006.", "Federal Highway Administration.   \"History of the Interstate Highway System.\"\r\n   27 June 2017.", "The Indianapolis News.   \"Civil Defense to Seek Sign Okay.\"\r\n   4 December 1951.", "Journal-News.   \"Planners Described Interstate as Drivers' Dream.\"\r\n   13 February 1977.", "The New York Times.   \"Emergency Routes in City Designated.\"\r\n   18 February 1951.", "The New York Times.   \"Measures Taken to Aid the Civil Defense Program.\"\r\n   9 February 1951.", "The Philadelphia Inquirer.   \"Signs to Mark Defense Routes.\"\r\n   22 July 1951.", "The Post-Standard.   \"Bombs and Evacuation.\"\r\n   14 July 1954.", "The Progress-Index.   \"New Signs Mark Highways Strategic for Defense.\"\r\n   21 March 1954.", "The Transcript.   \"Enemy Attack to Close 3 Area Highways to Public.\"\r\n   30 March 1951.", "United Press.   \"Louisiana Prepares for Enemy Attack.\"\r\n   14 October 1951.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]