["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "In a speech defending his plans for the detainess at Guantanamo Bay, Cuba, President Barack Obama said Americans should not be concerned about them being transferred to the United States because federal prisons are secure.", "\"Where demanded by justice and national security, we will seek to transfer some detainees to the same type of facilities in which we hold all manner of dangerous and violent criminals within our borders — highly secure prisons that ensure the public safety,\" Obama said. \"Bear in mind the following fact: Nobody has ever escaped from one of our federal '\n\nsupermax\n\n' prisons.\"", "First, we should note that Obama's comment suggests there is more than one federal\n\n\"supermax\n\n\" facility. But there's actually just one, the Administration Maximum Facility in Florence, Colo., according to the Federal Bureau of Prisons. Some states have built their own maximum security prisons, but it's clear Obama was referring to federal facilities because they would be the ones to house the suspected terrorists.", "The security of the \"Alcatraz of the Rockies,\" as the Florence prison is known among correctional program professionals, has been cited frequently by Democrats as lawmakers and the administration battle over where to relocate the detainees. Obama is seeking to close the Guantanamo prison by January 2010.", "Many Republicans believe it should remain open, and many Democrats have also grown wary. A bipartisan group of lawmakers blocked funding to close the facility until Obama comes up with a more detailed plan on what would happen to the detainees.", "Meanwhile, some Senate Democrats, including Assistant Majority Leader Richard\n\nDurbin\n\nand California Sen. Dianne\n\nFeinstein\n\n, have suggested that\n\na supermax\n\nprison is the best place to house the suspected terrorists.\n\n\nAs you might expect, living is austere at the Alcatraz of the Rockies. Prisoners are kept in small cells and have limited contact with others. Florence is already home to several widely known international and domestic terrorists, including the \"shoe bomber\" Richard Reid, and\n\nZacarias\n\n\nMoussaoui\n\n, a man sentenced to life in prison for his involvement in the 9/11 attacks.", "As for Obama's statement, federal prison officials confirmed that he is correct. No prisoner has ever escaped from the only federal\n\nsupermax\n\nfacility since it was opened in 1994, no doubt thanks to the $10 million perimeter fence and the remote-controlled steel doors. We find his statement True.", "Forbes Magazine, \"\n\nIs The End In Sight For Supermax?\n\n\" by\n\nJeffrey Ian Ross, April 18, 2006.", "Obama's Remarks on Guantanamo Bay\n\n, May 21, 2009.", "CNN,\n\n\"Reporters Get First Look Inside Mysterious Supermax Prison,\"\n\nby Terry Frieden, Sept. 14, 2007", "BBC, \"\n\nSupermax' Prison awaits Moussaoui\n\n,\" May 2, 2006.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]