["About this rating", "In a March 18, 2020 episode of \"The View,\" McCain said she did not have \"a problem\" with various labels for COVID-19, including the racially inflammatory ones used by then-President Donald Trump.", "The clip shown on \"Last Week Tonight\" did not represent the entirety of McCain's remarks. Later in the same discussion, she stipulated that she did not support any kind of \"racial targeting\" against Asian Americans.", "In the aftermath of a March 16, 2021, shooting rampage in which eight people, mostly Asian-American women, were shot dead at three Atlanta-area spas, attention turned to the scourge of anti-Asian bigotry, violence, and harassment in the United States.", "In the March 21 episode of his HBO show \"Last Week Tonight,\" the English comedian John Oliver highlighted that \"absolutely terrible trend\" and outlined the long record of anti-Asian rhetoric, violence, and discrimination in American history.", "Oliver also brought up widespread concerns about former U.S. President Donald Trump's repeated insistence on referring to COVID-19 with inflammatory labels such as \"the China virus\" and \"the Chinese virus,\" despite guidelines that discourage naming diseases after nations or regions because it can cause baseless stigmatization and vilification of entirely blameless ethnic, racial, and national groups.", "Oliver said the argument against using those labels was one that \"not everyone seemed to find convincing\" and segued into a clip of the commentator Meghan McCain, daughter of former U.S. Senator and Republican presidential candidate John McCain, speaking on ABC's \"The View.\" In the clip, McCain could be heard to say:", "I don't have a problem with people calling [COVID-19] whatever they want. It's a deadly virus that did originate in Wuhan. I don't have a problem with it.", "Oliver mocked McCain, pointing out that in the aftermath of the Atlanta shootings, she had posted on Twitter \"STOP ASIAN HATE\" along with \"three broken heart emojis,\" which he described as \"a fine sentiment to throw up on Twitter after the fact,\" adding: \"But there has to be an understanding that saying 'I don't have a problem with calling it the China virus' is very much giving space for that hate to grow.\"", "The day after Oliver's criticism, McCain apologized on Twitter, writing: \"I condemn the reprehensible violence and vitriol that has been targeted towards the Asian-American community. There is no doubt Donald Trump’s racist rhetoric fueled many of these attacks and I apologize for any past comments that aided that agenda.\" The episode formed the basis of news reports by various outlets including Los Angeles Times, Entertainment Weekly, and Yahoo! News.", "We examined the original source of McCain's remarks and checked the context leading up to and following them. Our conclusion is that Oliver fairly and accurately represented her pronouncement that she had no objection to various labels for COVID-19, including those used by Trump. Though stripped from a longer discussion, the editing of McCain's comments did not misrepresent their sense. As a result, we are issuing a rating of \"True.\" However, later in the same discussion, McCain did emphasize that she did not support any kind of \"racial targeting\" against Asian Americans.", "The clip shown by Oliver originally came from a discussion on the March 18, 2020, episode of ABC's \"The View.\" That conversation can be watched in full, below. The panel debated Trump's use of the term \"Chinese virus,\" and at one point Dan Abrams, ABC News chief legal analyst and a guest on that day's episode, provided the following political assessment of the controversy:", "I think this is one of these issues that I think, in particular, if many on the Left get too focused on, Trump's going to win [the 2020 presidential election] on this. The bottom line is the vast majority of Americans are going to say \"Tell me what to do on Coronavirus, I care about this virus, it matters. I'm glad, finally, the Trump administration is recognizing how serious it is.\" But if people start focusing on \"What is he calling it? He's calling it the 'Chinese virus' vs. the coronavirus\" — Look, do I think he should be calling it \"the Chinese virus\"? No. But I think it's a losing argument for the Left to make because I think the vast majority of Americans are going to say \"Who cares?\"", "Host Whoopi Goldberg appeared to condemn the use of such labels because it could lead to attacks on Asian Americans, saying \"We need to stop calling it, or labelling it like it's — 'they did it to us.' Mother Nature really did this to us.\" At that point, McCain intervened. In the interests of thoroughness and transparency, the following is a lightly edited transcript of her remarks:", "McCain: But I think part of the problem is in December [2019], there were a bunch of Chinese doctors that were sounding the alarm on this virus, and the Chinese government — or, you know, lack of the government — was trying to suppress them. And they [the doctors] were trying to give out warnings. I actually have a friend whose brother was in China, and the lack of information — they don't have access to social media.", "I agree with you [Abrams] that I think if the Left wants to focus on PC [politically correct] labelling this virus, it is a great way to get Trump reelected. I don't have a problem with people calling it [COVID-19] whatever they want. It's a deadly virus that did originate in Wuhan. I don't have a problem with it. And I think that China, how they acted right away, had we had more access to information, maybe it wouldn't have gotten to the place that it is. That doesn't mean that we should be in any way stereotyping —", "Goldberg: We shouldn't pointing fingers at people —\nMcCain: I'm pointing fingers at China —\nGoldberg: We shouldn't stereotype it —\nMcCain: I'm fine, happy [to point fingers at China]. China suppressed information.", "[CROSSTALK]", "McCain: And by the way, we as Americans have the luxury to — no but we have the luxury right now to be arguing about verbiage, versus people that are actually dying and on ventilators in other countries.\nSunny Hostin: But what about the Chinese-Americans that get targeted because people start calling it \"the Chinese virus\"?\nGoldberg: This is the point. Yes.", "McCain: First of all, first of all, first of all. Anyone who thinks — I tweeted about this days ago, because a woman I follow on Twitter named Jenny Han, her sister was the recipient...of some racial targeting. Obviously anyone that knows anything about me knows that I wouldn't be a proponent of that. But I do think, the idea that we're just going to let China off the hook — and what you were saying, Dan [Abrams], there is a lot of misinformation, they are using social media to target Americans, to try and spread misinformation about our military and about our media. And the idea that I'm just going to let China get away with it and get off the hook? There's a lot of anger about our reliance on the Chinese government right now, and our reliance on China in so many ways. And by the way, that messaging from President Trump, and his messaging from the very beginning, that we need to remove our trade from China, is going to be very effective going into 2020.", "The fact that McCain later emphasized that she did not support any \"racial targeting\" of Asian Americans does not cancel out the sense and effect of her other remarks or inoculate her from criticism. However, it was a relevant stipulation and one that the \"Last Week Tonight\" segment did leave out.", "McCain later made a rather telling remark when Goldberg brought up Trump's inflammatory rhetoric from the 2016 presidential campaign:", "Goldberg: I'm simply saying, the same way he [Trump] came in saying Mexicans and rapists are coming here to get Americans, it's the same stuff he's doing —\nMcCain: And do you know what that was? Effective [laughs] —\nGoldberg: It was effective but it was incons — it was not correct, is the point. And if any Asian person who is getting hit, as we've seen in the last few weeks, because someone thinks that they are walking around with it [COVID-19], you can't, as the person who's leading the country, you can't lead with that. You've got to be better.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]