["\"HUGE NEWS,\" Vice President Mike Pence tweeted on November 9, 2020. \"Thanks to the public-private partnership forged by President @realDonaldTrump, @pfizer announced its Coronavirus Vaccine trial is EFFECTIVE, preventing infection in 90% of its volunteers.\"", "The post followed an announcement that a vaccine jointly developed by US firm Pfizer and German company BioNTech was 90 percent effective at preventing Covid-19 infections in ongoing Phase 3 trials.", "Other posts quickly sought to distance the breakthrough from the administration of President Donald Trump, falsely claiming that Pfizer is not part of Operation Warp Speed. The US government partnership with pharmaceutical companies to develop and distribute a Covid-19 vaccine is a signature initiative of Trump’s heavily-criticized response to the pandemic.", "“In reality, Pfizer was not part of Operation Warp Speed,” reads a November 9 tweet by John Fugelsang, a political commentator and actor with more than 450,000 followers.", "While Operation Warp Speed provided research and development money to several pharmaceutical firms, including Johnson & Johnson, Moderna, and AstraZeneca, Pfizer accepted government funds to supply and distribute their shot, not develop it.", "“Pfizer is collaborating with BioNTech, a German biotechnology company, to develop COVID-19 investigational vaccines without US government financial support,” the Department of Health and Human Services said in a July 22 statement.", "The Department at that time announced an agreement with Pfizer “for large-scale production and nationwide delivery” of a Covid-19 vaccine in the US following “successful manufacture and approval,” as part of the Warp Speed goal of quickly getting a safe vaccine to the American public.", "Pfizer and BioNTech agreed to supply up to 600 million doses of their vaccine as part of the program.", "Social media users speculated about Pfizer's involvement in the program here and here.", "“Trump has nothing to do with the success of this vaccine which was not a part of his program. Indeed, he continuously undermined and humiliated the scientific community,” one user said.", "The confusion over the company’s participation in Warp Speed likely stemmed from Pfizer senior vice president Kathrin Jansen’s misleading statement quoted in The New York Times: “We were never part of the Warp Speed,” she said. “We have never taken any money from the US government, or from anyone.”", "Another spokesperson later clarified, as did the Times, that the company is involved in Operation Warp Speed “as a supplier of a potential coronavirus vaccine.”", "Coronavirus cases are surging across the United States and Europe, with governments forced to take more drastic action despite economic crises.", "The pandemic and vaccines were major issues in the November 3 presidential election. Trump has clashed repeatedly with his own government experts, often refusing to back restrictions or even wear a mask in public. After the announcement about the effectiveness of Pfizer’s vaccine Trump claimed -- without evidence -- that the news was delayed until after the election to damage him.", "\"They are part\" of Operation Warp Speed, Trump said during a November 13 briefing. \"It was an unfortunate mistake that they made when they said\" that they weren’t.", "As the pandemic spread, Pfizer in mid-March formed the partnership with BioNTech to develop a vaccine based on new genetic technology. The first tests began quickly in April.", "With the product selected -- a two-dose vaccine given over the course of three weeks -- a large clinical trial began in July involving more than 40,000 participants.", "If trials continue successfully, Pfizer plans to request authorization from the US Food and Drug Administration by the end of November, 2020.", "It plans to produce 50 million doses by the end of the year and 1.3 billion in 2021.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]