["About this rating", "If a president is impeached, convicted, and removed from office, they lose many of the benefits awarded to former presidents, such as a pension and travel allowance. A president who is removed from office via impeachment may also be barred from holding future office.", "If a president is impeached, but not convicted and removed, they maintain the benefits outlined in the Former Presidents Act. Furthermore, being barred from holding future office is not an automatic consequence of impeachment.", "It's unclear if a president who is impeached, convicted and removed from office would lose Secret Service protection.", "In the days following the pro-Trump riot at the U.S. Capitol on Jan 6. 2021, several lawmakers started calling for U.S. President Donald Trump to be impeached for a second time, this time, according to one draft of the impeachment articles, for \"incitement of insurrection.\"", "As the momentum for impeachment built, some social media users argued that it wasn't worth impeaching Trump again as he would be leaving office in a few days regardless.", "But according to a viral message from Twitter user @BenCostiloe, the potential consequences of impeachment extended further than removal from office. This message, which was shared more than 150,000 times, claimed that impeaching Trump would also strip him of several post-presidency benefits, such as a lifetime pension, security detail, and the ability to run for office in the future:", "This message is generally accurate. However, it should be noted that a president is only stripped of these benefits if they are impeached and removed from office.", "As of this writing, Trump, who was impeached by the U.S. House of Representatives in December 2019, will still receive presidential benefits as he was not convicted by the Senate and removed from office. U.S. President Bill Clinton, for example, still receives the benefits bestowed on former presidents even though he, too, was impeached.", "The benefits a president receives after leaving office are outlined in the Former Presidents Act of 1958. That law states that former presidents shall receive a lifetime pension (of approximately $200,000 annually), travel-related expenses up to $1 million each fiscal year, and protection from the Secret Service. It also notes that these benefits shall not be awarded to presidents whose service was terminated by removal \"pursuant to section 4 of article II of the Constitution of the United States of America.\"", "Article II of Section 4 of the Constitution, reads: \"The President, Vice President and all civil Officers of the United States, shall be removed from Office on Impeachment for, and Conviction of, Treason, Bribery, or other high Crimes and Misdemeanors.\"", "Mother Jones reported:", "The 1958 Former Presidents Act assures that no president leaves office without being set for life—it guarantees a pension, access to health insurance, office space and staff. There is, however, one exception: These perks are only granted to presidents who aren’t removed from office in an impeachment trial.", "There is some debate as to whether an impeached, convicted, and removed president would also lose protection from the Secret Service. The Former Presidents Protection Act of 2012 authorizes \"the Secret Service to protect former Presidents and their spouses for their lifetimes.\" This act does not state any exceptions for an impeached and removed president. As this is ahistorical territory, it's unclear how the term \"former president\" would be interpreted in this instance. We reached out to various historians for comment and will update this article accordingly.", "The final item listed in the viral tweet — \"loses his ability to run in 2024\" — is a possibility, but not a foregone conclusion in the case of an impeachment conviction in the Senate. The U.S. Constitution states that a president \"shall be removed from office” if impeached and convicted. However, it is up to the Senate's judgment as to whether a removed president should be barred from holding future office.", "Here's an excerpt from the U.S. Senate website (emphasis ours):", "In impeachment proceedings, the House of Representatives charges an official of the federal government by approving, by majority vote, articles of impeachment. A committee of representatives, called “managers,” acts as prosecutors before the Senate. The Senate sits as a High Court of Impeachment in which senators consider evidence, hear witnesses, and vote to acquit or convict the impeached official. In the case of presidential impeachment trials, the chief justice of the United States presides. The Constitution requires a two-thirds vote of the Senate to convict, and the penalty for an impeached official upon conviction is removal from office. In some cases, the Senate has also disqualified such officials from holding public offices in the future. There is no appeal. Since 1789, about half of Senate impeachment trials have resulted in conviction and removal from office.", "In short, if Trump is impeached and removed from office, he would lose many of the benefits awarded to former presidents.", "Updated [13 January 2021]: Article update to note that there is some debate as to whether an impeached, convicted, and removed president would also lose secret service protection.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]