["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "• A single member of the Italian Parliament suggested Bill Gates should be arrested.", "• There is no evidence that calls to arrest Bill Gates are endorsed or supported by the entire Italian Parliament.", "Philanthropist Bill Gates has been making headlines for months due to his foundation’s efforts to create a coronavirus vaccine, but not all the claims you see online can be trusted.", "A recent blog post from an organization called Live News 24 suggests the entire Italian government is at odds with Gates. The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "\"Italian Parliament calls for the arrest of Bill Gates,\" reads the headline.", "The headline’s claim is a misleading exaggeration, and this becomes clear when readers continue past the headline and into the article.", "A single member of the Italian Parliament, Sara Cunial, made a speech in which she called for Gates’ arrest. But there is no evidence that Cunial’s speech was supported by the entire Italian Parliament.", "This claim has been debunked by other fact-checking organizations, including Snopes, Republic World and Polygraph.info.", "In her speech, which was recorded and posted online with an English translation, Cunial criticized mass media and made wildly inaccurate claims about Gates, including that he used vaccines to sterilize millions of women in Africa and said that only a genocide could save the world.", "Cunial was once part of Italy’s Five Star Movement, a political party that has opposed vaccines and once advocated for Italy’s withdrawal from the eurozone and NATO. Some experts have linked the Five Star Movement’s opposition to vaccines to a measles outbreak in Italy. Cunial was expelled from the party in 2019.", "\"‘Dear President Conte,\" Cunial said in her speech, \"next time you receive a phone call from the ‘philanthropist’ Bill Gates, forward it directly to the International Criminal Court for crimes against humanity.\"", "Cunial’s speech was interrupted by vocal objections from other members of parliament who appeared to disagree with her viewpoint. This further suggests that Cunial’s calls for the Gates to be charged with crimes against humanity are not widely supported by the Italian government.", "We rate this claim False.", "Correction, May 26, 2020: This story was corrected to reflect that Cunial was expelled from the Five Star Movement party in 2019.", "Snopes.com, \"Is Italy Calling for Bill Gates’ Arrest?\" May 18, 2020", "Republicworld.com, \"Fact Check: No, The Italian Government Did Not Seek Bill Gates' Arrest; Here's The Truth,\" May 19, 2020", "Polygraph.info, \"Boosted by Russia, A Viral Video Falsely Claims Italy Wants Bill Gates Arrested,\" May 19, 2020", "USA Today, \"Fact check: A Bill Gates-backed pandemic simulation in October did not predict COVID-19,\" March 26, 2020", "The Week, \"Italian elections: what is the Five Star Movement?\" March 5, 2018", "Politico, \"The end of Italy’s 5Star Movement,\" Jan. 22, 2020", "New York Times, \"Populism, Politics and Measles,\" May 2, 2017", "Youtube, \"Arrest Bill Gates, you're killing people with his vaccine.Italian politician Sara Cunial,\" May 17, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]