["In this file photo taken Jan. 12, 2016, gun regulation activists stand with signs in the Washington state Capitol rotunda. State voters passed an initiative to create extreme risk protection orders. (AP)", "Seattle police seizing a man’s gun under the state’s \"red flag\" law has led to numerous false reports on right-wing websites that police arbitrarily took away a man’s Second Amendment rights.", "\"Seattle police begin gun confiscations: no laws broken, no warrant, no charges,\" stated a March 7 headline on Liberty Headlines.", "The story was attributed to Zero Hedge, which used a story from the website SHTFplan that claimed that Seattle police used \"Nazi style gun confiscation.\" The same or similar stories have appeared on many right-leaning websites.", "The Liberty Headlines story said that police seized the man’s gun after neighbors had complained the man had been \"staring\" at people through storefront windows while wearing a holstered firearm. Other residents complained that the man’s open carrying made them feel \"uncomfortable\" and \"unsafe.\"", "The story declared \"tyranny has officially taken hold on American soil\" and that \"a citizen’s Second Amendment rights have been ripped away from him by the government.\"", "Sounds alarming. But it’s not accurate.", "Facebook users flagged the post as being potentially fabricated, as part of the social network’s efforts to combat online hoaxes. We found that the headline was wrong and that the story failed to explain that police obtained a warrant from a judge after the 31-year-old man failed to turn over his gun and appear at a hearing, as ordered by the court.", "In 2016, Washington state voters overwhelmingly approved Initiative 1491 to allow courts, upon petition by police or a family or household member, to issue an extreme risk protection order. The order prevents an individual from accessing firearms for a specified time period if the court determines the person poses a significant danger.", "A handful of other states, including California, have similar \"red flag\" laws, and many other states are considering passing them. Following the Parkland shooting, Florida passed such a law to allow law enforcement to seek a risk protection order.", "While the NRA argues the laws violate a person’s rights by taking away a gun when no crime has been committed, law enforcement argues it is a tool they can use to take away a gun before a catastrophe occurs.", "PolitiFact interviewed Sgt. Eric Pisconski, who heads up the unit that oversees extreme risk protection orders, as well as Seattle police spokesman Det. Patrick Michaud.", "Police did not released the suspect’s name. PolitiFact submitted records requests to the King County prosecutor and obtained the criminal complaint that explains the charge against Alexander Sinclair McKenzie, an Army veteran with post traumatic stress disorder.", "Police said they had received multiple calls about McKenzie’s escalating behavior in the past year.", "McKenzie voluntarily surrendered a gun in 2017 after he was served with an anti-harassment order, even though he wasn’t required to do so. He acknowledged he was experiencing \"stress\" and did not want the gun around, Michaud said.", "Months later, McKenzie, who lives above a restaurant, had several interactions with the restaurant staff. In one instance, he stood in front of the restaurant and yelled obscenities and accused people of talking to him through the floor.", "\"No crimes were committed at that time, but his behavior was erratic and unnerving to all; resulting in contact\" by police, Michaud said.", "McKenzie declined services, but shortly thereafter he called police again to report \"taunting and voices\" coming from the restaurant below through the floor.", "He also told police that he was armed with a gun and wanted a female employee \"arrested or shot\" by police, Michaud said.", "McKenzie was ultimately taken to a medical facility.", "On Feb. 13, police petitioned the court to get an extreme risk protection order to take away McKenzie’s gun. A King County Superior Court Judge approved the order and police served it to McKenzie in person at a medical facility.", "He agreed to call police when he was discharged to hand over the firearm. After he left the medical facility on Feb. 23, police attempted to contact McKenzie multiple times to obtain his firearm.", "After McKenzie didn’t show up for his Feb. 27 court date about the order to turn over his gun, the judge granted a search warrant based on probable cause to arrest. McKenzie was charged with unlawful possession of a firearm by a person prohibited by extreme risk protection order, a gross misdemeanor.", "On March 1, police went to McKenzie’s apartment and took his gun. He was placed into custody and booked at the King County jail. The case remains pending.", "Pisconski said that since the law went into effect in 2017, Seattle police have received 16 extreme risk protection orders that resulted in collecting about 26 guns. This was the only case in which the suspect didn’t voluntarily surrender a gun.", "One of the websites that wrote that police took the gun without a \"warrant\" added an editor’s note about errors in its original article. The SHFTplan website, which has the tagline \"when it hits the fan, don’t say we didn’t warn you,\" updated the article to state that law enforcement did have a warrant.", "Liberty Headlines said, \"Seattle police begin gun confiscations: no laws broken, no warrant, no charges.\"", "The headline and the story make it appear that Seattle police arbitrarily took away a man’s gun, and that’s not the case.", "Interviews with police officials showed that after police received numerous reports about a man’s troubling behavior, so they sought an extreme risk protection order from the court to remove the man’s gun. Police tracked down the man to inform him about the order.", "When the man failed to appear in court as ordered and didn’t turn over his gun, the judge signed off on the order that allowed police to arrest McKenzie.", "We rate this claim False.", "'", "Liberty Headlines, \"Seattle Police Begin Gun Confiscations: No Laws Broken, No Warrant, No Charges,\" March 7, 2018", "Zero Hedge, \"Seattle Police Begin Gun Confiscations: No Laws Broken, No Warrant, No Charges,\" March 7, 2018", "SHTFplan, \"UPDATED: Seattle Police Begin NAZI STYLE Gun Confiscation: No Laws Broken, No Warrant, No Charges,\" March 6, 2018", "Conservative Daily Post, \"Seattle Police Confiscate First Firearm Under New \"Mental Health\" Law,\" March 5, 2018", "Seattle Police Department news release, \"Seattle PD Crisis Response Squad Serves Extreme Risk Protection Order Warrant, Seizes Handgun,\" March 2, 2018", "King County District Court, Criminal complaint, March 1, 2018", "King County District Court, Extreme Risk Protection Order, Feb. 27, 2018", "Washington Secretary of State, Election results for I-1491, Nov. 8, 2016", "Washington state House of Representatives Office of Research, Summary of Initiative 1491, Aug. 1, 2016", "Florida Senate, CS/SB 7026: Public Safety, March 9, 2018", "NRA, \"Minnesota: Egregious Anti-Gun Bills Introduced,\" March 4, 2015", "New York Times, \"States Mull ‘Red Flag’ Gun Seizures from People Deemed Dangerous,\" Feb. 23, 2018", "AP, \"I-1491 would allow temporary suspension of firearms access,\" (Accessed in Nexis) Oct. 11, 2016", "Seattle Times, \"Handgun seized in Belltown under extreme risk protection order,\" March 3, 2018", "Kiro Radio, \"How Seattle is using ERPO laws to remove guns from at-risk people,\" March 6, 2018", "KOMO News, \"Seattle police first in state to seize gun under mental health law,\" March 3, 2018", "Snopes, \"Did Seattle Police Confiscate a Man's Guns Without a Warrant?\" March 7, 2018", "Interview, Seattle Det. Patrick Michaud, March 2018", "Interview, Seattle Sgt. Eric Pisconski, March 13, 2018", "Interview, Kristie Johnson, King County Prosecutor public records officer, March 14, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]