["Florida Sen. Marco Rubio charged Republican presidential frontrunner Donald Trump with hypocrisy for hiring undocumented immigrants for his real estate projects instead of American citizens.", "\"He hired from Poland, and he had to pay a million dollars or so in a judgment,\" Rubio said. \"That’s a fact. People can look it up. I’m sure people are Googling it right now, ‘Trump Polish workers.’ You’ll see $1 million for hiring illegal workers on one of his projects. He did.\"", "\"Wrong, wrong,\" Trump said.", "We did some Googling and also reached out to the Rubio campaign, which referred us to media reports about a protracted class-action lawsuit involving his hiring of Polish aliens 36 years ago.", "Rubio is right about the Polish workers, but it’s unclear how much Trump ended up paying. (The Trump campaign did not get back to us.) Here’s the story.", "Sometime between 1979 and 1980, Trump hired a contractor to demolish an old building in midtown Manhattan to make way for Trump Tower. The contractor signed on workers from a local union and, to meet Trump’s tight deadline, also brought on 200 undocumented laborers from Poland dubbed the \"Polish Brigade.\"", "The Polish employees were off-the-books, working 12-hour shifts seven days a week for $4 to $5 an hour, with no overtime. Some workers were never paid what they were owed.", "In 1983, union members sued a union boss, Trump and his contractor for cheating the union out of pension and welfare funds by hiring the Polish Brigade. Trump owed the union pension fund $1 million, the plaintiffs said.", "Appearing in court in 1990, Trump blamed the violations on the contractor and denied knowing that the Polish workers were undocumented.", "\"Nobody’s proven to me that they were were illegal,\" Trump said, according to a Newsday report from the time.", "Nonetheless, Manhattan Judge Charles Stewart ruled against Trump a year later, saying that his representative \"knew that the Polish workers were doing demolition work\" and that his company participated in a \"conspiracy\" to cheat the union.", "Trump owed the workers a little more than $325,000 plus interest and attorney’s fees and costs, Stewart ruled.", "That wasn’t the end of it. Trump appealed and it would drag on for another decade.", "In 1998, several members of the Polish Brigade told the New York Times about their horrid working conditions. But Trump repeated that he didn’t know about the legal status of the Polish Brigade and said he would not settle the case out of court \"on principle,\" according to the New York Times.", "If the case was retried and Trump lost again, he would have had to pay about $4 million, the Times calculated.", "A year later, Trump quietly settled, according to the New York Daily News, but the agreement was placed under seal.", "\"It has been resolved on terms agreeable to both sides,\" labor lawyer Wendy Sloan, who represented the union members, told the New York Daily News.", "Our ruling", "Rubio said Trump \"hired from Poland and he had to pay a million dollars or so in a judgment.\"", "It was Trump’s contractor, not Trump himself, who hired 200 undocumented Polish workers to demolish a building to make room for Trump Tower in Manhattan. Trump said he didn’t know. The lawsuit sought $1 million in damages, and a judge ruled that Trump had to pay $325,000 plus interest.", "But the case was appealed and before it was retried, Trump settled the case out of court, so it’s unclear how much he ended up doling out.", "Rubio’s statement is partially accurate but missing that context. We rate Rubio’s claim Half True.", "<div class='artembed'>", "Email interview with Alex Burgos, spokesperson for Marco Rubio, Feb. 25, 2016", "Justia, Diduck vs. Kaszycki & Sons Contractors, Inc., April 24, 1991", "Justia, Hardy vs. Kaszycki & Sons Contractors, Inc., Oct. 19, 1994", "New York Times, \"Trump Says He Didn't Know He Employed Illegal Aliens,\" July 13, 1990", "Daily Beast, \"Trump Tower Was Built on Undocumented Immigrants’ Backs,\" July 8, 2015", "New York Times, \"Judge Says Trump Tower Builders Cheated Union on Pension Funds,\" April 27, 1991", "New York Times, \"After 15 Years in Court, Workers' Lawsuit Against Trump Faces Yet Another Delay,\" June 14, 1998", "New York Daily News, \"DEAL SEALED IN TRUMP TOWER SUIT,\" March 8, 1999", "Nexis search", "Newsday, \"Trump takes stand in $1 million pension trial,\" July 13, 1990", "Newsday, \"Trump liable in labor scam,\" April 27, 1991", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]