["“They’re stealing it right in front of our eyes!!!” wrote one Instagram user in a November 5 post that included a screenshot of a FOX 2 news segment summarizing the lawsuit against the city of Detroit.", "The lawsuit, which the screenshot shows was filed by the conservative-leaning Public Interest Legal Foundation, blamed the city’s poor voter registration upkeep for 4,788 duplicate registrations, 32,519 more registered voters than eligible voters, and 2,503 deceased registered voters, including one voter born in 1823.", "The screenshot was shared on Facebook and Twitter in English, and  in French, Spanish and Portuguese.", "It spread as the last votes of the 2020 US presidential election were counted, leading social media users to claim fraud took place in Michigan, which Democrat Joe Biden won after the state had switched to the Republican column in the 2016 presidential election.", "However, the screenshot shows a December 2019 broadcast on TV channel FOX 2,  and the numbers have no relation to the 2020 general election.", "The Public Interest Legal Foundation is a “public interest law firm dedicated entirely to election integrity,” and to “fight against lawlessness in American elections,” the organization's “About” page says.", "The foundation’s web page features a June 30, 2020 press release announcing the end of a lawsuit against the City of Detroit, “because the Defendants in Detroit and the Michigan Secretary of State acted on data provided to them by the Public Interest Legal Foundation.”", "City of Detroit clerk Janice Winfrey said on July 1, 2020 that the voter roll update was regular maintenance, but that her office paid specific attention to issues raised in the lawsuit, The Detroit News reported at the time.", "“We did some extra digging because that is ridiculous and we wanted to see what is going on there,” Winfrey said of the case of the voter born in 1823. “The conclusion was that that was a typographical error.”", "The initial complaint was filed on December 10, 2019, after the foundation allegedly discovered anomalies in the city’s voter registration rolls.", "In order to stem the flow of concerns around vote counting in Detroit in 2020, FOX 2 published an article on November 5 to confirm that the information came from a 2019 segment.", "False claims of voter fraud are circulating across the US, spurred by Donald Trump, his campaign and supporters, who have repeatedly made unfounded allegations of irregularities.", "Officials faced a deluge of absentee and mail-in ballots spurred by the Covid-19 pandemic, causing delays in counting. Trump has repeatedly and falsely claimed mail-in voting leads to widespread fraud.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]