["About this rating", "Of the 153 mass shooting cases recorded by one data source, none had ended in the conviction of a black man, woman, or undocumented immigrant by July 2018.", "None of the 153 cases recorded by that data source had yet ended in the conviction of anyone, two-thirds of the cases in which a suspect was identified involved black men, and when the definition of a mass shooting was slightly expanded, the list of incidents included five in which investigators were in no doubt that a woman was responsible.", "The identities and demographic profiles of most perpetrators of mass shootings occurring between January and June 2018 are not readily available.", "In the first half of 2018, gun violence re-emerged as a major political social issue in the United States amidst a series of high-profile mass shootings, including the 14 February massacre at Marjory Stoneman Douglas High School in Parkland, Florida, that left seventeen students and staff dead (and a like number wounded).", "In the wake of a 28 June shooting spree at the offices of the Capital Gazette newspaper in Annapolis, Maryland, public attention once again turned to some of the statistics involved in mass shootings and gun violence in the United States.", "On 2 July, the hyperpartisan left-wing Occupy Democrats Facebook page posted a widely-shared meme that made some striking factual claims about the race and gender dimensions of mass shootings, claiming that of the \"154 mass shootings this year ... not one [was] committed by a black man or an illegal alien ... [or] by a woman, either\":", "The meme didn't cite any specific sources, but the number of shootings it cited (154) strongly indicated that it was based on data collected by the Gun Violence Archive, a Washington D.C.-based non-profit that tracks and records gun violence. In the aftermath of the Capital Gazette shooting, reports by NBC and Business Insider stated that that incident marked the 154th mass shooting of the year so far, and latter attributed that figure to the Gun Violence Archive.", "Categorizing and measuring gun violence -- especially mass shootings -- is therefore notoriously difficult due to varying definitions and incomplete data collection.", "Varying definitions of a mass shooting", "No uniformly accepted definition of \"mass shooting\" exists. Historically, the Federal Bureau of Investigation (FBI) defined what they call \"active shooter incidents\" as those that result in four or more people (not including the attacker) being shot dead in public through actions not related to terrorism, gang activity, or the commission of other crimes (such as robbery). Since 2013, the FBI has dropped that numerical threshold to incidents involving the deaths of three or more people.", "Everytown for Gun Control, a pro-gun control non-profit that collects data on shootings, also defines a mass shooting as one in which at least four people are killed (not including the shooter) but includes shootings taking place in private homes, a circumstance the FBI omits from their methodology.", "Mother Jones magazine, in their mass shootings database, defines such shootings as \"indiscriminate rampages in public places resulting in four or more victims killed by the attacker.\"", "Stanford University's now-defunct Mass Shootings in America project defined a mass shooting as one in which three or more people were shot (but not necessarily killed), excluding the attacker. Stanford's definition excluded gang-, drug-, or organized crime-related shootings.", "The Mass Shooting Tracker, a crowd-sourced project, defines a mass shooting as an incident in which four or more people are shot, including the attacker.", "Of the major sources of data about mass shootings, the Gun Violence Archive has a relatively inclusive definition: \"If four or more people are shot or killed in a single incident, not [including] the shooter, that incident is categorized as a mass shooting based purely on that numerical threshold.\" This includes shootings in private places, incidents involving gang activity and armed robbery, shootouts, and non-fatal shootings.", "These widely varying definitions explain why the Gun Violence Archive charted the number of mass shootings between 1 January and 28 June 2018 at above 150, while Mother Jones, for example, put it at a mere six.", "We're going to evaluate the Occupy Democrats meme first on its own terms -- that is, using the apparent source of the claim, the Gun Violence Archive -- and then examine it against some of the other major sources of data we have mentioned above.", "The meme makes four claims: that 154 mass shootings took place between 1 January and 28 June 2018; that black men didn't perpetrate any of them; that \"illegal aliens\" (undocumented immigrants) didn't perpetrate any of them; and that women didn't perpetrate any of them. (A spreadsheet containing our analysis can be downloaded here.)", "Gun Violence Archive", "We downloaded the Gun Violence Archive's mass shootings database after the 28 June attack at the Capital Gazette newspaper in Annapolis, Maryland, and thoroughly analyzed each incident, using news reports, police statements, and court and prison records to attempt to verify the race, gender, and immigration status of suspected perpetrators in every case. This is what we found.", "The Gun Violence Archive defines a mass shooting as an occurrence in which four or more people (not including the attacker) are shot in a single incident, and they charted 153 such shootings occurring between 1 January and 28 June 2018. Using their definition and data, we find that:", "No cases of mass shootings taking place in 2018 through 28 June had yet resulted in any convictions as of 9 July 2018, so definitive identifications of mass shooting perpetrators (along with their race, gender, or immigration status) cannot yet be made. However, it is quite likely that at least some of the suspects so far charged with involvement in mass shootings will eventually be convicted, so it is also quite likely that at least some of the crimes defined by the Gun Violence Archive as mass shootings will prove to have been perpetrated by black men, contrary to the meme's claim.", "In fact, the trend is highly likely to be the opposite of that presented by Occupy Democrats, at least as far as the Gun Violence Archive data is concerned. Of the 59 named individuals suspected of involvement in mass shootings, two-thirds (40) were black men. Furthermore, many of the cases in which a suspect hadn't yet been identified or charged involved gang-related shootings taking place in predominantly black communities, with exclusively black victims.", "Violent crime, including gun crime, is highly racially linked in the United States. According to Department of Justice research, an estimated 83 percent of violent gun crimes involving black victims between 2012 and 2015 were perpetrated by black assailants. So it would be statistically unlikely that many of the remaining 102 mass shootings involving black victims did not also involve black perpetrators.", "Although we did not find any evidence that an undocumented immigrant was involved in any mass shooting, it is important to note that police statements, arrest warrants, criminal complaints, and prison records do not routinely specify a suspect's immigration status in the same way that they routinely specify the gender, race/ethnicity, and physical characteristics of a suspect.", "We checked multiple news releases published by the Immigration and Customs Enforcement agency (ICE) but did not find any instances in which an undocumented immigrant was suspected of or charged with involvement in an attack that would match the Gun Violence Archive's definition of a mass shooting.", "In one case, an undocumented immigrant named Arnoldo Pompa-Rascon was charged in relation to a series of three non-fatal shootings on the same day in Kansas City, Missouri. However, that case would not qualify as a mass shooting under the Gun Violence Archive's definition because it involved fewer than four victims, and the shootings did not take place in \"one incident.\"", "Similarly, the high-profile shooting at YouTube's San Bruno, California, campus in April 2018 was perpetrated by a woman, Nasim Najafi Aghdam, but because she shot three people (i.e., fewer than four) before taking her own life, this incident was not counted by the Gun Violence Archive.", "Mother Jones", "This source defines mass shootings as \"indiscriminate rampages in public places resulting in four or more victims killed by the attacker,\" and using their definition and data we find:", "Mass Shooting Tracker", "This source defines mass shootings as incidents in which four or more people -- potentially including the attacker -- are shot (but not necessarily killed) in a single spree, and using their definition and data we find:", "The major difference in definitions between the Gun Violence Archive and the Mass Shooting Tracker is clearly (and tragically) borne out in the widely differing lists of incidents. Both sources have a numerical threshold of four victims, but only the Mass Shooting Tracker includes shooters themselves as victims, resulting in many entries in that source's database which don't appear in others.", "This trend was particularly prevalent among white suspects. Of the 30 white shooting suspects (male and female), more than half (16) took their own lives. All but one of those 16 suicides came after a suspect first killed at least one family member.", "We found no evidence of an undocumented immigrant's having been directly involved in any of the incidents recorded by the Mass Shooting Tracker, but it should be again noted again that a suspect's immigration status is not routinely published in police statements, jail records, or court documents.", "Conclusion", "How a mass shooting is defined has a significant bearing on the statistics we often see on television and read about in the news. Too often, those nuanced distinctions and varying methodologies are not made clear.", "The Occupy Democrats meme, like much social media commentary on gun violence, does not serve the public well in presenting a full and accurate picture of the facts. The source it relied upon for the figure of 154 mass shootings, the Gun Violence Archive, includes 102 incidents in which the demographic profiles of the suspects are uncertain, so in most cases we can't glean anything definitive about the race, gender or immigration status of mass shooting perpetrators. Nonetheless, in those cases where suspects were identified, two-thirds of them were black men, a fact that significantly undermines the credibility of the meme.", "When we widen the definition to include shooters themselves as victims (as the Mass Shooting Tracker does), we observe a pattern of murder-suicides and family annihilations not represented in other sources — one which includes five female suspects (and little doubt among investigators about their culpability). And once again, black men represented a majority (58) of the 97 named suspects in the cases listed by the Mass Shooting Tracker. These two facts also significantly undermine the credibility of the Occupy Democrats meme.", "When we consulted the Mother Jones database, a source that strips away non-fatal, non-public, and gang-related mass shootings, we are left with only six incidents between 1 January and 28 June 2018. In five of those, the suspect was a white man, and in the remaining case the suspect was an Asian-American man. The absence of black, immigrant and female perpetrators from this list speaks in favor of the meme, but the total number of incidents (six) means it has little relevance to the 154 mass shootings mentioned by Occupy Democrats.", "WBTV.   \"Man Pleads Guilty in Deadly York County Officer-Involved Shooting.\"\r\n    22 May 2018.", "Robinson, Melia et al.   \"There Have Been 154 Mass Shootings in the US So Far in 2018 -- Here's the Full List.\"\r\n    Business Insider.   28 June 2018.", "Blair, J. Pete and Katherine W. Schweit.   \"A Study of Active Shooter Incidents in the United States Between 2000 and 2013.\"\r\n    Texas State University/F.B.I.   2014.", "Everytown for Gun Safety.   \"Mass Shootings in the United States: 2009-2016.\"\r\n    March 2017.", "Follman, Mark et al.   \"US Mass Shootings, 1982-2018: Data from Mother Jones' Investigation.\"\r\n    Mother Jones.   28 June 2018.", "Roskopp, Jack.   \"Deputies: 2 Arrested in Connection with Drive-By Shooting in Macclenny.\"\r\n    WJXT-TV..   26 March 2018.", "Morgan, Rachel E.   \"Special Report -- Race and Hispanic Origin of Victims and Offenders, 2012-2015.\"\r\n    Bureau of Justice Statistics, U.S. Department of Justice.   October 2017.", "Tribune Media Wire.   \"Undocumented Immigrant Charged in String of Kansas City Shootings Says 'Voices' Told Him Who to Shoot.\"\r\n    KFOR-TV.   17 May 2018.", "Winton, Richard et al.   \"Woman Suspected of Opening Fire at YouTube Had Battled Against Platform.\"\r\n    Los Angeles Times.   4 April 2018.", "Londberg, Max and Glenn E. Rice.   \"Man Who Killed a Clinton Officer Was 'Scared,' Haunted by Prison, Daughter Says.\"\r\n    The Kansas City Star.   8 March 2018.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]