["About this rating", "On 11 May 2017, TheFederalistPapers.org, a web site that often posts conservative click bait, reported on a new drug cocktail known as \"Gray Death\":", "The Indiana Department of Homeland Security is warning about the new drug called “Gray Death” that doesn’t just kill the drug users with even the slightest contact – but the first responders who come to help as well.", "It is a “particularly dangerous mixture of heroin, fentanyl, carfentanil and other synthetic opioids,” WDRB reports, that is usually used as a tranquilizer for elephants and other large mammals. It is “10,000 times more potent than morphine and 100 times more potent than fentanyl\" and poses a severe threat to first responders because it can be absorbed through the skin or accidentally inhaled through the air.", "The sensational sounding nature of the story prompted questions whether it is true, but the story is accurate (and largely cribbed from the reporting of local television station WDRB).", "We followed up with the Indiana Department of Homeland Security to confirm details of the report, and  spokesman John Erickson confirmed to us that \"very casual contact\" with the substance can potentially cause a serious adverse reaction. As far as inhalation, he compared it to closing a bag of flour: some powder will become airborne. But unlike flour, a similar accidental exposure to Gray Death can lead to serious health problems. Authorities are notifying first responders to take necessary precautions.", "Indiana DHS released a press statement that warns:", "Gray Death, a particularly dangerous mixture of heroin, fentanyl, carfentanil and other synthetic opioids, made its way to Indiana this week, causing an overdose in central Indiana. Partners warning about the increased risk are State of Indiana Emergency Medical Services and the State Fire Marshal, part of the Indiana Department of Homeland Security; Indiana State Department of Health and the Indiana State Police.", "A persistent increase in opioid overdoses tied to the synthetic drug carfentanil have been seen around the country, prompting concern. ...", "Carfentanil, which is used as a tranquilizing agent for elephants and other large mammals, is 10,000 times more potent than morphine and 100 times more potent than fentanyl. It is often mixed in with other drugs such as cocaine or crystal meth — and often drug users have no idea their drugs have been tainted.", "Carfentanil and other fentanyl-related compounds are a serious danger to public safety, first responder, medical, treatment, and laboratory personnel.  These substances can come in several forms, including powder, blotter paper, tablets, and spray. The substance can be absorbed through the skin or accidental inhalation of airborne powder.", "“With the pervasive nature of opioids and addiction, there is always the chance that family or friends may come into contact with dangerous substances when working to save their loved one,” said Dr. Michael Olinger, State Emergency Medical Services Medical Director.", "The release included an image demonstrating how deadly carfentanil is compared to other dangerous substances. It shows how much heroin can kill an average adult versus fentanyl and carfentanil:", "Credit: Paige Sutherland/NHPR", "In February 2016, a 24-year-old Georgia woman died after overdosing on the drug mixture:", "A Brookhaven woman died from a mixture of heroin and fentanyl known as ‘gray death,’ GBI officials said.", "Lauren Camp, 24, had ingested the mix before she was found submerged in a bathtub in February, GBI spokeswoman Nelly Miles said. GBI officials found the deadly drugs at the scene. Camp’s “gray death” is the first confirmed in Georgia.", "The drug has been spreading from state to state and apparently can vary in its constitution. But what sets it apart is its gray color — and its deadliness:", "Over the past four months, Georgia police have seized about 50 batches of grey death statewide, with metro Atlanta being a major hotspot. The drug has also started popping up in Alabama, Ohio and Pennsylvania, state and local officials confirmed.", "Because ingredients change from sample to sample, each batch of grey death is a mystery — right down to its signature color.", "\"To this date, I have no idea what makes it gray,\" said Deneen Kilcrease, a forensic chemist with the Georgia Bureau of Investigation's crime lab. \"Nothing in and of itself should be that color.\"", "Gehl, Robert. \"New Drug ‘Gray Death’ Can Be Transmitted Through The AIR.\"\r\n  FederalistPapers.com. 11 May 2017.", "WDRB. \"WARNING: Authorities Say 'Gray Death' Made Its Way to Indiana Earlier This Week.\"\r\n  11 May 2017.", "Habersham, Raisa. \"‘Gray Death:’ Heroin, Fentanyl Mix Kills DeKalb Woman.\"\r\n  Atlanta Journal-Constitution. 16 May 2017.", "Nedelman, Michael. \"'Grey Death': The Powerful Street Drug That's Puzzling Authorities.\"\r\n  CNN. 13 May 2017.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]