["About this rating", "On 9 March 2018, a woman claiming to be a social worker at Roanoke, Virginia, social services department, tweeted that she had been fired from solely because she had a concealed carry permit. The woman, whose name is Storm Durham, also said that she would sue the city \"for every penny\":", "I was fired today. From Roanoke City Social Services, serving as a damn good social worker. I was fired for having a concealed carry permit. Not the gun, the permit. I was escorted by 3 city police officers bc I am a \"safety risk to the building\"", "— Storm Durham (@chelstorrm) March 10, 2018", "Oh suing for every penny", "— Storm Durham (@chelstorrm) March 10, 2018", "Hours later, a meme appeared on the Facebook page \"Chuck Callesto\":", "Durham also shared her claim in a post on Facebook, as well as live videos in which she said she wanted to be a spokeswoman for the National Rifle Association. The claim, predictably, went viral, with people from across the United States posting angry comments on unrelated City of Roanoke Facebook posts.", "Someone claiming to have knowledge of the incident also commented, claiming that Durham's boyfriend had threatened a coworker. The comment was later deleted:", "Although we were unable to substantiate those claims, the City of Roanoke's Office of Communications sent us a statement refuting Durham's claim on 12 March 2018:", "A former employee of the City of Roanoke recently posted via social media assertions regarding the basis of her dismissal from City employment. Her posting has also been reported in other media. The City does not publicly comment on specific personnel matters. In light of these assertions, however, it is important to note that the City of Roanoke respects the Constitutional rights of its citizens and that the dismissal in question was not based upon anyone’s exercise of such rights.", "In addition, the office told us:", "The City has no policy or procedure limiting the right of its employees to hold concealed carry permits as authorized by the laws of the Commonwealth of Virginia.", "Durham herself told The Roanoke Times that her termination papers showed different reasons for her firing from the city, where she had worked for less than a year:", "Four months ago, she said, her trainer taught her a procedure that she followed, but then was reprimanded for it by her supervisor. So she alerted her trainer, who sent her a “nasty email” calling her “sloppy and unprofessional.”", "Durham said she took the matter to her supervisor, who, along with the trainer, “threw her under the bus.”", "Later, Durham said, she was given a set of performance expectations that required her to close cases at a faster pace. She acknowledged it took her time to adjust to the caseload in Roanoke after coming from rural Craig County, but said she exceeded all expectations.", "However, Durham said, she was told that it was actually because of her gun permit:", "The next day, at about 4:30 p.m. Friday, she was summoned to the office of the assistant director of the department, was told she was being fired and given the document listing the reasons. At the top, she said, was a concern about “workplace safety.”", "Durham said she asked about it and was told by the assistant director that her possession of a concealed weapons permit made her a safety risk in the building and for co-workers.", "Three Roanoke police officers escorted her to her desk, Durham said, where her personal possessions were loaded onto a cart and pushed to her car by one of the officers while the two others escorted her out of the building.", "We obtained a copy of the official police report in response to our request, which reads in part:", "Mr. Goss advised that she has a conceal carry permit and believed that she usually has a weapon in her vehicle.... We arrived at 1547 hours. The call was reported on the 3rd floor (Social Services Department). Upon arrival to the 3rd floor we were escorted to one of the offices in the back where we met with Mr. Goss and another employee advising us they wanted us there because they didn't know how Ms. Durham was going to react to the situation.", "On 13 March 2018, a copy of Storm Durham's termination letter was shared by WSLS.com. In it, \"performance concerns, attendance, dress code issues and unprofessional behavior\" were cited as the reasons for her dismissal:", "13 March 2018, 3:46 P.M.: Added excerpts from The Roanoake Times and the official police report.", "14 March 2018, 2:43 P.M.: Added letter of termination provided to Durham by the City of Roanoke Department of Social Services.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]