["The photos were published on Facebook here on February 12, 2021. The caption reads: “Shocking, Live pictures from Afghanistan.”", "The photos are misleadingly watermarked: “Daily Kashmir Official”.", "The post circulated online the same day a powerful earthquake struck the central Asian country of Tajikistan. The tremor was felt across the region, including in Afghanistan, as reported by Indian media outlets Times Now and Livemint.", "The photos were also shared alongside a similar claim on Facebook here and here; and on Instagram here and here.", "The claim is false.", "Reverse image searches on Google found both photos were published in Associated Press (AP) reports and show the aftermath of an earthquake in Turkey in January 2020.", "The first photo was published in an AP report here on January 25, 2020.", "The photo’s caption reads: “People look at a collapsed building after a 6.8 earthquake struck Elazig city centre in the eastern Turkey, Friday, Jan. 24, 2020. An earthquake with a preliminary magnitude of 6.8 rocked eastern Turkey on Friday, causing some buildings to collapse and killing at least four people, Turkish officials said.”", "The second image appears to be a screenshot taken from footage featured in this AP report published by the Canadian news website Global News on January 24, 2020. The image can be seen at the video’s one-minute 14-second mark.", "Below are two screenshot comparisons of photos shared in the misleading photos (L) and AP images published in January 2020 (R):", "AFP also reported on the earthquake and subsequent rescue efforts in eastern Turkey here on January 26, 2020.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]