["As the U.S. reaches an unfortunate landmark in coronavirus deaths — over 500,000 on Tuesday, a number unsurpassed by any other nation — one meme on social media is drawing attention to deaths following COVID-19 vaccination.", "\"What's your thoughts? Have you heard these stories?\" asks one Feb. 19 Instagram post depicting the \"I Guess I'll Die\" meme – an image of a man in a red turtleneck shrugging – surrounded by nine different headlines from various news outlets reporting post-vaccination deaths.", "Three of the headlines involve deaths in Portugal, Brazil and Norway; the other six involve two health workers in California, a Florida doctor, a Virginia woman in her 40s and New York man in his 70s.", "While not explicit in its messaging, the juxtaposition of the headlines around the central meme, often used to convey resignation to death, suggests the vaccine may be the culprit. Many of the post's comments echo the sentiment, likening the vaccine to the infamously unethical Tuskegee syphilis study on Black men, which falsely advertised treatment for \"bad blood,\" a term commonly used for a garden variety of ailments.", "\"If people get (the vaccine) they are insane: Tuskegee Experiment with a twist,\" wrote one commentator.", "\"Hard pass ... I urge you all to research the Tuskegee experiment if you haven't already,\" another wrote. \"We are guinea pigs. Don't play yourself.\"", "USA TODAY was unable to reach the Instagram user for further comment.", "More:Fact check: CDC is not inflating the COVID-19 death count", "One of the nine headlines is a Jan. 15 article published in the New York Post that details the deaths of 23 people in Norway — all over age 75 and 13 of whom were nursing home residents — within a week of vaccination with Pfizer-BioNTech's COVID-19 vaccine.", "On social media, news of these deaths quickly morphed into the claim that Pfizer's vaccine was singularly responsible. This allegation was further compounded by the death of 86-year-old former Atlanta Braves athlete Hank Aaron nearly three weeks after his first vaccine dose on Jan. 22.", "Aaron's death is not believed associated with the vaccine. Similarly, an ongoing investigation by the Norwegian Medicines Agency and the Norwegian Institute of Public Health has not found any evidence to suggest the deaths among the 23 severely frail and elderly people were associated with the vaccine.", "\"So far, there are no statistical analyses that indicate that coronavirus vaccination has had an increased risk of death among those vaccinated,\" said Dr. Sara Viksmoen Watle of the NIPH in a Jan. 18 statement.", "The World Health Organization also conducted its own review and did not find \"any unexpected or untoward increase in fatalities in frail, elderly individuals or unusual characteristics of adverse events following administration of BNT162b2 (Pfizer-BioNTech's COVID-19 vaccine).\"", "Fact check: Trump surgeon general initially dismissed mask-wearing, but then endorsed", "On Jan. 4, the British Daily Mail reported 41-year-old Portuguese health worker Sonia Acevedo had died on Jan. 1, \"two days after getting the Pfizer covid vaccine.\" The article was among many others suggesting a correlation between the timing of her death and the vaccine.", "In a Jan. 5 press release, the Portuguese Ministry of Justice stated preliminary autopsy findings did not indicate \"evidence of a causal relationship between (Acevedo's) death and the vaccine she received.\" No cause of death was provided, the ministry citing the \"secrecy of justice\" as the reason why. USA TODAY used Google Translate and other translation services to interpret Portuguese into English.", "Prior to Acevedo's death, a volunteer in the AstraZeneca COVID-19 vaccine trial in Brazil died, CNN reported in October. Because AstraZeneca had not discontinued or paused the trial, as it had done in the past due to an \"unexplained illness\" among one of its U.K. Phase III trial volunteers, it appeared the volunteer's demise was not vaccine related.", "\"All significant medical incidents, whether participants are in the control group or the Covid-19 vaccine group, are independently reviewed. Following careful assessment of this case in Brazil, there have been no concerns about safety of the clinical trial and the independent review in addition to the Brazilian regulator have recommended that the trial should continue,\" said the University of Oxford, AstraZeneca's collaborator, in an emailed statement to CNN.", "While no additional details on the death have been released because of \"medical confidentiality and clinical trial regulations,\" an AstraZeneca spokesperson told CNN, Bloomberg reported the volunteer who died was not among the vaccine arm, per an insider source.", "More:Fact check: Long-term face mask use will not cause lung cancer", "Three of the nine headlines in the Instagram post refer to deaths in Orange and Placer counties in California.", "Tim Zook, an X-ray technologist at South Coast Global Medical Center in Santa Ana, received his second coronavirus vaccine dose on Jan. 5, according to both local FOX and CBS News affiliates. He was hospitalized after experiencing abdominal pain and difficulty breathing hours later, subsequently placed in a medically induced coma on Jan. 7 and died on Jan. 9.", "Zook's death has been reported to the Vaccine Adverse Event Reporting System, a national monitoring system co-managed by the Centers for Disease Control and Prevention and the U.S. Food and Drug Administration.", "No cause of death has been identified; further investigation is underway.", "\"The Orange County Coroner has an open death investigation into Zook’s death and will be conducting additional tests within its autopsy protocol ... it will use those findings, along with autopsy findings, to make a final determination into the cause and manner of death which will not likely occur for 3-4 months,\" said the Orange County Coroner's office in an email to USA TODAY.", "If the death is ruled vaccine-related, the office stated it would immediately notify the Orange County Health Care Agency.", "In Placer County, an unnamed health worker died on Jan. 21 several hours after being vaccinated, NBC News Wisconsin affiliate reported.", "The 64-year-old male had tested positive for the novel coronavirus in late December; at the time of his death, health officials did not indicate whether this factored into his health or demise.", "The Placer County Sheriff-Coroner Division ruled out the vaccine as a cause of death in an updated statement released Jan. 30 on its Facebook page.", "\"Through our investigation, we have learned more details about the individual. We have learned that not only had he recently been diagnosed with COVID-19, he also had underlying health issues, and had been exhibiting symptoms of illness at the time the vaccine was administered. Clinical examination and lab results have determined the COVID-19 vaccine has been ruled out as a contributing factor in the individual's death.\"", "More:Fact check: Post distorts WHO's COVID-19 PCR testing guidelines", "Obstetrician and gynecologist Dr. Gregory Michael died from complications of immune thrombocytopenia, or ITP – poor blood clotting due to a lack of platelets – in early January.", "The 56-year-old received Pfizer's COVID-19 vaccine on Dec. 18 at Mount Sinai Medical Center in Miami Beach, where he practiced, and died 16 days later from a brain hemorrhage after multiple treatments for his ITP failed, The New York Times reported.", "Pfizer told the Times it was \"actively investigating\" the doctor's death \"but we don't believe at this time that there is any direct connection to the vaccine.\"", "Thirty-six other similar cases of ITP have been reported to VAERS, the Times reported in early February, but it is unknown whether these events are causally related to the vaccine.", "It is worth noting ITP was not observed in either Moderna or Pfizer's large clinical trials of combined over 70,000 participants.", "More:Fact check: Amish communities have been affected by COVID-19 pandemic", "Earlier in February, Drene Keyes of Gloucester, Virginia, and an unnamed New York City resident in his 70s were reported to have died shortly after vaccination.", "NBC news reported Keyes, 58, was vaccinated with the Pfizer COVID-19 vaccine on Feb. 5. She remained in the clinic for the recommended 15-minute observation period to monitor for any allergic reaction before being discharged. Keyes later returned with complaints of vomiting and trouble breathing, at which point she was rushed to Virginia Commonwealth University Health Tappahannock Hospital. She died the next day.", "According to Dr. M. Norman Oliver, Virginia state health commissioner, Keyes' death did not appear connected to any vaccine-related allergic reaction.", "\"Preliminary findings indicate that the cause of death was not anaphylaxis, but it will take several weeks for additional information to become available,\" he said in a statement on Feb. 5. \"We can confirm that the death occurred within hours of having received the vaccine, but that is not evidence of it being related. We are currently investigating and do not yet know the cause of death.\"", "The unnamed New York City man died on Feb. 7 after collapsing outside of Manhattan's Jacob K. Javits Convention Center, where he received his vaccine 25 minutes earlier, the New York Post reported.", "In a statement, New York state health commissioner Dr. Howard Zucker said the man \"exhibited no adverse reactions or any distress\" during the 15-minute observation period.", "No official cause of death has been concluded but a medical investigation is underway, reported local CBS News affiliate CBS 2.", "More:Fact check: Merck discontinues COVID-19 vaccine work over weak immune response", "While reports of deaths following COVID-19 vaccination may sound alarming, health care experts are reminding the public there is no conclusive association between the two.", "\"These vaccines have had incredible safety profiles in the trials and post-authorization. So far, there has been nothing to confirm these awful events,\" said Dr. John Brownstein, an epidemiologist at Boston Children's Hospital, to ABC News in February.", "\"These medical events occur every single day, including unexplained illnesses,\" said Dr. William Schaffner, professor of medicine in the Division of Infectious Diseases at Vanderbilt University Medical Center, also to ABC News. \"The question really is, do they occur at a greater rate in the vaccinated population than they do in the general population?\"", "So far according to a recent CDC report, nearly 90% of VAERS reports were \"nonserious events and involved local and systemic symptoms.\" The CDC estimated out of a million people, allergic reactions happened in roughly five, a number within range of what has been reported with other vaccines for the flu, meningitis and shingles.", "The data analyzed was collected between Dec. 14, 2020, and Jan. 13, a time period that saw 13.8 million doses of the Pfizer-BioNTech and Moderna vaccines administered.", "A total of 113 deaths were reported, including from death certificates and autopsy reports, but no causal link between coronavirus vaccination and death was found, according to the CDC.", "We rate this claim MISSING CONTEXT because without additional context it might be misleading. The deaths of various individuals across the U.S. and elsewhere following COVID-19 vaccination did occur, but the vaccine has not been identified as a cause of death. A recent CDC report found that of the 113 death reports to the Vaccine Adverse Event Reporting System between Dec. 14 and Jan. 13 — a time period which saw 13.8 million doses of the Pfizer-BioNTech and Moderna vaccines administered — no causal link between vaccination and death was found.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook."]