["A July 23, 2020 Facebook post refers to Epstein’s “pedo island” and says “there is another private island a short distance away in clear veiw (sic).” The post further claims Epstein’s former girlfriend Ghislaine Maxwell, who faces sex trafficking charges, owns a Virgin Islands-based submarine company.", "“Do you want to know who OWNS THIS PRIVATE ISLAND that is NEXT TO EPSTEIN’s and has MAXWELL’S SUB SITTING IN IT? JOE BIDEN,” it claims.", "The post has appeared elsewhere on Facebook, including here, as well as here on Instagram, while this post claims Maxwell’s submarine was “used to smuggle in kids to Epstein island.”", "The claim about Biden was also tweeted in abbreviated form, including here and here.", "A related claim that “Biden’s island” is “very close to Epstein’s island” is briefly mentioned in this lengthy Facebook post, shared 149,000 times, which talks about “an Elite Paedophilia ring.”", "That idea has been spread by conspiracy theorists who believe in QAnon, which has a following among  supporters of President Donald Trump as well as Republican hopefuls in the November 2020 election.", "AFP asked Biden campaign spokesman Andrew Bates whether the Democratic Party's presumptive nominee owns any property in the US Virgin Islands or elsewhere in the Caribbean.", "“He does not and never has,\" Bates replied by email.", "A search for the name “Biden” on July 28 in the Recorder of Deeds database in the US Caribbean territory reveals nothing for Joe Biden, only for Sara and James Biden.", "Politico reported in January 2020 that James Biden, Joe Biden’s brother, in 2005 bought ocean-view property on Water Island, off one of the main islands, St Thomas, and around eight miles from Epstein’s.", "Subsequent transactions related to that land raised questions about a lobbyist’s ties to the Bidens, though Politico said it was unclear if Joe Biden -- who later became vice president to Barack Obama -- was aware of the transactions.", "While the Recorder of Deeds has no listing for Joe Biden, it does hold the records of Jeffrey Epstein, and his estate.", "The financier killed himself in a New York jail last year while awaiting trial on charges that he trafficked and sexually abused dozens of girls as young as 14 between 2002 and 2005. Maxwell is accused of abetting his crimes, and is held in custody pending her trial next year.", "Virgin Islands Attorney General Denise George has separately filed suit against the estate of Epstein, who was a registered sex offender. It alleges abuse continued until 2019 at his Little St James property in the territory.", "Epstein and his associates acquired Little St James island in 1998, and in 2016 used a straw purchaser to buy the nearest island, Great St James, the suit says.", "This was “to ensure that the island did not become a base from which others could view their activities or visitors,” it says, alleging that Epstein and the girls would be flown to Little St James by helicopter or transported by boat.", "It does not mention a submarine.", "Google Maps show that the only island “next to” or “very close” to Epstein’s is Dog Island, which had no apparent signs of habitation when viewed in a Google Earth image on July 30.", "There is public evidence that Joe Biden owns only two properties, both in the United States.", "On his 2016 and 2017 federal tax returns, available on his campaign website, Biden and his wife Jill reported rental income from a cottage at a single-family residence property in his hometown of Wilmington, Delaware.", "Property marketplace Zillow has said that he and his wife bought their Wilmington home in 1996. A search of records in New Castle County, Delaware, shows Biden satisfied a mortgage on that lakeside home in 2018.", "Reuters and Mansion Global reported that Biden and his wife also have a vacation home in Rehoboth Beach, Delaware. A search of Sussex County records confirms they own the residence, a few hundred yards from the beach.", "The claim that Joe Biden owns an island in the US Virgin Islands was also debunked by Reuters fact checkers.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]