["A September story, The Atlantic reported that President Donald Trump had called service members who died at war \"losers\" and \"suckers.\"", "Now, posts online have begun to claim that his opponent in the presidential contest, former Vice President Joe Biden, disrespected the troops, too.", "A video posted to Facebook claims Biden called American troops \"stupid bastards.\"", "\"Notwithstanding what you may hear about me, I have incredibly good judgment,\" Biden remarks in the video. \"One, I married Jill. And two, I appointed Johnson to the Academy, I just want you to know that.\"", "Fact or fiction?:We're fact checking the news and sending it to your inbox. Sign up to get that here.", "After a moment of silence, Biden tells the troops, \"Clap for that, you stupid bastards.\"", "\"You be the judge on whether this is disrespectful,\" the caption of the video reads. \"What would the media say if President Trump did this?\"", "The user behind the post did not respond to a request from USA TODAY for comment.", "The footage of the moment is real. It was from a trip to Abu Dhabi, United Arab Emirates, on March 7, 2016, and he was speaking with troops stationed at Al Dhafra Air Base.", "Lt. Karen Johnson — a native of Wilmington, Delaware — introduced Biden to the rest of the troops, per a video from The Washington Examiner. Later in his speech, Biden told the crowd that he had appointed Johnson to \"the academy,\" a reference to one of the nation's five service academies.", "After that remark, expecting applause, Biden encouraged the troops to clap for Johnson in part by calling them \"stupid bastards.\"", "Once they began to applaud, he continued, \"Man, you are a dull bunch. Must be slow here, man.\"", "However, Andrew Bates, a spokesman for his campaign, said it was a joke.", "“Vice President Biden was jokingly encouraging the audience to clap for an airwoman on the stage, and a number of service members can be seen laughing and smiling at the comment. Seconds before, he praised them for 'the incredible sacrifices (they) make for our country,’” Bates told The Daily Beast.", "“He thanked them for their patriotism and courage throughout, and closed his remarks by saying, 'You’re the finest generation of warriors the world has ever, ever known' — receiving an enthusiastic ovation,” Bates added.", "More:Fact check: False claim that Biden and Harris said the other 'wasn't fit to run the country'", "The footage confirms his praise for the troops.", "At the start of his speech, for example, he told the soldiers that the \"one regret\" he has every time he visits them is that \"the folks back home can't see you; can't see you in place. Don't get to fly on the mission with you. Don't understand.\"", "\"They appreciate, but they don't fully understand the incredible sacrifices you make for our country,” Biden added.", "Later in the speech, he thanked the troops and their families.", "The former vice president's late son, Beau Biden, served in the Delaware Army National Guard and was deployed to Iraq in 2008, per the U.S. Department of Veterans Affairs.", "Based on our research, the claim that former Vice President Joe Biden called the troops \"stupid bastards\" is missing context. Biden did make the remark in 2016 as part of a call to applaud a fellow soldier. It was a joke, per a spokesperson for his campaign. During the same speech, he praised the troops as the \"finest generation of warriors\" in the world and thanked them for their \"incredible sacrifices.\"", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more."]