["This story is developing", "About this rating", "On Feb. 17, 2021, after arctic temperatures wreaked havoc on Texas' electricity system, leaving more than 3 million residents without power, Snopes became aware of reports accusing U.S. Sen. Ted Cruz of fleeing his home state for a vacation in Cancun, Mexico.", "The rumor stemmed from several photos, including one displayed in the tweet below, taken by people at Houston's Bush Intercontinental Airport who said they saw the senator hauling luggage or boarding a plane.", "Roughly 3.5 hours after @Juan_Gomez18's tweet the evening of Feb. 17, David Schuster, a former MSNBC journalist, reported on the social media site that Cruz and his family indeed flew to a resort in the warmer climate, and a former adviser to Democratic U.S. Sen. Jon Ossoff posted more photos that he framed as evidence of Cruz on the plane.", "The images went viral on social media overnight and in the morning of Feb. 18, prompting media inquiries to determine whether they indeed showed the senator, were photographed during the alleged timeframe and unedited, and were evidence that Cruz traveled to Mexico after plunging temperatures in Texas caused the energy crisis.", "Around 10 a.m. (EST), as multiple reputable news organizations corroborated the allegation with news reports citing anonymous sources with knowledge of the senator's whereabouts, Snopes reached out to Cruz's office to confirm or deny the stories, and, if he had traveled from Houston to Cancun, for his response to critics accusing him of abandoning the state.", "For hours, the senator's office did not respond to our request, nor inquiries from other media outlets, including Fox News, The Associated Press, and Business Insider, and no evidence on his official social media accounts or website indicated that he had taken a trip.", "Meanwhile, multiple news stories reported the senator's staff contacted the Houston Police Department to tell officers he would be traveling through the airport -- evidence that supported the claim that Cruz had prepared to, or taken, a flight but did not definitively prove that he took the vacation.", "Around noon, Edward Russell, an airlines reporter at Skift, a travel industry publication, tweeted that an anonymous source at United Airlines told him Cruz indeed traveled from Houston to Cancun, a trip that was scheduled to last until Feb. 20. Reputable news organizations including NBC corroborated Russell's reporting, also citing unnamed sources with knowledge of the senator's whereabouts.", "Shortly after 3:30 p.m., a spokesperson for the senator returned our request for information about his alleged trip, emailing us the below-transcribed statement from Cruz.", "Despite verified reports to the contrary -- including news stories featuring text messages in which Cruz's wife, Heidi, proposed a multi-day getaway at the Ritz-Carlton in Cancun because their house was \"FREEZING\" in Houston -- the spokesperson's statement to Snopes framed the flight as a one-day trip to placate his two daughters (they are ages 10 and 12, according to The New York Times).", "The spokesperson emailed us the below-transcribed statement from Cruz.", "This has been an infuriating week for Texans. The greatest state in the greatest country in the world has been without power. We have food lines, gas lines, and people sleeping at the neighbors’ houses. Our homes are freezing and our lights are out. Like millions of Texans, our family lost heat and power too.", "With school cancelled for the week, our girls asked to take a trip with friends. Wanting to be a good dad, I flew down with them last night and am flying back this afternoon. My staff and I are in constant communication with state and local leaders to get to the bottom of what happened in Texas. We want our power back, our water on, and our homes warm. My team and I will continue using all our resources to keep Texans informed and safe.", "He returned to the Houston airport the evening of Feb. 18, according to video evidence of him speaking to journalists there.", "Shortly later, while addressing reporters stationed outside the family's home, Cruz said he started \"second-guessing\" the trip \"from the moment I sat on the plane,\" according to The Washington Post and other media outlets.", "“Leaving when so many Texans were hurting didn’t feel right, and so I changed my return flight and flew back on the first available flight I could take,\" he said. \"Look, it was obviously a mistake, and in hindsight, I wouldn't have done it. I was trying to be a dad.\"", "Considering the official statement directly from the senator's office to Snopes, as well as video and photo evidence of Cruz departing and arriving to the Houston airport from Mexico, we rate this claim \"true.\"", "Jessica Lee is Snopes' Senior Assignments Editor with expertise in investigative storytelling, media literacy advocacy and digital audience engagement.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]