["The 12-minute 45-second video was published on Facebook here on February 04, 2021. It has been viewed more than 138,000 times and shared more than 4,000 times.", "The post’s Sinhala-language caption translates to English as: “Myanmar's military rule has begun shooting at Buddhist monks....", "“Thousands of people are already taking to the streets alongside the monks...", "“Military has begun shooting...president and Aun Sang Su Kyi arrested...Al Jazeera shows it to the whole world”.", "The footage features the logo of news network Al Jazeera in the bottom right-hand corner.", "The post circulated online three days after Myanmar’s military removed the country’s civilian government and arrested its de facto leader Aung San Suu Kyi in a bloodless coup on February 1, 2021, as AFP reported here.", "The video was also shared alongside a similar claim on Facebook here, here, here, here and here.", "The footage, however, has been shared in a misleading context.", "A reverse image search on Google of keyframes extracted from the video found it was originally published by Al-Jazeera on YouTube here on October 11, 2007, more than one decade before the 2021 coup.", "The video is titled “Inside Myanmar: The Crackdown”. The same footage shared in the misleading posts can be seen from the video's 42-second mark.", "Below is a screenshot comparison of the footage shared in the misleading posts (L) and the 2007 Al Jazeera video (R):", "The YouTube video's caption reads: “Back in 2007, the people of Myanmar were still living under harsh military rule. Among the first major international news stories Al Jazeera covered was the Myanmar government's brutal crackdown on peacefully protesting monks.”", "At the video's six-minute 31-second mark, the Thwin cinema in downtown Yangon is visible. Then at the clip's six-minute 40-second mark, the footage shows scenes near Yangon's Sule Pagoda.", "The unrest in Myanmar in 2007, which saw the country's military junta launch a bloody crackdown on protests, was also covered by other major international news outlets; for example AFP here and The New York Times here and here.", "Human Rights Watch released a report published here in December 2007 that detailed a “brutal and bloody crackdown” against protesters in Myanmar in the fall of that year.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]