["On July 7, several claims on social media alleged that members of the Muslim community filed a petition in the Supreme Court against holding ‘Mata ki Chowki’, a Hindu ritual, in public spaces. Among those who tweeted this misinformation was lawyer Prashant Patel Umrao who followed it with a question – “Should Hindus allow Namaz and Muharram on roads?”", "Umrao deleted his tweet the next day. Alt News has archived its cached version that can be accessed here. In the less than 24 hours that the tweet was live, more than 1,000 people ‘liked’ it and over 700 retweeted it. A quick read through the comments section shows that a few hours are enough to spread hate. The word quickly spread on both Facebook and Twitter, with many sharing Patel’s tweet.", "However, the petition was neither filed by ‘Muslims’ nor was it against the ritual. It was in fact in favour of the ritual and was filed by an organisation, Jyoti Jagran Manch, that was denied permission by the National Green Tribunal (NGT) to hold ‘Mata ki Chowki’ and ‘jagran’ (overnight prayer meeting) at a park in South-West Delhi. While the petition referred only to the aforementioned Hindu rituals, the SC’s hearing would pertain to the larger question of whether any religious function should be permitted at public spaces.", "Advocate Fuzail Ayyubi, arguing in favour of allowing the ritual to be held in public spaces tweeted at 12:20 am on July 6 about the case. He wrote, “Hon Supreme Court today referred my matter Jyoti Jagran Mandal to CJI for placing it before the Constitution Bench…” As Ayyubi bears a Muslim name, some social media users assumed that he was the one opposing the petition and began to target him.", "Ayyubi replied to one of the users, saying that he is in favour of ‘Mata ki Chowki’ and the user subsequently deleted the tweet.", "I m for mata ki choki. Saying the same thing https://t.co/RA8TVoVpKZ", "— Fuzail Ayyubi (@fuzail_ayyubi) July 6, 2018", "Several others came out in defence of Ayyubi, clarifying that he is, in fact, the counsel for the petitioner Jyoti Jagran Mandal.", "People like Umrao are spreading falsehood stating muslim lawyer was against mata ki chowki when the fact is that @fuzail_ayyubi appeared for Mata Ki Chowki. This is what the tradition of bar is. Dr. Dhawan appears for babri masjid. Good lawyers don’t ask religion of their client.", "— बुखरात वकील (अनस) (@Vakeel_Sb) July 7, 2018", "A recognizable pattern can be observed in the manner in which members of minority communities are targeted on social media – a false narrative is created and is widely and repeatedly circulated until the lie becomes truth and the discourse is completely diluted. Such claims are so common on social media that lawyer Fuzail Ayyubi was targeted without the need for a catalyst. People’s biases were enough for them to believe that he couldn’t possibly be “on their side”. It is, thus, imperative that any information on social media is cross-checked and not blindly believed.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A purported video of a Muslim man beating a temple priest with a bat is…", "A picture depicting the Pakistani flag apparently bigger in size and apparently placed higher than…", "Amid the ongoing war between Israel and Hamas, a video of a fleet of cars…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "A clip featuring Pakistan men’s Cricket team captain Babar Azam is viral on social media…"]