["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "With an end to the federal government shutdown in sight, Sen. Ted Cruz, R-Texas, tried to argue that, contrary to popular belief, he was not the driving force behind the previous government shutdown in 2013.", "Back in 2013, Cruz -- then a junior member of the Senate’s minority party -- had tried to end funding for the Affordable Care Act. He pushed for language to defund Obamacare in spending bills, which would have forced then-President Barack Obama to choose between keeping the government open and crippling his signature legislative achievement.", "As the high-stakes legislative game played out, Obama and his fellow Democrats refused to agree to gut the law, and the Republicans, as a minority party, didn’t have the numbers to force their will. Following a 16-day shutdown, lawmakers voted to fund both the government and the Affordable Care Act.", "Cruz was widely identified at the time as the leader of the defunding effort. Most famously, Cruz spoke about defunding Obamacare on the Senate floor during a 21-hour speech, punctuated by Green Eggs and Ham as a bedtime story for his children.", "Many in Cruz’s own party, even those sympathetic with his goals, blamed him for a tactical blunder. During the spending impasse, his Republican colleagues launched \"a barrage of hostile questions\" at a GOP-only lunch, questioning whether Cruz had thought through the endgame.", "By the time Cruz was running for president in 2016, some Republicans were willing to criticize his approach publicly. Grover Norquist, an influential anti-tax activist, told the Washington Post in 2016 that Cruz’s shutdown plan was like a plotline in TV’s South Park in which a group of gnomes comes up with a nonsense plot to become rich. Josh Holmes, a former aide to Senate Majority Leader Mitch McConnell, R-Ky., told the Post that Cruz’s approach was \"like a toddler’s version of legislating.\"", "Leading up to the 2018 shutdown, Cruz’s role in the 2013 budget impasse received fresh media coverage, since he was now in the Senate majority. Would he be able to reconcile his past tactics with his current urgings not to shut down the government?", "This came to a head during a Senate hallway exchange between Cruz and reporter Kasie Hunt that aired on MSNBC on Jan. 22, 2018:", "Cruz: \"We should not be shutting the government down. I have consistently opposed shutdowns. In 2013, I said we shouldn't shut the government down. Indeed, I went to the Senate floor repeatedly asking unanimous consent to reopen the government.\"", "Hunt: \"Sir, you stood in the way of that.\"", "Cruz: \"That's factually incorrect. It's a wonderful media narrative, but only one thing causes a shutdown: when you have senators vote to deny cloture on a funding bill. And when that bill comes up, you have a vote. A yes means fund the government, a no means don't fund the government. In 2013, virtually every single Republican voted to fund the government, including me multiple times. In fact, every single Democrat I believe in 2013 voted to shut the government down. The same thing is true here. Virtually every single Republican voted this week to fund the government. Virtually every single Democrat voted to shut it down.\"", "Hunt: \"Sir, that's simply not the case. This was about Obamacare funding…\"", "Cruz: \"Those facts are incorrect. ... I get that you want to debate me, but you don't actually have any facts.\"", "Cruz’s argument that he didn’t cause a shutdown is one he and his camp has made in the past. In his 2015 book, A Time for Truth, Cruz wrote that neither he nor his ally, Sen. Mike Lee, R-Utah, \"nor the House Republicans even once voted to shut down the government. To the contrary, over and over again we voted to fund the government.\"", "And in the 2016 Post article, then-Cruz campaign spokesman Rick Tyler said the senator \"didn’t pursue a government shutdown strategy. That’s not even sane. That would be a good thing to go out and campaign on? That wasn’t what he did. He led the fight to defund Obamacare.\"", "This echoes the framing Cruz offered Hunt -- namely, that his motivation was not to keep the government from being funded, but rather to defund Obamacare, and that the only reason people believe this is because of the biased media.", "However, even if, for the sake of argument, you accept Cruz’s line of thinking, his hallway comments offered a very specific definition of determining whether a lawmaker had \"consistently opposed shutdowns.\"", "Specifically, Cruz said that \"only one thing causes a shutdown: when you have senators vote to deny cloture on a funding bill.\" Cloture refers to a Senate vote to cut off debate and proceed to a bill; it’s a prerequisite for considering a bill, and these days, it typically takes 60 votes.", "So did Cruz ever \"vote to deny cloture on a funding bill\"?", "He did.", "It came on the legislation to end the 16-day shutdown -- a bill that didn’t include the Obamacare defunding language that he had been seeking. If this spending bill didn’t pass, the government wouldn’t be funded and would have to remain closed. As it happened, the bill passed by a large bipartisan majority, but Cruz was one of 16 senators to vote against cloture. He was also one of 18 to vote against the bill itself.", "By doing the \"one thing\" that he himself said defines causing a shutdown, Cruz didn't \"consistently oppose shutdowns.\"", "\"When he knew everyone else would vote to end the shutdown, he voted against funding the government,\" said Josh Ryan, a political scientist at Utah State University and author of the forthcoming book The Lawmaking End Game: Bargaining and Resolution in Congress.", "Cruz campaign spokeswoman Catherine Frazier told PolitiFact that his \"goal was to defund Obamacare, not shut down the government, and that is the point he was making today. He voted several times and fought in the face of (Democratic) opposition to fund vital government services -- including the military, veterans benefits, the National Guard, and National Health Institute -- while working to defund Obamacare before it went into effect, at which point he knew it would be markedly more difficult to undo. Sen. Cruz voted against cloture on the final bill because it still funded Obamacare, and he was committed to continuing the debate to defund it, while supporting bills to fund the other functions of government not impacted by Obamacare.\"", "Cruz said, \"I have consistently opposed shutdowns.\" Debunking this assertion doesn’t even require leveraging the many Republican statements criticizing Cruz’s legislative tactics for prompting the 2013 government shutdown. It only requires using the standard Cruz laid out in the same interview -- that \"only one thing causes a shutdown: when you have senators vote to deny cloture on a funding bill.\"", "Cruz did that very thing in 2013, when he was one of 16 senators to vote against cloture for the spending bill that would go on to end the shutdown. He was also one of 18 senators to vote against the bill itself.", "We rate his statement Pants on Fire.", "Mediaite, \"Ted Cruz Tosses This Gem Out: ‘I Have Consistently Opposed Shutdowns,' \" Jan. 22, 2018", "H.R. 2775 (2013)", "Roll call vote on H.R. 2775 (cloture)", "Roll call vote on H.R. 2775 (final passage)", "Politico, \"Cruz ends marathon speech,\" Sep. 24, 2013", "Politico, \"Some colleagues angry with Cruz,\" Oct. 2, 2013", "Washington Post, \"For Ted Cruz, the 2013 shutdown was a defining moment,\" Feb. 16, 2016", "Email interview with Josh Ryan, a political scientist at Utah State University and author of the forthcoming book The Lawmaking End Game: Bargaining and Resolution in Congress, Jan. 22, 2018", "Email interview with Steven S. Smith, political scientist at Washington University in St. Louis and author of The Senate Syndrome: The Evolution of Parliamentary Warfare in the Modern U.S. Senate, Jan. 22, 2018", "Email interview with Catherine Frazier, campaign spokeswoman for Ted Cruz, Jan. 22, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]