["“Today, the last rites of Modi in Haryana were done by the buyers and farmers, but no channel is daring to show it. You can also see and send others so that more and more people can watch this video and in 2019 Modi can answer.”", "This message has gone viral on social media along with a video which shows a mock funeral of Prime Minister Narendra Modi. The video has been shared as a recent incident, as the message begins with the words “Today, the last rites…”.", "In the video, people can be heard saying, “Modi is dead, cry, cry loudly, cry together….Khattar is dead -translated”. The cries for ‘Khattar’ refers to the chief minister of Haryana, Manohar Lal Khattar.", "Today, the last rites of Modi in Haryana were done by the buyers and farmers, but no channel is daring to show it. You can also see and send others so that more and more people can watch this video and in 2019 Modi can answer", "Posted by My Passion My Leader on Monday, April 29, 2019", "The video has been shared by several individual users on Facebook with identical text, suggesting that the same is circulating on WhatsApp, and has likely been uploaded by users on their timelines.", "Alt News had fact-checked this video in December 2018, when it was circulated with the claim that this mock funeral had taken place in Pakistan following the victory of the Congress party in Rajasthan, MP and Chhattisgarh.", "Searching on Google with the keywords, “मोदी अर्थी (Modi’s funeral -translated)” we had found a YouTube video, but with different audio. In this video, protesters could be heard speaking in Tamil, which pointed to the possibility of the viral Hindi version being a doctored video. According to a website, the images belong to a protest held against the ban on Jallikattu in 2017. We found a video by Nakkheeran TV of the anti-Modi processions that were taken out by the protesters in a similar fashion to revoke the ban on Jallikattu. An article published by The News Minute on January 20, 2017 had also reported on the protest directed at the Prime Minister.", "Moreover, Alt News had found that the slogans chanted in the video being circulated, had a striking resemblance to the ones chanted during a protest held by Multi-purpose health workers against the Haryana government. This suggested that the audio of the viral video clip was doctored. However, this could not be conclusively established. Alt News’ detailed fact-check can be read here.", "In conclusion, a two year old video of a protest in Tamil Nadu was tweaked to change the audio, and shared widely on social media with the implication that this mock funeral of PM Modi is a recent incident.", "Donate Now", "Arjun Sidharth is a writer with Alt News. He has previously worked in the television news industry, where he managed news bulletins and breaking news scenarios, apart from scripting numerous prime time television stories. He has also been actively involved with various freelance projects. Sidharth has studied economics, political science, international relations and journalism. He has a keen interest in books, movies, music, sports, politics, foreign policy, history and economics. His hobbies include reading, watching movies and indoor gaming.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]