["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "As students return to campuses across the state, the impact of the GOP-led $250 million two-year budget cut to the University of Wisconsin System -- combined with the extension of a tuition freeze -- is drawing new attention.", "On some campuses, the cuts proposed by Gov. Scott Walker and enacted by the Legislature as part of the 2015-’17 budget might reduce the number of campus jobs available for students. Meanwhile, there have been layoffs and early retirement offers.", "State Rep. Dale Kooyenga (R-Brookfield), a member of the budget-writing Joint Finance Committee, defended the cuts during an Aug. 31, 2015 appearance on Charlie Sykes’ talk show on WTMJ (AM 620).", "\"I think they can find ways to save money,\" Kooyenga said, adding that the Republicans who control state government chose the UW cuts instead of raising taxes.", "He expressed confidence that the system could handle the reductions because the cuts are small in relation to the UW System’s overall size. (The system’s overall annual budget is $6.1 billion).", "Kooyenga added: \"The university system is larger than any business in the state of Wisconsin.\"", "That caught our attention, in part because there are a number of large Wisconsin-based businesses, including well-known names like Kohl’s, Menard and Johnson Controls.", "And, of course, there’s Walmart, which has several major distribution centers and 105 stores in the state, including 81 supercenters.", "There are a number of ways to measure the size of a business. Kooyenga’s aide Rachel Geary said her boss was using the most logical one -- number of employees.", "So how does the UW System stack up?", "According to its website, the system employed : 40,975 as of the end of fiscal year 2014. (A decade earlier the figure was 36,989.)", "How does that compare with the private sector?", "Kooyenga’s office offered several lists. For instance, one compiled by Newsmax, a conservative media outlet, said the top private employer was Eau Claire-based home improvement retail chain Menard Inc. (\"over 10,000\"). Also on the list was Epic Systems in Verona (\"nearly 7,000\") and Thedacare in Appleton (\"over 6,000).", "Kooyenga’s office also forwarded an email from Walmart -- the nation’s  largest employer -- that said the company has 30,095 employees in Wisconsin.", "Other big employers include Aurora HealthCare, with about 25,000 in southeastern Wisconsin. Menomonee Falls-based Kohl’s has about 10,000 employees in corporate offices and stores around Wisconsin, a company spokeswoman said.", "And then there’s the largest public company based in Wisconsin, Johnson Controls with about 3,400 employees in the Milwaukee area.", "All fall short of UW when it comes to employees.", "Another measuring stick", "There are other ways to measure the size of a business, including annual revenue.", "The UW System has annual revenue of about $4.8 billion, on a budget of about $6.1 billion.", "But the university system is not designed as a profit-generating enterprise. As such, there are plenty of public and private companies based in Wisconsin with higher annual revenue.", "For instance, Johnson Controls is at $42.5 billion, Milwaukee-based Manpower is $20 billion, Kohl’s $19 billion, according to their annual financial reports.", "S.C. Johnson, the state’s largest privately based company, has annual revenue of $9.6 billion, according to an estimate by Forbes", "Another key difference, of course, is that the UW System operates within Wisconsin.", "Geary, the Kooyenga aide, said it was misleading to compare the system with corporations that generate revenue around the world.", "\"For example, Johnson Controls has a plant in China, then sells in China (and) that revenue is showing up at Johnson Controls,\" she said in an email. \"But the vast majority of the revenue (especially with the US heavy tax burdened on overseas profit) never makes it to Wisconsin and the related employees are primarily outside Wisconsin. Compare that to UW where 99% of the revenue is received and spent in state.\"", "Our rating", "Kooyenga said that the UW System is \"larger than any business in the state of Wisconsin.\"", "He’s right when you consider employment within Wisconsin, which is the most obvious way to make such a comparison. By other measurements, such as annual revenue, there are many Wisconsin-based companies that are larger than UW. But that creates more of an apples-and-oranges comparison.", "We rate the statement Mostly True.", "Rep. Dale Kooyenga, radio interview, Aug. 31, 2015", "Emails, Rachel Geary, office of Rep. Dale Kooyenga, Sept. 16, 17, 2015", "Yahoo Finance", "Forbes.com rating of top privately held companies", "Milwaukee Journal Sentinel, \"University of Wisconsin Regents enact budget reflecting state cuts,\" July 9, 2015", "Milwaukee Journal Sentinel, \"Budget cuts may limit student jobs on UW campuses,\" Sept. 12, 2015", "Newsmax, \"Top 5 Employers in Wisconsin: Which companies have the most jobs?\" April 3, 2015", "University of Wisconsin System faculty and staff count accountability dashboard", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]