["About this rating", "In late December 2019, during the Jewish festival of Hanukkah, readers asked us about the authenticity and provenance of a stirring, powerful photograph. The picture appeared to show a menorah, which plays a central role in Hanukkah rituals, displayed in the window of a home with a Nazi swastika flag flew ominously across the street. The picture was shared several times on social media in the final week of December, during which the eight-day festival of lights fell in 2019:", "The photograph is indeed authentic, and social media posts about it in December 2019 did not substantially misrepresent its origins and context, even if some incorrectly dated it to 1931 or 1933.", "According to the most authoritative source available, Israel's official holocaust museum Yad Vashem, the photograph was taken in the northern German city of Kiel in 1932. The museum website describes the image as follows:", "On Hanukkah 1932, just one month before Hitler came to power, Rachel Posner, wife of Rabbi Dr. Akiva Posner, took this photo of the family Hanukkah menorah from the window ledge of the family home looking out on to the building across the road decorated with Nazi flags.", "On the back of the photograph, Rachel Posner wrote in German (translated here):", "Chanukah 5692 (1932).\n\"Death to Judah,\" so the flag says.\n\"Judah will live forever,\" so the light answers.", "The Yad Vashem website provides the following context and further details about the history of the Posner family:", "Rabbi Dr. Akiva Posner, Doctor of Philosophy from Halle-Wittenberg University, served from 1924–1933 as the last Rabbi of the community of Kiel, Germany.", "After Rabbi Posner publicized a protest letter in the local press expressing indignation at the posters that had appeared in the city, “Entrance to Jews Forbidden”, he was summoned by the chairman of the local branch of the Nazi party to participate in a public debate. The event took place under heavy police guard and was reported by the local press.", "When the tension and violence in the city intensified, the Rabbi responded to the pleas of his community to flee with his wife Rachel and their three children and make their way to Eretz Israel [the land of Israel]. Before their departure, Rabbi Posner was able to convince many of his congregants to leave as well and indeed most managed to leave for Eretz Israel or the United States. The Posner family left Germany in 1933 and arrived in Eretz Israel in 1934.", "In 2017, the New York Times spoke with members of the Posner family, who explained that Yad Vashem exhibited the original menorah throughout the year, with the exception of Hanukkah, when it is displayed in the home of the Posners' great-grandson, Akiva Baruch Mansbach, in Beit Shemesh near Jerusalem. Mansbach explained to the Times the continued symbolic significance of lighting the very same menorah shown in the now-famous photograph:", "The significance of lighting it in his home in Beit Shemesh, Israel, so many decades after his ancestors lit it as an act of resistance, did not escape him. “The same light that my great-grandparents lit in exile in Germany is the light that so many light today in Israel,” he told me. “It demonstrates the continuity of Jewish history.", "“Whether it’s the Greeks on Hanukkah or the Nazis in Germany, they want the same thing -- to destroy the nation of Israel,” he added. The menorah symbolizes the strength and continuity of our nation, the idea that it is strong and will conquer all its enemies.” On where that strength resides, Mr. Mansbach was unambiguous. “Until 70 years ago, we were in exile,” he said. “That exile ended with the establishment of the state.”", "Yad Vashem.  \"Artifact -- Hanukkah Menorah from the Home of Rabbi Akiva & Rachel Posner in Kiel, Germany.\"\r\n    Accessed 24 December 2019.", "Greenbaum, Daniella J.   \"Lighting Hanukkah Candles Under the Swastika's Shadow.\"\r\n     The New York Times.   12 December 2017.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]