["Twitter user Pawan Durani tweeted in the morning of November 29 images of a road and claimed that it was newly constructed in a village, courtesy Prime Minister Narendra Modi. In the photographs, children can be seen playing on the road barefoot. Durani, who is followed by PM Modi, later deleted his tweet. However, it had already received over 5,000 likes and 2,000 retweets.", "A screenshot of Durani’s tweet was widely circulated by several right-wing pages on Facebook, inculuding fake news purveyor Post Card Fans.", "Thank u Modiji…", "Posted by Post Card Fans on Wednesday, 28 November 2018", "Other pages that shared the tweet were My Prime Minister – Modi, We Support Sangh Parivar and Narendra Modi Fans : Karnataka. The identical claim was also circulated by individual users.", "Alt News reverse-searched the images and found that they were of an Indonesian village where the residents had seen an asphalt road for the first time in their lives. In an article published on October 15, 2018, website The Quebec Times shared the photographs.", "The same images were also circulated by other websites in October – 1, 2, 3. However, Alt News could trace them as far back as August 2018. They were shared by a popular Indonesian website brilio.net, which credited the images to Twitter handle @gothed. The user had tweeted the photographs on August 27, 2018.", "kebahagiaan yang sederhana adalah pembangunan yang merata. Adek² kita ini akhirnya merasakan apa yang namanya aspal, saking excitednya mereka sampe lepas sandal 😂👌.", "tkp daerah Wates Wali Songo. pic.twitter.com/L31v7UcnbX", "— Mas Rufi (@gothed) August 27, 2018", "It is commonplace on social media for infrastructural developments of other countries to be attributed to the Indian government. Recently, Ahmedabad Mayor Bijal Patel tweeted an image from Seoul as Sabarmati Riverfront in Ahmedabad. Earlier, an image of Nanpu Bridge from Shanghai was posted as Varanasi roads on social media. Last year, Chhattisgarh PWD minister Rajesh Munat passed off a Vietnamese bridge as one in Raigarh; a digital impression of Rajkot Bus stand was circulated by many as the real image; the Ministry of Roads, Transport and Highways posted pictures of roadways from US and Canada on its parivahan website. Even the Aam Aadmi Party had recently passed off a bridge in the Netherlands as Signature bridge in Delhi", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]