["By D'Angelo Gore", "Posted on June 5, 2019", "President Donald Trump claimed not to have seen the large groups of anti-Trump protesters during his trip to the United Kingdom this week, and then falsely labeled media reports of those protests “fake news.”", "In reality, images and video support reporting by major news organizations that “thousands” of people attended demonstrations against Trump, who first arrived in London on June 3 for a three-day state visit filled with a series of ceremonies and meetings with members of the royal family and British government officials.", "But the following day, in a joint press conference with outgoing U.K. Prime Minister Theresa May, Trump said he had only seen a “very, very small group” of protesters.", "Trump, June 4: As far as the protests, I have to tell you, because I commented on it yesterday: We left the Prime Minister, the Queen, the Royal Family — there were thousands of people on the streets cheering. And even coming over today, there were thousands of people cheering. And then I heard that there were protests. I said, “Where are the protests? I don’t see any protests.”", "I did see a small protest today when I came — very small. So a lot of it is fake news, I hate to say. But you saw the people waving the American flag, waving your flag; it was tremendous spirit and love. There was great love. It was an alliance. And I didn’t see the protestors until just a little while ago, and it was a very, very small group of people, put in for political reasons. So it was fake news.", "It’s possible Trump didn’t see the mass of protestors, as he said. But that doesn’t mean they didn’t exist, or that reports of such crowds are “fake news.”", "USA Today reported that “[t]he protest route ran from London’s Trafalgar Square, past No. 10 Downing St. – Prime Minister Theresa May’s official office and residence – and on to Parliament Square, a large open green space across the street from the British Parliament.”", "But “because of the way British police placed security barriers,” the newspaper explained, “[m]ost of the demonstrators were out of his sight.”", "In response to Trump’s claims, the Guardian, a British news publication, posted a short video of interviews with some of the protestors who gathered in those locations. (It also posted a longer video of people marching and listening to speakers criticize Trump.)", "ABC News and CNN also published stories including a video and photos of more than a “very small” number of protestors holding signs with messages denouncing the president. There also was a parade-sized balloon depicting Trump as a baby, and a giant statue of Trump wearing an “impeach me” hat and sitting on a toilet with a phone in his hands.", "NBC News reported that “[t]ens of thousands of protesters assembled in the streets of London on Tuesday” in what it said was the “largest of more than two dozen anti-Trump protests planned around the U.K. this week.” One of the groups that organized the demonstration claimed “some 75,000 people” attended the June 4 protest.", "If so, that wouldn’t even be London’s largest ever gathering of Trump protesters.", "“While thousands turned out, the protests were significantly smaller than the anti-Trump demonstrations that emerged during the President’s visit to the U.K. last July,” Time reported. The magazine said that time “[a]bout 250,000 people flooded the center of London, and an estimated total of 400,000 people protested across the U.K, resulting in a large-scale police and security operation, in which more than 10,000 police officers were deployed.”", "As we have written before, the president has a habit of labeling accurate news stories as “fake news.” This is yet another example.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]