["About this rating", "On 27 March 2017, the web site True Trumpers posted a story blaming a \"Muslim refugee\" for a shooting in Cincinnati before quickly contradicting itself.", "As other web sites have done, True Trumpers used an actual incident that it then embellished to advance a specific political agenda. In this case, the story centers around a nightclub mass shooting a day earlier that resulted in the death of 27 year-old O'Bryan Spikes and injuries to sixteen other people inside the building.", "The headline for the story blamed a \"Muslim refugee\" for the shooting, while also promising that Donald Trump was \"going to deport them all.\"", "The story immediately undermined its own premise:", "Although investigators don’t believe that this was an act of Islamic terrorism, as was seen the in the Orlando night club, they don’t have their suspect in custody yet, nor has a motive been determined, Assistant Police Chief Paul Neudigate said in a tweet, according to the Daily Mail.", "The story was republished verbatim on another questionable site with a different misleading headline, saying that Ohio Gov. John Kasich (R) was \"about to address the nation\" but failing to substantiate that claim.", "In reality, two men — neither identified as either refugees or Muslims — were charged in connection with the shooting. One suspect, 29 year-old Deondre Davis, died on 4 April 2017, from injuries he sustained during the incident. Authorities believe that Davis killed Spikes. The surviving suspect, 27 year-old Cornell Beckley, was charged with murder.", "Spikes's family announced on 18 April 2017 that it would pursue a civil lawsuit against not only the suspects, but Cincinnati police and the owner and landlord of the Cameo nightclub, where the shooting took place.", "WLWT-TV.\r\n   \"Cameo Nightclub Shooting Victim's Family to Pursue Civil Suit in Man's Death.\"   18 April 2017.", "Knight, Cameron and Saker, Anne.    \"Latest on Cameo Nightclub Shooting: Total Hit Up to 17, No Security Footage Provided.\"\r\n   Cincinnati.com.    27 March 2017.", "Aragon, Rose-Ann.   \"Cameo Night Club Shooting Suspect Dies.\"\r\n   WCPO-TV.   3 April 2017.", "Brookbank, Sarah.   \"Family of Cameo Shooting Victim Prepares to Sue.\"\r\n   Cincinnati.com.   18 April 2017.", "Arturo Garcia is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]