["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "In his inaugural address, President Donald Trump painted a picture of a nation that has steadily marched down the wrong path.", "\"We’ve made other countries rich while the wealth, strength and confidence of our country has disappeared over the horizon,\" he said. \"One by one, the factories shuttered and left our shores, with not even a thought about the millions upon millions of American workers left behind. The wealth of our middle class has been ripped from their homes and then redistributed across the entire world.\"", "Trump vowed to end this \"American carnage.\"", "It’s tough to measure strength and confidence, but there are ways to measure wealth. We decided to look at whether America’s wealth has fallen while other countries became rich.", "Trump’s office told us he was thinking about America’s $800 billion trade deficit. However, trade deficits are not a measure of national or household wealth. There is no question that trade with China has cost America jobs to the benefit of Chinese workers. But again, Trump said we made other countries rich while our wealth faded and that’s a different point.", "Economists measure the wealth of nations in two ways. They look at the size of their economies, the GDP, and they look at how well the average citizen is doing, or GDP per capita.", "Through either lens, the wealth of the United States has not dissipated.", "This chart comes from International Monetary Fund data. With its $18 trillion economy, the United States is a good one-third wealthier than its closest economic rival, China.", "China’s economy avoided the dip that the United States faced in the Great Recession, and it has grown at a faster rate, but America remains the wealthiest nation.", "Seen through the lens of GDP per capita (and factoring in the purchasing power of each currency), the United States looks even better compared to China, a country Trump often points to as the source of America’s woes.", "China ranks 83rd in the world on a per capita basis because while its economy is huge, it has about 1.3 billion people, many of whom are very poor.", "There is one way to look at the shifting economic fortunes of the typical adult that does express a sense of what Trump described.", "The international bank Credit Suisse has calculated adult wealth since 2000. Using their 2016 data, we find that the median wealth rose in each of the largest economies, including the United States, but it rose nearly three times faster in China than it did in the United States.", "Our ruling", "Trump said that other countries became rich while the wealth of America \"dissipated.\" Based on the most common measures of national wealth, that is inaccurate. The United States has the world’s largest economy and, when averaged across the population, the typical American does better than the people of any other country.", "There is some argument to be made that the typcial Chinese worker's wealth has gone up much faster than the typical American's, but the American is still much wealthier.", "We rate this claim Mostly False.", "Donald Trump, Inaugural address, Jan. 20, 2017", "Global Finance, The Richest Countries in the World, accessed Jan. 20, 2017", "International Monetary Fund, World Economic Outlook Database", "Credit Suisse, Global wealth databook 2016, November 2016", "Federal Reserve Bank of St. Louis, FRED, accessed Jan. 20, 2017", "Tradingeconomics.com, China wages - 2006-2015, accessed Jan. 20, 2017", "Forbes, The World's Richest Countries, Nov. 8, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]