["The misleading claim was published on Facebook here in early April 2020.", "The post's traditional Chinese-language caption translates to English as: “People who are dining out have to be aware!/ You will get a fine of $2000 if you remove your masks before the food arrives at your table./ The same case applies if you did not wear your masks after you finished your food./ This morning a waitress from Cafe de Coral said the restaurant had received 4000 fines already yesterday, each customer received a fine of HKD2000 because they sat on the restricted seats./ She is very worried, kept on reminding customers not to sit at the wrong seats and sit properly to prevent crossing the line./ She said the fine is really serious, $2000 per person./ And the government even dispatched plain-clothes police officers with pre-printed tickets./ All violators will receive the $2000 fine if they remove their masks before the food arrives.”", "Café de Coral is a Hong Kong restaurant chain.", "A similar claim was shared on Facebook here, here, here; on Twitter here; and on various online forums here and here.", "It was also published beside a photo of a purported HKD$2,000 fine on Facebook here and here.", "The claim, however, is false.", "Restaurant denial", "Café de Coral Group refuted the claim in the misleading posts.", "“Café de Coral Group hereby clarifies that the rumour on the Internet about 4000 fines for no masks at Café de Coral restaurants during the pandemic was untrue,” a restaurant spokesperson told AFP by email on July 20, 2020.", "The Hong Kong Government also denied the claim about diners receiving a HKD$2,000 fine for failing to wear masks inside restaurants.", "“The penalty fine of HKD$2000 only applies to the Prevention and Control of Disease (Prohibition on Group Gathering) Regulation (Cap. 599G), which exempted group gatherings of more than four people,” the government said in a traditional-Chinese statement on its official information Facebook page here on April 5.", "In response to the misleading post in July 2020, Hong Kong’s Food and Environmental Hygiene Department (FEHD) shared an official government press release, which stated that “persons who participate in a prohibited group gathering may discharge liability for the offence by paying a fixed penalty of $2,000.”", "As part of stricter social distancing measures announced on July 13, the Hong Kong government announced that people failing to wear face masks on public transport could face a fine of up to HKD$5,000. The measures came into effect at midnight on July 15, it said.", "Miscaptioned photos", "An examination of the photo of the uniformed man reveals that he is wearing the uniform of the Hong Kong Food and Environmental Hygiene Department -- not a police officer’s uniform.", "Below is a comparison between the photo in the misleading post (L) and a photo of uniformed Food and Environmental Hygiene Department officers from an official agency press release (R):", "The photo of the purported HKD$2,000 fine shows a ticket for a violation of the social distancing rule. It mandates no more than four people can be seated at the same table.", "Below is a screenshot of one of the misleading posts that featured a ticket with the violation details circled in red:", "AFP could not verify whether the image of the FEHD officer was connected to the image of the purported fine.", "The false claim was also debunked by Hong Kong fact-checker Kauyim here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]