["A 22-second clip of three men hacking another to death with sticks and a huge stone in public has gone viral. It’s being shared with a Hindi text that claims the incident took place in Delhi’s Karol Bagh area. The message demands that the perpetrators should either be shot by the police in public or handed over to the masses.", "(Viral Hindi text: दिल्ली करोल बाग ने सरेआम एक आदमी की हत्या संवेदनहीन लोग और समाज अब इन हत्यारे लोगो के लिए कौन सी सजा होनी चाहिए जब सीधा सीधा अपराध दिख रहा है तो अदालत और पुलिस सीधा इन लोगो को सरेआम गोली मारे या इन लोगो को जनता के हवाले किया जाये)", "Alt News is not uploading any links to the video due to its graphic nature. However, we have uploaded three stills that would help readers identify the video. We have received several requests on our WhatsApp helpline number (+917600011160) and on our official Android application to authenticate the claim.", "This slideshow requires JavaScript.", "Alt News performed a keyword search on Google and found that a similar incident was reported by The Times of India on January 12. As per the report, the incident took place on Hyderabad’s PVNR Expressway. The victim was 33-year-old Mohammed Khaleel, a block president of AIMIM in Rajendranagar. He was hacked to death by three men with a concrete block and sticks on January 10.", "Khaleel was killed by Sheikh Rasheed, an owner of a local hotel, and his employees, Mohammed Azmath and Syed Imran. As per TOI, debt-ridden Rasheed had taken a loan of ₹15 lakh from Khaleel.", "Based on this information and another keyword search on YouTube we found multiple regional media reports on the incident. Most of these reports include a byte from DCP Shamshabad N Prakash Reddy. The video report below is by S M News Hyderabad TS.", "Alt News spoke with DCP Reddy. He confirmed that the video indeed shows murder in Rajendranagar. He added, “The three men have been arrested and charged for murder.”", "The video was earlier fact-checked by Aaj Tak. It shows a man hacked to death in Hyderabad due to a financial dispute but was shared on social media with the false claim that the incident took place in Delhi.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]