["About this rating", "In late July 2020, Snopes readers asked whether it was true that the video camera used to film the beating of Black motorist Rodney King by Los Angeles police officers in 1991 was being auctioned off, and it is.", "The Sony Video8 Handycam CCD-F77 is listed for auction on the Nate D. Sanders Auctions website, going for a minimum bid of $225,000.", "Long before cell phone cameras existed and online videos of police violence against civilians, and particularly Black Americans, frequently appeared on screens via both news broadcasts and social media platforms, George Holliday filmed police brutality against King on a hand-held camera on March 3, 1991, from the balcony of his home in Lake View Terrace, a neighborhood in northeast Los Angeles. What he captured changed history.", "Presently, the widespread availability and use of smartphones with built-in cameras, internet access, and apps that allow users to stream or post videos in real time have made the practice of filming and sharing videos of police violence commonplace. But as the Nate D. Sanders website notes, in 1991, Holliday's footage shocked those who had never seen anything like it at that time:", "Although the public had seen examples of police violence before, most notably many years prior during the 1960s, those images were most often taken, edited and curated by professional news outlets, and at the time of 1991 seemed a distant memory. Nothing so raw as unedited, uncontrolled video taken by a regular citizen had ever before been witnessed by the public all over the world, confirming what many argued was commonplace in their communities. What resulted was a firestorm, with the video taken that night not only leading to the 1992 Los Angeles riots a year later when the officers were acquitted, but also laying the groundwork for the anti-police brutality movements such as Black Lives Matter that are so relevant today.", "A total of 63 people were killed in the Los Angeles riots that followed the April 29, 1992, acquittal of the four LAPD officers who beat King, and more than 2,000 were injured.", "Perhaps a direct link to the events of 1992 can be made to the nationwide protests in the spring of 2020 against police violence and racism which were sparked by the death of George Floyd, a Black man, in Minneapolis police custody. A bystander filmed Floyd's death and the video went viral.", "King, who suffered brain damage as the result of the beating, died at the age of 47 in 2012. His death was ruled an accidental drowning.", "Holliday, a plumber by trade, told The New York Times that he hopes that with the sale of the camera, he can buy a home. He also said he hopes that the auction inspires people to film what they see. \"People can accuse other people of doing stuff,\" he said, “But when it’s on camera, it’s different. You just can’t argue with it.\"", "Nate D. Sanders Auctions website. \"Video Camera Used by George Holliday to Record the Rodney King Police Beating on 3 March 1991.\"", "Paybarah, Azi. \"He Videotaped the Rodney King Beating. Now, He Is Auctioning the Camera.\"\r\n  The New York Times. 29 July 2020.", "Miranda, Carolina A. \"Of the 63 People Killed During ’92 Riots, 23 Deaths Remain Unsolved — Artist Jeff Beall Is Mapping Where They Fell.\"\r\n  Los Angeles Times. 28 April 2017.", "Shuit, Douglas P. \"Waters Focuses Her Rage at System.\"\r\n  Los Angeles Times. 10 May 1992.", "Pamer, Melissa. \"Los Angeles 1992 Riots: By the Numbers.\"\r\n  KNBC. 20 April 2012.", "BBC. \"Rodney King Death Ruled Accidental Drowning.\"\r\n  23 August 2012.", "Sastry, Anjuli and Karen Grigsby Bates. \"When LA Erupted in Anger: A Look Back at the Rodney King Riots.\"\r\n  NPR. 26 April 2017.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]