["The picture, which shows a masked man holding a rifle and standing in front of an Islamic State group flag, was published in this Facebook post on January 11, 2020, by “Biafra Radio”, which has more than 700,000 followers.", "The post has been shared 517 times, generated 372 likes and accumulated more than 45,000 views, according to data provided by the social network.", "“Take a very good look at this picture. Boko Haram has taken over the north and now mounts road blocks (sic),” the post claims. “The sudden withdrawal of troops by Chad on the fight against Boko Haram is a testaments (sic) that Nigeria is sabotaging their good work. But as a sister in the same Islamic faith, Chad will not open up.”", "Boko Haram, which loosely translates as “Western education is banned”, wants to create a hardline Islamic state in Nigeria, but the country's security forces together with troops from neighbouring countries have combined to fight the threat.", "The post was published less than two weeks after Nigeria said it would begin withdrawing troops from its northeastern region where Boko Haram insurgents have carried out several attacks in the past decade, and barely a week after neighbouring Chad ended its own mission against the group, as reported by AFP here on January 5, 2020.", "The same picture also appears in this Facebook post, which has been shared 390 times, and in another post seen here alongside a similar claim.", "The picture has been used in a misleading way -- it was snapped by the Associated Press on June 19, 2014, showing an al-Qaeda militant standing guard at a checkpoint near Beiji refinery in northern Iraq.", "Reverse image searches on Google and Tineye revealed the image first appeared here on CTV Television Network and here on Mashable after a battle for control of the refinery, Iraq's largest, between Sunni militants and government forces.", "The caption on the original photo reads: “An al-Qaida-inspired militant stands guard at a checkpoint captured from the Iraqi Army outside Beiji refinery, some 250 kilometers (155 miles) north of Baghdad, Iraq, Thursday, June 19, 2014.”", "The first screenshot below is from the misleading Facebook post -- it is the same as the photograph below it, which was published online by the Canadian television website in its report from six years ago.", "Both CTV Television Network and Mashable credit the picture to American news agency Associated Press, which also published the picture on its image website here, here and here. The news agency, however, did not credit any photographer.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]