["The images appeared here on Facebook on August 6, 2020. The post has been shared almost 900 times.", "The first image shows a room decorated with skulls; the second image shows a wall covered with skulls and bones.", "The post's Indonesian-language post translates to English in part as: “This is a church built from bones of Muslims who refused to be converted to Christianity in Andalusia, and this church is located in Portugal. One of the tourist attractions opened to visitors, we find the Capela dos Ossos Church in the Portuguese town of Evora which was built entirely by a Franciscan monk entirely from the bones of murdered Andalusian Muslims and buried in a mass grave near the site of the church.", "“In this church there are also two dry corpses which are hung on the wall by chains, and one of these bodies belonged to a Muslim child who was strangled and then dried to be stored in the church.", "“Capella dos Osos also collects around 5,000 skeletons of Muslim Moors who refused to convert to Christianity after the fall of Andalusia.”", "Andalusia is a region in southern Spain.", "Moor refers to member of the Muslim population in Andalusia.", "The same images have also been shared more than 770 times after they were posted along a similar claim here, here, here and here on Facebook; as well as here on Twitter.", "Posts sharing the two images with a similar claim in English can be seen here and here; in Malaysian here; and in Arabic here, where they have been shared more than 1,100 times.", "The claim, however, is false.", "First image", "A reverse image search on Google followed by a keyword search found the image was previously uploaded on Twitter here on September 15, 2018. The photo includes three other images, showing skulls on the walls.", "Capela dos Ossos, Faro, Portugal #ESHE2018 pic.twitter.com/hxzyDLdvvu", "The tweet reads: “Capela dos Ossos, Faro, Portugal #ESHE2018”.", "The photos were posted on by Kate Wong, senior editor at Scientific American magazine, who also said she visited the site.", "Capela dos Ossos is in Faro, a municipality in Portugal.", "According to “Lonely Planet Best of Portugal”, Capela dos Ossos in Faro was built at the back of a church called Igreja de Nossa Senhora do Carmo. The church was completed in 1719.", "“Accessed through the church at the back, the 19th-century Capela dos Ossos is built from the bones and skulls of over 1,000 monks as a reminder of earthly impermanence,” the book states.", "Below is a screenshot comparison between the first image in the misleading post (L) and the photo on Twitter (R):", "Second image", "A reverse image search on Google and keyword search found the second image has appeared on the Twenty20 stock photo website here.", "Below is a screenshot of the photo on the Twenty20 website:", "The same photo also appeared here on the iStockphoto website, dated August 10, 2017, and is credited to the same photographer, Steve Allen.", "On both websites, the caption reads: “Capela dos Ossos or Chapel of Bones - is one of the best known monuments in Evora, Portugal. It is a small interior chapel located next to the entrance of the Church of St. Francis. The Chapel gets its name because the interior walls are covered and decorated with human skulls and bones.”", "Capela dos Ossos in Evora is part of Igreja de Sao Francisco (St Francis Church), which was first built by Franciscan monks who arrived from Galicia in 1224.", "Translated from Portuguese to English, the first two sentences from this page on the church’s official website read: “The Chapel of Bones was built in the 17th century, adopting a model in vogue at the time, with the intention of provoking, through the image, a reflection on the impermanence of human life and the consequent commitment to a permanent Christian experience. Both the walls and the pillars are covered with a few thousand bones and skulls, from the burial spaces connected to the convent.”", "Below is a screenshot comparison between the second image in the misleading post (L) and the photo on the Twenty20 website (R):", "This AFP fact-check has debunked a similar claim using different images from various churches in Europe, including the above mentioned chapels of bones in Faro and Evaro.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]