["On March 12, an advertisement was published in leading Hindi daily Rajasthan Patrika which said, “For the first time in the history of Rajasthan budget, Rs 100 crore has been approved for Muslim pilgrimage sites under the religious tourist circuit in the government’s 2021-22 budget. A heartfelt thanks to Hon’ble Chief Minister Mr Ashok Gehlot for this approval.”", "(Translated from Hindi: राजस्थान सरकार बजट 2021-22 में राजस्थान के इतिहास में पहली मर्तबा मुस्लिम तीर्थ स्थलों को धार्मिक पर्यटन सर्किट बनाने के लिए 100 करोड़ रुपये के बजट की मंजूरी देने पर माननीय मुख्यमंत्री श्री अशोक जीगहलोत का तेहदिल से शुक्रिया)", "The ad lists Muslim places of worship in Jodhpur, Nagaur, Ajmer, Jhalawar, Jhunjhunu, Sikar and Sambhar. Out of these, Jodhpur’s Tanha Peer Dargah has been highlighted in the largest font. Additionally, the ad’s header and footer list images of senior Congress leaders and names of individuals.", "Multiple Twitter and Facebook users posted a cropped version of the ad and claimed that Rs 100 crore was allocated for one dargah. Right-wing influencers Major Surendra Poonia (Retd), Rishi Bagree and @IOpposeConvrsn posted this ad.", "“Hindus are collecting funds for Ram Mandir door-to-door. And on the other hand, the Rajasthan government has approved Rs 100 crore for one dargah. In the future, this dargah will be used to plot the ruin of Hindus,” is the most common message used to share the advertisement.", "[Translated from: राम मंदिर के लिये हम हिन्दू घर-घर जाकर धन जोड़ रहें हैं। और दूसरी तरफ राजस्थान सरकार ने एक दरगाह के लिए 100 करोड़ रुपए दे दिए। आगे चलकर इसी दरगाह में हिंदुओं की बर्बादी की दुआ मांगी जाएगी।]", "This fact-check is split into three sections that answer the following questions:", "Rajasthan budget 2021-22", "According to the 2021-22 budget of the Rajasthan Finance Department, point 213 on page 74, Rs 100 crore is indeed allocated to the Religious Tourist Circuit. However, the sum is shared between Hindu, Jain, Sikh and Muslim communities. The community-wise breakdown of the number of projects under the Religious Tourist Circuit plan is given below. The budget does not mention community-wise allocation.", "Thus, Rs 100 crore isn’t allocated just for Muslim places of worship but it is the entire budget for all religious sites under the Religious Tourist Circuit.", "BJP supporters post misleading claim", "Major Surendra Poonia (Retd), Rishi Bagree and @IOpposeConvrsn posted the image of the ad that excludes the bottom section which lists names of people. This may lead some readers to mistaken the ad for an official advertisement published by the Rajasthan government.", "The ad on Rajasthan Patrika extends gratitude to Chief Minister Gehlot for initiating the project. It also lists names at the bottom, possibly of those who endorsed the ad.", "Who published the ad?", "Department of Information and Public Relations data lists the ads published by the Rajasthan government in various media outlets. There is no reference to the Rajasthan Patrika ad. Avinash Ajey, advertisement head at Rajasthan Patrika, told Alt News, “I cannot comment on the authenticity of the ad nor reveal who published this.” The image below compares an advertisement by the Rajasthan government with the one published on Rajasthan Patrika. The government ad carries the state emblem.", "Alt News spoke with a religious head of one of the places of worship mentioned in the ad, the administrator of a Jodhpur-based Facebook page dedicated to Congress and a member of Congress whose name is mentioned in the ad. They confirmed that a majority of the names mentioned are members of Congress.", "The ad’s header (below) shows images of senior Congress leaders/ officer bearers. Their identities are (from left to right) – MLA Mahendra Chaudhary, CM Gehlot’s son Vaibhav Gehlot, former chairman of Jodhpur Development Authority Rajendra Singh Solanki, MLA Manisha Panwar, Jodhpur mayor Kunti Deora Parihar, Adbul Karim Jhony and former municipal leader and Tanah Peer Dargah committee chairman Chotu Ustad whose name is the first one in the footer.", "Ustad told Alt News that the people listed at the bottom collectively paid for this advertisement. He added, “I have not designed the ad. It was made by a local ad agency. We paid about Rs 65,000 for the ad.”", "A misleading ad, endorsed by Congress members, was published in Rajasthan Patrika. While the ad says that the Rajasthan government allocated Rs 100 crore for Muslim places of worship in the latest budget, the sum is to be shared between four religious communities. A cropped version of the misleading ad was used to further the false claim on social media that Rs 100 crore was approved for only one dargah.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "A purported video of a Muslim man beating a temple priest with a bat is…", "A picture depicting the Pakistani flag apparently bigger in size and apparently placed higher than…", "Amid the ongoing war between Israel and Hamas, a video of a fleet of cars…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "A clip featuring Pakistan men’s Cricket team captain Babar Azam is viral on social media…"]