["By Angelo Fichera", "Posted on January 31, 2020", "Online headlines falsely claim that Virginia lawmakers want to make criticizing state officials a “criminal offense.” The bill doesn’t create new offenses. It would merely allow cases of threats or harassment against some state officials to be prosecuted in Richmond.", "Viral headlines peddled by multiple websites have warned that a bill in Virginia’s state legislature would make a “criminal offense” out of criticizing the state’s elected officials.", "Actually, the bill in question doesn’t create any new criminal offenses.", "A review of the proposed state legislation, House Bill 1627, shows that the bill would make changes to where certain crimes against public officials can be prosecuted, but it doesn’t change the existing statutory offenses.", "The bill proposes several amendments to the law that would make it so that cases of threats or harassment against certain state officials — or threats against some state-owned property — could be prosecuted in the state capital of Richmond, regardless of where such messages were sent or received. Under the current law, some of the statutes contain language that says such prosecutions can occur in locales where the communication was made or received.", "Here’s what the bill proposes:", "Eugene Chigna, a legislative aide for the bill’s sponsor, Democratic Delegate Jeff Bourne, told FactCheck.org that the bill stems from concerns about jurisdiction raised by the Virginia Capitol Police, which protects state officials and capitol properties. Some of the existing statutes explicitly state that such cases can prosecuted where the communication is made or received, which isn’t always known.", "“Capitol Police has no way of knowing where they were when [someone] received that threat,” Chigna said in a phone interview.", "Asked about the legislation, Joe Macenka, a spokesman for Virginia’s Capitol Police, said in an email: “Evolving technology makes it increasingly difficult for investigators to establish where potential threats originate or are received, hampering the Division of Capitol Police in its duties to serve and protect all three branches of government.”", "Macenka said the “legislation creates no new offenses, but helps ensure that prosecution of alleged threats is always possible by establishing an alternative venue that can be used where venue otherwise cannot be clearly established.”", "Andrew Block, an associate law professor at the University of Virginia and director of its State and Local Government Policy Clinic, reviewed the bill for us and came to the same conclusion.", "In an email, Block said the “statutory changes merely clarify that Richmond is an additional jurisdiction where the case be prosecuted when the victim of the threat or harassment is one of a number of specifically enumerated state officials or employees. The proposed legislation does not create any new crimes.”", "Websites such as Big League Politics, Law Enforcement Today, 2nd Amendment Daily News, and others, told a different story.", "“Virginia Democrats Push Legislation to Make Criticism of Government Officials a Criminal Offense,” reads the Big League Politics headline, shared nearly 10,000 times on Facebook, according to CrowdTangle data.", "The Law Enforcement Today story — titled “Virginia politicians push bill to make criticizing state leaders criminal offense” — was shared on Facebook almost 43,000 times and amassed more than 285,000 engagements.", "The Big League Politics story goes on to claim that the “[l]anguage in the bill explicitly criminalizes free speech, in what would constitute a blatant attack on the 1st Amendment of the Constitution.”", "It then repeats language from the legislation, but fails to note that the bill was citing the existing statute regarding harassment by computer. That statute reads: “If any person, with the intent to coerce, intimidate, or harass any person, shall use a computer or computer network to communicate obscene, vulgar, profane, lewd, lascivious, or indecent language, or make any suggestion or proposal of an obscene nature, or threaten any illegal or immoral act, he shall be guilty of a Class 1 misdemeanor.”", "Apart from a negligible wording change of “shall be guilty” to “is guilty,” the proposed bill would make only the jurisdictional change we explained earlier — allowing for such harassment of some state officials and employees to be handled in Richmond.", "Other websites — including one called Reformation Charlotte — similarly misrepresented existing law as something new.", "The misinformation’s spread was aided by well-followed Facebook pages, including one for Republican state Sen. Amanda Chase, who posted an erroneous message that the bill is “effectively criminalizing dissent” against state officials and later shared the Reformation Charlotte article. We reached out to Chase’s office and did not hear back.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "Chigna, Eugene. Legislative aide, office of Virginia Delegate Jeffrey Bourne. Phone interview with FactCheck.org. 27 Jan 2020.", "Commonwealth of Virginia. “§ 18.2-60. Threats of death or bodily injury to a person or member of his family; threats of death or bodily injury to persons on school property; threats of death or bodily injury to health care providers; penalty.” Code of Virginia. Accessed 29 Jan 2020.", "Commonwealth of Virginia. “§ 18.2-60.1. Threatening the Governor or his immediate family.” Code of Virginia. Accessed 29 Jan 2020.", "Commonwealth of Virginia. “§ 18.2-83. Threats to bomb or damage buildings or means of transportation; false information as to danger to such buildings, etc.; punishment; venue.” Code of Virginia. Accessed 29 Jan 2020.", "Commonwealth of Virginia. “§ 18.2-152.7:1. Harassment by computer; penalty.” Code of Virginia. Accessed 29 Jan 2020.", "Macenka, Joe. Spokesman, Virginia Capitol Police. Email to FactCheck.org. 28 Jan 2019.", "Block, Andrew. Associate law professor, University of Virginia. Email to FactCheck.org. 31 Jan 2020.", "Virginia General Assembly. “House Bill No. 1627, A BILL to amend and reenact §§ 18.2-60, 18.2-60.1, 18.2-83, 18.2-152.7:1, and 18.2-430 of the Code of Virginia, relating to threats and harassment of certain officials and property; venue.” (as introduced 16 Jan 2020)", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]