["President Donald Trump speaks during a coronavirus task force briefing at the White House, Saturday, April 4, 2020, in Washington. (AP Photo/Patrick Semansky)", "Trump blames Wisconsin Democrats for any potential social distancing violations on Election Day", "But Democrats do not “run” Wisconsin -- they control only one of three branches of government.", "And it was the Democratic governor who wanted to stop the in-person election. Republicans blocked that.", "Images from Wisconsin’s bizarre election on April 7, 2020, show lines stretching for hundreds of yards outside polling places around the state, with voters spaced out six feet apart.", "But many people reported social distancing was impossible to maintain throughout the voting process, with people at times bunching closer together.", "President Donald Trump was asked how the Wisconsin election — which he encouraged voters to turn out for — lined up with social distancing recommendations from his administration to stem the spread of the coronavirus. The question came up at his daily briefing on Election Day.", "\"Well, there you have to ask the people that,\" Trump said. \"You have a Democrat in Wisconsin as governor. Ask him. That's his problem. Okay? He should be doing it. Again, some governors fail, and I won't let them fail, because when they fail, I'll help. But that's run by Democrats right now. Okay? It's run by Democrats.\"", "So Trump deflects a question about social distancing in Wisconsin by saying the state is \"run by Democrats.\"", "Let’s take a minute to review who’s in charge here.", "We’ll start with this: Wisconsin hasn’t been run by Democrats since 2010. That’s the last time Democrats held the governor’s office and both houses of the Legislature.", "Republicans established their own trifecta in 2011, and maintained it until 2019, when Democratic Gov. Tony Evers was sworn in after defeating Republican incumbent Scott Walker.", "Since then, Wisconsin government has been defined by this split power, with Evers and the Legislature warring over matters big and small.", "The lack of unity was on full display leading up to the election, as Evers first pushed for a mail-in election with a May deadline, then tried to move the election back to June through an executive order. Republican leaders adjourned a special session on the mail-in option within seconds, then went to the Wisconsin Supreme Court to oppose the executive order — where the high court ruled in Republicans’ favor.", "We’ll note that court is currently a 5-2 conservative majority.", "So to recap the three branches:", "Yes, Wisconsin’s highest office is held by a Democrat.", "But the Legislature is strongly Republican — a 19-14 majority in the Senate and a 63-36 majority in the Assembly.", "And the state Supreme Court has a strong conservative bent as well, though it could move a notch pending the outcome of the race between Justice Daniel Kelly, who was backed by Republicans, and challenger Jill Karofsky, who was backed by Democrats.", "Asked whether Wisconsin is properly observing national social distancing guidelines in light of the election, Trump said to ask the Democrats who \"run\" Wisconsin.", "Trump is right that a Democrat, Evers, holds the state’s highest office. But Republicans control the other two branches.", "And the pre-election battles illustrated exactly how divided Wisconsin is, as Republicans thwarted two different attempts to alter or delay in-person voting. That makes Trump’s central point — that Democrats are to blame for any social distancing violations — all the more off base.", "So we are left with a statement that contains an element of truth but ignores critical facts that would give a different impression. That’s our definition of Mostly False.", "Rev.com, Trump briefing transcript, April 7, 2020", "Ballotpedia, Party control of Wisconsin state government, accessed April 8, 2020", "National Conference of State Legislatures, 2020 State & Legislative Partisan Composition, April 1, 2020", "Tony Evers, Executive Order #73, April 3, 2020", "Tony Evers, Executive Order #74, April 6, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]