["By Eugene Kiely", "Posted on May 22, 2017 | Updated on May 23, 2017", "Newt Gingrich claimed that a Democratic National Committee staffer “apparently was assassinated” after “having given WikiLeaks something like … 53,000 [DNC] emails and 17,000 attachments.” But there’s no evidence for his claim.", "The former Republican House speaker is spreading a conspiracy theory about the killing of Seth Rich, who was shot to death in Washington, D.C., in the early morning hours of July 10, 2016, in what local police have described as a likely botched robbery.", "The unsubstantiated claim about Rich’s murder got legs recently after Fox 5 in Washington, D.C., reported — and a day later largely retracted — that the FBI completed a forensic report on Rich’s computer and found that he had transferred 44,053 DNC emails and 17,761 attachments to WikiLeaks.", "Fox 5 aired those details on the morning of May 16, based on the work of a private investigator, Rod Wheeler, who was hired by a third party with the consent of Rich’s family. But later that evening, Wheeler told Fox News’ Sean Hannity that he had no evidence that Rich was in contact with WikiLeaks.", "“Maybe it is related to the DNC. We don’t know that. We don’t know that for sure,” Wheeler told Hannity. “It could have been a botched robbery.”", "CNN also reported on May 16 that Wheeler had no firsthand knowledge that Rich had been in contact with WikiLeaks. Wheeler told CNN that he got that information from another reporter at Fox News.", "Fox 5 issued an “update” the next day that quoted Wheeler as saying there was a “miscommunication” between him and the local TV news station on whether he had anonymous FBI sources who confirmed that Rich had contacted WikiLeaks before his death.", "Fox 5, May 17: In an interview Monday, Wheeler told FOX 5 DC he had sources at the FBI confirming there was evidence of communication between Seth Rich and WikiLeaks. This is the verbatim of that exchange:", "FOX 5 DC: “You have sources at the FBI saying that there is information…”", "WHEELER: “For sure…”", "FOX 5 DC: “…that could link Seth Rich to WikiLeaks?”", "WHEELER: “Absolutely. Yeah. That’s confirmed.”", "In the past 48 hours, Rod Wheeler has told other media outlets he did not get his information from FBI sources, contradicting what he told us on Monday.", "Since Rod Wheeler backtracked Tuesday, FOX 5 DC attempted incessantly to communicate with him, but he didn’t return calls or emails.", "On Wednesday, just before our newscast, Wheeler responded to our requests via a telephone conversation, where he now backtracks his position and Wheeler characterizes his on-the-record and on-camera statements as “miscommunication.”", "Fox 5 also published a statement from the Rich family that read, in part: “As we’ve seen through the past year of unsubstantiated claims, we see no facts, we have seen no evidence, we have been approached with no emails and only learned about this when contacted by the press. Even if tomorrow, an email was found, it is not a high enough bar of evidence to prove any interactions as emails can be altered and we’ve seen that those interested in pushing conspiracies will stop at nothing to do so.”", "Even though Wheeler and Fox 5 had already backed down from the original story, Gingrich repeated the disputed facts several days later on May 21 on “Fox and Friends.”", "Gingrich has served as an informal adviser to Trump, and his wife, Callista, has been nominated by Trump to be the U.S. ambassador to the Vatican. Gingrich made his remarks about Rich’s murder while discussing the Department of Justice’s appointment of former FBI Director Robert S. Mueller III as special counsel to investigate any possible collusion between the Trump campaign and the Russian government’s efforts to influence the 2016 presidential election.", "The Georgia Republican discounted U.S. intelligence reports that say hackers working for the Russian government accessed the Democratic Party computers and gave DNC emails to WikiLeaks in an effort to help Trump win the election. Gingrich said that “it turns out, it wasn’t the Russians,” but rather the DNC staffer who leaked the documents — echoing a tweet two days earlier by the Russian embassy in London.", "Gingrich, May 21: At the same time, we have this very strange story now of this young man who worked for the Democratic National Committee, who apparently was assassinated at 4 in the morning, having given WikiLeaks something like 23,000 — I’m sorry, 53,000 emails and 17,000 attachments. Nobody is investigating that. And what does that tell you about what was going on? Because it turns out, it wasn’t the Russians. It was this young guy who, I suspect, was disgusted by the corruption of the Democratic National Committee. He’s been killed, and apparently nothing serious has been done to investigate his murder. So I’d like to see how Mueller is going to define what his assignment is, and if it is only narrowly Trump the country will not learn what it needs to learn about foreign involvement in American politics.", "Rich’s murder remains unsolved, and has been the subject of conspiracy theories for many months — fueled in part by WikiLeaks offering a reward of $20,000 to solve the case.", "In a Jan. 6 report, the Office of the Director of National Intelligence said: “Russian President Vladimir Putin ordered an influence campaign in 2016 aimed at the US presidential election.” Among other things, the report said, Russian intelligence services gained access to Democratic National Committee computers, from July 2015 to June 2016, and released hacked material to WikiLeaks and other websites. WikiLeaks founder Julian Assange has denied Russia was the source of the DNC emails.", "Beginning July 22, 2016, WikiLeaks released 44,053 DNC emails and 17,761 attachments — the same number of emails and attachments that Fox 5 had claimed in its May 16 report that Rich transferred to WikiLeaks through Gavin MacFadyen, a friend and mentor of Assange. MacFadyen died in October.", "But, as we have already noted, the Fox 5 story quickly unraveled. The Washington Metropolitan Police Department issued a statement the same day saying that “the assertions put forward by Mr. Wheeler are unfounded.”", "Brad Bauman, a Democratic communications consultant who serves as a spokesman for the Rich family, told us that the FBI is not investigating Rich’s murder — further undermining the premise of the Fox 5 report. “The FBI is not now and has never been a party to this investigation,” he said.", "Bauman also said that the Washington Metropolitan Police Department did review the contents of Rich’s personal laptop, but found “no apparent communications with anyone who was associated with WikiLeaks.” The laptop has since been returned to the family, he said.", "The Washington Metropolitan Police Department initially described the incident as a botched robbery based on the evidence at the time, according to a first-day story of the murder in the Washington Post.", "Washington Post, July 11: Acting D.C. Police Capt. Anthony Haythe, head of the homicide unit, said detectives are examining several recent robberies in the area to determine whether any can be linked. There were two robberies in the city in the hour preceding the shooting, both more than one mile away. Three people were robbed at gunpoint and another person was carjacked within four days in June on Flagler Place, near where Rich was shot. Police report 20 armed holdups in Bloomingdale so far this year, compared with eight at this time in 2015.", "Bauman said the status of the investigation has not changed. “There never has been any indication that Seth Rich’s murder had anything to do with his job” at the DNC, said Bauman, who told us he is representing the Rich family pro bono after Rich’s parents reached out to two of Rich’s friends for help in dealing with media requests.", "We don’t know who killed Seth Rich or why. We do know, however, that Gingrich’s speculation about the case is unfounded. There is no evidence to support the claim that Rich leaked DNC emails to WikiLeaks or that he was murdered for it. And the news report that claimed to have “tangible evidence” to prove it has been walked back by the very people who promoted it and reported it.", "Update, May 23: Fox News on May 23 removed from its website an article about the Fox 5 report on Seth Rich’s murder and a video of an interview that Fox News’ Sean Hannity did with Rod Wheeler. We linked to the Hannity interview in this story and have replaced the expired link with an archived link.", "In a statement, Fox News said, “On May 16, a story was posted on the Fox News website on the investigation into the 2016 murder of DNC Staffer Seth Rich. The article was not initially subjected to the high degree of editorial scrutiny we require for all our reporting. Upon appropriate review, the article was found not to meet those standards and has since been removed.”", "Also, the Washington Metropolitan Police Department responded to some of our questions after we posted this article. The police department confirmed that the FBI is not involved in the Rich murder investigation, but declined to say if any law enforcement agency has examined the contents of Rich’s computer and emails.", "The police also provided us with a statement that read: “At this point in the investigation, it is believed that Seth Rich was the victim of an attempted robbery. The assertions put forward by Mr. Wheeler are unfounded. The Metropolitan Police Department’s (MPD) Homicide Branch is actively investigating Mr. Rich’s murder and we continue to work with the family to bring closure to this case as we do with all homicide investigations. If there are any individuals who feel they have information, we urge them to call us at 202-727-9099 or text us at 50411. The department is offering a reward of up to $25,000 for information on this case that leads to the arrest and conviction of the person or persons responsible.”", "FactCheck.org Rating:", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]