["About this rating", "Raging public debate in mid-June 2018 over who precisely allowed for the separation of families at the United States border and subsequent detention of children (despite the fact that Attorney General Jeff Sessions first announced the plans in April 2018, just weeks before the practice began) led to a number of rumors about the policy's origin:", "MadCanuk, this is only happening to illegal immigrants. And for those outradged, this law was passed in 2002 in the Senate by a vote of 90-9. The likes of Clinton, Feinstein, Schumer, Biden, Ried all voting in favor of it - Public Law 107 - 296 pic.twitter.com/P9lCB58OPV", "— Thomas F (@Squawk1200) June 19, 2018", "@TheView Read Public Law 107-296. Passed on November 25 , 2002 by DEMOCRATS. Not Donald Trump. He is enforcing the laws as written and people are whining. Put on your Patriotic Panties and read the laws that PROTECT our country and be thankful our President enforcing the law", "— Dawn (@addiesgamu) June 19, 2018", "@BinghamtonNow actually Public Law 107-296 , Nov 25, 2002 subtitle E does detail separation and placement of unaccompanied children. Mother Jones has claimed 70,000 unaccompanied children enter the nation each year.", "— Michael Vass (@MVConsult) June 19, 2018", "One versions of that rumor was shared by the Facebook page Uncle Sam's Misguided Children on 19 June 2018. In meme form the page shared a screenshot of what was purportedly the text of Public Law 107-296, captioned: \"HERE IT IS. PASSED BY THE DEMOCRATS. ENOUGH OF THE LIES, DECEIT, & FAKE NEWS[.]\"", "Obscured in the meme was the full title of Public Law 107-296, \"H.R.5005 — Homeland Security Act of 2002.\" A primary claim of the meme was that the legislation in question was passed \"by the Democrats\"; in fact, the bill was passed by the 107th Congress in November 2002. The 107th Congress met from 3 January 2001 until 2 January 2003, during which time the September 11th attacks occurred in 2001. On the date of Public Law 107-296's passage (25 November 2002), Senate.gov provided its majority as Republican, not Democrat:", "Majority Party (November 12, 2002 - January 3, 2003): Republican (50 seats)", "Minority Party: Democrat (48 seats)", "Other Parties: 2", "Total Seats: 100", "The bill's sponsor was Rep. Richard Armey of Texas (a Republican). The bill had 118 co-sponsors, of whom 114 were Republicans and four were Democrats. Neither metric (majority or bill sponsors) indicated the bill was passed \"by Democrats.\"", "Who passed the law was part of the meme, the other being a suggestion that Public Law 107-296 mandated the separation of children from their parents at the border. The screenshot featured depicted the tail end of the portion titled \"Subtitle E—Citizenship and Immigration Services\" (highlighted), and the following \"Subtitle F—General Immigration Provisions.\" The section depicted pertained to \"SEC. 451. ESTABLISHMENT OF BUREAU OF CITIZENSHIP AND IMMIGRATION SERVICES,\" which broadly established a Bureau of Citizenship and Immigration Services\" within the Department of Homeland Security:", "(a) ESTABLISHMENT OF BUREAU.—\n(1) IN GENERAL.—There shall be in the Department [of Homeland Security] a bureau to be known as the \"Bureau of Citizenship and Immigration Services\".", "In March 2003, United States Citizenship and Immigration Services (USCIS) and U.S. Immigration and Customs Enforcement (ICE) were formed to carry out the enforcement provisions of Public Law 107-296 (Homeland Security Act of 2002). The provisions of the law were broadened in scope after the bill was passed.", "The snapshot displayed the \"definitions\" portion of Subtitle E (the italicized part was not shown in the meme):", "(3) TRANSFER AND ALLOCATION OF APPROPRIATIONS AND PERSONNEL.—The personnel of the Department of Justice employed in connection with the functions transferred by this section, and the assets, liabilities, contracts, property, records, and unexpended balance of appropriations, authorizations, allocations, and other funds employed, held, used, arising from, available to, or to be made available to, the Immigration and Naturalization Service in connection with the functions transferred by this section, subject to section 202 of the Budget and Accounting Procedures Act of 1950, shall be transferred to the Director of the Office of Refugee Resettlement for allocation to the appropriate component of the Department of Health and Human Services. Unexpended funds transferred pursuant to this paragraph shall be used only for the purposes for which the funds were originally authorized and appropriated.", "(g) DEFINITIONS.—As used in this section— (1) the term \"placement\" means the placement of an unaccompanied alien child in either a detention facility or an alternative to such a facility; and (2) the term \"unaccompanied alien child\" means a child who—\n(A) has no lawful immigration status in the United States;\n(B) has not attained 18 years of age; and\n(C) with respect to whom—\n(i) there is no parent or legal guardian in the United States; or\n(ii) no parent or legal guardian in the United States is available to provide care and physical custody.", "Simply put, Subtitle E of Public Law 107-296 (establishing the Department of Homeland Security, DHS) placed immigration and related functions in the scope of the newly established agency. Section G of Subtitle E defined the term \"unaccompanied alien child\" as a minor under the age of 18, lacking lawful immigration status in the US, and primarily, an individual for whom \"there is no parent or legal guardian in the United States\" or \"no parent or legal guardian in the United States is available to provide care and physical custody.\" This did not mandate that children be separated from their families, but instead, created a legal classification for children with no parent or guardian present or for whom no parent or legal guardian was available to provide care and custody.", "Debate surrounding Public Law 107-296 was ill-defined, with many simply sharing the screenshot as a vague indication the policy of family separation came before the debate about it in May and June 2018. Many attributed its passage to Democrat lawmakers. However, the bill was passed in November 2002 under a Republican majority, and it simply defined an \"unaccompanied alien child\" as one with no available parent or guardian. It made no provision for separating a child from parents or legal guardians or for detaining any child separated by DHS agencies from their parent, and it was primarily passed by Republicans.", "107th Congress.   \"H.R.5005 - Homeland Security Act Of 2002.\"\r\n    November 2002.", "United States Senate.   \"Party Division, 107th Congress.\"\r\n    Accessed 19 June 2018.", "DHS.gov.   \"Public Law 107–296.\"\r\n    25 November 2002.", "Wikipedia.   \"107th United States Congress.\"\r\n    Accessed 19 June 2018.", "Wikipedia.   \"United States Citizenship And Immigration Services.\"\r\n    Accessed 19 June 2018.", "Wikipedia.   \"U.S. Immigration And Customs Enforcement.\"\r\n    Accessed 19 June 2018.", "Wikipedia.   \"Homeland Security Act.\"\r\n    Accessed 19 June 2018.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]