["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A segment hosted by CNN’s Don Lemon on May 18, 2017, got a little heated. Lemon and one of his guests, conservative radio host Dennis Prager, sparred over an apparent increase in anti-Semitic incidents after the 2016 presidential election, and who was to blame.", "Prager said there was no rise in anti-Semitic incidents, and the incidents that did occur didn’t have anything to do with Donald Trump.", "\"It was a 100 percent lie that his election unleashed anti-Semitism,\" Prager said. \"Hundreds of Jewish community centers had bomb threats called in. To the best of our knowledge to this day, 90 percent of them were called in by an American Jewish kid living in Israel, and the other 10 percent were a black radical who was trying to impress his girlfriend.\"", "Is he correct? We found that Prager has a point about the bomb threats to Jewish community centers largely being the work of two suspects who have since been arrested. However, there is evidence that the number of anti-Semitic incidents other than bomb threats did increase after the election. (Prager did not respond to email inquiries.)", "The suspects", "To date, the FBI announced two arrests related to the bomb threats. (We should note that the two individuals cited below have not been tried yet.)", "The first came on March 3, when the U.S. Attorney’s office for the Southern District of New York announced a charge of cyberstalking against a St. Louis man, Juan Thompson. Thompson was charged with \"allegedly stalking a former romantic interest by, among other things, making bomb threats in her name to Jewish Community Centers and to the Anti-Defamation League.\"", "The Justice Department said that Thompson appeared to have made \"at least eight of the JCC threats as part of a sustained campaign to harass and intimidate\" his victim.", "Prager was wrong that Thompson tried to impress a girlfriend; he is charged with trying to implicate an ex-girlfriend in crimes she didn’t commit.", "As for calling him a \"black radical,\" that’s a somewhat subjective. The Riverfront Times, a St. Louis newspaper, said that as a black journalist, Thompson had filed \"searing dispatches about injustices in Baltimore, Mississippi and Chicago. He relished the opportunity to strike back at what he calls an ‘oppressive, anti-black, racial supremacist, capitalist system’ that kneecaps all but the country's rich and white in the pursuit of basic civil rights and opportunities.\"", "Then, on April 21, the Justice Department announced that charges had been filed against Michael Ron David Kadar, an 18-year-old resident of Israel with dual citizenship in the United States and Israel. The charges in question were for making telephone bomb threats against Jewish facilities in central Florida and for providing false information to police in Georgia.", "Then-FBI director James Comey said in a statement that \"this kind of behavior is not a prank, and it isn't harmless. It’s a federal crime. It scares innocent people, disrupts entire communities, and expends limited law enforcement resources.\"", "So Prager’s on target when he cites Thompson and Kadar as the two individuals charged so far with making Jewish community center bomb threats.", "The bomb threats", "Somewhat less certain is the total number of threats called in to Jewish community centers.", "As we noted, officials have tied Thompson to eight calls. Meanwhile, the criminal complaint against Kadar alleged that between Jan. 4 and March 7, Kadar made \"at least 245 telephone calls involving bomb threats and active shooter threats. A significant portion of the threats targeted Jewish community centers and other historically Jewish institutions such as Jewish schools and Anti-Defamation League offices.\"", "The FBI declined to comment further to PolitiFact, citing the ongoing investigation. So the exact number of threats the two individuals made -- once duplicate calls and calls made to non-Jewish targets are set aside -- is hard to nail down.", "However, the number of calls they made appears to be in the ballpark of the number of reported bomb threats. It’s not certain that threats numbered in the \"hundreds,\" as Prager said, but if not, they weren’t far off.", "The Southern Poverty Law Center, a group that tracks hate crimes, has tracked upwards of 170 such threats made internationally and domestically. And the Anti-Defamation League -- another group that tracks hate crimes, and which was a target of a number of the calls in question -- has identified 167 such threats in the United States in Canada. (The ADL’s tally did not count other countries, as the SPLC did.)", "Given this data, Prager has a point that most of the bomb threats are traceable to the two individuals who have been charged so far, and he’s also correct that Kadar has been charged with making many more than Thompson.", "Aryeh Tuchman, associate director of the Anti-Defamation League’s Center on Extremism, said that there are probably a modest number of bomb threats not traceable to either of these two suspects. \"The two individuals that Prager mentioned accounted for the vast majority of the bomb threats, but not all of them,\" Tuchman said.", "That said, Tuchman added one further piece of evidence that Thompson and Kadar account for the vast bulk of threats: \"Thankfully, there have been no further bomb threats recently,\" he said.", "Anti-Semitic incidents more broadly", "But if Prager has described the situation with the Jewish community center bomb threats with reasonable accuracy, he has engaged in a bit of cherry-picking by ignoring other signs of increased anti-Semitism after the election.", "\"Even if the bomb threats are discounted, we still saw an increase in anti-Semitic incidents in the first quarter of 2017,\" Tuchman said. \"Not including the bomb threats, there were 380 total incidents in the first quarter of 2017, up from 291 incidents in the first quarter of 2016. That’s an increase of 31 percent.\"", "Incidents in 2016 cited by ADL include instances of harassment (such as voice mails or social media attacks), vandalism (such as graffiti) and assault (including one incident in which two shots were fired at a victim’s vehicle).", "Tuchman added that the number of incidents in December 2016 were almost 70 percent higher than the number of incidents in December 2015.", "Tuchman cautioned that ADL \"believes that the presidential campaign was a factor in the increase in anti-Semitic incidents, but only one factor.\"", "But even if the election was only one factor among many, the rise in anti-Semitic incidents overall call into question Prager’s assertion that it’s a \"100 percent lie that his election unleashed anti-Semitism.\"", "Our ruling", "Prager said, \"It was a 100 percent lie that his election unleashed anti-Semitism. … Hundreds of Jewish community centers had bomb threats called in. To the best of our knowledge to this day, 90 percent of them were called in by an American Jewish kid living in Israel, and the other 10 percent were a black radical who was trying to impress his girlfriend.\"", "He’s close to the mark in describing the overwhelming role of two suspects in making bomb threats against Jewish targets earlier this year. However, Prager ignores a documented rise in anti-Semitic incidents beyond bomb threats. We rate his statement Half True.", "Dennis Prager, remarks in an interview with CNN’s Don Lemon, May 18, 2017", "Justice Department, \"Cyberstalking Charge Brought In Manhattan Federal Court Against Missouri Man For A Pattern Of Harrassment Involving Threats To Jewish Community Centers,\" March 3, 2017", "Justice Department, \"U.S./Israeli Man Charged in Connection with Threats to Jewish Community Centers, Conveying False Information, and Cyberstalking,\" April 21, 2017", "Criminal complaint against Juan Thompson, March 1, 2017", "Criminal complaint against Michael Ron David Kadar, April 21, 2017", "Anti-Defamation League, \"Bomb Threats to Jewish Institutions in 2017,\" March 15, 2017", "Anti-Defamation League, \"Domestic Anti-Semitism: Selected Incidents Across the Country in 2016,\" April 20, 2017", "New York Times, \"Jewish Center Bomb Threat Suspect Is Arrested in Israel,\" March 23, 2017", "CNN, \"Jewish community center bomb threat suspect charged in US as investigation continues,\" April 24, 2017", "New York Times, \"Ex-Reporter Charged With Making Bomb Threats Against Jewish Sites,\" March 3, 2017", "Newsweek, \"In College, Bomb Threat Suspect Juan Thompson had 'Affinity for Jews,' \" March 5, 2017", "Slate.com, \"Disgraced Left-Wing Reporter Charged With Making Several JCC Threats in Plot to Frame Ex-Girlfriend,\" March 3, 2017", "Riverfront Times, \"Juan Thompson Wrote About St. Louis for the National Media. But Were Any of His Stories True?\" Feb 24, 2016", "Email interview with Rebecca Sturtevant, spokeswoman for the Southern Poverty Law Center, May 22, 2017", "Email interview with Aryeh Tuchman, associate director of the Anti-Defamation League’s Center on Extremism, May 22, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]