["“In fact, the diaspora is the largest contributor [to] our foreign exchange.”", "“[Remittances contributed] upwards of maybe KSh290 billion last year.”", "“It is a constitutional requirement… that when the president is away, the deputy president must be in the country.”", "“We have built a standard-gauge railway [of] 600 kilometres... in the last five years.”", "“[The railway] has been in the books of our government for 30 years – it was not built.”", "“We have connected 6.9 million people to electricity in the last five years.”", "“For 50 years only 2.3 million Kenyans were connected to electricity.”", "“We have constructed 7,000 kilometres of tarmac in the last five years – 12,000 kilometres were constructed in 50 years.”", "“The number of people on health insurance [has increased] from 3 million to 7 million in a record five years.”", "Please complete this form to receive the HTML sharing code.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "For democracy to function, public figures need to be held to account for what they say. The claims they make need to be checked, openly and impartially. Africa Check is an independent, non-partisan organisation which assesses claims made in the public arena using journalistic skills and evidence drawn from the latest online tools, readers, public sources and experts, sorting fact from fiction and publishing the results.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "© 2023 - Africa Check - All rights reserved.", "We will never charge you for verified, reliable information. Help us keep it that way by supporting our work.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "Support independent fact-checking in Africa."]