["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "In this May 21, 2020, file photo provided by the Michigan Office of the Governor, Michigan Gov. Gretchen Whitmer speeks during a news conference in Lansing, Mich. (AP)", "An image claims to prove that Gov. Gretchen Whitmer’s family spent May 20 at their second home in Elk Rapids, Mich.", "Until late April, Whitmer’s stay-at-home order prohibited Michiganders from traveling to their vacation homes within the state, to prevent the spread of the coronavirus.", "Whitmer spent May 20 in Midland, Mich., site of a major flood.", "Some Facebook users say they have proof that Michigan Gov. Gretchen Whitmer isn’t following her own stay-at-home order.", "On May 20, conservative radio host Randy Bishop posted an image that shows two cars outside a blue house and a garage. In the caption, he claimed it was taken that afternoon at Whitmer’s \"‘UpNorth Cottage’ in Antrim County.\"", "\"Evidently Gov. Whitmer's ‘Stay Home, Stay Safe’ executive orders DON'T apply to HER family!!!\" Bishop wrote.", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "(Screenshot from Facebook)", "Since Whitmer, a Democrat, has been the target of several hoaxes about her handling of the coronavirus pandemic, we wanted to check out this Facebook post, too.", "We did not find definitive proof that the photo was taken on May 20, but the photo did not appear online prior to that date. The governor’s office says Whitmer was not at her second home on May 20. We reached out to Bishop for his evidence, but we haven’t heard back.", "An executive order signed by Whitmer that went into effect mid-April prohibited people from traveling between two residences. Although she has extended her stay-at-home order through June 12, the provision banning travel to second homes within the state has been dropped.", "\"Michiganders may travel between their residences, but I still strongly discourage people from doing so unless it is absolutely necessary,\" Whitmer said in late April. \"We ask that you consider not doing that.\"", "Whitmer lives in the governor’s mansion in Lansing, but her primary residence is in East Lansing, according to her 2018 financial disclosure. The document also lists a \"family lake house\" in Elk Rapids, a town in northern Michigan.", "A May 20 article from the Gateway Pundit appears to back up Bishop’s claim that Whitmer’s family spent the afternoon at their lake house. The conservative website researched the license plate on the black Chevrolet Tahoe in the photo and found that it belongs to Marc Mallory, Whitmer’s husband.", "\"Gretchen and Marc were at their summer home today,\" the Gateway Pundit wrote.", "That’s inaccurate, according to the Michigan governor’s office.", "\"The governor was in Midland to tour the devastating flood damage and meet with first responders as they evacuated thousands of people to safety,\" a spokeswoman told PolitiFact in an email. \"She then returned to her home in Lansing.\"", "Media reports confirm that Whitmer spent May 20 in Midland. The next day, she held a press conference in Lansing about the state’s coronavirus response.", "There is some evidence that Mallory could have been at the couple’s home in Elk Rapids.", "Using public records searches and Google Earth, we confirmed that the car in the Facebook photo belongs to Mallory and the house is the family’s property on Birch Lake.", "The Detroit News reported that the owner of NorthShore Dock LLC, a company near Birch Lake, said in Facebook posts that Mallory had called to try to get his boat in the water before Memorial Day weekend. The posts, which have since been deleted, attracted the ire of Republican state lawmakers, who say Whitmer’s family may not be following her own stay-at-home guidance.", "We asked the governor’s office about the veracity of the Facebook posts, but we haven’t heard back. Whitmer said Tuesday that Mallory’s call to the dock company, during which he asked if his status as the governor’s husband would help get his boat in the water, was a joke.", "\"He thought it might get a laugh,\" Whitmer said. \"It didn't, and to be honest I wasn't laughing either when it was relayed to me because I knew how it would be perceived.\"", "Regardless, there is no evidence that Whitmer spent the afternoon of May 20 at her house in Elk Rapids. And even if she did, it would not have violated her current stay-at-home order.", "The Facebook post is inaccurate. We rate it False.", "Antrim County Parcel Search, accessed May 26, 2020", "Antrim County Register of Deeds, accessed May 26, 2020", "C-SPAN, \"Michigan Governor Whitmer Coronavirus News Conference,\" May 21, 2020", "Detroit Free Press, \"Senator alleges cover-up over boat dock incident involving Whitmer's husband,\" May 26, 2020", "Detroit Free Press, \"Whitmer says husband's boat dock request was bad joke: 'I wasn't laughing either,’\" May 26, 2020", "The Detroit News, \"Purported Northern Michigan boat launch request fuels controversy for Whitmer,\" May 25, 2020", "The Detroit News, \"Whitmer extends stay-at-home order through June 12,\" May 22, 2020", "Facebook post, May 20, 2020", "Fox 47, \"What you should know about the Michigan Governor's Mansions,\" Nov. 9, 2018", "The Gateway Pundit, \"CONFIRMED: Governor Whitmer Begs Michiganders Not to Travel to their Summer Home — Then Her Cars Are Seen Parked Outside of HER SUMMER HOME!\" May 20, 2020", "Google Earth, accessed May 26, 2020", "Michigan Governor Gretchen Whitmer, Executive Order 2020-42 (COVID-19), accessed May 26, 2020", "Michigan.gov, 2018 Whitmer Financial Disclosure, accessed May 26, 2020", "MLive.com, \"Gov. Whitmer addresses Midland after dam break and flooding: ‘We’re gonna get through this,’\" May 20, 2020", "Suncalc, accessed May 26, 2020", "Weather Underground, accessed May 26, 2020", "WZZM, \"Whitmer extends stay-home order through May 15, eases rules,\" April 24, 2020", "9&10 News, \"Gov. Whitmer Visits Flood Site In Midland County,\" May 20, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]