["By Angelo Fichera", "Posted on July 28, 2020", "An image on social media falsely purports to show a tweet from Donald Trump in 2009, saying he “would never let thousands of Americans die from a pandemic while in office.” There is no evidence Trump ever posted that tweet.", "Critics of President Donald Trump have at times turned to his old tweets in a bid to contrast his words from the past with his actions as president.", "A supposed screenshot of such a tweet circulating on Facebook, however, shows a message that Trump never posted regarding how he would respond to a pandemic if president.", "“Obama’s handling of this whole pandemic has been terrible! As President, ALL responsibility becomes yours during a crisis like this, whether or not you’re entirely to blame,” the fictitious tweet, dated Nov. 23, 2009, reads. “John McCain, and for that matter myself, would never let thousands of Americans die from a pandemic while in office.”", "We could find no evidence that Trump ever posted the tweet in question — or even any tweet mentioning “pandemic,” “Obama,” or “McCain” in 2009. McCain was the Republican nominee for president in the 2008 election.", "In fact, Trump joined Twitter in March 2009 and he posted only 56 tweets that year, according to the Trump Twitter Archive. Ten years later, in 2019, he tweeted 7,781 times (including retweets).", "Trump has in recent months misleadingly compared the novel coronavirus pandemic with the H1N1 “swine flu” pandemic, which killed an estimated 12,469 people in the U.S. between April 2009 and April 2010. On Twitter, he’s called the Obama administration’s handling of that pandemic a “total disaster” or “disaster” more than once.", "The bogus Trump tweet is circulating as the U.S. grapples with a rising death toll from COVID-19, the disease caused by the novel coronavirus. There have been more than 148,000 deaths related to COVID-19 reported in the U.S.", "The fictitious post has circulated since at least April. One link to the image has been shared (including recently by a page that says its mission is to “call out the hypocrisy of the GOP”) more than 26,000 times, according to CrowdTangle analytics data.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "“2009 H1N1 Pandemic (H1N1pdm09 virus).” Centers for Disease Control and Prevention. 11 Jun 2019.", "“Coronavirus in the U.S.: Latest Map and Case Count.” New York Times. 28 Jul 2020.", "McDonald, Jessica. “Trump Misleads on H1N1 Swine Flu Testing.” FactCheck.org. 16 Jul 2020.", "McDonald, Jessica and Lori Robertson. “Trump’s H1N1 Swine Flu Pandemic Spin.” FactCheck.org. 13 Mar 2020.", "Trump Twitter Archive. Trumptwitterarchive.com. Accessed 27 Jul 2020.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]