["The video is captioned “Rain falling in one spot… Our God is a God of rain” and shows the Akosombo-Tema road in southeast Ghana, according to a voice off camera.", "One car in the video has a “GH” Ghanaian registration plate and another has a sticker from Ghana. It is unclear who shot the video.", "A voice off-camera describes the sight as “unbelievable”, while gospel music plays in the background.", "The video has been shared more than 1.3 million times on that Facebook page, after it was first posted on September 12, 2016. It was still being shared in January 2019.", "Underneath, there were positive and surprised reactions and more than 30 thousand comments, including many discussing the merits of religion.", "The same video, with the same claim that rain is falling on one spot, has also been posted on YouTube and numerous Facebook pages.", "Most of the video cuts off just below the tip of the spouting water but when the tip is apparent, it is clear that the water starts falling to the ground from below cloud level and is not falling from the sky.", "Another video, posted the previous day, appears to show the same spouting water, with the same scenery of short green trees, a pile of earth and grass around it, shot from a different angle. That video was posted by Israel Laryea on Facebook and shared 149 times.", "Through Laryea's posts, AFP was able to contact Ashong Mawufemor, who recorded and posted the second video in 2016 while travelling to a festival in Agotime, eastern Ghana.", "\"I was travelling and then I saw it and I was like, let me pull over and check what it was. I realised it was a water pipe that was burst,\" Mawufemor said.", "The burst was around three and a half metres high, he estimated.", "\"Before I left the scene, there were officers from Ghana Water Company on the scene to check, so it wasn't rain coming from the sky.\"", "\"I've passed by that place a couple of times and they have fixed it,” he added.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]