["About this rating", "Invitations have been issued for Trump’s send-off from Joint Base Andrews which will occur hours before Biden takes his oath of office. Reports indicate Trump wanted an elaborate ceremony with a 21-gun salute. Congress members called on the Pentagon to reject Trump's request for \"fanfare, pageantry.\" Defense officials told one news outlet that no military farewell is being prepared for Trump.", "As of this writing, details about Trump’s morning send-off from the base are unknown.", "In January 2021, in the days leading up to the inauguration of U.S. President-elect Joe Biden, Snopes readers asked about the nature of incumbent President Donald Trump's planned send-off from Washington, D.C. While some reports indicated that Trump was anticipating and had requested a full military farewell, other reports claimed that defense officials had rejected Trump's requests for an armed forces farewell.", "We know that Trump will not be attending Biden's inauguration, opting instead to depart Washington, D.C. in a separate event hours before the actual ceremony. The White House had already sent invitations out for an event that would be held at Joint Base Andrews, the military base in Maryland used by Air Force One, at 8 a.m. on Jan. 20, 2021. Reporting from The Guardian, and CNN indicated that Trump wanted an elaborate ceremony, including a military style send-off, complete with a 21-gun salute.", "Copies of the official White House invitation were shared on Twitter by reporters:", "As of this writing, details of this event are not yet known to the public. But according to CNN, Trump was \"eagerly anticipating his military-style send-off [...] one of the few items that have cheered him up recently.\" According to ABC News, Trump wanted all the pomp and fanfare: \"Sources familiar with the planning tell ABC News he wants to have a military-style sendoff [...] complete with a military band and a red-carpet walk flanked by troops as he boards Air Force One for the last time, and even possibly a flyover by Air Force fighter jets.\"", "According to two senior defense officials, speaking anonymously to Defense One, a news outlet focused on national security and U.S. defense, \"no military farewell is being planned for the commander in chief.\" This report did not confirm whether the Pentagon outright rejected a request from the outgoing president for a full military farewell.", "Democratic Rep. Sheila Jackson Lee, and a number of other members of Congress, submitted a letter to the Pentagon on Jan. 16, 2021, expressing \"our strong objection to any diversion of the resources and personnel needed to secure the ceremonies at the U.S. Capitol.\" They continued, \"media reports indicate the current president is planning to depart Washington, D.C. [...] to great fanfare, pageantry, pomp, and circumstance.\" They asked Gen. Mark A. Milley, Chairman of the Joint Chiefs of Staff, \"we urge you to take every action that is appropriate that will result in the cancellation of the current President's planned course of action.\"", "In a Jan. 17 tweet, Lee said that in response to their letter, \"the Pentagon rejects President Trump's request for a military-style farewell hours before President-Elect Biden's inauguration.\"", "Numerous news reports indicate that Trump wanted an elaborate military send-off from Washington, D.C. but may not get one due to widespread opposition. Details about the Jan. 20 event have not been released, and military officials have only spoken anonymously to one outlet.", "On the day of the inauguration, Trump did receive a 21-gun salute from four U.S. Army cannons.", "We thus rate this claim as \"Mostly True.\"", "Jan. 20, 2021: Updated to reflect that Trump did receive a 21-gun salute.", "Jan. 20, 2021: Headline updated to past tense.", "Nur Nasreen Ibrahim is a reporter with experience working in television, international news coverage, fact checking, and creative writing.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]