["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "There is no evidence that President Barack Obama, Oprah Winfrey, Ellen Degeneres or Hillary Clinton are on house arrest for “child trafficking” crimes.", "The images in the post are obscured, altered or miscaptioned.", "A Facebook post shares a bogus conspiracy theory that claims certain \"elite\" or Hollywood figures, like former President Barack Obama and Oprah Winfrey, are involved in child trafficking rings.", "The post shares a collage of photos that include Obama and Winfrey, as well as Hillary Clinton and Ellen DeGeneres. Text above the photo says, \"Elite/Hollywood figures on house arrest with ankle monitors, due to child trafficking crimes.\"", "The post attempts to prove this by revealing that all are wearing ankle bracelets in the images.", "But some of the photos are obscured, while others were digitally altered. One image accurately shows ankle wear on Obama, but it’s not a house arrest monitor.", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "First, there is no evidence that Obama, Winfrey, DeGeneres or Clinton are involved in child trafficking and none have been arrested, or placed on house arrest, for any crime.", "The photos of DeGeneres and Winfrey are both obscured and show bulges underneath their pants, near their ankles. This is far from proving these are house arrest monitors, and we couldn’t track down the original images. Winfrey also addressed false rumors in March that she had been arrested.", "The photo of Hillary Clinton was taken in 2014 in the Hamptons. The Facebook post’s version was digitally altered to include a device on her right leg. Clinton is not wearing any kind of bracelet or monitor, on either leg, in the original photo or in other photos from that day.", "The photo of Obama shows him paddle boarding in January 2020 in Hawaii. The bracelet on his ankle is real, but it’s not a house arrest monitor. The device is called a \"SharkBanz,\" which uses technology to deter a shark attack. (Note: It’s difficult to be on house arrest and also paddleboard in Hawaii).", "We rate this Pants on Fire!", "Facebook post, June 16, 2020", "Twitter, Oprah tweet, March 18, 2020", "Vanity Fair HOW A QANON CORONAVIRUS CONSPIRACY ABOUT OPRAH WENT VIRAL, March 18, 2020", "Daily Mail, A straw visor and muumuu for Hillary and SoulCycle shorts for Bill: Relaxed Clintons enjoy some downtime on the beach with their dogs, Aug. 8, 2014", "People.com, Barack Obama Takes Shirtless Paddle Board Ride During Hawaii Vacation, Jan. 4, 2020", "SharkBanz.com, Accessed June 18, 2020", "PopCulture, Barack Obama Paddle Boards Shirtless, Takes Tumble and Falls Off, Jan. 4, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]