["The BP oil spill in the Gulf of Mexico was still an accident waiting to happen when Ron Johnson rose to address a political rally last fall, months before he formally entered the U.S. Senate race as a Republican.\n\nBut the spill would make oil a key issue in many Senate races, including in Johnson’s bid for the seat held by Democratic U.S. Sen. Russ Feingold. And oil company profits have long been a debating point between the parties.\n\nIn his speech, Johnson spoke in defense of oil industry profits and against candidates who criticize the big oil companies. He said the industry’s success fuels further exploration -- and its stock helps fund the retirement accounts of millions of Americans.\n\n\"How many times have you heard a politician attack Big Oil and Big Pharma as if these were some kind of evil enterprises preying on our society?\" Johnson said at the rally. \"Why do they do this?  Well, I guess it sounds good to some people, and might help them get elected in some districts. But I can guarantee you, it does nothing to help our country.\n\n\"I don’t know about you, but I want businesses to succeed ... I want oil companies to make enough money to continue to explore, drill, refine and deliver gas to virtually every corner of America.\n\n\"Almost everyone's 401(k) or retirement fund owns stock in these companies.  And I hope everyone realizes that both the state and federal governments make more per gallon in gas taxes than the oil companies make themselves for doing all the work.\"\n\nSo is Johnson on the money regarding the government’s take of gasoline sales?\n\nHis campaign offers evidence from the American Petroleum Institute, the national trade group representing oil and gas companies. An institute report released in August suggests that, per dollar of sales, gas taxes are more than double the net income earned by the largest oil companies.\n\nBut Stephen Comstock, API’s manager of tax policy, steered PolitiFact Wisconsin away from the institute’s own per-gallon breakdown. He said it could be confusing and might not be appropriate for assessing the notion that gas taxes exceed profits.\n\nComstock suggested the U.S. Energy Information Administration, a federal agency that compiles tax and revenue data about the biggest oil companies.\n\nTheir numbers aren’t a perfect fit for the Johnson claim, in part because they include profits from products other than gasoline. But government and private researchers say they are the best available.\n\nWe found that Johnson’s equation holds up in some years but is off base in others. The reason: Industry profits fluctuate wildly with the price of crude oil. We examined U.S. profits as well as the total net profits including foreign sales.\n\nHere’s the scorecard:", "In individual years, the range can be wide. In down years, gas taxes paid by the industry -- and passed along to drivers at the pump -- can exceed even combined US-foreign profits by 100 percent (1999). In boom times, U.S. profits alone can top gas taxes paid by almost 40 percent (2006).\n\nA 2010 study by the Tax Foundation, a conservative research organization, went back even further. It found that excise taxes collected from the industry outstripped combined foreign and domestic profits in 12 of the 28 years reviewed.\n\nSo let’s take stock.\n\nJohnson’s timing was good: When he gave his speech, taxes the year before came in higher than U.S. profits by the big companies. That 2008 comparison is the latest available on the federal website. But he didn’t put a time frame on his statement, stating the equation as a timeless fact. And if you include foreign profits, it’s not on target even for 2008. The reality is it depends on the year, which is an important detail. We rate Johnson’s statement Half True.", "Ron Johnson, speech, Oshkosh Tea Party rally, October 10, 2009", "Interview with Stephen Comstock, manager of tax policy, American Petroleum Institute, Aug. 20, 2010.", "E-mail interview with Sara Sendek, press secretary, Ron Johnson campaign, Aug. 19, 2010", "American Petroleum Institute, Energizing America: Facts for Addressing Energy Policy, Aug. 16, 2010", "Tax Foundation, Oil Industry Taxes: A Cash Cow for Government, July 28, 2010", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]