["Des Moines Public Schools custodian Joel Cruz cleans a teacher's desk in a classroom at Brubaker Elementary School, Wednesday, July 8, 2020, in Des Moines, Iowa. (AP)", "Children represent about 7.3% of COVID-19 cases in the U.S and less than 0.1% of deaths, according to the CDC.", "Many children were not exposed to the virus as much as adults because schools shut down nationwide in March.", "Research in other countries that reopened schools shows children can catch COVID-19.", "As millions of parents across the United States agonize over whether their children should return to school, President Donald Trump has continued to downplay the chances that children will catch COVID-19.", "\"This thing is going away, it will go away like things go away. My view is that schools should be open,\" Trump said on Fox and Friends Aug. 5.  \"If you look at children, children are almost, I would almost say definitely, but almost immune from this disease. So few. Hard to believe. I don’t know how you feel about it but they have much stronger immune systems than we do somehow for this. They don’t have a problem.\"", "By the evening, both Facebook and Twitter took action against Trump for his statements about immunity and children which the social media companies said were violations of their policies against COVID-19 misinformation. Facebook took down a post of the Fox video clip on Trump’s official account, with a spokesperson saying it contained false information that violated its standards around harmful COVID-19 misinformation. Twitter, meanwhile, required a Team Trump campaign account to remove the tweet. It appeared that Trump had tweeted the video from his own Twitter account but the video link was dead.", "Trump is using the term \"immune\" to suggest that children won’t get sick. It’s clear that children do get infected, although symptoms are often not as serious as those for older adults. But he’s wrong to state that children are \"almost immune.\"", "\"Children as a group are clearly less impacted by this virus than adults, but to say they are almost immune does not provide a truthful message,\" said University of South Florida public health professor Dr. Marissa J. Levine.", "The data from the U.S. Centers for Disease Control and Prevention shows that children account for about 7.3% of cases. Children account for less than 1% of deaths.", "But that data covers a time period when millions of children stayed home and did their classes online. That means we don’t yet know what will happen when children return to school buildings.", "Although it is early in the school year, there have already been some students who tested positive including in Mississippi and Indiana. It’s unclear how many students will attend in person nationwide, although the majority of the largest school districts have chosen virtual learning.", "Mark Schleiss, a University of Minnesota professor of pediatrics, said Trump is wrong on two counts: his statement about immunity and his suggestion that children are less likely to catch the germ than adults.", "\"Immunity means that your immune system has some sense of history with having encountered the germ before, and hence can fight it off,\" he said. \"Well, what's the biological plausibility that any person would have immunity to a virus that didn't even exist until a few months ago? And how could you have immunity to it if you never even encountered it before? So, as a pediatrician, immunologist and vaccine researcher, the statement is absurd, and unequivocally incorrect.\"", "Schleiss pointed to a research letter published in The Journal of the American Medical Association by Lurie Children’s Hospital of Chicago. Researchers examined 145 cases of mild to moderate COVID-19 illness and found children younger than 5 years have much higher levels of genetic material for the virus in their noses compared to older children and adults. Authors concluded that young children can potentially be important drivers of the virus spread, which causes concern for educators.", "Experts also pointed to the rapid spread of COVID-19 at an overnight camp in Georgia. Test results were available for 344 (58%) attendees; among these, 260 (76%) were positive. While children are in closer proximity to each other at overnight camp than a school, experts say it still serves as a warning about reopening schools.", "\"That is not what we would expect of a group who were ‘almost immune,’\" Levine said.", "Andrew Noymer, an epidemiologist at University of California, Irvine, said Trump has a point in that children get sick at low rates, but his overall statement is misleading. The main fear about reopening schools is how it will spread to teachers and parents.", "\"The idea schools can open and everything is going to be hunky dory, sort of a summary of the president’s intended message, that is misleading,\" Noymer said. \"I am worried kids can catalyze the pandemic even worse than it already is in terms of an engine of generating infection of adults.\"", "The White House pointed to statements by CDC director Robert Redfield in favor of reopening schools and his agency’s guidance on schools, but those statements didn’t address immunity. The White House also pointed to statements by Dr. Scott Atlas that \"children under 18 have virtually zero risk of death from this\" or serious illness. Atlas is a senior fellow at the conservative Hoover Institution at Stanford University and is the former chief of neuroradiology at Stanford University Medical Center.", "Studies about school children and COVID-19 are limited, but research from other countries indicates that high schoolers who come in contact with the disease respond more like adults, while elementary children present a lower risk of spread.", "A recent study out of South Korea looked at more than 1,200 cases of people with COVID-19. It found that the rate of infection was three times higher for children 10 to 19 years old than for children under 10.", "After schools reopened in Israel in late May, outbreaks forced hundreds of schools to close, the New York Times found.", "\"Opening schools, especially for children above the age of 10, in crowded settings, can facilitate transmission,\" Hagai Levine, an epidemiology professor at Hebrew University-Hadassah told PolitiFact. \"Education is a must. So the lesson from Israel is to prepare and look for careful, gradual opening. If possible, learn outdoors.\"", "In its guidelines for schools, the CDC said infection seems to vary by age, with students 10 to 17 being more likely to catch the disease than those under 10.", "Some European countries did have success in reopening schools, but most didn’t reopen school amid a spike of outbreaks like ones in some states in the U.S.", "Experts have warned that we can’t assume the U.S. experience this fall will mirror that of some other countries.", "\"We may learn much more about COVID-19 in children as schools open,\" Levine said. \"That is part of the unknown for which I would be hesitant to conclude with blanket statements about pediatric immunity to COVID-19.\"", "Trump said \"children are almost immune from this disease.\"", "The White House cited a statement by the CDC director in support of schools reopening and a doctor who noted that kids rarely get severe cases, but that doesn’t mean that children are immune to COVID-19. It’s wrong to state that children are \"almost immune\" as we have seen cases spread at an overnight camp in the U.S. and at some schools, including in Israel.", "We rate this statement False.", "Fox and Friends, President Trump talks mail-in voting, 2020 race, COVID-19 response on 'Fox & Friends', Aug. 5, 2020", "President Trump, Tweet, Aug. 5, 2020", "U.S. Centers for Disease Control and Prevention, SARS-CoV-2 Transmission and Infection Among Attendees of an Overnight Camp — Georgia, June 2020", "U.S. Centers for Disease Control and Prevention, Preparing K-12 School Administrators for a Safe Return to School in Fall 2020, Aug. 1, 2020", "U.S. Centers for Disease Control and Prevention, Demographic data, Accessed Aug. 5, 2020", "Education Week, School Districts' Reopening Plans: A Snapshot, Updated Aug. 5, 2020", "New York Times, As the Coronavirus Comes to School, a Tough Choice: When to Close, Aug. 5, 2020", "New York Times, When Covid Subsided, Israel Reopened Its Schools. It Didn’t Go Well. Aug. 4, 2020", "Washington Post, Report: Coronavirus infected scores of children and staff at Georgia sleep-away camp, July 31, 2020", "The Atlantic, Immunology Is Where Intuition Goes to Die, Aug. 5, 2020", "CNN, Trump falsely says kids are 'almost immune' from Covid-19, Aug. 5, 2020", "CNN, Second grader tests positive for coronavirus after attending the first day of school in Georgia, Aug. 5, 2020", "USA Today, Should I send my child back to school? This is the latest science on coronavirus and kids, July 30, 2020", "FOX 13, More students, faculty in an MS school district test positive for COVID-19, Aug. 14, 2020", "The Hill, CDC director: Keeping schools closed poses greater health threat to children than reopening, July 9, 2020", "Washington Post, Facebook, Twitter penalize Trump for posts containing coronavirus misinformation, Aug. 5, 2020", "Facebook, An Update on Our Work to Keep People Informed and Limit Misinformation About COVID-19, April 2020", "Twitter, An update on our continuity strategy during COVID-19, March 16, 2020", "PolitiFact, Are schoolchildren not vectors for COVID-19 as Florida Gov. Ron DeSantis said? July 16, 2020", "PolitiFact, Donald Trump says students don’t catch, spread COVID-19. Studies say it’s not that simple, July 24, 2020", "White House press office, Statement to PolitiFact, Aug. 5, 2020", "Email interview, Mark R. Schleiss, pediatrics professor at University of Minnesota medical school, Aug. 5, 2020", "Email interview, Prof. Hagai Levine, professor of epidemiology, Hebrew University-Hadassah, Aug. 5, 2020", "Telephone interview, Andrew Noymer, UC Irvine associate professor, population health and Disease Prevention Aug. 5, 2020", "Email interview, Dr. Jeffrey Gerber, a member of the American Academy of Pediatrics Committee on Infectious Diseases, Aug. 5, 2020", "Email interview, Aileen M. Marty, Director, FIU Health Travel Medicine Program and Vaccine Clinic Commander, and professor of infectious diseases, Aug. 5, 2020", "Email interview, Marissa Levine, Professor, Director, Center for Leadership in Public Health Practice at University of South Florida, Aug. 5, 2020", "Email interview, Dr. Jakob Armann, Attending Physician Pediatric Infectious Disease Specialist", "University Children’s Hospital Dresden, Aug. 6, 2020", "Facebook, Statement to PolitiFact, Aug. 5, 2020", "Twitter, Statement to PolitiFact, Aug. 5, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]