["About this rating", "On 3 December 2018, a Facebook user posted an outlandish story about a man who had supposedly been living under the Calico Mine Ride at the Knott's Berry Farm amusement park in Buena Park, California. A few days later, he posted a follow-up item claiming that a second man had been arrested for inhabiting the same caverns beneath the attraction:", "Working on information from the 12/2/2018 arrest of a still unidentified man claiming to have lived inside the Mine Ride for 35 years, Orange County Sheriffs deputies and Buena Park Police officers searched an area known as the \"Caverns\" for several hours before locating a second unidentified man.", "\"Working on a tip from our in-custody suspect, we located a second man living in an area of the Caverns that are so deep, they have yet to be explored,\" reported Sheriffs Captain Tony Dominick in a press conference this morning.", "Although this text appeared to contain genuine quotes from police officers and references to genuine news reports, this story was little more than humorous fiction.", "The accompanying mug shots didn't show men who were arrested for anything connected with the Calico Mine Ride or Knott's Berry Farm. The man on the left of the above-displayed graphic was arrested in Manchester, New Hampshire, in 2012 for allegedly stabbing his roommate over a dispute about television volume. The man on the right was arrested in 2017 in Toledo, Ohio, for allegedly chasing a member of his family with a hatchet.", "In addition to the fact that these two mug shots were unrelated to this story, the Facebook user who pposted it admitted in the comments section that his story was a work of fiction:", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]