["A video that shows a team of police officers barging inside a building and arresting some people is widespread on social media with the claim that terrorists were arrested in South Mumbai’s Pydhonie area.", "Several Facebook users have shared the video along with Hindi and English text.", "(Hindi text: साउथ मुंबइ के पाययधुनी ऐरीया से आतंकवादी पकडे गये है..)", "साउथ मुंबइ के पाययधुनी ऐरीया से आतंकवादी पकडे गये है..", "Posted by Ratan Jaiswal on Wednesday, 17 February 2021", "Facebook page Guarding The Valley posted the same video and claimed that the incident took place in Uttar Pradesh where terrorists from Kerala were arrested.", "Alt News received several requests on our WhatsApp helpline number (+917600011160) and on our official Android application to authenticate this claim.", "At the 22-mark in the video, we can see a broad that reads ‘Dr Shaista’s Wellness Clinic’ which is indeed located in Pydhonie.", "Alt News tried calling the clinic on multiple occasions but was unable to connect. We spoke with Mohammad Umer who runs a garment store called Umersons merely 35 meters away from the clinic. Umer told us, “I received the video on my WhatsApp. I could easily recognise the building in which the cops entered. The name of the building is Ismail. A film shoot had taken place on February 14. My acquaintance was present in the area at the time.”", "Pydhonie police constable Sunil Pendkar confirmed the same – “The video doesn’t show a terrorist attack. Instead, it shows a film shoot on February 14. The men and cars shown in the video do not belong to the Mumbai police,” he said. Pendkar further informed Alt News that he doesn’t know the details of the production house but confirmed that prior permission was taken.", "Mumbai-based Facebook user Yaseen Qureshi Jadid Inquilab suggested that the video shows a shooting of a ‘Crime Patrol’ episode. Crime Patrol is a Hindi crime series on Sony Entertainment Television that shows dramatised version of real-life crime cases in India.", "We contacted Inquilab on this phone. He said, “When I wrote Crime Patrol, I meant a web series. I don’t know which production house was involved.”", "Senior PI Subhash Dudhgaonkar Pydhonie police station told Fact Crescendo, “The film shoot took place on February 14. I do not know the name of this web series but we gave them NOC for shooting. This video has nothing to do with the arrest of any terrorist.”", "Thus, a video of an unknown motion picture shooting was shared with the false claim that terrorists were arrested in Mumbai.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "Trigger Warning: Sexual Violence A distressing video of a girl forced to take her clothes…", "A clip featuring Pakistan men’s Cricket team captain Babar Azam is viral on social media…", "A 13-second clip featuring Bollywood actor Shah Rukh Khan is being shared on social media…", "Union minister of information and broadcasting Anurag Thakur on September 26 announced Waheeda Rehman as…"]