["The video can be seen in this February 11, 2019 Facebook post by Siasat24.com, a Pakistani media website that has more than 40,000 followers on Facebook.", "The 45-second video shows a failed rocket launch -- a projectile soaring into the sky before gradually turning upside down and falling and then exploding on the ground.", "The Urdu-language caption of the post translates as: “The successful test of India's latest missile. All Pakistanis got worried. Laughing is not allowed”, followed by two laughing and a surprised face emoji.", "The video has been viewed at least 224,000 times since it was posted on Facebook February 11, 2019. The post has also been shared on other social media, for example here on Twitter.", "A reverse image search, however, shows that the footage actually shows the failed launch of Russia’s Proton-M rocket at its Baikonur cosmodrome in Kazakhstan on July 2, 2013.", "There are multiple media reports about the unsuccessful rocket launch from 2013, for example a report here on Space Daily on the explosion, and reports here from Russia Today and here from DNI about what caused the accident.", "Here is the video of the incident posted on Russia Today's official YouTube account:", "There are also multiple videos on YouTube shot by eyewitnesses at the scene and uploaded in July 2013, such as here and here.", "The eyewitness videos have been shot from different angles, but the same rocket launch trajectory as features in both the misleading footage and the RT footage can clearly be seen.", "The footage used in the misleading video is a cropped version of the footage from Tsenki, Russia's state space infrastructure company.", "Below is the Tsenki footage of the disaster, which was posted on YouTube by Martin Vit on May 19, 2014. The Tsenki logo can clearly be seen in the upper right hand corner of the video:", "Below are comparisons between Russia Today’s footage of the July 2, 2013 Proton-M rocket launch failure and the footage used in the misleading Facebook post, demonstrating that the two videos depict the same incident:", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]