["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Lt. Gov. Dan Patrick told a national TV audience after the May 2018 Santa Fe High School shootings that he doesn’t see a need for more gun regulation in that Texas already bars children from having loaded weapons.", "We decided to check Patrick's reference to law given that the admitted Santa Fe shooter reportedly used his father’s shotgun and handgun in the attack. Our research identified the 1995 law, though we also learned it wouldn’t apply to the Santa Fe incident due to the shooter’s age of 17.", "Patrick, taking questions from George Stephanopoulos on the May 20, 2017, edition of ABC's This Week, said: \"We have to look at ourselves, George. It’s not about the guns. It’s about us. Can there be gun regulation?", "\"Gun control, I believe, starts at home, George. Every person who owns a gun must be accountable for their guns at home,\" Patrick said. \"We don’t know all the facts yet. But this particular young man got his guns in some way from his parents’ home. You should have your guns locked up. It’s against the law in Texas to let any loaded gun get in the hands of a child, for example.\"", "Law confirmed", "Our online search for such a law led us to a web page about preventing Texas children from getting guns created by the San Francisco-based Giffords Law Center to Prevent Gun Violence. That page says Texas has a law holding a person criminally liable if he or she, \"with criminal negligence,\" fails to secure a \"readily dischargeable\" firearm and a child under age 17 gains access to it.", "Next, we turned to section 46.13 of the Texas penal code, titled \"Making a Firearm Accessible to a Child,\" which defines a readily dischargeable firearm as one \"loaded with ammunition, whether or not a round is in the chamber.\"", "The law states:", "\"A person commits an offense if a child gains access to a readily dischargeable firearm and the person with criminal negligence:", "(1)  failed to secure the firearm;  or", "(2)  left the firearm in a place to which the person knew or should have known the child would gain access.\"", "Under the law, \"secure\" means \"to take steps that a reasonable person would take to prevent the access to a readily dischargeable firearm by a child, including but not limited to placing a firearm in a locked container or temporarily rendering the firearm inoperable by a trigger lock or other means.\"", "The law otherwise provides defenses to prosecution starting with whether the child’s access was supervised by a person older than 18 and the firearm was for hunting, sporting \"or other lawful purposes.\"", "Under the law, a violation is a Class C misdemeanor or a Class A misdemeanor \"if the child discharges the firearm and causes death or serious bodily injury to himself or another person.\"", "Legislative history", "Legislative records show the legislation creating the law won approval in 1995, the same year that then-state Sen. Jerry Patterson, R-Pasadena, shepherded into law the state's concealed-carry measure.", "We connected with Patterson, who told us by email that the child-specific proposal, initiated by Rep. Al Edwards, D-Houston, had momentum that year in part due to testimony by a Houston couple who had lost their son to an accidental shooting. The boy’s mother, Linda Tarr, testified at the time: \"This bill is to save children. It  is not a gun-control bill. This is a gun-responsibility act, and children are our responsibility.''", "Effective law?", "We also wondered about the law’s effects.", "The April 1995 Austin American-Statesman news story where we spotted Tarr’s testimony said that in 1993, 42 children younger than 17 had been killed in accidents involving firearms.", "There have lately been fewer such deaths, according to figures we requested from the Texas Department of State Health Services. Spokesman Chris Van Deusen emailed us a chart indicating that in 2014-15, 11 Texas children younger than 17 were killed in accidents involving firearms.", "Separately, Ari Freilich, a lawyer for the Giffords center, said by email that Texas is among 27 states with child access prevention laws potentially making adults legally accountable for letting minors gain unsupervised access to guns.", "But Freilich called the Texas law weaker than laws in some states because it only applies to adults who leave readily operable loaded firearms accessible to unsupervised minors. \"As a result, Texas' law would likely not apply even if an adult left an unsupervised minor home alone with an unloaded firearm out on the table right next to a box of ammunition,\" Freilich wrote.", "Also, Freilich said, the Texas law wouldn't apply to what evidently happened at Santa Fe High School because the admitted shooter was 17--and the law applies only to guns taken by minors 16 or younger.", "After the Santa Fe shootings, the center posted a memo to Texas Gov. Greg Abbott stating the law should be amended, at the least, to apply to minors under 18 \"and to cases where an adult leaves unloaded firearms and ammunition accessible to the minor.\"", "We also asked the NRA-tied Texas State Rifle Association about the law. By phone, Alice Gene Tripp praised it, saying: \"It doesn’t try to criminalize how you store your guns. It simply puts a penalty in statute if you don’t do it effectively. Texas allows adults to make adult decisions and penalizes those who don’t do it correctly.\"", "Our ruling", "Patrick said: \"It’s against the law in Texas to let any loaded gun get in the hands of a child.\"", "A 1995 state law makes it a misdemeanor if a person with criminal negligence fails to secure a loaded gun and a child younger than 17 accesses it or if a person leaves the gun where he or she knew or should have known the child would get it.", "We rate this claim True.", "TRUE – The statement is accurate and there’s nothing significant missing. Click here for more on the six PolitiFact ratings and how we select facts to check.", "Video of interview of Lt. Gov. Dan Patrick by George Stephanapoulous, This Week, ABC News, May 20, 2018 (comment about Texas law starts about the 2:50 mark)", "Web page, \"Child Access Prevention in Texas,\" Giffords Law Center to Prevent Gun Violence, last updated Nov. 3, 2017", "Texas law, chapter 46 of the Texas penal code, \"Weapons,\" including section 46.13, \"Making a Firearm Accessible to a Child,\" Texas Legislature Online, undated (accessed May 25, 2018)", "Emails, Ari Freilich, staff attorney & California legislative affairs director, Giffords Law Center to Prevent Gun Violence, May 25, 2018", "Policy memo, \"Policy Recommendations to Address Gun Violence in Texas,\"", "Phone interview, Alice Gene Tripp, legislative director, Texas State Rifle Association, May 25, 2018", "Legislation, final version of House Bill 44 and \"Actions,\" 1995 regular legislative session, Texas Legislature Online (accessed May 25, 2018)", "Report, bill analysis of committee substitute for HB 44, 1995 legislative session, House Research Organization, March 29, 1995", "Emails, Jerry Patterson, May 25-26, 2018", "News story, \"Senate panel passes gun-safety bill; Senate panel passes gun bill to protect children,\" Austin American-Statesman, April 28, 1995 (American-Statesman electronic archives)", "Emails, Chris Van Deusen, director of media relations, Texas Department of State Health Services, May 29, 2018", "Chart, \"Accidental Firearm Deaths for Children 16 and Under, Texas Residents, 2000-2015,\" Texas Department of State Health Service, May 29, 2018 (received by email from Chris Van Deusen)", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]