["House Speaker Nancy Pelosi, D-Calif., arrives for her weekly news conference at the Capitol on March 11, 2021. (AP)", "• The imbalance toward the top 1% will only reach 83% by 2027, due to the expiration of several important middle-income tax cuts and a change in how inflation is calculated.", "• Prior to that, the share taken by the top 1% through 2025 is much smaller, at roughly 20% to 25%.", "House Speaker Nancy Pelosi, D-Calif., recently revived a longstanding Democratic criticism of the tax bill signed in 2017 by President Donald Trump.", "In a March 14 interview on ABC’s \"This Week,\" host George Stephanopoulos pressed Pelosi on a possible future infrastructure bill. Pelosi said she wanted to be \"fiscally sound\" in assembling such a bill, and drew a contrast with the Republican tax bill of 2017.", "An infrastructure bill, she said, would be \"job-creating, which creates revenue that comes back to the Treasury, unlike what the (Republicans) did with their tax scam in 2017, which gave 83% of the benefits to the top 1% percent and indebted our children to the tune of nearly $1.9 trillion. ... So they should be the last people to be talking about what is too expensive for the American people as we meet their needs.\"", "But Pelosi’s talking point — that the GOP tax bill \"gave 83% of the benefits to the top 1%\" — is one that we have found fault with time and again over the past three years.", "An analysis of the final version of the tax bill by the nonpartisan Urban Institute-Brookings Institution Tax Policy Center found that by 2027, the tax bill would deliver 82.8% of its benefits to the top 1% of the income spectrum.", "However, in earlier years, the distribution of benefits looks very different.", "For instance, in 2018, according to the center’s analysis, the bill was projected to deliver 20.5% of the benefits to the top 1% — vastly less than the 83% figure that Pelosi cited. And as late as 2025, the center projected, 25.3% of the benefits would flow to the top 1%.", "The main reason: By 2027, a number of key tax provisions that benefit middle-income taxpayers will have expired unless Congress extends them. In addition, the new tax law changed how inflation was calculated, in a way that will be less generous to taxpayers as time goes on.", "\"How much of the benefit of the tax bill goes to the top 1% income group greatly depends on what year you are looking at,\" Joseph Rosenberg, a senior research associate at the Tax Policy Center, told PolitiFact in 2018.", "In an inquiry for this article, Pelosi’s office didn’t dispute our prior analysis but argued that the Republican focus on the wealthiest 1% can be seen in what parts of the tax cuts they chose to make permanent.", "\"Republicans chose to ensure that the permanent legacy of their tax bill would be benefits overwhelmingly flowing to the wealthiest 1% instead of working families,\" said Pelosi’s communications director, Henry V. Connelly. \"This is a defining feature of the legislation, because Republicans had a choice and decided to make other portions of the bill permanent but not those that would benefit working people instead of corporations and the wealthiest few.\"", "Pelosi said the Republican tax bill passed in 2017 \"gave 83% of the benefits to the top 1%.\"", "That’s the case in 2027, due to the expiration of several important middle-income tax cuts and a change in how inflation is calculated. However, through 2025, the share of benefits going to the top 1% is much smaller, at roughly 20% to 25%. Pelosi has cherry-picked by focusing on the tax bill’s impact by 2027, rather than the impact for the nearly a decade leading up to then.", "We rate the statement Half True.", "Nancy Pelosi, interview on ABC’s \"This Week,\" March 14, 2021", "Urban Institute-Brookings Institution Tax Policy Center, \"Distributional Analysis of the Conference Agreement for the Tax Cuts and Jobs Act,\" Dec. 18, 2017", "PolitiFact, \"DNC offers one-sided view on who gets tax bill's benefits,\" Jan 16, 2018", "Email interview with Joseph Rosenberg, senior research associate with the Urban Institute-Brookings Institution Tax Policy Center, Jan. 16, 2018", "Email interview with Henry V. Connelly, Nancy Pelosi’s communications director, March 15, 2021", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]