["Sen. Jay Rockefeller, D-W.Va., recently wrote an opinion piece for the Capitol Hill newspaper\n\nRoll Call\n\nin which he said, \"Insurance companies have seen their profits soar by more than 400 percent since 2001, while premiums for consumers have doubled.\" We address the first part of this statement in another\n\nitem\n\n; we'll take up the second half here.\n\n\nThe 2009 Employer Health Benefits Survey, published by the Kaiser Family Foundation and the Health Research and Educational Trust, is considered the definitive source for health benefits cost information, and its data stretch from 1999 to 2009. (Even though Rockefeller didn't explicitly say it, we'll assume he was talking about the period since 2001 when he made this assertion.)\n\n\nIn 2001, average annual premiums for single people were $2,689, a number that rose to $4,824 by 2008 — a 79 percent increase. The amounts for family coverage rose over the same period from $7,061 to $13,375 — an 89 percent increase.\n\n\nSo, in neither case did the cost of benefits actually double, although they are in the ballpark. However, if you read Rockefeller's language closely, he did say, \"premiums for consumers have doubled\" — and if you use the data for the employee-paid portion of health benefits by itself, he's right.\n\n\nFor individuals, the employee cost rose from $355 to $779 and for families it rose from $1,787 to $3,515. The former jump is easily double, while the latter is just shy of double. Using this calculation, Rockefeller is right. We rate his assertion True.", "Sen. Jay Rockefeller, \"An Opportunity We Can’t Pass Up,\" Roll Call\n\ncolumn\n\n, Sept. 21, 2009\n\n\nKaiser Family Foundation/Health Research & Educational Trust, \"Employer Health Benefits 2009 Annual Survey\" (\n\nexhibit 1.12\n\n, average annual premiums for single and family coverage, 1999-2009), Sept. 15, 2009\n\n\nKaiser Family Foundation/Health Research & Educational Trust, \"Employer Health Benefits 2009 Annual Survey\" (\n\nexhibit 6.3\n\n, average annual worker and employer contributions to premiums and total premiums for single coverage, 1999-2009), Sept. 15, 2009\n\n\nKaiser Family Foundation/Health Research & Educational Trust, \"Employer Health Benefits 2009 Annual Survey\" (\n\nexhibit 6.4\n\n, average annual worker and employer contributions to premiums and total premiums for family coverage, 1999-2009), Sept. 15, 2009\n\n\nInterview with Alex Lawson, health care researcher at Campaign for America's Future, Oct. 7, 2009\n\n\nE-mail interview with Chris Lee, Kaiser Family Foundation spokesman, Oct. 7, 2009", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]