["About this rating", "In the days after American right-wing extremists attacked the U.S. Capitol on Jan. 6, 2021, social media users circulated the below-displayed tweet that alleged U.S. President Donald Trump was \"strongly considering\" pardoning the dozens of right-wing extremists who faced criminal charges in the deadly insurrection.", "The Jan. 9 tweet included a screenshot of what appeared to be a post on Parler, the right-wing social media app that Amazon, Apple, and Google pulled from their respective services on Jan. 11 due to its connection to the Capitol siege.", "Trump's Acting Pardon Attorney Rosalind Sargent-Burns supposedly authored the Parler post, asking people to list their names, cities of residence, and crimes for which they deserved a pardon in connection to the attack attempting to halt a ceremonial vote affirming President-elect Joe Biden's 2020 election win.", "\"The President needs this list by TUESDAY before the House can vote to impeach again,\" the post read. \"We are trying to stay off the MSM (mainstream media) so the left does not learn of the President's plan.\"", "More than 70 people faced charges and prosecutors opened at least 170 cases in connection to the deadly attack, Michael Sherwin, the U.S. attorney for the District of Columbia, told reporters on Jan. 12.", "However, the post alleging a scheme by Trump to help them was fake. Members of the Office of the Pardon Attorney, who include Sargent-Burns and answer to the U.S. Department of Justice, do not have a social media presence on any platform, including Parler.", "A DOJ spokesperson said in a Jan. 9 statement after the claim went viral:", "Please be advised that the information circulating on social media claiming to be from Acting Pardon Attorney Rosalind Sargent-Burns is inauthentic and should not be taken seriously.", "The Justice Department’s Office of the Pardon Attorney does not have a social media presence and is not involved in any efforts to pardon individuals or groups involved with the heinous acts that took place this week in and around the U.S. Capitol.", "As of this writing, Parler was inaccessible for Snopes, so we were unable to investigate the origin or reach of the fake post supposedly authored by Sargent-Burns. According to The Associated Press, a group of digital archivists were scraping the website for all public information to put in an archive, but that cache of data was not easily accessible yet.", "We will update this post when, or if, we are able to find more information about the claim that originated on Parler.", "However, considering the statement by the DOJ spokesperson, as well as the fact no other evidence suggested Trump was considering pardoning his supporters who stormed the Capitol, we rate this claim \"False.\"", "Jessica Lee is Snopes' Senior Assignments Editor with expertise in investigative storytelling, media literacy advocacy and digital audience engagement.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]