["About this rating", "In March 2015, the Massachusetts State 911 Department and the Executive Office of Public Safety and Security called attention to a little-known, decades-old feature of the state's 911 system when they posted an infographic about it to social media:", "The 911 Silent Call Procedure, which many state residents were unaware had been implemented back in the 1990s, was created to facilitate communication with emergency responders by callers who could not speak with them due to factors such as physical disability, injury, an impairing medical condition (e.g., choking), or the nearby presence of criminals who might seek to terminate the call and/or harm the caller if they became aware their victim was summoning help:", "Did you know in the 1990's, State 911 established a \"Silent Call\" Procedure?", "Here is how it works: If a Massachusetts dispatcher answers a 911 call and it is silent, they will go through these steps to see if there is a response. You do not have to remember this procedure, they will ask you while on the telephone. The dispatchers screen will show them which numbers are being pressed.", "The procedure, which can be utilized with touch tone landlines and cell phones, enables a caller to \"talk\" to a dispatcher using a telephone keypad.  The dispatcher will ask a caller who doesn't respond verbally to press a key corresponding to the nature of the needed service (1 for police, 2 for fire, and 3 for an ambulance) and will guide that caller through a series of yes/no questions that can also be answered through the keypad (4 for \"yes\" and 5 for \"no\"):", "Dispatchers are trained to ask, \"What is your emergency?\" twice, and to ensure the caller is not using TTY for people who are hard-of-hearing, before initiating the silent call procedure.", "\"(You) try to identify if somebody's at the other end, and then you go into the procedure — the 1-2-3-4-5 procedure — and see what happens,\" said Berskhire County Sheriff's Office dispatcher Joe Racicot.", "Massachusetts implemented the silent call procedure close to 20 years ago, said Monna Wallace, program director at the State 911 Department.", "\"We've done as much public education as possible, but social media has taken it to another level,\" Wallace [said]. \"It has been used with success.\"", "In one case, a young girl — unable to speak because intruders were inside her home — successfully reported the burglary to a 911 dispatcher, Wallace said. Police caught the burglars.", "If a caller neither speaks nor presses buttons, or if a caller hangs up, the dispatcher will send a police officer to the location for a welfare check.", "But the silent call system in Massachusetts gives dispatchers more information up front, allowing them to dispatch emergency medical technicians and firefighters more quickly, officials said.", "Although similar silent 911 procedures may be implemented elsewhere in the U.S. on a local basis, we could not find any indication that such a system has been implemented on a state-wide basis outside of Massachusetts.", "Flamisch, Steve.   Need Help, But Can't Speak?\"\r\n    WNYT.com.   4 March 2015.", "Steele, Brian.   \"911 Silent Call Procedure Can Get You the Help You Need.\"\r\n    MassLive.com.   4 March 2015.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]