["The worksite at the new Oakview Elementary School is full of activity as construction continues Tuesday, December 8, 2015 in Holly Springs, N.C. (News & Observer)", "North Carolina needs new school buildings, but leaders disagree on how to pay for them.", "In December, Republican House Speaker Tim Moore announced his support for putting a $1.9 billion school bond on the ballot in 2020.", "In January, Senate Republicans introduced a pay-as-you-go plan that uses tax revenues — avoiding borrowing and avoiding the ballot.", "In response, Democrats argued that the Senate plan uses money that could go toward other priorities. On Feb. 20, Democratic state Sen. Wiley Nickel took it a step further.", "\"SB5 pays for school construction with teacher pay raises,\" the Cary senator tweeted, referring to the bill number.", "In the same tweet, Nickel then walks back his claim, suggesting teacher pay isn’t immediately affected: \"This plan puts into jeopardy funding for teacher pay raises, classroom supplies, broadband, roads and training for corrections officers.\"", "His tweet then concludes with an image of the words, \"NC teachers shouldn’t have to pay the price for school construction.\"", "Politicians often try to extrapolate negative consequences from legislation they oppose – even if those consequences are unlikely or uncertain. Nickel’s tweet is a prime example of a claim that should raise eyebrows. It suggests elected officials would take money away from teachers (who vote) and put it toward buildings (which don’t vote).", "PolitiFact looked at the bill in question, SB 5, to answer the question: Does it take money earmarked for teacher salaries and put it toward capital projects?", "No. We found no evidence that the bill affects teacher salaries or potential raises.", "A SPECIAL FUND", "The bill calls for using money from the State Capital Infrastructure Fund, a new fund created in 2017 that’s expected to receive 4 percent of tax revenues this year.", "\"Senate Republicans propose increasing the contribution to the fund to 4.5 percent of tax revenue, and letting K-12 schools use some of the money for school construction,\" The News & Observer reported.", "PolitiFact asked the North Carolina Department of Public Instruction whether the bill immediately affects teacher salaries.", "\"We have looked at the bill and the answer to your first question is no. The bill does not use money allocated for educator compensation,\" said Drew Elliot, communications director for NC DPI.", "PolitiFact also asked DPI if the bill could affect teacher salaries in the future. That’s \"difficult to answer without knowing the larger context of a full budget bill,\" Elliot said.", "HYPOTHETICAL SCENARIOS", "Contacted by PolitiFact, Nickel acknowledged that there’s no mention of teacher salaries in the school construction proposal. He said it drains money from the state’s general fund, leaving the state with less money for other projects.", "As Nickel sees it, the Senate GOP plan leaves the state with one of three options in crafting a budget:", "• No teacher pay raises", "• Increase in sales taxes and fees to cover the difference", "• \"More budget cuts to departments that have already endured massive cuts to staff and services under their spending plan.\"", "Nickel isn’t the only one who says he’s worried about the plan affecting future spending. Joe Coletti, senior fellow at the John Locke Foundation, a conservative think tank, told the Carolina Journal that the legislature may choose to use other funds if tax revenues ever decrease.", "However, those predictions and concerns are over hypotheticals. They don’t reflect the immediate impact of the Senate’s plan for funding school construction.", "POLITIFACT RULING", "Nickel said SB 5 \"pays for school construction with teacher pay raises.\" This is a rhetorical point that could be taken literally.", "It’s possible the bill would leave less money for teacher pay raises and other budget priorities. But the bill itself doesn’t directly take money from teacher salaries or divert money away from them. We rate this False.", "This story was produced by the North Carolina Fact-Checking Project, a partnership of McClatchy Carolinas, the Duke University Reporters’ Lab and PolitiFact. The NC Local News Lab Fund and the International Center for Journalists provide support for the project, which shares fact-checks with newsrooms statewide. To offer ideas for fact checks, email [email protected].", "'", "A tweet by Wiley Nickel, state Senator from Wake County.", "An online copy of Senate Bill 5, \"Building North Carolina’s future,\" which was filed on Jan. 30, 3019.", "Email correspondence with Wiley Nickel.", "Email correspondence with Leslie Rudd, spokeswoman for state Senate minority leader Dan Blue.", "Email correspondence with Drew Elliot, communications director for the North Carolina Department of Public Instruction.", "Story by the Carolina Journal, \"State proposes pay-as-you-go school construction plan instead of bonds,\" published Jan. 31, 2019.", "Stories by The News & Observer, \"NC Senate Republicans say this plan will raise $2 billion for school construction,\" published Jan. 30, 2019; \"NC lawmakers rejected a $2B bond for school building. Now they want to bring it back,\" published Dec. 13, 2019.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]