["The video was published here on Facebook on March 23, 2020. It has been viewed more than 42,000 times.", "The three-minute 27-second video shows a group of five Caucasian men singing an acapella version of the Chinese song “Qinghai-Tibet Plateau”.", "Below is a screenshot of the misleading Facebook post:", "The post’s simplified Chinese caption translates into English as: “To express thanks to Chinese people for their help, Italians sang ‘Qinghai-Tibet Plateau’ in Chinese language”.", "As of April 6, the novel coronavirus has killed at least 15,887 people in Italy.", "The video was also shared here, here and here on Facebook, here, here and here on Twitter, and here and here on YouTube, alongside a similar claim.", "The claim is false. A keyword search on Google found an identical video posted on the YouTube channel of a Belarusian band, Clear Voice, on August 26, 2019.", "The video is titled: “Чистый голос - 青藏高原 - Qinghai - Tibetan Plateau - Тибетское плато (a cappella)”.", "The same video was also published on the quintet’s official Instagram account here on August 30, 2019.", "Друзья, спешим поделиться премьерой нового клипа!!!! Тибетское плато 青藏高原 (a cappella) приятного просмотра:)) ?? Полная версия клипа (Full version) ?? https://m.youtube.com/watch?v=KEGpHQhbuzc ???#чистыйголос #chistiygolos #тимбилдинг #концертмечты #мероприятие #шоу #show #голос #музыканты #артисты #живаямузыка #сотрудничество #красиво #вокалмечты #музыка #живойзвук #минск #выступление #фестиваль #искусство", "ЧИСТЫЙ ГОЛОС (@chistiy_golos) 分享的帖子 · PDT 2019 年 8月 30 日 上午 1:08", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]