["The purported advisory was published on Facebook here on March 18, 2020.", "Below is a screenshot of the misleading post:", "The post reads: “[NEWS] CORPORATION OF CHENNAI AS MADE MANDATORY CLOSURE OF ALL VEGETABLE & FRUIT MARKETS ( Like Koyambedu,Mylapore,Mambalam,Guindy) IN Chennai and other parts of TAMILNADU FROM TODAY MIDNIGHT TO 31st MARCH as CORONA Preventive Measures / We just got information from all shop vendors in MAMBALAM Main Market in front of Station. Request all to have groceries and vegetables in adequate storage and also inform your known ones.. Pray for Eradication of Corona & other Virus related diseases.”", "Similar claims were made on Facebook here and here and on Twitter here and here.", "The claim is false.", "Chennai's governing body, the Greater Chennai Corporation (GCC), issued a statement on March 18, 2020 denying it had issued an advisory banning all food markets.", "“Due to coronavirus the Chennai corporation has ordered for crowded places like schools, colleges, offices, stadiums, bars etc to be shut. But some people are spreading rumours that grocery stores, vegetable vendors and shops selling staples will be closed. That is not true and people should not believe in those rumours,\" the Tamil-language statement reads in English.", "Below is a copy of the statement:", "GCC’s regional deputy commissioner, Alby John, also took to Twitter to refute the claim.", "“A fake message is doing the rounds that vegetable and fruit markets will be closed in Chennai till March 31st,\" John tweeted on March 18, 2020. \"This is a fake message and GCC has not issued any such instruction. Please refrain from forwarding such unverified messages.”", "A fake message is doing the rounds that vegetable and fruit markets will be closed in Chennai till March 31st. This is a fake message and GCC has not issued any such instruction. Please refrain from forwading such unverified messages.#coronavirusindia#covidindia @srkias2012 pic.twitter.com/pBMcHX9P93", "K. Palaniswamy, the chief minister of Tamil Nadu, also published this tweet on March 23, 2020 announcing a lockdown in the state and closure of certain stores. He added, however, that “the shops selling milk, vegetable, grocery, mutton, chicken & fish will continue to function in this period”.", "அத்தியாவசிய பொருட்கள் விநியோகம் செய்யப்படும் மளிகை கடைகள், காய்கறி, பழக் கடைகள், பால் அங்காடிகள் போன்ற இடங்களில் உள்ளாட்சி அமைப்புகள் முறையாக கண்காணித்து தூய்மைப்படுத்த வேண்டும்.\n\n\t\tகாவல்துறை இத்தகைய இடங்களில் மக்கள் அதிகம் கூடாதவாறு கண்காணிக்க வேண்டும். #TNGovt #coronavirus", "On March 24, 2020, Prime Minister Narendra Modi announced that India will enter a \"total lockdown” following a spike in confirmed coronavirus cases. Modi later clarified on tweet that \"essential commodities, medicines etc. would be available.\"", "COVID-19 was first detected in the Chinese city of Wuhan in late 2019. It has since killed more than 16,362 people and infected 375,498 others worldwide, according to data from the World Health Organization on March 25, 2020.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]