["Republican presidential candidate Donald Trump delivers a speech during the evening session on the fourth day of the Republican National Convention on July 21, 2016 at the Quicken Loans Arena in Cleveland. (Getty)", "Donald Trump said at the Republican convention that nothing affected him more deeply than spending time with parents who have lost their children to violence \"spilling across our border.\"", "He said that Hillary Clinton favors shielding undocumented immigrants from federal laws.", "\"My opponent wants sanctuary cities,\" Trump said to boos.", "Sanctuary cities are jurisdictions that have laws or practices that limit their assistance to federal immigration officials, for a variety of reasons that we’ll explain. Trump proposes eliminating federal grants to sanctuary cities.", "Clinton expressed support for the sanctuary city policies during her first presidential race in 2008. During her current race, she criticized decisions by a particular city in the spotlight for sanctuary policy; however, she did reiterate her support for sanctuary cities. We did not get a reply from the Trump campaign for this fact-check.", "Clinton’s comments on sanctuary cities in 2016 race", "There is no blanket legal definition of sanctuary cities, but it generally refers to places where local law enforcement officers aren’t required to alert federal authorities to residents who may be in the country illegally.", "Supporters of such policies, often in liberal jurisdictions or places with large Hispanic populations, say it’s not the job of local officials to help deport residents accused of low-level crimes. Supporters also say they don’t want undocumented immigrants to fear the police and avoid reporting crimes to them.", "Opponents say that sanctuary cities harm the federal government’s ability to enforce immigration laws and give some undocumented immigrants a pass.", "Attacking opponents for supporting sanctuary cities became a nationwide political talking point after the July 2015 shooting death of Kate Steinle of San Francisco. The alleged shooter, who was from Mexico and had been deported several times in the past, had been released from San Francisco’s jail facing drug charges, despite a federal request to keep him in custody so he could face deportation.", "The case sparked a debate over rules like San Francisco’s quarter-century-old law declaring it a \"city and county of refuge.\" The law banned public employees from assisting Immigration and Customs Enforcement with investigations or arrests unless required by a law or a warrant or for people convicted of felonies. Steinle’s death prompted the city to revisit the law.", "About a week later, Clinton was asked about her position on sanctuary cities on CNN.", "Brianna Keilar: \"When you last ran for president you supported sanctuary cities. In light of this terrible incident, does that change anything about your view on this?\"", "Clinton: \"Well, what should be done is any city should listen to the Department of Homeland Security, which as I understand it, urged them to deport this man again after he got out of prison another time. Here's a case where we've deported, we've deported, we've deported. He ends back up in our country, and I think the city made a mistake. The city made a mistake, not to deport someone that the federal government strongly felt should be deported.", "\"So I have absolutely no support for a city that ignores the strong evidence that should be acted on.", "\"However, there are -- like if it were a first-time traffic citation, if it were something minor, a misdemeanor, that's entirely different. This man had already been deported five times. And he should have been deported at the request of the federal government.\"", "Clinton spokesman Josh Schwerin sent PolitiFact a statement the campaign issued a couple days after the CNN interview to clarify her position: \"Hillary Clinton believes that sanctuary cities can help further public safety, and she has defended those policies going back years.\"", "Clinton’s comments on sanctuary cities in 2008 race", "Clinton appeared more favorable toward sanctuary cities during her first presidential campaign", "During an interview with Fox News’ Bill O’Reilly in 2008, Clinton defended sanctuary cities.", "O’Reilly: \"Are you going to crack down on the sanctuary cities?\"", "Clinton: \"No, I’m not. And I’ll tell you why. … I’m not because the reason why a lot of those folks do it — in New York, why do police officers turn a blind eye?", "O’Reilly: \"Because they want them to report crimes.\"", "Clinton: \"They want them to report crimes. Because… sometimes you have two competing values. You want to report crime, you want to protect people and the violence spills way beyond whatever community.\"", "Our ruling", "Trump said that Clinton \"wants sanctuary cities.\"", "During her first race for president, Clinton expressed support for sanctuary cities and said she wouldn’t crack down on them. She argued that without such policies, people will hide from police and not report crimes.", "In 2015, Clinton criticized the city of San Francisco for releasing a man from jail who later was charged with murdering a woman and had previously been deported many times. However, her campaign reiterated Clinton’s view that she believes sanctuary cities can help further public safety.", "We rate this claim Mostly True.", "https://www.sharethefacts.co/share/05011271-7504-4511-9980-22b4aa91ef07", "Breitbart, \"Hillary Clinton’s longtime support for sanctuary cities,\" July 8, 2015", "New York Times, \"The Democratic presidential debate on MSNBC,\" Sept. 26, 2007", "Congress.gov, Senate Amendment 4309, March 13, 2008", "CNN, \"Hillary Clinton’s first national interview of 2016 race,\" July 7, 2016", "Christian Science Monitor, \"San Francisco shooting: a game-changer for immigration policy?\" July 10, 2016", "San Francisco Examiner, \"Supervisors, sheriff reach agreement on sanctuary city law,\" May 25, 2016", "Arizona Republic, \"Killings inflame migrant debate,\" Aug. 19, 2016", "Associated Press, \"Clinton campaign wants N. Carolina immigration bill vetoed,\" Oct. 2, 2015", "MRCTV, \"Flashback-Hillary: Sanctuary Cities Protect 'Safety and Security of All Citizens,'\" July 6, 2015", "Miami Herald, \"Jeb Bush, Marco Rubio oppose ‘sanctuary’ cities — but some consider Miami to be one,\" July 13, 2015", "PolitiFact, \"Fact checking statements about sanctuary cities,\" Jan. 13, 2011", "PolitiFact, \"Compare the candidates: Clinton vs. Trump on immigration,\" July 15, 2016", "PolitiFact Pennsylvania, \"Kenney blasts Pat Toomey’s ‘fearmongering’ around sanctuary city policy, but here’s the thing,\" July 8, 2016", "PolitiFact Pennsylvania, \"Impossible to check: John Fetterman’s claim that sanctuary cities are safer,\" Feb. 29, 2016", "Interview, Josh Schwerin, Hillary Clinton campaign spokesman, July 21, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]