["From top left, Robert Mickens, Elizabeth Alvarado, Evelyn Rodriguez, Freddy Cuevas, parents of two Long Island teenagers who were believed to have been killed by MS-13 gang members, during the State of the Union address Jan. 30, 2018. (AP)", "A bogus story on Facebook claims that Democrats booed during the recent State of the Union address when President Donald Trump addressed introduced the families of teenagers who were killed by MS-13 gang members on Long Island.", "Democrats \"booed families of children murdered by MS13,\" said a Jan. 30 headline by CSC Mediagroup.USA.", "\"This just goes to show that Democrats would rather support illegals who cause harm to Americans rather than support actual American citizens. What does this say about them? They’re DemocRATS.\"", "Facebook users flagged the post as being potentially fabricated, as part of the social network’s efforts to combat fake news. We found that video of Trump’s speech showed a bipartisan chamber stood up and applauded the victims’ parents.", "Trump invited the parents of Kayla Cuevas and Nisa Mickens, two teenage girls from Long Island, to listen to his speech. The girls were murdered in September 2016 while walking together in their hometown. Members of the MS-13 gang have been charged with their murders, including some who were illegal immigrants.", "We listened to and watched videos of Trump’s speech to examine the chamber’s reaction.", "Just before he introduced the girls’ parents, Trump made a statement about illegal immigrants that drew an audible hiss from some members. (Listen around minute 43:30)", "\"For decades, open borders have allowed drugs and gangs to pour into our most vulnerable communities. They have allowed millions of low-wage workers to compete for jobs and wages against the poorest Americans. Most tragically, they have caused the loss of many innocent lives.\"", "But then when Trump spoke to the girls’ parents, the chamber sounded silent.", "Speaking to the girls’ parents, Trump said: \"Tonight, everyone in this chamber is praying for you. Everyone in America is grieving for you. Please stand,\" he said, as the parents then stood. \"Thank you very much. I want you to know that 320 million hearts are right now breaking for you. We love you. Thank you.\"", "The videos show that members stood up and applauded the girls’ parents.", "Some Democrats did boo and hiss a separate part of Trump’s speech about immigration when he called for an end to \"chain migration.\"", "\"Under the current broken system, a single immigrant can bring in virtually unlimited numbers of distant relatives,\" Trump said.", "Many Democrats brought to the speech as their guests Dreamers, people brought to the U.S. illegally as children. The future fate of Dreamers is up in the air following Trump’s decision announced last year to end an Obama-era program, Deferred Action for Childhood Arrivals.", "CSC Mediagroup.USA’s disclaimer proclaims that it isn’t fake news and that it publishes news from a conservative perspective that the mainstream media ignores.", "However, in this case it’s headline is wrong. We found no evidence that Democrats \"booed families of children murdered by MS13\" -- instead they booed other comments Trump made about chain migration.", "We rate this claim Pants on Fire.", "CSC Mediagroup.USA, \"VIDEO: Dems \"BOOED\" Families Of Children Murdered By MS13,\" Jan. 30, 2018", "New York Times, \"Mother of Long Island Gang Victim Invited to the State of the Union,\" Jan. 28, 2018", "New York Times, State of the Union address video, Jan. 30, 2018", "CSPAN, State of the Union address, Jan. 30, 2018", "The Hill, \"Dems boo, hiss at Trump immigration remarks,\" Jan. 30, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]