["The video was shared by a Chinese-language Facebook page called ‘SaluteToHKPolice’ on February 6, 2021 and has since been viewed more than 18,000 times.", "“This happened a few days ago. When shopping, watch out for suspicious South Asian guys nearby, and be careful of being robbed!” the Chinese-language caption reads.", "The footage shows customers being served in a shop. A man walks in and slowly approaches a woman before he snatches cash from her hand and runs away.", "The same video has been shared by various Facebook pages and users in Hong Kong alongside warnings about South Asians.", "“Tell your family, when out shopping, keep an eye out for South Asian guys nearby, they would rob,” wrote one Facebook user who shared the clip.", "More Facebook users in Hong Kong shared the video alongside similar captions here and here.", "“South Asian people have never done any good things in Hong Kong!” one Facebook user commented. “It seems they speak Cantonese, could be Hong Kong”, another wrote.", "Hong Kong's South Asian and Black minorities have long complained of discrimination, AFP reported.", "However, the video has been shared in a misleading context; the robbery happened in the United States, not Hong Kong.", "Reverse image searches on Google using key frames from the misleading footage, along with further keyword searches found a news article from February 4, 2021 by KTVU, a TV station based in Oakland, California, reporting a spate of violent crime against Asian Americans.", "The article features the same video circulating on social media in Hong Kong. A reporter narrating the video says it shows a man snatching money from shoppers in Oakland's Chinatown.", "Below are screenshots comparing the video circulating on Facebook (L) and KTVU’s video (R):", "KTVU crime reporter Henry K. Lee also tweeted the footage. “This video shows Deveion Lamont Byrd, 22, snatching two $100 bills from the hands of an 80yo woman waiting in line at Chung Chou City market in Chinatown,” he said.", "Deveion Lamont Byrd, 22, arrested by @oaklandpoliceca, charged by @AlamedaCountyDA w/robbing this woman at a Chinatown store & stealing from other victims in the area going back months pic.twitter.com/EWlOGCqf8u", "Oakland Police Department said in a statement that they had arrested a man in connection with the robbery.", "The same video has also been fact-checked by Hong Kong fact-checking organisation Kauyim, which mentions that the video has also been shared multiple times on WhatsApp.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]