["About this rating", "On 12 July 2016, a Facebook user posted a photograph of a traffic accident in Kentucky with the following description:", "I took this picture just few minutes ago from the cab of my truck it was an accident between campton and Stanton on the service road just off of the mountain parkway, zoom in and pay attention to the shadow just off the top of the state trooper hat. All I say is I hope everyone involved is okay!!", "The accident turned out to be a fatal crash, and the motorcyclist involved died at the hospital.  Local, and then national media quickly picked up the story of the \"spiritual\" photograph:", "A chilling image taken at the scene of a deadly motorcycle crash in Powell County is being shared on social media.", "The crash occurred 5:30 on Highway 15 near Stanton. Officials [say] the person on the motorcycle was the only person involved and he was taken to a hospital where he later died.", "A photo taken at the scene is hard to believe. The photo shows the image or outline of a man above the man's body.", "Saul Vazquez, the man who took the photo, posted it on Facebook and said he took it from the cab of his truck. It has since been shared over 16,000 times in just 10 hours.", "Lots of people are drawing their own conclusions about the photo, but either way it's causing a huge conversation on social media. [We] reached out to Vazquez, all he would he would say is that the photo has not been altered.", "The photograph shows the scene of a crash with law enforcement and paramedics huddled around the motorcyclist.  Just above them, and between two ambulances, an indistinct grey shape appears to be rising above the scene.  Television anchors (and social media commenters) speculated that it might be a spirit ascending to the next plane, or perhaps an angel, snapped by a lucky trucker as he drove by.", "It's absolutely possible, even probable, that the photo was not altered.  However, this photograph doesn't show a spirit or an angel, but what's most likely an irregularly-shaped piece of dirt that has stuck to either the lens or the camera's internal sensor.  Dirt or dust on the sensor of a camera assumes a greyish and fuzzy appearance in a photograph (and sometimes shows up as luminescent balls in night or high-contrast photography, to which the paranormally-minded sometimes refer as \"spirit orbs\"):", "If the photograph is taken with a mobile phone's camera, the effect can be even more pronounced (and difficult to clean, if the dust is on an internal sensor):", "We're not certain what Vazquez used to take the photograph, but judging by the large depth of field (the bushes closest to the photographer are only slightly blurrier than the ambulances, for example), it's clear that the lens is stopped down to a smaller aperture. That makes the issue of dust on the lens or the sensor even more pronounced:", "Now when the lens is stopped down and aperture is significantly smaller, say at f/16, light rays coming from the lens diaphragm are perpendicular to the sensor filter. Because the angle is more or less straight, dust specks also cast direct and defined shadows on the sensor. That’s why dust shows up in images much smaller, darker and with more defined edges at small apertures.", "A graph explains the concept for the more visually-minded:", "Even if the photograph were proven beyond a shadow of a doubt to be of a ghost or a spirit, it's unclear whose it would be or why it would be there, as the motorcyclist died later at the hospital, not on the scene.", "Brooke Binkowski is a former editor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]