["About this rating", "In February 2016, a Facebook post that purported to be a quote from Sandra Day O'Connor in which the former Supreme Court justice called the Republican party a group of \"vile, petulant, hateful\" obstructionists started going viral:", "\"'...that President Barack Obama should get to name the replacement for the late Justice Antonin Scalia.' I have a...", "Posted by Jay L Hatlen Linnell on Thursday, February 18, 2016", "This quote, however, was never uttered by O'Connor. While most fake quotes on the internet are created by fake news web sites, \"satire\" Facebook groups or malicious memes, this particular misattributed diatribe was just the result of poor punctuation.", "The misunderstanding began with the coverage of an interview that Sandra Day O'Connor gave on 18 February 2016. The judge was asked to weigh in on the controversy surrounding the nomination of the next Justice of the Supreme Court, as several Republicans have argued that Antonin Scalia's replacement should be nominated by the winner of the 2016 Presidential election rather than President Obama.", "O'Connor said that Obama should nominate Scalia's replacement:", "“Well, you just have to pick the best person you can under the circumstances as the appointing authority must do, and it's an important position and one that we care about as a nation and as a people ... And I wish the president well as he makes choices and goes down that line. It’s hard.", "“I don’t agree (that the nomination should be made by the next president). I think we need somebody there now to do the job, and let’s get on with it.\"", "On 18 February 2016, a portion of the above-quoted article was shared on Facebook along with the user's personal views.", "Many people mistook the text of this Facebook post as a direct quote from Sandra Day O'Connor, but that wasn't the case.  The first sentence in the above-displayed Facebook post is part of O'Connor's quote, pulled from an MSNBC article. The rest of the post is a random person's opinion about the Republican party, and has little to do with the former Supreme Court Justice.", "For clarification purposes, here's a breakdown of the above-displayed Facebook post:", "Quote from MSNBC article: \"'...that President Barack Obama should get to name the replacement for the late Justice Antonin Scalia.'", "Opinion of Facebook user: ' I have a serious problem with that language. It is patronizing, and sounds like caving in to a child. \"He gets to go to the circus.\" Barack Obama does NOT \"get to\" appoint the next Supreme Court justice. He is entitled to and responsible for that appointment, per the Constitution of the United States of America. This is NOT a concession he needs to win. The rightwing narrative around this is absolutely false and anti-Constitutional. The radical Republicans are a vile, petulant, hateful, passel of obstructionists whose only unifying goal is their loathing of a black president who became their target the day he was elected by the American people to lead them.\"", "While Sandra Day O'Connor did say that President Obama should nominate the next Supreme Court justice, she did not call the Republican party a group of \"vile obstructionists\" for their attempts to prevent Obama from doing so.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]