["The 45-second video was published here in a Facebook post on June 25, 2019.", "It was viewed more than 1.2 million times and shared more than 34,000 times before it was deleted.", "Below is a screenshot of the misleading Facebook post:", "The Hindi language caption translates to English as: “#Lucknow, this incident took place in Itaunja police station area yesterday. Islam and four other men from the peace-loving community tried to rape his sister and beat them badly when he stopped them from doing so. #Wake up Hindu wake-up, your end is certain. And the police could have taken them to the hospital, but see the apathy of our country's administration.\"", "A bleeding man can be seen holding a bleeding woman girl in his arms. He can be heard saying in Hindi, “Why are you not listening to me, I want you to register my complaint first.”", "“See the situation of her, our family members are dying. Please send the police to my home. Islam and Yunus attacked us with two other people and my sister is dying,” the man in the video says when asked about the incident.", "A male voice can be heard suggesting that the pair seek medical treatment first and then bring a written complaint to the police.", "The same video has also been viewed hundreds of thousands of times after being shared on Facebook here, here and here with a similar claim.", "It has also been shared on Twitter, for example here and here, with a similar claim.", "The video originally circulated online in connection with reports about two Muslims who were attacked during a quarrel with their Muslim neighbors.", "A keyword search found a longer version of the video published here on Twitter by journalist Rishabh Mani, who states on his profile that he works for Hindi language news channel NEWS 18.", "The 50-second video in Mani’s tweet contains an additional five seconds of footage at the beginning of the clip.", "Below is a screenshot comparison of the video in the misleading posts (L) and the video tweeted by Mani (R):", "A Hindi language caption on Mani’s tweet translates to English as: “Shahrukh took blood-soaked sister to the capital’s Mahngwa police check-post of Itaunja Police Station Area. See the working style of constables at the police check-post… they asked him to go to police station @manojrajant @dgpup @lkopolice @ankurNBT @meevkt @myogiadityanath @yadavakhilesh @Mayawati”.", "Mani tagged Uttar Pradesh Chief Minister Yogi Adityanath, the state police chief and Lucknow Police his tweet.", "Itaunja is a town in Lucknow district in the north Indian state of Uttar Pradesh.", "A journalist in AFP’s Delhi bureau spoke to Mahesh Chandra, Station House Officer of the Itaunja Police Station about the video by phone on June 25, 2019.", "He said four people had been arrested following a row involving two Muslim families.", "\"Two Muslim families started fighting after a quarrel among kids, who were playing together in Nausera village of Intaujha police station area last evening. We have registered a complaint and four people have been arrested in the case,\" he said.", "In this tweet on June 25, 2019, Lucknow Police said they had registered a case over the incident and that a constable had been disciplined.", "The tweet says: \"SSP-LKO #Kalanidhi_Naithani has taken speedy action over the case in Intaujha Police Station Area. (CO) Circle Office BKT (Bakshi Ka Talab) told us that constable Rahul, batch 16, district Baghpat, was posted at the police check-post. He has been summoned to the police headquarters for behaving in an inhuman way.\"", "Lucknow Police issued a further clarification about the video here on Twitter on June 25.", "The Hindi language tweet translates to English as: “Two parties from the same community (Muslim) began to fight over some issue while kids/youths were playing in front of a house in Intaujha Police Station area. Shahrukh and Shabnam, seen in the above video, have registered an FIR no. 185/2019 under section 308, 323, 504, 506 of IPC (Indian penal code) in the matter. The police have formed a team to arrest the accused. The investigation has been handed over to CO (circle office) BKT (Bakshi ka Talab area).”", "Below is a screenshot of the police clarification:", "Attempted rape is charged and prosecuted under section 354 of the Indian Penal Code, which is not mentioned in the police statement.", "Lucknow Police also tweeted photos of the four men arrested over the incident in a tweet here on June 25.", "AFP obtained a copy of the police complaint filed by Shahrukh Khan at the Intauja Police Station at 01:25 AM on June 25, 2019.", "A section of the complaint, written in Hindi, translates to English as:", "“My younger brother Iqbal was playing in front of the house on June 24, 2019, when my neighbor Islam’s son Altaf joined him in playing they later had a fight. My mother Sabiri and sister Shabnam separated them, but Altaf's family members, including Islam, Yunus, Shakeel, and Usman along with other residents of village Nrausa of Intauja Police Station in district Lucknow, came and attacked my sister Shabnam with batons, sticks and iron rods. My sister fainted after a while, but they kept beating her.\"", "When I intervened they started abusing and beating me and also threatened to kill me. When my other family members came to my rescue, upon seeing them coming, all the attackers ran away. I have come with my sister here to make a complaint and request to take legal action against them.”", "Below is a screenshot of the police complaint:", "Shahrukh said the claims about the video on social media were not true.", "In a telephone interview on July 1, he told AFP: “Both me, my sister and our attackers are Muslims. We had skirmishes in the past over different issues, but we had never thought that they will attack us so brutally.\"", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]