["About this rating", "Back in September 2016, two months before the U.S. presidential election, the two major-party candidates — Republican nominee Donald Trump and Democratic nominee Hillary Clinton — separately sat for interviews with host Matt Lauer as part of NBC's Commander-in-Chief Forum. After the event, a few news reports asserted, the Clinton campaign had expressed disgruntlement that Lauer had not been nearly as tough in his questioning of Trump as he had been with the Democratic candidate.", "Those news reports were spun into a baseless but widely circulated article holding that Clinton engaged in a prolonged, obscenity-filled tirade immediately following her forum interview, a meltdown that supposedly included her throwing a water glass at a staffer's head and demanding Lauer be fired. One of the faux quotes used in that article showed Clinton allegedly threatening NBC executives that they would be \"swinging from nooses\" if she failed to win the election: \"", "She was overheard threatening executives at NBC saying “If I lose, we all go down and that Fascist Fuck will have us swinging from nooses! What the fuck is wrong with you idiots?”", "Over time this fake quote became immortalized in meme form, presented (in slightly reworded form) not as something Clinton purportedly screamed at NBC staff, but as something she reputedly wrote in an angry email to Democratic National Committee Chairwoman Donna Brazile: \"If that fucking bastard wins, we're all going to hang from nooses. You better fix this shit!\"", "Given that an article from 9 September 2016 attributed this statement to Clinton, it's rather unlikely the origins of that statement could have been an email that wasn't sent until five weeks after that article was published, as suggested by the meme. In any case, we already know that the \"we're-all-going-to-hang-from-nooses\" quote didn't appear in any leaked (or otherwise disclosed) email from Clinton to Brazile, nor did it stem from a source discovered or reported by any reputable news entity. It was merely a fabrication attributed to unidentified and uncorroborated \"inside sources\" in a piece of fake news posted on an obscure website back in September 2016.", "Evon, Dan.   \"Did Hillary Clinton Throw a Tantrum with Matt Lauer?\"\r\n    Snopes.com.   22 October 2016.", "Angie.   \"Temper! Temper! Hillary Goes on Rampage for Over an Hour -- Throwing Glass at Staffer’s Head.\"\r\n    Victurus Libertas.   9 September 2016.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]