["About this rating", "Los Angeles drag queen Xochi Mochi took part in Drag Queen Story Hour at Long Beach public library in October 2017. A widely-shared photo of the event is authentic.", "The event did not involve \"demonic teachings\" or anything sexually explicit. Xochi Mochi read Todd Parr's children's book \"It's Okay to be Different\" to the children.", "In October 2017, right-wing web sites reported with a significant degree of alarm that a drag queen in a \"Satan-inspired costume\" had read to children at a California public library associated with former First Lady Michelle Obama.", "In their headline, Conservative Fighters falsely claimed that Xochi Mochi had read a \"sexually explicit\" book to the children. World News Daily reported:", "The Michelle Obama public library in Long Beach, California, has presented to children who are part of its young readers program a huge array of diversity and “inclusion” agendas. In one shot. It was when Xochi Mochi arrived for a visit. That made the program pro-LGBTQ. And transgender. And drag queen-friendly. And Satanist-approved, with the character’s red-tipped, demon-like horns. All to read to children for LGBTQ History Month.", "The right-wing Media Research Center wrote:", "In a nightmare-inducing vision that's likely spawned years of intense psychological therapy, children at the Michelle Obama Public Library in Venice Beach, California were forced to endure being read kids’ books by a five-horned drag queen in the most terrifying clown makeup known to man. And no, not for Halloween. For diversity.", "Setting aside for a moment the alarmist language used to describe this event, the Los Angeles drag performer Xochi Mochi (also known as Jorge Alcantar) did read to children at the Michelle Obama Neighborhood Library in Long Beach, California, on 14 October.", "The reading was part of a series called Drag Queen Story Hour, which is run by the writer Michelle Tea and the literary and arts non-profit Radar Productions. Here's how the Drag Queen Story Hour web site describes the project:", "Drag Queen Story Hour (DQSH) is just what it sounds like—drag queens reading stories to children in libraries, schools, and bookstores. DQSH captures the imagination and play of the gender fluidity of childhood and gives kids glamorous, positive, and unabashedly queer role models. In spaces like this, kids are able to see people who defy rigid gender restrictions and imagine a world where people can present as they wish, where dress up is real.", "The photograph used in the reports mentioned above is authentic, and was posted to Facebook and Instagram by Xochi Mochi, who added:", "I got to read to the children today and it was one of the best experiences I’ve been given as a drag queen. It’s so important to have representation and normalize all the letters in LGBTQIA+ in everyday lives. I saw so many excited faces it filled my heart with so much joy and hope to come back again soon!", "Long Beach Public Library also posted the photograph to its Twitter account, but has since deleted that tweet. (An archived version can be viewed here.)", "Republican candidate for Congress Omar Navarro asked in a tweet \"what are we teaching kids in school?\" and claimed the photograph of Xochi Mochi showed \"demonic teachings.\" Setting aside the fact that the event took place at a library, not a school, the book Xochi Mochi is reading in the photograph is Todd Parr's children's book \"It's Okay to be Different,\" which includes the following lines:", "It's okay to need some help...It's okay to be a different color...It's okay to talk about your feelings...It's okay to eat macaroni and cheese in the bathtub.", "The web sites also made much of the fact that Xochi Mochi's costume involved horns, though there's no evidence that those horns are \"Satan-inspired.\" They could just as well have been inspired by the Greek gods Pan or Dionysus, both of whom are often depicted with horns. Or they could simply be Xochi Mochi's own invention. Satan and other Christian demons (as well as Pan and Dionysus) are typically portrayed with two horns, rather than the five that Xochi Mochi wore.", "She was also wearing a pink dress and cape; a gem-encrusted necklace and bracelet; and flowers in her hair and on her cape -- all of which are hardly in keeping with Satanist or demonic symbology and suggest that -- like most drag -- Xochi Mochi's appearance was driven by playfulness and eclecticism.", "Contrary to Conservative Fighters's claim, there is no evidence whatsoever that Xochi Mochi read the children anything \"sexually explicit.\"", "Finally, Michelle Obama had no role in the event. The Conservative Fighters web site misleadingly referred to \"Michelle Obama's public library\" in its headline, suggesting that the former First Lady owns or operates the institution. She doesn't, but the library was named in her honor in September 2016.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]