["While some conservative activists and presidential hopefuls have trashed Common Core, former Florida Gov. Jeb Bush remains a supporter of the education standards.", "Bush’s support for Common Core could put him at odds with primary challengers should he decide to enter the race: Sen. Marco Rubio, R-Florida, opposes Common Core, while Wisconsin Gov. Scott Walker, a potential candidate, once showed tacit support but later called for repeal.", "During an event on April 17 in New Hampshire, a Nashua resident asked Bush straight up: \"Gov. Bush: where do you stand on Common Core?\"", "Bush said: \"Thank you for bringing that up. If it wasn’t going to be brought up, I was going to bring it up myself.\"", "Bush then made his case that Common Core is essentially a push for higher standards, to address concerns about student achievement in the United States.", "\"We have an 80 percent graduation rate in high school after spending more per student than any country in the world other than Liechtenstein I think, or Luxembourg and a couple other small countries,\" Bush said.", "Bush drew applause when he said \"we don’t need a federal government involved in this at all,\" and added that he supported proposed legislation to ban the feds from creating standards or curriculum. (PolitiFact has rated multiple claims from other politicians that Common Core is a \"federal takeover\" of education and found them misleading.)", "Here we will fact-check Bush’s claim about the national graduation rate and how much we spend per student compared to other countries.", "Graduation rates and per-pupil spending", "There are a few different ways to measure graduation rates including the federal government's cohort method, which examines how many students who enter 9th grade graduate four years later with a standard diploma. By that measurement, the national average was about 81 percent in 2012-13. (Florida is below that national average.)", "As for spending, Bush’s spokeswoman pointed to a 2013 Associated Press article about a study by the Organization for Economic Cooperation and Development that compared per-pupil spending among 34 advanced industrialized nations. Formed in 1961, OECD sets international standards on a wide range of topics, including education spending.", "The most recent OECD study -- from 2014 using 2011 data -- shows that the United States spends $12,731 per student on secondary education. Four countries -- Austria, Luxembourg, Norway and Switzerland -- spend more. Those same countries are also the only ones that spend more than the United States per student on primary schools.", "Country", "Secondary per-pupil spending", "Austria", "$13,607", "Luxembourg", "$16,182", "Norway", "$13,939", "Switzerland", "$15,891", "United States", "$12,731", "(Bush mentioned Liechtenstein, a tiny country located between Austria and Switzerland, but that wasn’t included on the OECD list.)", "Pointing to the OECD data, the federal government’s National Center for Education Statistics notes that a country’s wealth is positively associated with expenditures per student.", "When examining expenditures as a percentage of gross domestic product for all levels of education, the United States and Chile are seventh out of 32 countries.", "Stanford professor Eric Hanushek, an expert on economic analysis of educational issues, told PolitiFact that the OECD ranking is the best source currently available to judge differences among nations in education.", "However, University of Iowa education professor David Bills offered one caveat. \"What matters is not the absolute budget per se, but the proportion of that budget that is spent on instruction,\" Bills said.", "Traditionally the United States spends big parts of its educational budget on non-instructional items such as security -- more so than some other nations.", "Bush has changed how he has worded his claim about how per-student spending in the United States compares to other countries. In 2013, Bush claimed that the United States spends \"more per student than any country in the world,\" which Factcheck.org noted was inaccurate since a few countries spent more.", "Our ruling", "Bush said, \"We have an 80 percent graduation rate in high school after spending more per student than any country in the world other than Liechtenstein, I think, or Luxembourg and a couple other small countries.\"", "The national average for the graduation rate was 81 percent in 2012-13, according to one method the federal government uses to calculate the rate. Among advanced countries, the United States ranked fifth in per student spending for secondary education behind Austria, Luxembourg, Norway and Switzerland. Liechtenstein wasn’t on the list, but since Bush expressed uncertainty, we think his statement is still accurate.", "We rate this claim True.", "First in the Nation GOP event in New Hampshire, Gov. Jeb Bush speech, April 17, 2015", "Associated Press, \"Study: U.S. education spending tops global list,\" June 25, 2013", "Organization for Economic Cooperation and Development, \"Education at a glance,\" 2014", "U.S. Department of Education, Regulatory adjusted cohort graduation rate, 2013", "National Center for Education Statistics, Education expenditures by country", "CIA World Factbook, Liechtenstein, accessed April 20, 2015", "Tampa Bay Times The Buzz blog, \"Rubio comes out against Common Core, putting him at odds with Jeb Bush,\" July 26, 2013", "PolitiFact’s Scott-O-Meter, \"Be No. 1 in high school graduation rates,\" Last update April 16, 2015", "Factcheck.org, \"Jeb Bush gets an ‘F’ on school spending,\" June 21, 2013", "Interview, Kristy Campbell, former Gov. Jeb Bush spokeswoman, April 20, 2015", "Interview, Spencer Wilson, Organization for Economic Cooperation and Development spokesman, April 20, 2015", "Interview, Richard J. Murnane, economist and research professor Harvard University Graduate School of Education, April 20, 2015", "Interview, David Bills, University of Iowa education professor, April 20, 2015", "Interview, Eric Hanushek, Stanford professor and expert in economic analysis of educational issues, April 20, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]