["About this rating", "In late April 2018, an unsourced Facebook post reporting that U.S. President Donald Trump had been \"ordered\" not to attend former First Lady Barbara Bush's funeral on 21 April 2018 in Houston, Texas, was circulated on social media, prompting readers to ask if it was true:", "Barbara Bush, who was the mother of former president George W. Bush and former Florida governor Jeb Bush, as well as the wife of former President George H.W. Bush, passed away on 17 April 2018 at the age of 92. After a bitter 2016 presidential campaign in which candidate Donald Trump heavily criticized two of Barbara Bush's sons (as well as beating out Jeb Bush for the Republican nomination), the Bush family matriarch made it no secret that she was not a fan of Donald Trump.", "We uncovered no other reports that anyone from the Bush family \"ordered\" the sitting president not to attend Barbara Bush's memorial service. Instead, the White House released a statement to reporters saying Trump would not attend out of respect to avoid creating a disruption \"due to added security.\" First Lady Melania Trump, however, will be in attendance, as will former presidents Bill Clinton and Barack Obama, and former first ladies Hillary Clinton, Laura Bush, and Michelle Obama (along with, of course, Barbara Bush's husband and sons).", "During the 2016 campaign, Barbara Bush didn't hold back in her critiques of then-candidate Donald Trump. In the course of a CNN interview, for example, she proclaimed that \"[Trump] doesn't give many answers to how he would solve problems. He sort of makes faces and says insulting things ... He's said terrible things about women, terrible things about the military. I don't understand why people are for him, for that reason. I'm a woman ... I'm not crazy about what he says about women.\"", "In another interview with CBS, Bush again lambasted Trump for his comments about women and called him a \"comedian\" or a \"showman\":", "Surprised this didn't get shared more at the time. Maybe because back then so many thought he would inevitably lose and disappear. Barbara Bush unfiltered on Trump. \"I don't know how women can vote\" for him, she says. pic.twitter.com/IWK42SmGo7", "— Elad Nehorai (@PopChassid) April 9, 2018", "Although there was no love lost between President Trump and the Bush family, the BBC noted it's not unusual for sitting presidents to skip the funerals of former first ladies:", "Of course, then-President Barack Obama didn't attend the funerals of Republican first ladies Nancy Reagan and Betty Ford. Neither did George W Bush attend the 2007 memorial services for Democrat Lady Bird Johnson. But Mr Trump and the Bushes are in the same party — and a presidential gesture here could have soothed some raw wounds for Republicans that remain from the tumultuous 2016 campaign.", "Instead, Mr Trump will spend the weekend at his resort in Florida.", "Bush did express that he wanted President Trump to attend his own funeral, however:", "Despite antipathy between the Bush family and President Donald Trump, the 41st president made clear he wanted America's current leader to be at the funeral, putting the institution of the presidency above personal animosities.", "Trump has confirmed he will attend the event, which follows a series of national disasters and tragedies and moments of public mourning that have caused critics to fault his behavior as short of that expected of a president.", "To his credit, Trump canceled what was certain to be a contentious news conference at the G20 summit in Argentina out of respect for Bush. He also sent one of the iconic blue-and-white 747 jets that serves as Air Force One when a president is aboard to Texas to carry Bush's casket.", "Associated Press.  \"Trump Will Skip Barbara Bush Funeral, Sending First Lady.\"\r\n    19 April 2018.", "KTRK-TV.   \"Some Details Released for Barbara Bush's Funeral.\"\r\n    20 April 2018.", "BBC News.   \"Barbara Bush Funeral: Donald Trump Not Attending 'Out of Respect.'\"\r\n    20 April 2018.", "Friedmann, Sarah.   \"These Barbara Bush Quotes About Trump Are Still So Relevant for American Women.\"\r\n    Bustle.   17 April 2018.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]