["About this rating", "A video purportedly showing a young child getting flipped into the air by a surprisingly strong water fountain jet was met with laughter, concern, and skepticism when it went viral in May 2018:", "The exact origins of this video are still unclear. It was shared on LiveLeak and Reddit on 6 February 2018, but neither of those postings contained much information about where, when, or who shot the footage. When the viral content distributor Viral Hog published the video on YouTube the following day, they stated that it had been filmed in Mexico on 5 February 2018 and also shared some words supposedly spoken by the person who made the film: \"I was recording my sister, while she watched the fountain, and I was a witness of the little girl being ejected by the fountain.\"", "The fountain in this video appears to be located in Chapultepec Park in Mexico City. Images showing what looks to be the same fountain can be found via Google Maps, Alamy, and the web site of photographer Margaret Metcalfe.", "The following photograph of the fountain was also taken by Instagram user Mike Fierros:", "All paths take you to the city • • • • • #cdmx?? #mexicocity?? #Chapultepec #chapultepecpark #bigpark #lungofthecity #myhometown #mycity #proudly #saturdayevening #greatwknd", "A post shared by  Mike Fierros (@mike_fierros) on May 13, 2018 at 7:40am PDT", "Viewers expressing skepticism about the authenticity of the footage tended to point to two different things: First, that nobody in the film seemed to notice or express concern about the little girl getting flipped into the air by the fountain. And second, that the pressure of this fountain would have to have been unbelievably strong to lift a child of that size into the air.", "In response to the first argument, we note that the viral version of this video is missing a few frames at the end capturing an adult man coming to the little girl's aid:", "The fountain's jet would certainly have to be fairly strong to lift a girl that size into the air. It's uncertain if this fountain was designed to be an interactive feature of the park (in which case the water pressure may have been improperly calibrated), if the children were cavorting in an area where they weren't supposed to be playing, or if this style of fountain jet is just part of the fun.", "Regardless, the incident depicted in this footage doesn't seem implausible. We found a few published reports of children getting injured by high pressured fountain jets, and even a similar video (albeit featuring a larger water fountain) showing a child's being briefly lifted into the air by a powerful stream of water:", "We can't yet definitively say that this video is real, but at this point we don't have much reason to doubt it.", "Lacy, Judith.   \"Vaginal Laceration from a High-Pressure Water Jet in a Prepubescent Girl.\"\r\n    Pediatric Emergency Care.   1 February 2007.", "Lynch, Alison.   \"British Woman Had to Get 250 Stitches After a Water Jet at Blackpool Pleasure Beach.\"\r\n    Metro.   3 April 2015.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]