["About this rating", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "In June 2020, as professional sports in the U.S. worked on strategies to return to work amidst the COVID-19 coronavirus pandemic, an image was circulated on social media that supposedly showed the NFL's new COVID-19 series helmets:", "This is not the official design of the NFL's helmets for the 2020 season. This is a piece of fan art showing what the helmets could look like if the sport returns during the pandemic.", "This image did not originate with any of the NFL's official channels, nor was it shared by Nike, the company that is providing the uniforms for the NFL this year. This image originated on the Stadium Facebook page, where it was shared with the caption: \"NFL players might sport #COVID19 helmets this fall ... What do you think? ?\" The keyword in the previous sentence, of course, is might, but even that implies too strong of a connection between this image and the NFL.", "The above-displayed image was created by manipulating a real picture released in 2012 of Nike's latest NFL uniform designs:", "While the COVID-19 series NFL helmet shown above is an unofficial concept design, the NFL is reportedly working on new helmet face guards to help prevent the spread of COVID-19.", "The Mercury News reported:", "With an eye toward getting back on the field during a pandemic, the NFL is working on a helmet face guard that might provide the same sort of protection as a surgical mask.", "Atlanta Falcons president Rich McKay, who heads up the league’s competition committee, said the issue was raised during a conference call about a month ago.", "“A lot of players have played with a clear shield to protect their eyes,” McKay said Tuesday during a video conference call with Atlanta media. “This would be extended even further.”", "Thom Mayer, who is medical director of the NFL Players Association, said league engineers and sports equipment company Oakley are testing prototypes of a modified face mask that might contain surgical or N95 material.", "As of this writing, the NFL has not released any images showing what these COVID-19 helmets could look like.", "Bousky, Patrick.   \"Nike Unveils New Chicago Bears Uniforms, Monsters of the Midway Look Stays.\" \r\n    Bleacher Report.   3 April 2012.", "Mercury News.   \"COVID-19 Has NFL Considering Helmet Face Guards That Work Like Surgical Masks.\"\r\n    20 May 2020.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]