["About this rating", "In late January 2021, readers sent Snopes a meme circulating on Facebook that was mocked up to look like a screenshot of part of a news article that falsely reported newly confirmed U.S. Secretary of Defense Lloyd Austin planned on \"defunding, maybe disbanding\" the Army, and relying on China to provide national defense.", "Austin was confirmed as the first Black secretary of defense by an overwhelming, bipartisan vote in the U.S. Senate on Jan. 22, 2021, with 93 Republican and Democratic senators affirming his position. It is hard to imagine Austin would have gained such resounding support from members of the Senate from both parties had he proposed such an outlandish policy as replacing a branch of the U.S. military with Chinese forces.", "During his confirmation hearing, Austin talked about maintaining the American military's strategic advantage over, and countering any potential threat posed by, China.", "It appears that the meme is meant to exploit racist and xenophobic sentiments by using the term \"defund\" in reference to the military to falsely link Austin's leadership with unrelated Black Lives Matter protests over the spring and summer of 2020. During those protests, activists participating in civil rights demonstrations against police killings of Black Americans had called for defunding of police departments.", "It also leverages baseless conspiracy theories about links between U.S. President Joe Biden and China, which were promoted by Biden's predecessor, Donald Trump.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]