["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Could the United States be facing a future with $129 trillion in additional deficits over the next 30 years? Sen. Ron Johnson, R-Wis., contends it’s possible.", "On June 26, 2017, as a Senate bill to repeal and replace the Affordable Care Act was foundering, Johnson wrote an op-ed in the New York Times titled, \"Where the Senate health care bill fails.\"", "The op-ed focused on the difficulty of reining in federal outlays for health care spending.", "\"We are $20 trillion in debt,\" Johnson wrote. \"The Congressional Budget Office projects an additional $129 trillion of accumulated deficits over the next 30 years. A truly moral and compassionate society does not impoverish future generations to bestow benefits in the here and now.\"", "Let’s take a closer look at those figures.", "The U.S. Treasury Department’s \"Debt to the Penny\" calculator allows you to track the federal debt on a daily basis.", "The website lists two kinds of debt -- publicly held debt and gross federal debt. The difference is that federal debt is calculated by taking the amount of publicly held debt and adding to it the debt that is held by the government. These are typically IOUs between one governmental entity and another, such as the money owed by the general treasury to the Social Security trust fund.", "As of June 29, the gross federal debt -- the more all-encompassing of the two figures -- was $19.8 trillion. That rounds up to $20 trillion, the figure Johnson cited.", "The other debt figure -- publicly held debt -- is smaller, at $14.3 trillion. However, since Johnson was very close to one of the two official figures, we won’t quibble.", "It’s trickier, though, to check whether the Congressional Budget Office -- a nonpartisan arm of Congress whose analyses are given significant weight in Washington policy debates -- projected an additional $129 trillion of \"accumulated deficits.\"", "CBO does indeed calculate a figure for accumulated future deficits. CBO’s most recent Long Term Budget Outlook, released in March 2017, mainly discusses deficits and debt between now and 2047 as a percentage of gross domestic product. But we were able to check Johnson’s statement by reverse-engineering the dollar amounts using the percentages in the report.", "CBO projects $91.5 trillion in public debt by 2047, up from $14.8 trillion in 2017. That’s an increase of $77 trillion over 30 years.", "But remember that this is the figure for the public debt, the smaller of the two debt measurements, so we used that to estimate the size of the gross federal debt. Today, gross debt is 1.39 times larger than public debt. If that ratio holds steady over the next 30 years -- a big assumption -- then the gross federal debt in 2047 would be about $107 trillion.", "That still falls a bit short of Johnson’s $129 trillion. Why the gap?", "The answer: Johnson was applying a no-longer-used CBO formula to make his own calculations", "Since 2013, Johnson, a trained accountant, has regularly sought to spread the word about the United States’ long-term debt challenges. He put together a series of charts and graphs that he shared with fellow lawmakers and members of the media, focusing on the 30-year time frame, a long-term view that Johnson felt was too often missing from the conversation.", "To put these charts together, Johnson used a calculation made by the CBO called the \"alternative fiscal scenario.\"", "The main CBO projections usually use current law as the starting point and assume that current law will continue indefinitely. However, to offer a wider range of future possibilities, CBO sometimes offers an \"alternative\" scenario using different assumptions about what the law would look like in the future. Because this alternative scenario tends to project higher future deficits, it explains why Johnson’s figure of $129 trillion is bigger than the official CBO projection of $107 trillion.", "CBO produced the alternative fiscal scenario itself, so it comes with significant credibility. However, it’s worth pointing out a caveat: The CBO hasn’t produced calculations based on its alternative fiscal scenario since its 2015 report, when Congress made moot a major reason the calculation was devised in the first place. (That year, Congress stopped putting off a planned cut in Medicare reimbursement for doctors and incorporated the higher rates into permanent law.)", "Johnson’s office said it ran the calculations by CBO while they were being developed. Still, the way Johnson framed the numbers in the op-ed is not strictly accurate. Johnson in his op-ed adapted a past calculation by CBO to make his claim. He wasn’t reporting what CBO produced.", "This framing matters, because it effectively turns a calculation by a partisan senator into one by an independent analyst.", "Johnson wrote, \"We are $20 trillion in debt. The Congressional Budget Office projects an additional $129 trillion of accumulated deficits over the next 30 years.\"", "Johnson’s figures are plausible. Even the official CBO figure of $107 trillion in 30 years -- while smaller than Johnson's $129 trillion -- is a huge number.", "But the attribution is sloppy. While the figure is based on CBO data, it is not an actual, current projection by CBO.", "We rate the statement Mostly True.", "Ron Johnson, \"Where the Senate Health Care Bill Fails\" (New York Times op-ed), June 26, 2017", "Treasury Department, Debt to the Penny calculator, accessed June 29, 2017", "Congressional Budget Office, \"Long Term Budget Outlook,\" March 2017", "Congressional Budget Office, \"Long Term Budget Outlook,\" June 2015", "Congressional Budget Office, \"Major Recurring Reports\" index page, accessed June 29, 2017", "Wall Street Journal, \"Rebooting the Budget Talks,\" June 14, 2013", "National Review, \"Ron Johnson’s Transformative Proposal,\" June 13, 2013", "Email interview with Steve Ellis, vice president of Taxpayers for Common Sense, June 29, 2017", "Interview with Ben Voelkel, spokesman for Ron Johnson, June 29, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]