["About this rating", "A Houston-based dog rescue group's warning to Facebook followers was amplified exponentially via social media after the group posted photographs of what they said were injuries to four dogs caused by exposure to a particular tennis ball brand:", "The shelter's founder, Alfred Restivo, told People magazine that the incidents described in their post date to February 2018, when Sydney, a 6-year-old border collie, developed a heavily-swollen tongue.", "Three more dogs, Restivo said, were later found with similar issues.", "\"It's from the balls just being in their mouth and them licking them,\" he said. \"It doesn't even have to be chewing.\"", "Restivo also told us via email:", "Although I believe the tennis balls caused the issues with these dogs, I have no definitive proof. I can only go by what I saw, the situation the dogs were in, and the resulting outcome. In one case a dog chewed and swallowed a ball , which appeared to result in a 'burn' around a mouth. Another dog, Otis in the FB post, was merely playing catch with a tennis ball. Mouth 'Burns' soon showed up afterward. One of our boarding dogs was just licking, chewing and playing with a tennis ball but never swallowed or tore it apart. He had mouth \"burns\" on the guns and tongue. The fourth dog chewed and licked on a tennis ball for good while but never swallowed it. Her tongue swelled, and there were \"burns\" on both her mouth and gums.", "His account was corroborated by one veterinarian, Tim Gaffrey, who diagnosed Sydney with \"mouth ulcers\" on top of the swelling.", "\"That combination of symptoms, it looks like a dog that had oral contact with an irritating substance. Another way of saying that is chemical burns,\" Gaffrey told the magazine.", "Head Penn Racquet Sports, the maker of Penn brand tennis balls, told us in a statement that they were unaware of anything about the balls themselves that would cause the reported symptoms:", "We have looked diligently into this situation and have confirmed that nothing has changed with the manufacturing process of Penn Championship tennis balls. We have not previously heard reports of this nature. Head USA stands behind the quality of Penn tennis balls, which are the ball of choice for the world’s best tennis players. Penn tennis balls are produced to meet the exacting specifications of the US Tennis Association, the International Tennis Federation and other governing bodies of the sport. Tennis balls are made for tennis; they are not marketed or sold as pet toys, but we want to assure our customers that no toxic materials are added to our tennis balls, and we would never knowingly market a product that harms animals or humans.", "\"Penn can deny what they want,\" Restivo told us in response. \"I have plenty of these balls left. I challenge them to get independent chemical testing done on the these balls as well as any news outlets. Their denials are meaningless to me unless they prove that these four injured dogs wounds were not caused by their product.\"", "Restivo said that Penn had not contacted him, and that his post would stay up.", "The shelter's claim also came as news to other medical experts. The American Veterinary Medical Association's president-elect, John de Jong, told People that he had never heard of dogs suffering these sorts of issues related to chewing tennis balls. Similarly, veterinarian Marty Becker, a board member for the American Humane Association, told us: \"Tennis balls are wonderful for playing a brisk game of fetch with your dog, but they're not chew toys. While I have never seen an instance of chemical burns to a dog's mouth or tongue from exposure to a tennis ball, they do pose some risks dog owners need to be aware of.\"", "Specifically, Becker said, tennis balls can compress in a dog's throat and then cut off their airways when they return to full size. He added, \"Some dogs will rip the ball to pieces and then swallow them, creating a potentially life-threatening intestinal blockage. It's not necessary to give up fetch. Just be sure to put the ball away after every game.\"", "Shenfield, Hilary. \"Rescue Group Claims Penn Tennis Balls Caused Serious Reactions and Mouth Injuries in Dogs.\"\r\n    People. 21 June 2018.", "Update [6 July 2018]: Added comments from Alfred Restivo, founder of the shelter where the dogs allegedly suffered the burns.", "Arturo Garcia is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]