["The photo was published here on Facebook on November 2, 2020.", "The Sinhala-language post translates to English as: “That's blessed water... This is also blessed water... One is wishing for better times for the country... Other is in hope of positions (Presidency, Premiership)”.", "The posts circulated online after after the incumbent minister of health and other ministers were mocked for performing a ritual that sought divine intervention to eradicate the novel coronavirus from Sri Lanka.", "The photo was also published here, here, here and here on Facebook alongside similar claims.", "However, the claim is false.", "A reverse Google image search of the photo in the misleading posts found this report by Sri Lankan newspaper the Daily Mirror dated August 15, 2018.", "The article is headlined: “PM visits newly preserved stone pond at Anuradhapura” and it reads, in part: “Prime Minister Ranil Wickremesinghe poured Pirith Water into the newly preserved stone pond (No: 17) at the Maha Vihara Premises in Anuradhapura yesterday.”", "\"Pirith water\" is water that has been blessed by Buddhist monks who chanting pirith -- a recitation of Buddhist scriptures to ward off evil.", "Maha Vihara is a Buddhist temple in the Sri Lankan city of Anuradhapura.", "Below is a screenshot comparison between the photo in the misleading post (L) and the Daily Mirror photo (R):", "AFP also located this tweet published on Wickremesinghe’s official twitter account on August 15, 2018 about his visit to “religious sites” in Anuradhapura.", "We will be rebuilding the Stone Wall and the Stone Pool at the Jaya Sri Maha Bodhi in Anuradhapura. It is important that we respect and protect our cultural and religious heritage. This is why we are following our plan to refurbish religious sites across the country. pic.twitter.com/qk5j2oBcCl", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]