["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Candidate for Wisconsin governor Tony Evers says state categorical aid for special education has not increased in a decade.", "State schools superintendent Tony Evers, the Democratic challenger facing Gov. Scott Walker, has pledged to seek $606.1 million increase in funding for special education programs, which would bring funding for such services to $900 million by 2021.", "\"School districts have a legal obligation to kids with disabilities, and they are required to provide those services,\" Evers said when he made the announcement. \"That, in turn, puts pressure on the rest of the school budget. It’s time to change that momentum.\"", "States use different methods to allocate special education funds. Wisconsin is one of five that reimburse schools for the costs incurred for educating special-needs students. It is considered \"categorical aid\" -- that is, based on a category outside of the regular funding formula.", "According to a report from the state Department of Public Instruction: \"This categorical aid is the state’s primary direct fund source to recognize the additional costs of educating pupils with disabilities. This critical aid program has widespread statewide impact providing funding for all pupils with disabilities, approximately 14 percent of Wisconsin pupils, providing equal benefit across all school districts.\"", "Evers’ request would more than double the state reimbursement rate for school districts’ special education costs, from 27 percent to 60 percent by 2019.", "\"We’re going to add $600 million to special education categorical aid; it hasn’t been raised in over a decade,\" Evers said at a primary election forum broadcast Aug. 16, 2018, by WRRD Resistance Radio \"Devil’s Advocates.\"", "Is Evers right?", "The evidence", "When asked about special education funding, a spokesman for the state Department of Public Instruction directed PolitiFact Wisconsin to the Wisconsin Legislative Fiscal Bureau, a nonpartisan entity considered the gold standard on state budget matters.", "According to the fiscal bureau, in the 2006-2007 budget, the number was just over $350 million. In every year since then, the total has been just under $369 million -- $368,939,100, to be exact.", "Abdur Chowdhury, Marquette University Department of Economics Professor Emeritus, said inflation in the U.S. from 2007-’18 averaged between 1 percent and 2 percent. Thus, he said, \"in later years, you need to provide more nominal aid in order to be equal to real aid in the early years.\"", "So, to keep up with inflation, the $368,939,100 in fiscal year 2007 aid would have to have amounted to this much in subsequent years:", "2008-’09 -- $381,741,700", "2009-’10 -- $388,003,320", "2010-’11-- $400,250,755", "2011-’12 -- $408,533,744", "2012-’13 -- $414,517,781", "2013-’14 -- $421,242,038", "2014-’15 -- $421,742,043", "2015-’16 -- $427,062,373", "2016-’17 -- $436,160,315", "At the same time, the report notes that while costs have increased, Wisconsin has experienced a decrease in special education enrollment since fiscal year 2007:", "2007-2008 -- 124,520", "2008-2009 -- 123,734", "2009-2010 -- 123,412", "2010-2011 -- 122,763", "2011-2012 -- 121,881", "2012-2013 -- 121,378", "2013-2014 -- 120,698", "2014-2015 -- 118,601", "2015-2016 -- 118,923", "2016 -2017 -- 118,209", "That represents an enrollment drop of 5.07 percent from 2007-’08 to 2016-’17. The enrollment counts for 2018-’19 are not final, but they are expected to again decrease.", "So, all this raises a question about what has happened with the per-student average -- and whether that has kept up with inflation.", "According to the Department of Public Instruction, special education costs per pupil in 2008-’09 was $10,388, with the state on average paying $2,981, or nearly 29 percent per pupil.", "In 2018, the estimated cost per pupil is at $12,084, with the state on average paying $3,140, or nearly 26 percent per pupil.", "So, had the per-pupil amount being paid by the state kept pace with inflation, it would be an estimated $3,489.18 in 2018, not the projected $3,140.", "A DPI spokesman pointed out that the per pupil figures are just special education costs, and \"those ride on top of regular education costs.\"", "The Walker team", "When asked about Evers’ claim, Walker campaign spokesman Austin Altenburg pointed PolitiFact Wisconsin to Walker education initiatives that feature targeted aid in the form of grants and other avenues for special education students:", "Altenburg did not say whether he was arguing these programs more than make up for the lack of increase in the main aid program. In any case, Evers was talking about the main categorical state aid for education, and that is what we are focusing on here.", "Our rating", "Evers said \"special education categorical aid\" from the state \"hasn’t been raised in over a decade.\"", "The Walker administration has launched several initiatives that feature targeted aid in the form of grants for special education students, but the special education categorical aid continues to be set at nearly $369 million.", "Data shows a per-pupil increase in raw dollars paid by the state, from $2,981, or 28.6 percent, per pupil in 2008 to an estimated $3,140, or 25.98 percent, paid per pupil in 2018. But that increase is more than eaten away by inflation. And the state is paying a lower share of the cost per pupil.", "We rate Evers’ statement Mostly True.", "Milwaukee Journal Sentinel, \"Tony Evers to seek unprecedented $600 million more in special education funding,\" July 30, 2018.", "Milwaukee Journal Sentinel \"Tony Evers seeks $1.4 billion increase for Wisconsin schools,\" Sept. 16, 2018.", "WRRD Resistance Radio \"Devil’s Advocate,\" candidates forum August 16, 2018, about 54.17 mark.", "Wisconsin Legislative Fiscal Bureau, Information Papers from 2004-05 to 2016-2017", "Email, Thomas McCarthy, communications director, state Department of Public Instruction, Sept. 4.", "Email, Austin Altenburg, campaign spokesman, Scott Walker, Sept. 12, 2018", "Email, Abdur Chowdhury, Marquette University Department of Economics Professor Emeritus,", "Sept. 11.", "Wisconsin Department of Public Instruction Biennial Budget Request 2017-2019.", "Email, Lisa Pugh, Survival Coalition of Disability Organizations in Wisconsin.", "Wisconsin Education Association Council, \"Evers to seek 163% increase in special education funding,\" July 30, 2018.", "Project SEARCH, News release \"Governor Walker announces success with initiatives that assist people with disabilities in gaining employment,\" April 10, 2017.", "Special Education Transitions Incentive Grants, 2017-19 Biennial Budget.", "Special Education Transitions Readiness Investment Grants, 2017-19 Biennial Budget", "CPI Inflation Calculator", "Gov. Walker’s Year of a Better Bottom Line, 2014 Initiative.", "News Release \"Governor Scott Walker announces $600,000 in Wisconsin Fast Forward grants to train workers with disabilities,\" November 13, 2014.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]