["Rep. Hank Johnson, D-Ga., introduced in January H.R. 5717, a bill that would strengthen measures to prevent gun violence. It has evoked mixed reactions from the public and moved to the forefront of conversation surrounding legislation not related to the coronavirus pandemic.", "A Facebook user made a post in late April calling the bill, known as the Gun Violence Prevention and Community Safety Act of 2020, “tyranny.” The user said the bill “will add 30% tax on all guns and 50% tax on all ammo.”", "The bill’s intent is “to end the epidemic of gun violence and build safer communities by strengthening federal firearms laws and supporting gun violence research, intervention, and prevention initiatives,” as stated in its introduction.", "If passed it would, among other measures, require individuals to obtain a license to possess firearms, raise the minimum age for purchasing firearms and require law enforcement be notified when an individual does not pass a background check.", "Sen. Elizabeth Warren, D-Mass., introduced in February a companion bill, S. 3254. Both proposals aim to restrict a class of firearms banned from 1994 to 2004 under a federal law that expired. Companion bills are meant to “promote simultaneous consideration of a measure,” according to the Senate.", "Section 803 of Johnson’s H.R. 5717 details the changes that would be made to taxes on firearms and other related items.", "It would make pistols, revolvers and other firearms taxable at 30%. Shells and cartridges would be taxable at 50%.", "In the U.S. Code, a firearm is defined as “any weapon (including a starter gun) which will ... expel a projectile by the action of an explosive,” “the frame or receiver of any such weapon,” “any firearm muffler or firearm silencer” or “any destructive device.” Destructive devices are bombs, grenades, rockets, missiles, mines or similar instruments.", "Ammunition consists of multiple subcomponents: bullets, cartridge cases, powders and primers designed to be used in a firearm, according to federal law.", "Andy Phelan, communication director for Johnson, said the legislation would increase taxes on all ammunition, which is commonly referred to as \"shells and cartridges\" in policy.", "Thirty-nine percent of the money collected from these taxes would be put toward research on and programs for gun violence prevention. The legislation does not specify how the funds would be allocated or where the other 61% of the money would go.", "Firearms and ammunition are taxed at about 10%. The taxes, collected through various avenues, are used for different purposes such as wildlife preservation and hunter safety and education.", "The bill was referred to the Subcommittee on Crime, Terrorism and Homeland Security in late March. It has not been voted on by the House.", "Under H.R. 5717, firearms would be taxable at 30%, and ammunition would be taxable at 50%. A portion of these taxes would be used toward gun violence prevention research. We rate this claim as TRUE because it is supported by our research.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook."]