["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Assemblymember Ron Kim has been concerned about nursing home residents during the COVID-19 pandemic, and his policy disagreements with Gov. Andrew Cuomo garnered national attention after he said Cuomo bullied him during a phone call.", "New York approved broad legal protections for health care facilities during the pandemic as part of the 2020-21 state budget. The protections, retroactive to March 7, were meant to relieve some of the burden on the health care system amid an emergency. They were narrowed in August.", "But legislators have said the protections were not widely known when the New York State Legislature passed the budget in April. Kim, who voted against the budget for other reasons, said that he found out about them from a reporter months later.", "In an interview with Brian Lehrer on WNYC, the Queens Democrat said that Cuomo \"issued a legal blanket immunity, and snuck that into our budget, giving these facilities essentially a license to kill, a get-out-of-jail free card.\"", "These legal protections are a source of concern for people whose loved ones died in nursing homes, and we wondered about the breadth of the legal immunity granted to nursing homes.", "Kim said the provision grants health care facilities \"legal blanket immunity.\"", "The protections are broad, but even nursing home advocates say they don’t provide blanket immunity. The original provision limited liability for health care workers, administrators, board members, and health facilities, including hospitals and nursing homes, as long as a state of emergency remains in effect. It pertained to the care of any patient, whether sick from COVID-19 or not. An amendment to the law in August limited the scope of the law to only coronavirus patients.", "Under the law, health workers and health facilities \"shall have immunity from any liability, civil or criminal, for any harm or damages\" related to the delivery of health care. The law does not apply in cases of \"willful or intentional criminal misconduct, gross negligence, reckless misconduct, or intentional infliction of harm …\" But it also states that \"acts, omissions or decisions\" resulting from shortages of staff or resources should not be considered \"willful or intentional criminal misconduct, gross negligence, reckless misconduct, or intentional infliction of harm.\"", "Margaret Somerset, a lawyer with Underberg & Kessler in the Rochester area who represents nursing homes, said that the law only provides qualified immunity from civil and criminal prosecution if the medical provider does not act with gross negligence or recklessness.  She also said that the law specifically states that shortages of PPE or staffing may not be used as evidence of gross negligence or recklessness. The law was also amended in August 2020 to limit its application to providers engaged in either diagnosing or treating Covid-19 patients.", "A report from state Attorney General Letitia James said the law should not be interpreted to mean it provides \"blanket immunity,\" but it also raised concerns.", "\"Due to several recent changes in law, it is unclear to what extent facilities or individuals can be held accountable if found to have failed appropriately to protect the residents in their care,\" the report said. It also said James disagrees with any interpretation that the law provides blanket immunity for things other than intentional harm, even when related to intentional resource and staffing allocations, calling it \"illogical, contrary to public policy, and contrary to the law’s intent.\"", "Nina A. Kohn, a distinguished scholar in elder law at Yale University and a law professor at Syracuse University, said Kim’s use of \"blanket immunity\" is how she would expect a layperson to use the term. But legally speaking, it’s not accurate, because the law does not say that you can never be held liable for anything.", "Nonetheless, Kohn said, the law gives \"a green light for facilities to understaff and underresource. The language seems plain to me.\"", "The exceptions, however, such as gross negligence, can be difficult to prove. James Snyder, a plaintiff’s lawyer in the Syracuse area who has written about the immunity law, said gross negligence exists in New York law, \"but imposes an incredibly high burden of proof upon  anyone attempting to make a claim for personal injury pursuant to it.\"", "Kim said the governor snuck the immunity protections into the budget. Kim’s chief of staff, Tony Cao, told us that when Kim inquired about the provision, once he learned about it after the budget vote, he was told by Assembly leadership that the administration fought forcefully for the provision, telling both houses it was non-negotiable.", "Kim’s office also provided a letter from the Greater New York Hospital Association, which hailed the passage of the provision. \"GNYHA drafted and aggressively advocated for this legislation,\" President Kenneth Raske wrote to the association’s members.", "We asked the Cuomo administration about the provision, and aides said that the budget, which is voted on by legislators, is the subject of negotiations between the executive chamber and both houses of the State Legislature.", "\"It’s an impossibility to ‘sneak’ anything in to the budget — we engage with legislative staff in ongoing negotiations throughout the budget process, those staff must physically sign off on every individual provision before the bill is printed, and every legislator can of course read the language themselves,\" said Beth Garvey, special counsel and senior advisor to Cuomo.", "The budget bills run hundreds of pages, and lawmakers typically have only hours from the time they are printed until the vote. The Assembly passed the 2020-21 budget in the wee hours of the morning.", "Kim said that nursing homes have \"essentially a license to kill\" and a \"get-out-of-jail free card.\"", "Cao, Kim’s chief of staff, said that isn’t hyperbole. When the order granting immunity is combined with other measures the administration took to ease the burden on health care workers and institutions navigating an unforeseen crisis -- as well as the high bar to prove gross negligence, recklessness or intentional harm in court --– he said families have little recourse if their loved ones were harmed in nursing homes during the pandemic.\n \nCao pointed to an executive order relaxing paperwork requirements, which expired at the end of December. \"Any person acting reasonably and in good faith under this provision shall be afforded absolute immunity from liability for any failure to comply with any recordkeeping requirement,\" it stated. Without paperwork documenting patients’ conditions, and with the pandemic preventing visits by family members, building a case is impossible, Cao said.\n \nThe Cuomo administration said the expectation and intent of the recordkeeping order was not that facilities would keep no records, but that they did not always have to stringently complete records at all times during the emergency, Garvey said. Many of those records were finalized after the fact, she said.", "The Cuomo administration’s position is that the intent of the law was to prevent lawsuits unless there was intentional misconduct. If a facility accepted patients it could not care for properly due to staff or resource shortages, that could be intentional misconduct, she said.", "But the attorney general’s report raises the possibility of a loophole in the law. It states that the law \"is silent as to whether the safe-harbor for ‘resource or staffing shortage’ is to be assessed only based on conditions that arose as a result of the COVID-19 emergency or whether it\" applies to shortages that existed before the emergency declaration.", "The attorney general’s investigation found that poorly staffed nursing homes had higher death rates. James recommends eliminating the immunity provisions because they \"can provide financial incentives to for-profit nursing home operators to put residents at risk of harm\" by not employing enough caregivers or purchasing enough personal protective equipment.", "Kim said that a law protecting health care facilities gave them \"blanket immunity,\" was snuck into the budget by Cuomo, gave health care facilities get out of jail free cards and a license to kill.", "The law contained broad protections, but doesn’t grant blanket immunity. Experts disagree on how broad the protections are. It will likely take court cases to resolve that question.", "While Cuomo may have fought aggressively for the law during budget negotiations, saying that he \"snuck it in\" minimizes the legislature’s role. Staff and leaders knew about the provision even if many members didn’t. \n  \nKim’s use of \"essentially\" when describing a \"license to kill\" modifies it somewhat. Even the Attorney General’s Office said it is unclear to what extent facilities or individuals can be held accountable if found to have failed appropriately to protect the residents in their care. But the law contains exceptions for some criminal conduct.", "Coupled with other actions the Cuomo administration took to aid health workers and prevent virus transmission in nursing homes - relaxing recordkeeping requirements related to patient care and prohibiting visitors - families will have difficulty winning cases against nursing homes.\n  \nKim conveyed the difficulty families have in holding nursing homes accountable, but his statement goes too far because the the immunity protections do not cover everything.", "He made a compelling statement that has elements of truth.\n \nWe rate his statement Half True.", "WNYC, The Brian Lehrer Show, interview with Assemblymember Ron Kim, Feb. 18, 2021. Accessed Feb. 22, 2021.", "New York State Office of the Attorney General Letitia James, \"Nursing Home Response to COVID-19 Pandemic,\" revised Jan. 30, 2021. Accessed Feb. 22, 2021.", "New York Post, article, \"Cuomo threatens Democrat Ron Kim over nursing home scandal: ‘You will be destroyed’\" Feb. 17, 2021. Accessed Feb. 23, 2021.", "The Guardian, op-ed, Assemblymember Ron Kim, \"Why did Governor Cuomo give nursing homes immunity from Covid deaths?\" Feb. 23, 2021. Accessed Feb. 27, 2021.", "NPR, \"New York Law Gives Nursing Homes Protection In COVID-19 Death Suits,\" Feb. 20, 2021. Accessed Feb. 27, 2021.", "Phone interview, Beth Garvey, special counsel, Gov. Andrew Cuomo, Feb. 26, 2021. Follow-up email interview, March 1, 2021.", "Phone interview, Nina A. Kohn, David M. Levy Professor of Law, Syracuse University College of Law; Distinguished Scholar in Elder Law, Solomon Center for Health Law & Politics, Yale Law School, Feb. 23, March 2, 2021. Follow-up email interview, March 1, 2021.", "Email interview, Richard J. Mollot, Executive Director, The Long Term Care Community Coalition, Feb. 23, 2021.", "Email interview, Tony Cao, chief of staff, Assemblymember Ron Kim, Feb. 24-March 1, 2021.", "Greater New York Hospital Association, member letter, April 2, 2020. Accessed Feb. 27, 2021.", "Phone interview, Margaret Somerset, partner, Underberg & Kessler, Feb. 27, 2021.", "The New York Times, article, \"Nursing Homes Are Hot Spots in the Crisis. But Don’t Try Suing Them,\" May 13, 2020. Accessed Feb. 27, 2021.", "New York State Budget Bill A. 9506 - B, Part GGG, 2019-20 Legislative Session. Accessed Feb. 28, 2021.", "National Conference of State Legislatures, COVID-19: State Health Actions, Feb. 23, 2021. Accessed Feb. 28, 2021.", "Associated Press, \"NY Rolls Back Legal Immunity for Hospitals, Nursing Homes,\" Aug. 4, 2021.  Accessed Feb. 28, 2021.", "Barclay Damon, \"2021 NYS Budget Grants Immunity to Health Care Providers During COVID-19, Shortens the Statute of Limitations for Collections, and More,\" April 6, 2020. Accessed March 1, 2021.", "Assemblymember Ron Kim, report, \"Corporate Immunity Kills, Draft Two,\" May 2020. Accessed March 1, 2021.", "Office of the Inspector General, U.S. Department of Health and Human Services, \"Early Alert: The Centers for Medicare & Medicaid Services Has Inadequate Procedures To Ensure That Incidents of Potential Abuse or Neglect at Skilled Nursing Facilities Are Identified and Reported in Accordance With Applicable Requirements,\" August 24, 2017. Accessed March 1, 2021.", "New York State Executive Order No. 202.10: \"Continuing Temporary Suspension and Modification of Laws Relating to the Disaster Emergency,\" March 23, 2020. Accessed March 1, 2021.", "Underberg & Kessler, \"How Does the New Immunity Law in NY Apply to Health Care Providers During the COVID-19 Emergency?\", April 23, 2020. Accessed March 1, 2021.", "The Daily Poster, \"‘They Can’t Hold The Nursing Homes Responsible,’\" March 2, 2021. Accessed March 2, 2021.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]