["A video of a woman escorted by a police officer with a mob walking along with them is being shared on social media. It is being claimed that the woman was a child-kidnapper. “मेहंदी गंज में बच्चा चोर महिला ने मेहंदी गंज से बच्चा ले कर भाग रही थी इसी बीच में शोर होने पर सभी ने उसे पकड़ने में सफल हुआ उस महिला से पूछ टाछ करने पर पता चला कि पैसा लेकर बच्चा चोरी करती है और उसके पति के पास दो और बच्चा की जानकारी मिला है इसमें पुलिस छान बीन कर रही है (A woman child-lifter was running away after kidnapping a child in Mehdiganj. In the midst of this, people were able to catch her on her noises. On interrogation, it was found that she kidnaps children for money and her husband has two more children with him -translated)”, reads a message posted by one Dhiraj Gupta. The post that includes two more photographs of the incident claims that this child-lifter was caught by locals in Mehdiganj area of Bihar’s Patna city.", "मेहंदी गंज में बच्चा चोर महिला ने मेहंदी गंज से बच्चा ले कर भाग रही थी इसी बीच में शोर होने पर सभी ने उसे पकड़ने में सफल…", "Posted by Dhiraj Gupta on Sunday, 18 August 2019", "Several other individuals on Facebook have posted the message with an identical narrative.", "With a keyword search on Google, we found a Dainik Jagran report published on August 19, 2019. A group of people had beaten a woman over the suspicion of her being a child-lifter. According to the report, people who were part of the mob claimed to have heard a rumour that a 35-year-old woman was trying to lift a seven-year-old child. The mob rounded up this woman suspecting her to be a child-kidnapper. The woman tried explaining to the mob that she merely approached a few children and spoke to them while walking on the street but the mob refused to lend ears. Police can be seen in the video because they rescued the woman from the enraged mob and escorted her to safety.", "Patna based local news portal Newscity reported that the woman was mentally unstable. Alt News reached out to Mehdiganj police station. We were informed that senior police officers confirmed that she was not a child-lifter. It was also reiterated to us that the woman was mentally ill.", "We also spoke to a senior official at Patna (city) police who corroborated the set of events. When asked whether the woman was mentally ill or not, the officer said that it was not their job to confirm her mental-illness while maintaining that it was established that she was not a child-lifter.", "In conclusion, a video of a woman who was falsely accused of child-lifting was circulated to suggest that a child-kidnapper was arrested by the police in Patna, Bihar. However, the police were escorting the woman to safety.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]