["About this rating", "A violent incident took place in an area known as Cosy Corner in Torquay, a town on the southeast Australian coast.", "How many men were involved in the fight, what their religions were, how the fight got started, who was to blame, what the outcome was, and whether religion had anything to do with the altercation.", "In September 2016, an online image was circulated online making the claim that an Australian veteran named Kyle Tyrrell had \"beat the living shit out of 8 Muslims single-handedly after the Muslims attacked his wife.\"", "The claim originated with a January 2016 altercation that occurred on a beach known as Cosy Corner, in the Australian coastal town of Torquay. While it's unclear exactly how many people were involved in the scuffle or how anybody could tell the purported harassers were Muslim just by looking at them, local news media reported that Tyrrell sent one person, not eight, to the hospital with injuries. And while the reports said police were investigating the incident, we found no follow-ups detailing the outcome of that investigation. We have reached out to Victoria police for records on the incident but have not yet received a response.", "Whatever transpired, the incident has become an anti-Muslim rallying cry on social media and on some white supremacist web sites. But while an anti-Muslim statement was attributed to Tyrrell, we found no evidence that he had actually posted it.", "According to local news reports from January, the incident apparently started over a disagreement about the legality of catching crabs in the area:", "Mrs Tyrrell, 30, said on seeing one of the men put a crab pot in the water, she told him the area was a marine sanctuary and fishing was banned.", "“Liana said nicely to him that if you put that in there, you may get in trouble, as you are not meant to have it. That was it, and he turned on her,” Mr Tyrrell said.", "He said he heard his wife’s screams and, seeing a man attacking her, ran to her aid. After he got the man into a headlock, he said up to eight other men ran in.", "The war veteran, a qualified instructor in the martial art of Krav Maga, said he ended up on the ground and was kicked in the head. The couple believe the attack was racially and culturally motivated.", "But while reporters spoke to the Tyrrells, we could find no accounts of their having talked to the people he supposedly fought with.  At the time, the Australian Herald Sun tabloid reported that Tyrrell allegedly wrote an inflammatory social media post referring to the men as \"Muslim scum,\" but we could not locate or verify that post. Tyrrell, a martial arts instructor, posted on his business page about receiving a black eye from the fight, but he made no mention of his opponents' religion:", "When you're outnumbered in an altercation your best defence is to FIGHT hard, NEVER give up and switch into BEAST mode. No-one says you won't be injured but you MUST FIGHT for your safety and your families safety and odds are your injuries will be far less than if you remain passive or defensive. Be the BEAST!!!", "A man who calls himself Paul Chicken Dyer and claims to know Tyrrell personally posted a description of the incident on his Facebook page, which he said was a message from Tyrrell. That message reported Tyrrell's wife was hit and insulted by several men, and that the fight took place in front of the couple's children. Dyer has not yet responded to an inquiry about the post.", "Tyrrell, an Australian Army veteran, made headlines in 2013, when he was profiled by the Sydney Morning Herald after returning home from Iraq. In the piece, the then-44-year-old Tyrrell described the difficulties he had adjusting to civilian life after living and fighting in a war zone:", "The problem is that there's a lot of modification at the beginning - it's reinforced with every course you do, every operation you complete, throughout combat, and then you come back from Baghdad and know you survived because of that training - and then there's nothing at the end, no untraining.", "'They cut you loose, and most people come out and say, 'The civilian world is f---ed. Look at how they think. Look at their expectations, their sense of urgency, what they value.' But that's the real world.\"", "Other publications reported that Tyrrell (who lives near the beach where the fight occurred) suffered a \"minor injury\" from the scuffle, and that one man was taken to the hospital by ambulance. None of the reports indicated that his wife was injured. Police said they were investigating the incident, but it remains unclear whether charges were filed against anyone involved in the scuffle.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]