["About this rating", "A few days before the release of \"A Beautiful Day in the Neighborhood,\" a movie starring Tom Hanks about children's television host Fred Rogers, a representative for Ancestry.com told CBS News that the two men were related:", "Tom Hanks bears a shocking resemblance to children's television star Fred Rogers, who he plays in the upcoming film \"A Beautiful Day in the Neighborhood.\" But the similarities are more than just good casting — the performers are actually related, according to a discovery made by Ancestry.com.", "Hanks is sixth cousins with Rogers, and they share the same great-great-great-great-great grandfather, Johannes Mefford, a company representative told CBS News. The company utilized its database of over 20 billion online historical records to form Hanks' family tree, the representative said.", "We have no reason to doubt Ancestry.com's claim. However, some readers may not quite understand just how distant a distant cousin really is.", "The genealogy website reported that Rogers and Hanks are sixth cousins who share a 5x great-grandfather (or a great-great-great-great-great-grandfather). Here's how Ancestry.com described Hanks relationship to Rogers:", "Fred Rogers and Tom Hanks are sixth cousins sharing the same 5x great-grandfather, Johannes Mefford, who immigrated from Germany to America in the 18th century. Johannes raised a family of patriots; three of his sons (including Tom Hanks’ and Fred Rogers’s ancestors) served in the Revolutionary War. Fred Rogers’s 4x great-grandfather, William Mefford, served in the navy and was captured by the British in 1782. He endured life on a prison ship in Barbados and Antigua until he was released ten months later. Tom Hanks’s 4x great-grandfather, Jacob Mefford, joined the War as a private and participated in a skirmish at Chesapeake Bay. So, Rogers and Hanks not only share the same ancestor, they also descend from two brothers who fought for America’s independence.", "While it may be \"true\" to say that Hanks and Rogers are related, phrasing their relationship this way is a bit misleading.", "We found varying estimates about just how closely related sixth cousins really are, but the general conclusion was that these \"relatives\" were very distant. For instance, a study by Ancestry DNA in 2014, based on British birth rates and census data, found that the average person in Britain had about 175,000 sixth cousins.", "While it's true that Hanks and Rogers are related, they are distant cousins who probably don't share much in terms of DNA. But don't let that take away from Hanks' performance as Rogers in \"A Beautiful Day in the Neighborhood\":", "We reached out to the Association of Professional Genealogists and the International Society of Genetic Genealogy. We will update this article when more information becomes available.", "Garrand, Danielle.   \"Tom Hanks Discovers He's Related to Mister Rogers Days Before 'A Beautiful Day in the Neighborhood; Released.\"\r\n    CBS News.   20 November 2019.", "Mirror.   \"Average British Person Has 193,000 Living Cousins Says New Research.\"\r\n    17 June 2015.", "Correction [21 November 2019] A table about the probability of sixth cousins sharing DNA was mischaracterized and removed from the article.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]