["The governors of several states have announced changes in COVID-19 restrictions since the Biden administration's vaccination plan spurred a mass vaccination effort, USA TODAY has reported.", "In a decision President Joe Biden called \"a big mistake,\" five states have rolled back mask mandates in the past month, according to USA TODAY. The Centers for Disease Control and Prevention recommends the wearing of face masks to slow the spread of the virus that has killed more than 530,000 Americans.", "The governors who have made the decision to relax mask regulations are all Republicans, according to a viral Facebook claim.", "The meme \"16 States With No Mask Mandates\" lists Alaska, Arizona, Florida, Georgia, Idaho, Iowa, Mississippi, Missouri, Montana, Nebraska, North Dakota, Oklahoma, South Carolina, South Dakota, Tennessee and Texas, with their corresponding governors, all with \"R's\" next to their names.", "\"What do all of these have in common?\" the meme states.", "The Facebook post, dated March 4, is one of several similar posts on the site. USA TODAY reached out to the poster for comment.", "Fact check:Michigan has no executive order for masks, but it does have a mask mandate", "Texas Gov. Greg Abbott's issuance of an executive order lifting a statewide mask mandate and reopening businesses at full capacity made headlines; USA TODAY reported on the order on March 4.", "More than 43,000 Texans have died of COVID-19.", "As of March 3, about 8% of the U.S. population had been vaccinated, according to USA TODAY.", "In a statement released March 2, Abbott, a Republican, said Texas has the necessary medical advancements needed to protect its residents from the virus.", "\"We must now do more to restore livelihoods and normalcy for Texans by opening Texas 100 percent. Make no mistake, COVID-19 has not disappeared, but it is clear from the recoveries, vaccinations, reduced hospitalizations, and safe practices that Texans are using that state mandates are no longer needed,\" he said, according to the statement.", "Abbott is not the only governor to relax or rescind mask requirements, nor is he the first. The Facebook posts accurately list the 15 other states' governors that either lifted  a mask mandate or never adopted one, according to USA TODAY, but the reasons vary.", "Republican Gov. Mike Dunleavy never issued a statewide mask mandate, according to a March 10 news release, but he signed an executive order last November amid a COVID-19 case surge that required masks and social distancing for employees and visitors at state work sites, according to the office of the governor. Austin Quinn-Davidson, acting mayor of Anchorage, adopted a mask mandate in his city, according to a March 4 news release.", "Arizona never underwent a statewide shutdown, according to a March 4 news release from the office of Gov. Doug Ducey. Ducey, a Republican, issued an executive order that extended mask protocols for businesses and allowed occupancy limitations to expire, according to the press release. The cities of Avondale, Peoria, Glendale, Scottsdale and Tempe have mask mandates in place for businesses, The Arizona Republic reported in February.", "Republican Gov. Ron DeSantis issued an executive order last March declaring a state of emergency in the state of Florida, according to the office of the governor. The order referenced the wearing of face masks under the advisement of a health care provider or public health official, but DeSantis never issued a statewide mask mandate. Some local governments instituted regional masks requirements, according to local affiliate Fox 13 Tampa Bay.", "Gov. Brian Kemp strongly encouraged all Georgia residents to \"wear face coverings as practicable while outside their homes or place of residence, except when eating, drinking or exercising outdoors\" in an Aug. 15 revision of an executive order issued last March. But Georgia does not have a statewide mask mandate. Kemp is a Republican.", "Masks are required in long-term care facilities throughout the state, according to the office of Gov. Brad Little, but Idaho has not adopted a statewide mandate. Face coverings are \"strongly recommended,\" per a Feb. 2 news release. Little is a Republican.", "Iowa does not have a statewide mask mandate.", "Republican Gov. Kim Reynolds  lifted mask requirements and operational capacity limits for businesses in February. Select cities and counties throughout the state upheld their mask mandates, according to local NBC affiliate KWWL.", "Mississippi Gov. Tates Reeves' executive order to rescind masks requirements and permit businesses to resume full operations is effective from March 3-31, \"unless otherwise modified, rescinded or extended,\" the Clarion Ledger reported. Reeves is a Republican. Some cities in Mississippi retained mask mandates.", "Gov. Michael Parson, a Republican, advocated for local government control over mask mandates instead of a statewide requirement as early as November, local NBC affiliate KSDK reported. Various cities and counties have adopted requirements, the Springfield News-Leader reported March 6.", "Montana's statewide mask mandate expired Feb. 10, according to a directive issued by Republican Gov. Greg Gianforte, per a Feb. 12 statement. An executive order signed on the same day offers a liability shield to businesses, nonprofits and other entities that \"protect their workers, their customers, and their clients from the spread of COVID-19,\" according to the statement.", "Republican Gov. Pete Ricketts announced late last year that he doesn't \"think mask mandates are appropriate,\" the Lincoln Journal Star reported Dec. 23. Masks are required in salons and barbershops, at massage therapy, bowling alleys, pool halls, \"body art establishments\" and any other business where staff and patrons are within 6 feet of each other for at least 15 minutes, according to a Nov. 11 column released by the governor's office. Local governments require masks for their citizens and patrons, The Associated Press reported last November.", "Gov. Doug Burnum, a Republican, ordered a mask mandate throughout the state last November, and, despite encouraging residents to wear masks in public, he allowed the order to expire in January, the Grand Forks Herald reported. Several of the state's larger cities retained their mandates, the paper reported in February.", "Oklahoma Republican Gov. Kevin Stitt has not ordered a statewide mask mandate, and announced plans to roll back remaining COVID-19 restrictions, including masks requirements in state buildings, this month, The Oklahoman reported March 11. Tulsa still has an effective mask mandate; Oklahoma City's will remain in place until April 30, according to the paper.", "Republican Gov. Henry McMaster issued an executive order lifting mask requirements in state buildings and restaurants on March 5, according to the office of the governor. The order did not prohibit local governments from retaining their mask requirements. More than 40% of South Carolina residents live in areas that require masks, according to The State.", "According to a government website,\"Masks have never been required, but South Dakotans are encouraged to continue to consider CDC guidance and use.\" South Dakota Gov. Kristi Noem is a Republican.", "Republican Gov. Bill Lee granted mayors in 89 Tennessee counties the power to enforce mask mandates in the event of a COVID-19 case surge, according to a July 3 news release. There is no statewide mask requirement. A state-sanctioned \"TN Strong Mask Movement\" partnered an economic recovery group with flagship brands to \"distribute over 300,000 free or low-cost cloth face coverings across the Volunteer State,\" according to Tennessee business guidance.", "We rate this claim MISSING CONTEXT, based on our research, because without additional information, it could be misleading. A Facebook post accurately lists 16 states without statewide mask mandates, along with their Republican governors. But the claim did not include certain conditional mandates, such as mask requirements adopted and upheld by local governments. Some states had mask mandates that expired; the meme doesn't account for those instances.", "Contributing: The Associated Press", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook."]