["About this rating", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "In early December 2020, social media users shared rumors that the \"head of Pfizer research\" had warned that the drug company's new COVID-19 vaccine would cause sterilization in women.", "The story was sourced from a blog called Health and Money News and referenced statements made by Michael Yeadon, who is not the head of Pfizer research. Yeadon did work for Pfizer but left the company in 2011, according to his biographical information in the blog \"Lockdown Sceptics,\" to which Yeadon has contributed. His title at Pfizer was vice president and chief scientist for allergy and respiratory.", "Yeadon and German physician Wolfgang Wodarg sent a letter to the European Medicines Agency, calling on EMA to halt clinical trials of Pfizer's COVID-19 vaccine in the European Union. In the letter, Wodarg and Yeadon stated that the Pfizer vaccine blocks a protein that is key in the formation of the placenta in mammals, and they claimed that it's possible women who receive the vaccine could become infertile. However, they did not state as fact that the vaccine causes sterility, as the Health and Money News headline suggests.", "Pfizer announced on Dec. 2, 2020, that it obtained permission from public health officials in the U.K. to begin administering the vaccine. As The Associated Press reported, \"Britain’s Medicines and Healthcare Products Regulatory Agency recommended the vaccine after clinical trials involving tens of thousands of volunteers showed it was 95% effective and turned up no serious side effects. The vaccine is still considered experimental while final testing is done.\"", "We reached out to Pfizer for comment but didn't receive a response in time for publication, although there was no mention of risk of sterility in Pfizer's publicly available study. In a Nov. 20, 2020, press release Pfizer said no significant safety concerns have been observed during vaccine studies.", "Both Wodarg and Yeadon have spread COVID-19 misinformation in the past. Yeadon falsely claimed in an October 2020 blog post that the \"pandemic is effectively over.\" Wodarg falsely claimed in a March 2020 YouTube video that the virus was no more harmful than the seasonal flu.", "The COVID-19 disease is deadlier than the flu, and the pandemic is not over. The virus has resurged in Europe and the United States in the fall of 2020. As of this writing it has killed more than 1.5 million people globally and almost 280,000 Americans have died.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]