["About this rating", "As of spring 2020, the U.S. White House presidential portrait-reveal ceremony will likely not take place anytime soon according to sources close to the matter, an NBC report says.", "It is unclear when or if the ceremony will take place sometime in the future, or while Trump is still president.", "A decades old presidential tradition may hit the brakes in 2020 owing to a bitter divide between U.S. President Donald Trump and his predecessor, Barack Obama. The presidential portrait ceremony usually takes place when a first-term president hosts his predecessor in the White House for an event in which they unveil the former president and first lady's portraits that will hang in the White House for posterity. According to NBC News, acrimony between the two men likely will result in no ceremony in 2020.", "Republican and Democrat presidents have jointly participated in this ceremony for decades, even when they criticized each other or had major political differences. This year, however, Trump accused Obama of an unspecified crime with no evidence, furthered old conspiracy theories against him, and blamed the handling of the current COVID-19 coronavirus pandemic on the previous administration.", "Neither president seems to want to participate in an event with the other, according to NBC:", "... this modern ritual won't be taking place between Obama and President Donald Trump, according to people familiar with the matter. And if Trump wins a second term in November, it could be 2025 before Obama returns to the White House to see his portrait displayed among every U.S. president from George Washington to Bush.", "Trump is unconcerned about shunning yet another presidential custom, and he has attacked Obama to an extent no other president has done to a predecessor. Most recently he's made unfounded accusations that Obama committed an unspecified crime.", "Obama, for his part, has no interest in participating in the post-presidency rite of passage so long as Trump is in office, people familiar with the matter said.", "Spokespeople for both Obama and the White House declined to comment on the above report.", "This is not the first time the portrait tradition has been in peril. President Jimmy Carter appears to have not attended a ceremony for his official portrait when Ronald Reagan was in office.", "Gerald Rafshoon, Carter's White House communications director, told NBC News that he didn't know the details of why a ceremony didn't happen, but he said that Carter was focused on setting up his library after leaving office and that a ceremony in his honor wouldn't have been his style.", "\"It would probably be out of his character to want a big ceremony in Washington that soon,\" Rafshoon said. \"I would imagine he opted not to have it.\" Carter's portrait did make its way to the White House.", "According to CNN, Trump and Obama have met only once in person since Trump's Inauguration Day — at the funeral for former President George H.W. Bush in December 2018, when they shook hands briefly at the start of the service but didn't interact for the remainder of the day.", "Unclear is whether an official ceremony for Trump and Obama will take place sometime in the future, though it is unlikely to happen while Trump is in office. Given that, we rate this claim as \"Mostly true.\"", "Lee, Carol E.  \"White House Portrait Ceremony May Be the Latest Casualty of the Political Divide.\"\r\n    NBC News. 19 May 2020.", "Liptak, Kevin.  \"Trump Looks to Advance Unfounded Obama Crime Conspiracy.\"\r\n   CNN.  18 May 2020.", "Liptak, Kevin; Klein, Betsy; Bennett, Kate. \"Obama White House Portrait Unveiling Not Expected as Trump Accuses Him of Crime.\"\r\n    CNN.  19 May 2020.", "Nur Nasreen Ibrahim is a reporter with experience working in television, international news coverage, fact checking, and creative writing.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]