["By Vanessa Schipani", "Posted on August 26, 2016", "Green party presidential candidate Jill Stein cherry-picked the findings of a disputed study when she claimed that global warming would cause sea levels to rise on average “not one yard but many yards” in as soon as 50 years. Scientific consensus says a more realistic rise is 0.33 to 1.33 yards above current levels by 2100.", "Stein made her claim in Washington, D.C., on Aug. 23 during a press conference in which she discussed her Aug. 21 visit to flooded areas in Louisiana and the natural disaster’s link to climate change.", "According to a 2016 report by the National Academies of Sciences, global warming is expected to lead to more moisture in the atmosphere. This, in turn, can increase the frequency of extreme rainfall events like the one that recently took place in Louisiana.", "Primarily affecting regions around Baton Rouge and Lafayette, the flood damaged tens of thousands of homes and killed 13 people, reported NPR. The Red Cross also called the flood “likely the worst natural disaster in the United States since 2012’s Superstorm Sandy.”", "Stein did accurately state, “Any one storm cannot be definitively pegged to climate change, but when you see so many at such extreme levels, there’s no question, according to the scientists, that this is a consequence of warmer air that holds much more water.” But then she moved on to exaggerate the extent of projected sea level rise.", "Stein, Aug. 23: There are these growing warnings about sea level rise, according to James Hansen, the foremost climate scientist … he is predicting meters-worth, that is yards-worth — not one yard but many yards worth — of sea level rise as soon as 50 years from now. And that of course would be an absolutely devastating sea level rise that would essentially wipe out coastal population centers, including the likes of Manhattan, and Florida and so on, and actually all over the world, the entire country of Bangladesh.", "This isn’t the first time Stein has exaggerated the extent of projected global sea level rise. But it is the first time she has cited Hansen’s work while making her claim.", "Hansen, a climate scientist at Columbia University, and colleagues did conclude, “Continued high fossil fuel emissions this century are predicted to yield … sea level rise, reaching several meters over a timescale of 50–150 years” in a study published in the journal Atmospheric Chemistry and Physics in March 2016.", "However, reports by the Intergovernmental Panel on Climate Change and the U.S. Global Change Research Program, which are both collaborations of hundreds of scientists, project a much smaller rise over a longer period than Hansen.", "The 2013 IPCC report predicts an average rise of between 0.26 to 0.98 meters (1 meter = 1.09 yards) in the global sea level by 2100, with the higher end entailing a high greenhouse gas emissions scenario.", "The 2016 Global Change report similarly projects a 1 to 4 feet (3 feet = 1 yard) rise by 2100. However, the report also states, “In the context of risk-based analysis, some decision makers may wish to use a wider range of scenarios, from 8 inches to 6.6 feet by 2100.” Still, 6.6 feet translates to 2.2 yards, which is not “many” yards, and it also would not occur in “as soon as 50 years.”", "In his paper, Hansen and colleagues argue that ice covering the North and South poles will melt at rates much faster than predicted by the IPCC and others. Instead of a linear rate, the researchers argue the rate will grow exponentially, doubling every 10, 20 or 40 years. This will lead to “multi-meter” global mean sea level rise in about 50, 100 or 200 years, respectively, the authors conclude.", "But the group also admits that, while the data they analyzed are “consistent with” a multi-meter sea level rise in around 50 years, they “cannot exclude slower responses.” This is why the researchers give a timescale of 50 to 150 years to reach several meters of sea level rise.", "In an email to us, Hansen also explained, “If we stay on business-as-usual high emissions, I would say that several meters [of sea level rise] is unlikely in 50 years, though possible. In 100 years it is likely, and I can’t see how it could be avoided in 200 years.”", "But back in March, Michael Mann, director of the Earth System Science Center at Penn State University and a lead author on a chapter of the IPCC’s third report, told The Guardian: “I’m always hesitant to ignore the findings and warnings of James Hansen; he has proven to be so very prescient when it comes to his early prediction about global warming. That having been said, I’m unconvinced that we could see melting rates over the next few decades anywhere near his exponential predictions, and everything else is contingent upon those melting rates being reasonable.”", "In 1988, Hansen, then a NASA scientist, testified before Congress on the dangers of global warming. His testimony instigated broader awareness of the issue, which has led some to call him the “father of climate change awareness.”", "Steven Goodbred Jr., an environmental scientist at Vanderbilt University and expert on sea level rise in Bangladesh, agrees with Mann that Hansen’s warnings should be heeded, but also said Hansen’s latest findings are over the top. “Meters of sea level rise would require major collapse of Greenland or East Antarctic ice sheets,” Goodbred told us by email. “While improbable, the evidence that Hansen et al put forth warns us not to think impossible.”", "Goodbred also told us issues in Bangladesh, which Stein mentioned specifically, can’t be boiled down to sea level rise. The Ganges and Brahmaputra rivers, which flow from China and India to Bangladesh, together “deliver the largest sediment load on earth” at around 1 billion metric tons per year, he explained. “That sediment distributed across Bangladesh’s low-lying coastal region could keep pace” with the current rate of sea level rise, “perhaps with relatively limited consequences (though certainly not none).”", "Along these lines, “any reduction in that supply would harm the system’s ability to respond to sea level rise,” added Goodbred. “Threats to sediment delivery (that are more probable than Hansen et al scenarios) include dam construction, water diversion, and increased irrigation/water extraction in upstream areas of India and China.” Many of these modifications to the river systems are already planned or ongoing, he said, and represent as much of a threat to Bangladesh as sea level rise does.", "Mann told us the situation in Florida and Manhattan, which Stein also pointed to specifically, can’t be reduced to sea level rise either. “Even 5-6 m of sea level rise would not submerge New York City, or most of Florida,” he said.", "“Due to the threat to our coastlines from the combined effect of sea level rise and potentially more potent hurricanes, we might indeed be looking at managed retreat from coastal regions like Miami and New York City on a timeframe of 50 years,” he added. “But it wouldn’t be because of inundation of these regions. It would be because the cost to insure property would become prohibitive given the greatly increased coastal risk.”", "In other words, Miami and Manhattan probably won’t be completely underwater in 50 years, but it may become too expensive for many to live there due to increased property insurance costs.", "Stein was on the mark when she said warmer air, which can hold more water, has the potential to bring about more extreme weather events, such as the one in Louisiana.", "But her claim that global warming would cause sea levels to rise on average “not one yard but many yards” in as soon as 50 years is “an example of a greatly exaggerated version of reality that has a kernel of truth to it,” Mann told us.", "Current scientific consensus puts the likely global mean sea level rise at a maximum 1.33 yards above current levels by 2100. And for Manhattan, Florida and Bangladesh in particular, issues go above and beyond sea level rise.", "Editor’s Note: SciCheck is made possible by a grant from the Stanton Foundation.", "https://www.sharethefacts.co/share/39f9cc08-1151-4828-9ed6-823ce98a878a", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]