["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Students led by Montana Moore place flowers on the benches outside a University of Texas at Austin gym Tuesday May 2, 2017, as the campus tries for normalcy the day after a biology student knifed fellow students (Ralph Barrera, Austin American-Statesman).", "Web posts assert that the May 1, 2017, stabbing attacks at the University of Texas ended after a heroic student pulled out a handgun.", "A reader inquiry after the incident that left one student dead and three wounded led us to fact-check a May 2, 2017, web post on ihavethetruth.com headlined \"Texas Campus Concealed Carry Student Stops Slaughter at UT Austin.\"", "That post says: \"Eyewitnesses reported that a student pulled out a concealed handgun on the suspect and made him back down, stopping what was heading towards a slaughter! Although Fox has reported the incident, the local media is working real hard on not covering that little fact. Imagine that!\"", "Ihavethetruth.com doesn’t describe itself as a news source--or much otherwise. Its \"About\" web page says only: \"I Have The Truth is where you show up every day for your marching orders.\"", "No evidence, newspaper says", "A day after the site said a student intervened with a gun, the Austin American-Statesman published a news story finding no confirmation that a gun-toting student got involved. The prospect of someone pulling a gun had seemed especially possible because the Texas law allowing individuals with state-issued permits to carry a handgun on public college campuses took effect in August 2016.", "The American-Statesman story, partly headlined \"VIRAL ITEM DEBUNKED,\" said chatter about a student possibly brandishing a gun to help police end the incident appeared to have originated in an anonymous Twitter feed, whose user posted a screenshot of a conversation thread in which someone – whose name was blurred out – claims to have \"grabbed my gun and ... chased the kid briefly.\"", "According to the story by reporter Marty Toohey, UT police termed the rumor of help from an armed student false and said they’d found no corroborating evidence, be it video or first-hand accounts. \"It’s a rumor and there’s nothing to verify it,\" campus spokeswoman Cindy Posey said.", "Meanwhile, the student-with-a-gun account also was trumpeted on the InfoWars web site under the headline \"Report: Student with gun stops mass stabbing at University of Texas.\" Its post pointed to a May 1, 2017, tweet by @TexasRebel56, who appears to have shared a screenshot of a private message of someone – the names of the people on thread are obscured – claiming: \"I ran inside and grabbed my gun out (sic) and came back and chased the kid briefly but I wasn’t comfortable shooting because people were around.\"", "Also on May 1, a UT student who arrived at the scene after the attack told the American-Statesman that another student told him he had \"flashed\" a gun at the suspect. But police said they couldn’t confirm that story, adding that it was unlikely based upon the incident's brief timeframe.", "The same day, UT Student Government Vice President Binna Kim was among those who repeated the rumor, though after sending it via GroupMe she promptly tweeted an apology that stated the rumor had not been confirmed.", "Police chief a day later", "At a May 2, 2017, press conference, a reporter asked UT Police Chief David Carter: \"There was a rumor on social media that someone with a concealed handgun prevented further attacks. Is there any validity to that?\"", "Carter replied: \"So one of the things that bedevils police departments on occasion is the information that comes across social media.", "\"Yes, we’ve heard that,\" the chief said. \"We have no verification of that. I will tell you, if you look at the sequence of events and the timeline, it doesn’t appear likely.\"", "Carter said that a minute and a half elapsed between the stabbings and before the student accused of the knife attacks, Kendrex White, was apprehended as he moved toward a campus dormitory knife-in-hand.", "A day earlier, Carter specified that that about 1:49 p.m. May 1, his department got a call about an individual who \"actually attacked or assaulted somebody\" near a gym. In less than two minutes, an officer was on the scene.", "The officer observed the individual walking away from an individual who was down on the ground,\" Carter said. \"He was armed with a large, Bowie-style hunting knife.\" The officer confronted the man, Carter said, drawing his weapon and ordering the man to the ground. Then the suspect was taken into custody.", "On May 4, 2017, the debunkists at Snopes.com found \"unproven\" the idea that a student with a concealed handgun stopped the knife attacks.", "Then an Associated Press news story, published May 7, 2017, said that during the UT incident, \"no gun-toting student or professor pulled a pistol to stop the man in his tracks. No shots were fired and no gun was even drawn until police swarmed in to subdue the suspect.\"", "No changes, UT says", "We asked UT if there were developments since the knife attacks suggesting a student with a gun helped quell the attacker.", "By email, Shilpa Bakre replied: \"This is an incorrect rumor.\" Bakre said a UTPD officer \"took the suspect down and arrested him – no civilians with guns were involved. Police have interviewed over 40 witnesses thus far, as well as reviewed video footage to support this.\"", "Our ruling", "A web blog said a UT student used a concealed gun to help police stop knife attacks on the campus.", "In a week-plus after the attacks, there were no credible news reports or law-enforcement confirmations of this claim which looks to us like it was bandied by pro-gun advocates presuming or perhaps wishing it was so.", "Pants on Fire!", "PANTS ON FIRE – The statement is not accurate and makes a ridiculous claim. Click here for more on the six PolitiFact ratings and how we select facts to check.", "Web post, \"Texas Campus Concealed Carry Student Stops Slaughter at UT Austin,\" ihavethetruth.com, May 2, 2017", "Web page, \"About,\" ihavethetruth.com (accessed May 10, 2017)", "Web page, \"An Update on Campus Carry Rules and Implementation,\" University of Texas, July 29, 2016 (accessed May 10, 2017)", "News story, \"VIRAL ITEM DEBUNKED: No evidence gun-brandishing student helped subdue UT attacker,\" Marty Toohey, Austin American-Statesman, May 3, 2017", "Video of press conference held by Austin Police Chief Brian Manley and University of Texas Police Chief David Carter, May 2, 2017, recorded by Austin American-Statesman (question about a student with a concealed handgun at 34:21 mark)", "News story, \"One killed, three wounded in attack on University of Texas at Austin campus, police say,\" The Washington Post, May 1, 2017", "News story, \"University of Texas stabbings put campus carry law to test,\" The Associated Press, May 7, 2017", "Email, Shilpa Bakre, communications strategist, University Communications, The University of Texas at Austin, May 10, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]