["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Sen. John McCain's primary challenger accused him of selling military weapons to allies of Osama bin Laden, on the Fourth of July of all weekends.", "The campaign of former state Sen. Kelli Ward, R-Lake Havasu City, sent out a July 3 news release attacking McCain for his alleged plans.", "It included this graphic:", "McCain did go to Pakistan that holiday weekend, as well as Afghanistan for his annual visit to American troops on Independence Day.", "But is Ward right that he carved out time to sell F-16 fighter jets, which are used for aerial attacks, and sophisticated weaponry to \"the folks who harbored Osama bin Laden\" in Pakistan?", "Ward’s claim distorts the point of McCain’s trip.", "A meeting in Pakistan", "Ward spokesman Stephen Sebastian provided us with news reports about McCain’s meeting with Pakistani officials, which included Sartaj Aziz, advisor to the Prime Minister on Foreign Affairs, and Pakistan’s Chief of Army Staff, Gen. Raheel Sharif.", "McCain was part of a bipartisan Senate Armed Services Committee delegation with Sen. Lindsey Graham, R-S.C., Sen. Benjamin Sasse, R.-Neb., and Sen. Joe Donnelly, D-Ind.", "The meeting was billed as an effort to strengthen relations between the two countries and defeat the Islamic State, also known as ISIS.", "While ISIS does not have a major presence in Pakistan, the United States has expressed concern over indirect connections between the terror group and Pakistani militants.", "At the meeting, McCain emphasized that Pakistan needs to do more to take on terrorist groups, such as the Haqqani Network, an insurgency group with ties to al-Qaeda and Pakistan, that threaten America, according to his spokeswoman. She also said McCain’s visit was within his oversight as chairman of the Senate Armed Services Committee.", "So the point of the delegation's visit was not to make a deal on aircrafts — especially since Congress had balked at a military proposal for the United States to finance eight fighter jets for Pakistan.", "The stumbling block: Pakistan's terrorism ties.", "\"Sen. McCain conveyed to Pakistani leaders that U.S. financing for those (F-16) aircrafts will not be supported by Congress unless and until Pakistan demonstrates more robust efforts against terrorists that threaten America,\" McCain campaign spokeswoman Lorna Romero said.", "F-16s", "The United States has sold F-16s to Pakistan for decades. But after the U.S. military approved the sale of eight F-16s to Pakistan in February, congressional leaders said they would block U.S. financing and Pakistan would have to pay for the F-16s with its own money.", "\"Given congressional opposition to financing the F-16 sale with Foreign Military Financing (FMF), we asked the Pakistanis to fund the sale entirely,\" said State Department spokesman Josh Paul. \"Pakistan did not accept this offer, and the terms of the sale have expired.\"", "McCain wanted a hearing on the F-16s then, saying he was \"conflicted\" with the proposed sale, noting potential consequences in the U.S.-India relationship. (There was concern that Pakistan could use the weapons against India.)", "Romero reiterated that McCain can only see a scenario where the United States finances F-16s is if Pakistan bolsters its anti-terrorism efforts.", "Ward’s campaign cited Pakistan news website Business Recorder, which quotes Pakistan Foreign Office spokesman Nafees Zakaria as saying McCain’s visit was related to \"defense cooperation.\"", "The Ward campaign also referenced a June 24 meeting between McCain and former Pakistan President Asif Ali Zardari in Los Angeles. McCain’s campaign confirmed this meeting, saying it was part of his regular meetings with world leaders. A Pakistani government account of the meeting recounts Zardari making the case for American F-16s and drones to fight terrorists.", "Sebastian also noted that most of the senator’s itinerary was not available in advance because of security concerns. McCain’s daily schedule is not released publicly.", "\"While F-16s and weapon sales were not the only, or even primary, purpose of the CoDel (congressional delegation) trip, it certainly seems to have been a prominent part of the agenda,\" he said.", "That's a much softer take than the message of the campaign ad.", "Pakistan on terror", "Now for the Ward attack's characterization of Pakistan as the \"folks who harbored Osama bin Laden.\"", "Yes, bin Laden was found and killed at a compound in Pakistan in 2011. But University of Michigan history professor Juan Cole, who has written extensively about the Middle East, questioned the graphic’s portrayal of Pakistan in the terrorism fight.", "\"The implication is that Pakistan is an enemy of the U.S., whereas it is designated as a non-NATO ally,\" Cole said. \"McCain's trip is not about arms sales but broader diplomacy.\"", "Pakistan has a mixed history dealing with terrorism, despite aiding in the 2003 capture of suspected 9/11 mastermind Khalid Shiekh Mohammed.", "\"Pakistan has failed to attack, and in some cases even provided support and safe haven to a variety of other militant/terrorist groups, including the Haqqani Network and Lashkar-e-Taiba, that have attacked U.S. troops in Afghanistan and have killed U.S. citizens in India,\" said Daniel Markey, an international relations professor at Johns Hopkins University.", "Pakistan does have an Anti-Terrorism Act, which was established in 1997. But the U.S. Institute of Peace even concludes in a August 2015 report that it offers a \"very weak deterrence\" against terrorism, as conviction rates remain low.", "\"Pakistan has a lot of problems, it has not been a great ally,\" said Council on Foreign Relations senior fellow Alyssa Ayres. \"(But) it also is the supply route to support our troops in Afghanistan.\"", "As for the accusation that McCain was engineering a sale to people who \"harbored\" bin Laden, that is also unproven. Ward’s campaign referenced a October 2015 Washington Post story that quotes Pakistan’s former defense minister as saying it was \"probable\" that the Pakistani military knew of bin Laden’s whereabouts.", "But Markey said the ad's claim jumps too far.", "\"We don't yet have evidence that top Pakistani military or civilian leaders knew of bin Laden's whereabouts or ‘harbored’ him, as it says in the graphic,\" he said.", "Our ruling", "Ward said McCain was in Pakistan during the Fourth of July weekend selling \"F-16s and advanced weapons\" to the folks who \"harbored Osama bin Laden.\"", "Experts we spoke with disagreed. The ad distorts McCain’s mission in Pakistan to stir up questions about his patriotism.", "While McCain has discussed F-16 fighter jets with Pakistani officials, the meeting over the holiday weekend was part of a larger effort to fight terrorism.", "Further, the ad oversimplifies Pakistan's complicated relationship with the United States. There is plenty of legitimate concern about the country's approach to terrorist groups, but there is no definitive proof that Pakistan (particularly the ones who met with McCain) harbored bin Laden.", "We rate Ward’s claim False.", "https://www.sharethefacts.co/share/76ddba0b-4e0a-4071-b0aa-a23573c3cc48", "Kelli Ward, \"McCain graphic,\" July 3, 2016", "Business Recorder, \"McCain-led delegation due tomorrow,\" July 1, 2016", "Reuters, \"Senator McCain, visiting Pakistan, seeks better ties in Islamic fight,\" July 3, 2016", "Reuters, \"U.S. OKs sale of 8 Lockheed F-16 fighter jets to Pakistan,\" Feb. 12, 2016", "Reuters, \"Senator McCain wants hearing on possible F-16 sale to Pakistan,\" Feb. 25, 2016", "The Washington Post, \"Pakistani leaders knew Osama bin Laden was in Pakistan, says former defense minister,\" Oct. 14, 2015", "DAWN, \"Zardari meets Senator McCain, seeks support for F-16 sale,\" June 25, 2016", "NBC News, \"Lahore bombing fuels fears of ISIS foothold in Pakistan,\" March 29, 2016", "U.S. Air Force, \"F-16 Fighting Falcon,\" accessed July 8, 2016", "U.S. Institute of Peace, \"An appraisal of Pakistan’s Anti-Terrorism Act,\" accessed July 8, 2016", "The New Yorker, \"Khalid Shiek Mohammed and the CIA,\" Dec. 31, 2014", "The Wall Street Journal, \"Pakistan could use F-16 jets against India, U.S. politicians say,\" April 28, 2016", "Interview with McCain campaign spokeswoman Lorna Romero, July 6, 2016", "Interview with Ward campaign spokesman Stephen Sebastian, July 5, 2016", "Interview with Johns Hopkins University international relations professor Daniel Markey, July 7, 2016", "Interview with University of Michigan history professor Juan Cole, July 5, 2016", "Interview with Council on Foreign Relations senior fellow Alyssa Ayres, July 7, 2016", "Interview with State Department spokesman Josh Paul, July 11, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]