["Rev. Martin Luther King Jr. stands with other civil rights leaders on the balcony of the Lorraine Motel in Memphis, Tenn., on April 3, 1968, a day before he was assassinated at approximately the same place. (AP)", "A few days before a holiday celebrating his life, conspiracies about Martin Luther King Jr.’s death are circulating on Instagram.", "In an image reposted Jan. 14 from another account, a brand called Olmecian Clothing claimed that, contrary to popular belief, King did not die from a gunshot wound. The post includes a photo of what appears to be King in a hospital bed.", "\"He was killed (smothered) in the hospital,\" the post reads. \"Also in 1999 the US government was found guilty in a court of law of conspiring to kill him but was silenced by the media.\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook, which owns Instagram.) It has more than 9,700 likes, and similar posts were shared on Facebook.", "A popular Instagram and Facebook post claims Martin Luther King Jr. was killed in the hospital after he was shot. We rate the posts False. (Screenshot from Instagram)", "We checked Congress’ report on King’s death, as well as the book and lawsuit cited in the Instagram post. None of them provide evidence that the civil rights leader was killed in a government plot — and the photo itself does not show King after he was shot.", "The most authoritative report on King’s assassination is a congressional report from 1979. It said he died from a gunshot wound.", "According to the House Select Committee on Assassinations’ report, King was shot shortly after 6 p.m. on April 4, 1968, while standing on a balcony at the Lorraine Motel in Memphis, Tenn. He was pronounced dead at 7:05 p.m. at St. Joseph Hospital.", "An autopsy conducted at Gaston Hospital determined that King’s cause of death was a \"gunshot wound to the chin and neck with a total transaction of the lower cervical and upper thoracic spinal cord and other structures of the neck.\" A convicted armed robber and escaped prison inmate named James Earl Ray pleaded guilty to the first-degree murder of King on March 10, 1969. (He recanted his confession days later but was never able to formally withdraw his guilty plea.)", "Critics questioned the thoroughness of the autopsy report, but a panel of three forensic pathologists commissioned by the House committee concluded that the findings were generally accurate. They reached that conclusion after reviewing \"the report of the committee's firearms panel, as well as X-rays, medical reports, notes, and documents submitted by physicians who treated Dr. King.\"", "The conspiracy that King was killed by someone at the hospital stems from an attorney who represented Ray.", "The post’s caption cites a 2016 book by the lawyer, William Pepper, titled \"The Plot to Kill King: The Truth Behind the Assassination of Martin Luther King Jr.\" Moor Information, the Instagram account from which Olmecian Clothing reposted the image, conceded in its caption that the book \"has never been verified.\"", "Pepper represented Ray during the tail-end of his trial for King’s murder and has spent years trying to prove his innocence. Ray died in prison in 1998. Pepper claims in the book that Ray didn’t kill King — instead, he was framed by U.S. government agencies.", "RELATED: Claims about MLK often go astray", "\"The plan, according to Pepper, was for a team of United States Army Special Forces snipers to kill King, but just as they were taking aim, a backup civilian assassin pulled the trigger,\" reads the book’s description.", "There is no direct evidence that happened. Hampton Sides, author of \"Hellhound on His Trail: The Stalking of Martin Luther King Jr. and the International Hunt for His ­Assassin,\" told Time magazine in April 2018 that the source of many conspiracies about King’s death can be traced to Ray’s guilty plea, which stopped his trial from proceeding.", "\"There was a huge amount of evidence presented in Memphis that didn’t see the light of day in a public forum,\" Sides said. \"I think that contributed to the sense of conspiracy, like a ‘What are they hiding?’ kind of thing.\"", "Those conspiracies are also fueled by the fact that FBI Director J. Edgar Hoover spied on King during the 1960s.", "Pepper has been active in other conspiracy movements, such as those that doubt official accounts of the Sept. 11, 2001, terrorist attacks.", "As for the actual photo in the Instagram post, it doesn’t show King at St. Joseph Hospital in Memphis. It depicts King after he was stabbed on Sept. 20, 1958, in New York City.", "As additional evidence for its claim that King was killed in a nefarious government plot, the Instagram post cited a 1999 lawsuit. But the case doesn’t show what Olmecian Clothing says it does.", "King vs. Jowers was a wrongful death civil suit filed by Pepper on behalf of King’s wife and children. The unlikely partnership was a result of the family’s belief that Pepper’s version of the assassination got at the real truth behind King’s death, according to the New York Times.", "In this April 8, 1968 file photo, Coretta Scott King, third right, is accompanied by her children, Yolanda, Bernice, Martin III, and Dexter at Sisters Chapel on the campus of Spelman College in Atlanta. (AP)", "Loyd Jowers was a Memphis cafe owner who claimed he hired someone other than Ray to assassinate King. A prosecutor who investigated King’s assassination said several of Jowers’ associates said he hoped to get a movie or book deal.", "The jury issued a verdict that said Jowers and \"others, including government agencies\" were part of a conspiracy to assassinate King. The jury awarded the Kings the $100 in damages that they sought.", "But in a 2000 review of the lawsuit, the Justice Department found no evidence to back up the verdict. (It’s worth noting that civil suits only require plaintiffs to prove their case by a \"preponderance of the evidence\" instead of \"beyond a reasonable doubt,\" which is a more stringent burden of proof that’s used in criminal court.)", "\"Most of the witnesses and writings offered to support the various government-directed conspiracy claims relied exclusively on secondhand and thirdhand hearsay and speculation,\" the Justice Department wrote in its report on King vs. Jowers. \"Additionally, none of these allegations were ever linked together.\"", "An Instagram post claimed King was smothered to death in a hospital and that \"the US government was found guilty in a court of law of conspiring to kill him.\"", "A congressional report on King’s death determined that he died from a single gunshot wound to the chin and neck. There’s no evidence to back up conspiracy theories that King was killed in a government plot. An exhaustive report from the Justice Department found ample reason to doubt a 1999 verdict that concluded a Memphis cafe owner and government agencies were part of a conspiracy to kill the civil rights leader.", "As for the photo in the Instagram post, it doesn’t show King after he was shot in Memphis. It was taken nearly a decade prior in New York City.", "The Instagram post is inaccurate. We rate it False.", "The Atlantic, \"Rewriting My Grandfather’s MLK Story,\" April 3, 2018", "Cornell Law School’s Legal Information Institute, Burden of Proof, accessed Jan. 15, 2020", "Facebook post, Jan. 14, 2020", "Google Reverse Image Search, accessed Jan. 17, 2020", "Instagram post, Jan. 14, 2020", "Instagram post, Jan. 14, 2020", "National Archives, Findings on MLK Assassination, accessed Jan. 15, 2020", "The New York Times, \"Loyd Jowers, 73, Who Claimed A Role in the Killing of Dr. King,\" May 23, 2000", "The New York Times, \"Memphis Jury Sees Conspiracy in Martin Luther King's Killing,\" Dec. 9, 1999", "Report of the Select Committee on Assassinations, March 29, 1979", "William Pepper, \"The Plot to Kill King: The Truth Behind the Assassination of Martin Luther King Jr.\"", "Time magazine, \"What We Know About Why James Earl Ray Killed Martin Luther King Jr.", "Play Video,\" April 3, 2018", "U.S. Department of Justice, \"Investigation of Recent Allegations Regarding the Assassination of Dr. Martin Luther King, Jr.,\" June 2000", "The Washington Post, \"In the latest JFK files: The FBI’s ugly analysis on Martin Luther King Jr., filled with falsehoods,\" Nov. 4, 2017", "911blogger.com, \"Dr. William F. Pepper to Speak at 9/11 Truth Film Festival - Why 9/11 Truth Still Matters,\" Sept. 2, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]