["After videos of maskless Buccaneers fans celebrating the team’s Super Bowl win spread on social media, Tampa Mayor Jane Castor said she was frustrated by people who had flouted her executive order requiring face coverings in certain outdoor areas of the city.", "But another image that’s being shared on Facebook accuses the mayor of hypocrisy.", "\"BREAKING,\" reads a screenshot of a tweet. \"At a press conference Monday, Tampa Mayor Jane Castor said that maskless fans at the Super Bowl will be ‘identified’ by law enforcement and that police will ‘handle’ the situation.\"", "The words \"Jane Castor,\" \"maskless\" and \"identified\" are circled in red, with an arrow pointing to a photo showing Castor sitting next to a man wearing a mask while nothing is covering her face.", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.) There are a couple things wrong with it.", "First, Castor wasn’t talking about authorities identifying and dealing with maskless fans. She was referring to a \"few bad actors\" who vandalized street signs and other property.", "Florida Gov. Ron DeSantis banned municipalities from fining people who refused to wear masks in September. The city of Tampa didn’t issue citations to people who weren’t wearing a mask, a mayor’s office spokesperson told Newsweek.", "As for the photo, Castor can be seen sitting next to two people wearing Tampa Bay Lightning jerseys. The hockey team won the Stanley Cup in 2020. A spokesperson for the city told Newsweek that the photo was taken during a celebration for the team at Raymond James Stadium on Sept. 30. Castor attended the Super Bowl on Feb. 7 but she wore a mask, a spokesperson told PolitiFact.", "Castor, who gave a speech at the stadium that evening, posted photos of herself without a mask during a boat parade to mark the Stanley Cup victory. She’s drawn criticism for complaining about maskless Super Bowl partiers when she didn’t wear one during the revelry for the Lightning.", "But this photo doesn’t show her at the Super Bowl and she wasn’t talking about authorities trying to identify maskless fans.", "We rate that claim False.", "UPDATE, Feb. 12: We updated the story with comment from the City of Tampa, which we received after publication.", "Facebook post, Feb. 9, 2021", "Email interview with Jeremy Rex, senior designer and digital strategist — marketing and communications, City of Tampa, Feb. 10, 2021", "The Associated Press, Tampa mayor addresses maskless fans after Super Bowl, Feb. 8, 2021", "Newsweek, Fact check: Did the Tampa mayor violate her own mask order? Feb. 9, 2021", "Newsweek, Super Bowl vandals ‘will be identified’ by police, Tampa Mayor says, Feb. 9, 2021", "City of Tampa, 2021 07 EO coverings outdoor in Super Bowl event zones & entertainment districts, Jan. 27, 2021", "ESPN, Tampa Mayor Jane Castor frustrated by maskless partiers around Super Bowl, Feb. 8, 2021", "PBS NewsHour, Florida governor lifts all restaurant restrictions, bans mask fines as COVID-19 spreads, Sept. 25, 2020", "Tampa Bay Times, Fans finally cheer champs in person at Lightning parade and party, Sept. 30, 2020", "Jane Castor tweet, Sept. 30, 2020", "Fox News, Tampa mayor called out over mask rules following Super Bowl win, Feb. 9, 2021", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]