["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "U.S. Sen. Tim Kaine was quick to defend President Barack Obama’s recent decision to bypass Congress and unilaterally extend legal status to many illegal immigrants.", "Obama announced on Nov. 20 that he would delay deportation for immigrants who have lived illegally in the U.S. for more than five years but have children who are citizens or have green cards. If the applicant can pass a background check and pay a fee, he could qualify for a work permit and avoid deportation for three years at a time. More than 4 million people could qualify for the program, which will open for applications in the spring.", "Kaine, in a news release on the night of the president’s announcement, said Obama’s action was necessary because the House of Representatives has failed to pass comprehensive immigration reform. Kaine, a Democrat, made a fleeting reference to Republican claims that the president’s executive action is unconstitutional.", "\"Every president since Eisenhower has taken executive action to address immigration issues,\" he said.", "We checked whether Kaine’s history is correct.", "Amy Dudley, Kaine’s spokeswoman, sent us an October report from the American Immigration Council that’s being circulated by the White House and its allies to defend the president’s action. Although the council is pro-immigration, a number of experts say the raw data in the report is solid.", "The council cited 39 instances in which a president used executive authority to defer deportation of certain immigrants. The list starts with an action by President Dwight D. Eisenhower in 1956 and does indeed include actions taken by every president since then. Many of the actions were designed to keep families together or to shield illegal immigrants from returning to repressive nations where they might face punishment.", "The report, however, does not settle a broader question: Were any of the past presidential actions equivalent to what Obama is doing? Let’s take a look:", "Size. With more than 4 million potential beneficiaries, Obama’s is easily the biggest such action ever taken by a president, at least in raw numbers.", "The second largest action -- by President George H.W. Bush in 1990 -- forestalled deportations of what the White House then estimated to be 1.5 million illegal immigrants. It was a consequence of a 1986 law that offered legal status to unauthorized immigrants who been living continuously in the U.S. since 1982. The problem was that many spouses and children of eligible immigrants had not been in the country long enough to qualify.", "Bush’s action was designed to prevent families from being split. When Congress failed to extend the law to ineligible spouses and children, Bush did so on his own.", "It’s worth noting that Bush’s action and Obama’s affected the same proportion of the undocumented population at the time each was announced, about 40 percent.", "Other presidential actions that had a potential affect on more than 100,000 people included extended asylum to:", "Cubans who fled their nation’s communist revolution, offered from 1957 to 1972 by Presidents Eisenhower, John Kennedy, Lyndon Johnson and Richard Nixon.", "Southeast Asians, most of whom were evacuated at the end of the Vietnam War, offered between 1975 and 1979 by Presidents Gerald Ford and Jimmy Carter.", "Nicaraguans fleeing the Sandinista revolution, offered by President Ronald Reagan in 1987.", "Scope. Most of the past presidential actions affected small, specific populations that were experiencing humanitarian or political crises in their home country. For instance:", "About 15,000 Ethiopians who fled a Marxist regime in their nation were allowed to stay in the U.S. under an order made by Carter in 1977 and extended by Reagan in 1982.", "2,227 Kuwaiti evacuees during Operation Desert Storm in 1990 were given four-year extensions of their temporary visas under orders by George H.W. Bush.", "About 10,000 Liberians fleeing civil war in their nation received extended permission to stay in the U.S. by President Bill Clinton in 1999. President George W. Bush extended it again to 3,600 Liberians in 2009.", "What undocumented immigrants could receive. Mark Krikorian, executive director of the Center for Immigration Studies, said that Obama has not just deferred deportation for certain undocumented immigrants but gone a step further, allowing them to receive work permits and other related benefits, such as Social Security numbers.", "There’s at least one precedent for this: the George H.W. Bush action in 1990, which included a pathway to receiving green cards. Some of the other previous actions may have as well, but experts said allowing work permits are the exception rather than the rule.", "We should note that PolitiFact National recently rated as Half True this statement by Obama: \"The actions I’m taking are not only lawful, they’re the kind of actions taken by every single Republican and president for the past half century.\"", "Kaine’s statement is narrower in scope.", "Our ruling", "Kaine, in backing Obama, said, \"Every president since Eisenhower has taken executive action to address immigration issues.\"", "Historical records back Kaine. But Kaine’s compact claim omits important context: Obama’s immigration actions can be viewed as much more sweeping than those of his predecessors.", "So Kaine’s statement is accurate but needs more information. We rate it Mostly True.", "Tim Kaine, \"Kaine on President Obama’s Immigration Announcement,\" Nov. 20, 2014.", "Email from Amy Dudley, Kaine spokeswoman, Nov. 21, 2014.", "American Immigration Council, \"Executive Grants of Temporary Immigration Relief, 1956-Present,\" October 2014.", "PolitiFact, \"Are Barack Obama’s immigration moves ‘the kinds of actions’ taken by presidents for 50 years?,\" Nov. 21, 2014.", "Bob Goodlatte in The Wall Street Journal, \"Congress Will Fight Obama’s Power Grab,\" Nov. 19, 2014.", "Mark Krikorian, \"Obama’s Unprecedented Amnesty\" (column in National Review), Nov. 18, 2014.", "Mark Krikorian, \" Indiscrete Discretion,\" (column in National Review),", "Email interview with Kevin R. Johnson, dean of the University of California-Davis law school, Nov. 21, 2014.", "Email interview with Kenneth R. Mayer, political scientist at the University of Wisconsin-Madison, Nov. 21, 2014.", "Email interview with Mae Ngai, Columbia University professor of history and Asian-American studies, Nov. 21, 2014.", "Email interview with Mark Krikorian, executive director of the Center for Immigration Studies, Nov. 21, 2014.", "Email interview with John Woolley, political scientist at the University of California-Santa Barbara, Nov. 21, 2014.", "Email interview with Stephen W. Yale-Loehr, adjunct law professor at Cornell University, Nov. 21, 2014.", "Email interview with Kermit Roosevelt, law professor at University of Pennsylvania, Nov. 21, 2014.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]