["“Big Pharma whistleblower: ‘97% of corona vaccine recipients will become infertile,’” reads the title of an 11-minute video published on June 17, 2020 on the website of ex-soccer pro and conspiracy theorist David Icke, which has circulated on social media as recently as March 2021.", "The video, a segment from former Infowars host David Knight, features a man identified as Ben Fellows.", "Fellows claims that the Bill and Melinda Gates Foundation provided funding for a researcher to run human trials for the vaccine from Britain’s GlaxoSmithKline (GSK), and that the shot contains ingredients that will cause sterility in both men and women, with immunized men able to make unvaccinated women infertile through sex.", "“You’re looking at a global population reduction,” he says.", "February 2021 Facebook posts here and here and an Instagram post here make similar claims involving GSK, although they do not mention Covid-19.", "GSK has not produced its own Covid-19 vaccine, and is instead collaborating with partner organizations by contributing its adjuvant technology. Those partnerships have yet to result in a vaccine available to the general public.", "An adjuvant is an ingredient added to some vaccines that helps create a stronger immune response in people receiving it, according to the US Centers for Disease Control and Prevention.", "Both the video and text claims refer to human chorionic gonadotropin (hCG) and gonadotropin-releasing hormone (GnRH).", "HCG is a hormone produced during pregnancy, which pregnancy tests are designed to detect.", "GnRH is a reproductive regulatory hormone present in both men and women. In men it helps control sperm production and in women it is key during menstruation and pregnancy.", "A company spokesman confirmed that GSK’s pandemic adjuvant does not contain GnRH or any hCG or GnRH antagonists that would inhibit hormone function.", "Ingredient information for the three vaccines that have received a US Food and Drug Administration Emergency Use Authorization are available for Pfizer-BioNTech here, Moderna here, and Johnson & Johnson here. None list hCG or GnRH.", "Dr Kate White, an obstetrics and gynecology professor at Boston University School of Medicine, said: “There’s no vaccine in the world that can cause infertility.”", "This was confirmed by Dr John Amory, a professor of medicine at the University of Washington School of Medicine.", "And while the video claims that the vaccine causes infertility, the doctors noted that there is not even an injectable male contraceptive approved for use.", "“There are multiple products in development, but none are close to being commercially available,” White said.", "Asked if she would recommend that patients trying to conceive get a Covid-19 shot, White replied “100 percent.”", "The risk of contracting Covid-19 is much higher than the remote risk of yet-to-be-seen vaccine side effects, she said.", "“Preserving fertility is very important to my patients,” she said. “And I still recommend that all of them get it.”", "In the video, Fellows claims that sperm could be damaged as a result of vaccination, and then cause infertility in unvaccinated women.", "Amory, who has published more than 150 peer-reviewed papers about male reproduction and contraception, disputed that assertion.", "“There is no possible way that dead sperm from any cause would make a woman infertile,” Amory said.", "“I've encountered many couples in whom the men have ‘dead’ (usually severely deformed) sperm… Most of these couples eventually conceive using in vitro fertilization and/or donor sperm, so exposure to bad sperm doesn't have any impact on the fertility of their female partner.”", "White agreed, explaining that “men have low sperm counts with damaged sperm all the time and it doesn’t affect their partner’s fertility.”", "Snippets of the video and text claims borrow phrasing from a 1989 study on fertility in baboons.", "For example, “the principle of anti-hCG vaccine is to induce antibodies which can bind to hCG and render it biologically inactive” appears in the abstract section of the 32-year-old study, and almost word-for-word in the text claims.", "In the video, Fellows says “sperm-specific mitochondrial antigen produced an antibody response in baboons and reduced fertility in the females.” This is also in the study abstract.", "White clarified that the phrase “reduced fertility” may refer to contraception rather than infertility.", "Plus, “we can never extrapolate the results from animal studies to imply how they’ll work in humans -- it’s why human trials are always required.”", "Both the video and the text posts say the Bill and Melinda Gates Foundation provided a £28 million -- or about $39 million -- grant to Dr Andrew Preston to conduct human trials for the supposedly infertility-causing shots.", "In an email, the foundation called the claims “false.”", "Preston, a researcher at the University of Bath, also responded to the claims.", "“The story is false, and mistakenly refers to a large EU project of which I am a partner. The total project funding is €28m, ($33.4 million) however only €7 million of this is from the Gates Foundation.”", "The PERISCOPE project is dedicated to researching whooping cough vaccines, and “has nothing to do with Covid-19,” he said.", "Additionally, the funding is not for him directly, but rather for the project as a whole.", "“The notion of Covid vaccines being designed to cause infertility is simply ridiculous,” Preston said.", "He advised people to “insist on seeing the evidence behind any stories that suggest Covid-19 vaccines are designed to do anything other than prevent Covid-19 disease. Not rumors or conspiracies, the factual evidence.”", "Vaccine-related conspiracy theories about Gates are not new. AFP Fact Check has debunked claims about the philanthropist here, here, and here, and a claim about Pfizer’s Covid-19 vaccines causing female sterilization here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]