["About this rating", "As of 1 January 2020, the chemical HCFC-22, which a principal component of the trade-named refrigerant “Freon,” will no longer be produced in or imported by the United States.", "Freon-based air conditioning systems will not have to be replaced by 2020, but over time it will become more and more difficult to obtain the HCFC-22 necessary to run them.", "Most household air conditioning units work by using a vapor-compression refrigeration system. In such systems, a mixture of chemicals known as a refrigerant is contained in liquid form under pressure, and when that mixture is pumped into a region of lower pressure, it expands and changes phase into a gas, absorbing nearby heat before being pumped to a different location. The gas is then recompressed and this process begins anew.", "The first widely used refrigerants were chlorofluorocarbons, also known as CFCs. In the 1970s, however, the scientific community determined that CFCs were building up in the Earth's upper atmosphere in a way that damaged the ozone layer, lessening the planet's natural protection from some forms of solar radiation. In 1987, 27 countries therefore signed a global environmental treaty called the Montreal Protocol to Reduce Substances that Deplete the Ozone Layer. Under this treaty, signatories pledged to reduce the use of ozone-depleting compounds (such as halons and CFCs) to below 50% of 1987 levels by the year 2000.", "One of the most widely used replacements for CFCs were chemicals known as hydrochlorofluorocarbons (HCFCs), and this substitution largely made the phase-out of CFCs possible. Unfortunately, many HCFCs, including HCFC-22 (a principal component of the trade name product “Freon”) contribute both to global warming and can, to a lesser degree, serve to deplete the ozone layer as well.", "For this reason, Montreal Protocol signatories agreed to accelerate the phase-out of these products in 2007. In the United States’ case, this meant that the Environmental Protection Agency (EPA) mandated no new HCFC-22-based air conditioning systems be manufactured or installed after 1 January 2010, and the import or production of HCFC-22 be completely halted a decade later.", "Newer A/C machines are required to use ozone-friendly refrigerants. The most common replacement for HCFC-22 in the United States is R-410A, which does not harm the ozone layer but is considered a greenhouse gas.", "All of these changes, however, are being made on the production side of operations, not the consumer end. If you have an older air conditioning unit, you will likely find it becoming increasingly harder to service in the future, but you will not be required to replace it soon than you have to:", "You can continue to service your existing HCFC-22 system. You can also purchase a “self-contained” system (typically, a window unit) if is second-hand and/or was produced prior to 2010. Keep in mind that supplies of HCFC-22 are expected to become more limited in the years ahead as this refrigerant is phased out of production.", "Brain, Marshall et al.   \"How Air Conditioners Work.\"\r\n    How Stuff Works.   Accessed 19 July 2018", "U.S. Environmental Protection Agency.   \"Stratospheric Ozone Protection: 30 Years of Progress and Achievements.”\r\n    November 2017.", "U.S. Energy Administration.   \"Emissions of Greenhouse Gases in the U.S.”\r\n    31 March 2009.", "U.S. Environmental Protection Agency.   \"Ozone Layer Protection: International Treaties and Cooperation.”\r\n    Accessed 19 July 2018.", "DuPont.   \"Material Safety Data Sheet — ‘FREON’ 22.”\r\n    28 April 2004.", "U.S. Environmental Protection Agency.   \"Homeowners and Consumers: Frequently Asked Questions.”\r\n    Accessed 19 July 2018.", "U.S. Environmental Protection Agency.   \"Substitutes in Residential and Light Commercial Air Conditioning and Heat Pumps.”\r\n    Accessed 19 July 2018.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]