["About this rating", "A photograph purportedly showing a praying mantis that had just killed a hummingbird was recirculated on social media in August 2016, accompanied by a message that warned bird lovers to watch out for the dangerous insect:", "BIRD LOVERS BE AWARE......", "This is NOT a pleasant sight but let me tell you...I've witnessed it twice. Most people are surprised to learn that the praying mantis will successfully capture, kill, and eat a hummingbird! Typically the insect will position itself on a plant or a hummingbird feeder to which it observes a hummingbird coming repeatedly. Its lightning-fast strike often assures it of success. Because of the relative size difference, it make take over a day for the bird to be consumed. While praying mantis are very beneficial insects in a garden, they should NOT be allowed on hummingbird feeders!", "The image displayed here is legitimate. The photograph was taken by Sharon Fullingim and was originally published by National Geographic in the magazine's \"Your Shot\" section in September 2009:", "I've heard of birds eating spiders and spiders eating birds–but who knew that praying mantises can catch hummingbirds! The photo here proves mantises can turn the tables on birds.", "\"Like many bird watchers in our area, we keep hummingbird feeders filled in our front yard, from April until October,” says Sharon Fullingim, who submitted the photo to “Your Shot.” “Black chinned, broad tailed, rufous, and calliope hummingbirds visit them, and I couldn’t believe my eyes when I was greeted with this shot this week. I’ve seen the mantis hanging around the feeders before, but didn’t quite believe it would ever ‘score’ lunch!”", "Although several images can be found online showing praying mantises killing hummingbirds on the internet, such photographs often stir up skepticism in viewers. However, these types of attacks have also been documented on video:", "According to the National Audubon Society, mantids likely hang around hummingbird feeders in order to catch bees and wasps that are attracted to the sugary water. However, if the mantid is hungry enough, it may decide to attack a hummingbird:", "Hummingbirds tend to be about 4 inches long (though some species, like the Giant Hummingbird, are twice that size), while bees and wasps are about half an inch long. That makes hummingbirds eight times bigger than what a mantid usually eats.", "Some of a mantises favorite meals are drawn to the sugary water of the hummingbird feeder, so feeders are a great place for mantids to await their prey.", "While a praying mantis is certainly capable of killing a hummingbird, the National Audubon Society assures readers that it is a rare event which can be prevented by placing hummingbird feeders away from shrubbery or trees or by placing a cover over them.", "Verchot, Manon.   \"Praying Mantis vs. Hummingbird.\"\r\n    National Audubon Society.   8 October 2014.", "Braun, David.   \"Praying Mantis Catches Hummingbird Picture.\"\r\n    National Geographic.   10 September 2009.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]