["The image was posted here on Facebook on March 18, 2021.", "The post's Urdu-language caption translates to English as: “Today’s meeting with the organisers of the women's march in Bilawal House [Bhutto family residence]. Assured Bilawal that we’ll raise our voice for his sexual rights”.", "Women’s marches, known as Aurat Marches in Pakistan, have been held annually in Pakistan since 2018 to mark International Women’s Day on March 8 and include activists campaigning for women’s rights in the socially conservative country. This year’s event was targeted by a “vicious smear campaign” of online misinformation, AFP reported here.", "Bilawal Bhutto Zardari is the chairman of the Pakistan Peoples Party (PPP),  an opposition political party.", "The image was also shared on Facebook here, here, here, here and here; and on Twitter here, here, here and here alongside similar claims.", "The claim, however, is false. The photo is actually taken in March 2019, not in 2021.", "A reverse image search found that Bhutto Zardari published the same photo on Twitter here on March 16, 2019.", "Part of the tweet reads: “Pleasure meeting some organizers of #AuratMarch. Women reclaiming social, political & public spaces important for progress”.", "The photo was also included in a March 2019 report by Pakistani online media MangoBaaz here.", "Below is a comparison of the image in the misleading posts (L) and the original tweet (R):", "The Aurat March organisers did meet with Bhutto-Zardari on 19 March, 2021, and posted a photo here which doesn’t match the photo from the misleading posts.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]