["About this rating", "In July 2020, Snopes received numerous inquiries from people who said they had heard U.S. President Donald Trump's administration issued a proposal to change federal law governing homeless shelters and that that memo included an explanation for how to spot some transgender people so the facilities could deny them housing.", "Many readers included a link to an LGBTQ Nation article published July 20, 2020. People on social media circulated the same claim and link, criticizing the alleged memo as yet another example of the Trump administration's discriminatory tactics to oppress a population that's already at high risk of homelessness.", "The LGBTQ Nation story alleges the federal memo \"says homeless shelters can use 'factors such as height, the presence (but not the absence) of facial hair, the presence of an Adam's apple' to spot trans women\" during the intake process.", "Yes, a proposal sponsored by U.S. Department of Housing and Urban Development (HUD) Secretary Ben Carson did list those physical attributes verbatim (see below):", "Now, let's investigate why — was the language intended to help homeless shelters spot transgender people seeking services?", "First, to explore that question, we researched the circumstances under which the Trump administration was most likely to have written the alleged document. We learned via a July 1, 2020, HUD press release Carson had recently written a proposal to amend existing guidelines that govern how federally funded homeless shelters operate, and we deemed that initiative to be the most likely source of the claim's inspiration. The press release stated:", "Carson today announced a proposed modification to the 2016 portion of the Equal Access rule. The Equal Access rule requires all HUD funded housing services to be provided without discrimination based on sexual orientation or gender identity. The new rule allows shelter providers that lawfully operate as single-sex or sex-segregated facilities to voluntarily establish a policy that will govern admissions determinations for situations when an individual’s gender identity does not match their biological sex.", "Some context: Housing officials under former U.S. President Barack Obama originally established the Equal Access rule, which requires homeless shelters and other facilities that receive money through the HUD's Office of Community Planning and Development to give Americans equal access to services, regardless of their gender identity or other characteristics.", "Carson's proposal primarily targeted homeless shelters and facilities within that group that keep beds, bathrooms or other spaces separate for men and women for both emergency and longer-term stays. His measure would have given those places the legal authority to establish rules so only people whose biological sex corresponds with that of what the shelter serves would be granted access to services, no matter how people identify.", "Next, we obtained the memo to which the LGBTQ Nation headline and press release were referring: a 29-page document on HUD's official website titled \"Making Admission or Placement Determinations Based on Sex in Facilities Under Community Planning and Development Housing Programs.\" The docket was signed by Carson, a former neurosurgeon whom Trump appointed to lead HUD in 2016.", "The document details the specifics of his proposal, as well as his rationale for introducing it, amid a series of unrelated initiatives by the Trump administration to weaken federal protections for transgender Americans.", "The in-question measure would have changed existing guidelines that, the document alleged, Obama's administration enacted in violation of administrative law and \"minimized local control, burdened religious organizations, manifested privacy issues, and imposed regulatory burdens.\" The proposal read:", "If a single-sex facility permissibly provides accommodation for women, and its policy is to serve only biological women, without regard to gender identity, it may decline to accommodate a person who identifies as female but who is a biological male. Conversely, the same shelter may not, on the basis of sex, decline to accommodate a person who identifies as male but who is a biological female. A different shelter may choose not to make placement decisions or accommodations based on biological sex and there remains no mandate that shelters take biological sex into account.", "At one point, the document implied that the existing Equal Access rule — requiring facilities nationwide to provide housing, regardless of incoming residents' gender identities — posed a danger to shelter residents; an argument that appeared to be rooted in the unsubstantiated and transphobic claim that men with nefarious intentions might pose as trans women and gain access to female facilities to stalk or harass women. However, the document did not explain how or under what circumstances HUD came to that assumption, nor did it provide verifiable instances of that happening, aside from a pending lawsuit in Fresno, California, that alleges a shelter there allowed such behavior. The HUD proposal stated:", "[The] current rule makes it impracticable for some shelters to, after admitting a biological male, adequately protect the privacy interests of their biological female clientele who do not want to shower, undress, and sleep in the same facilities as biological men.", "Pending whatever shelters decide for their entry policies under the proposal, the document stated, staff at facilities that are designed to exclusively serve men or women would ask incoming residents their gender identities before giving them beds. In those cases, if intake workers had \"good faith\" to believe someone was presenting as male or female but that gender did not correspond with their birth sex — which is literally the definition of being transgender — and that birth sex was not served by the shelter, the staff could turn them away.", "It was at that point in the docket HUD wrote:", "HUD believes that reasonable considerations [for determining whether a person is transgender] may include, but are not limited to a combination of factors such as height, the presence (but not the absence) of facial hair, the presence of an Adam’s apple, and other physical characteristics which, when considered together, are indicative of a person’s biological sex.", "In sum, it is accurate to state that under the leadership of Trump, HUD issued a memo in July 2020 that outlined steps for staff at federally funded homeless shelters to determine whether or not incoming residents were transgender, and given the language — it listed masculine physical features and how to notice them, presumably in circumstances when trans women are seeking housing at female-only shelters — we rate this claim \"True.\"", "However, this fact was key: The measure regarding homeless shelters' entry guidelines never took hold at facilities.", "Federal leaders were still debating the proposal at the time of the November 2020 election. And after voters elected Democratic candidate Joe Biden over Trump, Biden's HUD Secretary, Marcia Fudge, withdrew the Trump-era measure from consideration. Fudge said in an April 2021 statement:", "Unfortunately, transgender and gender non-conforming people report more instances of housing instability and homelessness than cisgender people. Today, we are taking a critical step in affirming HUD’s commitment that no person be denied access to housing or other critical services because of their gender identity.", "Bollinger, Alex.   \"Trump Administration Memo Explains How To Spot A transgender Woman\".\r\n   LGBTQ.   20 July 2020.", "Burns, Katelyn.   \"The Trump Administration's Proposed Homeless Shelter Rule Spells Out How To Spot A Trans Woman\".\r\n   Vox.   17 July 2020.", "U.S. Department of Housing and Urban Development.   \"Press Releases\".\r\n   1 July 2020.", "Jan, Tracy.   \"Proposed HUD Rule Would Strip Transgender Protections At Homeless Shelters\".\r\n   The Washington Post.   22 May 2019.", "Burns, Katelyn.   \"The Trump Administration Is Targeting Homeless Trans People In The Middle Of A Pandemic\".\r\n   Vox.   2 July 2020.", "Office Of The Secretary HUD.   \"Department of Housing And Urban Development\".\r\n   Accessed 23 July 2020.", "Federal Register.   \"Housing And Community Development Act Of 1980: Verification Of Eligible Status\".\r\n   National Archives.   5 October 2019.", "Cameron, Chris.   \"HUD Rule Would Dismantle Protections For Homeless Transgender People\".\r\n   The New York Times.   1 July 2020.", "National Center for Transgender Equality.   \"The Discrimination Administration\".\r\n   Accessed 23 July 2020.", "Appleton, Rory.   \"Women Accuse Poverello House Of Allowing Transgender Resident To Sexually Harass Them\".\r\n   The Fresno Bee.   12 October 2020.", "This post was updated after President Joe Biden's HUD Secretary, Marcia Fudge, withdrew the proposal for consideration.", "Jessica Lee is Snopes' Senior Assignments Editor with expertise in investigative storytelling, media literacy advocacy and digital audience engagement.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]