["About this rating", "A Paralympic swimmer was disqualified from a race after failing to cover up a tattoo.", "Paralympic or Olympic athletes with Olympic rings tattoos will not automatically be disqualified from their events.", "On 2 May 2016, British Paralympic swimming champion Josef Craig was disqualified from a race at the International Paralympic Committee (IPC) European Championships after he failed to cover up a tattoo on his chest that depicted the Olympic Rings logo:", "Craig, 19, was disqualified because of an International Paralympic Committee swimming rule that states, “body advertisements are not allowed in any way whatsoever (this includes tattoos and symbols).”", "Shortly after Craig's disqualification, a rumor began circulating that any athlete with an Olympic rings tattoo would be disqualified from elite sports (i.e., Olympic or Paralympic events). However, that isn't exactly the case: a spokesperson for the IPC told the media that Craig wasn't disqualified specifically for having a tattoo that shows the Olympic rings, but because his tattoo was viewed as constituting \"advertising\" for a sporting event other than the one in which he was participating:", "Body advertising is not allowed in any way whatsoever and that includes the Olympic rings. The athlete did not wear a cover and was therefore disqualified.", "All teams are informed of the advertising policy at a technical meeting prior to competition so it wasn't as if they had not been reminded about the rules.\"", "Craig, who won a gold medal in a 2012 Paralympics men's swimming event (and didn't have the Olympics rings tattoo at the time) was also not automatically disqualified from all of his events.  He was allowed to continue participating as long as he covered the tattoo, which he did.", "While the Paralympics are sometimes viewed as a subset of the Olympics, they are run by two different organizations. The International Paralympic Committee and the International Olympic Committee are separate organizations, operate under two different sets of rules, and use very different logos (the following is the IPC logo):", "While the IPC will not allow their athletes to show Olympic rings tattoos during Olympic events since the symbol could be construed as advertising for another event, athletes are still allowed to show Olympic ring tattoos during Olympic events.", "In fact, Olympic rings tattoos are quite popular among Olympic athletes. A gallery of Olympic athletes with tattoos published by the Baltimore Sun shows several athletes competing with the iconic rings design inked on their bodies:", "While it's true that a Paralympic athlete was temporarily disqualified from Paralympic events for having an uncovered tattoo of Olympic rings on his chest, which violated a rule against advertising for other events, this rule only applies to athletes competing under IPC regulations, not to all athletes (and that rule can be satisfied through the covering of tattoos).", "The Olympics have similar, strict rules and guidelines about brand identification, which extends to tattoos.  As with the Paralympics, bearing a tattoo will not automatically disqualify a participant from all events: if such a tattoo violates rules about branding or placement, it just must be covered.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]