["By Robert Farley", "Posted on October 13, 2016", "Donald Trump wrongly labeled the debates “rigged” because the Commission on Presidential Debates’ “head guy used to work for Bill Clinton.” The nonpartisan debate commission is co-chaired by a former Clinton aide and a former Republican National Committee chairman.", "“And by the way, you know that so-called Commission on Presidential Debates, the head guy used to work for Bill Clinton,” Trump said during a speech in Ocala, Florida, on Oct. 12. “Did you know that? I just found that out. The head guy worked for Bill Clinton. What a rigged deal this is. But here’s the story. I have no respect for that group by the way, I have none. It sounds good. Presidential commission, give me a break.”", "Let’s keep this short.", "The Commission on Presidential Debates — which has sponsored all of the presidential debates since 1988 — has two co-chairmen. One of them is Michael D. McCurry, a former press secretary for Bill Clinton. But the other co-chair is Frank J. Fahrenkopf Jr., who was chairman of the Republican National Committee from 1983 to 1989.", "CPD was co-founded in 1987 by Fahrenkopf and Paul Kirk Jr., then chairman of the Democratic National Committee. McCurry succeeded Kirk as co-chairman of CPD in 2009.", "Since 1989, when both Kirk and Fahrenkopf ended their terms as chair of the Democratic National Committee and Republican National Committee, respectively, “no sitting officer of either major party has had any affiliation with the CPD and the major parties have no role whatsoever in running CPD or setting its policies,” according to the CPD website.", "The commission’s board of directors is comprised of Democrats and Republicans (Republicans include former Sens. John Danforth and Olympia Snowe and former Indiana Gov. Mitch Daniels), business executives and media personalities.", "We should note that several media publications misreported Trump’s comments in Ocala, reporting that he said, “I have no respect for that group [CPD], by the way, I’m done.” The media outlets then speculated about whether Trump was saying that he would not participate in the final debate. As we noted above, Trump did not say he was “done,” he said he had “no respect” for CPD, adding “I have none.” A spokesman for Trump confirmed he would be participating in the final debate in Las Vegas on Oct. 19.", "https://www.sharethefacts.co/share/4371668c-964f-4ca4-ad65-a9d4fac888fe", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]