["About this rating", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "In March 2020, U.S. President Donald Trump faced widespread scrutiny for various aspects of his administration's response to the economic and public health crisis triggered by the COVID-19 pandemic. Among other points of criticism was his repeated insistence on referring to the disease as the \"Chinese virus,\" despite widely-accepted public health authority guidelines that warn against naming disease outbreaks after nations or regions of the world, due to the unfounded stigmatization such names can cause.", "The president used that name again during a White House briefing on March 19. Afterwards, social media users shared a photograph purportedly taken at the event, which appeared to show that Trump was even ignoring the guidance of his aides in insisting on referring to COVID-19 as the \"Chinese virus.\" Washington Post photographer Jabin Botsford tweeted the following:", "Those images were authentic. The original, official photograph was taken by Botsford himself and published by the Getty Images agency on March 19. The website described the image as follows:", "\"A close up of President Donald J. Trump's notes shows where Corona was crossed out 'Corona' and replaced with 'Chinese' Virus as he speaks with his coronavirus task force in response to the COVID-19 coronavirus pandemic during a briefing in the James S. Brady Press Briefing Room at the White House on Thursday, March 19, 2020 in Washington, DC.\"", "Photo by Jabin Botsford/The Washington Post via Getty Images", "Trump did call COVID-19 the \"Chinese virus\" in his March 19 remarks, although perhaps ironically, he referred to it simply as \"the virus\" in the place where \"Corona\" had been scratched out and replaced in handwriting by \"Chinese\" in his notes. As shown in the video below, he actually said at that point: \"As you know, my administration is working every day to protect the American people and the American economy from the virus [...]\":", "It's not clear who made the handwritten edit in black marker on March 19, but the handwriting style certainly appeared consistent with that seen in notes which Trump famously held in his hand as he spoke to reporters in November 2019 at the height of Congressional hearings held in advance of his own impeachment trial:", "Left: Mark Wilson/Getty Images. Right: Jabin Botsford/The Washington Post via Getty Images", "Lucey, Catherine.  \"Trump's Message on Virus Draws Scrutiny.\"\r\n  The Wall Street Journal.  5 March 2020.", "Rogers, Katie; Jakes, Lara.  \"Trump Defends Calling the Coronavirus the 'Chinese Virus.'\"\r\n  The New York Times.  18 March 2020.", "World Health Organization.  \"WHO Issues Best Practices for Naming New Human Infectious Diseases.\"\r\n  8 May 2015.", "Palma, Bethania.  \"Did Trump Use Notes to Self in Sharpie Pen That Said 'I Want Nothing.'\"\r\n  Snopes.  22 November 2019.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]