["About this rating", "In September 2016, numerous conspiracy-minded websites published near-identical stories describing the alleged discovery of a giant, fossilized human footprint in China. An example of such an article can be found on the website strangesounds.org, which stated that:", "On August 24, 2016 a giant human footprint was discovered fossilized in a rock in Pingyan village in China’s southwestern province of Guizhou.", "One of the huge footprints discovered is 57 centimeters long, 20 centimeters wide and 3 centimeters deep.", "That story appears to have gotten its initial spark from a sparsely detailed post published on August 26, 2016, on the English-language site of the Chinese content aggregator Sino:", "This post, however, listed its source as “agencies” and did not provide any details regarding the footprint’s dimensions. While not conclusive, an exhaustive search of terms related to human archaeology, footprints, fossils, and photographers for stories published in Guizhou’s local paper in August 2016 turned up zero results.", "The dimensions mentioned above would indeed be impressive given the fact that the typical length of a human male’s foot is 18 cm, and a female’s is 16.5 cm. Still, the provenance of these figures, as well as that of the photographs appearing on Sino, is opaque.", "Many of the conspiracy website posts go on to make factually dubious, wholly unrelated claims about other alleged giant human footprints, including the claim that an archaeologist named Michael Tellinger — a conspiracy theorist who does not subject his ideas to peer review — dated a purported giant humanoid footprint to be around 200 million years old.", "These claims do not hold up to any level of scrutiny since this alleged footprint is contained within solid granite, which isn’t a material that lends itself to capturing prints of any kind. The rock is also most likely closer to 3.1 billion  years old, which would require even more rewriting of our understanding of evolutionary history than a 200-million-year-old giant human would.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]