["“Joe Biden was sleeping during a TV live interview,” reads the caption of a video shared on Facebook, Twitter, Instagram and other platforms on August 30, 2020.", "The video shows a news anchor attempting to introduce the interviewee “live from New York,” only to realize that the subject, Joe Biden, has his eyes closed and is snoring. Despite insisting, “Wake up, Wake up,” Biden remains asleep and snoring, causing laughter in the newsroom.", "The bottom of the screen reads “Joe Biden: The Importance of This Election.”", "However, the video is a montage. The Democratic Party’s nominee did not fall asleep on live TV.", "Twitter users pointed to the original footage of journalist Leyla Santiago from October 2011, when TV station KBAK from Bakersfield, California attempted to interview Belafonte, who was in New York City.", "Then aged 84, Belafonte seemed to have fallen asleep before talking to the morning show “Eyewitness News,” although the singer blamed a lost connection that made him unable to hear the host talking to him.", "“They keep stooping lower and lower,” Belafonte said of the manipulated video in a statement to Deadline.", "“A technical glitch in an interview I did nine years ago now becomes another one of their lies, more of their fake news.”", "John Dabkovich, a CBS journalist who was co-anchor in the studio that day, labeled the video as “fake” on Twitter after White House Deputy Chief of Staff for Communications Dan Scavino shared it on the platform on August 30, 2020.", "The video of Biden with his eyes seemingly closed is from an endorsement of the nominee by former Democratic candidate Hillary Clinton. Biden lowers his eyes several times throughout the video, making it seem possible that they were closed at some point.", "Several visual clues confirm this. In both videos, Biden is wearing a red tie, a US flag pin, and has three small white triangles sewn in his suit pocket. The same white shelves appear in the background of both videos, as well as a football and two picture frames.", "The snoring noises, as well as the banner at the bottom of the screen, appear to have been fabricated entirely.", "Questions were, however, raised in 2011 about whether Biden was sleeping during former president Barack Obama’s budget speech.", "Republican candidate Donald Trump, trailing his opponent in polls, has sought to portray the Democratic candidate as senile, calling him “Sleepy Joe,” though the two men are only three years apart in age.", "The Biden campaign has yet to respond to an AFP request for comment.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]