["The photo, which shows a smiling military official being carried on the shoulders of his subordinates, was published in a Facebook post here on December 3, 2019. It has been shared more than 10,000 times.", "Below is a screenshot of the misleading Facebook post:", "The post's Sinhala-language text translates to English as: “A photograph taken in 1985 during Mr. Gotabaya Rajapaksa’s military training in Pakistan”.", "Rajapaksa, who has a storied military career, was elected president in Sri Lanka’s November 17 vote. AFP reported on Rajapaksa’s electoral victory here.", "The photo was also published here on Facebook alongside a similar claim.", "The claim is false; the image actually shows Dr. Terawan Agus Putranto, Indonesia's new Minister of Health and a military doctor.", "The photo was taken in October 2019 as Putranto was celebrating a military promotion to the rank of lieutenant general, which came just hours before he was appointed as head of the Ministry of Health.", "A keyword search found this article published on October 24, 2019 by ANTV Klik, an Indonesian television network, that featured the same image.", "Below is a screenshot of the article and the photo:", "The article's Indonesian-language headline translate to English as: “Minister of Health, Dr. Terawan was promoted to Lieutenant General.\"", "A excerpt from the article translates to English as: \"Doctor Terawan Agus Putranto got a promotion from Major General to Lieutenant General. The promotion was obtained before the person inaugurated President Joko Widodo as Minister of Health, Wednesday (10/23/2019).\"", "A reverse image search of the photo in the misleading posts also found this blog post, which included the same photo in an article titled “Getting to know the most famous doctor, second military officer who became Minister of Health”.", "Further keyword searches found this video published on October 23, 2019 by Indonesian broadcaster Indosiar on VIDIO, an Indonesian video streaming platform. The one-minute 37-second video features moments (0:15 to 0:22) from the same celebratory event for Dr. Terawan where the misleading photo was captured.", "Below is a screenshot comparison of the misleading post (L) and footage from the Indosiar video (R):", "The military uniform and badges worn by Dr. Terawan in the image differ from the Sri Lankan military’s dress code, which is shown here in the Sri Lanka Army’s dress regulation manual.", "Below is a comparison of the Indonesian military uniform (L) and the Sri Lankan military uniform (R):", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]