["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Michael Bennet (left) and Darryl Glenn face-off in the Club 20 U.S. Senate debate. YouTube", "During a U.S. Senate debate in Colorado, Democratic Sen. Michael Bennet said his Republican opponent, Darryl Glenn, has said that Democrats are \"evil\" and he's \"tired of hearing about Republicans reaching across the aisle.\"", "The confrontation happened at the end of a Sept. 10 debate at the Club 20 forum in Grand Junction, where three opponents -- Bennett, Glenn and Libertarian candidate Lily Tang Williams -- were allowed to question opponents for three minutes.", "Bennet, who went last, saved his fire for Glenn, an El Paso County commissioner.", "\"Over the course of this campaign you said, 'I don't know any elected Democrats I get along with.’ You said, 'I'm running against Democrats, I'm running against evil.’ And you said you're 'tired of hearing about Republicans reaching across the aisle,'\" Bennet told Glenn. \"Your policies and views, like privatizing the V.A. and calling for the elimination and defunding of all agencies like the Department of Education and also EPA and Energy, are far to the right of many Colorado Republicans.", "\"How exactly would you get anything done (in Congress) and live up to your own standards?\"  Bennet asked.", "Glenn didn’t answer the question. Instead he countered that Bennet’s \"idea of reaching across the aisle is supporting the Iran nuclear deal. His idea of reaching across the aisle is having Republicans support the Affordable Care Act when we already know the devastating impact that's happening to people. His idea of reaching across the aisle is supporting EPA standards that are going to result in over 1,200 jobs that are being lost here.\" (Watch the exchange at 01:07:00 in the video)", "In his rebuttal, Bennet said Glenn was wrong and highlighted his bipartisan collaboration on the No Child Left Behind education law and the 2013 immigration bill.", "In this fact-check, we examine Bennet’s claim that Glenn has described his fight against Democrats as \"running against evil\" and complained about fellow Republicans \"reaching across the aisle.\"", "While Colorado -- like the rest of country -- has passionate political divisions, voters also want their elected leaders to work together for the betterment of the Centennial State. There are more registered independent voters in the state than Republicans or Democrats.", "Yet, with little money and a shoe-string campaign, Glenn won a surprise upset in a crowded Republican primary.", "Glenn has repeatedly said that Republicans and Democrats working together is what’s wrong with Congress.", "The Denver Post reported that a growing number of Republican strategists are concerned about Glenn's campaign strategy against Bennet and his apparent inability to reach beyond Republican voters.", "PolitiFact confirmed that Glenn made all the comments quoted by Bennet at the debate -- often repeating his disdain for Republicans who work with Democrats. The Bennet campaign turned a montage of Glenn’s edgy remarks into a video ad called, \"Across the Aisle.\"", "Here's a sampling:", "\"I'm running against the Democrats. I'm running against evil\" -- Glenn at a North JeffCo Tea Party event, April 16, 2015.", "\"I don't know any elected Democrats that I get along with\" -- Glenn during a Republican U.S. Senate candidates debate on KUSA-TV, April 5, 2016.", "\"I'm tired of Republicans complaining. I'm tired of Republicans wanting to just reach across the aisle. We need to stand up and lead\" -- Glenn on KLZ-560 AM on April 11, 2016. Listen to his comments at 2:20 in the interview", "During a May 25 Republican Senate candidate primary debate on Colorado Public Television, Glenn rebuked a moderator who asked how he'd \"work across party lines and try to find some consensus and some compromise\" and \"get something done\" in a polarized Congress.", "\"I think your question exemplifies what’s wrong with America and the frustration that's out there. You don't get it,\" Glenn replied. \"The bottom line is it’s not about reaching across the aisle. The bottom line is...leadership. You need to actually have a leader to stand up there and represent the values of what's going on in this country.\"  (Watch the exchange at 44:30 in this debate video.)", "We asked the Glenn campaign if he disputed the accuracy of the quotes cited by Bennet. They did not respond.", "Our ruling", "Bennet said that Republican Darryl Glenn has described Democrats as \"evil\" and has said he's \"tired of hearing about Republicans reaching across the aisle.\"", "Glenn doesn't back away from his disdain for bipartisanship. He told a debate moderator who asked how he’d worked with Democrats to get something done in the Senate that \"your question exemplifies what’s wrong with America.\"", "We rate the claim True.", "https://www.sharethefacts.co/share/b98c08e5-9243-4da4-8104-dda8b40b9f62", "Club 20 U.S.Senate candidates debate video, September 10, 2016", "Denver Post, \"Darryl Glenn failure to launch in Senate race worries fellow Republicans,\" August 28, 2016", "Darryl Glenn, radio interview on KLZ-560 AM, April 11, 2016.", "Colorado Public Television U.S. Senate  Republican candidates debate video, May 25, 2016", "Bennet campaign, \"Across the Aisle\" video ad, July 19, 2016", "Interview with Andrew Zucker, spokesman for Bennet campaign on September 14, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]