["“Keystone pipeline shut down. 28,000 jobs lost! What a productive first day!” says a January 20, 2021 Facebook post shared more than 6,000 times.", "“Biden CANCELS Keystone Pipeline on - Day 1… 83k jobs lost,” says another version of the post, on the page of Share to Save America, while the musician Ted Nugent posted that Biden had fired “12,000 folks who’ve been building the XL Keystone Pipeline.”", "US employment on the pipeline project was forecast to exceed 11,000 workers in 2021. It is common in infrastructure development for there to be large variances between initial jobs needed to establish a project, those expected to be created later, and spinoff positions in other sectors.", "The pipeline company TC Energy told AFP in an email that the lost jobs are below any of the cited figures.", "“This is to confirm that 1,000 unionized jobs will be lost with the presidential permit being revoked for Keystone XL,” said Terry Cunha, a spokesman for the Calgary-based firm.", "“Jobs will be lost in Canada and the US,” he added later, referring to the 1,000 positions.", "North America’s Building Trades Unions (NABTU) gave a similar figure in a statement that expressed deep disappointment with the Biden administration’s decision.", "“Environmental ideologues have now prevailed, and over a thousand union men and women have been terminated from employment on the project,” said the group whose affiliates include the International Union of Operating Engineers, plumbers and pipefitters, the Laborers’ International Union, and Teamsters.", "A NABTU spokeswoman did not reply to an AFP request for comment on the job losses by the time of publication.", "TC Energy in August 2020 announced it had reached a partnership with  those four unions to build Keystone XL, and had also said construction would create about 10,400 US-based jobs and 2,800 in Canada.", "Biden’s revocation of Keystone XL complicates Canada’s efforts to reset relations with the US after four years of strained ties under former president Donald Trump, experts said.", "The Keystone permit was among numerous measures Biden revoked or ordered reviewed on his first day in office under an Executive Order to protect public health, the environment and to confront the climate crisis.", "“The Permit is hereby revoked,” the January 20 order says. “The Keystone XL pipeline disserves the US national interest.”", "It said that the government had concluded in 2015 that “the significance of the proposed pipeline for our energy security and economy is limited.” Biden’s administration wants to “create good clean-energy jobs” and reduce harmful emissions, the order says.", "In March 2017, Trump disregarded environmental concerns to approve the pipeline, which his predecessor Barack Obama had blocked. Trump called it “a great day for American jobs.”", "Keystone XL was a plan for a 1,200-mile expansion of the company’s existing pipeline system, linked to refineries on the US Gulf Coast, that from 2023 would have transported up to 830,000 barrels of crude per day from Alberta's oil sands.", "On January 20, in expectation of Biden’s revocation, TC Energy said “advancement of the project will be suspended.”", "TC Energy announced in October 2020 the awarding of $1.6 billion worth of contracts to six major American firms for 800 miles of Keystone XL construction in Montana, Wisconsin and Texas in 2021.", "It said those companies would hire more than 7,000 union workers this year, and additional contracts would raise to more than 8,000 the number of US union members on the pipeline, with total 2021 employment expected to exceed 11,000 Americans.", "The same statement quoted James T. Callahan, general president of the International Union of Operating Engineers, as citing “8,000 American union jobs that come with 2021 construction.”", "Despite numerous attempts, AFP was unable to reach Callahan’s assistant, who did not return a phone message about the potential jobs lost.", "But Terry McGowan, president and business manager of IUOE Local 139 in Pewaukee, Wisconsin, said by phone that the Keystone XL project, which was planned to ramp up in 2021 and peak about a year from now, would have employed at least 2,000 of his members.", "“This particular project would’ve had 8,000 employees” overall, he said, expressing dismay at Biden’s decision which adds to an existing decline in pipeline work.", "“Ease the clutch in. Don't just jam it into gear,” said McGowan, whose members earn around $40 an hour running bulldozers, cranes and other heavy equipment.", "McGowan said that “probably around 500 members” from his union chapter are being sent home right now. Since last fall they had been doing “ancillary work” such as building warehouse sites for staging equipment prior to the main construction.", "Asked how many workers, other than those from his chapter, have immediately lost jobs, he did not have a figure but said various trades are affected.", "“We've got welders from Wisconsin. We've got laborers. We've got Teamsters. It's mostly operating engineers but we're not alone,” McGowan said.", "IUOE local officials in Montana and Dayton, Texas, did not return messages asking if their members were immediately affected by the job losses.", "Cunha of TC Energy confirmed to AFP that total US employment on the pipeline was to reach more than 11,000 this year.", "None of  those figures is anywhere near the tens of thousands cited in some Facebook posts.", "In his post, Nugent said that, “Including secondary support jobs, Biden is putting around 50,000 on unemployment in his first day.”", "This is also not correct but could be a rough reference to a figure of 42,000 jobs which appeared in an 11-volume State Department study of Keystone XL published in 2014. Fact-checking organization PolitiFact first analyzed the 42,000 figure in that year.", "The report, from the State Department’s Bureau of Oceans and International Environmental and Scientific Affairs, said construction spending would support around 42,100 jobs throughout the US for the roughly two-year period needed to build the pipeline.", "The report defined a job as a position for one year and said 16,100 would be directly linked to contracts including for construction. The balance of about 26,000 would result from indirect spending from construction workers or suppliers.", "Building the pipeline would contribute around $3.4 billion to US gross domestic product, and would generate about 50 jobs when operational, the State Department report said.", "Although Trump approved the project in 2017, the company only confirmed on March 31, 2020 that it would build Keystone XL, with $1.1 billion in Alberta government funding.", "“The remaining capital investment of approximately $6.9 billion is expected to be largely made in 2021 and 2022,” TC Energy said.", "Similarly, for the roughly 2,800 jobs the company had said would be created in Canada from the pipeline's construction, \"we're not going to see the 2,800 people today laid off,\" said Associate Professor Trevor Tombe of the University of Calgary's Department of Economics.", "\"That was the number of jobs during the whole construction phase, so many of those were not created yet in the first place, so it's sort of like a lost opportunity if you will,\" he said by phone, after claims that Biden’s Keystone XL decision cost 17,000 Canadian jobs “in only one day.”", "“That claim would be false to say at the moment,” Tombe said.", "The 17,000 figure includes estimates of direct and spinoff job opportunities but the latter \"need to be taken with a very large grain of salt because they are based entirely on certain types of models that don't generally do a good job at actually predicting what the employment effect would be.\"", "Pierre-Olivier Pineau, a professor at HEC Montreal, said it is “completely misleading” to claim that 17,000 jobs disappeared in Canada.", "He said the justification for pipelines is not to create jobs, and the petroleum industry in general employs relatively few.", "“If you were wanting to put jobs at the forefront, cancellation of Keystone XL is perhaps a good thing because it will allow resources to be invested in sectors where there would be more long-term jobs -- such as in electricity,” Pineau said by email.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]