["The graphic was published here on Facebook on October 10, 2020. It has been shared more than 590 times.", "The graphic shows two pie charts. They purport to compare public trust in the National League for Democracy (NLD) party, headed by Myanmar’s civilian leader Aung San Suu Kyi, with the opposition Union Solidarity and Development Party (USDP). The figures on the charts suggest public trust in the NLD fell to 13 percent in 2020 from 82 percent in 2015.", "Myanmar is set to hold a general election on November 8, 2020, as reported here by AFP.", "The Burmese-language title of the post translates to English as: “Public trust on Daw Suu goes down to the lowest level, survey shows”.", "Part of the post reads: “According to a one-year survey conducted by the Private Electoral Monitoring Group (PEMG) from October 9, 2019 to October 9, 2020, Suu Kyi, once the hope of the Burmese people, has now fallen to the lowest level of public trust.”", "The post also states that the “PEMG survey” shows 25 percent of people living in urban areas and 10 percent of people from rural areas still indicate a preference for Aung San Suu Kyi.", "The graphic was also published here and here on a website named Radio Free Myanmar (RFM) which has previously been exposed as a misinformation network, according to this report by local news site Frontier Myanmar.", "The photo was also published on Facebook here, and here with a similar claim.", "The claim, however, is false.", "Multiple keywords searches found no record for the \"Private Electoral Monitoring Group\" cited in the misleading posts.", "In response to the misleading posts, Monywa U Aung Sin, the secretary of the Central Information Committee of NLD, told AFP on October 20 that the survey shows “fake information” and they were not aware of an electoral monitoring group named PEMG.", "He said: “[It] is false that only 13 percent of the people support Daw Aung San Suu Kyi. This is fake information and Daw Aung San Suu Kyi was attacked with false information as the election drew near. We also see more and more attacks with false information.”", "In response to the misleading posts, Ko Han Soe Tun, program manager for the People's Alliance for Credible Elections (PACE), Myanmar’s election monitoring authority, told AFP: “In my opinion, these survey findings do not mention methodology in details. They don’t mention the method of the survey, such as how they collected the data - did they collect the data by telephone or on the ground? So I think the validity of this survey is weak. And I personally have never heard of an election monitoring group named PEMG.”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]