["The meme features an image of Omar, which first appeared on the cover of TIME in 2017 and is published online here alongside the interview she gave at the time.", "This July 16, 2019 Facebook post, shared hundreds of times, contains the meme which has text superimposed on the image saying:", "“Her Own Twitter words. 'I am America’s hope and the president’s nightmare'. 'I think all white men should be put in chains as slaves because they will never submit to Islam': Ilhan Omar. Sen. Ilhan Omar Let that sink in….”", "Omar was elected to the U.S. House of Representatives – also known as Congress – in 2018. She does not sit in the US Senate.", "Below is a screenshot of the misleading post:", "The meme has been shared elsewhere online, for example here on Twitter.", "The claim is false; there is no record of Omar tweeting any such comment, and the phrase was not included in her 2017 interview with TIME magazine, a video of which can be seen here.", "There is no record on Omar’s Twitter account of her tweeting the phrase: \"I think all white men should be put in chains as slaves because they will never submit to Islam\".", "Here is a search result from her Twitter account using those keywords which returned no results. Below is a screenshot of the search:", "The first section of the quote in the misleading posts has been taken from Omar’s interview with Trevor Noah on The Daily Show in July 2017.", "The episode was published on the Comedy Central website here on July 13, 2017.", "During the interview, at the 0:47 mark in the video, Noah says: “You are someone who is all too familiar with being a refugee, you're from Somalia, you're also a Muslim person, you're also a woman. You are everything that President Trump seems to be against, and you are in government. What's the plan?\"", "At the 1:14 minute mark Omar replies: “I am America’s hope and the president’s nightmare”. The video is embedded below:", "While addressing supporters in Minnesota July 19, 2019, Omar clarified this comment, as seen in this video published to Facebook by US media organisation NowThis and viewed more than 250,000 times.", "At the 0:28 mark in the video, Omar says: \"When I said I was the hope of the United States it’s because I embody what that hope should look like. And when I said I was the president’s nightmare… well, you’re watching it now. Because his nightmare is seeing a Somali refugee rise to Congress.\"", "Omar posted these screenshots of misleading posts containing the meme on her verified Twitter account on 19 November, 2018, with the caption: “Who said facts mattered?”.", "That tweet is embedded below:", "Who said facts mattered? ??‍♀️ pic.twitter.com/LMomzRrLZj", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]