["About this rating", "On 1 January 2018, the Ladies of Liberty web site published an article reporting that the FBI had found $4 million in cash and two bodies in a storage unit belonging to the Democratic mayor of a Missouri town:", "Moyor [sic] Stephen “Stormin’” Foreman of Goose Rapids, Missouri has been placed on the FBI’s most wanted list after a storage locker he apparently forgot to pay for was auctioned off — complete with $4 million in cash and 2 dead bodies.", "Special Agent Hendrick Slurryman explained that it was a clerical error that caused the Mayor, a Democrat, to tuck tail and run:", "“Steve Foreman would have never even been a suspect in the crimes we found evidence of in that locker. The bodies and money trace back to an armored car robbery in Southeast New Mexico. He had the unit on an autopay contract but his credit card expired and due to a juxtoposed number ... he never got the notice in the mail.”", "None of this was true.  There is no town by the name of Goose Rapids in the state of Missouri, and Mayor Stephen \"Stormin'\" Foreman is likewise fictional.  The photograph of an FBI agent and a sheriff that accompanied the article was actually an unrelated picture from a 2016 child abuse investigation.", "This story originated with Ladies of Liberty, a site that is part of a network of fake news sites dedicated to spreading political misinformation under the guise of proffering \"satire.\"  A similar fake story from the same network posited that a raid on a Tennessee congressman's property had turned up a meth lab and fourteen pounds of methamphetamine.", "Eagleton, Loreli.   \"$4 Million and 2 Dead Bodies Found in Democrat Mayor’s Storage Unit.\"\r\n    Ladies of Liberty.   1 January 2018.", "McKenna, Chris.   \"FBI Launches Child-Abuse Investigation at Kiryas Joel.\"\r\n    Times Herald-Record.   12 May 2016.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]