["A quote attributed to Democratic presidential nominee Joe Biden that’s being copied and pasted across Facebook garbles what he actually said about his upbringing.", "\"Biden said ‘I lived in Section 8 housing as a little boy…’ Joe was 32 when Section 8 began in 1974,\" one such Facebook post says.", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The claim seems to have originated from comments Biden made during an ABC News town hall on Oct. 15.", "About 24 minutes into the town hall, Biden was asked what he had to say \"to young Black voters who see voting for you as further participation in a system that continually fails to protect them.\"", "Biden responded that there are two things he’s cared about throughout his career: enabling Black Americans to generate wealth and education. He talked about the importance of pre-kindergarten education and successfully completing 12 years of school after that. Then he pivoted to housing and affordability, and compared white homebuyers to Black homebuyers. If a house was built in a white neighborhood and then the same exact house was built in a Black neighborhood, the home in the Black neighborhood would be valued at 29% less than the home in the white neighborhood.", "\"We’ve got to end this,\" Biden said.", "He then talked about his own family history, saying that after his father lost his job he couldn’t afford to buy a home for years, but that once he did, the Biden family was able to start accumulating wealth. In the meantime, though, \"we lived in an apartment,\" Biden said, \"which became Section 8 housing much later.\"", "Biden then says, \"It wasn’t — it was just normal apartments.\"", "He didn’t claim to live in Section 8 housing, a program that was authorized by Congress in 1974 to provide rental subsidies for eligible Americans. Biden would have been about 32 in 1974.", "We rate this Facebook post False.", "Facebook post, Oct. 18, 2020", "ABC News, Joe Biden town hall transcript, Oct. 15, 2020", "Rev, Joe Biden ABC Town Hall transcript October 15, Oct. 15, 2020", "HUD.gov, Section 8 program background information, visited Oct. 19, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]