["About this rating", "In February 2021, Snopes became aware of news reports and social media posts claiming a former New York Police Department (NYPD) officer authored a letter on his deathbed that served as evidence that the NYPD and FBI conspired in the 1965 murder of civil rights activist and Nation of Islam figurehead Malcolm X.", "The posts' underlying claims were these: that a Black man named Raymond Wood wrote a letter shortly before his death that authentically outlined his experience working as an undercover NYPD officer in the mid-1960's, when, he supposedly claimed, his supervisors ordered him to carry out a secret plan that led to the killing of the famed Black leader.", "To investigate the validity of those assertions, we first considered the known circumstances of Malcolm X's death.", "He was fatally shot while speaking to a crowd at Harlem's Audubon Ballroom in Manhattan on Feb. 21, 1965. Authorities immediately arrested one man, Mujahid Abdul Halim (or Talmadge Hayer), fleeing the ballroom with a clip from a handgun used in the assassination and later detained two men, Muhammad Abdul Aziz (or Norman 3x Butler) and Khalil Islam (or Thomas 15X Johnson). All suspects were members of the Nation of Islam, from which Malcom X separated shortly before the fatal shooting.", "During trial, Halim admitted his guilt, but said the other two suspects were innocent, The New York Times reported. Nonetheless, all three men were convicted in the killing and received life sentences. (Halim served 45 years in prison before he received parole in 2010; Islam, who received parole in 1987, died in 2009. Aziz, 83, received parole in 1985, per The Washington Post.)", "For decades, however, scholars and civil rights activists have long maintained authorities botched the murder investigation and imprisoned the wrong men. In 2020, following the release of the Netflix documentary series titled \"Who Killed Malcolm X?\", Manhattan District Attorney Cyrus Vance launched a new probe to determine if, or to what extent, Islam and Aziz were innocent.", "Next, we reviewed a video recording of a Feb. 20 press conference at which Malcolm X's three daughters, along with civil rights attorney Ben Crump and Reggie Wood — a cousin of Raymond Wood — announced the existence of the alleged letter by the former NYPD officer and discussed its contents. Reggie Wood said at the press conference:", "In 2011, Ray learned that he had stomach cancer and wasn't sure how much longer he had to live. Shortly after, he confessed to me a series of detailed accounts of what he participated in, during his time as a police officer. At that time, Ray told me not to let him take this to his grave but to please wait until he passed away to come forward with this information. By 2012, his cancer had gone into remission, and he lived until Nov. 24, 2020.", "We confirmed Raymond Wood indeed served as a NYPD officer, working undercover to infiltrate Black civil rights groups in the 1960's, based on news archives at the time.", "Additionally, based on Reggie Wood's testimony and documentation displayed below, he claimed the former police officer wrote a letter shortly after receiving a cancer diagnosis in 2011 that detailed his experience on the police force.", "However, no verifiable evidence confirmed that Raymond Wood indeed authored and signed the document, like the cousin alleged.", "Per the cousin's recount of events, Raymond Wood lived another nine years, and the family kept the letter a secret throughout that time at his request. Then, after Raymond Wood's death in fall 2020, the cousin supposedly felt comfortable discussing the contents of the letter and embarked on a process of corroborating its allegations.", "Lizzette Salado — who partnered with Reggie Wood, the cousin, to write a book titled \"The Ray Wood Story: Confessions of a Black NYPD Cop in the Assassination of Malcolm X\" — said they uncovered multiple sources to validate Raymond Wood's account of working for NYPD in the 1960's, though she did not provide specifics of that research process for Snopes to independently verify.", "We obtained a digital copy of the letter, however. After reaching out to Crump's office, which is representing several high-profile cases alleging wrongful use of force by police against Black Americans, a spokesperson for the attorney emailed us the below-displayed record, titled \"confession doc.pdf,\" allegedly signed by Raymond Woods and dated Jan. 25, 2011.", "As you can see, a notary public did not certify the document, confirming the identity of the alleged signature holder, and no one served as a witness to its creation.", "https://www.scribd.com/document/495868609/Confession-Doc", "In other words, Snopes confirmed the existence of a letter allegedly written by Raymond Wood that his cousin framed as an authentic recording of his relative's experience working as an undercover NYPD officer between 1964 and 1971, including the day of Malcolm X's death.", "Without sharing specific names of former co-workers or supervisors, the letter claimed people in authority positions at NYPD coerced him into using his fake identity as a member of an unnamed Black civil rights group to coax two members of Malcolm X's security detail into committing crimes that resulted in their arrests.", "As a result, when Malcolm X attended the planned event at the Audubon Ballroom on Feb. 21, 1965, he did not have his usual entourage to protect him, under the pretenses outlined in the letter.", "\"It was my assignment to draw the two men into a felonious federal crime so that they could be arrested by the FBI and kept away from managing Malcolm X's door security on February 21, 1965,\" Wood supposedly wrote. \"At that time, I was not aware that Malcolm X was the target.\"", "In sum, it was true the cousin of a deceased man said he authored a letter before his death alleging a wide-ranging conspiracy by the FBI and police in the killing of Malcolm X, and the surviving relative revealed the document to the public in February 2021.", "However, less than one week after that announcement, the former police officer's daughter, Kelly Wood, told television news station NY1 she believed the letter was illegitimate and that Reggie Wood fabricated its contents for attention.", "“I know that my father did not write this letter,” Kelly Wood said. “I know that is not his signature, and I know the envelope they're using to somehow justify that the letter was mailed is also a fake.\"", "We reached out to the Manhattan District Attorney to discuss the letter alleging a conspiracy to cover up law enforcement's involvement in Malcolm X's death, as well as for information regarding its investigation into the convictions of Islam and Aziz.", "Danny Frost, a spokesperson, responded to our inquiry via email: \"Our office's review of this matter is active and ongoing.\"", "Additionally, we contacted NYPD with similar questions. Sgt. Edward Riley, a spokesperson for the department, responded to us via email:", "Several months ago, the Manhattan District Attorney initiated a review of the investigation and prosecution that resulted in two convictions for the murder of Malcom X. The NYPD has provided all available records relevant to that case to the District Attorney. The Department remains committed to assist with that review in any way.", "Snopes also contacted the FBI, seeking its response to the letter alleging an undercover operation by its agency and NYPD.", "A spokesperson directed us to a Feb. 22 statement by Assistant Director William F. Sweeney, Jr. in which he said the New York field office was aware of the letter, and that the agency was cooperating with the district attorney's office in its probe to supposedly determine who, exactly, was involved in the high-profile killing.", "\"Today’s FBI stands for the noble pursuit of justice, and we will continue to support the (Manhattan District Attorney's) review in any way we can,\" Sweeney said.", "In other words, no evidence (beyond the allegations at the press conference) indicated that NYPD leaders indeed forced Raymond Wood to coerce Malcolm X's security detail into getting arrested, as of this writing.", "Let us note here: While Crump's office responded to our request for documentation to confirm the existence of the letter, they did not address our questions to help determine why, or under what circumstances, the attorney's office agreed to help Reggie Wood publicly unveil the letter — or if, or to what extent, they were involved in the above-mentioned investigation by the Manhattan District Attorney. We will update this report when, or if, we receive those answers.", "In sum, considering the contents of the letter and the fact that Raymond Wood's daughter refuted its authenticity, as well as the fact that we did not uncover evidence to independently corroborate its allegations, we rate this claim \"unproven.\"", "This story was previously rated as true, but after considering the following factors, it has been changed to unproven: The contents of the letter, and Raymond Wood's daughter denying the authenticity of the letter.", "Jessica Lee is Snopes' Senior Assignments Editor with expertise in investigative storytelling, media literacy advocacy and digital audience engagement.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]