["About this rating", "In early October 2016, the web site TMZBreaking published an offensive article reporting that a United Airlines flight was forced to make an emergency landing due to one passenger's egregiously poor vaginal hygiene:", "United Airlines Flight 193 to D.C. had to make a an emergency landing after people were getting sick from passenger Larissa Jones smelly [vagina].", "Several passengers began to get sick from the smell and notified the captain and he decided to make an emergency landing in\nCharlotte, North Carolina. Hazmat crews came on the plane to spray it down with disinfectant.", "The plane landed in Charlotte and Larissa was taken to the local hospital to make sure she was still alive because she smelled like a dead corpse.", "The poor grammatical style and the absence of credible reporting of the same story in legitimate news outlets didn't dissuade a number of readers who (by design on the part of the site's creators) confused TMZBreaking with the well-known TMZ gossip site.", "TMZBreaking, TMZWorldNews, TMZUncut and a number of similar fake news outlets dupe readers into believing the content they've opened comes from the sometimes salacious but usually accurate TMZ site. All of these impostor sites have appropriated TMZ's name for that purpose, and none of them includes a disclaimer warning readers their content is fabricated.", "The image that accompanied this fictional story appears to be a stock photograph of an airplane interior from at least 2008, and the purported picture of \"Larissa Jones\" is an unrelated mugshot taken in 2013 or earlier.", "Prior fabrications from that cluster of fake TMZ sites include claims a cop shot a black baby after mistaking a pacifier for a gun, a penile implant could alert women to cheating husbands and boyfriends, a college student was left in a coma after participating in a social media semen-drinking challenge, KKK members committed suicide en masse following the release of the Harriet Tubman $20 bill, a non-existent study showed 80 percent of black men in Atlanta were gay, and police found a satanic dungeon under a Chuck E. Cheese.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]