["About this rating", "FEMA is hiring an unspecified number of \"Field Inspectors\".", "FEMA is not hiring anyone through an 888 area code; FEMA is not hiring people at $2,000 a week for a 90-day period; FEMA does not appear to be charging applicants for surge capacity jobs.", "On 25 August 2017, Hurricane Harvey made landfall in Texas, bringing extended heavy rainfall, flooding, and, of course, rumors and scams in its wake.", "One such rumor involved high-paying Federal Emergency Management Agency jobs (\"FEMA Field Inspectors\") purportedly created by the storm. Readers forwarded various versions of the rumor they spotted on social media, most mentioning a \"Mr. Adrian Davis\" recruiting a thousand workers for positions paying between $2,000 and $5,000 per week:", "FEMA is looking to hire help. $2000 per week plus expenses. 90 days or longer they need over 1000 people. Cannot have any felonies. 888 776 1296. Mr. Adrian Davis.\nTrue of False?\nI have not been able to verify this-the phone number goes from a fast busy to a regular busy.\nThank you", "There is a post going around Facebook seeking FEMA Field Inspectors. $4-5 K per week. No experience necessary. The ad contains an error: \"Will be reimburse travel\"\nThe phone number to call is 214-[redacted].\nAll sounds too good to be true and I don't see anything similar on the FEMA website or Facebook page.", "Can you please check out a rumor via Facebook that FEMA is paying people up to 5,000 dollars per week to work in Houston as field inspectors. They have to call 214.[redacted] to register.\nWhy wouldn't the FEMA hire people directly? Sounds like a HUGE scam to me!!", "The rumor spread quickly, thanks to its plausible premise of FEMA being understaffed in August 2017, the high (but not impossibly so) pay described, and the ease with which one could plausibly qualify. Although some iterations listed an area code of (888) and a contact name of \"Adrian Davis,\" others provided a 214 (Dallas-area) number which appears to have no affiliation with FEMA. A poster provided an application deadline of 31 August 2017:", "On 30 August 2017, the agency addressed the \"FEMA Field Inspectors\" rumor on its official Facebook page:", "FEMA linked to a Hurricane Harvey page, with an expandable section titled \"Rumor Control.\" That section revealed that the rumor was in fact mostly true:", "There is a lot of misinformation circulating online and because rumors spread fast please tell a friend, share this page, and help us provide accurate information. Check here often for an on-going list of rumors and their true or false status.", "Hiring", "Rumor: There are reports of a flyer titled FEMA Field Inspectors needed ASAP and states Earn $4-5K per week call (214) 284-6594 for instructions on how to apply between the hours of 9:00am – 11:00am up to August 31, 2017.", "This report is TRUE. (August 29).", "FEMA is hiring field inspectors under a pre-existing contract to assist with surge capacity of field inspections. Read more about becoming a home inspector.", "Rumor: There are reports stating FEMA is looking to employ 1,000 people offering to pay $2,000/week for 90 days and the phone number to call is 888-776-1296.", "This report is FALSE. (August 29)", "Learn more about official FEMA job opportunities to help with the response and review a list of trusted non-profit organizations who are active in disaster response.", "According to FEMA, these jobs are available under a pre-existing contract \"to assist with surge capacity,\" and the 214 number circulating is legitimate, as is the 31 August 2017 deadline. However, FEMA says the 888 number is not legitimate and the \"$2,000 a week for 90 days\" claim is inaccurate.", "We contacted the agency for further confirmation, but we have not yet received a response.", "FEMA.   \"Hurricane Harvey: Rumor Control.\"\r\n    Accessed 30 August 2017.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]