["About this rating", "Fans of former president Barack Obama -- or at least critics who like seeing current President Donald Trump get roasted online -- might have gotten their hopes up at what appeared to be a Twitter jab aimed at Trump by his predecessor. But the truth is, the tweet was manufactured.", "On 1 August 2018, an image began circulating online designed to look like it issued from Obama's Twitter account, with wording that read, \"What type of ID do we need to buy groceries I'm at the store and all I have on me is my birth certificate\":", "Actually, Barack Obama only posted two tweets that day — one of them listed the Democratic Party candidates he was endorsing in the 2018 midterm elections, and the other promoted those candidates:", "I'm confident that, together, they'll strengthen this country we love by restoring opportunity, repairing our alliances and standing in the world, and upholding our fundamental commitment to justice, fairness, responsibility, and the rule of law. But first, they need our votes.", "The fake tweet contained two barbs aimed at the current president. It made light of Trump's already widely-derided argument for voter identification cards offered during a 31 July 2018 speech, when the President said, \"If you go out and you want to buy groceries, you need a picture on a card, you need ID. You go out, you want to buy anything, you need ID, you need your picture.\"", "In reality, shoppers only need to produce identification when purchasing age-restricted items such as cigarettes or alcohol, or picking up prescriptions from grocery stores that include pharmacies. White House Press Secretary Sarah Huckabee Sanders said a day later that Trump was referring to alcohol purchases when he made the remark.", "The \"birth certificate\" reference in the fake Obama tweet was also a callback to Trump's longtime promotion of the \"birther\" conspiracy theory, which claimed that Obama was not born in the U.S. and consequently ineligible to be president.", "In 2011, Trump claimed credit for the fact that Obama released his long-form birth certificate. But unidentified advisers reportedly said in 2017 that even after being elected president, Trump \"used closed-door conversations to question the authenticity\" of his predecessor's birth certificate.", "Snider, Mike.   \"ID for Groceries? Trump Trolled on Twitter for His Shopping Comment at Florida Rally.\"\r\n    USA Today.   2 August 2018.", "Levy, Pema.   \"Sanders Defends Trump on Needing an ID to Buy Groceries.\"\r\n    Mother Jones.   1 August 2018.", "Scherer, Michael.   \"Birtherism Is Dead, But the Birther Industry Continues.\"\r\nnbsp;   TIME.   27 April 2011.", "Haberman, Maggie and Jonathan Martin.   \"Trump Once Said the 'Access Hollywood' Tape Was Real. Now He's Not Sure.\"\r\n    The New York Times.   28 November 2017.", "Arturo Garcia is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]