["About this rating", "Food and Drug Administration guidelines could be construed to suggest that sugary cereals are \"healthier\" than avocados, almonds, or salmon.", "The FDA never specifically compared avocados to Frosted Flakes or recommended one over the other.", "On 9 August 2016, the web site True Activist published an article suggesting that the influence of \"Big Food\" led the Food and Drug Administration to categorize Frosted Flakes over avocados as a \"healthy\" food:", "According To The FDA, Frosted Flakes Are “Healthier” Than Avocados", "The Food and Drug Administration is an organization whose motives and influences have long been questioned by American citizens. Many speculate that the organization has been bribed by Big Food companies who want a hold on what the FDA deems as healthy so that adults and children can be misguided about what to eat.", "Based on a rudimentary system of saying that any food that’s low in fat, sodium, and cholesterol, as well as full of some “beneficial nutrients,” many processed foods are healthier than wholesome produce in the eyes of the FDA.", "Alternative health sites Natural News and Complete Health & Happiness published versions of the same article, adding:", "According to the FDA's definition, avocados are not considered healthy because 1 ounce contains 4.5 grams of fat. It doesn't matter to them that it is the \"good\" type of fat. Likewise, almonds, with their 14 grams of fat per ounce, and salmon, with its 11 grams of fat per 3-ounce serving, are also considered unhealthy foods despite their well-documented health benefits.", "Pop Tarts, Spaghetti-Os and Frosted Flakes are better than salmon and almonds?", "On the other hand, some of the foods that make the cut according to their criteria are absolutely laughable. We've already discussed Frosted Flakes, which the agency deems healthy because it has 0 grams of fat per serving, is low in cholesterol and sodium, and has some \"beneficial ingredients.\" Somehow the fact that it has 10 grams of sugar per serving doesn't matter.", "Spaghetti-Os with calcium do not even remotely resemble anything found in nature, yet they are considered healthy because they only contain 1 gram of fat per serving. The highly artificial Low-fat Pop Tarts are also considered healthy because they are low in fat.", "All articles pointed to a May 2016 Wall Street Journal video that used sugary foods such as Frosted Flakes and Pop Tarts contrasted with salmon, nuts, and avocados to critique FDA guidelines:", "An article published in the paper was largely overlooked in repetitions of the \"Frosted Flakes versus avocado\" claim, but the piece provided context about possibly dated agency guidelines (issued during a time when fat was targeted as less healthy than sugar by nutrition experts) subject to ongoing overhauls:", "The FDA said in a statement to The Wall Street Journal that in light of evolving nutrition research and other forthcoming food-labeling rules, “we believe now is an opportune time to re-evaluate regulations concerning nutrient content claims, generally, including the term ‘healthy.’”", "The agency also noted a petition filed by Kind LLC. The maker of fruit-and-nut bars started campaigning for change after being sent a warning letter by the agency last year ordering it to stop using the term “healthy” on its packaging. The FDA rescinded that demand last month, though Kind made other tweaks to its labels based on the FDA’s missive.", "Food can only be marketed as healthy if it meets five criteria: fat, saturated fat, sodium, cholesterol and beneficial nutrients, such as vitamin C or Calcium. The levels differ by food category, but snacks generally can’t have more than 3 grams of fat.", "When the term “healthy” was first officially defined in 1994, low fat content was the main focus of health professionals. Sugar wasn’t on the FDA’s, or most nutritionists,’ radar.", "The comparison subsequently used by alternative health sites came from the Wall Street Journal video, not any explicit guidance from the FDA advising Americans to opt for Frosted Flakes over avocados. True Activist linked to the FDA's \"rudimentary system\" purportedly ranking processed foods over \"wholesome\" foodstuffs, but the page was about to labeling guidelines, and had no direct connection to sugary cereal or avocados:", "N49. What are the requirements to use the word “Healthy”?", "Answer: You may use the term “healthy” or related terms as an implied nutrient content claim on the label or in labeling of a food that is useful in creating a diet that is consistent with dietary recommendations if the food meets the conditions for total fat, saturated fat, cholesterol, and other nutrients (See table in Appendix B of this guidance). In addition, the food must comply with definitions and declaration requirements for any specific NCCs. 21 CFR 101.65(d)(2)", "The linked regulation involved \"implied nutrient content claims and related label statements,\" holding:", "You may use the term “healthy” or related terms (e.g., “health,” “healthful,” “healthfully,” “healthfulness,” “healthier,” “healthiest,” “healthily,” and “healthiness”) as an implied nutrient content claim on the label or in labeling of a food that is useful in creating a diet that is consistent with dietary recommendations if:", "(i) The food meets the following conditions for fat, saturated fat, cholesterol, and other nutrients:", "The regulatory standards cited in the table mandated:", "The food contains no added ingredient that is a fat or is generally understood by consumers to contain fat unless the listing of the ingredient in the ingredient statement is followed by an asterisk that refers to the statement below the list of ingredients, which states “adds a trivial amount of fat,” “adds a negligible amount of fat,” or “adds a dietarily insignificant amount of fat[.]”", "The food contains no ingredient that is generally understood by consumers to contain saturated fat unless the listing of the ingredient in the ingredient statement is followed by an asterisk that refers to the statement below the list of ingredients which states, “adds a trivial amount of saturated fat,” “adds a negligible amount of saturated fat,” or “adds a dietarily insignificant amount of saturated fat[.]\"", "FDA standards for food labeling can be extensive and confusing, and occasionally appear to arbitrarily rank foods based on singular attributes (fat content, for example) versus their comprehensive nutritional profile.  A direct comparison of low-fat sugary cereal and high-fat avocados was a popular example of those directives followed to the letter without further consideration of a varied diet. But the comparison between avocados and Frosted Flakes appeared in a Wall Street Journal video, not in a direct guideline issued by the FDA.", "FDA guidelines could be semantically construed to imply that sugary cereals are healthier than foods like almonds or avocados, but the agency made no such direct judgement (and it took significant twisting of the guidelines to wring such a conclusion out of them).  Further, the video accompanied an article about the FDA's stated goal of overhauling guidelines based on outdated nutrition standards.", "Gasparro, Annie.   \"FDA Seeks to Redefine ‘Healthy.’\"\r\n    Wall Street Journal.   10 May 2016.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]