["“President of Guinea beating up a Minister who stole covid funds!” reads a Facebook post sharing the video (archived here). It has been viewed 2.3 million times and shared more than 42,000 times since it was posted on September 16, 2020.", "Alongside the claim, a video shows two men in suits throwing punches and chasing each other around a parking lot, forcing bystanders to run for cover.", "The footage has been widely shared online in English and French. Some posts claim that the footage shows Conde attacking his chief of staff, while others say he is assaulting the Guinean labour minister.", "The posts emerged amid speculation that Conde will bid for a third term in October’s election. The 82-year-old president has been in power since 2010.", "It is not clear from the 19-second clip if the assailant is indeed Guinea’s president.", "Scrutinising the number plates visible in the footage, AFP’s correspondent in Guinea, Carol Valade, confirmed that the scene did not take place in the west African country.", "“The license plates here are red (for private owners), green (for government officials), black (for the army) or blue (temporary plates), and white and red (for public companies). But they are never completely white,” he said.", "He added that in Equatorial Guinea, official license plates are white.", "This is confirmed by blog Francoplaque, which stocks license plate photos from around the world. The white plates (embossed with two letters, then three digits and then a final letter) correspond to those found in Equatorial Guinea, a country around 2,000 kilometres away from Guinea.", "AFP’s correspondent in Equatorial Guinea, Samuel Obiang, said he recognised the scene as the nation’s capital, Malabo.", "“The footage was shot in the parking lot of the National University of Equatorial Guinea (NUEG), located in front of the Tropicana Hotel, whose roof is visible in the video,” he explained.", "A search on YouTube using keywords “Universidad Nacional de Guinea Ecuatorial” and  “UNGE” revealed a video posted in 2015 showing an unrelated student-led strike on the campus.", "Certain visual clues can be found in both videos: a lamp post (blue circle), a shed with a blue roof (red rectangle), a fence (yellow arrow) and street signs outside the premises (yellow rectangle).", "AFP Fact Check found a longer version of the misleading video shared on Facebook with a statue visible in the middle of the university’s courtyard.", "Local sources told AFP Fact Check that the video shows a student who attacked his professor in 2016.", "The man being chased in the video is “Filiberto Monayong, head of the Hispanic Philology and Information Sciences department at the National University of Equatorial Guinea, being attacked by a journalism student,” said Leopoldo Eneme, an alumni who now works as a journalist.", "According to the university’s website, a department by the same name existed during the 2015-2016 academic year.", "Mariano Nguma, a teacher at NUEG who provides extra academic support for students in need, and who also attended the institution, told AFP Fact Check the fight happened in March 2016.", "“The student failed his thesis twice and he blamed Mr. Monayong for his repeated failures,” said Nguma.", "“As the story made quite some noise, the provost convened both of them to understand what the problem was. The student made harsh comments towards the provost as well. In the meantime, the professor was outside,” he said.", "“When the student left the conference room and saw his professor in the university courtyard, he started hitting him.”", "Facebook and LinkedIn profiles under the name Filiberto Monayong include the job title of head of the communications department of NUEG. Monayong did not respond to AFP Fact Check’s request for comment.", "A further search on YouTube with this new information provided corroboration.", "The search revealed a longer video published in 2018, with a title that translates into English as: “They’re hitting Filberto Monayon professor at NUEG”.", "In the video, the assailant can be seen walking away, before striding back and attempting to punch the other man.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]