["Parents wait for news after a reports of a shooting at Marjory Stoneman Douglas High School in Parkland, Fla., on Wednesday, Feb. 14, 2018. (AP)", "Under the bill’s description of red-flag laws, a court could order the temporary confiscation of guns on an emergency basis if a person is judged a threat to himself or herself or others “in the near future” by possessing a gun.", "The person would not have a right to attend that hearing, but sworn testimony by law enforcement or members of the person’s family or household would be presented.", "A person whose guns are temporarily confiscated would have a right to be present at another court hearing to be held within 14 days.", "A bipartisan bill aimed at helping states curb gun violence is under attack from a national gun rights group claiming that it calls for confiscation of weapons \"based on unsubstantiated accusations\" and \"without due process.\"", "The attack on the bill and its lead sponsor, Sen. Marco Rubio, R-Fla., is made in an image shared on Facebook by the National Association for Gun Rights. The Colorado-based advocacy group has more than 4 million followers on Facebook.", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Rubio’s bill would give grants to states to adopt and implement what are known as extreme-risk protection-order laws, or \"red flag\" laws. Under the bill, a court could order the immediate confiscation of a person’s guns on an emergency basis if the person is judged to be a \"significant danger\" to himself or herself, or to others, \"in the near future.\"", "But the post and the information it links to are misleading. The bill, in fact, spells out a process that calls for sworn testimony and court hearings.", "The headline in the image in the Facebook post is: \"STOP ‘red flag’ gun confiscation.\" The rest of the post says:", "\"‘Red flag’ gun confiscation bills call for legally owned firearms to be forcibly confiscated from law-abiding Americans without due process, based on unsubstantiated accusations from disgruntled family members, neighbors, co-workers, and/or current or ex-romantic partners, or roommates. In other words: Gun confiscation without due process. Sign the petition to stop S.292!\"", "It links to a petition that claims the bill \"would use YOUR tax dollars to fund grants to bribe states into passing ‘Red Flag’ Gun Confiscation.\"", "The group and Rubio’s office did not reply to our request for additional comment.", "This is Rubio’s second time proposing a red flag bill.", "The first was a month after the Feb. 14, 2018, shooting at Marjory Stoneman Douglas High School in Parkland, Fla., in which a 19-year-old former student with a semi-automatic rifle killed 17 people and injured 14 more. News stories reported that there had been warning signs about the shooter, including calls about him to 911 and the FBI, threatening statements he allegedly made and the fact he had a gun.", "The original bill did not come up for a vote.", "Rubio introduced a new version on Feb. 8, 2021. S.292, the Extreme Risk Protection Order and Violence Prevention Act, is cosponsored by Sens. Rick Scott, R-Fla.; Jack Reed, D-R.I.; and Angus King, I-Maine. The bill was referred to the Senate Judiciary Committee, but no other action has been taken.", "Florida is among states that already have red flag laws; it took effect in March 2018.", "Due process broadly refers to the formal proceedings and rules that ensure that the law is administered fairly and reasonably.", "Under due process requirements of a criminal case, for example, a person must be given notice of the charges, be allowed to present evidence on their own behalf and receive a decision from a neutral decision maker.", "The due process requirements in a given case can vary, though, based on the circumstances or type of proceeding.", "To get an extreme-risk protection order under the Rubio bill, a law enforcement officer, family member or household member would have to petition a court with a sworn affidavit stating why the person \"poses a significant danger of causing personal injury to himself or herself or others\" by possessing a gun.", "The petitioner can be someone who has a child in common with the person, a current or former dating partner, or someone who lived with the person in the past year.", "An initial hearing would be held the same day or on the next business day to consider the evidence.", "The bill says a court could consider evidence such as:", "A threat or act of violence by the respondent in the past 12 months;", "Evidence of a serious mental illness;", "Past convictions for violent crimes;", "Threats or use of weapons against himself or herself or others;", "Recurring use or threat of use of physical force or stalking another person;", "Corroborated evidence of drug or alcohol abuse;", "Other relevant information from family or household members; or,", "Sworn witness testimony.", "If the court finds \"clear and convincing evidence\" of significant danger \"in the near future,\" it can order that the guns be temporarily confiscated.", "The person with the gun does not have a right to be present for the hearing, or even notified of it, said David Kopel, an adjunct law professor at the University of Denver and an adjunct scholar at the Cato Institute.", "However, the court must schedule another hearing within 14 days to determine whether the order should be extended, for up to 12 months. The respondent has the right to participate in that hearing.", "The National Association for Gun Rights stated that \"Rubio's 'red flag' gun confiscation bill\" calls for guns to be confiscated \"without due process, based on unsubstantiated accusations.\"", "The bill would provide grants to states to enact and implement red flag laws that would allow for courts to order the temporary confiscation of guns from people judged to be a danger to themselves or others because of their gun possession.", "In an emergency, based on clear and convincing evidence, a court can order the temporary confiscation of a gun without the person possessing the gun attending a court hearing.", "But the bill spells out due process requirements, including sworn testimony and evidence to be presented at the initial hearing, as well as another hearing that’s open to the respondent to determine if a confiscation order should be extended.", "The statement contains an element of truth but ignores critical facts that would give a different impression — our definition of Mostly False.", "Facebook post, March 1, 2021", "National Association for Gun Rights, petition, accessed March 2, 2021", "Sen. Marco Rubio, news release, Feb. 9, 2021", "Congress.gov, S.292, accessed March 3, 2021", "PolitiFact, \"How Florida’s red flag gun law works,\" Sept. 3, 2019", "PolitiFact, \"Do red flag laws allow gun seizure without a judge’s OK?\", Oct. 28, 2019", "Interview, David Kopel, adjunct law professor at the University of Denver and adjunct scholar at the Cato Institute, March 4, 2021", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]