["By Saranac Hale Spencer", "Posted on October 12, 2020", "A tweet, shared by President Donald Trump, mischaracterizes a video that purports to show “Americans being ARRESTED for holding outdoor church services.” The video actually shows a demonstration in Idaho against a public health order regarding COVID-19 requirements held by a church in a city hall parking lot.", "A church protest against a local public health order in Moscow, Idaho (population: 25,702), has gotten national attention since President Donald Trump retweeted a video from the event with a claim that falsely suggested it showed “Americans being ARRESTED for holding outdoor church services.”", "The president added his own comment to his retweet, saying, “DEMS WANT TO SHUT YOUR CHURCHES DOWN, PERMANENTLY. HOPE YOU SEE WHAT IS HAPPENING. VOTE NOW!”", "Neither the original claim nor the president’s comment is true.", "We’ll start with the video.", "Trump retweeted a post from Cliff Maloney, the president of a Texas-based libertarian group, that included a video of a man being handcuffed in a parking lot while a group sings in the background.", "Maloney wrote: “If you would have told me in 2019 that we were just 1 year away from Americans being ARRESTED for holding outdoor church services, I would have thought you to be insane. This is one of the most heartbreaking things I’ve ever seen. Pray for America.”", "But that misrepresents what the video actually shows.", "The event was not an outdoor church service. It was a demonstration against a local order requiring people to wear face masks or stay six feet apart in public to slow the spread of COVID-19.", "On Sept. 21, Moscow’s city council had voted unanimously to extend that order until Jan. 5. Latah County, where Moscow is located, is at “minimal risk” for COVID-19, according to the public health district in north central Idaho. But average daily cases in the county rose from about 3 at the beginning of September to about 23 at the beginning of October.", "Two days after the council vote, on Sept. 23, Christ Church in Moscow posted on its Facebook page an invitation to gather at city hall for a “flash psalm sing.” The invitation said, “We are asking folks to please not wear a mask.”", "Before the demonstration, city workers drew marks on the pavement that were six feet apart so that singers could safely participate.", "“The city had tried to provide an avenue for this event to take place,” Moscow Police Chief James Fry told FactCheck.org in a phone interview.", "Also, before the event began, officers told the organizer that police would enforce the public health order, he said, and the organizer repeated that warning to participants.", "“As soon as he said it, everybody actually moved closer together,” Fry said.", "Police issued tickets to five people for violating the city’s ordinance, Fry said, and they charged two of those people for resisting arrest when those people refused to identify themselves.", "Among those ticketed was Gabriel Rench, co-host of a political Christian podcast and a Republican candidate for a county office. Rench is the man being arrested in the viral video.", "Two days after the incident, Rench was a guest on Glenn Beck’s radio show, where he described the event as a “protest, as kind of a worshipful protest” to the public health order.", "Still, the falsehood that the video shows “Americans being ARRESTED for holding outdoor church services” continues to spread on social media.", "As for Trump’s claim that “DEMS WANT TO SHUT YOUR CHURCHES DOWN, PERMANENTLY,” that’s not true, either.", "The Democratic Party platform for 2020 includes a section on “supporting faith and service,” which says: “Religious freedom is a core American value and a core value of the Democratic Party. Democrats will protect the rights of each American for the free exercise of his or her own religion. It will be the policy of the Democratic Administration to advocate for religious freedom throughout the world.”", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here for more.", "Maloney, Cliff (@LibertyCliff). “If you would have told me in 2019 that we were just 1 year away from Americans being ARRESTED for holding outdoor church services, I would have thought you to be insane. This is one of the most heartbreaking things I’ve ever seen. Pray for America.” Twitter. 24 Sep 2020.", "Trump, Donald (@realDonaldTrump). “DEMS WANT TO SHUT YOUR CHURCHES DOWN, PERMANENTLY. HOPE YOU SEE WHAT IS HAPPENING. VOTE NOW!” Twitter. 7 Oct 2020.", "City of Moscow. AMENDED PUBLIC HEALTH EMERGENCY ORDER No. 20.03 FACE COVERINGS AND 6 FOOT SOCIAL/PHYSICAL DISTANCING. 1 Jul 2020.", "Public Health – Idaho North Central District. Monitoring and Tracking of Coronavirus. Accessed 9 Oct 2020.", "Fry, James. Moscow Police Chief. Telephone interview. 9 Oct 2020.", "City of Moscow. Press release. “Moscow, Idaho Arrests & Citations of September 23.” 24 Sep 2020.", "Democratic Party. 2020 Democratic Party Platform. 18 Aug 2020.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]