["The video was published in this Twitter post on October 10, 2019. It has been viewed more than 1.2 million times within six hours.", "The 22-second video purports to show the Trump International Hotel Las Vegas, which is owned by US President Donald Trump's Trump Organization.", "A banner hanging on the side of the building reads “BETRAYED AND MURDERED THE KURDISH PEOPLE. Greenpeace”. People chanting “not my president” and “Trump this shit” can also be heard in the background.", "The video's caption states: “Happening right now at the Trump Tower Hotel in Las Vegas. #KurdsBetrayedByTrump”.", "Below is a screenshot of the misleading tweet:", "The video was posted hours after Turkey launched ground offensive against Kurdish forces in Syria following a series of air strikes and artillery fire. Turkish President Recep Tayyip Erdoğan announced the operation three days after his US counterpart Donald Trump decided to withdraw US troops from northern Syria. Here is an AFP report about the developments.", "The video was also viewed thousands of times here and here on Facebook, here and here on Twitter, here and here on Instagram and here on YouTube alongside a similar claim.", "The claim is false; the video has been doctored to include the banner.", "AFP has previously debunked similar false claims about Greenpeace banners being unfurled at the same Trump hotel.", "Those misleading videos showed the same building with doctored banners that read “CONCENTRATION CAMPS” and “HAS A LITTLE MUSHROOM DICK”.", "Twitter user @paulleeticks told AFP via Twitter direct message on July 7, 2019, that he filmed the original video and edited it to include the banner.", "\"Yeah I edited it and shot the original vid,\" he told AFP.", "Below is a screenshot comparison of the video in the misleading post (L) and the other doctored videos (C and R):", "The banner in the video in the October 10, 2019, misleading posts has “Greenpeace” written at the bottom right corner.", "In an email to AFP on October 10, Greenpeace denied its involvement: “This was a computer generated animation and not executed by Greenpeace.”", "The environmental group, which previously said the similarly doctored videos included in the AFP fact-check report were “fake”, also tweeted the clarification on October 10.", "We want to make clear that this is a computer generated animation and not executed by Greenpeace.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]