["Posts shared thousands of times on Facebook and Twitter claim that Nigeria’s anti-hate speech bill was imported from Singapore. This is false; while Singapore has a law regulating speech and social media usage -- including incitement of hatred -- its language does not resemble Nigeria’s bill, nor does it prescribe the death penalty for offenders, as Nigeria’s draft bill originally did.", "In posts shared more than 5,000 times on Twitter and Facebook, Femi Fani-Kayode, a former Nigerian minister of aviation, claims that the bill was copied from Singapore.", "According to him, “removing the death penalty for so-called ‘hate speech’ is not enough. You must scrap the entire Bill, send it back to Singapore where it came from, get on your grubby and scabby knees and ask God and the Nigerian people for forgiveness for having the temerity to try to deprive them of their right to speak freely”.", "The anti-hate speech bill, popularly called the “hate speech bill” in Nigeria, was first presented by Senator Aliyu Sabi Abdullahi in March 2018 before it was set aside by the previous senate. Upon the constitution of a new senate after the 2019 election, the bill was reintroduced in November 2019 as the “National Commission for the Prohibition of Hate Speeches Bill, 2019 (SB. 154)”.", "The bill indeed prescribed the death penalty for hate speech with deadly consequences. AFP explains all you need to know about the bill here. Following heavy public backlash, Senator Abdullahi has since said the death penalty clause would be removed from the bill.", "Following this announcement, the former aviation minister Fani-Kayode asked the bill’s proponents to “send it back to Singapore,” where he claims it came from.", "At the same time that Senator Abdullahi was pushing the anti-hate speech bill, another lawmaker, Senator Muhammed Sani Musa, was proposing the “Protection from Internet Falsehood and Manipulation and other Related Offences bill”.", "As soon as the content of this bill became public, Nigerians began to criticise it, saying it was a “copy and paste” from Singapore’s anti-false news law.", "On May 8, 2019, the Singaporean parliament passed a 67-page bill titled “Protection From Online Falsehoods And Manipulation Act 2019” -- a similar title to the Nigerian one, which would surface about five months down the line. The Singaporean bill was signed into law by President Halimah Yacob on June 3, 2019.", "AFP analysed both documents and found striking resemblances. The Singaporean version is 67 pages long, and the Nigerian version only has 35 pages, but the bills share a similar language. The Nigerian version substituted “communication” for “transmission”. The screenshots below show a likeness.", "However, Nigeria’s anti-hate speech bill, which was also examined by AFP, is very different from Singapore’s legislation. Singapore does not have a stand-alone anti-hate speech law, but its anti-false news law includes a section on hate speech. The language of this law does not resemble that of Nigeria’s anti-hate speech bill, and it does not prescribe the death penalty.", "Singapore still has capital punishment, but the country prescribes it for murder, drug trafficking, possession of arms and kidnapping.", "Punishment for making false statements in Singapore ranges from fines to jail terms or both.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]