["The Indian government’s decision to revoke key provisions of Article 370 relating to the state of J&K continues to reverberate on social media in the form of misinformation and/or disinformation. Now, sections of social media users are spreading the claim that the Canadian government has “refused visas to Indian Army Generals and Brigadiers who served as intelligence officers for their part in Kashmir”.", "🇨🇦 Canada refuses visa for Indian Army Generals and Brigadiers who served as intelligence officers for their part in #Kashmir: thank you @JustinTrudeau for your brave stance pic.twitter.com/KaCwdsz7jy", "— Lord Nazir Ahmed (@nazir_lord) August 21, 2019", "As can be seen in the above tweet by Lord Nazir Ahmed, which has been retweeted over 5800 times, the basis for this claim is a video report by a news channel. Ahmed is a member of the House of Lords in the UK. This video is 2:20 minutes long. Alt News found a longer version of this video shared on Facebook by several users. The video and accompanying claim have been circulated widely in the Pakistani social media ecosystem.", "The same claim, that Indian army officers have been refused visas by the Canadian government for alleged atrocities in Kashmir, has been made in an article published by a website, Research Snipers.", "This information that the Canadian government has refused visas to senior Indian army personnel over their alleged role in Kashmir, is not recent and has nothing to do with the revocation of key provisions of Article 370 by the Indian government. A vital clue in this regard is the logo of the news channel seen in the video- Headlines Today.", "It may be noted that Headlines Today is the former name of India Today, the popular English TV news channel owned by the India Today group. The channel was renamed in 2015. This itself is proof that the video dates back to at least 2015 if not earlier. To find out more about the video, Alt News used specific keywords on YouTube, and found this video posted nine years back i.e. in 2010.", "Using the date and time filter on Google, Alt News then sifted through news reports of 2010, and found several articles relating to the diplomatic row which ensued when the Canadian government had refused to issue visas to several ex-servicemen and intelligence officials, citing human rights violations.", "It may be reiterated that the claim that Indian army personnel have been refused visas by the Canadian government, pertains to news of 2010 and is not related to the recent developments in J&K.", "Donate Now", "Arjun Sidharth is a writer with Alt News. He has previously worked in the television news industry, where he managed news bulletins and breaking news scenarios, apart from scripting numerous prime time television stories. He has also been actively involved with various freelance projects. Sidharth has studied economics, political science, international relations and journalism. He has a keen interest in books, movies, music, sports, politics, foreign policy, history and economics. His hobbies include reading, watching movies and indoor gaming.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]