["About this rating", "Law enforcement responded to threats of violence ahead of the inauguration of U.S. President-elect Joe Biden on Jan. 20, 2021, after the mob violence at the U.S. Capitol earlier that month. Amidst plans to deploy 15,000 troops from the National Guard in Washington, D.C., a rumor spread on the internet about the role being played by the U.S. Marines.", "According to an article in far-right media outlet, Real Raw News, Gen. David H. Berger, commandant of the U.S. Marines, “rebuked” U.S. House Speaker Nancy Pelosi when she “beseeched him to commit 5,000 troops to help ensure a peaceful transition of power,” and prevent a repeat of the mob attack on the Capitol Jan. 6. According to the article, he purportedly told her:", "Don’t lecture me on patriotism, Madam Speaker. I’ve served this country with distinction for 40 years. I’ve spilled blood for our nation. What have you, a self-serving elected official, done for your country? [...] I answer only to the president, and as I understand it, Donald J. Trump is still president and commander-in-chief. I abide in the Constitution as it was written, not your interpretation of it [...] If you want us to help combat his supporters, I suggest you get him on the phone and tell him that. If he orders me to, I will. Otherwise, I suggest you listen really hard to the words escaping your cracked, poisonous lips; they’re tantamount to treason. We don’t work for you.", "We reached out to the Marines press office, and its spokesperson, Capt. Joseph Butterfield, told us: “It is unequivocally inaccurate. The situation and conversation laid out in this article never took place and is entirely false.”", "In a memo sent to all members of the armed forces, the joint chiefs of staff, including Berger, reminded all military personnel of their duty to uphold the Constitution and reaffirmed that Biden will be inaugurated on Jan. 20. They denounced the attack on the Capitol, saying:", "We witnessed actions inside the Capitol building that were inconsistent with the rule of law. The rights of freedom of speech and assembly do not give anyone the right to resort to violence, sedition and insurrection. As Service Members, we must embody the values and ideals of the Nation. We support and defend the Constitution. Any act to disrupt the Constitutional process is not only against our traditions, values, and oath; it is against the law.", "They also said, \"As we have done throughout our history, the U.S. military will obey lawful orders from civilian leadership, support civil authorities to protect lives and property, ensure public safety in accordance with the law, and remain fully committed to protecting and defending the Constitution of the United States against all enemies, foreign and domestic.\"", "The Marines of Washington, D.C., have been preparing to march on the day of the inauguration. On Jan. 5, they uploaded a video showing their COVID-19 safety protocols and marching formations.", "Given that the events described by Real Raw News have been denied by the Marines’ office, and they appear to contradict statements released by Marines leadership, we rate this claim as “False.”", "Nur Nasreen Ibrahim is a reporter with experience working in television, international news coverage, fact checking, and creative writing.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]