["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "This election cycle, we’ve seen vulnerable Senate Democrats attacked by the billionaire Koch brothers in costly TV ad spots. It’s safe to say, though, that Democrats are fighting back.", "Take the Senate Majority PAC, an outside group formed in 2011 to support Democratic Senate candidates. They launched a statewide ad in Arkansas attacking Rep. Tom Cotton, R-Ark., who’s up against Democratic incumbent Mark Pryor come November.", "\"Corporate special interests are spending millions to smear Mark Pryor and elect Tom Cotton,\" the narrator said. \"Why? Before Congress, Cotton got paid handsomely working for insurance companies and corporate interests.\"", "PolitiFact wanted to know if Cotton really worked for insurance companies before taking office in 2013. Cotton’s campaign didn’t respond to our requests for comment.", "What most people know about Cotton’s work experience is the years he spent serving in Afghanistan and Iraq from 2005 to 2009. That experience has come under fire from Pryor, who accused his opponent of having a \"sense of entitlement\" about his decorated military past.", "Shortly after Cotton’s honorable discharge from the military, he worked at a global consulting firm called McKinsey & Company. The firm employs 17,000 people across 60 countries. Democrats like Chelsea Clinton and Susan Rice have also worked there.", "The Senate Majority PAC pointed us to Cotton’s Facebook biography, which says, \"As a businessman, Tom has advised some of America’s most respected companies on business strategy, operations, finance, and marketing. His industry experience includes agribusiness, health care, oil and gas, food processing, insurance, and aerospace.\"", "That’s not work directly for an insurance company. And Glenn Kessler, our Washington Post fact-checking colleague, noted that Cotton has never even worked for an insurance company in a consulting role. Cotton worked on an assignment with the Federal Housing Authority to improve insurance offered to lenders who finance apartment buildings in the government’s multifamily housing programs, according to a statement from his former boss.", "So Cotton didn’t work for an insurance company. But did he get paid handsomely? That’s a subjective judgment we won’t weigh in on. But we can see from his financial disclosure statement that Cotton earned $85,000 from McKinsey in 2011. For comparison, he makes $174,000 per year in Congress.", "Our ruling", "The Senate Majority PAC ad claimed, \"Before Congress, Cotton got paid handsomely working for insurance companies and corporate interests.\" Cotton’s never worked for an insurance company, nor has he served as a consultant for one. We rate the statement False.", "ABC, \"Sen. Pryor hit for saying foe -- a decorated vet -- has ‘sense of entitlement,’ \" March 5, 2014", "Congressional Research Service, \"Congressional salaries and allowances,\" Jan. 7, 2014", "Daily Caller, \"Dems attack Tom Cotton’s bio. But is it true?\" March 27, 2014", "Email interview with Sarah Mulligan, McKinsey & Company spokeswoman, April 8, 2014", "Email interview with Ty Matsdorf, Senate Majority PAC spokesman, April 8, 2014", "Facebook, Tom Cotton’s biography, accessed April 8, 2014", "OpenSecrets, Tom Cotton’s financial disclosure statement, July 29, 2011", "Politico, \"For Tom Cotton, army was good training,\" Jan. 17, 2013", "Politico, \"Senate Majority PAC up in Arkansas, Michigan,\" March 28, 2014", "Senate Majority PAC, \"Connect the dots,\" April 2, 2014", "Tom Cotton, \"Washington Post, other news outlets call anti-Cotton ad claims ‘as phony as a three-dollar bill,\" April 1, 2014", "Washington Post, \"A Democratic attack ad tries to connect the dots, and earns 4 Pinocchios,\" April 1, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]