["About this rating", "An old story about Edith Piaf got a new lease of life in October 2017, when a web site devoted to \"positive and meaningful content\" produced a short video recounting the iconic French singer's purported heroism during World War Two.", "On 17 October, Fabiosa Australia posted an animated video to its Facebook page, telling the following story:", "In 1944, Edith Piaf was invited to speak before captured French prisoners in a German concentration camp. At first, she didn't want to do it. But then she agreed. After the speech, she asked that a photo be taken as a memento of her with the prisoners of war. When she arrived back home, she enlarged the photograph. She cut out all 120 faces from the photo and ordered 120 fake passports.", "When she returned to perform a concert at the same camp, she brought the passports in a suitcase with a double bottom. While signing autographs, she gave the passports to the prisoners. All 120 prisoners managed to escape and be saved.", "Neither the video nor the accompanying Facebook post provides any source, but this is an old tale that has been modified and embellished over the decades. According to one source, Piaf saved \"thousands\" of Jews (not 120) from the Nazi camps, and in another iteration it was the prisoners themselves who made their own fake IDs.", "According to Carolyn Burke's 2011 biography of Piaf, she used a seven-week tour of prisoner-of-war camps in Germany as a way to help carry out a mission for her secretary Andrée \"Dédée\" Bigard, who was part of the anti-Nazi Resistance movement:", "The newspapers documented the tour with photos of Edith sharing conditions at the stalags [prisoner-of-war camps]...but there was no record of her many photographs with the prisoners, taken as souvenirs of her visit.", "Shortly after her return home from Germany, according to Burke, Piaf was \"already planning her next trip there\":", "Dédée's Resistance group was preparing false identity cards made with the enlarged faces from her souvenir photos; Edith was to distribute them, along with supplies to help the prisoners escape...", "Accompanied by her orchestra, a humorist, a dancer and an actor named Robert Dalban, Edith and Dédée left for Berlin in February [1944] with the fake identity cards concealed in their suitcases.", "According to later interviews given by Bigard, Piaf visited 11 stalags on that trip to Germany and— in Burke's words — distributed \"identity cards, maps and compasses. Sometimes the escaped prisoners caught up with her tour and were passed off as musicians.\" The mission was ended when officials at one of the camps became suspicious.", "In French journalist Robert Belleret's biography Piaf, un Mythe Français, Andrée Bigard is quoted as saying that the singer had been part of a \"Resistance network\":", "A mission was entrusted to me, which consisted of helping French prisoners who were working in the camps to escape from Germany. Fake identity cards were made and slipped into cans of food along with a map of the area and a tiny compass.", "On the day, we went to a certain spot, found our escapees and returned to France with a few more musicians than when we had set out. We made several journeys like this, but the German authorities ended up getting suspicious because the prisoners kept going missing after Mademoiselle Piaf's visits.", "After the liberation of France by the Allies, and the end of World War Two, France underwent what was known as the \"Épuration Sauvage\" (the \"Wild Purge\") — essentially a period of informal and often brutal revenge against those who had aided the Nazis in their annexation of France.", "According to the political scientist Michael Curtis, between 9,000 and 10,000 suspected collaborationists were killed. After this, official tribunals were set up and a period known as the \"Épuration Legale\" (the \"Legal Purge\") ensued. Tens of thousands of people were jailed, 6,763 were sentenced to death, and 768 of these were executed.", "Edith Piaf was believed by some to have been a collaborator, due to her tours of prisoner-of-war camps and participation in Nazi propaganda efforts, and she was called to testify before a tribunal with a focus on French artists.", "According to Carolyn Burke, the tribunal had included her name in a list of musicians whose voice was to be banned from French radio, something that would have been a significant blow to her career. However, she testified that her first trip to Germany was made under coercion, and the second one was undertaken for the true purpose of giving prisoners money and helping them escape.", "Andrée Bigard backed up Piaf's account, and the singer was cleared. Shortly after her testimony in October 1944, she gave an interview to the Ce Soir newspaper, in which she provided the now famous number of 118 soldiers having been saved by her actions, and remarked:", "I tried to navigate the pitfalls of Nazi propaganda, while also maintaining the trust of the French public.", "However, Robert Belleret casts doubt on this version of events, pointing out implausibilities and inconsistencies in the account  and suggesting that the story might have been concocted so as to justify Piaf's visits to Germany (which were intended and used by the Nazis as propaganda in Vichy France), and to save herself from the wrath of the tribunals:", "...Such an operation, worthy of a novel or a scene from the Great Escape... would require a certain audacity and activist commitment to which the singer was not accustomed. Besides, in referring to \"several trips,\" [Andrée Bigard] suggests that Piaf made frequent return journeys to Germany, which does not correspond to the truth.", "Above all, this glorious claim clashes with a piece of factual evidence: when Piaf made her first trip to Germany, she definitely didn't imagine she would be making a second. So for what reason, then, were those photoshoots set up?", "Finally, if these acts of resistance were proven, it's hard to see why they wouldn't have been revealed by one of the prisoners who escaped thanks to her. \"I owe my freedom to Edith Piaf\" - you can only imagine the headlines....", "But, despite Piaf's claim in a newspaper [Ce Soir] about 118 successful escapes thanks to \"her\" fake identity cards, not a single testimony from an escapee corroborating these statements has ever appeared in public. Robert Dalban, an actor and firsthand witness to the tour [of Germany] has never mentioned any such mission.", "Belleret lists some of the purported details of Piaf's efforts to help Jewish people (sending them money and housing them) during the Nazi occupation, but notes that these names and numbers were provided by Piaf herself and her loyal secretary Andrée Bigard, and that they could not be verified.", "Carolyn Burke's biography, which casts a less skeptical and more positive light on Edith Piaf, also does not contain corroborating evidence (that is, evidence provided by someone other than Piaf or Bigard). It is possible that such evidence exists, or once existed but has been lost, or that the individuals who could prove that Edith Piaf helped them escape are no longer alive. But without such testimony, establishing the veracity of this famous old story remains elusive.", "Burke, Carolyn.   No Regrets: The Life of Edith Piaf.\r\n    Knopf, 2011.   ISBN 0-307-26801-2.", "Belleret, Robert.   \"Piaf, Un Mythe Français.\"\r\n     Fayard.   28 August 2013.", "Curtis, Michael.   Verdict on Vichy: Power and Prejudice in the Vichy France Regime\"\r\n    Arcade Publishing, 2003.   ISB 1-559-70689-9.", "Yves-Bonnat.   \"Les 118 Évadés d'Édith Piaf.\"\r\n    Ce Soir (via Gallica).   21 October 1944", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]