["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "State Republican Chairman Edward F. Cox claimed New York state has the highest debt per capita. (Courtesy: New York State Republican Committee Facebook Page)", "State Republican Chairman Edward F. Cox says New York state’s debt per person is higher than any other state.", "\"We have the highest debt per capita,\" Cox said at a debate among three Republican candidates for governor.", "The claim comes among a string of criticisms from state Republicans against the economic record of Gov. Andrew M. Cuomo.", "Cox recently claimed that unemployment was up in every county in the state outside New York City. We rated that claim Mostly True. State Sen. John DeFrancisco, a GOP candidate for governor, claimed that one-third of New York state’s population is on Medicaid. That’s True.", "But there’s also evidence the state’s economy has improved since Cuomo took office. The state has more private sector jobs than ever before, and unemployment has dropped statewide.", "So what about the debt? It is one of the few economic indicators for the state we haven’t looked at. Is Cox’s claim correct?", "Government debt per capita", "A spokesperson for Cox said he was talking about debt incurred by state and local governments, not personal debt like credit cards or auto loans.", "New York state ranked highest in government debt for residents in 2015, the latest data available.", "The debt per person was $17,528 in New York state, according to the Empire Center. The center is a non-partisan, non-profit think tank based in Albany that calls for policy reforms based on free-market principles, personal responsibility and effective and accountable government. It used data from the U.S. Census Bureau and Bureau of Economic Analysis to calculate the rate for each state.", "The next highest state was Massachusetts, with government debt at $13,733 per person. Wyoming had the lowest rate, with $3,376 of government debt per person.", "New York state has ranked highest each year since Cuomo took office in 2011. Government debt was $17,204 per capita in New York state that year, according to data from the Tax Foundation, a right-leaning tax policy and finance analysis organization.", "Our ruling", "Cox said \"We have the highest debt per capita.\"", "The latest data proves Cox’s claim. New York state has had the highest state and local government debt per capita since at least 2011.", "We rate it True.", "\"Republican gubernatorial hopefuls debate in Amherst,\" WBFO, Feb. 10, 2018", "Email conversation with Jessica Proud, spokesperson for Edward Cox", "Email conversation with Ken Girardin, Policy Analyst at the Empire Center", "State and Local Debt Per Capita, FY 2015, The Empire Center", "Email conversation with John Buhl, Media Relations Manager at the Tax Foundation", "State and Local Debt Per Capita: FY 2011, FY 2012, FY 2013, FY 2014, The Tax Foundation", "PolitiFact New York: Unemployment inching up in almost every county outside New York City, Jan. 17, 2018", "PolitiFact New York: One in three people in New York is on Medicaid, July 21, 2017", "PolitiFact New York: New York has more private sector jobs than ever before, July 22, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]