["About this rating", "The premise that a free press is essential to maintaining a free and democratic society is enshrined in the First Amendment to the United States Constitution, which states that \"Congress shall make no law respecting an establishment of religion, or prohibiting the free exercise thereof; or abridging the freedom of speech, or of the press; or the right of the people peaceably to assemble, and to petition the government for a redress of grievances.\"", "Even so, a strained and even combative relationship has long existed between the mainstream press and the U.S. government, and particularly with those persons who have held the office of the presidency throughout the nation's history and have seen their agendas unrelentingly scrutinized, criticized, and even ridiculed by the press", "Some presidents have had more tendentious dealings with the press than others. Richard Nixon (who included members of the press on his infamous \"enemies list\") comes to mind, as does Lyndon Johnson, who reportedly once said, \"If one morning I walked on top of the water across the Potomac River, the headline that afternoon would read: 'President Can't Swim.'\"", "But no chief executive in modern times has feuded with the press more than President Donald Trump, who has excoriated the mainstream media for feeding the public what he calls \"fake news\" and labeled journalists \"enemies of the people.\"", "That timing couldn't be better for the circulation of a quote attributed to Founding Father Thomas Jefferson, who supposedly warned two centuries ago that \"When the speech condemns a free press, you are hearing the words of a tyrant.\"", "To be sure, in his public utterances Jefferson showed himself to be an inveterate defender of the freedom of the press (private complaints about instances of the \"misinformation\" published in certain newspapers notwithstanding). \"Our liberty cannot be guarded but by the freedom of the press, nor that be limited without danger of losing it,\" he said to the United States' first chief justice, John Jay, in 1786. He also later wrote that:", "No experiment can be more interesting than that we are now trying, and which we trust will end in establishing the fact, that man may be governed by reason and truth. Our first object should therefore be, to leave open to him all the avenues to truth. The most effectual hitherto found, is the freedom of the press.", "Despite Jefferson's strongly held views, we have not found a reliable source for the statement attributed to him that links the condemnation of a free press to \"the words of a tyrant.\" In fact, we found the opposite: the Thomas Jefferson Encyclopedia (maintained by the Thomas Jefferson Foundation) states that no such passage exists in Jefferson's writings.", "Indeed, we searched for any and all instances of the quote published prior to February 2017, the date of its earliest known appearance on the Internet, and found none (nor did we find it attributed to anyone other than Jefferson).", "Although it isn't an unreasonable stretch to suppose that Thomas Jefferson might have agreed with the statement had he encountered it, we conclude that it's a fabrication of very recent origin.", "Jefferson, Thomas.   The Jefferson Cyclopedia.\r\n    New York: Funk & Wagnalls, 1900.", "Post, David.   \"Trump, The Press, The First Amendment, and Thomas Jefferson.\"\r\n    The Washington Post.   1 March 2017.", "Library of Congress.   \"Thomas Jefferson to John Norvell, June 11, 1807.\"\r\n    Accessed 7 August 2018.", "MPR News.   \"President and Press: The Roots of a Feisty, Complex Relationship.\"\r\n    17 January 2017.", "The Thomas Jefferson Encyclopedia.  \"When the Speech Condemns a Free Press ... (Spurious Quotation).\"\r\n    Accessed 7 August 2018.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]