["Did over 6 lakh votes polled in favour of Congress president Rahul Gandhi in Wayanad disappear from the records? This is a claim which has been made on social media, on the basis of a screenshot of the website of the Election Commission of India.", "@RahulGandhi yesterday afternoon your votes were approx 13 lakh now it’s showing 7 lakh, where the hell 6 lakh votes went? pic.twitter.com/yrW8AvL8hM", "— Md Akram (@Sk_md_akram) May 24, 2019", "The screenshot shows that Rahul Gandhi has secured 1276945 votes. A zoomed in version of the same is posted below. Gandhi won the Wayanad Lok Sabha constituency by a record margin, but lost his traditional borough of Amethi to Smriti Irani.", "However, when the final result was declared, it was found that Rahul Gandhi had actually polled 706367 votes.", "According to another screenshot, Rahul Gandhi had polled over 13 lakh votes, which ‘reduced’ to a little over 7 lakh subsequently.", "The above screenshot was used in a ‘video report’ on a YouTube channel, which casts aspersions on the poll process on the basis of these numbers. The video has been viewed over 1.5 million times since it was posted on May 23.", "So, did these ‘additional’ votes simply vanish from the records of the Election Commission? Has there been foul play, as alleged by users who shared their own screenshots on social media platforms?", "The figure of over 13 lakh votes polled in favour of Rahul Gandhi is false. This is because the total number of votes polled in the constituency was 10,89,819, according to a report of The Hindu published on April 24.", "Thus, it is not possible for 13 lakh votes to have been cast in favour of the Congress president. Moreover, it may be noted that in the 2014 Lok Sabha election, a total of 915,138 votes were cast in the Wayanad constituency. This information is available on the website of the Chief Electoral Officer, Kerala. The numbers this time (10,89,819) vis-a-vis 2014, are consistent and proportionate with the increase in population. Moreover, it may be noted that the voter turnout this time was 74.14%, which is higher than the turnout in the 2014 Parliamentary polls (73.26%).", "The claims floating on social media are the outcome of an error on the website of the ECI, which was later rectified. It may be reiterated that according to the final numbers, Rahul Gandhi got 706367 votes, securing 64.67% of votes polled in his constituency.", "Donate Now", "Arjun Sidharth is a writer with Alt News. He has previously worked in the television news industry, where he managed news bulletins and breaking news scenarios, apart from scripting numerous prime time television stories. He has also been actively involved with various freelance projects. Sidharth has studied economics, political science, international relations and journalism. He has a keen interest in books, movies, music, sports, politics, foreign policy, history and economics. His hobbies include reading, watching movies and indoor gaming.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]