["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "The junior Republican senator from Texas celebrated American ingenuity in a spring commencement address.", "On May 11, 2013, Ted Cruz told the Hillsdale College (Mich.) Class of 2013 that the American dollar is the world’s international reserve currency and English is the planet’s language of commerce. Also, Cruz said, most movies are made in the U.S., where the telephone, automobile and airplane also were invented.", "\"Americans were the first to walk on the moon,\" Cruz continued. \"We invented ‘Pong,’ ‘Space Invaders’ and the iPhone.\"", "Wait; Americans invented the iPhone plus \"Pong\" and \"Space Invaders,\" the dominant (trust us, dominant) 1970s-era arcade games?", "Let's recap iPhone-age, then check on those games.", "Apple rolled out the iPhone in 2007 with its invention credited to Steve Jobs, though it also was clear that the spinoff from the popular iPod MP3 player built on multiple creations.", "Journalist Mary Bellis has written that more than 200 patents were part of the design of the iPhone, \"so pinpointing one inventor would be unfair.\" Still, her undated online post credits Apple employee John Casey with conceiving an iPhone-type device in 2000 by emailing colleagues about combining a phone and iPod. Jobs directed the teams that hatched the iPhone, she wrote, while Apple's British-born head of design, Jonathan Ive, is \"heavily credited with the aesthetic design and look of the iPhone.\"", "In an Oct. 22, 2010, news article, PC Magazine said Jobs and his team \"clearly reinvented the smartphone with the iPhone, which then gave him a platform for creating mobile apps and new forms of mobile commerce.\" Similarly, the California-based Computer History Museum notes in its Jobs’ biography, which appeared Dec. 2, 2011 (about two months after Jobs’ death), that when Jobs unveiled the iPhone, he \"described it as nothing less than the reinvention of the telephone: a combination ‘widescreen iPod with touch controls,’ a ‘revolutionary mobile phone,’ and a ‘breakthrough Internet communicator.’\"", "Most recently, Slate magazine, citing newly revealed documents, said in a Sept. 10, 2012, news article that Apple \"reinvented\" the smartphone with the iPhone, which was honed by Apple employees only; the story quotes a company executive testifying that Jobs \"didn’t let the iPhone team recruit anyone from outside the company to work on the device.\"", "And the arcade games?", "\"Pong\" was mass-produced by an American company, Atari, according to web posts and news stories, and individuals credited with developing the game appear to have American roots.", "The Associated Press summed up \"Pong\" this way in an April 19, 2013, news article: \"The black-and-white arcade game introduced in 1972 had no complicated graphics, just geometric shapes. Players controlled digital paddles and tried to hit the ball so their opponents could not return it.\"", "Accounts agree that Nolan Bushnell, a 1968 electrical engineering graduate of the University of Utah, steered the game’s creation after founding Atari with another engineer, Ted Dabney, in 1972. Bushnell had seen a Magnavox Odyssey version of ping-pong that spring and sought an easier-to-play version, enlisting Atari engineer Al Alcorn to perfect it.", "Bushnell, who grew up in Utah, and Alcorn, born in San Francisco, according to news stories, both appear to be Americans.", "Next, we looked into who invented \"Space Invaders,\" in which a player fires at space aliens steadily advancing from the top of the game screen; try it here, though keep in mind we’re not responsible for associated time sucks.", "Accounts credit a resident of Japan, not an American, with inventing the game.", "An Aug. 20, 2003, feature story in the Derby Evening Telegraph, a British newspaper, said a Japanese computer programmer \"wrote the game for Taito in Japan in 1978.\" The story said the game heralded the introduction of arcade machines in restaurants and other places before Atari bought the rights to the game in 1980 and \"launched it on hundreds of thousands of black boxes plugged into TVs across the Western world.\"", "The Tokyo-based Taito Corp., which says in a company timeline that it released the game in 1978, told us by email that Tomohiro Nishikado was the inventor.", "In a 2008 interview from his Yokohama home, Nishikado told an Australian newspaper that Taito sales people initially resisted the game, saying it was too hard to play. Nishikado also recalled concern that people would not play a game where the enemy shot back at them. \"It was never seen before,\" Nishikado said.", "Nishikado told the West Australian newspaper he was inspired to create the game by a magazine story previewing the Star Wars movie. \"Instantly I felt that something that takes place in outer space would be popular,\" Nishikado said.", "We alerted Cruz’s office to the Japanese engineer widely described as the Father of \"Space Invaders.\" Cruz spokesman Sean Rushton replied by referring to the senator’s childhood, saying by email: \"Perhaps he was mistaken about ‘Space Invaders’ origins, but to an eight-year-old playing the game it certainly seemed American.\"", "Our ruling", "Cruz said \"Pong,\" \"Space Invaders\" and the iPhone were invented by Americans. This appears so for \"Pong\" and the iPhone. But a Japanese programmer is credited with developing \"Space Invaders.\" We rate this partly accurate claim as Half True.", "UPDATE, 3 p.m. June 6, 2013: This story was updated shortly after its publication to provide more information on the iPhone's development. The paragraphs drawing on Mary Bellis and an article in Slate were added. These changes did not affect the rating.", "News article, \"What's Next for Steve Jobs and Apple?,\" PC magazine, Oct. 22, 2010", "Biographical entry, \"Steve Jobs: From Garage to World’s Most Valuable Company,\" Computer History Museum, Mountain View, California, Dec. 2, 2011", "News article, \"It Smelled Something Like Pizza,\" Slate, Sept. 10, 2012", "News article, \"Who Invented The iPhone?,\" Mary Bellis, About.com (undated)", "Feature story, \"The Impresario Four decades after Atari, University of Utah alum Nolan Bushnell is ever an entrepreneur,\" the Continuum, University of Utah, spring 2013", "Transcript, \"Oral History of Allan (Al) Alcorn, Interviewed by Henry Lowood,\" Computer History Museum, recorded April 26, 2008 and May 23, 2008, Mountain View, California (accessed June 5, 2013)", "News story, \"Atari game creator Al Alcorn talks about creating Pong and modern game industry,\" GamesBeat, Jan. 12, 2011", "News article, \"They Came From Outer Space And Changed The World,\" Derby Evening Telegraph, Aug. 20, 2003 (Nexis search)", "News story, \"Arcadian invasion,\" West magazine, The (Perth) West Australian, April 12, 2008 (Nexis search)", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]