["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "There’s no evidence Bill O’Reilly wrote a lengthy essay that pushes a debunked conspiracy theory about the origins of the coronavirus.", "Facebook users are sharing a lengthy post that makes several dubious claims about the coronavirus. Most notably, it pushes the widely debunked theory that the virus was created as a bioweapon in a Chinese lab.", "The post also claims the 1,338-word essay — which ends \"Wake Up America! WAKE UP!\" — was written by former Fox News host and political commentator Bill O’Reilly.", "A portion of the essay reads:", "\"The communist regime has millions of its own citizens slaving in gulags simply for speaking against the government or openly practicing Christianity. Knowing they could not attack us openly they needed to be coy, like a deceptive fox. In my opinion, I believe the regime released a biological weapon upon the world that doesn’t kill everyone, but kills \"enough,\" especially the elderly and in-firmed.\"", "RELATED: What we know about the source of the coronavirus pandemic", "There is no evidence the virus was created in a Chinese lab, or that O’Reilly wrote this.", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "We couldn’t find any version of the statement on Bill O’Reilly’s social media accounts. No news organizations have reported that he authored such a post.", "It’s not on O’Reilly’s website, where he consistently posts his columns, podcasts and latest media appearances.", "O’Reilly’s website staff confirmed that he didn’t write the message.", "Meanwhile, fact-checking organization Snopes found that the true author of the screed appears to be a man named Tim Besmer, who posted the same text to his Facebook page on April 2, along with a copyright notice on the bottom with his name and the words \"Permission given for public sharing.\"", "At some point along the way, O’Reilly’s name was added to the essay and Besmer’s disappeared.", "This is a misattributed, unproven conspiracy theory of its own. Pants on Fire!", "Facebook post, April 11, 2020", "International Fact Checking Network, The CoronaVirusFacts/DatosCoronaVirus Alliance Database, Accessed April 22, 2020", "PolitiFact, Fact-checking hoaxes and conspiracies about the coronavirus, Jan. 24, 2020", "Bill O’Reilly.com, Accessed April 22, 2020", "Bill O’Reilly Facebook, Twitter, Accessed April 22, 2020", "Snopes, Did Bill O’Reilly Write an Essay Calling COVID-19 a Chinese Bioweapon?, April 13, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]