["About this rating", "On Jan. 28, 2021, skygazers can expect to see the first full moon of the decade as the so-called full “wolf moon” will appear in the sky alongside Mars and Mercury — at least in some parts of the world.", "January’s full moon will reach its peak illumination at 2:16 p.m. EST on the 28th, according to NASA. But those hoping to catch a glimpse of the “wolf moon” won’t be able to sneak a peek until it rises above the horizon around sunset time, which will be shortly after 5:30 p.m. EST, according to Time and Date.", "Each month’s full moon has its own unique name that typically reflects the time of year it can be viewed. Take June’s “strawberry moon,” for example, so named for the month when strawberries typically ripen. Similarly, the “harvest moons” of the fall get their namesakes for a month where the fall typically comes into full swing and farmers can expect to harvest the last of their crops. And the Almanac notes that each month has its own special name when the full moon comes around. Here are a few of the most common:", "According to The Old Farmer’s Almanac, the “wolf” title holds roots in Native American, Colonial American and European history — and not because wolves howl at the moon. These wild canines are thought to howl more during the winter months, and in January in particular. Wolves howl to define their territory or find their pack, as well as to form familial bonds and coordinate hunting. And in the winter months, wolves tend to be more territorial and defensive as tensions rise to find a mate and resources become more limited ahead of the spring season, according to the National Park Service.", "The “wolf moon\" typically represents the first full moon of winter, a season that officially begins on the Dec. 21 solstice. But the 2020-21 winter season saw its first full moon on Dec. 29, 2020, when the \"cold moon\" rose in the night skies.", "Madison Dapcevich is a freelance contributor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]