["Republican National Committee chairman Reince Priebus is confident the Cleveland RNC will be a success, even without a Bush in attendance.", "Former Florida Gov. Jeb Bush and former presidents George W. and George H.W. Bush all declined to participate or attend the 2016 nominating convention. Meet the Press host Chuck Todd offered the decision of the Bush family to spurn the 2016 convention as evidence that this year’s event will be a little different.", "\"You’re not showcasing the best parts of your party,\" Todd said to Priebus, adding \"it is unusual not to have a Bush at the convention.\"", "Priebus responded: \"It didn’t happen four years ago\" at the 2012 RNC in Tampa. Priebus added after some back-and-forth that that \"there was no President Bush\" at the RNC in 2008.", "Claims about the pre-eminence of the Bush family in Republican politics have come up before. We previously rated True a claim that Republicans haven’t won an election without a Bush or Nixon since 1928.", "In this case we wondered if Priebus was right that the Bush family eschewed the RNC in some form in 2012 and 2008.", "He wasn’t.", "The 2012 convention", "It’s been nearly eight years since a Bush has held national elected office, but the family has maintained a role at the nominating convention. Since 1980, every Republican convention has seen a Bush speak — often as the vice presidential or presidential nominee.", "That includes the 2012 convention in Tampa, which saw the nomination of Mitt Romney.", "Jeb Bush addressed delegates at the convention, as this video confirms. He touted his love for his brother, criticized President Barack Obama’s record and discussed children and education.", "\"If we want to continue to be the greatest nation on the planet, we must give our kids what we promised them — an equal opportunity,\" he said. \"That starts in the classroom. It starts in our communities. It starts where you live and it starts with nominating Mitt Romney the next president of the United States.\"", "2000, 2004 and 2008", "Priebus also contended in his interview with Todd that there was no \"President Bush\" at the 2008 RNC in St. Paul, Minn.", "That’s not entirely correct, either. President George W. Bush addressed convention delegates live from the White House. Bush told convention delegates that he remained in Washington to oversee recovery efforts related to Hurricane Gustav.", "Bush, however, praised GOP nominee Arizona Sen. John McCain.", "\"He is ready to lead this nation,\" Bush said. \"From the day of his commissioning John McCain was a respected Naval officer who made decisions on which the lives of others depended.\"", "First Lady Laura Bush spoke live from the convention, which also included appearances by former President George H.W. Bush and former First Lady Barbara Bush, video from the event shows.", "George W. Bush, the 2004 GOP nominee, of course spoke at the New York City 2004 convention as well, as did Laura Bush. Same for 2000 in Philadelphia, Pennsylvania.", "1980, 1984, 1988, 1992 and 1996", "The list goes on.", "Former president George H.W. Bush spoke at the 1996 convention in San Diego, Calif., which eventually nominated former Kansas Sen. Bob Dole.", "George H.W. Bush spoke in Houston, Texas, for the 1992 convention, as part of his failed re-election campaign.The same goes for 1988, when he was named the Republican nominee for the first time.", "In 1984, George H. W. Bush was selected as the vice-presidential nominee (Ronald Reagan was nominated for president). The same thing happened in 1980, and Bush spoke on both occasions.", "The earliest convention we could find without a Bush speaking was in 1976, where Gerald Ford was selected as the Republican nominee.", "To recap, that’s at least 40 years and nine conventions where a Bush had a speaking role. And members of the Bush family definitely spoke at both the 2012 and 2008 conventions.", "Our ruling", "Priebus said it’s not a big deal a Bush isn’t attending the 2016 convention, because a Bush didn’t speak in 2012 and \"there was no President Bush\" at the 2008 convention.", "He’s wrong. Jeb Bush addressed delegates at the 2012 Republican National Convention in Tampa. In 2008, George W. Bush addressed delegates via a live video feed, but former President George H.W. Bush and former first ladies Laura and Barbara Bush all attended.", "A Bush has spoken at every RNC since at least 1980, we found.", "We rate this claim False.", "https://www.sharethefacts.co/share/1cef2f85-9353-4065-99c0-3b9d7c05f74d", "PolitiFact, \"Is it true Republicans haven’t won presidential race since 1928 without a Bush or Nixon?,\" January 26, 2015.", "\"Election 2012: Jeb Bush’s R.N.C Speech,\" The New York Times YouTube channel, August 30, 2012", "Politico, \"Republican National Convention schedule,\" August 30, 2008", "CNN, \"Speakers: 2012 Republican National Convention,\" August 27, 2012", "\"Acceptance Speech: President George W. Bush, 2000 Republican National Convention,\" Republican National Convention YouTube channel, March 7, 2016", "\"George HW Bush 1996 Convention Speech,\" C-Span, April 27, 2015", "The American Presidency Project, \"Remarks Accepting The Presidential Nomination At The Republican National Convention in Houston,\" August 20, 1992", "\"1988 George HW Bush Speech,\" C-Span, August 18, 1988", "Politico, \"Bush 41 and Bush 43 plan to skip GOP convention,\" May 5, 2016", "\"1980 Vice Presidential Acceptance Speech,\" C-Span, August 17, 1980", "\"Vice President Bush 1984 Acceptance Speech,\" C-Span, August 12, 1984", "\"Bush 2000 Convention Speech,\" C-Span, April 23, 2014", "Meet the Press, \"Priebus: Trump Will ‘Never Be Stopped If Public Gets to Know Him,’\" July 17, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]