["About this rating", "On 20 September 2016, a YouTube user uploaded a video comparing the eye movements of Democratic presidential candidate Hillary Clinton with those of a lizard, claiming that she \"began to exhibit bizarre eye movement and strabismus (crossed eyes) during her speech in Philadelphia yesterday before unexpectedly canceling today's scheduled events\":", "Clinton (who is not a lizard person) did cancel a lunch fundraiser in Chapel Hill, North Carolina, on 20 September 2016, with the stated reason for the cancellation being a \"change in the campaign schedule,\" according to Raleigh television station WRAL.", "The caption on the video claimed it was taken from a speech Clinton delivered on 19 September 2016 in Philadelphia.  Although that video is zoomed in close on Hillary Clinton's face, the full video of her speech reveals nothing particularly strange or alarming about her eye movements:", "Speculation about Clinton's health has raged since at least 2014, when Republican strategist Karl Rove noticed she was wearing special eyeglass lenses and claimed she had a \"traumatic brain injury.\" The Washington Post confirmed Clinton wore a lens overlay called a Fresnel prism after suffering a concussion to treat double vision, but  her condition was temporary.", "According to Internet theorists, Clinton may also have a condition known as strabismus, in which both eyes don't always work together. Strabismus affects around 4 percent of the population and can be caused by heredity or uncorrected farsightedness, and people who have suffered head injuries or strokes are at higher risk for developing it. The condition can become more obvious to observers when a person is \"tired, ill, or has done a lot of reading or close work,\" according to optometrists.", "We found no evidence that Clinton suddenly cancelled her North Carolina campaign event over strange eye movements, nor did we find any evidence of anything wrong with her eyes in September 2016. While Clinton suffered a concussion in 2012, there is no evidence that she has been diagnosed with strabismus or any long-term eye anomaly as a result of it. Even if she did have strabismus, presence of the condition does not automatically imply poor health overall.", "Matsumoto, Evan. \"Clinton Postpones Tuesday Chapel Hill Event.\"\r\n   WRAL-TV. 20 September 2016.", "American Optometric Association. \"Strabismus (Crossed Eyes).\"", "Bernstein, Lenny. \"Why Did Hillary Clinton Wear Those Glasses After Her Concussion?\"\r\n    The Washington Post.   13 May 2014.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]