["On January 2, several social media users shared a video and claimed that anti-Citizenship Amendment Act (CAA) protesters burned pictures of Hindu gods during a rally. BJP spokesperson Sambit Patra quote-tweeted one of the tweets that had shared the clip and wrote, “This video is shocking …how can any protest have a right to defile the tenets of Hinduism ..who gives them the right to burn the pictures of Hindu Gods & Goddesses ..why should any protest be an Anti-Hindu protest?? Is this is what the Congress & Communists promote?? #Shame“", "This video is shocking …how can any protest have a right to defile the tenets of Hinduism ..who gives them the right to burn the pictures of Hindu Gods & Goddesses ..why should any protest be an Anti-Hindu protest?? Is this is what the Congress & Communists promote??#Shame https://t.co/9rn2gIwQ9T", "— Sambit Patra (@sambitswaraj) January 2, 2020", "Another user @pratheesh_Hind tweeted, “Pics of Hindu Gods were burnt in an anti CAA protest.” This post was retweeted over 5,000 times.", "A Facebook user Satya Bhat Suda posted a longer clip – 4:30 minutes – of the same incident.", "the protesrors against CAA slapping Hindu GOD photos with sandals and burnt", "Why the Religion and God is coming into their protest? I feel it is the indication of their hatred against Hinduism not CAA", "As an Hindu why should I tolerate such hatred protests under Secularism?", "It all shows that instead of Rohingya, the Indian secular muslim are dangerous to nation", "Does JAI BHIM / BABA SAHEEB taught them to hate Hindus in their own land?", "Posted by Satya Bhat Suda on Wednesday, 1 January 2020", "Update: The clip is also circulating with the claim that this took place in Kerala. It alleges that the Muslim community in the state threw shoes at posters of Hindu deities, then burned them. “केरल में CAA के विरोध में वहां के मुख्यमंत्री और कांग्रेस समर्थित मुस्लिम समुदाय के लोगों ने हिंदू धर्म के देवताओं की तस्वीरों पर पहले जूते मारे और फिर उन्हें आग लगा दी गई। is this secularism,” reads the complete message.", "केरल में CAA के विरोध में वहां के मुख्यमंत्री और कांग्रेस समर्थित मुस्लिम समुदाय के लोगों ने हिंदू धर्म के देवताओं की तस्वीरों पर पहले जूते मारे और फिर उन्हें आग लगा दी गई। हिन्दुओं सोते रहो, जब तक कि ये आग आपके घरों में नहीं घुसेगी, तब तक तुम्हारी नींद नहीं टूटेगी।@Real_Anuj pic.twitter.com/JfJH5PQ3Kf", "— Aman Mishra Radhe (@AmanMishraRadhe) January 8, 2020", "The clip is widely circulating on Twitter and Facebook. Alt News has also received a verification request on its official mobile application where the claim suggests that pictures of Hindu gods were set ablaze by members of the Muslim community.", "If one carefully listens to the audio, the people in the clip can be heard chanting slogans in Kannada. At the 58-second mark in the video shared by Satya Bhat Suda, one can hear the protestors chant, “Zindabad, Zindabad! Ambedkar Zindabad!” Using this as a cue, Alt News performed a keyword search on Facebook and found a link to this video from 2018.", "On August 23, 2018, Facebook user Prashanth Venkataswamy posted the viral video in question with the claimed and wrote, “Why this hell… What Hindus god have done to you… Secularism should be banned … Bring uniform civil code.”", "Why this hell… What Hindus god have done to you… Secularism should be banned … Bring uniform civil code", "Posted by Prashanth Venkataswamy on Thursday, 23 August 2018", "Other users had also shared the clip that same month, blaming supporters of B R Ambedkar of burning the posters. (archive)", "Alt News couldn’t verify the exact nature of the protest however, it is clearly not linked with CAA protests. The claim made in social media that the viral video shows CAA protestors are burning posters of Hindu deities is false.", "[Update: The claim ‘Muslim community burns posters of Hindu deities in Kerala’ has been added to the report.]", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]