["A 30-second video of a man milking a buffalo and later adulterating the milk is viral on social media with the claim that this happened in “Aslam Dairy Farmhouse in Prayagraj”.", "असलम डेयरी फाफामऊ प्रयागराज जहां पर सैकड़ों हिंदू परिवार दूध लेने प्रतिदिन जाते हैं ,लेकिन असरम अली थूकेगा जरूर….मूर्ख हिंदू भी कहां मानने वाले.. वो भी थूक वाला दूध पियेंगे जरूर।। 😂😂 pic.twitter.com/tlnCltoJaf", "— धनञ्जय #TeamHHB (@Metpco) March 17, 2022", "Several people have shared the video on Twitter.", "असलम डेयरी फाफामऊ प्रयागराज जहां पर सैकड़ो हिंदू परिवार दूध लेने प्रतिदिन जाते है,लेकिन उसकी हरकत देख लो मूर्ख हिंदुओ आपका धर्म भ्रष्ट करने के लिए थूक मिलाकर अपनी हरकत से बाज नहीं आ रहा है अगर आप भी इनके घर का कोई सामान ले रहे है हो सकता है आपको थूँक और मूत्र ही मिलेगा जागो हिंदू pic.twitter.com/psM8Sdivwv", "— सनातनी पूनम 🚩🇮🇳 Sp 🙏🏻🚩 (@poonamrinki) March 17, 2022", "The same video was shared in 2020 with the claim that it was taken at “Jogeshwari cow stable in Mumbai” and the suspect is from the Muslim community.", "Twitter account @AshishJaggi_1 posted the viral video and wrote, “I can hear Naara-E-Takbeer A. Muzlim milk seller doing what they have been taught to as per the book…” This tweet was retweeted over 1000 times. It is noteworthy that sounds of Azan, the Islamic call to prayer, can be heard in the background.", "I can hear Naara-E-Takbeer A Muzlim milk seller doing what they have been taught to as per the book. This exclusive weird video must reach the masses who still believe in Ganga-Jamuni Tehzeeb & Bhai-Chaara. Just see the filth which many of us are eating/drinking around us. pic.twitter.com/vSeQYA7n9D", "— Ashish Jaggi (@AshishJaggi_1) August 19, 2020", "Several Facebook users had posted the viral video two year ago without an anti-Muslim claim. This included Hanif Patel who wrote, “Jogeshwari tabela, 100 % pure milk for Mumbaikar..”", "This slideshow requires JavaScript.", "Coreena Suares of Hyderabad-based NewsMeter, in a reply to one of the tweets, said, “FYI Dabeerpura Police have booked a case against the Owner Ghouse and the worker Raju. Whilst Ghouse has been arrested, the worker Raju who can be seen in the video is absconding.“", "FYI Dabeerpura Police have booked a case against the Owner Ghouse and the worker Raju. Whilst Ghouse has been arrested, the worker Raju who can be seen in the video is absconding.", "— @Coreena Enet Suares (@CoreenaSuares2) August 20, 2020", "Using this as a clue, a keyword search took Alt News to a video report by The Times of India. The channel stated, “In the video worker of the Jahangeer Dairy, located at Gol Khabar in Darulshifa, could be seen milking a buffalo at the farm…Hyderabad police registered a case and launched a manhunt to nab him.” This debunks the first claim that the incident took place in Mumbai.", "The report further said, “..the complainant alleged that the worker, Raju, drank some milk from a mug and then mixed remaining milk in the mug with rest of the milk. Not only that he was also spotted mixing dirty water used for buffaloes in the milk.” Thus the dairy farmer caught in the act was Raju.", "Alt News spoke with N Satyanaraya, SHO of Dabeerpura station, who confirmed, “The man in the viral video is not from a minority community.” Additionally, we spoke with the investigating officer, sub-inspector Sravan Kumar. “This incident took place at Jahangir milk farm, Gol Khabar. The man in the video is Raju. He is not from a minority community. Raju is absconding as of now,” he said.", "As per inputs from Suares and Kumar, the owner of the farm is from the minority community and has been charged under Indian Penal Code (IPC) Section 269 (Negligent act likely to spread infection of disease dangerous to life), Section 272 (Adulteration of food or drink intended for sale) and Section 273 (Sale of noxious food or drink).", "This video was earlier fact-checked by NewsMeter. As per their report, “The complaint was registered by Azmath Jeffery of public grievance association. Post the complaint, the farm was sealed.”", "Thus, the social media claim that the incident took place in Mumbai is false. The incident took place in Gol Khabar area of Hyderabad. As per multiple officers at Dabeerpura station, the man adulterating milk is not from the minority community.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "A purported video of a Muslim man beating a temple priest with a bat is…", "A picture depicting the Pakistani flag apparently bigger in size and apparently placed higher than…", "Amid the ongoing war between Israel and Hamas, a video of a fleet of cars…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "A clip featuring Pakistan men’s Cricket team captain Babar Azam is viral on social media…"]