["About this rating", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "On March 19, 2020, former U.S. President Donald Trump first promoted a commonly used antimalarial drug named hydroxychloroquine as a treatment for COVID-19 in the White House briefing room, mentioning it at least 17 times in subsequent public appearances, according to an April 2020 Associated Press report.", "Limited studies presented at that time had suggested that the drug could potentially act as either a preventative measure against COVID-19 or as a treatment to reduce severity of infection, but further research did not demonstrate the ability for the drug to do either. The efficacy of the drug ultimately became a partisan battle uninformed by science and promoted aggressively by Trump surrogates like Rudy Giuliani.", "For a brief period of time from March to June 2020, the U.S. Food and Drug Administration (FDA) approved an emergency use authorization allowing — based on threadbare scientific evidence — hospitalized COVID-19 patients to be treated with hydroxychloroquine. Early on in this window of time, Oklahoma Gov. Kevin Stitt authorized the purchase of $2 million worth of hydroxychloroquine from a California-based drug wholesaler named FFF Enterprises to build a state stockpile of the drug.", "On April 28, 2020, following warnings from the FDA about using hydroxychloroquine for COVID-19, Oklahoma Attorney General Mike Hunter requested that State Auditor Cindy Byrd carry out an “investigative audit” on Stitt’s and the Oklahoma State Health Department’s spending. Responding to that news, Gov. Stitt argued that the drug was still \"useful for any number of ailments ... and so that money will not have gone to waste in any respect.\" On June 15, the FDA revoked the emergency authorization for hydroxychloroquine.", "Reports first emerged in July that Oklahoma was trying to unload its stockpile of the drug. These efforts have not yet borne fruit, evidently.", "On Jan. 26, 2021, the Oklahoma-based newspaper Frontier first reported that the Oklahoma Attorney General’s Office had been tasked with attempting to return the $2 million stockpile to the wholesaler from whom they purchased it.", "\"Nearly a year later the state is trying to offload the drug back to its original supplier,\" the newspaper reported, adding that \"It’s unclear yet how much of the initial $2 million investment in the hydroxychloroquine the state could recoup.\"", "Because Oklahoma has been trying, unsuccessfully, to get rid of its stockpile of hydroxychloroquine since at least July 2020, the claim is \"True.\"", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]