["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Sacramento County Sheriff Scott Jones speaks at the 7th District Congressional debate in Sacramento on Tuesday Oct. 18, 2016. Photo by Andrew Nixon / Capital Public Radio", "Asked about California’s effort to legalize recreational marijuana, Republican congressional candidate Scott Jones said the experiences in Colorado are a stark warning of what not to do.", "Jones is Sacramento County’s sheriff and is running against Democratic Rep. Ami Bera for the region’s 7th District Congressional seat.", "\"We can look to Colorado ... and look at the horrific results,\" Jones said during a debate this week between the two candidates in Sacramento. \"If you look at the increased incidents of emergency room visits by young people. If you look at the increased incidents of driving while under the influence of marijuana. All voters have to do is see what happened in Colorado to predict what’s going to happen here.\"", "Scott Jones makes his claim about marijuana at about the 10:20 minute mark in the video above.", "California voters in November will decide on Proposition 64, which would legalize recreational pot for those 21 and older. Both Jones and Bera oppose the measure.", "Several other states will also vote on legalizing recreational or medicinal marijuana on Election Day.", "Colorado voted to legalize marijuana in 2012 and the law went into effect in 2014.", "We wondered if Jones was right? Did Colorado see a spike in ER trips by young people and more cases of driving while stoned after it legalized pot?", "Our research", "The first part of Jones’ statement appears to be correct. Several studies document a rise in trips to Colorado emergency rooms by young people.", "As reported in the Denver Post in July, a study in the medical journal JAMA Pediatrics found \"Colorado’s laws on labeling and child-resistant packaging have been unable to stop an increase of young kids ending up in the emergency room after accidentally consuming marijuana.\" The study found \"... cases for pediatric marijuana increased significantly and at a higher rate than the rest of the United States.\"", "Examining Jones’ claim about an increase in incidents of driving while under the influence of marijuana was more complex.", "There’s not much data yet on the topic because the state only started tracking marijuana-related traffic incidents in 2014, according to a Colorado State Patrol spokesman quoted in the Denver Post last year.", "Jones’ campaign manager pointed us to a Colorado State Patrol report showing mixed results. It says the percentage of DUIs in the state where marijuana or marijuana in combination with alcohol or other drugs was the perceived impairing substance increased from 12 percent in 2014 to 15 percent in 2015.", "The same report, however, shows the raw number of citations for DUIs involving marijuana or marijuana in combination with other drugs dropped slightly during the same two years, from 674 to 665.", "A separate Colorado study pointed to by Jones’ campaign reported there’s been an increase in the percentage of drivers testing positive for marijuana involved in fatal traffic accidents.", "Making things more cloudy, however, that report includes a note from the Colorado State Patrol that \"marijuana citations\" are defined as those where marijuana was present \"based on officer opinion only,\" noting there’s \"no toxicological confirmation.\"", "Radley Balko, who blogs about criminal justice for the Washington Post, wrote in 2014 that a spike in the number of drivers who are tested and found to have traces of marijuana in their system would not be a surprise in Colorado, nor would it mean marijuana necessarily contributed to a traffic accident.", "\"All that a positive test tells us is that the driver has smoked pot at some point in the past few days or weeks,\" Balko wrote, noting the drug can linger in a person’s system for days after its effects wear off.", "\"It makes sense that loosening restrictions on pot would result in a higher percentage of drivers involved in fatal traffic accidents having smoked the drug at some point over the past few days or weeks,\" Balko added.", "Our ruling", "Scott Jones said Colorado saw \"increased incidents of emergency room visits by young people\" and \"increased incidents of driving while under the influence of marijuana\" following the state’s legalization of recreational marijuana.", "Studies show the state indeed experienced a spike in ER visits by young people related to marijuana.", "Less clear is how marijuana-related traffic incidents have changed since the state legalized the drug. Studies have limited data and show mixed results. Further complicating the matter, marijuana can remain in a driver’s system days after the effect of the drug has worn off, making it difficult to determine whether the drug was the primary factor in an accident.", "Jones’ statement on the ER visits is accurate. But there’s not enough convincing data to prove the second portion of his claim.", "We rate it Half True.", "HALF TRUE – The statement is partially accurate but leaves out important details or takes things out of context.", "Click here for more on the six PolitiFact ratings and how we select facts to check.", "https://www.sharethefacts.co/share/55ce730b-0af4-4fe8-b4d0-f3615372dfe9", "Scott Jones, 7th Congressional District debate, Oct. 18, 2016", "Interview, Kyle Macdonald, spokesman, Sheriff Jones for Congress, Oct. 19, 2016", "Colorado State Patrol, Marijuana Legalization in Colorado: Early Findings, March 2016", "Rocky Mountain High Intensity Drug Trafficking Program, The Legalization of Marijuana in Colorado: The Impact, September 2016", "JAMA Pediatrics, Unintentional Pediatric Exposures to Marijuana in Colorado, 2009-2015, September 2016", "Colorado Springs Gazette, Report: Marijuana-related DUI citations in Colorado dropped slightly in 2015, Feb. 11, 2016", "Denver Post, Colorado still not sure whether legal marijuana made roads less safe, Dec. 29, 2015", "Washington Post, Since marijuana legalization, highway fatalities in Colorado are at near-historic lows, August 5, 2014", "Denver Post, Kids’ emergency room visits for marijuana increased in Colorado after legalization, study finds, July 25, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]