["A video of a large stash of old and new Indian currency notes piled up at an unknown place was tweeted by @Noor_Chaudhari. According to the message posted along with the video, it pertains to an Income Tax raid at BJP MP Rajeev Chandrasekhar’s bungalow in Delhi. The message also urges social media users to share the video to unmask the corrupt side of the Bharatiya Janta Party. Also, Rajeev Chandrasekhar’s has been misspelled as, “Rajiv Chandrasheher“.", "दिल्ली में BJP k mantri Rajiv Chandrasheher के दिल्ली सफदरजंग एन्क्लेव के बंगले पर छापा पड़ा है उसका वीडियो आपके साथ शेयर कर रहा हुँ .. रुपये का गोदाम देखों और शेयर करों जिससे 👹 BJP का असली भृष्टाचारी चेहरा सामने आ सकें !! pic.twitter.com/rcU3O9egSd", "— Prof. थानेदार इलाहाबादी ( نور ) (@Noor_chaudhari) March 18, 2019", "Jeetendra Chouhan, a Facebook user also posted the video, accompanied by the same caption, along with a few other individuals on Twitter.", "Alt News found that while the video itself is old and unrelated, and the claim attached to the video is false and malicious. The video depicts an IT raid on Delhi based T&T law firm, owned by Rohit Tandon, in 2016, where a total sum of Rs 13.48 crore was seized by the IT authorities. The money was stashed in old and new currency notes. “A joint team of the I-T department and Delhi police’s crime branch found cabinets and secret chests at Rohit Tandon’s office in the upscale GK-1 area filled with notes on Sunday. Several cartons containing cash were also found.”, stated a report published by Times of India on December 12, 2016.", "Video of over Rs 8 cr cash (Rs 2 cr in new currency) seized by Delhi Police from T&T law firm in Delhi’s GK. @the_hindu @abaruah64 pic.twitter.com/qXlQ7Ixg3y", "— Shiv Sunny (@shivsunny) December 10, 2016", "It may be noted that Advocate Rohit Tandon, who was later arrested in connection with a money laundering case after demonetization, was granted bail by the Delhi High Court on May 10, 2018.", "A two-year-old video related to an Income Tax raid on a lawyer’s office was falsely shared as that on BJP MP Rajeev Chandrasekhar’s bungalow. In August 2017, the same video was circulated on social media with the false claim that an IT raid was carried out on Karnataka Congress Minister DK Shivakumar’s home.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]