["About this rating", "Under current United States tax law, every flight sold by an “aircraft management company” to a passenger comes with a two-part tax on that passenger: a fee that is 7.5 percent of the value of the flight, as well as a flat dollar amount for each individual segment of a domestic flight.", "As written, there's a lack of clarity surrounding the question of whether the companies that maintain and staff private jets on behalf of a plane's private owner can be counted as an aircraft management company. If so, there's also the question of whether they would be required to tax their owner-passengers under this regulation.", "In March 2012, the IRS released a memo arguing that the rule does indeed apply in cases in which a company managing a plane for a private owner. This had the result of making such aircraft management companies potentially liable for years of back-taxes that would have been — but were not — levied on their passengers and/or aircraft owners. After significant lobbying, the IRS froze efforts to collect such taxes until after completing a review of the policy. In July 2017, the IRS announced that it would be shelving all pending audits relating to these “ticket taxes” on private aircraft management companies.", "As of its final markup by the Senate Committee on Finance, released on 15 November 2017, the Senate GOP-sponsored tax reform bill includes a provision that formalizes the IRS policy (it is not in the recently passed House version) of not applying this ticket tax to aircraft management companies servicing private jets:", "The proposal exempts certain payments related to the management of private aircraft from the excise taxes imposed on taxable transportation by air. Exempt payments are those amounts paid by an aircraft owner for management services related to maintenance and support of the owner’s aircraft or flights on the owner’s aircraft.", "This provision was included in the final version of the Senate Bill passed on 1 December 2017.", "The Senate's version of the law would have the effect of making explicit the de facto policy that transportation via private jet is not subject to the same taxes that passengers on commercial airlines incur. Critics of the bill suggest that, because the United States air traffic services are funded from these taxes, the non-private-jet-owning American public ends up essentially subsidizing the cost of air travel for the ultra-wealthy. As reported by Bloomberg in September 2017:", "On a per flight basis, a private jet could generate as little as two percent of the taxes and fees paid by airline passengers on an identical route, Bloomberg found in its review. High-performance private planes make up about 10 percent of U.S. flights under air-traffic control, yet pay less than 1 percent into a trust fund that finances air-traffic control and other Federal Aviation Administration operations, an agency study found this year.", "Supporters of the bill, which include Ohio Democrat senator and co-sponsor of legislation that inspired this measure Sherrod Brown, argue that it merely provides certainty to private aviation industry, which has acted without formal guidance for years. In a statement lauding the proposal, National Air Transportation Association President Martin H. Hiller said:", "Tax reform legislation has a long way to go, but this is an important step and small aviation businesses are appreciative of the inclusion of this provision, which provides them the tax certainty they have long sought.", "Because this provision is not literally a tax cut or deduction explicitly given to private-jet owners, but because it has the effect of reducing the tax burden of private-jet passengers relative to the commercial airline flying public, we rank the claim of a private jet tax cut in the senate GOP tax bill as mostly true.", "We note, however, that the bill in effect does nothing but codify a status quo.", "United States Code.   “26 USC 4261: Imposition of Tax\"\r\n    Accessed 20 November 2017.", "Internal Revenue Service.   “Transportation of Persons by Air - Taxability of Aircraft Management Fees.\"\r\n    9 March 2012.", "Hsu, Tiffany.   “Senate Tax Plan Includes Exemption for Private Jet Management.\"\r\n    The New York Times.   17 November 2017.", "Lynch, Kerry.   “IRS To Shelve Pending Audits on Aircraft Management Fees.\"\r\n    AIN Online.   17 July 2017.", "Senate Committee on Finance.   “Description of the Chairman’s Modification to the Chairman’s Mark of the ‘Tax Cuts and Jobs Act’”\n    15 November 2017.", "Senate Committee on Finance.   “Description of the Chairman’s Modification to the Chairman’s Mark of the ‘Tax Cuts and Jobs Act’”", "15 November 2017.", "Lynch, Kerry.   “IRS To Shelve Pending Audits on Aircraft Management Fees.\"\r\n    AIN Online.   17 July 2017.", "Levin, Alan.   “Football Champs and CEOs Alike Sidestep Taxes With Private Jets.\"\r\n    Bloomberg.   7 September 2017.", "National Air Transportation Association.   “NATA Commends Senate Finance Committee for Inclusion of Aircraft Management Services Legislation in Tax Overhaul.\"\r\n    15 November 2017.", "Updated [5 December 2017]: Updated to reflect that the version of the Senate bill passed on 2 December 2017 included the aircraft management company provision as originally presented in the markup.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]