["About this rating", "This is a genuine photograph.", "However, this photograph was taken in 2011, not 2020.", "In October 2020, an image supposedly showing a group of people holding flags that combined Nazi and American symbols was circulated on social media.", "This is a genuine photograph. However, this image was taken not taken recently.", "This photograph was taken by Mel Evans of The Associated Press in April 2011, and shows members of the neo-Nazi National Socialist Movement, which was designated a hate group by the Southern Poverty Law Center, during a rally in Trenton, New Jersey.", "A 2011 news report from NJ.com noted that the rally involved less than 100 people, that members shouted \"Sieg Heil,\" a common chant at political rallies in Nazi Germany, and that speakers railed against illegal immigration and crime:", "A small group of neo-Nazis, members of the National Socialist Movement, rallied on the steps of the Statehouse briefly Saturday, while hundreds of counter-protesters demonstrated behind a barricade a short distance down the street.", "[...]", "\"We have illegal aliens ... streaming over our borders taking American jobs,\" said NSM national director Jeff Schoep, speaking into a microphone over the chants and catcalls of counter-protesters. \"You can’t tell me that ... illegals are coming here to take the jobs that we don’t want. They’re coming here to steal our jobs and live free off your welfare and tax dollars.\"", "This group of neo-Nazis was outnumbered by counterprotesters who met the group's \"Sieg Heil\" chants with a chant of their own: \"Hey-hey, ho-ho, this Nazi scum has got to go.\"", "Divine Allah, a member of the New Black Panther Party that protested against the National Socialist Movement's rally, said:", "\"We can unify around a common goal: to face and deal with the issue that’s affecting us all and that is racism,\" he said. \"We just had to show that the Trenton community can stand up, but we need to stand up and deal with some of the things that are going on in this community on a daily basis. (NSM) left. But we’ve still got work to do.\"", "Fair, Matt.   \"Neo-Nazi Rally at N.J. Statehouse is Outnumbered by Counter-Protests.\"\r\n    NJ.com.   17 April 2011.", "Chang, David.   \"Neo-Nazi Group Rallies in Trenton.\"\r\n    NBC 10 Philadelphia.   16 April 2011.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]