["About this rating", "We have found no evidence demonstrating that the officer wears the \"ΜΟΛΩΝ ΛΑΒΕ\" tattoo as an expression of support for right-wing or militia groups or ideology, and the slogan is more commonly associated with Second Amendment activism and opposition to gun control. We also have found no evidence that he is involved in what could be described as a \"skinhead\" movement or group.", "In July 2019, concerned and outraged Facebook users shared a post that purported to show a Jewish woman, protesting the Trump administration's U.S. border-detention policy, being arrested by a \"skinhead cop with a right-wing militia tattoo.\" The photograph was accompanied by the caption \"Nothing to see here, just a skinhead cop with a right-wing militia tattoo arresting a Jewish woman for protesting a concentration camp\":", "The caption of user Emily Connor's July 3 post appeared to have been borrowed from a tweet, posted two days earlier, by the @vmWareWolf account:", "How much can you fit in one image?", "\"Skinhead cop with right-wing militia slogan tattoo arrests Jewish woman for protesting concentration camps.\"", "We're living in Bizarro world.", "— Chritopherr ? (@vmWareWolf) July 1, 2019", "We received multiple inquiries from readers as to whether the photograph was authentic, and whether it truly showed a \"skinhead\" police officer bearing a \"right-wing militia tattoo.\" The photograph is certainly authentic, but we found no evidence to support the description of the officer in question as a \"skinhead,\" and the meaning and significance of his tattoo is complicated.", "The photograph posted by @vmWareWolf and Connor was originally published on the Facebook account of \"Never Again Action,\" a group of Jewish activists opposed to what they described as the \"mass atrocity\" of President Donald Trump administration's immigration and border-detention policies. \"Never Again Action\" characterized U.S. government detention facilities along the southern border with Mexico as \"concentration camps.\"", "On June 30, members of that group protested outside an Elizabeth, New Jersey, immigrant-detention facility. According to a spokesperson for the city, police arrested 36 demonstrators on suspicion of blocking a public passage, after they allegedly blocked entry into the facility.", "One of the photographs posted to the group's Facebook page showed a bald, male officer with the last name Toro escorting a handcuffed female protester away from the demonstration. The officer had a tattoo on his right forearm:", "The same officer was captured in a second photograph handcuffing another protester, and the tattoo on his right forearm was again clearly visible. Taken from different angles, with the officer's forearm shown in different postures, these two photographs provided mutual corroboration and allowed us to conclude they were both authentic:", "The tattoo read \"ΜΟΛΩΝ ΛΑΒΕ\" (\"Molon labe\"), an Ancient Greek phrase meaning \"having come, take\" or \"come and take [them]\" that originated with the writings of the historian Plutarch. In his \"Moralia\" (\"Morals\"), Plutarch recounted the lead-up to the Battle of Thermopylae in 480 B.C., a milestone in military history that might be familiar to readers who have seen the 2007 film \"300.\"", "Before the fighting began, Xerxes, ruler of the Persian empire, encouraged Leonidas, king of the militaristic city-state of Sparta and leader of an alliance of outnumbered Greek forces, to surrender. Plutarch recorded of that event: \"When Xerxes wrote again, ‘Hand over your arms,’ [Leonidas] wrote in reply, ‘Come and take them.’\"", "Over the centuries, Leonidas' retort has become a maxim of defiance and determination, especially in a military context, and in recent years has gained popularity in the United States among some advocates of the Second Amendment's protection of the right to bear arms, especially those advocates vehemently opposed to enhanced gun-ownership restrictions or fearful of hypothetical future government attempts at widespread firearm confiscation. The Greek phrase is commonly emblazoned on t-shirts and used in tattoos, often accompanied by images of firearms or Spartan helmets.", "Although the slogan is primarily associated with the more extreme elements of the gun-rights movement, both \"Molon labe\" and its Anglicized version, \"Come and take it,\" have also been used by and associated with white supremacist and far-right groups.", "The anti-immigrant, white nationalist group the American Guard, for example, uses \"Come and take it\" in their logo, and \"come and take it\" has appeared regularly on white supremacist and far-right online forums such as Daily Stormer. The San Francisco Bay-area, far-right protester Kyle Chapman, known for his violent participation in protests and counter-protests including those that took place in Berkeley, California, in spring 2017, has prominently displayed \"ΜΟΛΩΝ ΛΑΒΕ\" on helmets he wears in street clashes.", "Some overlap exists between right-wing, anti-government militia symbolism and rhetoric, on the one hand, and pro-Second Amendment activism, on the other. However, the slogan \"ΜΟΛΩΝ ΛΑΒΕ\" is most commonly and prominently associated with the latter, and someone who uses it or displays it on a tattoo or t-shirt as part of an opposition to gun ownership restrictions or would-be gun confiscation does not necessarily have any involvement or sympathy with \"right-wing militia\" or skinheads.", "The claim that the pictured officer is a \"skinhead\" appears to be based only on the fact that he is bald, rather than any evidence that he is (or has been) a member of a skinhead group, or has taken part in the skinhead subculture, which in the United States is typically associated with far-right, white supremacist ideology. Most bald men are not skinheads, and skinheads need not be bald in order to identify as such.", "We do not know what motivated or inspired the \"ΜΟΛΩΝ ΛΑΒΕ\" tattoo worn by the Elizabeth, New Jersey, police officer shown in the June-July 2019 arrest photographs. On Facebook, we contacted an Elizabeth man who has the same last name and first initial as the officer in question and who bears a striking resemblance to him, whom we strongly suspect to be the officer in question. (We have not yet been able to definitively identify the officer, and due to the unique sensitivities inherent in publicly identifying law-enforcement officers, we are not naming him.)", "We asked the man in question whether he was the officer shown in the photographs, as well as several questions relating to his views on gun control, right-wing politics, and anti-government militia groups, as well as the motivation behind his tattoo, but we did not receive a response of any kind. Without confirmation as to his motivations and ideology, or evidence demonstrating an association with skinhead, right-wing, or militia groups, we cannot confirm that the officer in question is in fact a \"skinhead\" or that he wears the tattoo due to support for \"right-wing militia,\" as was claimed in the viral Facebook and Twitter posts. Thus, this element of the claim remains unproven for now.", "It is not prohibited, in all cases, for Elizabeth police officers to have visible tattoos, but it does appear to be frowned upon. The department's 2017 policy manual states that \"While on-duty or representing the Department in any official capacity, every reasonable effort should be made to conceal tattoos or other body art. At no time while on-duty or representing the Department in any official capacity, shall any tattoo or body art considered offensive be visible. Examples of offensive tattoos would include, but not be limited to, those which depict racial, sexual, discriminatory, gang related or obscene language.\"", "In an effort to inquire as to whether the officer's \"ΜΟΛΩΝ ΛΑΒΕ\" tattoo might have constituted a violation of the policy, and what the department's stance was towards tattoos and insignia of a controversial or political nature, we made repeated attempts to contact any individual responsible for handling media inquiries at Elizabeth Police Department.", "Unfortunately, we were told that only one person had that authority, and that that person, a police sergeant, was absent from work. When we attempted to leave a voicemail message, we discovered that that person did not have a voicemail-messaging system set up. When we asked for the email address of that individual or anyone else who was authorized to handle media inquiries, a dispatcher provided us the web address www.elizabethnj.org. When we pointed out that that was a website URL, not an email address, the dispatcher refused to provide further assistance. When we made a final attempt to reach a responsible staff member at the police department, a second dispatcher said, \"Do not call here again\" and hung up on us.", "Attrino, Anthony G.   \"36 Protestors Arrested Outside ICE Detention Center in N.J.\"\r\n    NJ.com.   1 July 2019.", "Plutarch.   \"Apophthegmata Laconica.\"\r\nGregorious N. Bernardakis (transl. Frank Cole Babbitt),   1889.", "Bond, Sarah E.   \"This Is Not Sparta.\"\r\n    Medium.   7 May 2018.", "Anti-Defamation League.   \"Behind the American Guard: Hardcore White Supremacists.\"\r\n    30 March 2017.", "Ruggerio, Angela.   \"Bay Area Far-Right Protester Kyle 'Based Stickman' Chapman Takes Plea Deal in Federal Case.\"\r\n    East Bay Times.   29 January 2019.", "Elizabeth Police Department (New Jersey).   \"Policy Manual -- 2017.\"\r\n  2017.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]