["About this rating", "The 14 February 2018 mass shooting that left seventeen people dead at Marjory Stoneman Douglas High School in Parkland, Florida reignited a debate about gun control — thanks, in large part, to the #NeverAgain campaign started by its survivors.", "As the students of the school stepped into the limelight to demand change, a quote from the school's namesake about activism emerged:", "This is a genuine, albeit slightly edited, quote, correctly attributed to the journalist, women's suffrage advocate, and environmental activist who spent much of her life fighting for the conservation of the Florida Everglades. Douglas, who passed away in 1998 at the age of 108 (!), wrote the following passage in a 1980 article entitled \"How You Can Protect the Environment\" published in the journal GeoJourney.", "We have not been able to track down this particular issue, but her quote (and the appropriate citation) appears in several books. Author Mary Joy Brenton provided a more comprehensive version of this quote in her book Women Pioneers For the Environment:", "Join a local environmental society, but see to it that it does not waste time on superficial purposes... Don't think it is enough to attend meetings and sit there like a lump.... It is better to address envelopes than to attend foolish meetings. It is better to study than act too quickly; but it is best to be ready to act intelligently when the appropriate opportunity arises...", "Speak up. Learn to talk clearly and forcefully in public. Speak simply and not too long at a time, without over-emotion, always from sound preparation and knowledge. Be a nuisance where it counts, but don't be a bore at any time... Do your part to inform and stimulate the public to join your action....", "Be depressed, discouraged and disappointed at failure and the disheartening effects of ignorance, greed, corruption and bad politics — but never give up.", "Marjory Stoneman Douglas was also inducted to National Wildlife Federation Hall of Fame and the National Women's Hall of Fame, and she was awarded the Presidential Medal of Freedom by Bill Clinton in 1993. She also made a brief cameo (as a doll on a Thanksgiving centerpiece) in an episode of The Simpsons:", "Joy Breton, Mary.   Women Pioneers For The Environment.\r\n    Northeastern University Press, 1 February 2016.   (p. 244).\r\n\r\nNortheastern University Press, Feb 1, 2016", "Nies, Judith.   Nine Women: Portraits from the American Radical Tradition.\r\n    University of California Press, 15 October 2002.   (p. 283).", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]