["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "The Internet is getting a sustained buzz from a fake news story about former President Jimmy Carter saying marijuana cured his cancer, but the years-old hoax can only burn readers.", "\"Jimmy Carter: ‘Medical marijuana cured my cancer,’\" reads the headline on a post dated Dec. 8, 2015, from CannaSOS.com. The site says it is a social media platform where \"cannabis enthusiasts\" can discuss information related to marijuana.", "The post says Carter had become a cannabis connoisseur since being diagnosed, and credited a medical marijuana purveyor in Oakland, Calif., for helping find a proper strain of the drug.", "Facebook users flagged the story as being potentially fake, as part of the social media network’s efforts to thin out fake news stories. While the story goes back to 2015, it was shared on Facebook more than 1,000 times in the past seven months. Versions of the same story have appeared in links from other websites, as well.", "In 2015, Carter was really diagnosed with skin cancer that had spread to his brain, but in December of that year announced the cancer’s growth had been arrested and reversed. Instead of medical marijuana, Carter announced he had been trying a new drug called Keytruda that appeared to help control and reverse the metastatic melanoma.", "The fake story, meanwhile, appears to have originated from a Dec. 7, 2015, post on a site called SatiraTribune.com. There’s no disclaimer on the site, but their Facebook page notes that SatiraTribune publishes \"satirical and futuristic news.\"", "The story is full of cliches about smoking marijuana, including Carter being forgetful and having the munchies for peanuts. It also says Carter would be supporting legalization efforts in several states.", "(Four more states voted to allow recreational marijuana in 2016, while three others approved medical marijuana. That brings the total number of states with some form of legal marijuana to 28, plus the District of Columbia.)", "Carter’s own record on marijuana is a little hazier than the story makes it out to be. He suggested to Congress in 1977 that possession of up to one ounce of marijuana should be decriminalized, in an effort to keep people out of prisons for smoking the drug. When a CNN anchor asked him in 2012 whether he supported legalization, he said, \"I’m in favor of it. I think it’s OK.\"", "He recently clarified his position in 2013: \"I do not favor legalization,\" he said at a meeting of state legislators and regulators. \"We must do everything we can to discourage marijuana use, as we do now with tobacco and excessive drinking.\"", "But perhaps the biggest giveaway is a faked quote from Carter that reads, \"I smoke two joints in the morning, I smoke two joints at night, I smoke two joint in the afternoon, and it makes me feel all right.\"", "That’s actually the opening line from The Toyes’ 1983 weed anthem \"Smoke Two Joints,\" although many people instead refer to Sublime’s 1992 cover, or even Macy Gray’s 2012 interpretation. We don’t know which version Carter would prefer.", "At any rate, this is a fake story that sparked a wave of readers being fooled. We rate it Pants On Fire!", "CannaSOS.com, \"Jimmy Carter: ‘Medical Marijuana Cured My Cancer’,\" Dec. 8, 2015", "The Hill, \"Jimmy Carter: 'I think it's OK' to legalize marijuana,\" Dec. 11, 2012", "Politico, \"Carter: I'm OK with legalizing pot,\" Dec. 11, 2012", "The Daily Beast, \"Jimmy Carter Endorses SAM, Opposes Marijuana Legalization,\" May 17, 2013", "NBC News, \"President Jimmy Carter Says Cancer in Brain Is Gone,\" Dec. 6, 2015", "SatiraTribune.com, \"Jimmy Carter: ‘Medical Marijuana Cured My Cancer’,\" Dec. 7, 2015", "NBC News, \"Jimmy Carter: I Thought I Had ‘Two or Three Weeks to Live’ After Cancer Diagnosis,\" Aug. 22, 2016", "Business Insider, \"This map shows every state that legalized marijuana on Election Day,\" Nov. 9, 2016", "The American Presidency Project, \"Drug Abuse Message to the Congress. Aug. 2, 1977,\" accessed March 6, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]