["About this rating", "On 5 September 2017, the web site Pagez.com published an article claiming that the cast of the hit NBC show The Officewould return for a new season in 2018:", "CONFIRMED: The Office US is returning in 2018!", "Last week we heard the news that NBC bosses have given writers the go ahead to create a new season of The Office US. Today, we hear the news that writer, Mindy Kaling is ready to write.", "This week has been full of Office news ever since star Jenna Fisher posted an old un-shot episode script on Instagram. Calling out the crew to get back together and shoot!", "This article was based on two other posts, an April Fool's Day joke on Medium.com and an Instagram post from actress Jenna Fischer, neither of which \"confirmed\" that the cast of The Office would reunite for a new season of the hit NBC show.", "Fischer's Instagram post, for instance, was posted in February 2017, not \"this week\" as alleged by this September 2017 article. Although Fischer's idea stirred up some fan interest in a reunion, neither NBC nor the show's creators had announced plans at that time to create new episodes of the program.", "The rest of the Pagez.com article was based on an April Fool's Day Joke published on Medium.com. In fact, the author of the Pagez article plagiarized an entire paragraph from the joke article on Medium. Here's a comparison of text from the joke article on Medium (left) and the fake news article on Pagez (right):", "Pagez.com later retracted their claim:", "The other day we reported that The Office US would be hitting our screens again in 2018. Well, we were wrong.", "We all make mistakes and it seems that we got fooled by an April Fools joke from earlier this year. After our writers read the original article they got so excited they just had to tell everyone. They went ahead and published the story. So blame them. Not me.", "However, there is a real (albeit slight) possibility that NBC could reboot the hit series. NBC Entertainment chairman Bob Greenblatt told Deadline in August 2017 that the network frequently talks about bringing back The Office (with a different cast), but added that a new season was not currently in the works:", "There had been a lot of chatter the past few weeks about NBC potentially bringing back Emmy-winning comedy The Office, with Greg Daniels — who developed and ran the U.S. version of the British series — at the helm and possibly a new cast. While I’d heard some optimism around town that a new Office may be in the offing, NBC Entertainment chairman Bob Greenblatt did not indicate that a deal is in the works.", "“We often talk about The Office, I’ve talked to Greg four times over the past few years. It’s always, ‘maybe some day but not now’,” Greenblatt said in an interview with Deadline during NBC’s portion of the TCA press tour. “There is certainly an open invitation but we don’t have anything happening right now. If he wants to do it, I would do it.”", "Rumors of an Office revival kicked in again in December 2017, when TVLine reported (without confirmation from NBC) that plans were in the works for a \"continuation\" of the series:", "NBC is getting ready to put pen to paper on a revival of The Office.", "Sources confirm to TVLine exclusively that the Peacock network is eyeing a continuation of the beloved workplace comedy for the 2018-2019 season. The revival would once again be set at Dunder Mifflin’s Scranton, PA., branch, and feature a mix of new and old cast members. Steve Carell, who starred as the branch’s regional manager, Michael Scott, for seven of the comedy’s nine seasons, will not be involved in the new series. The search for a new RM/boss is said to be already underway.", "NBC declined to comment on or confirm any details of this story.", "Andreeva, Nellie.   \"NBC Boss’ Revival Wish List: ‘The Office’, ‘30 Rock’, ‘The West Wing’ & ‘ER’\"\r\n    Deadline.   3 August 2017.", "Ausiello, Michael.   \"The Office Revival Eyed at NBC for 2018-2019 Season.\"\r\n    TVLine.   18 December 2017.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]