["During an interview with Fox News' Sean Hannity, potential GOP presidential candidate Donald Trump gave his views on Iraq's oil. We checked whether the statistics he used were accurate.", "During an April 14, 2011, interview with Fox News host Sean Hannity, businessman and potential Republican presidential candidate Donald Trump said Iraq is strategically important to the United States because of its vast supply of oil.\n\nTrump said the United States spent $1.5 trillion on the Iraq War, and it could all go down the drain because the nation is so unstable.\n\n\"Iraq has the second-largest oilfields in the world. Fifteen trillion dollars worth of oil, second to Saudi Arabia. We go over, we decapitate their armies. Their armies are wiped out. They have weak armies, it is a corrupt society anyway, I mean, it's totally corrupt what is going on over there. We then leave in Iran which has fought for years back and forth, back and forth, because they were basically of equal strength, well, now they are not. Iran will come in. And they will take over Iraq, within two seconds after we leave, forget it, it is not even a contest. ...\n\n\"So, they are going to have the second-best oilfields in the world, second-biggest oilfields in the world that we made possible with our soldiers, thousands of people dead, wounded and … less importantly, $1.5 trillion. So, I said very simply. That if it is me, we take the oil. You know, in the old days, when you win a country, you win a country. Now with our stupid people, we win a country, we lose money, we lose soldiers, we lose lives, and then we leave.\"\n\nWe won’t address Trump's opinions about Iraq and the war, but we did wonder whether he was right to say that \"Iraq has the second-largest oilfields in the world (behind) Saudi Arabia.\"\n\nTrump’s comment was rather disjointed, so we had to do a bit of interpretation before looking at the statistics. (We e-mailed his office but did not hear back.)\n\nBased on the wording and context, we concluded that by referring to the \"second-largest oilfields in the world,\" Trump meant oil reserves, not production. He clearly indicates that Iraq’s fields are a valuable resource, and we concluded that the real prize is the oil remaining to be extracted, rather than what is being produced.\n\nSecond, we concluded that Trump had actually used the \"oilfields\" statistic to refer, interchangeably, to two distinct periods in time -- right before the Iraq War, and the present day. He used the same statistic in both referring to the eve of the Iraq War and also to what could happen in the near future if we abandon Iraq and Iran takes over. So we will look at the figures for 2002, the last full year before the Iraq War, and 2010, the most current statistics available.\n\nSo do the figures back up Trump’s claim? We turned to the website of the Energy Information Administration, the federal agency that compiles energy statistics.\n\nOne caveat: EIA says its estimates of energy reserves are from a variety of sources and may not be precise. Experts confirmed for us they can be inconsistent and sometimes exaggerated.\n\nThat said, let’s see what EIA says about Iraq and other countries.\n\nIn 2002, Iraq’s proven reserves of crude oil amounted to 112.5 billion barrels. That indeed ranks second to Saudi Arabia, with 261.8 billion barrels.\n\nBy 2010, Iraq’s proven reserves had risen slightly, to 115 billion barrels, but other countries passed it by. Saudi Arabia was still first, with 262.6 billion barrels, but new to the top tier were Venezuela (211.2 billion barrels), Canada (175.2 billion barrels) and then Iran (137.9 billion barrels).\n\nSo currently -- or in the near future, a time when Trump says Iran would \"take over Iraq\" within \"about two minutes after we leave\" -- Iraq ranks fifth in the world, not second, at least according to this estimate.\n\nSo where does this leave us? For the part of the comment in which Trump appeared to be talking about the eve of the Iraq War, he’s correct that Iraq had \"the second-largest oilfields in the world … to Saudi Arabia.\" But where he flashes forward to a hypothetical, near-term takeover by Iran, Trump’s statistic is off slightly, since Iraq -- while still high on the list -- has been passed by three additional countries. On balance, we rate Trump’s comment Mostly True.", "Donald Trump, interview with Sean Hannity on Fox News, April 14, 2011 (transcript accessed via Lexis-Nexis)\n\nEnergy Information Administration, proven reserves of crude oil (historical table), accessed April 22, 2011\n\nBBC, \"How much oil do we really have?\" July 15, 2005\n\nPetroleum Intelligence Weekly, \"Oil Reserves Accounting: The Case Of Kuwait,\" Jan. 30, 2006", "E-mail interview with Kyle Isakower, vice president of regulatory and economic policy at the American Petroleum Institute, April 22, 2011\n\nInterview with Jonathan Cogan, Energy Information Administration spokesman, April 22, 2011", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]