["About this rating", "In early February 2021, social media users shared a copypasta meme spreading the baseless rumor that U.S. President Joe Biden had revoked millions of dollars in funding from the United Negro College Fund (UNCF), a charitable organization that provides scholarships for Black higher education students and institutions, which former President Donald Trump had pledged to give to historically Black colleges and universities (HBCUs) over the next 10 years.", "Here is an example of the meme circulating on social media:", "We found no evidence of any truth to this claim. It appears to be a case of a rumor spread by way of copypasta — text forwarded via social media platforms by people copying and pasting it from profile to profile.", "We reached out to UNCF to ask about the meme. Lodriguez Murray, senior vice president of public policy and government affairs told us that there is no truth to it.", "Murray pointed out that UNCF is a private, nonprofit organization and as such, receives money from private donors, not the federal government. Instead, UNCF advocates the federal government. He also pointed out that federal funding is the purview of Congress, not the executive branch.", "The copypasta, Murray said, \"sounds like a lie and no one should ever use UNCF's good name or HBCUs or populations traditionally held down by systemic racism to make their erroneous case.\"", "Murray also pointed out that as part of his campaign, Biden had promised more funding for higher education, which included $70 billion for HBCUs and other institutions that serve minority students.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]