["“From one -ONE- hospital in New York. And still some people just won’t take this seriously,\" a Twitter user wrote of the video, which has been widely shared online in early April.", "Various versions of the video were shared on Facebook, Instagram and Twitter in English, but also in Spanish and French. While some users simply stated that the video was shot in New York, many suggested the images showed Lenox Hill Hospital in Manhattan.", "Others who shared it claimed the footage was shot at the Bronx Lebanon Hospital.", "One version opens with footage of a truck trailer parked in the street. Those images were shot in New York, said Margarita Oksenkrug, media relations director for Northwell Health, which runs Lenox Hill Hospital, but the pictures of body bags were not.", "She described the claim about corpses as “deeply disturbing,” at a time when New York is the US epicenter of novel coronavirus infections and COVID-19 deaths.", "“This video starts out with a shot of a trailer that is parked outside Lenox Hill Hospital which was provided to us and all New York City hospitals by the NYC Office of Emergency Management in order to provide temporary morgue space during this unprecedented health crisis that has challenged healthcare facilities across the world,” Oksenkrug told AFP by email.", "“The part of the video that details the morgue space is absolutely not  taken inside Lenox Hill Hospital’s morgue or in the trailer outside of our hospital. Our morgue is locked and guarded by security at all times. We find it absolutely appalling that someone would use this unprecedented global crisis to spread such abhorrent misinformation.”", "As of April 7, at least 80,142 people had died across 192 countries because of the virus, including 12,021 in the United States, according to an AFP tally.", "By identifying a name tag on one body bag in the second piece of footage -- “Zambrano,” the rest of the name has been left out of respect for the victim -- AFP Fact Check managed to establish that he died in Ecuador.", "A Google search for the full name displayed on the bag yields results for an obituary published on March 21, 2020 on a Facebook page for realtors (ACBIR) in Guayas province, whose capital is Guayaquil. The condolences have since been erased.", "AFP contacted ACBIR via Facebook, which answered that “all we can say is that it was one of our associates, a real estate agent. We have taken the obituary offline at his family’s request.”", "However, the Google result for the post did not disappear at the same time as the Facebook post itself.", "On Twitter, users shared photos of body bags on the floor that seemingly match the scene shown in the video. According to them, the images show the Los Ceibos hospital, in Guayaquil.", "The hospital published an official statement on April 3. “The corpses of COVID-19 patients remain in the hospital morgue, for at least 24 hours, before being transferred to refrigerated containers in the Parque de La Paz cemetery and others for their respective burials,” it said.", "As of April 7, Ecuador had 3,747 confirmed novel coronavirus cases, including 191 deaths, according to the Johns Hopkins University Coronavirus Research Center. The outbreak is hitting Guayaquil particularly hard.", "This port city on the Pacific coasts has the highest COVID-19 mortality rate in Latin America, with 1.35 deaths for every 100,000 inhabitants, according to Esteban Ortiz, a researcher at Ecuador’s University of the Americas.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]