["About this rating", "The United States Holocaust Memorial Museum at one point included a poster listing the early warning signs of encroaching fascism.", "However, the list was for sale in the museum's gift shop, not on display on the walls of the museum itself, and is no longer available at that venue.", "In January 2017, a photograph appeared to show a poster on display at the United States Holocaust Memorial Museum in Washington, D.C., listing off early warning signs of looming fascism:", "In the US Holocaust Museum.\nI'm shook. pic.twitter.com/EeuHEXWusE", "— Sarah Rose (@RaRaVibes) January 30, 2017", "The picture was shared with criticism of President Donald Trump, as people claimed that his administration had already checked off several of the boxes on the list:", "The poster is real, in the sense that it exists in a physical form; however, it was not created by the United States Holocaust Memorial Museum, nor was it on display at one of the museum's exhibits.", "You can see a price tag in the bottom right corner of the viral image. Sarah Rose, who first shared the photograph on social media, confirmed to us that she took the picture in the museum's gift shop. We reached out to the USHHM to confirm that it sold a poster showing \"early warning signs of fascism,\" and they told us that the museum no longer carries the poster.", "The list was originally created by Laurence Britt in 2003, for an article published by Free Inquiry magazine (a publication for secular humanist commentary and analysis).  While subsequent postings of the list often attribute it to \"Dr. Laurence Britt,\" the author said that he was not actually a doctor (nor did he claim to be). Britt himself said that he could be more accurately described as an amateur historian:", "I've read this thread with interest. For your information I never made a claim that I was a \"Dr.\" Someone on the internet made that ASSUMPTION when they passed on the artice. I am a retired bsunessman with a life long interst in history and current events. I have a personal book collection on these subjects of over 3000 volumes. I've contributed chapters to three books, written another, and am working on a second. I've written aproximately 25 magazine and newespaper articles on political and econmic affairs. I spent about 200 hours researching the fascism article building on a lifetime interst in the subject. My novel, \"June , 2004\" was written in 1997 and published in 1998. It was a fictional treatment of a future of fascism in America, which has turned out quite predictive of actual events since it was published.Regards, Larry Britt", "Britt created this list during George W. Bush's tenure as president of the United States. While he did not actually name Bush, he wrote in the original article that some of the early warning signs had already manifested in the United States:", "Does any of this ring alarm bells? Of course not. After all, this is America, officially a democracy with the rule of law, a constitution, a free press, honest elections, and a well-informed public constantly being put on guard against evils. Historical comparisons like these are just exercises in verbal gymnastics. Maybe, maybe not.", "While the text in the image is difficult to read, another version of the poster sold by Syracuse Cultural Workers carries the same (more legible) disclaimer:", "Laurence W. Britt wrote about the common signs of fascism in April 2003, after researching seven fascists regimes. Those were Adolf Hitler's Nazi Germany, Benito Mussolini's Italy, Francisco Franco's Spain, Antontio de Oliveira Salazar's Portual, George Papadopoulos's Greece, August Pinochet's Chile, Mohamed Suharto's Indonesia. These signs resonate with the political and economic direction of the United states under Bush/Cheney. Get involved in reversing this anti-democratic direction while you still can!", "While it is true that this poster exists, it was not displayed the United States Holocaust Memorial Museum, and has since been removed from its gift shop.", "Riese, Monica.   \"Holocaust Museum Poster on 'Warning Signs of Fascism' Goes Viral.\"     The Daily Dot.   30 January 2017.", "Britt, Lawrence.   \"Fascism Anyone?\"     Free Inquiry.   31 March 2003.", "The Right Stuff.   \"14 Warning Signs of Nothing in Particular.\"     22 January 2014.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]