["About this rating", "In October 2018, a caravan of refugees traveling from Honduras to the United States became the subject of some heated online rhetoric. This conversation was contaminated with conspiracy theories, such as the claim that these refugees were traveling by bus, train, or truck rather than by foot, and that they only walked during \"photo-ops\" for the news media.", "On 22 October 2018, Curtis Phillips posted two photographs to the \"Drawn the Swamp\" Facebook group purportedly showing this group of refugees traveling by train and bus, claiming that \"they [the news media] don't want you to see this\":", "The last sentence of this post -- \"These are not Mexican buses ...\" -- alluded to the unfounded notion that the refugees were being funded by George Soros or the Democratic party. The argument, apparently, is that liberal groups in the United States are paying for buses and trains to transport refugees to the United States border.", "The two photographs in this post are real, but they are also outdated. Neither of them captured the caravan of refugees that was traveling toward the United States in October 2018.", "The top image was taken in 2013 by photographer Eduardo Verdugo and is available via the Associated Press, where it is accompanied by the following caption:", "In this April 29, 2013, file photo, Migrants ride on top of a northern bound train toward the US-Mexico border in Juchitan, southern Mexico. Prosecutors in southern Mexico have filed a criminal complaint, Tuesday April, 2014, that alleges railway companies or their employees were complicit in crimes against migrants who ride their trains. The attorney general of the Gulf coast state of Veracruz says he filed a complaint with federal prosecutors against the Ferrosur Mexican rail line and a subsidiary of the U.S. line Kansas City Southern. (AP Photo/Eduardo Verdugo,File)", "The bottom photograph was snappped in Puebla, Mexico, in April 2018 by Jose Castanares and is available via Getty Images. Although this picture truly does capture migrants traveling via bus, it was taken after the \"Migrant Via Crucis\" caravan abandoned their plans to \"travel en masse\" to the United States:", "Central American migrants taking part in the 'Migrant Via Crucis' caravan towards the United States, arrive in Puebla, Puebla State, Mexico, on April 6, 2018 where they will attend a legal clinic with NGOs on human rights. The caravan of migrants whose trek across Mexico infuriated US President Donald Trump began breaking up on Thursday, after abandoning its plan to travel en masse to the United States. Some headed to Puebla, where the activists who organized the caravan have convened a legal clinic to help them seek asylum or visas, whether in Mexico or the US. / AFP PHOTO / JOSE CASTAÑARES (Photo credit should read JOSE CASTANARES/AFP/Getty Images)", "While these photographs are both outdated, some persons traveling with the October 2018 caravan of refugees have truly found other methods of transportation aside from walking. However, that circumstance doesn't apply to the majority of people in this caravan (which at one point consisted of more than 7,000 people), nor did the news media did not ignore this fact. Dozens of photographs from credible main stream news outlets show members of this caravan riding in cars and on the back of trucks.", "A report from CNBC noted that many of these rides were offered by sympathetic Mexicans who also provided food and water to the traveling refugees:", "The caravan's numbers have continued to grow as they walk and hitch rides through hot and humid weather, and the United Nations estimated that it currently comprises some 7,200 people, \"many of whom intend to continue the march north.\"", "However, they were still at least 1,140 miles (1,830 kilometers) from the nearest border crossing -- McAllen, Texas -- and the length of their journey could more than double if they go to Tijuana-San Diego, the destination of another caravan earlier this year. That one shrank significantly as it moved through Mexico, and only a tiny fraction — about 200 of the 1,200 in the group -- reached the California border ...", "Motorists in pickups and other vehicles have been offering the migrants rides, often in overloaded truck beds, and a male migrant fell from the back of one Monday and died.", "\"It is the responsibility of the driver, but it is very dangerous, and there you have the consequences,\" Mexican federal police officer Miguel Angel Dominguez said, pointing to a puddle of blood around the man's head.", "Police started stopping crowded trucks and forcing people to get off.", "Associated Press.   \"Over 7,000-Strong, The Migrant Caravan Headed for the US Pushes On.\"\r\n    23 October 2018.", "Stevenson, Mark.   \"Migrant Caravan Swells to 5,000 in March Through Mexico Toward U.S. Border.\"\r\n    Associated Press.   22 October 2018.", "Andone, Dakin.   \"Migrant Caravan Resumes March North from Mexico-Guatemala Border.\"\r\n    CNN.   22 October 2018.", "Andone, Dakin.   \"Migrant Caravan Resumes March North from Mexico-Guatemala Border.\"\r\n    CNN.   22 October 2018.", "Taylor, Alan.   \"Photos of the Central American Immigrant Caravan.\"\r\n    The Atlantic.   22 October 2018.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]