["The photo was published here on Facebook on September 1, 2020.", "It shows a young woman in a white hijab at a desk, alongside several uniformed officers standing in front of a blue board that reads Maharashtra Police in Hindi.", "The Hindi text overlay translates to English as: “What allows someone to ignore the dress code and sit in a police station in a Burqa?”", "The post’s Hindi caption translates to English as: “The first Muslim SP who cleared the IPS exam in Urdu. She decided to dress in Islamic dress code instead of wearing a police uniform on the very first day in office. Many congratulations to the Shiv Sena government. The contribution of the Shiv Sena in the making of Ghazwa-e-Hind is commendable.”", "SP stands for Superintendent of Police and IPS refers to the Indian Police Service.", "Shiv Sena is a regional political party that currently rules in the western Indian state of Maharashtra in coalition with the Indian National Congress and the Rashtrawadi Congress Party.", "Ghazwa-e-Hind is an Arabic term meaning “Holy War against India”. The term has long been used by militants in Pakistan against India, as noted in this report by India-based newspaper New Delhi Times.", "The photo was also shared here, here, here and here on Facebook; and here, here, here and here on Twitter alongside similar claims.", "However, the claim is false.", "A combined keyword and reverse image search on Google found this Times of India report about an International Women’s Day event hosted by Buldhana police published on YouTube on March 5, 2020.", "The video title reads: “Women’s Day: 14-year-old girl becomes DSP ‘for a day’ in Maharashtra’s Buldhana.”", "DSP refers to the police rank Deputy Superintendent of Police.", "Below is a screenshot comparison of the photo in the misleading Facebook post (L) and a keyframe from The Times of India’s video (R):", "A subsequent keyword search also found this report published on The Times of India website dated March 5, 2020.", "It reads, in part: “In a unique initiative to boost the confidence of girls and motivate them ahead of International Women’s Day, the Buldhana district administration gave an opportunity to bright girls of government schools to act as collector and superintendent of police for a day.", "“Under the same initiative, another girl, Sahrish Kanwal, from zilla parishad Urdu high school, Malkapur tehsil, took over as the district superintendent of police for a day from SP Dilip Patil.”", "Buldhana police also published photos of the event here on their now-private Twitter account on March 4, 2020.", "Below is a screenshot of an archived version of the tweet, with the identical photo highlighted in red by AFP:", "The Marathi-language tweet translates to English as: “‘I want to be a police superintendent. Today is a very important day for me’, comments from the one-day Police Superintendent Saharish Kanwal of Zilla Parishad High School, Malkapur.”", "Below is a screenshot comparison between the photo in the misleading post (L) and the photo published by Buldhana police (R):", "The event was also reported on by other local media, including the Deshdoot newspaper here.", "AFP Fact Check reported here in March 2020 that the same photo in the misleading posts also circulated in false social media reports about a Muslim woman being accepted into India's premier civil service.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]