["About this rating", "As teenage environmental activist Greta Thunberg found herself in the global spotlight in September 2019, climate-change deniers sought to discredit her with a series of false rumors and doctored photographs. Perhaps the most preposterous of these claims was that Thunberg was actually an Australian actress named Estella Renee who was delivering speeches on environmental issues not because she was concerned about the planet, but because she was a deep state crisis actor and paid to shill.", "While researching this article we found at least three variations of the \"Greta Thunberg is an actress\" claim. They are as follows:", "We'll take a deeper look at each of these items individually.", "Greta Thunberg is actually Australian actress Estelle Renee?", "Several social media users have claimed that Thunberg is actually an Australian actress named Estelle Renee. Facebook user Jack A. Schulman, for instance, wrote:", "Aspiring Actress impersonates crying child climate activist at UN, impersonator is a sham. Screams \"How dare you!\" from acting class.", "Estella Renee is a very talented shakespearian actress from Australia. She can do Scandinavian accents. She can break down and cry. She can scream \"How dare you!\". She deserves an Academy Award not a Nobel for impersonating Heidi looking Greta Thunberg, a fictional Character before the UN yesterday, a fake climate activist, a child actor age 15 and 1/2 screaming \"How dare you!\" straight out of \" Streetcar named Desire! \".", "Otherwise, she's a sham and a fraud! Her publicist refused to respond to our calls, but NY customs identified her as Estrella Renee, here \"to see the sights\" at her entry from Australia. Her adult accompaniment signed her into her hotel room as Greta Thungren, but we confirmed she is Estelle Renee. We turned over her illegal false identity to DHS who has confirmed her dual identity, but is still investigating. They are not sure impersonation is a crime.", "Yet, what a fraud!!", "This claim is nonsensical.", "Thunberg didn't appear out of thin air in September 2019 to deliver a speech to the United Nations. She's been on the public radar since at least September 2018 when she started staging climate protests in Sweden. Thunberg has also been nominated for numerous awards (including the Nobel Peace Prize), has met with several world leaders, and took a highly publicized voyage across the Atlantic Ocean.", "Furthermore, we know the identity of Thunberg's parents, Svante Thunberg and Malena Ernman, as well as her grandfather, Olof Thunberg, and her sister, Beata.", "In other words, Greta Thunberg is not a \"fictional character.\" Her journey to becoming a global environmental activist has been well documented.", "Greta Thunberg has an IMDB page. Is this is proof that her environmental activism is disingenuous?", "A slightly less far-fetched version of this claim holds that Thunberg is listed as an \"actress\" on her IMDB page. While this is true, many have shared this screenshot as if it was somehow damaging to Thunberg's reputation as an environmental activist:", "Thunberg has one acting credit to her name. She lent her voice to a short film titled \"Ave Paraíso\" that was released in Spain in 2019. The remainder of her IMDB page simply lists appearances she's made on television programs (such as \"The Daily Show\") or in environmental documentaries where she is credited as herself.", "The fact that Thunberg has an IMDB page is often shared along with the insinuation that her environmental beliefs are not sincere. However, it should be noted that being an actor does not automatically disqualify someone from having an opinion, being an activist, or having a political career. Oscar-winner Leonardo DiCaprio, for instance, often lends his voice to environmental causes. Arnold Schwarzenegger and Ronald Reagan were both actors before embarking on political careers. Even U.S. President Donald Trump is listed as an \"actor\" on his IMDB page:", "The website Michael Smith News noted one additional detail about Thunberg's IMDB page that seemingly hinted at the notion that she was a paid actress looking for new gigs. The website wrote that \"you can talk to her agent if you'd like to book her for acting work\" and then linked to an IMDB Pro link. However, it doesn't appear that Michael Smith News has access to IMDB Pro. When we checked Greta's listing on IMDB Pro, we found no listing for Thunberg's alleged agent.", "Does the viral video of a young climate protester crying feature actress Estelle Renee?", "Thunberg wasn't the only environmental activist to be accused of being an actor. The websites TeaParty.org, The Gateway Pundit, Joe for America, and the aforementioned Michael Smith News all published articles about how it was \"all a hoax\" and that the \"little girl seen crying in viral video\" at the Global Warming rally was really a child actress, \"a prop for the left,\" named Estelle Renee:", "The international left used innocent children last weekend to push their climate change extremism.", "Tens of thousands of children were let out of school so they could go protest against capitalism and global warming.", "As we reported on Monday — One terrified little girl in Australia couldn’t even talk to reporters about climate change without crying...", "...But that was not your typical emotional teen. The girl in the video is an Aussie child actress.", "These articles are referring to a viral video from May 2019 of a young protester who broke down in tears while talking to reporters about climate change. The video in question can be seen in the second of the following tweets:", "This young girl is so terrified about \"climate change\" she can’t even speak to a journalist about her fears without breaking down in tears. So sad.", "The Marxists have gotten their hands on our children and we have allowed it to happen.#ClimateStrike pic.twitter.com/YN2xAjGvIj", "— Oh boy what a shot (@ohboywhatashot) September 20, 2019", "The young protester in this video, whose real name is Estella Brasier, does have a profile on the talent website Star Now. However, these websites provided no evidence that this person was paid to appear at this protest or to \"act\" that they were concerned about the environment. And as we noted above, the fact that a person has acted or is an actor does not disqualify them from having personal beliefs.", "Brasier's father spoke to Maarten Schenk of the debunking website LeadStories about this rumor:", "The events of that day are in the public domain and were on every TV station. The ideas and concerns expressed by Estella depicted in that video are entirely genuine, not paid for, she was not acting...", "...Estella was not expecting to be interviewed by the media that day: it could have been her, it could have been anyone else. She was just standing closest to the cameras.", "It is possible to be both worried about climate-change and a child actress at the same time.", "Hope, Mat.   \"Attacks on Greta Thunberg Come from a Coordinated Network of Climate Change Deniers.\"\r\n    Teen Vogue.   23 September 2019.", "Zraick, Karen.   \"Greta Thunberg, After Pointed U.N. Speech, Faces Attacks From the Right.\"     New York Times.   24 September 2019.", "Cohen, Ilana and Jacob Heberle.   \"Youth Demand Climate Action in Global School Strike.\"\r\n    Harvard Political Review.   19 March 2019.", "Cohen, Trace.   \"What to Know About Greta Thunberg, the Teen Climate Activist Sparking Change.\"     Complex.   24 September 2019.", "Michael Smith News.   \"The Young Actress Greta Thunberg's IMDB Page Lists Her Acting Credits With Contact Details For Her Agent.\"\r\n    25 September 2019.", "Donovan, Terrence.   \"HOAX UPDATE: Little Girl Crying In Viral Video At Global Warming Rally Is A Child Actress – Just A Prop Used By Leftists.\"\r\n    Joe For America.   24 September 2019.", "Teaparty.org.   \"It Was All A Hoax: Little Girl Seen Crying in Viral Video at Global Warming Rally Is a Child Actress – She Was Just a Child Prop for the Left.\"\r\n    24 September 2019.", "Hoft, Jim.   \"It Was All A Hoax: Little Girl Seen Crying in Viral Video at Global Warming Rally Is a Child Actress – She Was Just a Child Prop for the Left.\"\r\n    The Gateway Pundit.   24 September 2019.", "Correction [25 September 2019]: The original version of this article erroneously concluded that the \"crying protester\" was not the same \"Estella Renee\" with a profile on Star Now. Further research showed that while a real girl by the name of Estella Brasier did have an acting profile on Star Now, she was not paid to appear at this protest.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]