["About this rating", "A screenshot purportedly showing a tweet posted by conservative political pundit Ann Coulter started recirculating on social media in September 2018.  The renewal of interest in the tweet was driven by a controversy involving Supreme Court nominee Brett Kavanaugh and Christine Blasey Ford, a Palo Alto University professor who accused Kavanaugh of sexually assaulting her while they were both high school students.", "Coulter's tweet controversially declared: \"Hmmm. How about: Our REAL problem is that many men have no choice but to rape because they have no opportunities to date attractive women.\"", "This message was indeed posted on Ann Coulter's official Twitter account, but it was not written in September 2018 in response to the accusations against Brett Kavanaugh, nor was it posted as a standalone message.", "This tweet was actually published in January 2017 in response to one posted by Luis Garcia, a producer with the Al Jazeera news outlet, which was in turn was posted in response to a tweet issued by former Mexican president Vicente Fox Quesada about how Mexico was never going to pay for President Trump's proposed border wall:", "‏", "Garcia responded with a series of tweets explaining \"our real problem,\" the first of which stating that \"Our REAL problem is that many Mexicans have no choice but to go illegally to USA because they have no opportunities at home\":", "Coulter's viral tweet was intended as a comeback to Garcia's statement, aimed at mocking the logic of his argument (rather than justifying rape):", "Hmmm.  How about: Our REAL problem is that many men have no choice but to rape because they have no opportunities to date attractive women. https://t.co/5EmQlDDvMs", "— Ann Coulter (@AnnCoulter) January 26, 2017", "Coulter's tweet drew its fair share of criticism back when it was originally posted:", "@Luis3RG @VicenteFoxQue ridiculous to compare the lottery of where one is born to a committing rape because dude can't get laid.", "— Jason Fenley (@jaypfenley) January 26, 2017", "just when u think it's not possible to hate Ann coulter even more than you do, she throws a rape\"joke\" in for good measure. Yuck", "— cats like candy (@cats_like_candy) January 28, 2017", "And at least one commenter presciently anticipated the current brouhaha:", ".@AnnCoulter don't you know someone will take this out of context", "— Al Berg ?? (@alecberg) January 26, 2017", "Cresci, Elena.   \"How former Mexican president Vicente Fox uses Twitter to troll Trump\"\r\n    The Guardian   26 January 2017.", "Weise, Elizabeth.   \"Who is Christine Blasey Ford, the Professor Accusing Brett Kavanaugh of Assault?\"\r\n    USA Today   17 September 2018.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]