["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "While Democrats nationwide have embraced sanctuary cities, Missouri Sen. Claire McCaskill is touting the opposite on the campaign trail.", "On Sept. 10 in a question-and-answer session at Truman State University, the senator said she \"voted to defund sanctuary cities\" when asked whether she supported them, according to a transcript by the Columbia Daily Tribune.", "She then talked about the importance of cooperating with law enforcement but said she empathized with children and parents separated at the border.", "So-called \"sanctuary cities\" are jurisdictions that have policies limiting cooperation with federal immigration enforcement particularly when concerning undocumented immigrants.", "But McCaskill, who is defending her seat against state Attorney General Josh Hawley, has been attacked by many conservative groups for helping sanctuary cities.", "So who is telling the truth?", "This isn’t the first time McCaskill expressed her opposition to sanctuary cities. In response to an ad by One Nation, her campaign released a fact check of its own in August, stating she \"voted to crack down on sanctuary cities.\"", "It referenced the St. Louis Post-Dispatch, which reported in February that \"McCaskill was one of four Democrats who, this month, voted with Republicans to clamp down on so-called ‘sanctuary cities’ during a string of failed immigration votes in the Senate.\"", "PolitiFact looked into the specific vote in February as well as others, and we found six votes which can be grouped into three types.", "•  One vote on the \"cloture motion\": This is the vote just mentioned, where on Feb. 15, McCaskill voted yes on the cloture motion for an amendment that would not allow sanctuary jurisdictions to receive various economic grants. A \"cloture motion\" is a move to end the debate and hold the final vote. This amendment failed to get enough votes to do that.", "• Two votes on \"cloture on the motion to proceed\": This move essentially puts the bill onto the floor for debate and consideration in the first place. In October 2015 and July 2016, McCaskill voted no on this move for two bills that would prohibit sanctuary cities from receiving certain grants. Both bills failed to get past this step.", "• Three votes tabling an amendment: In 2007, 2008 and 2009, McCaskill voted to table three amendments sponsored by former Sen. David Vitter of Louisiana that would prohibit funding for sanctuary localities to develop their community policing. By definition, tabling legislation is to simply postpone consideration. But tabling legislation also effectively kills it. All three of Vitter’s amendments were tabled.", "It should be noted that all six votes were procedural, and none were explicitly on the actual issue itself. The question is now whether these votes should count as voting for or against an issue.", "Donald Wolfensberger, director of the Congress Project at the Woodrow Wilson International Center for Scholars and a former Republican staff director of the House Rules Committee, said that ultimately these are just procedural votes.", "But, he added, \"procedures often help determine substantive outcomes.\"", "It’s along these lines that political science professor Gregory Koger of the University of Miami argues the procedural votes mentioned, by proxy, count as votes on the actual issue.", "\"The key question is what these votes mean in context,\" said Koger. \"What do senators think they are voting on? What are the consequences of a ‘yea’ or ‘nay’ vote?\"", "Wolfensberger said procedural votes can be merely partisan rather than substantive in some cases. In the House, members of the minority party often try to delay the process even though in the end, they end up voting with the majority party.", "\"In deciphering procedural votes, one should look at what the legislator says, not just what they do,\" he said.", "It is clear, regarding the February 2018 vote, that McCaskill intended to defund sanctuary cities, citing this stance because of the murder of a Missouri man by a person staying in the country illegally.", "But what about the other five votes that seemed to be against defunding those cities? What was her intent back then?", "In a 2017 Joplin Globe article, McCaskill was reported as saying that she voted against defunding sanctuary cities because it would deter immigrants from reporting crimes.", "PolitiFact Missouri also reached out to the McCaskill campaign to ask for the reasoning behind those five votes. The campaign cited the community policing funding cuts and how law enforcement was against them as a reason for one of the votes.", "The campaign did not outrightly deny her past votes against defunding, saying that \"how she voted on other proposals does not change that fact\" she voted to defund sanctuary cities.", "McCaskill said she \"voted to defund sanctuary cities.\"", "The vote her campaign references, despite being procedural, had the proxy effect of voting for the defunding, experts point out, especially considering the context where McCaskill has explicitly stated she takes that stance.", "The rest of her voting record, however, is against defunding sanctuary cities, and her intent back then supports the idea that those votes were substantive, too. So groups who attack her on this stance have a point.", "In short, she voted most recently to defund, but other votes show her defending sanctuary cities.", "We rate this statement Half True.", "NumbersUSA, Sen. Claire McCaskill Voting Record, Oct. 4, 2018.", "Missouri Rising Action, \"Claire Flip-Flops on Sanctuary Cities\", Feb. 16, 2018.", "The Joplin Globe, \"McCaskill stresses bipartisan work\", Aug. 22, 2017.", "McCaskill for Missouri, press release, Aug. 31, 2018.", "Columbia Daily Tribune, \"McCaskill answers questions at Truman State University,\" Sept. 16, 2018.", "St. Louis Post-Dispatch, \"How Missouri, Illinois senators voted on immigration bills that failed,\" Feb. 16, 2018.", "Email interview with Donald Wolfensberger, director of the Congress Project at the Woodrow Wilson International Center for Scholars, Oct. 2, 2018.", "Email interview with Gregory Koger, University of Miami political science professor, Oct. 2, 2018.", "Email interview with McCaskill campaign, Oct. 3, 2018.", "U.S. Senate, roll call vote on the cloture motion for S.Amdt. 1948 to S.Amdt. 1959 to H.R. 2579, Feb. 15, 2018.", "U.S. Senate, roll call vote on cloture on the motion to proceed for S. 2146, Oct. 20, 2015.", "U.S. Senate, roll call vote on cloture on the motion to proceed for S. 3100, July 6, 2016.", "U.S. Senate, roll call vote on motion to table  S.Amdt. 3277 to H.R. 3093, Oct. 16, 2007.", "U.S. Senate, roll call vote on motion to table S.Amdt. 4309 to S.Con.Res. 70, Mar. 13, 2008.", "U.S. Senate, roll call vote on motion to table  S.Amdt. 2630 to H.R. 2847 , Oct. 7, 2009.", "PolitiFact, \"Ohio TV ad misleads in attack on Mike DeWine about immigration,\" Mar. 23, 2018.", "PolitiFact, \"Barack Obama says ‘Democrats and Republicans’ in the Senate ‘acted responsibly by voting to keep our government open’\", Sept. 30, 2013.", "PolitiFact, \"Gov. Rick Scott attack mischaracterizes vote Sen. Bill Nelson took in 2015,\" May 4, 2018.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]