["A satirical article claiming that former US leader Barack Obama plans to run for president in Kenya - his father’s birth country - has been shared tens of thousands of times, with some users taking the false story at face value. AFP has found no evidence of Obama making such an announcement.", "The original story was first published on January 14, 2020 on the satirical website World News Daily Report, which ran it with the headline “Barack Obama announces intention to run as president of Kenya in 2021” and a picture of him using a megaphone in the middle of an African crowd.", "The site also features a disclaimer stating: “WNDR assumes… all responsibility for the satirical nature of its articles and for the fictional nature of their content. All characters appearing in the articles in this website – even those based on real people – are entirely fictional and any resemblance between them and any persons, living, dead, or undead is purely a miracle.”", "A search on Crowdtangle, a social media analysis site, reveals that the story was shared in multiple Facebook posts shortly after it was first published:", "While many posting the story made clear in their post that this was satire, others appeared to share it as genuine news:", "The comments in the post above suggest that some users seemed to take the claim at face value.", "The story was also shared as genuine by several online news accounts including Naija Network News, which has more than 34,000 followers:", "Some users like this one attributed the article to WNDR at the very end of their posts but did not specify that this was a satirical story or website.", "Where is the Obama picture from?", "WNDR’s picture showing Obama talking to a crowd was taken in 2006 when he visited Kenya as a US senator. A reverse image search located it on Getty Images and revealed that it was captured by a Chicago Tribune photographer in Nairobi’s slum, Kibera.", "Could Obama run for president in Kenya?", "The United States’ first black president is not on record announcing his intention to run.", "According to Kenyan law, a person qualifies to run for the presidency if they are a citizen by birth and don’t hold dual nationality. Since Obama was born in Hawaii and is a US national, he would not be able to vie for the seat.", "Several years before taking office, current US President Donald Trump promoted the falsehood that Obama was not born in the United States but Kenya, where his father was from. Trump repeatedly cast doubt on whether Obama was a natural-born US citizen - and therefore qualified to be head of state.", "Trump grudgingly acknowledged late in his 2016 presidential campaign that Obama was born in the United States, as reported in this AFP story.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]