["About this rating", "The Michigan senate amended a portion of the state penal code dealing with animal cruelty without removing old, unenforceable language that criminalizes  sodomy.", "Michigan has passed a new law banning oral and anal sex.", "On 28 January 2016, the Michigan state senate passed SB219, a bill from Republican senator Rick Jones (commonly known as \"Logan's Law\") which amended a portion of the Michigan penal code pertaining to animal cruelty (primarily to crack down on the breeding, sale, and use of animals for \"fighting and baiting\" activities such as dogfights), by preventing anyone convicted of animal abuse from owning another animal for five years:", "A person shall not knowingly do any of the following:", "(a) Own, possess, use, buy, sell, offer to buy or sell, import, or export an animal for fighting or baiting, or as a target to be shot at as a test of skill in marksmanship.", "(b) Be a party to or cause the fighting, baiting, or shooting of an animal as described in subdivision (a).", "(c) Rent or otherwise obtain the use of a building, shed, room, yard, ground, or premises for fighting, baiting, or shooting an animal as described in subdivision (a).", "(d) Permit the use of a building, shed, room, yard, ground, or premises belonging to him or her or under his or her control for any of the purposes described in this section.", "(e) Organize, promote, or collect money for the fighting, baiting, or shooting of an animal as described in subdivisions (a)\n to (d).", "(f) Be present at a building, shed, room, yard, ground, or premises where preparations are being made for an exhibition described in subdivisions (a) to (d), or be present at the exhibition, knowing that an exhibition is taking place or about to take place.", "(g) Breed, buy, sell, offer to buy or sell, exchange, import, or export an animal the person knows has been trained or used for fighting as described in subdivisions (a) to (d), or breed, buy, sell, offer to buy or sell, exchange, import, or export the offspring of an animal the person knows has been trained or used for fighting as described in subdivisions (a) to (d). This subdivision does not prohibit owning, breeding, buying, selling, offering to buy or sell, exchanging, importing, or exporting an animal for agricultural or agricultural exposition purposes.", "(h) Own, possess, use, buy, sell, offer to buy or sell, transport, or deliver any device or equipment intended for use in the fighting, baiting, or shooting of an animal as described in subdivisions (a) to (d).", "However, the law also applies to acts of bestiality, and acts of both bestiality and sodomy are addressed by the same portion of the state penal code.  Thus this bill to amend a section the Michigan Penal Code pertaining to animal cruelty drew national public notice due to its inclusion of a sentence establishing it as a felony for anyone to \"commit the abominable and detestable crime against nature either with mankind or with any animal\":", "This passage prompted spurred dozens of publications to pen articles reporting that the Michigan senate had passed a bill that outlawed sodomy (i.e., any sexual act other than vaginal intercourse between opposite-sex partners). Other publications took the rumor a step further and maintained that there was a new law in Michigan forbidding anal and oral sex. When the rumor hit social media, it grew even more exaggerated, with some posts claiming that adults engaging in anal sex would be sentenced to prison for 15 years.", "While it is true that the Michigan Senate recently passed a bill that included language referring to a person who commits \"crimes against nature with mankind,\" several misconceptions about this piece of legislation have been widely spread:", "First, this isn't a new law. The Michigan Penal Code was first written in 1931, and it included the language in question long before the January 2016 senate vote of amending portions related to animal cruelty. Second, while this bill did pass the state senate by a 38-1 vote, it has not yet been passed by the state house of representatives or signed into law by the governor. Finally, in 2003 the Supreme Court struck down Texas' sodomy law in 2003 and invalidated similar sodomy laws in 13 other states. Although several states (including Michigan) still have laws on the books criminalizing sodomy, these laws cannot be enforced.", "GOP Senator Rick Jones, one of the sponsors of SB219, said that the language referring to \"crimes against nature\" was purposefully left intact in order to give the bill a chance to pass through the senate:", "Jones [said] that a blogger in Texas distorted the bill to make it sound like it applies to people. That information was then circulated around social media. He adds that sodomy is already illegal under current Michigan law and that his bill simply added specific language meant to protect animals.", "\"The minute I cross that line and I start talking about the other stuff, I won't even get another hearing. It'll be done. Nobody wants to touch it. I would rather not even bring up the topic, because I know what would happen. You'd get both sides screaming and you end up with a big fight that's not needed because it's unconstitutional.\"", "\"If we could put a bill in that said anything that's unconstitutional be removed from the legal books of Michigan, that's probably something I could vote for. But am I going to mess up this dog bill that everybody wants? No.\"", "Jones says his legislation does not change current law as far as sodomy between people.", "The Michigan Penal Code still contains language stating that a person who commits \"crimes against nature with mankind\" is guilty of a felony punishable by up to 15 years in prison. While this language is outdated and in direct opposition of the Supreme Court's Lawrence v. Texas ruling, it still requires the efforts of lawmakers to be removed. When the Michigan Senate passed SB219, the senators opted for reasons of practicality to focus on implementing stronger animal cruelty laws and ignore language referring to a unenforceable, decades-old sodomy law.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]