["By Eugene Kiely", "Posted on December 23, 2019", "Posts circulating on Facebook falsely claim that people posing as “officials” from the “Department of Home Affairs” are going door-to-door to confirm “that everyone has a valid ID” for the 2020 census. The Census Bureau says this is a hoax.", "In recent days and weeks, Facebook users have flagged several suspicious posts that purport to share an “Urgent Community Notice” for “USA residents” about the “upcoming census.” The bogus notice says that would-be robbers posing as “officials” from the “Department of Home Affairs” are going door-to-door to confirm “that everyone has a valid ID” for the 2020 census.", "The Census Bureau says this is a hoax.", "There is no “Department of Home Affairs” in the United States government, and there is no “valid ID” required to take the 2020 census.", "As part of its efforts to combat misinformation about the 2020 census, the U.S. Census Bureau has created a web page to dispel rumors and an email address (rumors@census.gov) for people to report suspicious social media content. On its website, the bureau says of the “Urgent Community Notice” for U.S. residents: “This is a hoax that originated overseas.”", "The rumor apparently originated in South Africa, which does have a Department of Home Affairs. On Sept. 2, the South African agency issued a statement on Twitter warning its residents of a “social media scam.”", "The scam now targeting U.S. residents is particularly insidious because it leaves the mistaken impression that U.S. residents may need “a valid ID” for the 2020 census. That is false, and potentially could discourage U.S. residents from participating in the decennial census, which counts every person living in the U.S. regardless of legal status and citizenship.", "“The truth is, census employees are in neighborhoods across the country as they prepare for next year’s census,” the Census Bureau says. “However, census employees are not asking the public for any identification.”", "The Census Bureau goes on to say: “Besides not asking the public for any identification, the Census Bureau will never ask you for your Social Security number, your bank account information, your credit card numbers, or for money and/or donations during the 2020 Census.”", "People with questions about the identity of census takers or general questions about the survey can call the bureau at 800-923-8282.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "Republic of South Africa, Department of Home Affairs (@HomeAffairsSA). “Media statement: Social Media scam alert.” 2 Sep 2019.", "U.S. Census Bureau. “Fighting 2020 Census Rumors.” Undated. Accessed 23 Dec 2019.", "U.S. Census Bureau. “Checking IDs for the Census?” Undated. Accessed 23 Dec 2019.", "U.S. Census Bureau. “What is the Census?” Undated. Accessed 23 Dec 2019.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]