["Several photos from inauguration day show President Joe Biden with Secret Service agent David Cho, a Korean American tapped to lead the president’s security detail.", "Some social media posts sharing these photos have wrongly described Cho as \"Biden’s Chinese handler.\"", "\"This Chinese ‘handler’ has been following Biden around all day,\" one post said. \"Literally right next to him everywhere he goes.\"", "These posts were flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Cho is identified as a Secret Service agent in the caption of this Associated Press photo showing him Biden and first lady Jill Biden walking to the White House.", "He’s known as a \"perfectionist supervisor,\" according to the Washington Post, and he was second-in-command of the presidential detail during the Trump administration.", "In 2019, the homeland security secretary awarded Cho a gold medal for exceptional service for his role arranging the security for then-President Donald Trump’s historic visit to North Korea.", "Cho was recognized for \"tireless and direct participation in high-level negotiations with the leaders of the Democratic People’s Republic of Korea,\" including planning all security details for Trump’s trip to that country, according to the Department of Homeland Security.", "We rate claims that Cho is a \"Chinese handler\" Pants on Fire.", "Facebook post, Jan. 21, 2021", "Facebook post, Jan. 21, 2021", "Facebook post, Jan. 21, 2021", "NBC News, Why Koreans pointed out two ‘Joes’ at inauguration, Jan. 21, 2021", "The Washington Post, Secret Service to make change to presidential detail to bring on agents who worked with Biden, Dec. 30, 2020", "Department of Homeland Security, The secretary’s exceptional service gold medal 2019, 2019", "Fox News, Secret Service adds former Biden agents to his new protection detail after worry over pro-Trump personnel, Dec. 31, 2021", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]