["A new Florida Democratic Party TV ad accuses Gov. Rick Scott of siding with big business rather than public education.", "\"He didn’t side with students and parents when Rick Scott cut education funding by over a billion dollars,\" the narrator says in the ad, which began airing in the Tampa, West Palm Beach and Orlando markets in early July. \"Working and middle-class families? Nope. Not on their side when Scott’s cuts forced tuition increases at 11 Florida universities. Why would he do it? Whose side was Rick Scott on? Scott cut education to pay for even more tax breaks for big, powerful, well-connected corporations. With his education cuts and tuition increases, Rick Scott’s not on your side.\"", "We’ve already fact-checked claims about education cuts and tuition in the gubernatorial battle between Scott and former Gov. Charlie Crist, the Democratic frontrunner.", "Here we will fact-check the claim that \"Scott cut education to pay for even more tax breaks for big, powerful, well-connected corporations.\"", "Education cuts", "Scott entered office in 2011 facing a $3.6 billion shortfall which led him and the Legislature to cut K-12 by $1.3 billion. (Scott actually wanted a bigger cut.)", "After facing a backlash, Scott sought increases in later fiscal years.", "The amount of K-12 spending approved by the Legislature this year will be a record in terms of total dollars. However, per-pupil spending is less than the amount in 2007-08, when Crist was governor.", "In 2012, the state cut about $304 million for universities, under the assumption that they would increase tuition by as much as 15 percent. The following year, lawmakers restored that money. This year, the Legislature and Scott lowered that cap to 6 percent and eliminated it for all but University of Florida and Florida State University.", "Business tax breaks", "So that’s how Scott handled education spending. What about tax breaks for corporations?", "A spokesman for the Florida Democratic Party pointed to a Miami Herald article about business tax breaks approved in 2012. However, it’s worth noting that those tax breaks benefited a broad array of businesses -- not only ones that were big, powerful or well-connected, as the ad claims.", "\"From shop owners, who know little about Tallahassee politics, to the powerful business lobby that thought up many of carefully crafted tax breaks, the Legislature this year proved a friendly place,\" the Herald wrote.", "This business tax relief totaled about $750 million in the first year, and more than $2.5 billion over the next three years, the Herald reported. That fit in line with Scott’s campaign promises to expand employment as Florida continued to bounce back from the recession.", "The cuts included a $50,000 exemption to the corporate income tax and tax breaks for manufacturing equipment and for private planes.", "The Herald cited a couple of examples of businessmen who would benefit, including Frank Stronach, a billionaire horse breeder whose Gulfstream Park racetrack casino had a team of nine lobbyists in Tallahassee.", "\"He is likely to benefit from corporate tax cuts for his businesses and a $1.2 million tax break carved out specifically for a slaughterhouse he is building near Ocala,\" the Herald wrote.", "The Orlando Sentinel cited other beneficiaries, including big telecom companies that won tax breaks and a Palm Beach Gardens-based engine manufacturer that got a sales tax break that could save it $900,000 a year.", "Did Scott cut money for schools to bail out corporations?", "Finally, is there any connection between the cuts in education spending and the tax breaks Scott implemented?", "The K-12 education cut did occur in 2011, and so did the university cut in 2012 -- the same year the tax breaks passed.", "Joshua Karp, a spokesman for the Florida Democratic Party, told PolitiFact Florida that the two are inevitably linked. \"If you increase funding in one part of general revenue, you inevitably have to cut from somewhere else,\" he said. \"He could have chosen to put education first and found other places to cut.\"", "Independent analysts see greater room for nuance.", "The chronology of the cuts makes it difficult to draw any cause-and-effect conclusions.", "\"I don’t think it is a one-for-one comparison, in that they didn’t stand around saying we will cut education to give these tax cuts,\" said Kim Rueben, state finance expert at the Urban Institute, a Washington, D.C.-based think tank. \"But given balanced budget rules and a need to pay for all spending with revenues, the folks who passed the tax cuts must have had some idea that some spending would need to be cut.\"", "Kurt Wenner -- vice president of tax research at Florida TaxWatch, a group that takes a critical look at state spending with an eye toward long-term savings -- also saw a gray area.", "\"At best, it is an oversimplification of a very complex budget process to say education funding was reduced to pay for tax cuts,\" Wenner said. \"There are so many factors that affect funding levels. The 2012 Legislature also swept $542 million from trust funds into general revenue. It could be argued that this more than paid for any tax cuts. Conversely, the Legislature, wisely, chose to significantly increase reserves that year. That had a much bigger impact on available funding than the tax cuts did.\"", "Our ruling", "A TV ad by the Florida Democratic Party says Scott \"cut education to pay for even more tax breaks for big, powerful, well-connected corporations.\"", "Scott and the Legislature did cut K-12 in 2011 and money for universities in 2012. And Scott and the Legislature implemented a series of business tax breaks in 2012.", "However, the ad exaggerates when it focuses attention on tax breaks for \"big, powerful, well-connected corporations.\" Some such companies benefited, but so did many other types of businesses. And the question of whether the tax cuts and the education cuts had any causal relationship is murkier than the ad lets on.", "The statement is partially accurate but leaves out important details or takes things out of context, so we rate this claim Half True.", "Florida Democratic Party, \"Why?\" TV ad, July 1, 2014", "Miami Herald, \"Florida tax cuts benefit businesses,\" March 12, 2012", "Orlando Sentinel, \"Legislature OKs $830 million tax break,\" March 9, 2012", "Orlando Sentinel, \"Business lobby won many battles, but lost a few too,\" March 19, 2012", "PolitiFact, \"Scott says all 4-year state colleges offer $10,000 degrees,\" March 4, 2014", "PolitiFact, \"Cost of prepaid college tuition nosedived under Scott, says Republican Party,\" June 25, 2014", "PolitiFact, \"Gov. Scott claims he ‘cut taxes 40 times for Florida families,’\" May 21, 2014", "PolitiFact, \"Charlie Crist says ‘Rick Scott tried to slash school funding by $3.3 billion,’\" March 27, 2014", "PolitiFact, \"Rick Scott says his K-12 education budget proposal is highest in Florida’s history,\" Jan. 29, 2014", "PolitiFact, \"Charlie Crist says Rick Scott cut K-12 by $1.3 billion in his first year and higher ed by $300 million in his second,\" Nov. 11, 2013", "PolitiFact, \"Rick Scott ‘increased tuition at our state colleges and universities by double-digits,’ Florida Democratic Party says,\" Aug. 2, 2013", "PolitiFact, \"Rick Scott says ‘every Florida teacher gets a pay raise’ with new budget,’\" April 29, 2013", "PolitiFact, \"Rick Scott says he is adding $1 billion in ‘new’ education funding,\" Jan. 10, 2012", "PolitiFact, Education cuts show up in Rick Scott's budget, Feb. 8, 2011", "Interview, Joshua Karp, Florida Democratic Party spokesman, July 1, 2014", "Interview, Jackie Schutz, Gov. Rick Scott campaign spokesman, July 1, 2014", "Interview, Kurt Wenner, vice president Florida TaxWatch, July 1, 2014", "Interview, Kim Rueben, senior fellow Tax Policy Center at the Urban Institute, July 2, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]