["A set of images has been posted on social media with the claim that these represent the submerged city of Dwarka on the western coast of India. “Shri Kishna’s Dwarka, The sunken city in Gujarat. As described in the Mahabharata. It is real yet the Christian world says there is no proof!”, reads the message posted along with the photos. Dwarka is a popular pilgrimage destination for devotees of Lord Krishna, and is considered to have been the kingdom of Krishna in ancient times.", "Shri Kishna’s Dwarka, The sunken city in Gujarat. As described in the Mahabharata. It is real yet the Christian world says there is no proof! #JaiShriKrishna pic.twitter.com/hQGDXzLC51", "— JIXSA (@jiks) September 30, 2019", "The above tweet has been retweeted over 2400 times since it was posted on September 30. There are four images showing elaborate sculpture and architecture, three of which are underwater according to these pictures. Alt News found that three of these pictures had been published by Postcard News in a write-up of January 2018, on the ancient city of Dwarka.", "Alt News found that these photos are unrelated to Dwarka. Let us take a look at each of them.", "Alt News reverse-searched the above image, and the majority of the results claimed that the photograph pertains to the lost city of Heraclieon of the Egyptian empire. However, the image is from the Neptune Memorial Reef. The Neptune Memorial Reef is an artificially created reef east of Florida, USA. The image had been posted on Facebook in 2012.", "Just a friendly reminder that we are offering a chance for those interested to conduct surveys, clean plaques, take…", "Posted by Neptune Memorial Reef on Thursday, March 22, 2012", "According to Boom, which contacted the Neptune Memorial Reef, the image of the underwater lion is indeed from there.", "On reverse-searching this image, Alt News found different claims attached to it, ranging from Dwarka to Mahabalipuram. However, several posts claimed that the picture is from Tranquebar in Tamil Nadu. On the basis of this information, Alt News found a picture on Flikr, posted by a user in April 2006.", "It was titled ‘After the Tsunami’ and captioned, “Mind of the observer boggles at this sight. After the Tsunami, in a rural stretch of the Eastern Coramandel Coast of India, of what used to be a Danish Colony some 400 years back. Tarangambadi or Tranquebar (to the Danes), Tamil Nadu, India.” This establishes that the image is from Tamil Nadu and not Dwarka, Gujarat.", "A reverse-search of the above image on Google suggested that the picture is from Jamaica in the Caribbean. However, this image too is from the Neptune Memorial Reef in Florida, USA. Similar images are readily available on its website. One such still is posted below. These photographs are also available on a blog about the Neptune Memorial Reef.", "Neptune Memorial Reef has also posted a video on YouTube, showing the underwater creation at the site.", "Alt News reverse-searched the above image and found several results which suggested that it pertained to the legendary lost city of Atlantis, a mythical island first mentioned in the works of Plato.", "On further probing, Alt News found that the underwater image was taken off the coast of Mexico. An article published in Daily Mail titled, ‘Professional mermaid goes tail to tail with giant manta ray five times her size in underwater dance off the coast of Mexico‘, contains a video, in which this still can be seen at 1:40 minutes. The article is of 2013. The underwater shoot was focused on manta rays.", "It may be reiterated that these four images are not from the sunken city of Dwarka. Two of the photographs are from Florida, USA whereas one of the images is from Tamil Nadu.", "Donate Now", "Arjun Sidharth is a writer with Alt News. He has previously worked in the television news industry, where he managed news bulletins and breaking news scenarios, apart from scripting numerous prime time television stories. He has also been actively involved with various freelance projects. Sidharth has studied economics, political science, international relations and journalism. He has a keen interest in books, movies, music, sports, politics, foreign policy, history and economics. His hobbies include reading, watching movies and indoor gaming.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]