["About this rating", "A 4 October 2016 debate between vice presidential candidates Mike Pence and Tim Kaine led to renewed interest in the August 2016 conviction of Navy sailor Kristian Saucier on charges he mishandled classified information:", "During the debate, Pence and Kaine sparred over whether Kaine's running mate, Hillary Clinton, received favorable treatment in comparison to service members prosecuted for similar accusations. The relevant exchange was widely reproduced in coverage of the debate and occurred when moderator Elaine Quijano posed a question about Syria, and Pence interjected to ask if he could discuss cybersecurity. That digression quickly turned to mention of Clinton's e-mail server controversy, and launched a dispute over whether it was true American service members had been prosecuted for similar actions:", "PENCE: First, Donald Trump just spoke about this issue this week. We have got to bring together the best resources of this country to understand that cyber warfare is the new warfare of the asymmetrical enemies that we face in this country. And I look forward if I'm privileged to be in this role of working with you in the Senate to make sure that we resource that effort.", "KAINE: We will work together in whatever roles we inhabit.", "PENCE: We have an intelligence, sir (ph). But I will also tell you that it's important in this moment to remember that Hillary Clinton had a private server in her home that had classified information on it [moderator interjects] about drone strikes, e-mails from the president of the United States of America were on there.", "QUIJANO: Right.", "PENCE: Her private server was subject to being hacked by foreign ...", "[CROSSTALK]", "QUIJANO: I'd like to ask you about Syria, Governor.", "PENCE: We could put cybersecurity first if we just make sure the next secretary of state doesn't have a private server.", "[CROSSTALK]", "KAINE: And all investigation concluded that not one reasonable prosecutor would take any additional step. You don't get to decide the rights and wrongs of this. We have a justice system that does that. And a Republican FBI director did an investigation and concluded that ...", "[CROSSTALK, MODERATOR INTERJECTS]", "PENCE: If your son or my son handled classified information the way Hillary Clinton did [moderator interjects] one hundred thousand of them children — Governor ...", "PENCE: ... they'd be court martialed.", "KAINE: That is absolutely false and you know that.", "PENCE: Absolutely true.", "KAINE: And you know that, Governor.", "QUIJANO: Governor ...", "PENCE: It's absolutely true.", "QUIJANO: Gentlemen, please.", "Among the individuals citing Saucier's conviction in response to the dispute was Kathleen Saucier, the serviceman's mother. Saucier published a Facebook post to a conservative blog's page objecting to Kaine's denial that Hillary Clinton's handling of classified e-mail would have resulted in a court martial if she were a member of the military:", "Please explain Kaine's responses ... my son is Kristian Saucier the navy sailor going to prison for mishandling classified information — taking 6 photos in a classified area of a submarine — there is no evidence he ever transmitted or shared any of these photos:", "On 6 October 2016, Kathleen Saucier also appeared on Fox News to  discuss her frustration about the debate segment:", "Saucier took particular issue with an exchange during the VP debate in which Gov. Mike Pence argued that if a military member handled classified info the way Clinton did they would face \"court-martial.\"", "Sen. Tim Kaine fired back, in defense of Clinton, that Pence's statement was \"absolutely false,\" citing the FBI's decision not to pursue charges.", "Saucier said she's \"grateful\" that Pence brought up the subject, noting that the photos in her son's case were classified at a lower level than some materials found in Clinton's emails.", "\"I feel strongly that [Pence] was trying to be silenced by both Senator Kaine and the moderator that basically asked them to go on to something else,\" she said.", "Kristian Saucier's legal troubles began well prior to Clinton's e-mail scandal, when photographs on a phone he at one point possessed were discovered by a landfill supervisor and shown to a friend of his in the Navy. According to the Navy Times, Saucier was arrested 28 May 2015 on charges \"he took and retained pictures of classified spaces and knowingly destroyed evidence to disrupt an ongoing investigation.\" Early reports indicated Saucier's intent in taking the photographs was a central concern of prosecutors, and Saucier was one of several sailors alleged to have violated a then-new ban on personal devices in classified spaces:", "On a March day in 2012, the supervisor at the town dump in Hampton, Connecticut, saw an LG cellphone resting atop a dumpster. Deciding he needed a new cell phone, he powered it on ... It was the beginning of an unlikely series of events that led to the Justice Department filing charges that could put Machinist Mate 1st Class Kristian Saucier behind bars for 20 years. Prosecutors say the 10-year Navy vet used his cell phone to snap pictures of the classified engineering spaces on the attack submarine Alexandria, raising questions about his intentions to share them.", "It's the latest case where sailors are accused of violating the submarine force's ban on personal electronic devices; the ban was adopted to prevent sailors from photographing sensitive spaces ... Saucier, a 28-year-old native of Arlington, Vermont, had been remodeling his home and making regular trips to the dump. When the supervisor opened the pictures on the phone, he discovered photos of Saucier, whom he recognized, along with several detailed pictures of what looked like a Navy ship.", "The supervisor showed the photos to his buddy, a retired Navy chief, who took them to the Naval Criminal Investigative Service, who then looped in the FBI, and it was off to the races. The photos that raised red flags at NCIS and the FBI included images of various control panels, a panoramic view of the reactor compartment and a panel that showed the condition and exact location of the submarine at the time the photo was taken. The FBI alleged that \"an engineer could determine significant design characteristics of a U.S. nuclear submarine\" from the images on Saucier's phone.", "Investigators considered an intent of espionage, a charge Saucier's lawyers strongly contested. The Federal Bureau of Investigation (FBI) further alleged Saucier had destroyed evidence in order to avoid prosecution, but the Bureau did not present any evidence he had attempted to disseminate the photographs (all captured while he was on duty) of classified equipment or spaces:", "Saucier pleaded \"not guilty\" to charges he took and retained pictures of classified spaces and knowingly destroyed evidence to disrupt an ongoing investigation. Saucier's attorney said his client denies any wrongdoing and is \"vehemently denying the charge of espionage.\" ... Saucier told the FBI in an interview that the phone was his but that he didn't take the pictures, according to the criminal complaint. The FBI alleges that after the interview, Saucier went home and smashed his laptop, a camera and an SD card.", "Pieces of the laptop were found in the woods behind Saucier's grandfather's house in another part of the state, according to the criminal complaint filed by the FBI ... So far, prosecutors have not presented any evidence that suggests Saucier tried or intended to share the photos to foreign agents.", "Three witnesses attested to knowledge of Saucier's possession of the images, and the FBI alleged Saucier attempted to destroy the evidence that he had taken them:", "During the interview, the FBI asked him about his personal computer and other electronic devices he took with him on deployment, according to the complaint ... Immediately following that interview, he returned to his home and, according to the witness at his home that day, he grabbed his camera and the laptop the FBI had asked about, took them to the basement and smashed them to bits inside a plastic bag.", "Saucier then told the witness not to talk because the witness would be in trouble too for seeing the images.", "At the time of that report, the case was still in its exploratory phases. On 27 May 2016, the Department of Justice (DOJ) issued a press release stating that Saucier had pled guilty to one count of unauthorized possession and retention of classified material. Espionage was not mentioned as an element of his plea, and Saucier was not court-martialed:", "Kristian Saucier, 29, of Arlington, Vermont, pleaded guilty today before U.S. District Judge Stefan R. Underhill of the District of Connecticut to one count of unauthorized possession and retention of national defense information.", "According to court documents and statements made in court, from September 2007 to March 2012, Saucier served as a machinist’s mate aboard the USS Alexandria ... On at least three separate dates in 2009, Saucier used the camera on his personal cellphone to take photographs of classified spaces, instruments and equipment of the USS Alexandria, documenting the major technical components of the submarine’s propulsion system.", "On Jan. 19, 2009, Saucier took two photos, one of the auxiliary steam plant panel and the other of the reactor compartment viewed through a portal. On March 22, 2009, Saucier took two photos that, when placed side by side, provided a panoramic array of the maneuvering compartment, the room from which the propulsion system of the boat is operated. On July 15, 2009, Saucier took two photos documenting the reactor head configuration of the nuclear reactor and a view of the reactor compartment from within that compartment.", "Saucier had a secret clearance and knew that the photos depicted classified material and that he was not authorized to take them. He retained these photos and failed to deliver them to any officer or employee of the United States entitled to receive it ... Judge Underhill scheduled sentencing for Aug. 19, 2016, at which time Saucier faces a maximum sentence of 10 years in prison and a fine of up to $250,000. He is released on a $100,000 bond.", "The debate didn't mark the first instance of Kristian Saucier's charges and conviction being compared to Clinton's private e-mail server investigation. At Saucier's August 2016 sentencing hearing, his lawyers argued for a sentence of probation and maintained that Clinton's contemporaneous FBI investigation and the Bureau's ultimate decision not to indict her ought to be taken into account. Prosecutors argued the defense was \"grasping ... at straws\" in drawing a comparison to Clinton, as well as to other sailors of similar rank punished less severely for taking photographs on the ship. Saucier's attorneys pointed to uneven prosecution of offenses relating to classified information and cited specifics of the Clinton e-mail investigation, while several witnesses asserted Saucier was definitely aware his actions constituted a serious offense:", "\"The defendant is grasping at highly imaginative and speculative straws in trying to ... draw a comparison to the matter of Sec. Hilary Clinton based upon virtually no understanding and knowledge of the facts involved, the information at issue, not to mention any issues if [sic] intent and knowledge,\" prosecutors wrote [in a court filing].", "Saucier's defense attorney argued in a submission that it would be unfair to impose a prison sentence on his client when Clinton's email account was found to contain eight chains with \"Top Secret\" information and 36 with \"Secret\" information. Prosecutors and the FBI closed that investigation without filing charges against Clinton or anyone else ... The contrast is fueling longstanding complaints that senior officials accused of mishandling classified information often get little or no punishment, while more junior-ranking offenders can be hit with severe consequences ... [T]he defense notes that two of the sailor's shipmates took similar photos in the same sub and received far more modest punishment, including a $560 docking of pay and — in one instance — a one-grade reduction in rank. One of those sailors is expected to be commissioned as an officer soon.", "However, prosecutors say those episodes involved sailors who each took a single \"selfie\" in the engine room \"while Saucier methodically documented the entire propulsion system of the nuclear submarine, including the design of its nuclear compartment and its nuclear reactor.\"", "\"They are not the type of photographs that one would take to commemorate one’s service,\" prosecutors said.", "Although Director of the Undersea Warfare Division for the Chief of Naval Operations Rear Admiral Charles Richard argued on behalf of the Navy for a severe sentence in a victim impact statement, the prosecution was impeded by the low level of classification of the photographs:", "[T]he most sensitive photos Saucier took have been classified as \"confidential,\" which is the lowest tier of classified information, although they are also separately restricted as nuclear-related information ... While prosecutors say Saucier's conduct risked \"potentially grave damage\" to national security and the Navy claims \"a serious and lasting adverse impact\" from the sailor's actions, those kinds of phrases are more typically applied to information the government safeguards as \"Secret,\" corresponding to data whose disclosure is expected to cause \"serious\" damage to national security, or \"Top Secret,\" corresponding to \"exceptionally grave\" damage to national security.", "On 19 August 2016, Saucier was sentenced to one year in prison, six months of home confinement, and fined $100, far less than the six-year sentence the prosecution sought. Saucier's attorney surmised that the Clinton investigation may have influenced the lighter sentence, and Saucier's shipmates urged the judge to consider varying penalties applied for similar behavior:", "Although relieved, Rinckey does say that \"it could be argued here that depending on what your name is, that's the type of justice you get in the United States.\"", "Rinckey says he's not sure if the judge was swayed by significant media attention comparing Saucier's case with the Clinton email controversy.", "\"He cryptically made some comments about selective prosecution and how that didn't play any factor. Do I think it may have? Sure. But I think there was enough mitigation that the judge was able to depart from the sentencing guidelines [on that basis alone],\" he says.", "Scott Nelson, Saucier's chief petty officer aboard the Alexandria through mid-2009, wrote a letter to the court that the order had collapsed aboard the submarine.", "\"There was no real discussion of legal ramifications of minor security violations, nor was there any significant enforcement of policy for most minor mistakes,\" Nelson wrote, adding that typical punishments including demotion or pay loss \"could also be suspended at the commanding officer's discretion for sailors with great potential to overcome the mistake, as was the case with our sailor of the year who received a DUI.\"", "Both Kristian Saucier and Hillary Clinton were federally investigated over alleged mishandling of classified information: Saucier was charged and sentenced to prison, while Clinton was controversially not indicted by the DOJ after a lengthy investigation. Shipmates of Saucier and some members of the public have contrasted the cases to suggest that Saucier faced harsher penalties for a lesser offense, but intent was the core of the FBI's recommendation not to indict Clinton, while several witnesses testified that Saucier was fully aware his actions were prohibited.", "Kristian Saucier was pardoned by President Donald Trump in March 2018.  In June 2018, his lawyer announced that Saucier intended to file a lawsuit against Obama administration officials, alleging that he was subject to unequal protection of the law.", "Blake, Aaron.   \"The Mike Pence vs. Tim Kaine Vice-Presidential Debate Transcript, Annotated.\"\r\n    The Washington Post.   5 October 2016.", "Gerstein, Josh.   \"Feds Reject Clinton Comparison in Classified Sub Photos Case.\"\r\n    Politico.   16 August 2016.", "Gerstein, Josh.   \"Sub Sailor's Photo Case Draws Comparisons to Clinton Emails.\"\r\n    Politico.   27 May 2016.", "Larter, David.   \"Sailor Faces Charges for Submarine Photos on Cell Phone.\"\r\n    Navy Times.   1 August 2015.", "Nelson, Steven.   \"Sailor Denied 'Clinton Deal,' Gets 1 Year in Prison for 6 Photos of Sub.\"\r\n    U.S. News & World Report.   19 August 2016.", "Department of Justice Office of Public Affairs.   \"U.S. Servicemember Admits to Illegally Retaining Photos Taken Inside Nuclear Submarine and Impeding Investigation.\"\r\n    27 May 2016.", "Fox News Insider.   \"Sailor's Mom Calls Out Double Standard: Son Is Going to Jail, But No Charges for Hillary?\"\r\n    6 October 2016.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]