["The photos were published here on March 6, 2021 in a Facebook post shared more than 10,000 times.", "“Uncovering the corpse of Ma Kyal Sin. 5-3-2021 (night),” the Burmese-language caption reads.", "Kyal Sin, nicknamed “Angel”,  was one of 38 anti-coup protesters killed in a brutal crackdown in Myanmar on March 3, 2021.", "Her death attracted worldwide attention after images emerged of the 19-year-old at the protest wearing a t-shirt that read “Everything will be ok”.", "Kyal Sin’s grave was exhumed by authorities for examination shortly after her death.", "State media MRTV said the body was exhumed with the permission of the family, claiming a subsequent investigation into material found on the body proved that she was not killed by the police.", "Videos of local residents discovering the grave had been exhumed have been circulating on social media.", "The misleading photos were also shared alongside a similar claim here, here and here on Facebook, and here and here on Twitter.", "However, the photos have been taken out of context and were posted online before Kyal Sin's death.", "A keyword search led to this TikTok video published on December 10, 2020, which shows soldiers digging up an old bomb.", "The caption of the TikTok video reads: “A bomb found in Kyaukpadaung”.", "Kyaukpadaung is a town in Mandalay Region of Central Myanmar.", "Below is screenshot comparison of the photo in misleading post (L) and the original TikTok video (R):", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]