["“#ENDSARS AGAINST THE ROADS ?‍♂️FG, State Roads Being Destroyed,” reads the caption in this Facebook post from October 21, 2020.", "Shared more than 400 times, it includes two images of a damaged road and a nearby group of people, one of them holding aloft a pick.", "The hashtag #EndSARS is the main slogan behind widespread protests highlighting police brutality in Nigeria and refers to the country’s former Special Anti-Robbery Squad (SARS).", "The police unit was disbanded in October 2020 following accusations of torture, ill-treatment and extrajudicial killings. It has been replaced with a new unit called Special Weapons and Tactics (SWAT).", "A screenshot of the post was also shared here on Facebook, condemning the destruction of the road “all in the name of peaceful protest (sic).”", "Nigeria’s two-week unrest escalated after the shooting of peaceful protesters by security forces at the Lekki Toll in Lagos on October 21, 2020, leading to sporadic clashes, looting and the destruction of public and private assets in the city.", "Some public roads were reportedly blocked, but by all accounts not damaged.", "The same images have been linked to similar claims which located the road elsewhere in Africa, ranging from Guinea (in French) to Kenya (in English). AFP Fact Check debunked both claims here and here.", "As our previous debunks showed, the road is in South Africa. News reports about the incident were published online in September, including here, here and here.", "It emerged that angry residents from Msinga local municipality in South Africa’s KwaZulu-Natal province had blocked and destroyed a section of the R33 road between the towns of Pomeroy and Dundee following more than four years of complaints to the government about their lack of access to water and electricity.", "The provincial transport department responded by condemning the “destruction of infrastructure and malicious damage to property after members of the community blocked the R33 and dug up the road in protest”.", "Gugu Sisilana, the spokeswoman for the KwaZulu-Natal transport department, had confirmed the authenticity of the image.", "“Yes, it is the R33 at Pomeroy,” Sisilana told AFP Fact Check on October 5, 2020.", "Pictures from a government delegation’s visit to the scene on September 25, 2020, also showed the images were of the same road.", "AFP Fact Check was able to confirm the exact location with Google Maps Street View.", "The protests and subsequent unrest in Nigeria amplified the spread of misinformation on social media and the sharing of images and videos out of context.", "AFP Fact Check has debunked several examples, including an image of shrouded bodies claiming to show people killed during the recent protests.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]