["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Poll worker Dave Wampler sets up a voting privacy booth Monday, Nov. 7, 2016 at St. Mary's Episcopal Church in Tampa during preparations for the Nov. 8 election. (James Borchuck/Tampa Bay Times)", "Against the backdrop of Russian election meddling, Senate Democrats came up empty-handed in their effort to pump an additional $250 million into election security money for states. The vote was 50-47 in favor, but they needed 60 to bring the measure to the floor.", "Sen. Marco Rubio, R-Fla., voted against it. When asked why, he emphasized that Washington just sent the states $380 million a few months ago.", "\"The money we've already appropriated is money that was based on professional assessment of what the needs were from a national level,\" Rubio told CBS News Aug. 2. \"If an additional amount is necessary in the future, we will provide it, but there's no outcry from states saying they need more money. They haven't even begun to spend the money they have now.\"", "There’s debate over whether there’s enough money in the pipeline to replace older voting machines and take other steps to harden state systems, but here, we focus on Rubio’s statement that states haven’t begun to spend the money they have now.", "Washington has sent states $361 million since May for election security improvements.", "Every state and territory has submitted plans for how they will use the funds.", "24 of those plans clearly show that spending is underway in advance of the 2018 election. (Additional states already might be spending funds, but their plans lacked a clear schedule.)", "Tucked in the $1.3 trillion spending bill President Donald Trump signed March 23 was $380 million for states to make election security improvements. States could replace electronic-only voting machines, set up a post-election audit system to verify final tallies, upgrade computer systems to prevent hacking, and take other measures along those lines.", "Washington doled out the money by formula, and by April, the Election Assistance Commission, the agency overseeing the process, had sent states letters telling them how much they would get. As soon as states got those letters, they could start spending, so long as they told the commission and the commission gave the thumbs up.", "The commission told states, \"By releasing these funds quickly, it is hoped that the grants can have an immediate impact on the 2018 election cycle.\"", "States needed to provide a 5 percent match, but were given two years to do that. They had to submit plans and report how much they spent and on what each year. They had until 2023 to request money, but every state and territory has moved to draw down their allotted funds, with a handful hitting technical snafus in doing that.", "According to plans sent to the Election Assistance Commission, the spending has begun.", "\"We know that at least 24 states have definitely been spending money prior to the 2018 election,\" said commission director of grants Mark Abbott. \"That number may be larger, as some states are deploying funds but did not specify in their plan what years the funds will be used.\"", "In Rubio’s home state, Florida’s Secretary of State Ken Detzner approved over $10 million in election security grants to 49 of 67 counties in late July.", "In June, South Carolina began assessing the vulnerabilities of its voter registration and elections management system. The state has organized a two-day meeting of election officials for August so they can see voting machine options that meet higher security standards.", "A few days before Rubio spoke, the Illinois State Statewide Terrorism and Intelligence Center interviewed people for a cybersecurity program manager to work with local election officials. The state’s Department of Innovation and Technology is now hiring nine technicians to conduct risk assessments and training with local election authorities.", "California has started drawing down about $3 million it plans to spend to strengthen the cybersecurity of its statewide system at the county level.", "\"There’s hiring all over the country to beef up staff,\" Abbott said. \"Other states are buying subscriptions to services to spot malware and filter email. You have to bring people together to make sure everyone at the state and local levels are on the same page, and many states have started doing that.\"", "The number of dollars out the door is a small sliver of what the total spending will be. We found about $45 million earmarked for the first year across just four states — Illinois, New York, California and Florida. (The total planned spending is much higher. We were able to glean this figure from states where we could see both how much they planned to spend and when they planned to spend it.)", "We contacted Rubio’s office for supporting information and did not hear back.", "Rubio said states have \"not even begun\" to spend the election security money they have now.", "That is at best an exaggeration and in terms of state activity, factually incorrect. At least 24 states have started spending the recently released federal dollars and just as important, they are signing contracts and making commitments to spend millions of dollars in the coming months.", "The only element of truth is that states have just begun to spend this new money, and it is a small portion of what has been approved. This is one possible way to understand Rubio’s statement. But if that was his meaning, he could have said so.", "We rate this claim Mostly False.", "CBS News, CBS This Morning, Aug. 2, 2018", "U.S. Election Assistance Commission, 2018 HAVA ELECTION SECURITY FUNDS, accessed Aug. 2, 2018", "FCW, Senate blocks additional funding for election security, Aug. 1, 2018", "Illinois State Board of Elections, Cyber Navigator memo, June 6, 2018", "New York State Board of Elections, Cybersecurity plan, May 3, 2018", "South Carolina Election Commission, 2018 HAVA election security grant plan, accessed Aug. 2, 2018", "West Virginia Secretary of State, West Virginia plan to expend HAVA funds, June 13, 2018", "New Mexico Secretary of State Maggie Toulouse Oliver, Testimony before U.S. House Committee on Oversight and Government Reform, July 24, 2018", "Tampa Bay Times, Florida accepts election security money. Now, counties await their checks, July 19, 2018", "Office of Florida Governor Rick Scott, Gov. Scott: DOS Approves 49 Election Security Grant Applications, July 27, 2018", "Letter from 21 Attorneys General, Election security funding, July 23, 2018", "Brennan Center for Justice, Federal Funds for Election Security: Will They Cover the Costs of Voter Marked Paper Ballots?, March 23, 2018", "Sen. Patrick Leahy, Senate GOP Blocks The Leahy Election Security Grants Amendment, Which Would Help States Bolster Voting And Election Security, Aug. 1, 2018", "Interview,  Mark Abbott, director of grants, Election Assistance Commission, Aug. 2, 2018", "Email interview, Matt Dietrich, public information officer, Illinois State Board of Elections, Aug. 2, 2018", "Email interview, Sarah Revell, spokeswoman, Florida Department of State, Aug. 2, 2018", "Email interview, Sam Mahood, press secretary, California Secretary of State’s Office, Aug. 2, 2018", "Email interview, Fred Woodhams, spokesman, Michigan Department of State, Aug. 2, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]