["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Jeff Greene, a Democrat billionaire running for Florida governor, has some close connections to President Donald Trump: He is a member of Trump’s Mar-A-Lago club, and they are neighbors in Palm Beach.", "But that hasn’t stopped Greene from criticizing Trump for receiving taxpayer-funded protection during his South Florida visits:", "\"Every time Trump comes here to play golf, Florida taxpayers are paying for it. Millions wasted in road closures and overtime. Jeff Greene will put a stop to that day one,\" said Greene’s TV ad promoting his Democratic primary bid for governor.", "Here’s where Greene has a point: The Palm Beach County Sheriff’s Office has spent millions on security for Trump’s visits.", "Here’s what Greene left out: The federal government has already reimbursed local law enforcement agencies for protecting Trump. And while the next governor could send a bill to the federal government, it would likely end up in the shredder.", "Greene’s spokeswoman pointed to a Palm Beach Post article that found local law enforcement agencies fronted more than $5.7 million to help protect Trump between November 2017 and April 2018.", "Most of that money was spent by the Palm Beach County Sheriff’s Office, while smaller amounts were spent by West Palm Beach and Palm Beach police departments.", "However, the federal government has already established a process for reimbursement.", "The Presidential Residence Protection Assistance Grant provided $41 million to reimburse state and local law enforcement agencies for costs incurred between Jan. 21, 2017, and Sept. 30, 2017, while protecting Trump’s residences in Florida, New York and New Jersey. The Federal Emergency Management Agency administers these funds.", "In 2017, the largest grant recipient was the New York City Police Department, which helps guard Trump Tower. The department received about $36 million.", "In Palm Beach County, the sheriff’s office received $3.3 million, the full amount it sought for reimbursement, according to Therese Barbera, a sheriff spokeswoman.", "The town of Palm Beach received $71,000 and West Palm Beach received $63,000. In a neighboring county, the Broward Sheriff’s Office also received money.", "Local law enforcement agencies can submit their next requests for federal reimbursement in October.", "While Greene cited Trump’s visits to play golf, Trump doesn’t only play golf while in Palm Beach County. Trump has conducted some business while in South Florida, including hosting Japanese Prime Minister Shinzo Abe at Mar-A-Lago.", "But he is clearly a fan of golf. PolitiFact’s Trump Golf Tracker showed that as of May 18, 2018, he had at least 56 confirmed golf outings, including some in Florida. (Our tabulation could be an undercount since it is based on confirmed golf outings. The New York Times has tracked how many times Trump has visited his properties, including golf courses, which adds up to 170 as of mid-July.)", "Greene said he would put a stop to this. We can't fact-check whether he will, because that's a prediction. But we can analyze whether the governor has control.", "Campaign spokeswoman Claire VanSusteren pointed to a line in Article 7 Section 1 in the Florida Constitution that states, \"No money shall be drawn from the treasury except in pursuance of appropriation made by law.\"", "We sent Greene’s constitutional argument to a few Florida legal experts: Nova Southeastern University law professor Robert Jarvis; Talbot \"Sandy\" D’Alemberte, a former president of the American Bar Association and former president of Florida State University; and Raoul Cantero, a former Florida Supreme Court judge and a partner at White and Case law firm.", "The experts would essentially say to Greene: Good luck with that.", "This portion of the Florida Constitution is about taxation — the state budget says nothing about relations with the federal government.", "There is nothing in that section that would compel the federal government to comply with such a request from a governor.", "Jarvis said that a state governor has no power over a president.", "\"This is because of a legal doctrine known as the ‘superior sovereign doctrine.’ Under it, a lower government official cannot order a higher government official to do anything,\" he said. \"This stems from medieval times, when a king could order a prince to do things, but a prince could not order a king to do anything. In our country, this means that the states are subservient to the federal government.\"", "Greene said, \"Every time Trump comes here to play golf, Florida taxpayers are paying for it. Millions wasted in road closures and overtime. Jeff Greene will put a stop to that day 1.\"", "Local law enforcement in Palm Beach County have spent millions on security when Trump visits, but they have submitted their costs for reimbursement, and will continue to do so.", "Greene cites a portion of the Florida Constitution about taxation that he says he would use to submit a bill to the federal government. He could certainly try that, but the legal experts we talked to said that’s not the purpose of that part of the Constitution.", "We rate this claim Mostly False.", "Jeff Greene campaign, Trump Golf TV ad, July 2018", "Federal Emergency Management Agency, Presidential Residence Protection Assistance Grant, Fiscal Year 2017", "Congress, HR 1625", "Palm Beach Post, \"County seeks $5.6M reimbursement for Trump’s Mar-a-Lago security bill,\" July 12, 2018", "Palm Beach Post, \"Rare Democratic campaign photo op from Donald Trump’s Mar-a-Lago,\"\nJuly 16, 2018", "USA Today, \"Trump's trips to Mar-a-Lago pricey;\" June 21, 2018", "Sun Sentinel, \"Feds cover cops' OT for Trump,\" Dec. 22, 2017", "Politico, \"Greene faceoff with Trump at golf club part of $2.9M ad campaign in Florida governor’s race,\" June 19, 2018", "Florida Politics, \"New Jeff Greene ads target Donald Trump, promote education reform,\" July 10, 2018", "Florida Constitution", "New York Times, \"Tracking the President’s Visits to Trump Properties,\" July 16, 2018", "PolitiFact, \"Who plays more golf: Donald Trump or Barack Obama?\" May 18, 2018", "Interview, Alexandria Brunner, Federal Emergency Management Agency spokeswoman, July 25, 2018", "Interview, Claire VanSusteren, Jeff Greene campaign spokeswoman, July 23, 2018", "Interview, Alexandria Brunner, FEMA spokeswoman, July 23, 2018", "Interview, Therese Barbera, Palm Beach County Sheriff’s Office spokeswoman, July 23, 2018", "Interview, Robert Jarvis, Nova Southeastern University law professor, July 23, 2018", "Interview, Talbot Sandy D’Alemberte, a former president of the American Bar Association and former president of Florida State University, July 24, 2018", "Interview, Raoul Cantero, a former Florida Supreme Court judge and a partner at White and Case law firm, July 24, 2018", "Interview, Palm Beach Deputy Chief Ann-Marie Taylor, July 24, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]