["The video was published here on Twitter on February 20, 2021. It has been viewed more than 600 times.", "The Twitter post’s Chinese-language caption translates to English as: “CNN reported: This Tuesday, President Trump delivered food, water and disaster relief supplies in Texas to condolences and embrace the injured people. Please note that the media outlet reporting this incident turned out to be CNN! Don’t you think this is unusual?!”", "An unprecedented and deadly \"polar plunge\" burst pipes and left millions in Texas shivering without power or clean water for days, AFP reported here on February 18, 2021. The extreme winter weather system wreaked havoc across much of the southern and central United States, reportedly killing at least 40 people and igniting anger in Texas as authorities scrambled to turn the lights back on.", "The same video was shared alongside a similar claim on Facebook here and here; and on Twitter here and here.", "The claim, however, is false: all of the footage has circulated in reports before 2021.", "The video's first segment was taken from footage published here on the YouTube channel US broadcaster CNN on September 3, 2017. The footage corresponds with the first clip in the misleading video from the beginning to the 44-second mark.", "The video's description reads: “President Donald Trump and First Lady Melania Trump visited with Harvey victims at a relief center in Houston. (sic)”", "Below is a screenshot comparison of the misleading video (L) and the CNN video (R):", "The second clip has circulated in reports about former President Trump visiting Texas in 2017 following another storm. It was originally published here on the YouTube account of American television CBS Chicago on September 3, 2017.", "The video's description reads: “President Trump made his second trip to Texas since Hurricane Harvey. The president surveyed storm damage and met with storm victims. CBS 2's Danielle Nottingham reports.”", "Below is a screenshot comparison of the misleading video (L) and the video from CBS (R):", "The third clip has circulated in reports since at least 2017. It shows former President Trump giving a speech. It was originally published here by the BBC on August 29, 2017. The video was titled: “Trump on Houston flood: 'Texas can handle anything'”.", "Below is a screenshot comparison of the video in the misleading posts (L) and the BBC video (R):", "The fourth clip shows an interview with a man wearing a red hoodie that has circulated online since at least 2019. It was originally published here by WPRI, a US television network, on March 9, 2019.", "It is titled: “VIDEO NOW: Tornado Victim Thanks President Trump”. The video description reads: “President is visiting tornado-ravaged Alabama.”", "Below is a screenshot comparison of the misleading video (L) and the WPRI video (R):", "The final clip shows Trump stepping off Air Force One. It was originally published here on Ledger-Enquirer, a local newspaper in Columbus, Georgia on March 8, 2019.", "The video's caption reads: “President Donald J. Trump and First Lady Melania Trump arrived at Lawson Army Airfield at Ft. Benning, GA, before quickly getting on a helicopter to head to Lee County, Alabama to survey storm damage. BY MIKE HASKEY”.", "Below is a screenshot comparison of the misleading video (L) and the Ledger Enquirer video (R):", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]