["Blunt proposed a budget amendment aimed at reopening schools for in-person classes. Senate Democrats voted against it.", "His amendment would have cut funding to schools that did not reopen after teachers are vaccinated.", "The bill passed last week along party lines and included funding for schools.", "Republican Sen. Roy Blunt of Missouri took to Twitter to express his frustration with Senate Democrats who voted against his budget amendment last month. The amendment sought to reopen in-person schooling after the coronavirus pandemic shuttered it last year.", "\"I recently offered an amendment to the budget bill that would have helped get kids back in school after teachers were vaccinated,\" the Feb. 25 tweet read. \"Every single Senate Democrat voted against it.\"", "The reason they voted against it, he said, was political.", "\"It's very clear this isn’t about safety or science. It’s pure politics & kids are paying the price,\" the tweet read.", "Blunt joined South Carolina Sen. Tim Scott on the budget amendment. The congressional record shows that Democrats uniformly panned it.", "Blunt’s tweet doesn’t say whether Democrats had another plan to help schools. They did.", "So, what was in the proposal that made so many Democrats say no? Was it pure politics?", "The answer may lie in the carrot versus the stick.", "Blunt’s amendment centered on penalties rather than straight aid that Democrats proposed. His proposal would have allowed Congress to limit or withhold COVID-19-related emergency relief to K-12 schools that did not reopen for in-person learning after their teachers received vaccinations.", "Sen. Patty Murray, D-Wash., the assistant majority leader, said Democrats voted against it because they objected to a punitive approach.", "\"This amendment would’ve prohibited schools from getting critical resources to implement public health protocols,\" Murray’s office said in a statement to PolitiFact Missouri.", "\"And as a result, this amendment would’ve made it that much harder for schools to re-open for in-person instruction. The best way to ensure our schools can safely reopen as soon as possible is to get schools the resources they need, not to impose one-size-fits-all mandates from Washington on them.\"", "Murray’s team also said that vaccines are just one piece of safely returning to in-person learning.", "\"Safely reopening schools also means providing schools with the resources they need to implement public health protocols including effective physical distancing, consistent mask-wearing, ventilation, COVID-19 testing, contact tracing, and more,\" the statement said.", "The bill passed by the Senate last week included those resources in the $1.9 trillion COVID-19 relief bill. The bill allocates $128 billion for primary and secondary schools, including money to support remedial instruction over time. Just 5% of the money for local schools comes in fiscal year 2021.", "Blunt’s team pointed us to his most recent remarks on the matter. In these remarks, Blunt emphasized the importance of getting kids back in school.", "Blunt said that he \"offered an amendment to the budget bill that would have helped get kids back in school after teachers were vaccinated\" and that \"every single Senate Democrat voted against it.\"", "This leaves out an important detail: The amendment threatened to withhold relief funding from schools that didn’t reopen in-person learning.", "Blunt framed Democrats’ opposition to his amendment in narrow terms, making it appear as though they opposed getting kids back in school when they really opposed his punitive approach. The COVID-19 relief bill that Democrats passed included funding to help schools.", "We rate this statement Half True.", "Roy Blunt on Twitter, Feb. 25, 2021", "U.S. Congressional Record, Feb. 4, 2021", "Amendment 48 to U.S. Senate Resolution 5, Feb. 4, 2021", "Email exchange with Madeleine Russak, press secretary for Patty Murray, March 1, 2021", "U.S. House of Representatives, The American Rescue Plan Act of 2021, Feb. 18, 2021", "Email exchange with Tate O’Connor, press secretary for Roy Blunt, March 1, 2021", "Roy Blunt, It’s Time For Students to Go Back to School, Feb. 25, 2021", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]