["By Saranac Hale Spencer", "Posted on November 29, 2017", "President Donald Trump retweeted a video that purported to show a “Muslim migrant” beating up “a Dutch boy on crutches.” But, according to the Netherlands Embassy in the United States, the attacker wasn’t an immigrant. He was born and raised in the Netherlands.", "The embassy chastised the U.S. president for spreading false information.", "“Facts do matter,” it said in a statement on Twitter hours after the president’s retweet.", "https://twitter.com/NLintheUSA/status/935953115249086464", "The public prosecutor’s office in the Netherlands that handled the case explained that the fight had happened in May and the boy was sentenced through a juvenile justice program.", "A video has been shared on twitter in which an argument between two underage boys can be seen. This incident took place in May of this year. The public prosecution service Noord-Holland has studied the file submitted by the police. (1/2)", "— OM Noord-Holland (@OMNoord_Holland) November 29, 2017", "The suspect, who was born and raised in the Netherlands, received a HALT settlement (https://t.co/w62MNOFvug). This has been successfully completed. (2/2)", "— OM Noord-Holland (@OMNoord_Holland) November 29, 2017", "The retweet was one of three anti-Muslim videos that Trump posted on the morning of Nov. 29 to his personal verified Twitter account, @realDonaldTrump, which has more than 40 million followers. All three videos were posted by Jayda Fransen, the deputy leader of Britain First, a far-right group.", "The president’s retweets also drew condemnation from British Prime Minister Theresa May, who said through her spokeswoman: “Britain First seeks to divide communities by their use of hateful narratives that peddle lies and stoke tensions. They cause anxiety to law-abiding people. British people overwhelmingly reject the prejudiced rhetoric of the far right which is the antithesis of the values this country represents, decency, tolerance and respect.”", "FactCheck.org Rating:", "Read More", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]