["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Fort Walton Beach Police Department evidence technician Dusty Rhodes leaves the Fort Walton Beach, Fla., office of Rep. Joe Scarborough, R-Fla., on July 20, 2001, after an aide was found dead. (AP/Northwest Florida Daily News)", "President Donald Trump took to Twitter to celebrate the firing of NBC’s Matt Lauer over allegations of inappropriate sexual behavior, while encouraging the network to look deeper into its employees.", "\"Wow, Matt Lauer was just fired from NBC for 'inappropriate sexual behavior in the workplace.' But when will the top executives at NBC & Comcast be fired for putting out so much Fake News. Check out Andy Lack’s past!,\" Trump tweeted Nov. 29, 2017.", "He then followed up: \"So now that Matt Lauer is gone when will the Fake News practitioners at NBC be terminating the contract of Phil Griffin? And will they terminate low ratings Joe Scarborough based on the 'unsolved mystery' that took place in Florida years ago? Investigate!\"", "Trump mentioned three NBC officials -- Lack, the chairman of NBC News, Griffin, the president of MSNBC, and Scarborough, a former Florida congressman who hosts Morning Joe on MSNBC.", "In this fact-check, we are focusing on Trump’s attack of Scarborough’s \"unsolved mystery.\"", "Trump is referring to an incident in 2001, when a 28-year-old congressional aide to Scarborough was found dead in one of Scarborough’s district offices.", "Scarborough represented Florida Panhandle counties as a Republican from 1995 to 2001.", "PolitiFact founder Bill Adair, then the Washington bureau chief for the St. Petersburg Times, covered the death. His report is only 286 words long, so we are republishing it in full.", "A congressional aide in Fort Walton Beach told people she was feeling ill the day before she was found dead, according to a police report.", "The Fort Walton Beach Police Department report says Lori Klausutis, an aide to Rep. Joe Scarborough, told a co-worker on July 19 that she was not feeling well, but did not elaborate.", "She made a similar comment to a mail carrier.", "She was found dead in Scarborough's district office the next morning by two people who came to seek help with an immigration case.", "Medical Examiner Dr. Michael Berkland has said Klausutis, 28, of Niceville, lost consciousness because of an abnormal heart rhythm and fell, hitting her head on a desk. The head injury caused the death, Berkland said.", "The report, which was released Monday, quotes friends and relatives as saying Klausutis was happily married and was known as \"Little Miss Mary Sunshine.\"", "They said she was under moderate stress in the days before she died. She had two assignments due for college courses. She and her husband had recently moved into a new house, and she was looking for a new job because Scarborough recently resigned from Congress, effective in September.", "Relatives told police she was upbeat about a job possibility at a local radio station and had recently received a $6,000 raise.", "Relatives said she had been taking medication for acne and that she suffered a head injury in a traffic accident when she was a teenager that left her in a coma. When she recovered, she had signs of short-term memory loss.", "A mail carrier who came in the office on July 19 said she appeared nervous. He said Klausutis told him she did not feel well.", "The story has dogged Scarborough among conspiracy-minded individuals. Markos Moulitsas, founder of the liberal website Daily Kos, was banned from MSNBC for suggesting Scarborough may have played some role in Klausutis’ death.", "The guts of the conspiracy theory center around Scarborough’s announcement in May 2001, two months before Klausutis’ death, that he would resign from Congress on Sept. 6, 2001, to spend more time with his two sons.", "Scarborough was divorced but had joint custody of his two sons.", "\"It's impossible to be a good father and a good congressman,\" Scarborough said in an interview the St, Petersburg Times, which is now the Tampa Bay Times. \"You are home 180 nights out of the year and you're in D.C. 180 nights. No matter where you are, the kids are going to be without you half the year.\"", "There’s little more to the conspiracy, but the clarity of the medical examiner’s report did not satisfy people who believe the conspiracy. That list apparently includes Trump.", "Scarborough responded to the president on Twitter, saying: \"Looks like I picked a good day to stop responding to Trump's bizarre tweets. He is not well.\"", "Trump has been engaged in a running feud with Scarborough and co-host Mika Brzezinski.", "Trump said Scarborough is party to an \"unsolved mystery\" from his time as a congressman in Florida.", "The guts of the attack are nothing more than an unproven conspiracy theory -- no different than President Barack Obama being born outside the United States or Ted Cruz’s father being involved in the assassination of President John F. Kennedy.", "This case is not unsolved. It is not a mystery.", "Trump's claim rates Pants on Fire!", "St. Petersburg Times, \"Rep. Scarborough chooses kids over D.C.,\" May 26, 2001", "St. Petersburg Times, \"Aide found dead had said she felt ill,\" Aug. 28, 2001", "Gawker, \"Remember When a Dead Intern Was Found in Joe Scarborough's Office?,\" June 17, 2015", "Joe Scarborough Twitter feed, Nov. 29, 2017", "Donald Trump Twitter feed, Nov. 29, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]