["About this rating", "Several times over the last few years social media posts have appeared claiming that users who followed instructions to \"like\" and \"share\" could win myriad prizes in a purported giveaway sponsored by Oprah Winfrey and/or Tyler Perry:", "As we have noted on previous pages about similar hoaxes, a number of red flags about these posts are evident, primarily that the underlying pages are not endorsed by any official channel associated with Oprah or Tyler Perry, and that the specifics of the \"giveaway\" changes, as does the bait:", "The first clue the giveaways following this format were not on the up-and-up was the pages to which Facebook users were directed, pages that had been created just days before the giveaway posts begin to appear. Not only were the secondary Facebook pages involved always new, they were also not linked with car companies or other interests one might imagine could reasonably be expected to offer up a car in exchange for social media advertising (such as automobile dealerships, insurance companies, or large retailers). Were a legitimate company to engage in such a high-ticket contest giveaway, the incentive would be exposure; however, no corresponding promotional return on advertising investment was discernable in these Facebook giveaway claims.", "The tactics were similar to recent scams involving Costco, Kroger and Amazon gift cards, but the six-figure price tag attached to some of the vehicles involved in the Facebook car giveaway posts proved a far more difficult-to-resist enticement for some users, not all of whom questioned whether sharing a page presented any negative consequence should it later turn out to be a prank, hoax, or other false promise.", "The aim of schemes like the Oprah and Tyler Perry hoaxes are typically to rapidly build a large Facebook following in order to sell pages with high \"like\" counts to third parties. While the hoaxes appear to present little risk to participants, liking and sharing the false information is not entirely safe; in addition to advancing the interests of and encouraging social media scammers, page likes potentially enable user data mining by scammers.", "The \"liked\" pages also often change, leaving names and identities unwittingly endorsing a scam, hate page, or other undesirable activity. The 2017 recirculation of the Oprah/Tyler Perry posts coincided with Facebook's announcement it would be downranking \"engagement bait\" in users' News Feeds.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]