["About this rating", "On 3 November 2016, the web site Got News published an article reporting that former Apprentice contestant Summer Zervos had been paid $500,000 to accuse Donald Trump of sexual harrassment:", "The Apprentice loser and Trump “fake rape” accuser Summer Zervos was bribed $500,000 by Democrat fundraiser and lawyer Gloria Allred to make her accusations against Donald Trump, a deal that was shopped around to other ex-Apprentice contestants too, according to anonymous sources familiar with the matter.", "GotNews’ source tells us that Zervos’ sexual harassment accusation against Trump is a “completely fabricated hoax.”", "Zervos was paid half a million dollars by Gloria Allred, which is being paid out “slowly over time” according to our source.", "Got News provided no evidence to back up their claim, which was based entirely on a comment made by an unidentified source.", "Gloria Allred, Zervos' attorney, called the \"tip\" completely false:", "I have been a lawyer and fighter for justice for 40 years. Those who are responsible for this malicious lie should know that if I find out who they are I will hold them accountable. Those who made up this lie know it is a lie and that is why they are afraid to give their name, and have decided to spread their lie anonymously.", "In October 2016, Summer Zervos accused Donald Trump of sexual misconduct towards her while she was a contestant on The Apprentice several years earlier:", "Zervos described two alleged incidents where she said Trump forcibly kissed her on the lips — once in his New York office and another after meeting him for dinner at the Beverly Hills Hotel. She said Trump grabbed her breast after kissing her in a bungalow at the California hotel.", "Although Trump has denied the allegations, at least one person has stepped forward saying that Zervos had talked to her about the subject long before Trump began his campaign for president:", "Zervos' lawyer, women's rights activist Gloria Allred, produced a witness who she says corroborates the former \"Apprentice\" contestant's claims in a press conference. Ann Russo, a social worker and friend of Zervos, said she recalls the contestant talking about her encounters with Trump more than five years ago — long before the candidate decided to run for office.", "This isn't the first time that Got News, run by conservative troll Charles C. Johnson,\nhas put forth controversial articles based on little to no evidence. In the summer of 2016, the site published at least two articles painting Philando Castile and Alton Sterling, two black men who were killed by white police officers, as gang members. We looked into both those claims and found the \"evidence\" behind them to be flimsy at best.", "Fonseca, Ryan.   \"Donald Trump Denies Allegations of Sexual Harassment by Summer Zervos, Rails Against Media.\"\r\n    [Los Angeles] Daily News.   14 October 2016.", "Bailey, Chelsea.   \"Trump Accuser Summer Zervos Fights Back with New Witness.\"\r\n    NBC News.   16 October 2016.", "CBS News.   \"Former 'Apprentice' Accuses Donald Trump of Sexual Misconduct.\"\r\n    14 October 2016.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]