["On August 23, 2018, Abhishek Mishra, a Vishwa Hindu Parishad (VHP) activist tweeted, “हे राम..बहुत भयावह चित्र है..यूपी की @meerutpolice सो रही है क्या ? जीवों के कटे अंश खुलेआम सड़कों पे कैसे बिखरे है ?” (Hey Ram, this is a scary picture. Is UP’s Meerut police sleeping? How are the remains of slaughtered animals scattered on the streets? -translated). Mishra, a verified twitter user who describes himself as digital and social media advisor of VHP had retweeted a set of images shared by another Twitter account ChetnaSharmaAdv. Mishra is followed by union ministers Nirmala Sitharaman and Rajyavardhan Singh Rathore. Mishra was in the news recently for cancelling an OLA cab because the driver was Muslim.", "हे राम..बहुत भयावह चित्र है..यूपी की @meerutpolice सो रही है क्या ? जीवों के कटे अंश खुलेआम सड़कों पे कैसे बिखरे है ? https://t.co/zl7YqdpISI", "— Abhishek Mishra (@Abhishek_Mshra) August 23, 2018", "A Facebook page, Sach Bharat has also shared the same set of images stating, “मेरठ में खुले आम, पहली बार। सरकार, शासन, प्रशासन, पुलिस को चुनोती।” (For the first time, Government, Governance, Administration, Police are openly challenged in Meerut -translated) It has been shared more than a thousand times.", "This pictures are indeed from Meerut, Uttar Pradesh. In a conversation with Alt News, Ranvijay Singh, SP City Meerut clarified, “Basically all the waste of sacrificed animals are collected at one place and from there, Nagar Nigam vans pickup the waste to dump it. There is a police chowki near the Zakir colony that is very close to the place where camps for waste collections are organized by NGOs. It has been a practice from a long time in the city.” He further said, “These are the places where such waste are collected by the NGOs as well as the Municipal corporation that is dumped somewhere outside the city.”", "Mohammad Alam, a resident of Lisari Gate area corroborated in a conversation with Alt News saying, “Inspecting the photos, the image were slaughtered heads can be clearly seen is from Zakir Colony, a locality known for leather traders. This image couldn’t be a place in-front of the chowki as the slaughterhouse has now been relocated and school exists here. Nontheless, there is an existent slaughterhouse behind the Zakir Colony chowki located in the area of Lisar Gate police station. NGOs and Nagar Nigam do tow such slaughtered waste kept for dumping in the city.” In the map below, you can see the capital public school in-front of the police chowki located in Zakir Colony.", "Not only are slaughter waste collection points in public places a serious health and safety issue, it can lead to people misconstruing the imagery of such places when they are shared on social media without context or with a false narrative as it was in this particular case.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]