["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "The post’s numbers are inaccurate, but abortions do far outnumber deaths from COVID-19 and flu. The COVID-19 number is likely too low, and the flu number is too high. The number of abortions is roughly accurate.", "Abortion is an elective procedure, not a contagious illness.", "An anti-abortion post on Facebook attempted to use the coronavirus to advance its cause, stating:", "\"U.S. deaths since 1/22:", "COVID-19: 27", "Flu: 4,700", "Abortion: 118,000.\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Precise numbers for the period cited in the post are not available in any of the three categories, but the best numbers suggest these figures are inaccurate. Generally in the United States, however, elective abortions are performed at a much higher rate than deaths by COVID-19 or the flu, which are viruses that surely no one chooses to catch.", "Here’s what we know about the numbers during the roughly eight-week period from Jan. 22, 2020 through March 17, 2020, the date of the post:", "COVID-19 deaths: The first U.S. death from the novel coronavirus was reported on Feb. 29, 2020. By March 17, 2020, the number of COVID-19 related deaths was reported to be 110, more than four times what this Facebook post suggests.", "Flu deaths: The U.S. Centers for Disease Control and Prevention estimated there would be 23,000 flu deaths during the 2019-2020 flu season, which began Sept. 29, 2019, according to the latest weekly update from the released March 14, 2020. That’s an average of 958 deaths per week, or 7,664 over the eight-week period this post describes, not, 4,700.", "Abortions: Abortions are reported on an annual basis. The latest figures, from the nonprofit Alan Guttmacher Institute, are for 2017, when there were an estimated 862,320 abortions. That’s an average of 16,583 per week, or 132,664 over eight weeks", "It’s worth pointing out that an abortion is an elective medical procedure, something that cannot be said for someone who is afflicted by contagion and dies.", "Precise numbers for Jan. 22, 2020, through March 17, 2020, are not available in any of the three categories. It’s generally true that the number of abortions in the United States far outpaces the number of deaths to COVID-19 or the flu. But the numbers included in this post are not in line with the best data.", "Abortion is an elective procedure, not a disease.", "For a statement that contains only an element of truth, our rating is Mostly False.", "Facebook, post, March 17, 2020", "World Health Organization, \"Coronavirus disease 2019 (COVID-19) Situation Report – 57,\" March 17, 2020", "U.S. Centers for Disease Control and Prevention, \"Weekly U.S. Influenza Surveillance Report,\" March 14, 2020", "U.S. Centers for Disease Control and Prevention, news release, Feb. 29, 2020", "Email, Amesh Adalja, senior scholar at Johns Hopkins University’s Center for Health Security, March 23, 2020", "Alan Guttmacher Institute, \"Abortion Incidence and Service Availability in the United States, 2017,\" September 2019", "Email, Alan Guttmacher Institute media relations, March 21, 2020", "ABC News, \"US coronavirus death toll surpasses 100; Kevin Durant tests positive,\" March 17, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]