["A bizarre piece of news made headlines on July 27 — a goat was “arrested” by Kanpur police for not wearing a mask. An IANS feed republished by National Herald, Orissa Post and News18 English claimed, “The incident took place over the weekend and the Beconganj police picked up the goat and took it to the police station in a jeep.”", "However, IANS also carried a contradictory statement by Circle Officer, Anwarganj police station, Saifuddin Beg, who said that cops had found a youth without a mask taking the goat along. “When he saw the police, he ran away leaving the goat behind so the policemen brought the goat to the police station. Later, we handed over the goat to its owner,” the officer was quoted. IANS accused the police of “changing” its version of the story.", "News18 deemed the story important enough to be published in Telugu and Bangla languages as well. The channel broadcast a video of policemen loading a goat into their jeep.", "Times Now, Republic and India Times carried similar reports. Times Now too blamed the police of “changing” the narrative. “Now they say they wanted to arrest the man who was seen not wearing a mask instead of the goat,” read the report.", "Other outlets that published articles on the peculiar story were Asianet News (Kannada and Hindi), Kashmir Today, Zee News Tamil, Dainik Bhaskar and Loksatta.", "The story contradicts common sense just by the first reading. It sounds like something one would find on satirical websites, yet was published by legitimate media organisations as “news”. The video of a goat being pushed inside a police van was floating on mainstream media and social media alike. A Twitter user claimed that a person accused Beconganj police of forcefully taking away his goat. Kanpur police replied to the user that an unclaimed goat roaming around Dada Miyan intersection during lockdown was brought to Beconganj police station and handed over to its owner Khanikujjma, son of Mohammed Ali.", "प्रकरण में प्र0नि0 बेकनगंज द्वारा बातया गया कि लॉकडाउन में बकरा लावारिस घूम रहा था जिसको थाने लाया गया, बकरा मालिक मो0 अली पुत्र खनीकुज्जमा नि0 दादामियां का चौराहा, थाना बेकनगंज कानपुर नगर के आने पर उन्हे नियमानुसार बकरे को सुपुर्द कर दिया गया, शेष आरोप असत्य व निराधार है।", "— Kanpur Nagar Police (@kanpurnagarpol) July 27, 2020", "Alt News reached out to Beconganj police and was told that a police van was passing by when locals informed that a goat was roaming unclaimed on the streets. “We brought the goat to the police station in case it gets lost and called the owner. He came and picked it up. The news that we “arrested” the goat for not wearing a mask is completely false,” said the police.", "Mohammad Ali, the goat’s owner, laughed at the inane news reports when we called him for a statement. “The police helped us. Our goat would’ve gotten lost if they hadn’t brought it to the police station and informed us,” he said.", "We also contacted Anwarganj police station Circle Officer, Saifuddin Beg, who has been quoted by several media organisations. He said that the man accompanying the goat was roaming without a mask. The police wanted to catch him but he fled, leaving the goat behind. While his version of events differs from Beconganj police statement, CO Beg maintained that news reports claiming the goat was “arrested” for not adorning a mask are laughable. “Is that even possible?” he asked.", "Media organisations, several led by news agency IANS, therefore published an absurd story as genuine news. It is ridiculous to suggest that the police “arrested” a goat for not wearing a mask when Indian streets are littered with (obviously unmasked) stray animals all the time. While in the past we have noticed outlets falling for satire, this time comical news was crafted out of a real incident. IANS referred to the police as the “butt of jokes” all the while believing that a goat was actually arrested in Kanpur for not wearing a mask during COVID-19. This is a reminder of the time in 2017 when media outlets published reports claiming that donkeys were “detained” by Uttar Pradesh police for eating expensive plants.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A claim that Nobel laureate Amartya Sen has passed away went viral on social media…", "Within hours of Prime Minister of Canada Justin Trudeau alleging that “agents of the government…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…", "On the front page of its national edition dated August 22, Hindi daily Dainik Jagran…", "In his reply to the no-confidence motion brought by the Opposition in the Lok Sabha,…"]