["About this rating", "Former U.S. Presidents Barack Obama, Bill Clinton, and George W. Bush are all younger than President Donald Trump, former Vice President Joe Biden, and Sen. Bernie Sanders.", "Those septuagenarians aren't the only candidates remaining in the 2020 presidential race. Although she has only won a single delegate as of this writing, at 38 years old Rep. Tulsi Gabbard is currently the youngest candidate running for president.", "In March 2020, shortly after Democratic candidates Mayor Pete Buttigieg, Sen. Amy Klobuchar, former Mayor Michael Bloomberg and Sen. Elizabeth Warren all announced that they were dropping out of the U.S. presidential race, a message started to circulate on social media which claimed that the three previous presidents, Barack Obama, Bill Clinton, and George W. Bush, would all be the youngest candidates in the 2020 presidential race if they were to, hypothetically, jump into the contest:", "This tweet is largely accurate. Obama, Clinton, and Bush are all younger than President Donald Trump, former Vice President Joe Biden, and Sen. Bernie Sanders. However, as of this writing, there is one other person in this race: Rep. Tulsi Gabbard, who is the youngest candidate in the field by far at just 38 years old. (Gabbard, however, is long shot for president as she has only secured a single delegate, compared to the 500+ already won by Sanders and Biden each.)", "Other than Gabbard, the youngest candidate in the 2020 presidential race is Trump, who was born on June 14, 1946, and is currently 73 years old. Biden would be the next youngest candidate at age 77 (he was born on Nov. 20, 1942), while Sanders is the oldest at age 78 (he was born Sept. 8, 1941).", "Ages of the current 2020 presidential field:", "Sanders is 78. \nBiden is 77. \nTrump is 73. \nGabbard is 38.", "Obama, Bush, and Clinton are all constitutionally prohibited from running for a third term as president. Hypothetically speaking, however, if they did enter the race they would all be younger than the current field of candidates, excluding Gabbard.", "Bush is the oldest of these three and is only younger than Trump by a month. Bush was born on July 6, 1946, and is currently 73 years old. Clinton, too, is also 73 but he's a few months younger than both Bush and Trump. Clinton was born on Aug. 19, 1946. Obama is the youngest on this list at 58 years old (he was born Aug. 4, 1961).", "Ages of the previous three presidents:", "Bush is 73. \nClinton is 73. \nObama is 58.", "Who is the oldest president in U.S. history?", "When Trump took office in January 2017, he became the oldest person in the history of the United States to win a presidential election at age 70. The previous person to hold this title was Ronald Reagan, who was approaching his 70th birthday when he took office in 1981.", "While Trump is the oldest person to win a presidential election, he isn't the oldest person to serve as president. Reagan still holds that title, as he left office at the age of 77. If Trump wins reelection and serves out his full four-year term, he will surpass Reagan as the oldest president in history.", "Sanders and Biden would both start their terms as president as the oldest people to win elections and the oldest people to serve. Biden would be 78 when he takes office, and Sanders would be 79. As of this writing, we've never had an octogenarian as president of the United States.", "Who is the youngest president in U.S. history?", "While the 2020 presidential election will likely be won by somebody in their seventies, the U.S. has been led by some relatively young chief executives. Theodore Roosevelt was the youngest person to hold the office when he succeeded William McKinley at age 42 after the latter was assassinated in 1901. John F. Kennedy was 43 when he took office in 1961. Clinton and Obama are both among the top five of youngest presidential candidates (3rd and 5th), taking office at ages 46 and 47, respectively. The fourth youngest was Ulysses S. Grant who took office at age 46 in 1869.", "If Gabbard wins the 2020 election, she would become the youngest president in history, taking office before her 40th birthday.", "Monellaro, Zach.   \"Here's what happens to the 2020 dropouts' delegates.\"\r\n    Politico.   3 April 2020.", "Chute, Nate.   \"Will it Be Buttigieg, Biden or Bernie? Here Are the Oldest, Youngest Presidential Candidates in History.\"\r\n    USA Today.   24 April 2019.", "McCarthy, Niall.   \"Trump Is Set To Become The Oldest President In U.S. History [Infographic].\"\r\n    Forbes.   6 January 2017.", "[CORRECTION 03/06/20]: A previous version of this article erroneously stated that Theodore Roosevelt was elected to office in 1901 (Roosevelt succeeded McKinley after the latter was assassinated); that JFK took office in 1963 (he was inaugurated in 1961); and that Ulysses S. Grant took office in 1822 (he was inaugurated in 1869).", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]