["Former JNUSU President and student leader Kanhaiya Kumar has failed his exam for the 11th time in JNU is the claim put forward on social media. On Twitter, a section of users tweeted the information that Kanhaiya has failed 11 times in the JNU exam and slammed him for wasting taxpayers’ money. The following tweet by a Twitter account called Shanknaad was tweeted over 1900 times", "Kanhaiya Kumar has failed yet again, this is 11th time.", "Congratulations communists. Sources claimed that his masters want him to stay in JNU till 2019 elections", "— Ravinder Sangwan (@Shanknaad) April 21, 2018", "JNU मे देशद्रोही कन्हैया कुमार 11वीं बार फैल,", "भाई फ़ोकट का दान मिल रहा है इन भिखारियों को पढने के लिए,", "असल आसतीन के सांप हैं जिन्हें संवैधानिक अधिकार की आड़ में भीख मिली जा रही है!!", "— ANUPAMशर्मा अधिवक्ता (@AnupamSharmaAdv) April 18, 2018", "The youth leader has many detractors who latched on to this information and targeted him. Among them on Twitter was Suhel Seth.", "Someone told me that @kanhaiyajnusu has failed for the 11th time in JNU. Does that make him a worthy applicant to the @INCIndia party? And why the hell are we taxpayers funding this loser’s education or the lack of it?", "— SUHEL SETH (@suhelseth) April 22, 2018", "Later when it was pointed out that no university conducts examination for a PhD and that it requires submission of a thesis, the self-proclaimed marketing maven tried hard to wriggle out. This message has also been circulating on Facebook. On the page I Support Ajit Doval which has over 1.6 million followers, it was uploaded on April 20 and has been shared over 9000 times at the time of writing.", "Posted by I Support Ajit Doval on Friday, April 20, 2018", "Many individual users have uploaded it which suggests that it is being shared on WhatsApp as well. A video on YouTube has also been uploaded with this claim by a person named Rahul Kedia.", "Speaking to Alt News, Kumar said, “This information is totally fake. There is no exam for PhD. I am a final year student. My thesis is in the final stage and will be submitted by July 21, 2018. The subject of my thesis is ‘social transformation in South Africa’. I enrolled in JNU for the integrated MPhil-PhD program in 2011 which is of 7 years’ duration. I commenced my PhD in 2013. I suspect that someone just created a message with this rumour which then started to circulate. I haven’t even been in JNU for 11 years. This is my 7th and final year.” Kumar also tweeted the same.", "Sensible people know that no university holds PhD exam. You submit a thesis. No university lets you stay enrolled after failing any exam 11 times. Its classic fake news presented without proof or common sense", "Also to the disappointment of many,I have never failed any exam ever😀", "— Kanhaiya Kumar (@kanhaiyajnusu) April 22, 2018", "Student leaders like Kanhaiya Kumar and Shehla Rashid have often been at the receiving end of misinformation and the narrative that they are wasting the hard earned money of honest taxpayers by prolonging their education and indulging in politics in the meantime is often used to target them.", "Donate Now", "Arjun Sidharth is a writer with Alt News. He has previously worked in the television news industry, where he managed news bulletins and breaking news scenarios, apart from scripting numerous prime time television stories. He has also been actively involved with various freelance projects. Sidharth has studied economics, political science, international relations and journalism. He has a keen interest in books, movies, music, sports, politics, foreign policy, history and economics. His hobbies include reading, watching movies and indoor gaming.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]