["The Delhi Commission for Women (DCM) has recently been reported to have rebuked BJP Rajya Sabha MP Vijay Goel for putting up posters of Kashmiri women inside his residence. On August 8, Goel had tweeted an image of a hoarding which carried a photograph of a woman in traditional Kashmiri garb. The hoarding flashed the catchphrase – “धारा 370 का जाना तेरा मुस्कराना .” This loosely translates to – “Article 370 gone and you’re all smiles.”", "धारा 370 का जाना तेरा मुस्कराना pic.twitter.com/enYlpUBmks", "— Vijay Goel (@VijayGoelBJP) August 8, 2019", "As it turns out, an old photograph from a blog post was lifted and affixed to the poster. A Google reverse-image search led us to rajeshpusalkar.blogspot.com – which is a personal blog maintained by one Rajesh Pusalkar. In a 2014 post, he penned details about his trip to Kashmir. The photograph of the woman in the BJP hoarding was picked up from this post. Going by the description of the image, it seems that the woman is not even a Kashmiri but a tourist who dressed up in traditional attire to take photographs.", "Since Jammu and Kashmir was stripped of its special status and statehood, Alt News has found several cases of misinformation where old visuals were used to portray the Kashmiri people in support of the dilution of Article 370. An old video of a BJP rally was passed off on social media as Kashmiri children singing in support of the government. An old clip from Bangalore was shared to claim that the Muslim community in Kashmir took out a procession chanting ‘Bharat Mata ki Jai’.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]