["About this rating", "On Nov. 18, 2019, the Duffel Blog published an article positing that U.S. President Donald Trump had issued a pardon to Nidal Hasan, the former Army major who was convicted of killing 13 people during a mass shooting at Fort Hood in November 2009:", "Trump pardons Nidal Hassan", "President Donald Trump has pardoned Ft. Hood shooter Nidal Hassan, his lawyers report.", "“Pathetic lawyers and courts are unfairly judging our men in uniform,” Trump tweeted earlier today. “These people are so far removed from the battlefield they act like Nidal Hasan is a threat to people safe at their desks. SAD!\"", "This item was not a factual recounting of real-life events. The article originated with a website that describes its output as being humorous or satirical in nature, as follows:", "Duffel Blog is a parody of a news organization, and all content it publishes is satirical in nature. No content should be regarded as truthful, and no reference of an individual, company, or military unit seeks to inflict malice or emotional harm. All characters, groups, and military units appearing in these works are fictitious. Any resemblance to real persons, living or dead, or actual military units and companies is purely coincidental.", "The Duffel Blog's satirical piece was commenting on a pair of pardons issued by Trump in November 2019 that some people found worrisome. The president pardoned two former military officials, Green Beret Maj. Mathew Golsteyn and Army 1st Lt. Clint Lorance, who had both been accused of war crimes.", "From the New York Post:", "President Donald Trump on Friday issued full pardons to two former military officers implicated in improper killings.", "The pardon of former Green Beret Maj. Mathew Golsteyn — who is accused of murdering a suspected bomb-maker while deployed in Afghanistan — circumvents a court martial that had been scheduled for February at Fort Bragg, North Carolina.", "Golsteyn has argued that the Afghan was a legal target because of his behavior at the time of the shooting.", "Trump has tweeted in the past that Golsteyn is a “US Military hero” who could face the death penalty “from our own government.”", "Trump also issued a full pardon for Army 1st Lt. Clint Lorance, who’d been found guilty of second-degree murder after nine members of his platoon testified he ordered soldiers to open fire on three men, also in Afghanistan.", "For background, here is why we sometimes write about satire/humor.", "Italiano, Laura.   \"Trump Pardons 2 Ex-Military Officers, Promotes Navy SEAL Eddie Gallagher.\"\r\n    New York Post.   15 November 2019.", "Duffel Blog.   \"Trump Pardons Nidal Hassan.\"\r\n    18 November 2019.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]