["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Timing is everything in politics. So U.S. Rep. Paul Broun didn’t take long to distinguish himself from a new candidate in what could be the most interesting statewide political primary in Georgia in years.", "Broun, an Athens Republican, was speaking to the University of Georgia College Republicans on March 27 when he was asked about the campaign for the U.S. Senate seat being vacated by Republican Saxby Chambliss. That same day, U.S. Rep. Phil Gingrey, a Republican from Marietta, announced he was entering the 2014 race for the Senate seat.", "On the surface, it seems there are few differences between the two candidates. Both men are medical doctors. Both are fierce critics of President Barack Obama’s policies. But Broun told the students there is at least one difference between him and Gingrey.", "\"In the last two years, I have supported and proposed $155 billion worth of targeting cuts. Dr. Gingrey has presented zero,\" Broun said, according to the Red & Black newspaper. \"I have the record, and I have the will to say ‘no’ to the out of control spending. There’s a big difference between the two of us and anybody else who will get in this race.\"", "PolitiFact Georgia wanted to find out if Broun was correct about what he’s done -- and what he said Gingrey has not done.", "First, let’s look at Broun’s proposed cuts. The congressman has introduced several dozen amendments in the past two years to curb federal spending, records show.", "Some of those include legislation in June 2012 to eliminate funding for the Transportation Security Administration that Broun said would save the federal government slightly more than $5 billion. A year earlier, Broun proposed legislation that would cut $940 million in grant funding. He’s proposed cutting the Energy Department’s Office of Science account by $820 million, and reducing the federal government’s Special Supplemental Nutrition Program for Women, Infants and Children by about $600 million.", "None of those pieces of legislation passed.", "Broun also has tried several times to introduce legislation to take away funding for the Patient Protection and Affordable Care Act, known to most as Obamacare. The federal government’s Centers for Medicare & Medicaid Services has concluded the health care law will cost at least $251 billion by 2019. The agency calculated the estimated cost of expanding health care coverage, $828 billion, and subtracted that number by what it believes will be a savings of $577 billion through Medicare, Medicaid and other reforms.", "Broun has suggested replacing the federal health care law with what he calls the \"OPTION Act,\" a plan he says will give Americans complete control of their health care. By considering Broun’s efforts to repeal the health care law alone, the congressman is on the money about the first part of his claim.", "Now, let’s look at whether he’s correct about Gingrey not proposing any cuts. We asked Broun’s team for details. Broun was referring to the House appropriations and re-authorization processes, explained Broun spokeswoman Meredith Griffanti.", "The House Appropriations Committee only accepts legislation on federal discretionary spending from committee members. Discretionary spending -- which excludes iconic programs like  Social Security, Medicare and Medicaid -- accounts for about 40 percent of the federal budget. Like Broun, Gingrey is not a member of the committee. However, Gingrey can offer amendments to resolutions that are proposed. And he can introduce his own resolutions to the entire House of Representatives.", "Gingrey’s team sent us a few examples of cuts that Gingrey authored in resolutions since 2011.", "In January 2011 and January 2013, Gingrey introduced the Federal Employee Accountability Act, which would remove guidelines that allow federal employees to conduct union activities during official work hours. Gingrey argued it would save $1.3 billion over 10 years. Gingrey has pitched the idea a few times in recent years.", "In 2011, Gingrey presented a bill, the State Flexibility Act, which he argued would give states more financial wiggle room and save money. Gingrey argued at the time that 8 million more Americans were projected to join state Medicaid programs in the next few years. PolitiFact Georgia rated that claim Half True.", "Gingrey also has proposed a resolution called the Congressional Budget Accountability Act. The bill would return all funds remaining in congressional office budgets at the end of a calendar year to the Treasury Department to reduce the deficit.", "We asked Kennesaw State University political science professor Kerwin Swint if he thought Broun’s assertion about Gingrey was correct.", "\"If (Broun is) saying it’s zero, it’s not true,\" said Swint, who’s been following Gingrey for years.", "Our conclusion:", "Broun said in the last two years, he has supported and proposed $155 billion worth of targeting cuts, while Gingrey has presented zero.", "We believe the first part of Broun’s claim was on the money. But the second part needs more context to be fully understood. Although Gingrey is not a member of the House Appropriations Committee, he has proposed legislation aimed at cutting discretionary spending.", "Our rating: Half True.", "The Red & Black newspaper, \"2014 Senate candidate Paul Broun speaks on marijuana, gun control,\" March 28, 2013.", "Centers for Medicare & Medicaid Services actuary report on federal health care law, April 22, 2010.", "Emails from Broun for Senate campaign, April 3, 2013.", "Emails from Gingrey for Senate campaign, April 3, 2013.", "Government Executive, \"Lawmaker proposes ban on union activities during work hours,\" Jan. 6, 2011.", "House Resolution 106, Congressional Budget Accountability Act, Jan. 3, 2013.", "Paul Broun information about OPTION Act, March 20, 2012.", "Phil Gingrey blog post, Jan. 7, 2013.", "PolitiFact Georgia, \"Gingrey says 8 million ‘extra’ people to join Medicaid,\" Sept. 15, 2011.", "Telephone interview with Kennesaw State professor Kerwin Swint, April 4, 2013.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]