["A Facebook page, Being Namo, shared an image of Congress president Rahul Gandhi, Rajasthan CM Ashok Gehlot and Dy. CM Sachin Pilot visiting a confectionery shop. In the image, a poster can be seen on the glass wall at the entrance of the shop which reads, “राहुल गाँधी के प्रधानमंत्री बनने तक उधारी बंद (No more lending to customers till the time Rahul Gandhi becomes the Prime Minister -translated)”. The message attached to the image claims, “फोटो रोड शो के दौरान ली गयी है! (This photo was clicked during a roadshow)”. The post suggests that this picture was clicked at a recent Rahul Gandhi roadshow where the shop had a such a poster. It is an attempt to mock and suggest that Rahul Gandhi is not going to become the Prime Minister in the foreseeable future.", "Many other individuals on Twitter and Facebook have shared this image with an identical narrative. A post by Facebook page, Mission Modi, has also garnered more than 500 shares.", "Alt News found that the original poster in the shop was digitally superimposed with another poster. A simple reverse search on Google led us to the original image, which features a poster enlisting items available at the store. According to the tweet below, Rahul Gandhi had stopped at a famous confectionery in Bikaner on his way to the Airport from a rally.", "आज रैली के बाद एयरपोर्ट लौटते समय रास्ते मे @RahulGandhi जी ने बीकानेर की मशहूर मिठाईयां ख़रीदी pic.twitter.com/nWpNiSgWLa", "— Qazi Nizamuddin (@qazinizamuddin) October 10, 2018", "The poster that was digitally superimposed on the original image is posted below.", "No credit sales till Rahul Gandhi becomes PM. This is ultimate.@KiranKS @astitvam @shakkuiyer @siddarthpaim @nistula pic.twitter.com/KvXsCnnNmJ", "— Chowkidar Naresh shenoy (@mangalpady) November 5, 2014", "ABP News had earlier fact-checked this in 2018 when it went viral in the run-up to the Rajasthan assembly elections.", "With the four more phases of elections to go, the misinformation on social media is expected to amplify. Social media users are advised to avoid sharing any potential misinformation without cross-checking it.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]