["About this rating", "Since 2013, viral stories have parroted (with the aid of copy, paste, and lax editorial standards) details of a single, 22-person pilot clinical trial on the use of cannabis as a treatment for Crohn's disease — an inflammatory bowel disease with no known cure.", "These stories, which almost always carry some form of the headline \"Marijuana Leads to ‘Complete Remission’ Of Crohn’s Disease with No Side Effects, New Study Shows,\" all incorrectly describe the legitimate results of a single study published in the journal Clinical Gastroenterology and Hepatology on 4 May 2013. The viral stories all describe the study in the same way:", "The study included 21 patients suffering from Crohn’s disease. There were 13 men and 8 women. [...] Researchers split the patients into two groups. They began a 10-week study which included eight weeks of treatment and a follow-up two weeks later. One group was given rolled up cannabis containing 115mg of THC and they were instructed to smoke it twice a day. The placebo group was given the same instructions, but their cannabis contained no THC.", "The results of the study are astonishing. In the THC group, 5 of 11 patients saw complete remission. In the THC group, 10 of 11 patients saw their Crohn’s Disease Activity Index drop from 200 to 100. Each patient from the THC group reported that they were sleeping better and they regained their appetite.", "\"Complete remission\" refers to the absence of all symptoms of a chronic or incurable disease. Within the context of Crohn’s disease, complete remission refers to a reduction of symptoms as measured by a metric known as the Crohn's Disease Activity Index (CDAI), which is calculated based on the presence and intensity of a wide range of symptoms and reported as a numeric score. Crohn's disease is considered to be in complete remission when a CDAI score is lower than 150. Extremely severe presentations of the disease score above 450.", "The headline assertion of complete remission in these viral stories comes from an aggressively cursory and context-sparse reading of the results section of that 2013 study’s abstract, which states:", "Complete remission (CDAI score, <150) was achieved by 5 of 11 subjects in the cannabis group and 1 of 10 in the placebo group.", "Indeed, during the course of this study, five individuals in the group of Crohn’s patients smoking marijuana were able to reduce their CDAI score to a point at or below 150 over the course of eight weeks, while only one member of the placebo group did the same. Importantly, this does not mean the researchers concluded that cannabis \"leads,\" causally, to the remission of the disease. The study, with a sample size far too small to make such a bold claim, actually says close to the opposite from a complete remission standpoint:", "Cannabis treatment was not superior to placebo in induction of remission. However, cannabis provided a significantly higher rate of clinical response without any alarming side effects.", "\"Clinical response\" — a lesser measure in clinical trials than remission — refers to a beneficial effect from the treatment. In this study, researchers considered a clinical response from marijuana to be a reduction in CDAI score of 100 points or more:", "A clinical response was observed in 10 of 11 subjects in the cannabis group [...]. Three patients in the cannabis group were weaned from steroid dependency. Subjects receiving cannabis reported improved appetite and sleep, with no significant side effects.", "\"Taking into account that Crohn's disease is a chronic debilitating disease that sometimes severely may compromise patients' quality of life,\" the authors wrote, \"the ability to provide symptomatic relief judicially, in carefully selected patients, should not be overlooked.\" The researchers also discussed the limitations of their study and of any potential cannabis therapies in general:", "It should be noted [...] that our patients were treated for only a short period. It is well known that cannabis dependence exists and patients might have difficulty weaning after prolonged cannabis use, even when the IBD is in complete remission. Therefore, until further data are available, long-term medical cannabis cannot be recommended.", "Some researchers have also criticized this study’s methods as not a true double-blinded placebo study (where neither participant nor researcher knows which group each person is in), as many participants were able to tell if they were in the placebo group or not. It is also noteworthy that after two weeks without cannabis, both placebo group and non-placebo group became statistically identical in terms of CDAI scores.", "Unfortunately, there has not been much in the way of more recent data to work with since that study was published. A 2014 study published in the journal Inflammatory Bowel Diseases — based on patient survey data — suggested that cannabis improved symptoms, but that it also increased the risk of a patient needing surgery:", "Cannabis use is common in patients with IBD and subjectively improved pain and diarrheal symptoms. However, Cannabis use was associated with higher risk of surgery in patients with Crohn's disease. Patients using Cannabis should be cautioned about potential harm, until clinical trials evaluate efficacy and safety.", "A review paper on the topic published in 2015 describes the state of the field this way:", "Until clinical trials with objective measurement of treatment effects over an extended period of time are conducted to examine the safety and efficacy of marijuana for the treatment of IBD, there is insufficient evidence for the use of marijuana for the treatment of IBD.", "Despite these considerable limitations and uncertainties, cloned viral stories from as recently as April 2018 refer to that 2013 study as \"new\" and proof that cannabis can cause complete remission of Crohn’s disease.", "The problem has been exacerbated by what appears to be a network of celebrity Facebook accounts tirelessly resharing various iterations of this and other dubious health stories. An April 2018 version of the \"cannabis leads to complete remission\" post copied from viral website Providr and republished on a website called \"Hiptoro\" was shared  (all within the same 5 minute period on 24 April 2018) by the accounts of:", "While these celebrities have, to our knowledge, no specific expertise in inflammatory bowel disease research or scientific reporting, posting popular health articles that claim to cure a bad thing with a substance that many people enjoy using is a great way to build your online presence.", "It is not, however, a great way to keep the Internet free of dubious claims.", "Have you spotted a celebrity sharing dubious health stories on social media? Please send a link or a screenshot to reportcelebs@snopes.com.", "Hiptoro.   \"Study Proves Cannabis Is a Viable Crohn’s Disease Treatment.\"\r\n    23 April 2018.", "Best. W.R., et al.   “Development of a Crohn's Disease Activity Index. National Cooperative Crohn's Disease Study.”\r\n    Gastroenterology.   March 1976.", "Naftali, T., et al.   “Cannabis Induces a Clinical Response in Patients With Crohn's Disease: a Prospective Placebo-controlled Study.”\r\n    Gastroenterology.   4 May 2013.", "Vu, Michelle P., et al.   “Weeding Out the Facts: The Reality About Cannabis and Crohn's Disease.”\r\n    Clinical Gastroenterology and Hepatology.   May 2014.", "Storr, M., et al.   “Cannabis Use Provides Symptom Relief in Patients With Inflammatory Bowel Disease but Is Associated With Worse Disease Prognosis in Patients With Crohn's Disease.”\r\n    Inflammatory Bowel Diseases.   May 2014.", "Belendiuk, Katherine, A., et al.   “Narrative Review of the Safety and Efficacy of Marijuana for the Treatment of Commonly State-Approved Medical and Psychiatric Disorders.”\r\n    Inflammatory Bowel Diseases.   April 2015.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]