["About this rating", "In December 2018, claims emerged that a speech pathologist had lost her job working with elementary school children in Austin, Texas, simply because she refused to sign an oath not to boycott Israel, as reported by The Intercept's Glenn Greenwald:", "A children's speech pathologist who has worked for the last nine years with developmentally disabled, autistic, and speech-impaired elementary school students in Austin, Texas, has been told that she can no longer work with the public school district, after she refused to sign an oath vowing that she “does not” and “will not” engage in a boycott of Israel or “otherwise tak[e] any action that is intended to inflict economic harm” on that foreign nation ...", "[Bahia] Amawi began working in 2009 on a contract basis with the Pflugerville Independent School District, which includes Austin, to provide assessments and support for school children from the county’s growing Arabic-speaking immigrant community. The children with whom she has worked span the ages of 3 to 11. Ever since her work for the school district began in 2009, her contract was renewed each year with no controversy or problem.", "But this year, all of that changed. On August 13, the school district once again offered to extend her contract for another year by sending her essentially the same contract and set of certifications she has received and signed at the end of each year since 2009.", "She was prepared to sign her contract renewal until she noticed one new, and extremely significant, addition: a certification she was required to sign pledging that she “does not currently boycott Israel,” that she “will not boycott Israel during the term of the contract,” and that she shall refrain from any action “that is intended to penalize, inflict economic harm on, or limit commercial relations with Israel, or with a person or entity doing business in Israeli or in an Israel-controlled territory\" ...", "The anti-BDS [boycott, divestment and sanctions] Israel oath was included in Amawi’s contract papers due to an Israel-specific state law enacted on May 2, 2017, by the Texas State Legislature and signed into law two days later by GOP Gov. Greg Abbott. The bill unanimously passed the lower House by a vote of 131-0, and then the Senate by a vote of 25-4.", "Greenwald's article (and a widely-shared Facebook video which accompanied it) prompted numerous reader inquiries about whether Texas law really does require public contractors to make such commitments not to \"boycott Israel\":", "The story was subsequently picked up by several local and national news outlets.", "The Intercept's article accurately reflected a law signed by Texas governor Greg Abbott in 2017, which did require any and all government agencies and bodies to demand that would-be contractors sign a commitment not to boycott Israel as a prerequisite to entering into a contract with them.", "In October 2017, we examined similar reports in the context of recovery and repair efforts after Hurricane Harvey, finding that the city of Dickinson, Texas, had indeed been forced by the statewide law to require anyone applying for a repair grant to swear that they did not and would not engage in a boycott of Israel.", "Bahia Amawi, as a would-be contractor providing speech pathology services to the Pflugerville Independent School District (a public body), was asked to sign such an oath in September 2018, and according to her lawsuit, when she declined as a matter of conscience, her contract renewal could not be completed.", "In May 2017, Governor Greg Abbott signed the law in question (House Bill 89), which came into effect in September of that year. The law stated that:", "A governmental entity may not enter into a contract with a company for goods or services unless the contract contains a written verification from the company that it:", "Does not boycott Israel; and", "will not boycott Israel during the term of the contract.", "Under the law, \"company\" is defined as including a \"sole proprietorship,\" such as that conducted by Amawi and other individual contractors offering and providing professional services.", "Amawi is suing the Pflugerville Independent School District and Texas Attorney General Ken Paxton in federal court, arguing that H.B. 89 is a violation of the constitutional right to free speech, given that it requires a commitment not to engage in or advocate for a boycott, thereby suppressing only one side of an ongoing political debate in what Amawi's lawsuit argues is an unconstitutional manner.", "Amawi has asked the U.S. District Court for the Western District of Texas to declare the \"no boycott of Israel\" law unconstitutional and unenforcable, order the school district to remove that section from her contract agreement, and declare all similar clauses in other public sector contracts null and void.", "Her court filings included a copy of the contract offered to her, including the following section, which requires the commitment not to engage in a boycott of Israel:", "Pursuant to Section 2270.001 of Texas Government Code, the Contractor affirms that it:", "1. Does not currently boycott Israel; and 2. Will not boycott Israel during the term of the contract.", "Pursuant to Section 2270.001 of Texas Government Code:", "1. \"Boycott Israel\" means refusing to deal with, terminating business activities with, or otherwise taking any action that is intended to penalize, inflict economic harm on, or limit commercial relations specifically with Israel, or with a person or entity doing business in Israel or in an Israeli-controlled territory, but does not include an action made for ordinary business purposes...", "Greenwald, Glenn.   \"A Texas Elementary School Speech Pathologist Refused to Sign a Pro-Israel Oath, Now Mandatory in Many States -- So She Lost Her Job.\"\r\n    The Intercept.   17 December 2018.", "Wiley, Hannah.   \"A Texas School Contractor Says She Lost Her Job Because She Won't Promise Not to Boycott Israel. Now She's Suing.\"\r\n    The Texas Tribune.   17 December 2018.", "Torre, Melanie.   \"Speech Pathologist Sues District, State Over Pledge Not to Boycott Israel.\"\r\n    KEYE.   18 December 2018.", "Rosenberg, Eli.   \"She Lost Her School Job After Refusing to Sign a Pro-Israel Pledge. Now, She's Filing a Lawsuit.\"\r\n    The Washington Post.   18 December 2018.", "MacGuill, Dan.   \"Did a City in Texas Require Harvey Aid Recipients to Promise Not to Boycott Israel?\"\r\n    Snopes.com.   24 October 2017.", "U.S. District Court, Western District of Texas.   \"Amawi vs. Pfleugerville Independent School District and Ken Paxton - Complaint and Jury Demand.\"\r\n    16 December 2018.", "Texas Legislature.   \"House Bill 89 -- Relating to State Contracts with and Investments in Companies That Boycott Israel.\"\r\n    2 May 2018.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]