["“Days ago, Jihadis almost burnt Mangalore city Now a live bomb has been detected in Mangalore International Airport Bcoz of few traitors, Jihadis are getting more power But if police take action against masterminds behind these, Politicians come to their rescue! Disgusting,” tweeted Mahesh Vikram Hedge, the founder of fake news website Postcard News, on January 20.", "His tweet, blaming the Muslim community for planting a bomb in Mangalore International Airport, was liked over 2,500 times and retweeted more than 1,000 times before he took it down. An archived version can be accessed here.", "Another tweet by Pratheesh Viswanath that same day alleged, “Jihadis are looking for ways to penetrate and hit.” Vishwanath is followed by BJP Delhi Spokesperson Tajinder Pal Singh Bagga. His tweet reads, “Bomb found in a left over bag at Mangalore airport. Jihadis are looking for ways to penetrate and hit. Be careful all. Inform to authorities abt any suspicious activities seen around. Inform if seeing any left over bags or anything. Be careful abt jihadis.”", "Viswanath is a member of Vishwa Hindu Parishad (VHP) and had led a strike against the Supreme Court order allowing women’s entry in Kerala’s Sabarimala temple.", "After a quick keyword search, Alt News came across newspaper reports from January 22, according to which the suspect’s name is Aditya Rao. He surrendered before the police, claiming that he had planted Improvised Explosive Devices (IED) at the Mangalore International Airport. The police had recovered the explosives on January 20. Rao confessed two days later.", "According to The Hindu, “The city police are investigating as to whether Aditya Rao, who is suspected to have placed an explosive at the Mangaluru International Airport on January 20, had done so as an “act of vengeance” or if there were others who might have set him up for the task.”", "An article from Times of India says, “Last year, he [Rao] had made a series of hoax bomb calls to Bengaluru’s Kempegowda International Airport for which he was arrested by the cops.”", "Mahesh Vikram Hegde and Pratheesh Viswanath blamed the Muslim community before the police revealed the name of the suspect. Hegde deleted his tweet after it was reported two days that the suspect is Aditya Rao.", "Earlier, a photograph of an RSS worker was shared to falsely claim that he is Aditya Rao.", "Donate Now", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]