["About this rating", "Elon Musk did tweet a real photograph of a sundae originally posted to the Twitter account of Buca di Beppo Italian Restaurant.", "However, the picture was originally posted two years earlier, not while stay-at-home orders resulting from the COVID-19 coronavirus pandemic were in effect in May 2020.", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "Tesla CEO and SpaceX founder Elon Musk created a bit of a stir on May 13, 2020, when he posted a photograph of an ice cream sundae in a martini glass to his Twitter account, along with the caption \"ice cream sundae in a martini glass.\" His follow-up tweet stated, \"Life should be lived.\"\n\nThe picture was controversial in light of stay-at-home orders brought on by the COVID-19 coronavirus pandemic. Musk had also posted a tweet two days prior stating that the Tesla plant in Alameda County in California's Bay Area would reopen against the area's local stay-at-home orders. The Bay Area had been hit hard by the pandemic, and officials announced in late April that, in an effort to slow the virus' spread, they would extend those orders through the end of May 2020.", "The cumulative impression left some viewers with the impression that Musk had posted the picture to demonstrate he had gone out to eat an ice cream sundae in defiance of orders. But internet detectives doing reverse-image searches discovered that the picture of the dessert posted to his Twitter account was identical to one originally taken by the food blogger The Episodic Eater, and reposted on Twitter by the Italian restaurant chain Buca di Beppo in 2017. That prompted some social media users to poke fun at Musk.", "Buca di Beppo responded with a joke itself, referencing Musk's advocacy for sending humans to Mars by stating that it was working with Musk to establish the first restaurant franchise there.\n\nBecause Musk did post a picture of a sundae from the restaurant, but that the picture was posted 2 years prior to the pandemic, we rate this claim \"Mixture.\"", "Taylor, Kate. \"Elon Musk Tweets a Food Blogger's 2017 Photo from Buca di Beppo, Saying 'Life Should Be Lived' as He Advocates for Businesses to Reopen.\"\r\n  Business Insider. 14 May 2020.", "Shabam, Hamza. \"Elon Musk Says He Will Probably Move to Mars.\"\r\n  The Washington Post. 26 November 2018.", "Lin, Rong-Gong. \"6 Bay Area Counties Extend Stay-at-Home Orders Through May.\"\r\n  Los Angeles Times. 27 April 2020.", "Updated to note the original image was taken by the food blogger The Episodic Eater.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]