["The four-minute 15-second video was published in this Facebook post on September 8, 2019. It has been viewed more than 1.9 million times.", "The misleading post's Urdu-language caption translates to English as: “Praise to Allah. Look at the aim of Pakistan’s JF-17 Thunder B jet and please share the video.”", "Below is a screenshot of the misleading Facebook post:", "The video was also shared here, here and here on Facebook and on YouTube here with a similar claim.", "The claim is false; the video does not show Pakistani military jets.", "A reverse image search of keyframes from the video obtained using the InVID analysis tool found different clips had been compiled to create the video in the misleading posts.", "The first portion of the misleading Facebook video, which lasts for one minute 45 seconds, has been taken from this YouTube video published on February 11, 2019.", "The video's caption states: \"This compilation footage shows jets from the Republic of Korea Air Force (ROKAF) firing multiple types of precision-guided munitions.\"", "The YouTube channel that posted the footage describes itself as \"an unofficial channel dedicated to collecting and uploading South Korean Military-related contents for the sake of international audience.\"", "The footage used in the misleading post corresponds exactly with the footage in the Korean YouTube video -- including Korean subtitles -- from the 46 second mark to the one-minute 42-second mark.", "The Korean YouTube channel identifies this section of the footage as dating from 2015 and says the jet and bomb seen in this section of the footage are \"F-15K Slam Eagles - GBU-28 Bunker Buster\".", "Below is a screenshot comparison of the misleading Facebook video (L) and the Korean YouTube video F-15 (R):", "Seoul's defence ministry declined comment on the YouTube footage, saying it had not been edited and released by them.", "In both the misleading footage and the Korean video, a red five point star on a white background is clearly visible on one of the target buildings.", "Below is a comparison of the star in the misleading footage (L) and the Korean video (R) as highlighted by AFP:", "The North Korean flag contains a five point red star against a red background.", "Below is an AFP image showing the North Korean flag:", "The next section of footage in the misleading video, from the one-minute 45-second mark to the one-minute 56-second mark, actually shows a Boeing Small Diameter Bomb (SDB).", "The exact same footage that is used in the misleading post has circulated online since at least 2006 -- for example here and embedded below:", "The first operational JF-17 Thunder jet, which was developed by Pakistan and China, was not delivered to Pakistan until 2007, according to the Pakistan Aeronautical Complex.", "Below is a screenshot comparison of the misleading Facebook video (L) and the earlier footage on YouTube (R) :", "The third clip, which appears from the two-minute 12-second mark to the three-minute 30-second mark in the video in the misleading posts, shows an American air force B-2 bomber dropping a non-nuclear bunker buster bomb.", "The same footage was published in this YouTube video on May 17, 2019.", "It was also published in this article by US based automotive and technology site thedrive.com on May 17, 2019, which said the footage had been released by the United States Airforce.", "The article’s headline states: “New Video Of B-2 Bomber Dropping Mother Of All Bunker Busters Sends Ominous Message.”", "The article states in part: “The B-2 Spirit is still America's silver bullet over 20 years after it entered operational service and 30 years since it began its flight test program.", "“In the past, we have seen some lower quality video of a B-2 dropping a MOP for testing, but now the USAF has posted a very high-quality video of a recent test showing two of the giant weapons being employed near-simultaneously.”", "Below is a screenshot comparison of the video in the misleading posts (L) and the YouTube video of the B2 bomber (R ).", "-- US Air Force AGM-130 Bunker Buster Bomb --", "The last part of the misleading video from the three-minute 31-second mark to the four-minute 15-second mark has been taken from this US Air Force video published on the US Air Force website.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]