["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "President Joe Biden during a break in a televised town hall event in Milwaukee on Feb. 16, 2021. (AP)", "• Indexing the minimum wage to inflation would have produced a wage today between $8.98 and $12.27, depending on which year you started the process.", "• The White House acknowledged that Biden had intended to say that if the minimum wage had been indexed to worker productivity, it would be at $20 an hour today. That’s close to the $24 estimated by a liberal economist. But it’s not what Biden said.", "During a CNN town hall in Wisconsin, Joe Biden misstated an argument in favor of raising the minimum wage.", "Biden and many other Democrats support a phased-in minimum-wage hike to $15 an hour. That would be a significant increase from the current $7.25, a level that has been steady since 2009.", "Biden’s American Rescue Plan includes the wage hike to $15, though it’s unclear whether that provision will be included in the relief legislation now working its way through Congress.", "During the town hall, a member of the audience asked Biden about the wage hike proposal,", "\"Given the lower cost of living specifically in the Midwest, many business owners are concerned that this will put them out of business, forcing them to downsize or cut benefits,\" the audience member said. \"How can you instill confidence in small businesses that this will benefit the Midwest business growth?\"", "Biden said it was reasonable for small business owners to worry about the impact, but he sought to reassure the questioner that the positive impacts would outweigh the negative ones if the change was made gradually.", "\"Here’s the deal,\" Biden said. \"It’s about doing it gradually, where it’s (currently) $7.25 an hour. No one should work 40 hours a week and live in poverty. But it’s totally legitimate for small business owners to be concerned about how that changes.", "\"If we kept (the minimum wage) indexed to inflation, people would be making $20 an hour right now,\" Biden said. \"That’s what it would be.\"", "But Biden muffed his talking point.", "Using the inflation calculator operated by the federal Bureau of Labor Statistics, $7.25 in 2009 would be worth about $8.98 in 2021, which is well short of $20.", "Even if you indexed the minimum wage that had the most purchasing power in history — $1.60 in 1968 — the inflation-adjusted value today would be $12.27, and that’s still short of $20.", "The White House said Biden should have referenced a different method of equalizing the minimum wage across time — if the minimum wage had been indexed for worker productivity, rather than inflation.", "The White House cited a specific blog post from 2020 by Dean Baker, an economist with the liberal Center for Economic and Policy Research.", "In the post, Baker wrote that until 1968, the minimum wage did roughly increase in tandem with worker productivity increases. This pattern, he said, broke down after 1968, with worker productivity consistently rising but the value of the minimum wage declining.", "\"The distinction between inflation and productivity is an important one,\" Baker wrote. \"If the minimum wage rises in step with inflation, we are effectively ensuring that it will allow minimum wage earners to buy the same amount of goods and services through time, protecting them against higher prices. However, if it rises with productivity, that means that, as workers are able to produce more goods and services per hour on average, minimum wage earners will be able to buy more goods and services through time.\"", "In the post, Baker calculated that if the minimum wage had risen in step with productivity growth since 1968, \"it would be over $24 an hour today.\"", "Baker told PolitiFact that \"the inflation adjustment can be calculated in different ways, but I can't see any way you get to $20 an hour in 2021.\"", "Biden said that \"if we kept (the minimum wage) indexed to inflation, people would be making $20 an hour right now.\"", "Indexing the minimum wage to inflation would have produced a wage today between $8.98 and $12.27, depending on which year you started the indexing. That’s well short of the $20 Biden said.", "The White House said Biden should have said that if the minimum wage had been indexed to worker productivity, it would be at $20 an hour today. That’s close to the $24 estimated by a liberal economist, but that’s not what Biden said.", "We rate the statement False.", "Joe Biden, remarks at a CNN town hall in Milwaukee, Feb. 16, 2021", "Bureau of Labor Statistics, inflation calculator, accessed Feb. 18, 2021", "CNN, \"The US minimum wage through the years,\" April 9, 2019", "Center for Economic and Policy Research, \"This is what minimum wage would Be if it kept pace with productivity,\" Jan. 21, 2020", "Email interview with Dean Baker, senior economist at the Center for Economic and Policy Research, Feb. 18, 2021", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]