["Social media users are falsely claiming that President Joe Biden ended a Trump-era immigration program targeting sex offenders.", "Some are interpreting the claim as a reference to Immigration and Customs Enforcement's recent cancellation of Operation Talon, while others are co-opting the falsehood to support baseless QAnon conspiracy theories regarding elite pedophilia.", "“Biden cancels Trumps child sex ring operation which saw thousands of arrests last year,” claims a Feb. 22 post. “Why would he do that?”", "The posts do not specify which policy they are referring to, but several users that posted the claim referred USA TODAY to reports concerning Operation Talon, a Trump administration immigration program that targeted sex offenders who are in the U.S. illegally for deportation.", "Fact check:President Joe Biden, Democrats made remarks from the Rose Garden, not a movie set", "Some commenters expressed support for baseless QAnon conspiracy theories that Biden is part of a pedophilic \"deep state.\"", "In the final few weeks of the Trump presidency, the administration planned Operation Talon, a program that would target for deportation immigrants that are in the country illegally and were also sex offenders.", "On Feb. 7, The Washington Post reported that Immigration and Customs Enforcement officials had canceled Operation Talon. According to the Post, an unnamed senior ICE official said \"the Biden administration had nothing to do with that decision.\"", "The Post reported that ICE still investigates sex crimes through its Homeland Security Investigations.", "A DHS spokesperson told Reuters the program was postponed rather than canceled. Reuters reported that the decision was made by ICE \"operator-level officers\", not the Biden administration.", "Neither USA TODAY nor Snopes could find any official press briefs about Operation Talon from the White House or ICE.", "ICE did not respond to USA TODAY's request for comment.", "On Feb. 18, a coalition of attorneys general from 18 states, led by Missouri Attorney General Eric Schmitt, wrote a letter urging the Biden administration not to cancel Operation Talon to Biden, Secretary of Homeland Security Alejandro Mayorkas and ICE acting Director Tae D. Johnson.", "In the letter, the coalition acknowledged that this was ICE's decision and was likely affected by Biden’s Jan. 20 memo on immigration enforcement.", "“We understand that ICE may have canceled Operation Talon in response to the administration’s January 20, 2021 memo to the Department of Homeland Security calling for a stay of nearly all interior immigration enforcement,” it says.", "The letter expressed concern that sexual predators are among those who have immigrated to the U.S. illegally. They also described cases of rape and human trafficking by smugglers against immigrating women and children.", "The coalition referenced data from Polaris, the nonprofit that runs the National Human Trafficking Hotline, which monitors human trafficking among illegal immigration networks.", "Robert Beiser, the strategic initiative director for sex trafficking at Polaris, told USA TODAY immigrants are much more likely to be trafficking victims than traffickers and that strict immigration policies can actually prevent victims from coming forward.", "Beiser stressed that Polaris’ “focus on preventing trafficking and protecting victims is not directly tied to a deportation policy of traffickers.”", "There is no evidence Operation Talon led to “thousands of arrests” since it was planned in the final weeks of Trump’s presidency. In fact, it is unclear if it was ever implemented.", "Trump frequently addressed human trafficking throughout his presidency. In an Oct. 17 fact check, USA TODAY found that Trump had signed two executive orders, made three proclamations and signed eight bills targeting human trafficking.", "However, child sex trafficking prosecution rates declined overall during Trump’s presidency, according to information compiled by Syracuse University.", "QAnon conspiracy theories promote the false narrative that a cabal of satanic and pedophilic liberal elites secretly control the government, media and economy. QAnon followers believe Trump is a savior, uniquely able to defeat this “deep state” and take back the country for average Americans.", "What is QAnon?", "QAnon-linked prophecies have repeatedly proved false, however, many believers continue to push the conspiracy theory on social media.", "Fact check:QAnon post mischaracterizes Quentin Tarantino film images as cannibalism scene", "Viral social media posts that claim President Joe Biden canceled a successful Trump administration anti-child sex trafficking operation are FALSE. This claim originated from confusion about Immigration and Customs Enforcement's recent decision to cancel Operation Talon, which focused on deporting immigrants who are in the U.S. illegally who have committed sex crimes. ICE officials have reportedly said this decision did not come directly from the Biden administration. There is no evidence Operation Talon led to \"thousands of arrests\" since it is unclear if it ever launched.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook."]