["The photos were published in this Facebook post on January 15, 2020. The post has been shared over 500 times.", "Below is a screenshot of the misleading post, with the first five photos numbered:", "The post’s Tagalog-language caption translates to English as: \"DUTERTE ADMINISTRATION ON RELIEF OPERATION | Because the Mainstream Media do not want to release these we Social Media Volunteers will Release how The current Administration is helping. / 'Team PRRD on Action at TAAL ERUPTION VICTIMS’ / Pls... Pls.. Share.. Share. So everyone will see.. TRADEMARK DUTERTE TRADEMARK CARE #kuyaprincegie\".", "The acronym PRRD refers to Duterte’s full name, President Rodrigo Roa Duterte.", "The post comes just days after ten of thousands of people were forced to flee their homes when Taal, which sits just south of Manila and is one of the country's most active volcanoes, burst to life on January 12, spewing thick ash and triggering nearby earthquakes. Authorities say the threat of a potentially catastrophic eruption remains high, despite a \"lull\" in spewing ash, AFP reported here on January 16, 2020.", "The same photos were also shared in recent days on Facebook here and here alongside captions touting the Duterte government’s disaster relief efforts.", "However, these claims are false; the photos have circulated in government press releases and news reports regarding past natural disasters in the Philippines, including a series of earthquakes in Mindanao in 2019, Typhoon Mangkhut in 2018 and Typhoon Koppu in 2015, which occurred before Duterte was elected president.", "AFP found that photos 1, 3 and 4, which show relief packages being carried off vehicles, were all published on government agency Facebook pages between November 1-3, 2019, just days after a series of deadly earthquakes struck Mindanao on October 29 and 31, 2019. The photos were published respectively here, here and here and all bear captions that describe earthquake relief efforts.", "\"As our way of expressing our concern for our fellow Filipinos affected by earthquake in Mindanao, the DSWD Field Office VI is sending family food packs for DSWD Field Offices 11 and 12 tonight,\" one caption reads.", "Below are screenshot comparisons of photos 1, 3, and 4 in the misleading Facebook post (L) and the photos published on the government Facebook pages (R):", "Photos 6 and 7, which show aid packages being loaded onto a vessel, were traced back to this post on Facebook by SunStar Davao, a local newspaper in Mindanao.", "The post's caption reads: “LOOK: Hygiene kits, food packs, and other goods arrive here at Sasa port from Zamboanga City LGU and DSWD Zamboanga received by Phil. Coast Guard. These are for relief operations for the quake-hit areas in Davao del Sur and North Cotabato as augmentation for DSWD 11 and 12. via Macky Lim, photojournalist”.", "Below are screenshot comparisons of photos 6 and 7 in the misleading Facebook post (L) and the photos published on the SunStar Davao Facebook page (R):", "Photo 5 appears in this September 2018 report by the state-run Philippine Information Agency about relief goods being delivered to those affected by Typhoon Ompong, the local name of Typhoon Mangkhut, in Northern Luzon and the Cordillera Administrative Region.", "The photo's caption reads: “Soldiers from 5th Infantry Division, Philippine Army based in Gamu town unload relief goods from Davao City. The relief goods were delivered to the severely affected families in Northern Luzon and CAR provinces on Sept. 20. (Photo from DPAO)”.", "The aid was delivered after the storm killed several people and forced tens of thousands in Luzon to flee their homes, AFP reported here on September 16, 2018.", "Below is a screenshot comparison of photo 5 in the misleading Facebook post (L) and the photos published on the Philippine Information Agency website (R):", "Photos 2 and 8, which show soldiers deplaning relief boxes, were published here on the Philippine news website Rappler on November 7, 2015 and here on the Official Gazette, a Philippine government publication, on October 21, 2015.", "The Rappler photo’s caption reads: “RELIEF GOODS. Members of the Philippine Air Force bring relief goods to Aurora province, after it was struck by Typhoon Lando in October 2015. Photo by Jansen Romero/Rappler”.", "Typhoon Lando is the local name for Typhoon Koppu, a devastating tropical cyclone that killed dozens and displaced thousands in the northern Philippines, AFP reported here on October 20, 2015.", "Below is a screenshot comparison of photo 2 in the misleading Facebook post (L) and the photo published on the Rappler website (R):", "The Official Gazette report reads, in part: “The Philippine Air Force, Army, National Police, the Bureau of Fire Protection, and local governments cooperate to unload relief supplies from the Department of Social Welfare and Development from C130 aircraft which flew from Villamor Airbase to send aid to ‪Lando‬-struck Aurora. (Photos by: A1C Yupangco, PIO-PAF)”.", "Below is a screenshot comparison of photo 8 in the misleading Facebook post (L) and the photo published on the Official Gazette website (R):", "Furthermore, Duterte was not elected president of the Philippines until May 2016. Typhoon Koppu occurred under the presidency of Benigno Aquino III.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]