["One of the key ingredients that has contributed to Prime Minister Narendra Modi’s success is his ability to manage popular perception. In fact, portrayal of PM Modi as a karmayogi (a doer) and as a doyen with regard to administration and governance was instrumental in catapulting him and his party to majority in the Lok Sabha in the general election of 2014.", "This assertion that PM Modi is an administrative genius was sought to be legitimised by reiterating that some of the leading public figures in the world in the fields of management, academia and business have endorsed Modi’s competence. The supposed views of these leading public figures were shared widely by supporters, sympathisers and enthusiasts of Prime Minister Narendra Modi. Consider these examples.", "It is claimed that Philip Kotler, an American marketing consultant, author and academic had said the following words about Prime Minister Narendra Modi.", "Alt News contacted Professor Philip Kotler who is currently teaching at the Kellogg School of Management, Illinois. In an email conversation, Prof. Kotler said,", "“Thanks for bringing this quotation to my attention. The first part is correct that I have taught marketing theory to many people. I have also separately praised Narendra Modi for his leadership in some miscellaneous writing. But I never said: “but I cant teach marketing skills to Narendra Modi, he knows everything.”  I would never say that there is anyone in the world who knows everything.”", "Professor Louise Richardson, Vice-Chancellor at Oxford University, U.K is another well-known figure who was supposedly in awe of Prime Minister Narendra Modi’s management skills. It has been claimed that Professor Richardson in a speech to her students had said, “if there’s anybody who can teach you better management skills than us, it’s the Indian PM; you should listen to his speeches often.”", "Alt News sent an email to Professor Richardson soliciting a response as to whether she had indeed said such a thing. Responding to our email, Executive Officer to the Vice-Chancellor Dr. Bethan Williams confirmed that Prof. Richardson had not said these words.", "“I am all praise for the Indian PM, the steps he has taken, will bolster the economy and growth rate”. These are the words ascribed to Jim Yong Kim, President of the World Bank.", "Alt News contacted World Bank in order to ascertain the veracity of the quotation. World Bank Press Secretary David Theis in an email conversation said,", "“I have looked into the alleged quote from the World Bank, and can find no credible evidence of its veracity. It appears to be extrapolating from something said in 2016, which you’ll find in this video:”", "Dr. Kim says in the video: “We’re extremely pleased with the progress being made in the six priority areas. Prime Minister Modi and his government have set difficult targets, and I have been pleasantly surprised by how much progress has been made…India’s success over the last two years is one of the true bright spots…in the global economy.” Hope this answers your question.", "Microsoft founder and philanthropist Bill Gates, according to the quote ascribed to him had said “I have seen many Leaders fail to perform under pressure, but PM Narendra Modi is perhaps the only leader I’ve come across who’s unaffected under pressure.”", "Alt News contacted Bill Gates and also the Bill and Melinda Gates Foundation to verify if such a statement had indeed been made by Bill Gates. We also individually contacted representatives of the Foundation. Alt News will update the story after it has elicited a response from Gates or her/his representative. It may however be noted that the source of this quotation is the same as that of the other fake quotes listed above. Moreover, a statement of this nature from a public figure like Bill Gates would have been reportedly widely by the media, but no such record is to be found.", "Actor and BJP MP Paresh Rawal (1,2,3) was among those who had shared these quotes on his Twitter timeline.", "Desi Mojito, a Twitter handle also tweeted these quotes on April 26, 2018. This post has been retweeted almost 1800 times.", "This is enough for us to re-elect Modi ji in 2019 pic.twitter.com/H3hYL015zW", "— Desi Mojito (@desimojito) April 26, 2018", "These quotations carry the logo of The Fearless Indian which has a popular presence across social media platforms. However, these images can no longer be found on its pages and have likely been deleted. The above quotes have also been posted on websites such as www.indianceo.in and www.lolbaba.com. It may be noted that these quotes were shared widely after the demonetisation move announced by the Government in November 2016.", "Social media has become a significant battleground for political parties. Various platforms are used by supporters to bolster the image of political parties and leaders. Political propaganda often blurs the line between fiction and fact. In the pursuit of representing PM Narendra Modi as a supremely capable leader, fake quotations were ascribed to leading celebrities and circulated widely.", "Donate Now", "Arjun Sidharth is a writer with Alt News. He has previously worked in the television news industry, where he managed news bulletins and breaking news scenarios, apart from scripting numerous prime time television stories. He has also been actively involved with various freelance projects. Sidharth has studied economics, political science, international relations and journalism. He has a keen interest in books, movies, music, sports, politics, foreign policy, history and economics. His hobbies include reading, watching movies and indoor gaming.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]