["Jason Kander, a Democrat running against Republican Roy Blunt for one of Missouri’s U.S. Senate seats, says his opponent \"voted to raise his own pay 12 times\" while in Congress. What are the facts behind this claim?", "Kander provides sources in this document on his website and even provides quotations from the Congressional Research Service. But providing a source doesn’t necessarily make a claim factual. So we took a deeper look into the legislation itself, and how congressional pay raises occur.", "In 1989, Congress approved an annual cost-of-living adjustment to member’s pay as part of an ethics reform bill. The yearly adjustment percentage is based on private-sector wage changes and is applied automatically unless denied by a congressional statute. This created a system in which members of Congress can receive pay raises without explicitly voting for them on the record.", "What Blunt did was vote against measures to stop the yearly pay adjustment from occurring.", "Each of the times Blunt is alleged to have increased his pay came between 1997 and 2010, when Blunt was still a member of the House of Representatives for Missouri’s 7th District.", "Here’s how it breaks down year by year.", "1997", "Blunt’s first year in Washington was preceded by five consecutive years of Congress voting to not adjust their pay, but that streak would not continue. The Senate and House versions of the 1998 Treasury and General Government Appropriations bill (S. 1023 and H.R. 2378, respectively) differed on the inclusion of a pay freeze, with the Senate version supporting no raise. The two chambers agreed to a conference to iron out the differences, with the House voting 229-199 to \"order the previous question,\" which is legalese for ending debate and bringing the measure to an immediate vote.", "The vote, which Blunt supported, meant that no pay freeze could be added to the bill and sent H.R. 2378 to conference without instructions to stop the automatic pay increase. This led to the Senate wording being dropped from the final bill, which was signed into law on Oct. 10, 1997. Members of Congress’ pay increased 2.3 percent to $136,700.", "On Oct. 2, 1997, Blunt told the St. Louis Post-Dispatch \"I believe keeping the current salary of Congress equal with the rate of inflation is the right thing, and a necessary thing to do to be able to attract people to seek congressional office in the future.\"", "1999 through 2007", "From 1999 through 2007, similar actions to those in 1997 were taken in the House to order the previous question before an amendment to stop the pay increase could be proposed. For some of these years, the Congressional Research Service said \"it cannot be said with any degree of certainty that Members would have voted to deny a pay increase if they had been given an opportunity,\" as amendments other than the pay freeze were suggested before the House voted to order the previous question. Some years, however, Representatives made clear their intention to introduce a pay freeze before the vote to order the previous question was taken.", "Every year from 1999 through 2007, Blunt voted in favor of ordering the previous question.", "As a result of the automatic increases, the pay of members of Congress increased from $136,700 in 1999 to $169,300 at the start of 2008.", "2009", "On Feb. 25, 2009, the House voted to add a provision to an omnibus appropriations act that would prohibit the automatic pay adjustment for 2010. Blunt was one of only 24 members of the House to oppose this, with 398 members voting in favor of it. Blunt also voted against the omnibus appropriations act as a whole, but this time was joined by 178 members of the House, with 245 members voting in favor of it.", "As a result, congressional salaries, including Blunt’s, did not increase.", "2010", "Well into the recession, bills were being proposed to stop pay adjustments for 2011, instead of just tacking the legislation on as an amendment to a larger bill. Blunt voted in favor of one of these bills, which passed the House 402-15 and went on to become law.", "So Blunt actually voted against the automatic pay increase in 2010.", "The vote Kander claims is a vote to increase Blunt’s pay this year comes from the Continuing Appropriations and Surface Transportation Extensions Act, which froze the pay of some federal civilian employees for two years. While this isn’t a direct vote on his own pay, the 1989 ethics reform bill, which began the automatic pay increases for members of Congress, specifies that their pay cannot be increased by a higher percentage in a year than that of general schedule employees.", "So a vote against this could be seen as a vote to protect Congressional pay increases, though it may be even more of a stretch than Kander’s prior claims. While Blunt actually voted in favor of this bill when it was passed in the House 415-3, Kander points to Blunt’s vote against the conference bill, which resolved the differences between the House’s and Senate’s versions of the bill as a vote to increase his own pay. This final version of the bill passed the house 193-165 on Dec. 21, 2010.", "Our ruling", "Kander said \"Blunt voted to raise his own pay 12 times\" while in Congress.", "This is a misleading attack.", "Blunt did not literally vote to increase his pay 12 times. He voted in support of measures that could have blocked or limited automatic cost-of-living increases from taking effect.", "Even all of those cases aren’t clear-cut, as sometimes Blunt sided with efforts to stop the automatic pay increase.", "Kander’s statement contains an element of truth but ignores critical facts that would give a different impression. We rate it Mostly False.", "https://www.sharethefacts.co/share/dbb9976c-3393-4a9a-aade-aed04f05f843", "Missourians for Kander, \"Question,\" Aug. 10, 2016", "JasonKander.com, \"MO Should Know,\" accessed Oct. 16, 2016", "JasonKander.com, \"Blunt has supported raising his own pay 12 times and defended it as ‘the right thing’ to do,\" accessed Oct. 16, 2016", "Congressional Research Service, \"Salaries of Members of Congress: Congressional Votes, 1990-2016,\" June 21, 2016", "Congress.gov, \"S.1023 - Treasury and General Government Appropriations Act, 1998,\" accessed Oct. 16, 2016", "Congress.gov, \"H.R.2378 - Treasury and General Government Appropriations Act, 1998,\" accessed Oct. 16, 2016", "St. Louis Post-Dispatch, page 30, Oct. 2, 1997", "Clerk.house.gov, \"Final vote results for roll call 435,\" Sept. 24, 1997", "Clerk.house.gov, \"Final vote results for roll call 300,\" July 15, 1999", "Congress.gov, H.R.246, accessed Oct. 16, 2016", "Congress.gov, H.R.2490 - Treasury and General Government Appropriations Act, 2000, accessed Oct. 16, 2016", "Clerk.house.gov, \"Final vote results for roll call 419,\" July 20, 2000", "Congress.gov, H.R.560, accessed Oct. 16, 2016", "Congress.gov, H.R.4871 - Treasury and General Government Appropriations Act, 2001, accessed Oct. 16, 2016", "Clerk.house.gov, \"Final vote results for roll call 267,\" July 25, 2001", "Congress.gov, H.R.206, accessed Oct. 16, 2016", "Congress.gov, H.R.2590 - Treasury and General Government Appropriations Act, 2002, accessed Oct. 16, 2016", "Clerk.house.gov, \"Final vote results for roll call 322,\" July 18, 2002", "Congress.gov, H.R.488, accessed Oct. 16, 2016", "Congress.gov, H.R.5120 - Treasury and General Government Appropriations Act, 2003, accessed Oct. 16, 2016", "Clerk.house.gov, \"Final vote results for roll call 463,\" Sept. 4, 2003", "Congress.gov, H.R.351, accessed Oct. 16, 2016", "Congress.gov, H.R.2989 - Transportation, Treasury, and Independent Agencies Appropriations Act, 2004, accessed Oct. 16, 2016", "Clerk.house.gov, \"Final vote results for roll call 451,\" Sept. 14, 2004", "Congress.gov, H.R.770, accessed Oct. 16, 2016", "Congress.gov, H.R.5025 - Transportation, Treasury, and Independent Agencies Appropriations Act, 2005, accessed Oct. 16, 2016", "Clerk.house.gov, \"Final vote results for roll call 327,\" June 28, 2005", "Congress.gov, H.R.342, accessed Oct. 16, 2016", "Congress.gov, H.R.3058 - Transportation, Treasury, Housing and Urban Development, the Judiciary, the District of Columbia, and Independent Agencies Appropriations Act, 2006, accessed Oct. 16, 2016", "PolitiFact, \"George LeMieux says Connie Mack repeatedly voted to raise his own paycheck,\" accessed Oct. 16, 2016", "Senate.gov, \"U.S. Senate Roll Call Votes 109th Congress - 1st Session,\" October 18, 2005", "Congress.gov, S.Amdt.2062 to H.R.3058, accessed Oct. 16, 2016", "Congress.gov, H.R.3058 - Transportation, Treasury, Housing and Urban Development, the Judiciary, the District of Columbia, and Independent Agencies Appropriations Act, 2006, accessed Oct. 16, 2016", "Clerk.house.gov, \"Final vote results for roll call 261,\" June 13, 2006", "Congress.gov, H.R.865, accessed Oct. 16, 2016", "Congress.gov, H.R.5576 - Transportation, Treasury, Housing and Urban Development, the Judiciary, and Related Agencies Appropriations Act, 2007, accessed Oct. 16, 2016", "Congress.gov, \"Public Law 109–383,\" Dec. 9, 2006", "Gpo.gov, \"Revised Continuing Appropriations Resolution, 2007,\" Feb. 15, 2007", "Clerk.house.gov, \"Final vote results for roll call 540,\" Dec. 8, 2006", "Govtrack.us, \"H.J.Res. 20 (110th): Revised Continuing Appropriations Resolution, 2007,\" accessed Oct. 16, 2016", "Clerk.house.gov, \"Final vote results for roll call 580,\" June 27, 2007", "Congress.gov, H.R.517, accessed Oct. 16, 2016", "Congress.gov, H.R.2829 - Financial Services and General Government Appropriations Act, 2008, accessed Oct. 16, 2016", "\"Congressional Pay and Perks,\" page 9, Jan. 12, 2010", "Clerk.house.gov, \"Final vote results for roll call 85,\" Feb. 25, 2009", "Clerk.house.gov, \"Final vote results for roll call 86,\" Feb. 25, 2009", "Congress.gov, H.R.1105 - Omnibus Appropriations Act, 2009, accessed Oct. 16, 2016", "Congress.gov, H.R.184, accessed Oct. 16, 2016", "Congress.gov, H.R.5146 - To provide that Members of Congress shall not receive a cost of living adjustment in pay during fiscal year 2011, accessed Oct. 16, 2016", "Clerk.house.gov, \"Final vote results for roll call 226,\" April 27, 2010", "Congress.gov, H.R.3082 - Continuing Appropriations and Surface Transportation Extensions Act, 2011, accessed Oct. 16, 2016", "Clerk.house.gov, \"Final vote results for roll call 529,\" July 10, 2009", "Clerk.house.gov, \"Final vote results for roll call 662,\" Dec. 21, 2010", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]