["About this rating", "On 10 March 2016, Politicalo published an article reporting that Donald Trump, the presumptive Republican nominee for the 2016 election, said he would use nuclear weapons on Mexico if they refused to build and pay for a border wall:", "In a Donald Trump administration, the U.S. military will be so strong that Mexico won’t dare to go to war over the wall Trump wants to build between the two countries. On MSNBC on Wednesday, journalist Bob Woodward asked Trump, “Would you be willing to go to war to make sure we get the money to pay for this wall?” “Trust me Bob, when I rejuvenate our military, Mexico’s not going to be playing with us with war, that I can tell you. Mexico isn’t playing with us with war,” Trump responded Wednesday. One of Trump’s signature proposals is a promise to build a wall between the United States and make Mexico pay for it, despite Mexican officials’ emphatic insistence that they’ll never cough up the dough.", "“Because nobody every messes with the American military, everybody knows that, the whole world knows that,” the billionaire businessman added. “We have the single most powerful military machinery in the history of the world, on the entire planet. To go head-on against such an adversary is suicide, and they know that. That’s how I know they’re bluffing, because nobody is willing to commit suicide just to prove a point. And my point is, I’m going to make Mexico pay for that wall, and when I’m done building it, I’m going to get on top and play Bruce Springsteen’s ‘Born In The USA’ to them, just for the hell of it. You just don’t mess with the U.S., and that’s that ... Let me tell you, we’ve had a similar problem with disobedience back in World War II. And you know how we fixed it? We nuked Japan, and then they surrendered very shortly. So, I think that’s a pretty definitive message, and that’s the hard way. Now, I’ve said before that political correctness is what’s killing this country, and I’m standing by it. However, since I’ve never been a warmonger, I’m trying to tell them nicely that the ball is in their court. If they agree to pay, we’ll have no problem. If they don’t and they start acting up, well, we’ll just have to watch a re-run of the Japanese episode.”", "Comments attributed to Trump in the first paragraph were authentic, and came from an MSNBC appearance by the candidate in early March 2016:", "On MSNBC on Wednesday, journalist Bob Woodward asked Trump, “Would you be willing to go to war to make sure we get the money to pay for this wall?”", "“Trust me, Bob, when I rejuvenate our military, Mexico’s not going to be playing with us with war, that I can tell you. Mexico isn't playing with us with war,” Trump responded Wednesday.", "One of Trump’s signature proposals is a promise to build a wall between the United States and make Mexico pay for it, despite Mexican officials' emphatic insistence that they'll never cough up the dough.", "Mexican President Peña Nieto blasted Trump in two separate interviews this week, slamming the billionaire's “strident expressions” to a Mexico City newspaper and warning that the kind of rhetoric he uses has led to “very fateful scenes in the history of humanity.”", "“That's the way Mussolini arrived and the way Hitler arrived,” Peña Nieto said. Trump's comments, he told El Universal, have \"hurt the relationship we have sought with the United States.\"", "The first portion of the article may have led readers to think that the subsequent claims were real, but everything beyond its first paragraph was fabricated. Content published by the self-styled \"hybrid\" news sites Newslo, Religionlo, and Politicalo built upon controversial current events with related embellishments. Politicalo and related sites featured a button enabling readers to \"Show Facts\" or \"Hide Facts\":", "However, every Newslo, Politicalo, and Religionlo item opened in \"Hide Facts\" mode by default, making the embellishments difficult for readers to identify. In addition to its \"Show Facts/Hide Facts\" feature, Politicalo's disclaimer explained:", "Newslo is the first hybrid News/Satire platform on the web. Readers come to us for a unique brand of entertainment and information that is enhanced by features like our fact-button, which allows readers to find what is fact and what is satire.", "Previous Newslo, Religionlo, and Politicalo articles that caused social media confusion included claims that Marco Rubio said women should be taken into custody if they were considering an abortion (and that Zika was a punishment from God), Pat Robertson said gay people should wear colors by which heterosexual people could identify them in public, Pastor John Piper said bikini waxes were a sin in the eyes of God, David Bowie was alive but held hostage by Satanic entities, Ted Cruz said God would not have allowed Antonin Scalia to die at a time that was not politically expedient, a Republican lawmaker proposed saliva-based \"hunger tests\" for food stamp recipients, and Bristol Palin said that more black actors weren't nominated for Oscars because they all looked alike.", "In the case of this article, there is already a wall that stretches nearly 2,000 miles between the United States and Mexico, making Trump's statements (whether or not they were real) moot:", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]