["The image was shared in this Facebook post on June 14, 2019. It has been shared more than 15,000 times. The photo shows Imran Khan sitting on a chair while others around him stand.", "Khan has been highlighted in the photo with a yellow outline of a four-pointed star shape.", "The post has an Urdu-language caption which translates to English as: “All heads of governments from the entire world rose to welcome the Israeli prime minister, but our Captain did not stand up. Our prime minister had already said that even if the entire world recognises Israel, he will still not recognise it.”", "Below is a screenshot of the misleading Facebook post:", "The same photo was shared on Facebook here with a similar claim.", "Another Facebook post here – published June 14, 2019, and shared more than 1,200 times – contains a similar photo in which Khan is seen looking up at the camera.", "That post has a slightly shorter caption in Urdu which translates to English as: “All heads of the governments from the entire world rose to welcome the Israeli prime minister, but Pakistani Prime Minister Imran Khan did not stand up.”", "The claim is false; Israel’s Prime Minister Netanyahu did not attend the event seen in the images in the misleading posts.", "Keyword searches on Google found that both photos were taken at a summit of the Shanghai Cooperation Organisation (SCO), a Eurasian security alliance, which was held in Kyrgyzstan's capital Bishkek from June 13-14, 2019.", "Here is a press release about the summit released by the alliance.", "Khan’s Pakistan Tehreek-e-Insaf (PTI) party posted this tweet on June 13, 2019. It contains a video that matches the photo in the first misleading post around the timestamp 0:30.", "The caption states: \"Prime Minister of #Pakistan @ImranKhanPTI's Arrival with other World Leaders at Invitation of President of Kyrgyzstan for Opening Ceremony 19th Meeting of the Council of the Heads of State of the Shanghai Cooperation Organization in Bishkek Kyrgyzstan (13.06.19)#SCOSummit2019.\"", "That tweet is embedded below:", "Prime Minister of #Pakistan @ImranKhanPTI's Arrival with other World Leaders at Invitation of President of Kyrgyzstan for Opening Ceremony 19th Meeting of the Council of the Heads of State of the Shanghai Cooperation Organization in Bishkek Kyrgyzstan (13.06.19)#SCOSummit2019 pic.twitter.com/fYdKYN3Fv7", "Below is a screenshot comparison of the photo in the first misleading post (L) and the video posted by the PTI party (R):", "According to this information page on the SCO website, the organisation was launched in 2001 by Kazakhstan, China, Kyrgyzstan, Russia, Tajikistan and Uzbekistan.", "There is no mention of Israel being a member or an observer of the group.", "Below is a screenshot showing the SCO member states, observer states and dialogue partners currently listed on its website:", "The SCO press release about the Bishkek summit does not mention the Israeli premier, nor he can be seen in the group photo of the leaders who attended the summit.", "He is also not present in this similar AFP photo, dated June 14, 2019:", "News articles about Netanyahu published by Israeli media on June 13 and 14, 2019 do not mention the SCO summit; for example this June 13 report in the Times of Israel and this June 14 report in The Jerusalem Post.", "An advanced Twitter search by date found that the only tweet posted by Netanyahu's official account @IsraeliPM on those dates was this one, which shows the prime minister at an unrelated meeting.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]