["About this rating", "The conspiracy internet is extremely predictable in the wake of horrific national tragedies. One of the most common claims made in this cynical, opportunistic online world is the nebulous assertion of a \"second shooter\" during mass shootings, often associated with suggestions of a nefarious but wholly undefined government cover-up or plot.", "Far-right conspiracy theorist and InfoWars founder Alex Jones has proposed the existence of a second shooter at the October 2017 Las Vegas shooting, 2016's Pulse Nightclub shooting in Orlando, and the Aurora movie theatre shooting — to give just a small (but entirely representative) fraction of his analyses. In his click-driven world, the recent Parkland school shooting is no different. The day after the shooting, Jones' site, Infowars.com, reported:", "Eyewitness Alexa Miednik, who believes there was a second shooter, said she was WALKING with accused suspect Nikolas Cruz (who the media previous spelled as Nicolas) after she heard shots being fired – and told Cruz she was glad “it wasn’t him” who was doing the shooting at the school in Florida.", "This is a factual summary of an account of the shooting given to KHOU sports reporter Matt Musil, who was on assignment in Florida covering the Houston Astros training camp at the time of the shooting. During that interview, the Marjory Stoneman Douglas High School student said that she walked out of the school with the (admitted) shooter after the shooting had occurred, remarking to him that “I'm surprised you [Cruz] weren't the one who did it.\"", "Because she saw him after the shooting, she told Musil, she figured there had to be a second shooter if Cruz was involved:", "Musil‏: Oh, you think he was not the only one?\nStudent: No, definitely not.\nMusil‏: Why do you say that?\nStudent: Because when shots were fired, I saw him after the fact, so the shots were coming from the other part of the building, so there definitely had to be two shooters involved, I believe.", "That belief notwithstanding, the student’s account is fully consistent with the story Cruz gave to police and the other official accounts of the event. As stated in his arrest warrant, Cruz ditched his gun after the shooting and slipped out of the crowd as one of the hundreds of fleeing students — a scenario consistent with the student’s report.", "Cruz also admitted that as students began to flee the campus on foot he decided a plan to discard his AR-15 and vest with the additional magazines so he could blend into the crowd. Once the crime scene was secured, the discarded AR-15 rifle and vest — with magazines — was found in areas consistent with Cruz's version of events.", "This is, as a matter of fact, the reason it took so long before police could detain the suspect, causing a lengthy period of uncertainty about his whereabouts. He was eventually caught away from the scene of the crime \"after buying a drink at a Subway restaurant,\" according to USA Today.", "Infowars.com later identified a second student’s testimony purportedly referencing a second shooter. That testimony, given by a student who was interviewed by multiple outlets and who appeared in at least one television news segment, comes with an understandable lack of clarity given the frantic nature of the interviews and their immediacy with respect to the event itself. Her answers are filled with ambiguous pronouns making it possible for people like Jones to sow doubt and build their own meaning out of the confusion. In one of those videos, a reporter asked if there was a second shooter, but her answer (which actually cuts off the end of the reporter’s question) is further muddled by the sound of a vehicle in the background:", "Reporter: Do you think there was more than one shoot —\nStudent: There were three [shootings?/shooters?] that's what I heard...", "It is unclear if the student, who was responding to a sea of reporters directly after a horrific, violent attack, meant she heard three different bursts of gunfire (Cruz brought multiple magazines to the school in a backpack according to the warrant), or if she heard evidence that there were \"three shooters\" (one more, it bears mentioning, than Infowars.com had been alleging).", "In any event, throughout the rest of that interview, and in interviews with numerous other outlets, she repeatedly refers to the shooter as a single male person, using the words \"he\" and \"him\" to refer to the person perpetrating the murders.", "Jones and his ilk use this kind of first-hand, ambiguous, in-the-moment information to sow doubt about the “official” narrative given by the “mainstream media.” This allows them to raise, but not demonstrate, the specter of a nefarious government plot to steal the American populace’s guns — that \"false flag\" argument that is in vogue on conspiracy websites these days.", "Jones made this connection explicit in a 15 February 2018 segment on his podcast:", "Wow, we said the perfect false flag would be a white nationalist attacking a multicultural school as a way to make the leftists all look like victims and bring in gun control and a war on America’s recovery and now right on time what we’ve been warning of, their main card, the thing we said was imminent, appears with all the evidence.", "The fact of the matter is that while these videos may not offer complete clarity, they are far from proof of anything that goes against the official narrative presented by police and admitted to by the perpetrator himself.", "The primary interview used to make the argument of a second shooter tells a story wholly consistent with the actions of the single shooter, if — as Cruz later testified — he escaped along with the crowd. The second interview is far too ambiguous to allow anyone to draw definitive conclusions, and it could also just as convincingly be interpreted as evidence of a single shooter. As such, we rank claims of eyewitness accounts confirming a second shooter as false.", "Infowars.   \"Second Shooter? Footage Appears to Show Las Vegas Gunfire Didn’t Come from 32nd Story.\"\r\n    2 October 2017.", "Infowars.   \"Witness Describes Second Shooter, Accomplice Blocking Door in Orlando.\"\r\n    12 June 2016.", "Infowars.   \"Eyewitness Account: James Holmes Possible Second Shooter in Tragic Batman Denver Shooting.\"\r\n    21 July 2012.", "Daniels, Kit.   “Video: Second Shooter Reported in Florida Massacre.”\r\n    Infowars.   15 February 2018.", "New York Times.   \"Arrest Papers for Nikolas Cruz.\"\r\n    15 February 2018.", "Stanglin, Doug, and James, MIke.   “Florida school shooting suspect ordered a drink at Subway after deadly assault.”\r\n    USA Today.   15 February 2018.", "Media Matters.   \"Alex Jones: Florida School Shooting Was “The Perfect False Flag.\"\r\n    15 February 2018.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]