["This is one of the photos that appeared with a Facebook post claiming that a couple pointed guns at protesters.", "Mark and Patricia McCloskey issued a statement indicating they support Black Lives Matter.", "Mark McCloskey has donated to Democratic and Republican candidates, but in recent years only Republicans, including President Donald Trump.", "Mark McCloskey represents a client who has filed a police brutality lawsuit.", "A conservative activist painted the St. Louis couple who pointed guns at protesters marching outside their home as liberals who are actually aligned with the protesters.", "The \"gun-toting couple,\" wrote Benny Johnson, support Black Lives Matter, are Democrats, and are representing a victim of police brutality.", "\"The media is going to have a hard time comprehending this since they spent all of last night and this morning smearing them,\" wrote Johnson, chief creative officer of Turning Point USA, a conservative group founded by Charlie Kirk.", "Johnson made the claim about Mark and Patricia McCloskey in a tweet, an image of which was then shared in a Facebook post June 29.", "The Facebook post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Johnson deleted the tweet after he said he discovered a portion of it was inaccurate.", "Protesters seeking the resignation of St. Louis’ mayor in a controversy over police reform marched toward the mayor’s house and past the McCloskeys’ home.", "The couple stood outside their home and brandished guns at the marchers, with Mark McCloskey saying his family feared for their lives because they said marchers had broken through a wrought iron gate that secured a private street in the neighborhood.", "The local prosecutor is investigating to see whether the couple should be charged.", "Now to the three parts of the claim.", "The McCloskeys expressed support for Black Lives Matter in a statement released by their attorney, Albert Watkins, the day after the June 28 incident.", "\"The peaceful protesters were not the subject of scorn or disdain by the McCloskeys. To the contrary, they were expecting and supportive of the message of the protesters,\" the statement said.", "The statement also quotes Watkins as saying:", "\"The Black Lives Matters movement is here to stay, it is the right message, and it is about time. The McCloskeys want to make sure no one thinks less of BLM, its message and the means it is employing to get its message out because of the actions of a few white individuals who tarnished a peaceful protest.\"", "The tweet from Johnson included what appears to be a screenshot of Federal Election Commission data showing the name of Mark McCloskey and ActBlue. No other data is shown, but presumably the screenshot purports to show McCloskey donated to the group.", "ActBlue is a platform for people to contribute to Democratic campaigns and other causes like Black Lives Matter.", "Johnson apparently realized he erred on this part of his claim.", "On June 30, Johnson tweeted an image of that tweet with this message: \"I deleted this tweet because the FEC screenshot that went viral online was from a different donor of the same name.\"", "According to the FEC, Mark McCloskey of the viral video made 20 contributions between October 2016 and February 2017 to the Republican National Committee or Donald Trump’s presidential campaign. Those are his most recent campaign contributions.", "McCloskey also made a few donations in 1996 to Republican politician Bill Phelps’ congressional campaign, a primary committee for the 1988 Bush-Quayle ticket, and the National Republican Congressional Committee.", "FEC records show that he has donated to Democrats in the past. Between 2004 and 2012, McCloskey donated to Democratic candidates, including Missouri Sen. Claire McCaskill.", "On June 29, it was reported that a Democrat running for a Missouri state Senate seat said his campaign won’t keep a $250 contribution he received from Mark McCloskey in 2019.", "We didn’t find any donations from Patricia McCloskey in the FEC database.", "So, based on the pattern of their recent campaign contributions, it’s wrong to say the couple are Democrats.", "In Missouri, voters do not register a party affiliation.", "Mark McCloskey represents Isaiah Forman, a man who is suing a police officer over injuries sustained during an arrest. According to a March 6 Associated Press news article:", "Forman is serving a seven-year prison sentence after pleading guilty to second-degree assault on a special victim for crashing into a St. Ann, Mo., police car during an April 2019 chase. David Maas, then a police officer in suburban Woodson Terrace, kicked and struck Forman while he was compliant and not posing a physical threat to anyone, causing \"bodily injury\" and depriving him of his right to be \"free from unreasonable force,\" according to an indictment filed against Maas. Maas has been charged by the U.S. attorney’s office in St. Louis with one count of deprivation of rights under color of law.", "A lawyer for Maas denied the claims in the lawsuit and said Forman \"aggressively resisted arrest\" and \"struck a police vehicle, narrowly missing a police officer in the process.\"", "A viral image shared on Facebook claimed that a lawyer-couple who pointed guns at protesters are Black Lives Matter backers, Democrats and represent a police brutality victim.", "There is some truth to it. The couple expressed support for Black Lives Matter after the incident, via a statement from their attorney. And Mark McCloskey represents a man who has filed a lawsuit alleging police brutality.", "But there’s a reason the tweet was taken down. It uses campaign donation data from the wrong Mark McCloskey. The Mark McCloskey in the video has donated to both Democratic and Republican candidates, including multiple donations to the Republican National Committee and President Donald Trump.", "We rate the statement Half True.", "Facebook, post (archived here), June 29, 2020", "Twitter, Benny Johnson tweet, June 30, 2020", "PolitiFact, \"What we know about the St. Louis couple who pointed guns at protesters, fearing 'angry mob,’\" June 30, 2020", "Snopes, \"Did Mark McCloskey Donate to Democrats? After the couple pointed guns at protesters, rumors started to circulate about the McCloskeys' political affiliations,\" June 30, 2020", "Twitter, Rob Edwards tweet of statement, June 29, 2020", "Federal Election Commission, Mark McCloskey contributions from 2010-2020, accessed June 30, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]