["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A blog post that’s been shared widely on social media paints a dramatic, early morning scene — and all of it is bogus.", "Around 3 a.m. on Jan. 26, according to a site called Real Raw News, a sniper’s bullet struck the window of former President Donald Trump’s bedroom at Mar-a-Lago, his private club in Palm Beach, Fla.", "\"Trump assassination foiled, Deep State in panic mode!\" the headline says.", "Citing \"a confidential source within Trump’s inner circle,\" the blog goes on to say that the bullet \"triggered a silent alarm that instantly notified the Palm Beach Police Dept. and Trump’s Secret Service detail.\"", "The blog goes on: \"Trump’s people suspect the attack was carried out by the Deep State, to stop Trump from amassing incriminating evidence that, if released, could sink every Democrat from Joe Biden to the most junior member of the Democratic caucus.\"", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Both the Secret Service and the Palm Beach Police Department told PolitiFact that this blog post is bunk.", "\"The narrative presented here is completely false,\" a spokesperson for the Secret Service said.", "And the police department, which was supposedly alerted by this bullet, received \"no such information,\" said spokesperson Michael Ogrodnick.", "We found no news coverage to support the account in this blog post. Previous episodes involving weapons and gunfire at Mar-a-Lago during Trump’s presidency were widely covered in the news.", "In August 2020, for example, three teens were arrested after inadvertently entering the resort with a loaded assault rifle, according to BBC News.", "In January 2020, officers fired at a vehicle that crashed through two security checkpoints at Mar-a-Lago.", "But there’s nothing that supports claims of a Deep State plot to assassinate the former president in January 2021.", "We rate this blog post False.", "UPDATE (Feb. 5, 2021): This story has been updated to include comment from the Secret Service. The ruling is unchanged.", "Blog post, Trump assassination foiled, Deep State in panic mode!, Jan. 30, 2021", "The Washington Post, Mar-a-Lago neighbors to Trump: Spend your post-presidency elsewhere, Dec. 15, 2020", "BBC News, Teens arrested with AK47 at Trump’s Mar-a-Lago resort in Florida, Aug. 6, 2020", "Email interview with Michael Ogrodnick, training and community relations manager, Feb. 4, 2021", "Email interview with Justine Whelan, U.S. Secret Service, Feb. 4, 2021", "MSNBC, Trump’s Mar-a-Lago security breach: Officials shoot Connecticut woman’s SUV after she crashes through checkpoints, Jan. 31, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]