["About this rating", "On Jan. 6, 2021, a pro-Trump mob overwhelmed law enforcement and breached the U.S. Capitol, leading to a delay in the certification of the 2020 presidential election and the evacuation of both chambers of Congress. Prior to the actual breach of the building, a video of rioters in this mob pepper-spraying law enforcement officers went viral after being shared by the Twitter account Breaking911, which has a historically questionable commitment to accuracy:", "In this case, the video is authentic and correctly described.", "The clip comes from a nearly hour-and-a-half-long livestream on the YouTube channel \"Status Coup\" that follows the protest-turned-mob starting at the end of U.S. President Donald Trump's speech to directly before the breach of the Capitol. The incident in question begins around the 31:10 timestamp.", "Here are the events that preceded that altercation:", "At around the 22:00 timestamp, people can be seen chanting pro-Trump slogans or calling the officers \"traitors.\" Amid this scene, a rioter fell to the ground and required medical attention. Officers pushed into the crowd in an effort to remove that person from the scene, revealing blood on the ground.", "The pro-Trump crowd apparently blamed the officers for the blood and became more aggressive. In response, police pushed the crowd back and attempted to set up metal fencing for a barricade. Directly before the Breaking911 video starts, the officers attempted to remove another apparently injured person from the crowd before reasserting the metal barricade. Following this event, a rioter lunged at the officers. The officers responded with pepper spray and punches. A second individual in the pro-Trump crowd then fired pepper spray back toward the officers in response. That person fled back into the crowd.", "Because the video is authentic and from the Jan. 6 riots, we rank the claim \"True.\"", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]