["About this rating", "An animated GIF showing an excavator destroying a Mercedes Benz automobile was posted to Reddit on 3 February 2019 along with the claim that it documented an unpaid worker getting revenge on the boss:", "\"A worker did not get paid for couple of months, smashes his boss’ Mercedes Benz after he left it running outside. Smashing!\"", "This video does not document a disgruntled employee's revenge on the boss; rather, it's a viral marketing campaign for a car insurance company from 2013.", "This video was directed by Rafael Bolliger for the Zurich creative agency Shortcuts in order to draw attention to the Allianz24 automotive insurance company . Although the footage doesn't show a disgruntled worker's revenge, it does truly capture a Mercedes Benz being destroyed by an excavator.", "Bolliger told us in an email that \"You’re right, the video was shot for an advertisement campaign for Allianz24.ch an insurance company in Switzerland. It was produced by Shortcuts, an advertisement production company in Zürich (website offline, probably doesn’t exist anymore). The car was bought and destroyed for real after extracting the tank and other parts of value.\"", "A \"making of\" video posted to the car insurance company's YouTube page shows that the engine and fluids were removed from the Mercedes before it was destroyed:", "The car insurance company Allianz24 appears to have merged with the travel insurance company Elvia in 2015.", "TravelNews.com.   \"Markenweschsel: Allianz24 Wird Zu Elvia.\"\r\n    14 December 2015.", "Brauer, Corinne.   \"Wer Zahlt?\"\r\n    persoenlich.com.   Accessed 4 February 2019.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]