["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A leading Republican lawmaker wants to allow corporations to make contributions to political parties in Wisconsin.", "Wisconsin Assembly Speaker Robin Vos sounded euphoric on Milwaukee radio on Nov. 5, 2014, the morning after the mid-term elections.", "\"How are you?\" he was asked by conservative talk show host Charlie Sykes.", "\"Charlie, I literally could not be better,\" Vos replied.", "Not only had Republican Gov. Scott Walker won re-election, but gains in the Assembly meant Republicans would enjoy their largest majority in that chamber since 1957.", "In the interview, Vos laid out a number of his priorities for the next legislative session, which starts in January 2015. One proposal would allow business contributions to the political parties.", "\"Right now, if you are the Democratic Party, you can take unlimited union money, in many ways, but there's a prohibition on business being able to give to a political party,\" Vos claimed. \"I’d like to get rid of that and create a level playing field.\"", "Vos presumably was singling out the Democratic Party because it typically gets more support from unions than the GOP does.", "We’ll check both parts of his claim -- that in Wisconsin, unions can essentially make unlimited contributions to political parties, while businesses can’t make any.", "Unions", "State law allows unions to contribute directly to political parties (and to candidates, for that matter).", "But since at least 2008, no union has used its \"treasury\" funds to directly make a contribution to a political party, according to the state Government Accountability Board, which oversees state elections.", "There is a strong disincentive to contribute that way. If they did, unions would have to register with the state as a political committee and would have to disclose all their sources of revenue and all their disbursements.", "Instead, what unions typically do is create political action committees, which in turn make contributions to political parties (and candidates).", "A union can give a PAC the equivalent of $20 per union member per year without having to disclose the names of the union members. Or, the union can give unlimited amounts to PACs, as long as the union members’ names are disclosed.", "PACs, though, are limited to contributing $6,000 per year to a political party.", "So, unions are allowed to contribute directly to political parties -- but, in practice, they don’t. They are allowed to give unlimited amounts of money to a political action committee, but a PAC is limited to how much it can give to a party.", "Business", "The second part of Vos’ claim is that \"there's a prohibition on business being able to give to a political party.\"", "In Wisconsin, campaign contributions must originate from individuals.", "That means business owners -- those who own sole proprietorships or partnerships -- can make contributions to political parties (as well as to candidates and political action committees).", "That is, as long as the source is personal funds and not funds from the business -- and as long as they follow the limit for a particular race.", "But Wisconsin prohibits corporations, including limited liability companies, from making contributions to parties, candidates or PACs.", "Like unions, corporations can form political action committees to solicit campaign contributions from individuals. But as we’ve noted, unlike unions, corporations can’t make contributions to PACs.", "Vos told us he’d like to see state law changed so that it treats corporations like unions -- in other words, allowing corporations to make the same kind of political contributions as unions do.", "Our rating", "Vos said that in Wisconsin, unions can essentially give \"unlimited\" contributions to political parties, but business can't give any.", "The law allows unions to make unlimited contributions to the parties, but in practice, they make no such direct contributions at all. Rather, they give to political action committees, which in turn are limited in what they can give to parties.", "Business owners using their personal funds can contribute to political parties, within limits, but corporations can't make any such contributions.", "We rate  the claim Mostly True.", "To comment on this item, go to the Milwaukee Journal Sentinel website.", "WTMJ-AM, Assembly Speaker Robin Vos interview (starts at 19:50), Nov. 5, 2014", "Email inter, Assembly Speaker Robin Vos communications director Kit Beyer, Nov. 7, 2014", "Milwaukee Journal Sentinel, \"Federal court ruling removes limits on donations to political parties,\" Sept. 15, 2014", "Wisconsin Government Accountability Board, \"Contribution limits,\" April 2014", "National Conference of State Legislatures,", "Interview, University of Wisconsin-Madison political science professor Kenneth Mayer, Nov. 10, 2014", "Interview, attorney and election law expert Mike Wittenwyler, Nov. 10, 2014", "Interview, Assembly Speaker Robin Vos, Nov. 11, 2014", "Wisconsin Eye, interview of Assembly Speaker Robin Vos, Nov. 5, 2014", "Wisconsin statutes, Chapter 11 -- Campaign Financing, Sept. 13, 2014", "Wisconsin Lawyer, \"Decoding the maze: Wisconsin’s campaign finance laws,\" October 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]