["The post was quickly shared hundreds of times after being entered into Facebook on February 22, 2019, the same day that Indonesian authorities announced that a MotoGP race would be held on Lombok island from 2021.", "The misleading post has an image showing an aerial view of a motorsport track and has a caption that translates to English as: “Look at this one, Prabowo supporters. Indonesia has officially been named as one of the MotoGP hosts in 2021. The world-class Mandalika circuit in NTB; the circuit with the most beautiful view in the world. The government does not need theories, let alone fictive things.”", "It referenced Prabowo Subianto, the only challenger to incumbent Joko Widodo in Indonesia’s presidential poll in April.", "Here is an AFP report on the MotoGP hosting announcement. Mandalika in West Nusa Tenggara (NTB) province is the area of the planned MotoGP track.", "AFP found through a Google Reverse Image search that the photograph does not show the Indonesian circuit. It is a picture of the MotoGP host Sepang circuit in Malaysia, which is available on this link from the race’s website.", "Below is the screenshot of the picture on MotoGP’s website:", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]