["About this rating", "On 19 March 2018, the often-inaccurate Daily Mail added a new story to their ever-popular \"alarming new drug trend\" collection of reportage. In this case, the scary new drug was \"bug spray\" (referring generally to insecticide products such as Raid, which contain pyrethroid compounds), with the Daily Mail reporting that \"US health officials have seen a surge in the number of people using bug spray to get high. In the last year the alarming trend has been reported in Mississippi, Tennessee and most recently Indiana.\"", "Here, the Daily Mail was attempting to tie three separate incidents, speculatively and sometimes inaccurately reported on by local news outlets, into a single, surging trend. The Mail was able to do by capitalizing on the flaws and ambiguities inherent in the original local news reports — a prime example of the local news-Daily Mail misinformation complex.", "In reality, no evidence establishes such an \"alarming trend,\" because only one of the three incidents cited by the Daily Mail involved a confirmed case of a person using an insecticide intentionally as a form of recreational drug. The remaining two reports were based on conjecture and hearsay that either referenced the same incident or were too different to be considered part of the same alleged trend (and were also just as speculative).", "In July 2017, the Monroe County Sheriff's Department in Mississippi reported that a person had combined methamphetamine with crystals produced from spraying Raid \"Hot Shots\" on an electrified screen, and then injected that material into his veins. Both local media reports and the Daily Mail used vague language to make it sound as if the situation in Mississippi were part of an increasingly common occurrence, but Chief Deputy Curtis Knight told us that the occurrence was an isolated case: \"The incident where an individual was arrested at our facility for allegedly injecting 'Hot Shot' bug spray has been an isolated incident. The user and a witness to the use both stated, 'Hot Shot' bug spray was sprayed on a screen and electricity applied to crystalize the bug spray then mixed with methamphetamine and injected.\"", "The second “bug-spray” related incident allegedly took place in Tennessee, and it is a memorable tale involving a man allegedly high on a mix of “wasp spray” and methamphetamine breaking into a random family’s home and drinking water from their sink before cutting himself with a knife, jumping out of the house’s second floor window, and throwing feces at police from a nearby tree. While some second-hand news reports suggested the perpetrator admitted to intentionally using this combination of drugs, more detailed reporting held that this suggestion was just an assmuption based on an interpretation of drug trends greatly mirroring the description of the earlier Mississippi event:", "It’s likely possible because of a dangerous new drug known as 'Wasp Spray Dope.' Officials in Lawrence County said drug dealers are crystallizing wasp spray, then mixing them with meth. \"It’s fairly new but it seems to be spreading, rapidly,” said Zach Ferguson, an investigator with the Lawrence County Sheriff’s Office.", "The Lawrence County Sheriff's Department did not respond to multiple requests for clarification via e-mail, phone, and voicemail, but news reports and a lack of readily available forensic tests for wasp spray imply no confirmation was made that “wasp spray” was found in the perpetrator’s system, or that he knowingly consumed the substance or admitted to intentionally using it, as insinuated by most accounts reporting on this alleged trend. It bears mentioning that a number of drugs, including methamphetamine on its own, can produce similarly bizarre or violent reactions in users.", "The final and most recent in the list of incidents pointing to this “alarming trend” potentially involved no bug spray at all. The event itself, a series of overdoses at an Indianapolis men’s shelter named Wheeler Mission, occurred in January 2018 and as reported at the time involved no mention of \"bug spray\":", "Over the last two days, 27 people have overdosed on suspected bath salts in or around Wheeler Mission, including 17 who were guests at the downtown men's shelter.", "Steve Kerr, Wheeler's chief development officer, said seven men overdosed inside the building, while another 10 overdosed directly outside the building. All are suspected to have taken bath salts that may have been laced with another drug, he said.", "According to a follow up report by IndyStar (published a day before the Daily Mail story ran), investigators later concluded that the cause of the overdose was Spice (a name for a synthetic form of cannabis) mixed with some “unknown chemical”:", "At least 17 guests were believed to have overdosed on \"Katie\" [or KD] — another mix of spice and an unknown chemical or drug. Most of the men were able to bounce back, but at least one was taken to the hospital and placed on a ventilator that week, according to mission leadership.", "Indianapolis police said a subsequent investigation led them to several drug houses connected to the distribution of spice mixed with an unknown chemical. Officers made six arrests in connection with the overdoses and confiscated nearly 10 pounds of synthetic marijuana and five handguns.", "The assertion that the additional chemical was some form of bug spray, and not merely another one of the hundreds of largely unknown chemicals being sold as synthetic marijuana, came from an emergency responder with the Indianapolis Fire Department who was quoted in that same March story: \"Indianapolis firefighter Scott Lebherz told IndyStar this variation of KD can take many forms — marijuana, spice, tobacco, even banana leaves — but shares a common trait: all laced with a heavy-duty household bug spray.\"", "We reached out to the Indianapolis Fire Department to ask how they reached the conclusion that the adulterating chemical in these cases was some form of insecticide. An official there told us via e-mail that this was based on stories heard in the field, not from testing:", "We do not test for Wasp Spray. We have on scene stories told to us — of people spraying their drugs with this and similar products to either enhance the high or confuse drug sniffing dogs.", "The Indiana Star, the Daily Mail, and numerous other outlets quoted Daniel Rusyniak, the Medical Director of the Indiana Poison Center, to describe the theoretical effects of using pyrethroid as a recreational drug. What is sometimes left out in these reports, however, is his skepticism that pyrethroids would produce the symptoms attributed to them, or that they would be able to cause any enhancement to a high whatsoever. Over the phone, he told us that pyrethroids can cause problems in humans, but only \"at concentrations that are probably not going to be achieved unless somebody’s got some good chemistry skills,\" adding that \"There are a few case reports of people getting [central nervous system] excitation and some seizures and coma, but most people tolerate fairly large amounts of this without a lot of medical complications.\"", "Indeed, the medical literature includes numerous stories of people consuming or even injecting large volumes of pyrethroids and being generally fine without any detour into violent, psychotic, or zombie-like behavior. A 2005 case report, for example, described a 36-year old man who attempted to kill himself by injecting himself with 6 mL of pyrethroid-containing insecticides:", "A 36-year-old man injected 6 mL of Real Kill Ant and Roach Killer 2 into his antecubital fossa and 2 mL subcutaneously into his abdomen in a suicide attempt. Upon evaluation in the emergency department, 1 hour later, he had pain at the injection site and no other symptoms ... He was admitted to inpatient psychiatry and remained clinically well throughout his 3-day course.", "Speaking specifically of the Indiana incident, Rusyniak — who actually treated some of the people involved in the January 2018 Wheeler Mission overdose incident — told us that the symptoms described were not a unique occurrence, and could be explained by as a result of synthetic cannabis and similar chemicals: \"I saw some of the people at the Wheeler Mission, and took care of some of them. [Their symptoms were] indistinguishable from a lot of outbreaks that we've seen [that involved only] synthetic cannabinoids.\"", "\"The idea that this is somehow unique or different from the clinical effects of the synthetic cannabinoids alone [has not been demonstrated], at least so far,\" Rusyniak said. The Indiana incident, is, however, distinct from the previous events alleged to be part of the trend in that the primary drug was synthetic marijuana, not methamphetamine.", "There are two cases, though only one has been confirmed, in which a crystallized form of bug spray is alleged to have been added to methamphetamine, and these events resulted in symptoms consistent with an aggressive methamphetamine high. The final case, in contrast, involved the unconfirmed assertion that bug spray, in liquid form, was sprayed to synthetic marijuana (to enhance the high or perhaps throw drug dogs off the scent) and resulted in symptoms consistent with a synthetic marijuana overdose. The collection of these three events does not coherently create a narrative that can be considered an \"alarming trend,\" but because at least one credible report documents a case in which someone intentionally injected Raid (mixed with methamphetamine), we rank the assertion of a surge in the number of people using “bug spray” to get high as mostly false.", "Sheets, Megan.   “Huge Surge in People Getting High on Bug Spray Which Leaves Them 'Raging Like a Mad Dog', Health Officials Warn.”\r\n    Daily Mail.   19 March 2018.", "Environmental Protection Agency.   \"Pyrethrins and Pyrethroids.\"\r\n    Accessed 28 March 2018.", "Bounds, Jared.   “Terrifying New Drug Trend in NE Mississippi Involves Shooting Up Wasp Spray.”\r\n    NewsMS.fm.   28 July 2017.", "Conte, Chris.   “Police: Naked Man in Tree Was High on ‘Wasp Spray Dope.’”\r\n    WVLT-TV.   4 January 2018.", "Landau, Joel.   “Oregon Man on Meth Fights Off Cops While Masturbating in Bar: Police.”\r\n    [New York] Daily News.   24 December 2013.", "Hays, Holly V.   “Wheeler Mission Says at Least 17 Guests Have Overdosed on Bath Salts This Week.”\r\n    IndyStar.   1 February 2018.", "National Institute on Drug Abuse.   \"Synthetic Cathinones (‘Bath Salts’)\"\r\n    Accessed 28 March 2018.", "National Institute on Drug Abuse.   \"Synthetic Cannabinoids (K2/Spice)\"\r\n    Accessed 28 March 2018.", "Rahn, Bailey.   “What Is “Synthetic Marijuana” and How is It Made?”\r\n    Leafly.   4 December 2014.", "Bradberry, Sally M. et al.   “Poisoning Due to Pyrethroids”\r\n    Toxicological Reviews.   July 2005.", "LoVecchio, Frank, and Jason Knight.   “Injection of Pyrethroids Without Significant Sequelae.”\r\n    American Journal of Emergency Medicine.   May 2005.", "Santora, Marc.   “Drug 85 Times as Potent as Marijuana Caused a ‘Zombielike’ State in Brooklyn.”\r\n    The New York Times.   14 December 2016.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]