["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Ahead of the second night of Democratic presidential debates hosted by CNN, an ad from President Donald Trump’s re-election campaign took a stab at the candidates and their response to a previous debate question about immigrants and health care.", "A claim in the 30-second ad centered on a question posed by Savannah Guthrie, TODAY co-anchor and one of the moderators of a June 27 debate in Miami.", "The ad starts with video of Guthrie asking: \"Raise your hand if your government plan would provide coverage for undocumented immigrants.\"", "All candidates on stage raised their hands. On stage that night were: author Marianne Williamson; former Colorado Gov. John Hickenlooper, entrepreneur Andrew Yang; South Bend, Ind. Mayor Pete Buttigieg; former Vice President Joe Biden; Sen. Bernie Sanders of Vermont; Sen. Kamala Harris of California; Sen. Kirsten Gillibrand of New York; Sen. Michael Bennet of Colorado; and Rep. Eric Swalwell of California. (Swalwell has since dropped out.)", "\"They are all the same,\" Trump’s ad said over the image of the candidates raising their hands. \"These Democrats support giving illegal immigrants free health care at our expense.\"", "The ad then goes to another image of a group of people — presumably immigrants on their way to the United States illegally — walking in a field. \"Spending taxpayer dollars covering illegal immigrants,\" the ad said over that image.", "Is it true that Democrats at a June debate said they support free health care — at the expense of taxpayers — for immigrants illegally in the United States?", "The ad is misleading. Candidates were asked whether their health care plans would cover immigrants here illegally. They were not, however, directly asked if that coverage would be free.", "By looking at candidates’ statements that night and at their individual platforms, we can get a better understanding of exactly how this notion that they support \"free\" coverage is not exactly right.", "Some of the candidates on stage that night support Medicare for All. Sanders’ version of it is a single, national health insurance program that would cover everyone who lives in the United States. There would be no out-of-pocket costs to individuals — no deductibles, no copays or coinsurance — but anyone with a job or self-employed would pay into the system through taxes. In that sense, coverage would not be free for anyone who works. (Some immigrants in the country illegally pay income taxes.)", "Candidates in favor of Medicare for All share the goal of universal coverage but some are wary of a full replacement of the current mix of private and public insurance. Some candidates favor a plan that allows people to keep their private insurance and buy into a \"public option.\"", "Also, Sanders’ 2017 Medicare for All bill said that the Secretary of Health and Human Services would be the one to set residency requirements for coverage eligibility. At this point, there isn’t a rule for purposes of health care coverage that outlines the U.S. residency criteria.", "Question and answer at the June debate", "Health care was a key topic of the June 27 debate in Miami and at some point, Guthrie turned the conversation to coverage for people here illegally. Below is a transcript of that exchange.", "Guthrie: \"A lot of you have been talking tonight about these government health care plans that you proposed in one form or another. This is a show of hands question. And hold them up for a moment so people can see. Raise your hand if — if your government plan would provide coverage for undocumented immigrants.\"", "All candidates on stage raised their hands.", "Guthrie then asked Buttigieg to support his affirmative answer.", "Buttigieg: \"Our country is healthier when everybody is healthier. And remember, we’re talking about something people are getting a — given a chance to buy into. In the same way that there are undocumented immigrants in my community who pay, they pay sales taxes, they pay property taxes directly or indirectly. This is not about a handout. This is an insurance program. And we do ourselves no favor by having 11 million undocumented people in our country be unable to access health care.\"", "Guthrie then asked Biden to comment.", "Biden: \"You cannot let — as the mayor said, you cannot let people who are sick, no matter where they come from, no matter what their status, go uncovered. You can’t do that. It’s just going to be taken care of, period. You have to. It’s the humane thing to do.", "\"But here’s the deal. The deal is that he’s right about three things. Number one, they in fact contribute to the well-being of the country, but they also — for example, they’ve increased the lifespan of Social Security because they’re — they have a job. They’re paying the Social Security tax. That’s what they’re doing. It’s increased the lifespan. They would do the same thing in terms of reducing the overall cost of health care by them being able to be treated and not wait until they’re in extremis.\"", "No other candidate commented on that question.", "So all candidates raised their hands affirming they’d have a plan that would offer coverage for immigrants in the country illegally. But the question did not directly ask if coverage would be free. Buttigieg specifically said people would buy the coverage, and that it was \"not about a handout.\" Biden in his answer spoke about the contributions of immigrants in the country illegally — and said that if they had health care coverage, they’d be reducing the cost of the overall health care system.", "Our ruling", "A Trump re-election campaign ad said Democratic presidential candidates \"support giving illegal immigrants free healthcare at our expense.\"", "This is misleading. The claim is based on a raise-your-hand type of question in a June debate. Candidates were asked if their health care plans would provide coverage for immigrants in the country illegally. All candidates raised their hand. But the question did not ask if the coverage would be for free. Two of the candidates who were able to provide context — Buttigieg and Biden — did not say it would be for free.", "Some candidates on stage that night support universal health care coverage, through Medicare for All. But there isn’t agreement among all candidates on the provisions of that type of coverage. A version of Medicare for All would offer coverage to all individuals by replacing premiums, co-pays and deductibles. One way the government would pay for Medicare for All would be through payroll taxes; so immigrants in the country illegally who do pay income taxes would contribute that way.", "We rate the ad’s statement Mostly False.", "YouTube, Donald Trump campaign ad, published July 30, 2019", "YouTube, Democratic Presidential Debate - June 27 (Full) | NBC News, June 27, 2019", "Congress.gov, Medicare for All Act of 2017, introduced by Sen. Bernie Sanders on Sept. 13, 2017", "PolitiFact, Clinton says undocumented immigrants pay $12 billion a year into Social Security, Aug. 10, 2016", "Michael Bennet campaign website, Medicare-X", "Marianne Williamson campaign website, Immigration", "Pete Buttigieg campaign website, Issues", "Kamala Harris campaign website, My plan for Medicare for All", "PolitiFact, Medicare for All: What it is, what it isn't, Feb. 19, 2019", "PolitiFact, How Obamacare, Medicare and ‘Medicare for All’ muddy the campaign trail, May 13, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]