["About this rating", "Marine One is the call sign of any United States Marine Corps aircraft carrying the President of the United States, but the name is typically used to refer to a specific helicopter used to ferry the President to and from takeoff and landing sites of Air Force One, or to carry the President on short trips and/or to locations lacking adequate landing facilities for fixed-wing aircraft.", "On 24 May 2013, the following footage of President Obama boarding Marine One en route to Annapolis, Maryland, was published by several major media news outlets:", "Marine One is typically accompanied or met on the ground by at least one Marine in full dress uniform, and the clip embedded above shows President Obama climbing the steps up to the helicopter while seemingly paying no mind to the nearby Marine guard (who saluted his approach), conversing briefly with the flight crew, then exiting the aircraft and jogging down the steps to re-approach and acknowledge the Marine before reboarding Marine One:", "Many news outlets, such as ABC News and CNN, accompanied this video with articles speculating that President Obama had \"forgotten\" to salute the Marine and had disembarked the helicopter in order to address him:", "The president may have forgotten something as he boarded Marine One this morning.", "On his way to the U.S. Naval Academy graduation ceremony on Annapolis, Md., President Obama didn't return the salute of the marine standing guard at the door of Marine One, as he climbed the steps to the helicopter cabin.", "Obama soon ducked his head out, waved to the pilot, and jaunted back down the stairs to address the marine, shaking his hand. In the short video clip, one can't hear the two men talking, so it's unclear what exactly was said. A faint smile appeared to cross the marine's face as they exchanged brief words.", "Within a few years, this video was being shared with the claim that President Obama had been forced to disembark Marine One at the insistence of its pilot, who supposedly refused to carry the chief executive until he went back out and \"saluted\" the Marine attendant. These claims originated without any attendant additional information about the incident and were based on nothing more than speculative assumptions about the silent video footage.", "Actually, no regulation specifies that the President of the United States, a civilian who holds the position of Commander-in-Chief of the U.S. military, should salute (or return the salutes of) military personnel. In fact, U.S. Army regulations state that neither civilians nor those wearing civilian attire (both of which describe the President of the United States) are required to render salute:", "The President of the United States, as the commander in chief, will be saluted by Army personnel in uniform.", "Civilian personnel, to include civilian guards, are not required to render the hand salute to military personnel or other civilian personnel.", "Salutes are not required to be rendered or returned when the senior or subordinate, or both are in civilian attire.", "Although other presidents have rendered salutes from time to time on special occasions (such as awards ceremonies or troop reviews), the returning of presidential salutes did not become commonplace until President Reagan broke with protocol and tradition and began the practice in 1981, as Reagan himself explained a few years later in remarks to U.S. service members and their families stationed in Iceland:", "I can't resist telling you a little story that I've just told the marine guard at the Embassy. The story has to do with saluting. I was a second lieutenant of horse cavalry back in the World War II days. As I told the admiral, I wound up flying a desk for the Army Air Force. And so, I know all the rules about not saluting in civilian clothes and so forth, and when you should or shouldn't. But then when I got this job — [laughter] — and I would be approaching Air Force One or Marine One and those marines would come to a salute and I — knowing that I am in civilian clothes — I would nod and say hello and think they could drop their hand, and they wouldn't. They just stood there. So, one night over at the Commandant's quarters, Marine Commandant's quarters in Washington, and I was getting a couple of highballs, and I didn't — [laughter] — know what to do with them. So, I said to the Commandant — I said, \"Look, I know all the rules about saluting in civilian clothes and all, but if I am the Commander in Chief, there ought to be a regulation that would permit me to return a salute.\" And I heard some words of wisdom. He said, \"I think if you did, no one would say anything.\" [Laughter]", "So, if you see me on television and I'm saluting, you know that I've got authority for it now — [laughter] — and I do it happily.", "Any U.S. Marine pilot would certainly know that the returning of salutes by the President of the United States is a modern-day courtesy and not a requirement. Although he might good-naturedly suggest that the President do so, such a pilot would risk being tagged as insubordinate if he refused to carry the President to his destination until the latter (optionally) returned the salute of a subordinate service member.", "In any case, events couldn't have literally played out here as claimed, as President Obama did not in fact return the salute of the Marine seen in this clip. The President walked up to the Marine, shook his hand, and exchanged a few words with him, but he did not render an outstretched-hand-to-the-forehead military salute. Based on the context of the clip, it seems far more likely that the pilot imparted some information to President Obama about the Marine guard (e.g., he had just received an award, gotten married, become a father, celebrated a birthday) that prompted the President to step outside and congratulate him.", "Department of the Army.   \"Salutes, Honors, and Visits of Courtesy.\"\r\n     24 September 2004.", "Lothian, Dan.   \"President Obama forgets to salute.\"\r\n    CNN.   24 May 2013.", "Good, Chris.   \"Did Obama Forget to Salute?.\"\r\n    ABC News.   24 May 2013.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]