["About this rating", "In mid-October 2017, the satirical web site FreedumJunkshun posted an article apparently aiming to take in \"truthers\" and paranoid Clinton-watchers, reporting that wounded Mandalay Bay security guard Jesus Campos had not only \"vanished,\" but that he had worked for the Clinton Foundation's Las Vegas office. Citing a fabricated quote attributed Fox News, FreedumJunkshun stated:", "Then there’s this tidbit from Fox News. It’s two sentences, but they’re very interesting sentences:", "Until last month, Campos worked a second job at the Clinton Foundation’s Las Vegas office where he had been providing security services for more than five years.", "He resigned suddenly just before the attacks.", "Under FreedomJunkshun's \"about\" section, the web site clearly indicates is not intended to be taken seriously:", "We believe that there is nothing more precious than the mind of an aging conservative. Here we gather a boatload of bullhonkey, works of pure satirical fiction, to give the fist-shakers of the world a reason to hate. Reality is often in the eye of the beholder. You won’t find any of it here.", "Join the fun in the comments on our Facebook page where you too can watch David Hasselhoff running over someone’s poodle magically transformed into a crime against humanity by Barack Obama or yet another murder the Clintons got away with.", "We confirmed with the Clinton Foundation that they have no office in Las Vegas, and no current or past employees named Jesus Campos.", "Campos accidentally attracted the addled obsession of conspiracy theorists when he was shot in the leg while inspecting a reported open door on the 32nd floor of the Mandalay Bay Resort and Casino on 1 October 2017. He was wounded in a hail of gunfire when mass shooter Stephen Paddock turned his weapon on the hallway before raining bullets down on a country music festival crowd of 22,000 below.", "Campos has been credited as a hero for his life-saving actions that night, which included warning a building engineer and a hotel guest to take cover, and helping police despite his injury until they ordered him to seek medical care. However his high-profile role in a mass shooting has inevitably resulted in intense scrutiny from a demented segment of the U.S. population known as \"truthers,' who believe every large-scale tragedy is engineered by the government to facilitate that take-over of the New World Order. It's an all-encompassing and deeply anti-Semitic conspiracy theory, made popular by the likes of occasionally-clothed, chair-hurling InfoWars conspiracy troll Alex Jones.", "Since the mass shooting in which Paddock killed 58 people and wounded hundreds, Campos has been the target of much delusional speculation, including false allegations that he was an \"accomplice\" to Paddock and had been arrested, or that he had \"gone missing\" after cancelling a series of media interviews to seek medical treatment at a walk-in clinic days after being shot.", "Ending hyperbolic reports he had \"vanished\" while attempting to maintain a low profile, the soft-spoken Campos appeared on Ellen Degeneres' NBC talk show on 18 October 2017 alongside building engineer Stephen Schuck. The men recounted their narrow escape from death and said they were trying to heal after the trauma they experienced.", "Mannington, Butch.   \"Missing Vegas Security Guard on Clinton Foundation Payroll.\"\r\n    FreedumJunkshun.com.   17 October 2017.", "Pearce, Matt.   \"Wounded Casino Security Guard Vanishes from Las Vegas — And Surfaces on the Set of 'Ellen.'\"\r\n    Los Angeles Times.   17 October 2017.", "Lawrence, Christopher.   \"'Ellen' Producers Mum on How They Landed Jesus Campos Interview.\"\r\n    Las Vegas Review-Journal.   18 October 2017.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]