["About this rating", "In November and December 2020, readers asked Snopes to look into the authenticity of a quotation about state-enforced gun control attributed to former U.S. President Ronald Reagan.", "In recent years, the quotation has been attributed to him in multiple internet memes and social media posts. It reads:", "\"Under no pretext should arms and ammunition be surrendered; any attempt to disarm the people must be stopped, by force if necessary.\"", "In fact, that quotation originated in a speech given by the communist philosopher Karl Marx in March 1850, which provided a degree of irony given Reagan's historical reputation as a staunch opponent of Soviet communism during the 1980s.", "In late 2020, readers submitted a new purported example of the quotation's misattribution to Reagan, highlighting a supposed Instagram post by Act for America, a right-wing group founded by controversial activist Brigitte Gabriel that opposes what it characterizes as radical Islamic extremism. We were not able to definitively confirm that Act for America had posted a meme falsely attributing the quotation to Reagan, but if they did, it was no longer visible on Dec. 1, 2020.", "In his \"Address to the Communist League\" in 1850, Marx outlined his proposal for a violent \"proletariat\" (working class) uprising and in one section warned his audience not to allow \"bourgeois\" (middle class) democrats to interfere with or hijack any proletariat victory (emphasis added):", "In order that this party [bourgeois democrats], whose betrayal of the workers will begin with the first hour of victory, should be frustrated in its nefarious work, it is necessary to organize and arm the proletariat.", "The arming of the whole proletariat with rifles, guns, and ammunition must be carried out at once; we must prevent the revival of the old bourgeois militia, which has always been directed against the workers. Where the latter measure cannot be carried out, the workers must try to organize themselves into an independent guard, with their own chiefs and general staff, to put themselves under the order, not of the Government, but of the revolutionary authorities set up by the workers.", "Where workers are employed in State service they must arm and organize in special corps, with chiefs chosen by themselves, or form part of the proletarian guard. Under no pretext must they give up their arms and equipment, and any attempt at disarmament must be forcibly resisted.", "Destruction of the influence of bourgeois democracy over the workers, immediate independent and armed organization of the workers, and the exaction of the most irksome and compromising terms from the bourgeois democracy, whose triumph is for the moment unavoidable — these are the main points which the proletariat, and therefore also the League, has to keep in sight during and after the coming upheaval.", "The line highlighted above (\"Under no pretext must they give up their arms and equipment, and any attempt at disarmament must be forcibly resisted\") was clearly the source of the quotation later falsely attributed to Reagan (\"Under no pretext should arms and ammunition be surrendered; any attempt to disarm the people must be stopped, by force if necessary\"). It was misrepresented as constituting support for civilian gun ownership rights in 20th and 21st century America, a very different historical and social context from the one that Marx described.", "It's not clear how the quotation came to be attributed to Reagan, but the answer may lie in another internet meme that, somewhat ironically, contrasted Marx's support for violent uprising with a different quotation by Reagan, this time authentic, in which he spoke against armed civilians: \"There's no reason why on the street today a citizen should be carrying loaded weapons.\"", "Reagan made those remarks in May 1967, when he was governor of California, in reference to an incident in which members of the Black Panther Party descended upon the state Legislature, bearing a variety of firearms. The Associated Press reported at the time that (emphasis added):", "Asked for his reaction, the governor commented that \"Americans don't go around carrying guns with the idea they're using them to influence other Americans. There's no reason why on the street today a citizen should be carrying loaded weapons.\" He agreed, however, with the group's contention they have the right to bear arms. At present there is no law in California against possessing a loaded, legal gun as long as it isn't concealed.\"", "It's possible that another internet user, perhaps driven by mischief or confusion, extracted the Marx quotation from that meme and incorrectly attributed it to Reagan, instead of Marx himself.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]