["U.S. President Donald Trump gestures as he speaks during a \"Keep America Great\" campaign rally in Milwaukee, Wisconsin. (Getty Images).", "Evidence was found for one of the incidents he discussed in Madison, but found no evidence for anything similar in Milwaukee.", "Milwaukee and Madison officials don’t identify their cities as being \"sanctuary,\" but they do practice immigration protection in a way that may fit that meaning.", "It’s not often that a claim hits the Truth-O-Meter more than two months after it was made.", "But, it’s not often that the President of the United States comes to town, makes a claim before a packed rally about undocumented immigrants in Madison and Milwaukee who -- he says -- were set free after abusing children, then provides so little backup that even local officials had trouble tracking down just what he was talking about.", "Here is what Trump said at the Jan. 14, 2020 rally in Milwaukee:", "\"In the city of Madison, police arrested an illegal alien for assault and after authorities released him, he committed violent battery, only to be released one more time. They are now looking for him. Isn't that nice? The same illegal alien was arrested for a third time in September and charged with multiple sexual assaults, including sexual assault of a child. Now that criminal is once again in Wisconsin jail.\"", "Then:", "\"Last year, the sanctuary county of Milwaukee released an illegal alien criminal with multiple charges for sexual assault of a child. Think about that, of children. He is now at large and they are searching all over. He is looking for another victim. He is allowed to go from your sanctuary city.\"", "To break it down, Trump essentially claims Madison and Milwaukee County both carry sanctuary status for illegal immigrants and have released undocumented immigrants who have committed multiple crimes including sexual assault of a child.", "We dug into both cases and the underlying question:", "Do Madison and Milwaukee County carry \"sanctuary status,\" which means they don’t comply with federal actions to track down undocumented immigrants?", "In regard to the Madison case, Trump’s campaign referred us to the case of Luis Ruiz-Ugalde.", "When we searched Ruiz-Ugalde’s name on the state court system’s public court records database, we found three cases linked to his name in Madison.", "The first, filed in 2014, involved damage to property, resisting and obstructing an officer and disorderly conduct.", "The second, filed in June of 2019, revolved around two counts of disorderly conduct and one count of battery.", "The third case, filed September of 2019, lists a range of counts, including one for battery, one for attempted sexual assault, and one for sexual assault of a child.", "A Sept. 27, 2019 news report from WMTV in Madison said Ruiz-Ugalde, 26 at the time, was charged with four felonies and three misdemeanors after Madison police alleged he attacked several women and a 13-year-old girl over five days.", "According to Dane County District Attorney Ismael Ozanne, Ruiz-Ugalde is currently being held in the Dane County Jail on a $100,000 cash bail. Jury selection is currently set for June 1 and jury trial dates June 2 through the 4th.", "The WMTV news report said: \"The Dane County Sheriff’s Office (said) Immigration and Customs Enforcement asked for a hold on Ruiz-Ugalde when he was booked for battery, which the sheriff’s office did not comply with.\"", "So, the details of this case essentially match Trump’s claim.", "Trump’s team never provided any information about the Milwaukee claim, which we requested multiple times. So we turned to local authorities to see if we could find a match.", "Sheronda Grant, spokeswoman for the Milwaukee Police Department, said Trump’s statement alone does not have enough information to determine what he might be referring to.", "The Milwaukee County Sheriff’s Department offered a similar explanation.", "\"The Milwaukee County Sheriff’s Office does not hold individuals solely on ICE detainers following the satisfaction of criminal process,\" Faithe Colas, director of public affairs for the sheriff’s department, wrote in an e-mail. \"The Sheriff’s Office has no ability to verify the assertions made in the referenced speech.\"", "Nevertheless, we sent out a public records request to the Sheriff’s Office seeking the names of individuals released from jail since January 2019, including those released on bail or after completing a sentence. Additionally, we asked for a list of the charges on which each of those people were held", "The sheriff’s office has not yet completed our request.", "So, it is impossible to say if Trump is right on this one, but our view is the burden is on the speaker to establish his or her claim.", "Of course, a key part of the claim is that Milwaukee County and Madison have adopted \"sanctuary\" status.", "According to the Center for Immigration Studies, a Washington D.C.-based think tank that advocates for lower immigration levels, neither the city of Milwaukee or Milwaukee County are considered to have \"sanctuary\" status.", "Sanctuary cities are a name given to municipalities that may shelter undocumented immigrants. They can be controversial and are largely decided by municipal leadership if they do not want to comply with federal law enforcement in targeting those residing illegally within the community.", "For example, San Francisco and Chicago both explicitly state they are sanctuary cities from the mayor’s office.", "That said, the name \"sanctuary city\" is a political term and not a legal one. Even if cities don’t declare themselves as such, they may still act in this matter.", "In 2017, Milwaukee Mayor Tom Barrett said though the city isn’t a sanctuary city, immigrants won’t be harassed within the city limits.", "In 2012, Milwaukee County passed a resolution that would allow Milwaukee sheriff deputies to decline Immigration and Customs Enforcement detention requests unless they involve people with criminal records, a warrant, they are a known gang member or they are on the United States terrorist watch list.", "We also found Milwaukee Public Schools designated all of its educational sites as a safe haven for undocumented students and families. Essentially, that means the school district assures students and families that any possible actions taken by Immigration and Customs Enforcement on school grounds will be opposed by all legal means possible.", "So, though Milwaukee County isn’t formally under \"sanctuary status,\" it still functions in a similar manner.", "Meanwhile, in 2010, the Madison Common Council passed a resolution instructing police not to inform federal immigration officers about undocumented immigrants unless they’re charged with violent crimes.", "Former Mayor Paul Soglin said the city is not a \"sanctuary city,\" but some state Republican lawmakers say current Mayor Satya Rhodes-Conway has instituted sanctuary policies within Madison.", "In response to Trump’s immigration stances, Rhodes-Conway has previously said she will stand by the immigrant community and inform the community of any increased ICE activity.", "Trump deemed Milwaukee and Madison sanctuary cities at a January rally in Milwaukee. Along with that, he mentioned incidents of undocumented immigrants committing crimes in these two cities to back up his claim.", "We only found evidence for one of the incidents he discussed in Madison, but found no evidence for anything similar in Milwaukee.", "Though Milwaukee and Madison officials don’t identify their cities as being \"sanctuary,\" they do practice immigration protection in a way that may fit that meaning.", "We rate this claim Half True.", ".", "E-mail exchange with Zach Parkinson, deputy director of communications for Trump campaign", "E-mail exchange with Faith Colas, Director of Public Affairs and Community Engagement for Milwaukee County Sheriff’s Office, Jan. 23, 2020", "E-mail exchange with Sheronda Grant, Public information officer for Milwaukee Police Department", "CCAP, Luis Ruiz-Ugalde search", "Dane County Sheriff’s Office, inmate search", "C-SPAN, President Trump rally in Milwaukee, Jan. 14, 2020", "WUWM 89.7, ‘Sanctuary city’ doesn’t have a legal meaning, but it’s valuable to some people in Wisconsin, Sept. 16, 2019", "Milwaukee Public Schools, Safe Haven Resolution", "Center for Immigration Studies, Map: Sanctuary cities, counties and states", "E-mail exchange with Ismael Ozanne, Dane County District Attorney, on March 31, 2020", "FOX6, Mayor Barrett: Milwaukee is not a sanctuary city, but immigrants will not be persecuted here, Jan. 26, 2017", "Patch.com, Donald Trump orders crackdown on sanctuary cities: Milwaukee, Madison, others could lose federal funding, Jan. 25, 2017", "Chicago Office of the Mayor, Sanctuary City Supportive Resources", "San Francisco Office of the Mayor, Sanctuary City policy", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]