["About this rating", "On 17 November 2016, the disreputable web site Conservative Daily Post published an article reporting that people protesting Donald Trump's presidency were now being charged with terrorism under a new law:", "The Conservative Daily Post has a history of severely misrepresenting real events. For instance, they claimed that Donald Trump's first act as president would be to make flag burning a \"treasonous act\" (he merely said he thought it should be illegal), and that Loretta Lynch ordered for all confederate flag tattoos to be immediately removed (this claim was based on a 2016 report about a hate crime which mentioned a Confederate flag tattoo).", "In this case, the \"real event\" is that Republican Senator Doug Ericksen said in a news release in November 2016 that he planned on proposing a bill that would classify some forms of protesting as \"economic terrorism.\" Ericksen said that the bill would target protests that disrupt businesses or shut down streets:", "Washington State Sen. Doug Ericksen said Wednesday he is preparing a bill that would create a new crime of \"economic terrorism\" that would allow felony prosecution of protesters who block streets, cause property damage, threaten jobs and put public safety at risk.", "“I respect the right to protest, but when it endangers people’s lives and property, it goes too far,” the Republican said in a news release. “Fear, intimidation and vandalism are not a legitimate form of political expression. Those who employ it must be called to account.”", "Ericksen said the bill, which is being prepared for next year’s legislative session, would allow felony prosecution \"of those who intentionally break the law in an attempt to intimidate or coerce private citizens or the government by obstructing economic activity.\"", "The Conservative Daily Post reported that a \"new law\" was \"now charging\" \"all\" protesters with terrorism. In reality, however, a lawmaker announced that he was planning to propose a bill that would classify some forms of protest as \"economic terrorism.\"", "While Ericksen's proposed bill is a long way away from becoming a law, the American Civil Liberties Union is still worried about its implications:", "Doug Honig, of the ACLU of Washington, said in reaction:  “The statement throws out a lot of broad rhetoric, and we’ll need to see an actual bill.  But we’re already concerned that some of its loose terms  appear to be targeting  civil disobedience as 'terrorism.'  That’s the kind of excessive approach to peaceful protest that our country and state do not need.\"", "\"Let’s keep in mind that civil rights protesters who sat down at lunch counters could be seen as 'disrupting business' and 'obstructing economic activity,' and their courageous actions were opposed by segregationists as trying to 'coerce business and government.'\"", "While it is true that a Republican senator announced that he was planning to propose a bill which would classify some forms of protest as \"economic terrorism,\" no new laws were passed in November 2016 to begin charging people protesting Trump's presidency with terrorism.", "\"Republican lawmaker proposes creating new crime of ‘economic terrorism’ aimed at protesters.\"\r\n    Fox 6 Now.   17 November 2016.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]