["With as many as 25 potential candidates eyeing a run for president in 2020, one of the least known is Pete Buttigieg, the millennial mayor of South Bend, Ind., population 102,245.", "On CBS’ This Morning, co-host Norah O’Donnell asked the 37-year-old what qualifies him to be president. Buttigieg (pronounced BOOT-edge-edge) noted his government experience, then added:", "\"I have more military experience than anybody who’s arrived behind that desk since George H.W. Bush.\"", "As many readers already know, this comes down to a comparison between Buttigieg and the elder Bush’s son, George W. Bush.", "As Buttigieg indicated, the late George H.W. Bush had an extensive military background. He was a lieutenant (junior grade) bomber pilot in the U.S. Navy during World War II, serving from 1942 to 1945. He flew a total of 58 combat missions, was shot down in the Pacific and was awarded the Distinguished Flying Cross.", "Since the elder Bush served in the White House, three of the successors to the Oval Office — Republican Donald Trump and Democrats Barack Obama and Bill Clinton  — did not serve in the military.", "That leaves the elder Bush’s son, George W. Bush, also a Republican, who was president from 2001 to 2009.", "The younger Bush was a first lieutenant in the Texas Air National Guard from 1968 to 1973, during the Vietnam War. He was certified as a fighter pilot, but only served stateside, seeing no combat.", "So, is Buttigieg’s military experience more extensive than George W. Bush’s?", "Yes. The gay and married Rhodes scholar served longer in the reserves and saw active duty.", "Buttigieg’s official mayoral biography says he served eight years, from 2009 to 2017, in the U.S. Navy Reserve. A spokeswoman for his exploratory committee cited to us a first-person reflection that Buttigieg wrote for his hometown newspaper, the South Bend Tribune, about his wartime service.", "The article was about his taking a leave of absence as mayor, in 2014 during his first term, when he was called up to active duty to serve for six months as a counterterrorism intelligence officer in Afghanistan. The article included a photograph of Buttigieg in Kabul, wearing fatigues and a rifle strapped over his back.", "The war in Afghanistan is now in its 18th year, as the New York Times noted in a summary. In 2014, the Pentagon declared an end to American combat operations. Since then, a smaller number of troops have remained to train Afghan forces and carry out counterterrorism operations against groups like the Islamic State.", "Buttigieg’s military service has also been noted in a number of news articles, including the Washington Post, Military.com and the New York Times (which said his leave was unpaid).", "Buttigieg said: \"I have more military experience than anybody who’s arrived behind that desk since George H.W. Bush.\"", "Among the four men who have been president since the elder Bush, only George W. Bush served in the military: five years stateside with the Texas Air National Guard. Buttigieg served eight years in the U.S. Navy Reserve, including a six-month war-time deployment in Afghanistan, in 2014.", "We rate Buttigieg’s statement True.", "YouTube, CBS This Morning interview of Pete Buttigieg, Jan. 31, 2019", "Email, Peter Buttigieg spokeswoman Lis Smith, Feb. 8, 2019", "U.S. Department of Veterans Affairs, \"List of presidents who were veterans,\" Feb. 16, 2015", "Smithsonian Institution, \"Military Service of the Presidents\"", "Boston Globe, \"Bush fell short on duty at Guard,\" Sept. 8, 2004", "South Bend Tribune, \"Buttigieg reflects on Afghanistan and return to South Bend,\" Oct. 5, 2014", "City of South Bend, Mayor Pete Buttigieg biography, accessed Feb. 9, 2019", "Washington Post, \"The most interesting mayor you’ve never heard of,\" March 10, 2014", "FactCheck.org, \"Bush A Military ‘Deserter?’ Calm Down, Michael,\" Feb. 11, 2004", "New York Times, \"The First Gay President?\" June 11, 2016", "New York Times, \"Pete Buttigieg Might Be President Someday. He’s Already Got the First Man,\" June 18, 2018", "Military.com, \"Vets in Public Service: South Bend Mayor Pete Buttigieg,\" Oct. 16, 2018", "Email, University of North Carolina historian Wayne Lee, chair of the Curriculum in Peace, War and Defense, Feb. 9, 2019", "Email, Kansas State University U.S. military historian Mark Parillo, Feb. 9, 2019", "New York Times, \"Need a Refresher on the War in Afghanistan? Here Are the Basics,\" Jan. 28, 2018", "Time, \"George H.W. Bush Was the Last President to Serve in Combat. America Could Use More Leaders Like Him,\" Dec. 1, 2018", "Washington Post, \"At Height of Vietnam, Bush Picks Guard,\" July 28, 1999", "Email, University of North Texas historian Geoffrey Wawro, director of the school’s Military History Center, Feb. 11, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]