["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Welcome to politics, where \"is\" is only \"is\" when someone says it is. Or so it seems.", "Just a week ago, former Republican presidential hopeful Mitt Romney inserted himself squarely into the current slugfest of a GOP primary via a highly publicized March 18  Facebook message, just a few days before voters in Utah, Idaho and Arizona went to the polls.", "Romney made no bones of the fact that he was trying to derail GOP front-runner Donald Trump. He wrote that \"Trumpism\" has been associated with \"racism, misogyny, bigotry, xenophobia, vulgarity and, most recently, threats and violence.\"", "He ended with this: \"I will vote for Senator Cruz and I encourage others to do so as well, so that we can have an open convention and nominate a Republican,\" Romney wrote.", "It certainly appeared to be an endorsement in a GOP primary contest where Romney vowed he would not endorse a candidate. He had also vowed to support the party’s nominee, regardless of who that might be.", "But Romney aides and \"allies\" stressed in news reports that this was not an endorsement.", "\"Mr. Romney’s vote in Utah, where he owns a house in Holladay, is not an endorsement, his allies stressed,\" The New York Times reported. \"Rather, it is part of his effort to unite the Republican Party around an alternative to Mr. Trump’", "Other news outlets reported Romney’s statement as an outright endorsement of Cruz, a \"sort of\" endorsement or something short of an endorsement.", "What’s going on here?", "Trump certainly took it as an endorsement of Cruz. He fired back on Twitter: \"Failed presidential candidate Mitt Romney, the man who ‘choked’ and let us all down, is now endorsing Lyin' Ted Cruz. This is good for me!\"", "Romney’s office declined to comment when PolitiFact contacted a spokeswoman.", "However, political scientists from across the country weighed in.", "Larry J. Sabato, a political scientist at the University of Virginia, pointed out that Romney was campaigning for Gov. John Kasich in Ohio a few weeks before he urged Utah voters to support Cruz.", "\"Essentially, Romney is telling Republicans to vote for the candidate who can beat Trump in any given state, with the clear objective to deny Trump 1,237 votes on the first ballot of the GOP convention,\" Sabato said. \"That will create an open convention, and the probability is that someone other than Trump will be picked on a subsequent ballot.\"", "Sabato said Romney is essentially endorsing \"strategic voting\" but not a specific candidate.", "Kerwin Swint, a political scientist at Kennesaw State University in metro Atlanta, agreed.", "\"I'd call it a ‘non-endorsement endorsement,’ \" Swint said. \"Romney is using Cruz, who he clearly dislikes, as a vehicle to try and stop Trump. The only place that might work is Utah. Outside of that, Romney's anti-Trump actions could actually help Trump. Romney reeks of ‘the GOP establishment.’ \"", "Nathan Gonzales of the Rothenberg & Gonzales Political Report said Romney and his allies are \"splitting hairs.\"", "\"If you publicly support and vote for a candidate and encourage others to do the same, the only thing left is to utter the word 'endorse,’ \" Gonzales said. \"This is a good example of why Donald Trump is leading the field because politicians and party loyalists are playing the game with an old playbook. Instead of trying to stop Trump, Romney and company are arguing with reporters over the meaning of the word ‘endorse.’ \"", "Political scientist Steven Smith of Washington University said the nuanced approach is complex but defendable.", "\"Romney is trying to say that his strategic recommendation (vote for Cruz) is not yet a sincere recommendation (endorsement) of Cruz for president,\" Smith said. \"That’s complicated but reasonable.\"", "Our ruling", "Romney’s aides and allies tried to spin his Facebook post in which he blasted Trump and urged voters to support Cruz as something other than an endorsement.", "Technically, they have a point, according to political scientists. But the statement is also misleading.", "We rate it Half True.", "---------------------------------------------------------------------------------------------", "Romney Facebook post", "Trump Tweet: Donald J. Trump ✔ ‎@realDonaldTrump", "Email from Nathan Gonzales", "Email from Dr. Larry J. Sabato, Director, Center for Politics,  University Professor of Politics, University of Virginia", "Email from Steven Smith, Kate M. Gregg Distinguished Professor of Social Sciences, Director, Weidenbaum Center on the Economy, Government, and Public Policy, Washington University", "Email from Kerwin Swint, Ph.D., Professor and Chair, Department of Political Science & International Affairs, Kennesaw State University", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]