["Though state Sen. Kelli Stargel has watered down her bill regulating craft breweries to allow 64-ounce growlers, she’s made it very clear she still thinks the content is strong.", "Stargel, R-Lakeland, on April 28 wrote an editorial in the Tallahassee Democrat defending her position on SB 1714, which would allow sales of 64-ounce growlers but require microbreweries to sell through distributors if its sales are high enough. She introduced an amendment to allow breweries to sell up to 20 percent of their product in house.", "Her editorial pointed out the apparent dangers of allowing brewers to sell their product.", "\"In states where beer is unregulated, the per capita production is significantly higher,\" she wrote. \"Higher beer production and higher consumption go hand-in-hand. As a social conservative, this is why I believe we need to keep regulations on alcoholic beverages in place and not have unregulated beer widely available in the marketplace. Social issues greatly impact economic issues, and we must seek a balance on both.\"", "We looked at the regulation claim in a separate item, but we also were curious whether higher beer production led to higher consumption. Time for PolitiFact Florida to buy another round.", "Small batches, big problems?", "Microbreweries and craft brewing have been growing in popularity in Florida, but still account for about 8 percent of total beer production in the entire country. Read more about the trend here.", "The biggest criticism of SB 1714 is that it punishes craft breweries by making them adhere to the same rules of distribution large breweries have, specifically limiting how much they can sell directly to consumers. (We discuss the three-tier system of suppliers/wholesalers/retailers in the other check.) The bill passed the Senate, 30-10, on April 28 and was sent to the House, where it was expected to be voted down.", "Microbrewers argue that the bill will force them to pay costs they can’t afford because they don’t sell enough product. Meanwhile, they counter, large brewing operations sell enough volume to deal with the expense.", "But the question here is whether making more beer makes people drink more.", "We first turned to the Brewers Association, a trade group comprised mostly of small brewers and associated workers, including wholesalers, to see whether Stargel’s claim held water. Their economist Bart Watson pointed out 2012 data from the Beer Institute that showed the opposite. The Beer Institute is a D.C.-based lobbying group representing brewers, wholesalers and retailers.", "California, the highest-producing state by beer shipments, ranked a lowly 44th in per capita consumption (as measured in gallons per resident older than 21). In an ironic flipping of the numbers, North Dakota ranked 44th in total shipments, but was the highest per capita beer consumer. Florida ranked third in total shipments, but ranked only 34th in per capita consumption.", "Watson said the evidence supporting a link between production and consumption is weak at best, since the correlations the Beer Institute data makes for both craft beer and large-scale brewers are statistically small. But for Stargel to use it as the basis of her argument is suspect, because overall alcohol consumption should be the focus of her line of thinking, not just beer.", "\"As the alcoholic beverage of moderation, increased beer consumption at the expense of higher ABV (alcohol by volume) choices, such as spirits, might be a beneficial if the goal were limiting excessive consumption, as the article suggests,\" Watson said.", "PolitiFact Florida asked Stargel’s office to back up her information. Spokesperson Rachel Barnes told us, \"Keeping in mind the focus of the bill, Sen. Stargel was using the rule of supply and demand regarding deregulated beer. We know that higher beer production means lower beer prices. Lower beer prices mean higher beer consumption.\"", "The Beer Industry of Florida, a distributor lobbying group, cited a 1988 piece in the Journal of Public Health Policy called \"Public Action and Awareness to Reduce Alcohol-Related Problems: A Plan of Action\" by James Mosher and David Jernigan. The paper proposed alcoholism treatment plans based on a \"new theoretical approach … supported by recent research, which has demonstrated a connection between alcohol availability (e.g. price, minimum drinking age, etc.), per capita consumption, and in turn, alcohol-related problems.\" That definition of availability doesn’t seem like the same thing as production, though.", "We searched and searched for more thorough evidence and came up empty.", "Our ruling", "Stargel said \"higher beer production and higher consumption go hand-in-hand.\"", "An economist with a trade group pointed to stats that said it may actually be the opposite. In terms of craft brewing, there may be a very weak link that is statistically insignificant. In terms of total production, the numbers suggest that the more beer a state produces, the less it drinks in terms of gallons per person over drinking age.", "We rate her statement Mostly False.", "Tallahassee Democrat, \"Kelli Stargel: Beer bill is all about keeping protections,\" April 28, 2014", "Journal of Public Health Policy, \"Public Action and Awareness to Reduce Alcohol-Related Problems: A Plan of Action,\" Spring 1988", "Fox News, \"Which states drink the most (and least) beer?,\" Aug. 27, 2013", "SeriousEats.com, \"Beer Issues: What's Up With the Three-Tier System?,\" Jan. 8, 2014", "Miami Herald, \"Growler bill pits Florida microbreweries against big-money beer interests,\" April 22, 2014", "Brewers Association, \"Dr. Statelaws: Or How I Learned to Stop Worrying and Love Self-Distribution,\" April 22, 2014", "Cigar City Brewing, \"Our Founder/CEO Joey Redner on Senate Bill 1714,\" April 24, 2014", "Tampa Bay Times, \"Cigar City founder Joey Redner considers leaving Florida if bill passes,\" April 24, 2014", "BeerPulse.com, \"Beer Industry of Florida releases statement on proposed Florida beer legislation,\" April 25, 2014", "Miami Herald, \"Intent on wrecking Florida’s beer industry,\" April 26, 2014", "St. Augustine Record, \"Jacksonville's craft brewers growling about legislation that favors beer distributors,\" April 28, 2014", "Context Florida, \"Sen. Kelli Stargel: Amendment designed to find common ground in beer battle,\" April 28, 2014", "Daytona Beach News-Journal, \"Beer bill remains tough to swallow,\" April 28, 2014", "Tampa Bay Buzz blog, \"Senate growler bill likely to fall flat in House, says Rep. Dana Young,\" April 29, 2014", "Creative Loafing, \"Joey Redner isn't celebrating the demise of Kelli Stargell's craft beer bill just yet,\" April 30, 2014", "Florida Senate, \"CS/CS/SB 1714: Malt Beverages,\" accessed April 28-May 1, 2014", "Brewers Association, \"Self-Distribution Laws,\" accessed April 29, 2014", "Brewers Association, \"Growler Laws,\" accessed April 29, 2014", "Beer Institute, \"Shipments of Malt Beverages and Per Capita Consumption by State 2012,\" accessed April 29, 2014", "Florida Beer Wholesalers Association, \"Three-Tier System: Florida’s Regulatory System Benefits Everyone,\" accessed April 29, 2014", "Interview with Bart Watson, Brewers Association staff economist, April 29-May 1, 2014", "Interview with Chris Thorne, Beer Institute vice president of communications, April 29-May 1, 2014", "Interview with Rachel Barnes, spokesperson for Sen. Kelli Stargel, April 30-May 1, 2014", "Interview with Meredith Gould, Beer Industry of Florida director of meetings and membership, April 30-May 1, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]