["About this rating", "Venturing predictions of large-scale socioeconomic trends is part and parcel of what economists do, so for members of that august profession the odds are fairly high that now and again one will be required to eat one's own words.", "Sometimes those words will even be served back to one on a silver platter, as in the case of Nobel Prize-winning economist Paul Krugman, who thanks to the Internet, will probably never live down a prediction he allegedly once made about the Internet. The quote is so infamous, in fact, that it has turned into a meme often wielded against him by people hoping to discredit other pronouncements Krugman has made:", "I'm waiting for Krugman to fax in his update of the economy. pic.twitter.com/8FYoEEhrBO", "— Ronald Guillemette (@raguillem) May 30, 2018", "It has also made the rounds in a slightly longer version:", "P. Krugman 1998, “The growth of the Internet will slow drastically, as the flaw in ‘Metcalfe’s law' becomes apparent: most people have nothing to say to each other! By 2005, it will become clear that the Internet’s impact on the economy has been no greater than the fax machine’s”", "— Atlas Bridge (@atlas_bridge) December 24, 2017", "The prediction was wildly inaccurate in either form, obviously. Internet growth has done nothing but boom since the late 1990s. And although the fax machine was a crucial innovation that increased the speed and affordability of inter-office communications everywhere, the economic effects of the Internet — which has come to play a central role in virtually every aspect of life in every developed country — have been nothing short of transformative.", "\"As of this writing, the market capitalization of Google, Amazon, and Facebook alone is more than $700 billion, which is more than the GDP of all but eighteen countries,\" observed Freakonomics authors Steven D. Levitt, Stephen J. Dubner in a 2014 takedown of Krugman's prediction. \"If you throw in Apple, which isn't an Internet company but couldn't exist without it, the market cap is $1.2 trillion. That could buy a lot of fax machines.\"", "That Krugman wrote the passage isn't under dispute, so much as where and when he wrote it. In an e-mail to Business Insider in 2013, Krugman said it was part of a piece he contributed to New York Times Magazine in 1998:", "It was a thing for the Times magazine's 100th anniversary, written as if by someone looking back from 2098, so the point was to be fun and provocative, not to engage in careful forecasting; I mean, there are lines in there about St. Petersburg having more skyscrapers than New York, which was not a prediction, just a thought-provoker.", "The magazine celebrated its 100th anniversary in 1996, not 1998, however, and although Krugman did write a piece for the 29 September 1996 edition that matches the above description, it did not contain a passage contrasting the effect of the Internet to that of the fax machine.", "Levitt and Dubner correctly cited an article by Krugman in the 10 June 1998 issue of Red Herring magazine as the actual source of the quote:", "Smart people love to make smart-sounding predictions, no matter how wrong they may turn out to be. This phenomenon was beautifully captured in a 1998 article for Red Herring magazine called \"Why Most Economists' Predictions Are Wrong.\" It was written by Paul Krugman, himself an economist, who went on to win the Nobel Prize. Krugman points out that too many economists' predictions fail because the overestimate the impact of future technologies, and then he makes a few predictions of his own. Here's one: \"The growth of the Internet will slow drastically, as the flaw in 'Metcalfe's law' — which states that the number of potential connections in a network is proportional to the square of the number of participants — becomes apparent: most people have nothing to say to each other! By 2005 or so, it will become clear that the Internet's impact on the economy has been no greater than the fax machine's.\"", "When we asked Krugman about the confusion over the provenance of the quote, he said he couldn't remember writing the Red Herring article, but he didn't shy from admitting his mistake:", "I must have tossed it off quickly (at the time I was mainly focused on the Asian financial crisis!), then later conflated it in my memory with the NYT piece. Anyway, I was clearly trying to be provocative, and got it wrong, which happens to all of us sometimes.", "Atkinson, Robert D., et al.  \"The Internet Economy 25 Years After .Com.\"\r\n  The Information Technology & Innovation Foundation.  March 2010.", "Krugman, Paul.  \"White Collars Turn Blue.\"\r\n  The New York Times Magazine.  29 September 1996.", "Krugman, Paul.  \"Why Most Economists' Predictions Are Wrong.\"\r\n  The Red Herring.  10 June 1998.", "Levitt, Steven D. and Dubner, Stephen J.  Think Like a Freak: Secrets of the Rogue Economist.\r\n  London: Penguin UK, 2014.  ISBN 9781846147562.", "Risen, Tom.  \"Study: The U.S. Internet Is Worth $966 Billion.\"\r\n  U.S. News & World Report.  11 December 2015.", "Yarow, Jay.  \"Tech People Are Passing Around this Paul Krugman Quote on the Internet After He Called Bitcoin 'Evil.'\"\r\n  Business Insider.  30 December 2013.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]