["About this rating", "Dr. Christine Blasey Ford faced a torrent of personal attacks and conspiracy theories in September and October 2018, after she publicly accused federal judge Brett Kavanaugh, President Donald Trump's Supreme Court nominee, of sexually assaulting her when they were both high school students in Maryland in the early 1980s.", "In late September 2018, a conspiracy theory emerged holding that Blasey Ford was closely linked to the Central Intelligence Agency (CIA), and that her allegations were false and part of a CIA plot to block Kavanaugh's confirmation and disrupt President Trump's agenda.", "One meme which spread the conspiracy-mongering read as follows:", "If you believe this woman's story, consider this ...", "Her grandfather, Nicholas Deak, was a well known CIA agent for decades.", "Her father Ralph Blasey II ran three CIA-front companies Red Coats Inc., Datawatch, and Admiral Security Systems.", "And her brother Ralph Blasey II [sic] once worked for the law firm Baker Hostetler which was behind the creation of Fusion GPS and subsequently the dossier used to start the Russian collusion investigation.", "Get the picture?", "Another meme emerged from a tweet and blog post published by conservative radio host Michael Savage on 27 September 2018:", "WHO IS DR BLASEY FORD?", "WELL, BESIDES BEING A “PROFESSOR” AT THE OFF BRAND UNIVERSITY, SHE ALSO WORKS AT A MAJOR UNIVERSITY DOWN THE STREET FROM PALO ALTO. SHE JUST SO HAPPENS TO HEAD UP THE CIA UNDERGRADUATE INTERNSHIP PROGRAM AT STANFORD UNIVERSITY.", "CHRISTINE BLASEY’S BROTHER, RALPH THE THIRD, USED TO WORK FOR THE INTERNATIONAL LAW FIRM OF BAKER, HOSTETLER. THE FIRM CREATED FUSION GPS, THE COMPANY WHO WROTE THE RUSSIAN “DOSSIER”. THEY LATER ADMITTED IT WAS ONLY A COLLECTION OF FIELD INTERVIEWS.", "BAKER HOSTETLER IS LOCATED IN THE SAME BUILDING WHERE THE CIA OPERATES THREE COMPANIES CALLED:\nRED COATS INC. ADMIRAL SECURITY SERVICES AND DATAWATCH\nTHEY ARE OPERATED BY RALPH BLASEY II. HE IS THE FATHER OF CHRISTINE AND RALPH III.", "CHRISTINE AND RALPH III’S GRANDFATHER WAS NICHOLAS DEAK. FORMER CIA DIRECTOR WILLIAM CASEY ACKNOWLEDGED DEAK’S DECADES OF SERVICE TO THE CIA.", "IS DR. FORD DEEPLY TIED TO THE CIA? pic.twitter.com/QcRLchqGGn", "— Michael Savage (@ASavageNation) September 27, 2018", "The theory that Blasey Ford, in making her allegations against Kavanaugh, is acting on behalf of the CIA or as part of a CIA plot against him has three basic components:", "This theory, and its component strands, were written about and promoted on several non-mainstream web sites during September 2018, including What Does It Mean, the BrassBalls blog, ZeroHedge, Before It's News, and in a segment on Alex Jones' InfoWars show (in which Jones claimed Blasey Ford and her family were part of the \"leftist arm of the CIA,\" whose function is \"to create transgender children,\" among other pronouncements).", "On 17 September, WhatDoesItMean.com's \"Sorcha Faal\" outlined this somewhat complicated web of claims:", "An intriguing in-depth new Foreign Intelligence Service (SVR) report circulating in the Kremlin today states that a Stanford University Psychiatry Professor named Dr. Christine Blasey has become the latest centerpiece of a Central Intelligence Agency (CIA) plot to harm President Trump with her last-minute allegation, just days prior to US Senate confirmation, that Supreme Court nominee Brett Kavanaugh had attempted to sexually assault her over 30 years ago when they were teenage school children -- while being kept from the American people about Dr. Blasey is that she currently oversees the CIA Undergraduate Internship Program Stanford University developed by the notorious CIA-connected Stanford University Psychiatric Professor Dr. Frederick T. Melges -- who himself, in 1985, took into his care the homeless woman Lois Lang who assassinated CIA paymaster Nick Deak -- and that afterwards saw the CIA’s black operations monies being controlled by Ralph G. Blasey Jr. -- who, not so mysteriously, just happens to be the father of Dr. Christine Blasey.", "WhatDoesItMean.com has a long history of fabricating evidence, quotations, and stories, as noted by RationalWiki:", "Sorcha Faal is the alleged author of an ongoing series of \"reports\" published at WhatDoesItMean.com, whose work is of such quality that even other conspiracy nutters don't think much of it.", "The primary audience of Sorcha Faal's reports and the only ones who take them seriously are usually other conspiracy theorists ...", "Each report resembles a news story in its style, but usually includes a sensational headline barely related to reality (e.g. \"American Rebel Forces Attack Gas Pipelines, Explode Trains As US Civil War Nears\") and quotes authoritative high-level Russian sources (such as the Russian Federal Security Service in the same article) to support its most outrageous claims. Except for the stuff attributed to unverifiable sources, the reports don't contain much original material. They are usually based on various news items from the mainstream media and/or whatever the clogosphere is currently hyperventilating about, with each item shoehorned into the conspiracy narrative the report is trying to establish.", "The Stanford Connection", "Stanford University does not operate or manage its own \"CIA Undergraduate Internship Program,\" but rather promotes that internship (which is operated by the CIA itself in Washington, D.C.) to its students, along with several other fellowships and professional opportunities, under the auspices of the university's Haas Center for Public Service.", "Christine Blasey Ford is a research psychologist at Stanford, not a CIA internship program administrator. None of the posts claiming she directs, leads, or is in charge of the internship program provided any evidence to that effect, and none of them explained or acknowledged that the internship is an external one, run by the CIA itself thousands of miles away from Stanford's campus.", "The Haas Center for Public Service lists four staff members responsible for advising students on internships and fellowship. including the CIA's undergraduate internship, and Blasey Ford is not one of them. This claim of a direct personal link between Blasey Ford and the CIA, via Stanford University, therefore falls down.", "However, as an institution Stanford does have a history of working with the CIA, especially as part of Project MKUltra, a shadowy CIA-sponsored program in the 1950s and 1960s in which scientists and researchers, especially in the field of psychology, used drugs and other techniques to experiment with behavior modification and mind control.", "Stanford was just one of dozens of universities, research institutions, and hospitals across the United States that served as venues for such experimentation, which was at times illegal and unethical for using human beings as subjects, sometimes without their knowledge or consent. (Famously, the \"Unabomber\" Ted Kaczynski was subjected to brutal psychological experimentation, suspected to have been part of an MKUltra sub-project, while he was a promising mathematics student at Harvard in the late 1950s.)", "In January 1973, CIA Technical Services Director Sidney Gottlieb -- the infamous poisons expert who oversaw the MKUltra program -- destroyed many documents relating to the substance of the experiments  upon the order of then CIA Director Richard Helms, the U.S Senate would later hear. However, in 1977 a Freedom of Information Act request uncovered a trove of material, mostly invoices and other financial documents, relating to the program.", "Among that trove were hundreds of pages establishing the fact that Stanford University had been one of the dozens of institutions where MKUltra experimentation took place. The documents are now available on the web site of the university itself and indicate that MKUltra activities occurred at Stanford from around 1953 to 1964, with many of the orders and invoices signed by Gottlieb himself.", "Ralph Blasey III", "Here's how the BrassBalls blog explained this strand of the conspiracy theory:", "Christine Blasey’s brother [Ralph] used to work for the international law firm of Baker Hostetler. The firm created Fusion GPS, the company who wrote the Russian “dossier”. They later admitted it was only a collection of field interviews. Baker Hostetler is located in the same building where the CIA operates three companies called Red Coats Inc., Admiral Security Services, and Datawatch. They are operated by Ralph Blasey II. He is the father of Christine and Ralph III.", "This component of the overall theory is riddled with factual errors, fabrications, and logical failures.", "According to his LinkedIn profile, Ralph Blasey III (Christine's brother, and the son of Ralph Blasey Jr.) did indeed once work as a litigation partner for Baker Hostetler in the firm's Washington, D.C. office.", "But Baker Hostetler did not \"create\" Fusion GPS, as the blog post claims. Rather, in 2017 Fusion GPS told the Washington Post that they had performed some work as a subcontractor for Baker Hostetler, who were representing a Russian holding company in a money laundering case brought by the U.S. Justice Department. (More information about Fusion GPS' place in the ongoing investigation into Russian interference in the 2016 elections can be viewed here.)", "However, Fusion GPS told the Post that their work for Baker Hostetler began in 2013, while Ralph Blasey III stopped working for the law firm in 2004, nine years before they engaged Fusion GPS.", "Baker Hostetler's Washington, D.C. address is 1050 Connecticut Avenue Northwest. None of the three companies listed in the conspiracy theory as CIA fronts run by Ralph Blasey Jr. (Christine's father) has offices at that address. Ralph Blasey Jr. is listed as Vice President for Business Development of one of them, Red Coats, Inc., a Bethesda, Maryland-based cleaning company.", "Admiral Security Services (which provides security guard and concierge services) is a division of Red Coats, and Datawatch Systems is owned and operated by the same people but located at a different address (albeit within walking distance in Bethesda.)", "Ralph Blasey Jr. works for only one of those three companies, none of which shares an address with Baker Hostetler (the law firm which Ralph Blasey III, in any case, left in 2004) or has been shown by any evidence whatsoever to be \"operated\" by the CIA.", "Like many other companies in the Washington, D.C. area, Datawatch Systems, which provides doorway and access security services, does have contracts with several federal government departments and agencies, as does Red Coats, Inc., and Admiral Security Services. However, none of them has a contract with the CIA.", "This attempt to link Christine Blasey Ford to the CIA through her brother Ralph therefore fails on several fronts.", "Nick Deak", "Before we get to the substance of this part of the conspiracy theory, it's worth pointing out the profound logical flaw at the heart of it. The underlying premise here is that, if Christine Blasey Ford's grandfather was an intelligence agent, she herself must therefore be steeped in spycraft and have the same interests, temperament, and profession as her grandfather. Anyone with a different personality or career to that of their grandfather will instinctively recognize this assumption as nonsensical.", "In any event, the claim here is that Blasey Ford's grandfather was the legendary CIA-linked currency trader Nicholas \"Nick\" Deak. Without offering any evidence of a familial relationship, the BrassBalls blog stated that \"Christine and Ralph III’s grandfather was Nicholas Deak. Former CIA Director William Casey acknowledged Deak’s decades of service to the CIA.\"", "Deak has been the subject of speculation and fascination for decades. In 1964, Time magazine called him \"the James Bond of the world of money,\" writing:", "Born in Hungary 58 years ago, Deak holds a doctorate in economics, can talk money in five languages, used to work for the League of Nations. A naturalized American, he spent World War II as an [Office of Strategic Services] agent parachuting into Burmese jungles to search for Japanese prisoners. On a postwar assignment, he sneaked Hungarian boxcars past the Russian occupiers to help rebuild West Germany's railways. Deak still keeps in OSS trim with a vegetarian diet, daily sprints around his own suburban running track, and ski trips with his Viennese wife. From a paneled office (cable address: Deaknick) overlooking lower Manhattan harbor, he supervises more than 100 agents working for Deak & Co., one of the world's biggest dealers in foreign currencies.", "In 1985, Deak was shot dead (along with his receptionist Frances Lauder) at his office in Lower Manhattan by Lois Lang, a homeless woman with a history of mental illness. Because of Deak's life-long connections to the CIA and a recent scandal which had implicated his firm in money laundering on behalf of international crime organizations, theories have been put forth that Lang was not merely motivated by her own delusions, as investigators concluded, but was acting under the direction of nefarious and organized forces, criminal or governmental.", "In 2012, Arkadi Kuhlmann, who replaced Deak as CEO of his firm, told Salon of his own skepticism about the official account of his predecessor's murder:", "“I never believed that the whole thing was random,” said Kuhlmann, in an interview with Salon. Ditto the government inquiry that triggered the collapse preceding Lang’s rampage. “We were the CIA’s paymaster, and that got to be a little bit embarrassing for them,” he said. “Our time had passed and the usefulness of doing things our way had vanished. The world was changing in the '80s; you couldn’t just accept bags of cash. Deak was slow at making those changes. And when you lose your sponsorship, you’re out of the game.”", "Whatever the truth about the death of Nicholas Deak, one thing is clear: he was not Christine Blasey Ford's grandfather. Multiple news articles before and after his death stipulated that he had only one child, a son named Robert Leslie, also known as \"Les.\"", "This information obviously rules out the possibility that Deak was Blasey Ford's maternal grandfather, and since we know her father is Ralph Blasey Jr., we can say with certainty that Deak was not her paternal grandfather either. This eliminates the third and final component of the conspiracy theory, as articulated by Michael Savage and others.", "Interestingly, the WhatDoesItMean.com does not claim that Deak was Blasey Ford's grandfather, but rather connects the two by way of another figure from a bygone era, Dr. Frederick Melges:", "Though the American people were correctly told that Nicolas Deak assassin Lois Lang had previously been under psychiatric care, this report continues, what was failed to be reported to them was that Lang had been under the direct care and medical supervision of the CIA’s own Stanford University Psychiatric Professor Dr. Frederick T. Melges just prior to her traveling from Seattle to New York City to carry out this assassination—and who was the exact type of assassin Dr. Melges had been working to create in his CIA-funded mind control MKULTRA programme—and whose Canadian victims of are still being silenced after Prime Minister Justin Trudeau, this past December, imposed a gag order on them to keep them silent—but that does apply to Judge Kavanaugh accuser Dr. Christine Blasey, who remains able to teach her CIA Undergraduate Internship Program at Stanford University the MKULTRA mind control techniques discovered by Dr. Melges.", "The claims that Lang had been treated by Dr. Melges, and that Melges was associated with the MKUltra project, was written about in Salon's 2012 account of Deak's death:", "In August 1975, records show that Lang was discovered naked and catatonic in a Santa Clara motel room ... Police responding to the motel room took Lang to nearby Santa Clara Valley Medical Center. For the next month, she was put under the care of Dr. Frederick Melges, a psychiatrist associated with the Stanford Research Institute. One of Dr. Melges’ main areas of research: drug-aided hypnosis. A few years after Lang was put in Melges’ care, the New York Times exposed the Stanford Research Institute as a center for CIA research into “brain-washing” and “mind-control” experiments in which unwitting subjects were dosed with hallucinogenic drugs and subjected to hypnosis ...", "The Stanford Research Institute received CIA funding, and Dr. Melges published work about using drugs and hypnosis to create “disassociative states,” i.e., induced schizophrenia. One of Melges’ partners on these experiments was a doctor named Leo E. Hollister, who first dosed Ken Kesey with LSD as part of an Army experiment in 1960. He later admitted to author John Marks that he conducted drug research for the CIA ...", "In other words, the doctor who cared for Lang in Santa Clara was a senior figure at one of the CIA’s top institutional grantees. He worked side-by-side with a self-identified CIA collaborator, and conducted research into the kind of drug-induced behavior modification that the agency is known to have funded.", "We were unable to verify the claim that Dr. Melges took Lang into his care in 1975, or what that treatment might have entailed. Frederick Towne Melges (known as \"Rusty\") was a psychiatrist from Battle Creek, Michigan, who received his medical degree from Columbia University before working at the University of Rochester and Duke University in later years.", "In the late 1960s and early 1970s, Melges worked at Stanford University, researching the perception of time. He conducted studies into the effects of cannabis and alcohol on time perception, personal perceptions of the future, persecutory delusion among people with acute mental illness, and several subjects related to human emotion. Some of his research involved administering doses of THC (the hallucinatory component in cannabis) as well as alcohol.", "We were not able to verify the claim that Melges worked at the Stanford Research Institute, and it is unclear whether he ever took part in any MKUltra-related experimentation. However, even if one accepts for the sake of argument the claims made by WhatDoesItMean.com and Salon, no meaningful link exists between Dr. Melges and Christine Blasey Ford.", "Melges, who suffered from diabetes, died at the age of 52 in Durham, North Carolina, in July 1988, having worked at Duke University since 1977. Blasey Ford got her undergraduate degree from the University of North Carolina at Chapel Hill in 1988, then received a master's in clinical psychology from Pepperdine University in 1991, a PhD in educational psychology from the University of Southern California in 1996, and a master's in epidemiology from Stanford University in 2009.", "She and Melges never attended or worked at the same university contemporaneously. The earliest record we could find of Blasey Ford's working at Stanford was in the year 2000, by which time Melges had been dead for 12 years (and had left Stanford more than a decade before that).", "Even if Melges were associated with the MKUltra program, the fact of Christine Blasey Ford's attendance and employment at Stanford several decades later does not even come close to establishing a link between the two.", "Savage, Michael.   \"Is Dr. Ford Deeply Tied to CIA?\"\r\n    MichaelSavage.com.   27 September 2018.", "BrassBalls.blog.   \"Dr. Christine Blasey Heads Stanford's CIA Undergraduate Internship Program.\"\r\n    22 September 2018.", "ZeroHedge.   \"CIA Honeytrap Set -- Kavanaugh Accuser CIA Ties.\"\r\n    23 September 2018.", "BeforeItsNews.com.   \"Kavanaugh Accuser Family CIA Black Budget Ops/Fusion GPS/Deep State Security Ties.\"\r\n    BeforeItsNews.com.   17 September 2018.", "Faal, Sorcha.   \"Daughter of CIA Assassin Paymaster Tries to Bring Down Trump Supreme Court Nominee Kavanaugh.\"\r\n    WhatDoesItMean.com.   17 September 2018.", "U.S. Senate Select Committee on Intelligence and Committee on Human Resources.   \"Joint Hearing -- Project MKUltra, the CIA's Program of Research in Behavioral Modification.\"\r\n    3 August 1977.", "Rogin, Josh.   \"Inside the Link Between the Russian Lawyer Who Met Donald Trump Jr. and the Trump Dossier.\"\r\n    The Washington Post.   11 July 2017.", "TIME.   \"Money: The World of Deaknick.\"\r\n    Time.   12 June 1964.", "Hornblower, Margot.   \"Deak-Perrera Chairman Fatally Shot in Office.\"\r\n    The Washington Post.   19 November 1985.", "Kristof, Nicholas D.   \"Collapse of Deak & Company.\"\r\n    The New York Times.   10 December 1984.", "Associated Press.   \"Accused Killer Called Schizophrenic.\"\r\n    The Billings Gazette.   22 November 1985.", "Ames, Mark and Alexander Zaitchik.   \"James Bond and the Killer Bag Lady.\"\r\n    Salon.   2 December 2012.", "Associated Press.   \"Nicholas Deak, 80; Was Trader of Foreign Currencies, Agent.\"\r\n    The South Florida Sun Sentinel.   19 November 1985.", "August, Betsy.   \"Slain Currency Dealer Deak Eulogized in Manhattan.\"\r\n    The [White Plains] Journal News.   22 November 1985.", "Dean, Jim.   \"Takes New Post.\"\r\n    The Battle Creek Enquirer.   26 September 1984.", "Smith, Delos.   \"Tests Show Marijuana Distorts Sense of Time.\"\r\n    United Press International.   25 June 1971.", "The Battle Creek Enquirer.   \"Frederick T. Melges.\"\r\n    31 July 1988.", "The New York Times.   \"Read Christine Blasey Ford's Prepared Statement.\"\r\n    26 September 2018.", "Chang, Kiki D. et al.   \"Family Environment of Children and Adolescents with Bipolar Parents.\"\r\n    Bipolar Disorders.   2001.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]