["About this rating", "The eight largest single-day net drops in the Dow Jones Industrial Average have indeed occurred under the administration of U.S. President Donald Trump.", "None of the ten largest single-day percentage drops in the Dow has occurred under the administration of Trump.", "In February 2020, as fears surrounding the outbreak of a new coronavirus and a potential pandemic triggered the worst one-day drop in U.S. stocks since 2011, a chart began circulating via social media purportedly showing the \"8 Largest Dow Jones Drops in American History.\"", "What was notable about the chart was that all of the listed stock market drops had supposedly occurred during the administration of U.S. President Donald Trump:", "The chart was accurate as far as it went, replicating information from the Wikipedia \"List of largest daily changes in the Dow Jones Industrial Average\" page about the greatest single-day drops in the Dow:", "However, this chart only displayed net (or absolute) losses in the Dow, and obviously a drop of 1,000 points when the average stands at 25,000 is far less severe than a drop of 1,000 points when the average stands at only 5,000.", "As we detailed in another article, a chart of the largest single-day percentage (or relative) changes in the Dow shows that none of the top 10 single-day percentage drops in that stock index has occurred during the Trump administration:", "Biggest one-day percentage stock index losses", "(Sources:  The Wall Street Journal's Market Data and Yahoo! Finance's downloadable Dow Jones data)", "The largest single-day percentage drop in the Dow took place on Oct. 19, 1987 — a day commonly known as Black Monday — when the Dow fell 508 points for a loss of 22.6% of its value.", "Wikipedia.   \"List of Largest Daily Changes in the Dow Jones Industrial Average.\"\r\n    Accessed 28 February 2020.", "Wikipedia.   \"Black Monday (1987).\"\r\n    Accessed 28 February 2020.", "Associated Press.   \"Virus Anxiety Triggers Biggest 1-Day Market Drop Since 2011.\"\r\n    Snopes.com.   28 February 2020.", "MacGuill, Dan.   \"Does the Dow Jones Do Worse Under Republican Presidents?\"\r\n    Snopes.com.   8 February 2018.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]