["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Post from Jody Hice's Facebook page", "Even political junkies could be forgiven for not paying much attention to election in Georgia’s 10th Congressional District.", "Pundits expect the heavily Republican swath of exurbs and rural land in the northeast corner of Georgia to pick GOP nominee Jody Hice over Democrat attorney Ken Dious come November.", "A former minister and radio talk show host, Hice has generated plenty of attention from his conservative takes on topics as disparate as religion (Islam not a religion but a \"geopolitical structure and, as such, does not deserve First Amendment protection\") and  qualifications to run for political office (\"If the woman’s within the authority of her husband, I don’t see a problem.\").", "But certainly no one could roll their eyes to Hice’s decision to showcase what he calls his Constitutional conservatism via quotes from political idol Thomas Jefferson on Hice’s Facebook and Twitter pages.", "\"That government is best which governs the least, because its people discipline themselves,\" reads the quote attributed to Jefferson, over the image of a waving American flag.", "A reader asked PolitiFact Georgia to check out the quote. So we did.", "To quote the Internet, 'Merica!", "To quote Anna Berkes, the research librarian at the Thomas Jefferson Foundation at Monticello in Virginia, \"That sounds like something that he might have said or written, but in fact, he did not.\"", "It turns out that our third president, the lead author of the Declaration of Independence who left this earthly plane 188 years ago, remains a prolific \"author\" on the Internet.", "He, too, has tackled topics as disparate as religion (\"The Bible is the source of liberty,\" a bogus quote) and the qualifications to run for political office (\"No man will ever bring out of that office the reputation which carries him into it,\" a verified quote).", "The misattributions floating around the web got so bad that a few years ago, Berkes set up the Spurious Quotations page on the Monticello website.", "The fake posted by Hice is a common mistake that was first incorrectly attributed to Jefferson in 1853. Historians long attributed the quote to Henry David Thoreau, who used a variation of it in his 1849 essay, \"Civil Disobedience,\" to argue that individuals should not let governments to make them agents of injustice.", "New research indicates, though, that Thoreau himself was likely quoting the magazine, The United States Magazine and Democratic Review, where the sentiment first appeared in 1837, Berkes said.", "\"The opinion has been associated with Jefferson’s Democratic-Republican party ideology, which is probably why people think he said it,\" Berkes said. \"The association is what has been called a natural Jeffersonian maxim. It’s just not a Jefferson quote.\"", "Hice did not respond to requests for comment.", "He may, as Berkes’ suggests, find the dubious quotes still prove useful to convey a long-held ideology, regardless of the source.", "Or, as librarian and Jefferson researcher Eyler Robert Coates concludes, the attribution may belie a misunderstanding of Jefferson’s views. Coates argues the quote does not represent Jefferson because of its vague, abstract use of \"best\" and \"least.\"", "One thing that is clear, is that there is no verifiable evidence that Thomas Jefferson ever said or wrote the sentiment.", "Correcting the record would surely square with Jefferson, who once said, \"If we are to guard against ignorance and remain free, it is the responsibility of every American to be informed.\"", "OK, he didn’t say that, either.", "Thanks to Berkes’ carefully footnoted research, we can rate both our claim and that from Hice as False.", "Jody Hice Facebook page", "Jody Hice Twitter page", "Jody Hice, \"It’s Now or Never: A Call to Reclaim America,\" published by West Bow Press in 2012", "The Thomas Jefferson Foundation at Monticello, Spurious Quotes, accessed Aug. 26, 2014", "The Thomas Jefferson Foundation at Monticello, Spurious Quotes, accessed Aug. 28, 2014", "Buzzfeed, \"Nearly Every Founding Fathers' Quote Shared By A Likely Future Congressman Is Fake,\" Aug. 26, 2014", "Interview with Anna Berkes, research librarian the Thomas Jefferson Foundation at Monticello, Aug. 28, 2014", "Eyler Robert Coates, \"The Jeffersonian Perspective,\" accessed Aug. 29, 2014", "Merrill Peterson, \"The Jefferson Image in the American Mind,\" Published by Oxford University Press, 1960", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]