["About this rating", "We've been covering Taco Bell rumors for more than 20 years. Stories we've rated included misleading claims about cockroach eggs, \"Grade D but edible\" meat, and the fast-food chain's Cinnamon Twists dessert.", "On Dec. 4, 2020, TikTok user @maniic666 shared a video of what appeared to be dehydrated refried beans being prepared in a Taco Bell kitchen.", "The video was overlayed with text that read \"Taco bells beans...look like rabbit food.\" It was on pace to surpass 400,000 views in its first four days.", "The TikTok user claimed to have been a Taco Bell manager and posted another video of vaping in the restaurant's kitchen, this time with the text \"Pittsburgh, Pennsylvania\" overlaying the video. It was unclear if the videos were shot recently. One commenter threatened to send the vaping video \"to corporate,\" and @maniic666 responded: \"Lmfao go ahead I haven't worked there in 6 months.\"", "It's true that the TikTok video showed the process for preparing Taco Bell's refried beans. In fact, this wasn't the first time such a video had been posted to TikTok. Previous such videos going back as far as this one from May 2019 had already shown the same process. TikTok videos from June and September 2020 had racked up more than 10 million total views.", "Taco Bell's refried beans prep process has also been covered by RuinMyWeek.com, The Daily Dot, InTheKnow.com, and Mashed. The Daily Dot's headline read: \"Employee 'exposes' how Taco Bell beans are made in viral TikTok video.\"", "In November 2020, InTheKnow.com reported:", "A Taco Bell employee is going viral on TikTok after sharing the process behind one of the chain’s most iconic ingredients.", "The fast-food worker, who goes by the name homerolara0 on social media, posted the behind-the-scenes clip on June 7, where it’s since been viewed more than 3.2 million times. In it, the TikToker shows how Taco Bell prepares its refried beans.", "Homerolara0’s clip (which features explicit music) begins with him opening a white, sealed package that contains pieces of beans, which almost resemble macaroni noodles. He then proceeds to boil water and cook the beans inside a metal vat.", "Despite the negative comments on the viral videos, dehydrated refried beans are not all that rare. Walmart sold instant refried beans from the Herdez brand. The HEB grocery store chain also sold a Santa Fe Bean Company's dehydrated refried beans. Amazon sold instant refried bean products from Mexicali Rose, Fantastic Foods, and Casa Corona.", "On the Taco Bell website, the company published questions and answers about its ingredients:", "We buy many of our ingredients for our restaurants from the same brands that you see in the grocery store and your kitchen: for example, lettuce from Taylor Farms, tortillas from Mission, Hass avocados and poultry from Tyson. We’ve had long-standing relationships with all of our suppliers to ensure they meet and exceed industry standards for food quality. All of our ingredients are certified by the Food and Drug Administration, under the GRAS provision. To learn more about GRAS ingredients please visit, https://www.fda.gov/Food/IngredientsPackagingLabeling/GRAS/.", "According to the Taco Bell website, its refried beans are \"certified vegan.\" Ingredients include \"pinto beans, soybean oil, and seasoning (salt, sugar, spice, beet powder (VC), natural flavors, sunflower oil, maltodextrin, corn flour, trehalose, and modified cornstarch).\" The company also makes cooked cans of beans that are sold in grocery stores.", "We reached out to Taco Bell about the viral TikTok videos and its refried beans. They responded with the following statement:", "In order to provide the same flavor and consistency at all of our locations, our refried beans are delivered dehydrated and prepared in-restaurant to ensure the best quality. We use a proprietary spice blend in our refried beans to deliver the craveable flavor our guests know and love and are certified vegan by the American Vegetarian Association. We encourage fans to check out our ingredient statements on our website at www.tacobell.com/nutrition/ingredients. – Taco Bell Corp.", "Update: On Dec. 10, 2020, Taco Bell responded to us with a statement. That statement was added to the story.", "Jordan Liles is a Senior Reporter who has been with Snopes since 2016.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]