["One of Donald Trump’s signature policy proposals during the 2016 presidential campaign has been to build a wall on the U.S.-Mexico border. In remarks after the Super Tuesday primaries and caucuses, Trump drew an explicit comparison between his proposed wall and the Great Wall of China.", "\"They say you’ll never be able to build a wall,\" Trump said on March 2, 2016. \"Well, it’s 2,000 miles but we really need 1,000 miles. The Great Wall of China, built 2,000 years ago, is 13,000 miles, folks, and they didn’t have Caterpillar tractors, because I only want to use Caterpillar, if you want to know the truth, or John Deere. … We can do that so beautifully. And this is going to be a serious wall. This is going to be a high wall. This is going to be a very serious wall.\"", "A number of people asked us to check whether Trump’s description of the Great Wall -- that it was built 2,000 years ago and that it’s 13,000 miles long -- was accurate.", "After checking with scholars of the period, we found that the numbers Trump are grounded in reality, but that there’s a lot of nuance that’s been lost in the process.", "The wall was ‘built 2,000 years ago’", "As a starting point for the Great Wall’s construction, \"2,000 years ago\" has some merit. The United Nations Educational, Scientific and Cultural Organization (UNESCO) and other groups say that around 220 B.C., efforts began to link together existing earthen walls on modern-day China’s northern frontier.", "But today, those early walls are barely discernible, if at all. Better constructed portions of the wall only came into existence much later -- and over many centuries, said Lynn A. Struve, an East Asian historian at Indiana University and author of Time, Temporality, And Imperial Transition: East Asia From Ming To Qing..", "\"Almost every dynasty contributed to building the wall,\" said Arthur Waldron, an East Asian historian at the University of Pennsylvania and the author of the seminal 1992 volume, The Great Wall of China: From History to Myth. (The bottom portion of the figure below shows the full historical timeline.)", "Indeed, the most familiar and best-preserved portions of the wall are more recent than Trump indicated -- only 300 to 600 years old. They were built during the Ming dynasty (1368–1644), when the Great Wall became the world's largest military structure, according to UNESCO.", "\"The Great Wall you see today was almost entirely built in the 1500s under the Ming dynasty,\" said Kenneth M. Swope, a University of Southern Mississippi historian and author of A Dragon's Head and a Serpent's Tail: Ming China and the First Great East Asian War, 1592-1598.", "The wall’s length ‘is 13,000 miles’", "In citing this figure, Trump can point to an official statistic. In 2012, China's State Administration of Cultural Heritage released a five-year-long study that the wall is 13,170 miles long -- much longer than the previous estimate of 5,500 miles, which was limited to the Ming-era structures.", "But this number should be taken with a grain of salt, experts said.", "For starters, this includes all of the wall, not just the Ming-era portions. And just a fraction of these 13,000 miles includes intact walls.", "And contrary to the wall in Trump’s proposal, the wall \"is not contiguous,\" Swope said. (This can be seen in the map portion of the graphic above.)", "Waldron calls the Chinese government’s estimate the most generous measurement. \"China is endlessly puffing up the wall for the benefit of tourism,\" he said.", "He said his fairest estimate would be perhaps 1,700 miles, \"with a solid line\" around Beijing and \"elsewhere a dotted line.\"", "In the view of the scholars we contacted, the wall also doesn’t serve as a particularly good model for Trump’s point.", "Historically, trade was generally a far more successful policy than warfare. Indeed, walls didn’t stop the Mongols and the Manchus from crossing the frontier and causing serious trouble, including, ultimately, the fall of the Ming and the establishment of the Manchu, or Qing, dynasty that lasted from 1644 to 1912.", "\"The wall never worked,\" said Michael Szonyi, a professor of Chinese history at Harvard University and author of Practicing Kinship: Lineage and Descent in Late Imperial China.", "Waldron, who added that he is sympathetic to the notion of closing off U.S. borders more completely, nonetheless agreed with Szonyi’s assessment of the Great Wall. The Great Wall \"didn't do what it was supposed to do, it was enormously costly, and there's no question that it caused great suffering among the people who built it,\" he told Mother Jones magazine.", "He added to PolitiFact, \"I would say Trump is one of a long train of Western and Chinese people who bought into the mythology of the wall.\"", "Our ruling", "Trump said that the Great Wall of China was \"built 2,000 years ago\" and \"is 13,000 miles\" long.", "He has repeated two figures that are widely cited and, superficially at least, seem credible. But when we ran them by several experts in Chinese history, we found that the reality is more nuanced.", "Major unifications of early portions of the wall did occur about 2,200 years ago. However, the wall was built over the course of many centuries, and the best preserved, most iconic portions of the wall are a lot younger -- roughly 500 years old.", "Meanwhile, a Chinese government survey from 2012 reported a total length of 13,000 miles. However, this figure includes many bits and pieces of wall, some of them quite isolated.", "Trump’s statement is partially accurate but leaves out important details, so we rate it Half True.", "Time, \"Read Donald Trump’s Super Tuesday Victory Speech,\" March 2, 2016", "Daily Mail, \"Miles out: The Great Wall of China is 13,170 miles long... that's more than twice the length of previous estimates,\" June 6, 2012", "UNESCO, \"The Great Wall,\" accessed March 6, 2016", "Mother Jones, \"Donald Trump Loves the Great Wall of China. Too Bad It Was a Complete Disaster,\" March 3, 2016", "Washington Post, \"Some facts for Donald Trump about the Great Wall of China,\" March 2, 2016", "Email interview with Michael Szonyi, a professor of Chinese history at Harvard University and author of Practicing Kinship: Lineage and Descent in Late Imperial China, March 4, 2016", "Email interview with Lynn A. Struve, East Asian historian at Indiana University and author of Time, Temporality, And Imperial Transition: East Asia From Ming To Qing, March 4, 2016", "Email interview with Kenneth M. Swope, University of Southern Mississippi historian and author of A Dragon's Head and a Serpent's Tail: Ming China and the First Great East Asian War, 1592-1598, March 4, 2016", "Email interview with Madeleine Zelin, a professor of Chinese studies at Columbia University and author of The Merchants of Zigong: Industrial Entrepreneurship In Early Modern China., March 7, 2016.", "Interview with Arthur Waldron, East Asian historian at the University of Pennsylvania and the author of The Great Wall of China: From History to Myth, March 4, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]