["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Immigration enforcement is a top issue for the border state of Arizona, and one that Republican congresswoman Martha McSally has elevated during her campaign for the U.S. Senate.", "In an interview with Fox News, McSally said that Democratic rival and U.S. Rep. Kyrsten Sinema voted to weaken the federal agency responsible for executing immigration laws within the United States, U.S. Immigration and Customs Enforcement.", "\"This is a dangerous agenda coming out of the Democrats, and again my opponent voted to cut ICE. ... I support ICE and my opponent voted for cuts to ICE, voted not to support the Department of Homeland Security,\" McSally said in the interview that aired Sept. 16. \"She is associated with this dangerous agenda, don’t be fooled by it. And that’s a real contrast in this race as well.\"", "McSally is on the House Homeland Security Committee and chairs the Border and Maritime Security Subcommittee.", "Is it true that Sinema \"voted to cut ICE\"? There’s truth to McSally’s claim, but it leaves out important details.", "• Sinema voted to shift funds from ICE to other agencies.", "• However, Sinema also voted to increase ICE’s funding in fiscal year 2018 and, like McSally, voted in favor of a resolution supporting ICE.", "• Sinema said abolishing ICE \"isn’t realistic and it doesn’t make any sense.\"", "McSally’s campaign said Sinema was among Democrats who voted in favor of an amendment to an appropriations bill for fiscal year 2018. That amendment, sponsored by Rep. Lou Correa, D-Calif., sought to reduce ICE funding by $100 million and give that money to the U.S. Coast Guard. (The amendment failed.)", "Correa argued on the House floor that the Coast Guard should use the money for additional ships to interdict drugs coming to the United States by sea. Despite record-breaking efforts against drug trafficking, the Coast Guard’s cocaine seizures accounted for less than 10 percent of all attempted shipments, Correa said.", "The $100 million represented \"additional support for our border security, our high seas,\" Correa said. He was responding to Rep. John Carter, R-Texas, who argued that the Coast Guard program was already robust and ICE money should go toward the detention of immigrants.", "Sinema’s campaign argued that the $100 million redirection would have reduced an overall increase in ICE funding, but not necessarily cut it.", "That September, Sinema also voted in favor of a motion introduced by Rep. Sheila Jackson Lee, D-Texas, to recommit a bill to the House Appropriations Committee. The intention was to get the committee to amend the bill by allocating $2.4 billion to FEMA’s National Pre-Disaster Mitigation Fund.", "About $840 million would have come from ICE’s budget and $1.6 billion from U.S. Customs and Border Protection's allocation for border barriers. (The motion failed.)", "Jackson Lee argued that instead of funding a border wall and ICE detention facilities, more money was needed for pre-disaster funding, especially in light of Hurricane Harvey's aftermath in Texas and Louisiana.", "\"We do not need another 10,000 beds in ICE detention centers; but we do need more than 10,000 beds in evacuation shelters,\" said Jackson Lee.", "In spite of those votes, Sinema’s spokeswoman Helen Hare said McSally’s claim ignores a big part of the story.", "Sinema voted in favor of a 10 percent funding increase for ICE, compared to fiscal year 2017.", "Sinema over her years in Congress also has voted in favor of other appropriation bills funding ICE, her campaign said.", "Moreover, Sinema was one of 18 Democrats who voted in favor of a July resolution stating explicit support for ICE officers and personnel and denouncing calls to abolish the agency. Most Democrats voted \"present.\"", "That measure came to the floor as Republican House leaders sought to put Democrats on the record regarding their position on ICE.", "Sinema in July also told azfamily.com that \"abolishing ICE isn’t realistic and it doesn’t make any sense.\" While the agency removed criminal immigrants, Sinema said, \"most Americans would agree that we could use some reform.\"", "McSally said Sinema \"voted to cut ICE.\"", "McSally’s evidence are votes Sinema cast on measures seeking to take funds away from ICE to give them to FEMA and the Coast Guard.", "But McSally’s claim ignores Sinema’s broader voting record. Sinema has also voted to increase funds for ICE and cast a vote supporting ICE and denouncing calls to eliminate the agency.", "McSally’s claim is partially accurate but leaves out important details. We rate it Half True.", "Twitter, @FoxNews tweet, Sept. 16, 2018", "Email exchange, U.S. Rep. Martha McSally campaign,", "Email exchange, U.S. Rep. Kyrsten Sinema campaign,", "Congressional Research Service, Comparing DHS Component Funding, FY2018: In Brief, April 17, 2018", "clerk.house.gov, FINAL VOTE RESULTS FOR ROLL CALL 462, FINAL VOTE RESULTS FOR ROLL CALL 527", "Congress.gov, H.Amdt.312 to H.R.3354, H.R.1625 - Consolidated Appropriations Act, 2018, H.R.244 - Consolidated Appropriations Act, 2017, H.R.2029 - Consolidated Appropriations Act, 2016, H.R.83 - Consolidated and Further Continuing Appropriations Act, 2015, H.R.3547 - Consolidated Appropriations Act, 2014, H.Res.990 - Supporting the officers and personnel who carry out the important mission of the United States Immigration and Customs Enforcement.", "azfamily.com, VIDEO: Rep. Kyrsten Sinema speaks about immigration, taxes, July 18, 2018", "C-SPAN, House Session, Part 2, Sept. 6, 2017", "U.S. Rep. Sheila Jackson Lee website, Congresswoman Sheila Jackson Lee Offers Motion to Recommit to Protect Dreamers and Stop Funding For the Border Wall, Sept. 14, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]