["By Lori Robertson", "Posted on March 26, 2020 | Updated on April 3, 2020", "President Donald Trump and coronavirus task force coordinator Dr. Deborah Birx said the United States had done more testing for COVID-19 infections in eight days than South Korea had done in eight weeks, but that ignores the fact that South Korea has a much smaller population. On a per-capita basis, the U.S. lags behind the Asian country, and other nations.", "We also found the raw numbers show the U.S. testing totals for the eight-day period were still a bit lower, but close, to South Korea’s eight-week figures.", "In addition, Trump has repeatedly claimed that the U.S. test is “better” or “the best test,” but there is no evidence to support that.", "South Korea has been held up as a relative success story in containing the coronavirus outbreak, due in part to an extensive, and early, testing program. The daily growth in new cases dropped off considerably in early March after spiking in late February. In other words, South Korea, so far, appears to have begun flattening the curve, which is the much-talked-about goal of social distancing efforts in the United States.", "Both countries reported their first confirmed cases of COVID-19 around the same time, on Jan. 20 and 21. But South Korea ramped up its testing program sooner, and, therefore, was able to identify and isolate cases early in the pandemic. Testing a higher proportion of the population has given the country a greater capacity to control the total spread of the disease.", "Around Feb. 19, South Korea first began reporting daily spikes in confirmed cases, while the U.S. was a few weeks behind that. The curve of confirmed cases for the U.S. is still on the rise, as the Johns Hopkins University & Medicine interactive tracking map of the worldwide outbreak shows.", "As Science magazine wrote on March 17, while many countries, including several in Europe, had shown “dire trends” in rising case counts and deaths from COVID-19, “South Korea has emerged as a sign of hope and a model to emulate.” The country has received praise for its testing program, while the U.S. government has faced criticism for a slow testing rollout and a lack of sufficient numbers of test kits.", "(South Korea also has undertaken substantial efforts to isolate infected individuals and trace their contacts with others, including by publicly releasing information on those individuals’ recent movements, which has raised privacy concerns.)", "Kim Woo-Joo, an infectious disease specialist at Korea University, told Science magazine that the country’s experience with a 2015 MERS outbreak “showed that laboratory testing is essential to control an emerging infectious disease.”", "The director-general of the World Health Organization highlighted the efforts of South Korea in a statement on March 18, saying the WHO was working with other countries “to apply the lessons learned in Korea and elsewhere.”", "Dr. Scott Gottlieb, the former commissioner of the Food and Drug Administration under the Trump administration, also has pointed to South Korea as a model. On Twitter on March 12 he said the U.S. “probably lost chance to have an outcome like South Korea,” and wrote of the importance of “aggressive screening to get people diagnosed.” The U.S., Gottlieb said, was “far behind current caseloads” with too many people not being able to get tested. “So we can’t identify clusters and isolate disease.”", "As we’ve explained before, the Centers for Disease Control and Prevention had a manufacturing problem with its test kit early in February when it shipped those kits to state and local public health labs.", "In the March 24 coronavirus task force briefing, Dr. Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases, spoke about the importance of testing in helping the U.S. understand how pervasive the disease is and to contain it.", "For areas of the country that don’t yet show large numbers of cases, “they still have a window of significant degree of being able to contain,” Fauci said. “In other words, when you test, you find somebody, you isolate them, you get them out of circulation, and you do the contact tracing.”", "With a large outbreak already underway, he said, “it’s tough to do anything but mitigation.” But with more testing, “you’re going to be hearing more about how we can inform where we’re going, particularly because we have the ability to test.”", "The Trump administration has now claimed a milestone of sorts, compared with South Korea.", "In a March 24 virtual town hall that was aired on Fox News, Birx said that the U.S. by that day “will have done more tests than South Korea did in eight weeks in the last eight days.” She acknowledged, “We have to do more.”", "Trump repeated the claim later in the town hall, and both cited it again in the coronavirus task force briefing that day.", "Trump, March 24 coronavirus task force briefing: You know, one of the things that’s — that’s happened — that we’ve done, I think, a really good job on — I think that it’s something special what’s happened is I learned from Dr. Birx, a little while ago, when she said — I learned it actually this afternoon: In eight days — because we kept hearing about South Korea. And they had a very tough time at the beginning, if you remember. In eight days, we’re doing more testing than they’ve done in eight weeks. That’s a tremendous turn.", "Birx gave some specific figures. “We now have 370,000 tests that have been done. The majority of those — over 220,000 in the last eight days, which, those of you who have been tracking the South Korea numbers, put us equivalent to what they did in eight weeks that we did in eight days,” she said.", "According to figures provided by South Korea’s Centers for Disease Control and Prevention, South Korea had conducted 348,582 tests as of March 24 (including some that were pending). Beginning Jan. 31, about eight weeks earlier, testing using a diagnostic that could detect the virus within six hours had been conducted at government public health institute locations, and it was distributed to other health facilities on Feb. 7, according to the Korean CDC.", "The U.S. CDC hasn’t released up-to-date figures on testing, which can take a number of days for results, according to LabCorp, one of the commercial labs conducting testing in the United States. Data provided by the COVID Tracking Project, which is run by journalists, researchers, scientists and others, shows higher figures for the U.S. than Birx cited: 317,347 tests completed or pending in the U.S. over the eight-day period of March 17 to 24. That’s less than South Korea’s roughly eight-week figure, but it’s close.", "More important, South Korea’s population is 51.8 million; the U.S. population is 329.4 million. So, on a per-capita basis, the U.S. is still far behind.", "South Korea has tested 0.7% of its population, or about 1 test for every 149 residents over that eight-week period. The United States has tested about 0.1% of its population, or 1 test for about every 1,038 residents over the eight-day period.", "Rangarajan Sampath, the chief scientific officer of the nonprofit Foundation for Innovative New Diagnostics, told us that in order to cover a larger percentage of the population, which is what South Korea is trying to do, the U.S. would need to conduct more tests per capita. “[S]imply pointing to total number of tests run without paying attention to the denominator of total population coverage, is misleading,” he said in an email.", "To match South Korea’s testing rate, the U.S. would have needed to conduct about 2.3 million tests. The COVID Tracking Project shows a total of 433,545 tests completed or pending in the U.S. as of March 25. It’s feasible for the U.S. to match South Korea’s testing rate over several weeks, given the fact that the tracking project’s figures show about 50,000 to 70,000 tests being completed per day over the past few days.", "“The percentage of people tested in the US is much, much lower than South Korea,” Dr. Jennifer Nuzzo, a senior scholar at the Johns Hopkins Center for Health Security, told us.", "Nuzzo noted a different testing philosophy between the two countries. The U.S. is reporting nearly 70,000 confirmed cases (as of March 26), but “this is likely a large underestimate of the actual number of cases, as most of the testing done to-date is limited to patients who are sick enough to be hospitalized. Conversely, South Korea, which has only reported fewer than 10,000 cases is testing widely — not just limiting tests to hospitalized cases.”", "In the March 25 coronavirus task force briefing, Trump repeated the claim about South Korea and said: “We have tested, by far, more than anybody. We’re testing more than anybody right now. There’s nobody even close.”", "But there are other countries that have done more tests on a per-capita basis than the United States, in addition to South Korea.", "A chart compiled by Our World in Data, from official country reports, shows the U.S. lagging behind several countries on a per-capita testing basis as of March 20. And the U.S. hasn’t yet caught up to some of those countries. For instance, Australia had tested 4,473.4 people per million inhabitants as of March 20, while the latest figures for the U.S., which include five extra days, show a rate of 1,316 tests per million people, as of March 25.", "Other countries that outpace the U.S. testing per capita include the United Arab Emirates, Germany and Austria, according to figures as of no later than March 20.", "Similarly, testing data compiled by the Foundation for Innovative New Diagnostics, shows Italy had conducted 5,199 tests per million people, as of March 25; Switzerland had conducted 9,519 tests per million people, and the United Kingdom was just above the U.S. in per-capita terms, with 1,375 tests per million.", "Trump also has claimed in the past few days, without evidence, that the U.S. has “the best tests,” asserting they are “the most accurate tests,” “better” than South Korea’s and that this “makes a big difference.”", "Sampath, whose organization is testing COVID-19 tests from various manufacturers to provide independent verification for countries, told us there’s “no data that would support” the president’s claim, and “no reason to believe US tests are any better (or worse)” than those being run in other countries.", "We asked the White House for support for the president’s claim, and we haven’t received a response.", "Sampath told us in a phone interview that “98% of all of the tests being done are molecular tests,” and those are “comparable” no matter where they are run.", "He said at some point there will be data available to make comparative evaluations, but right now it “doesn’t exist.”", "Update, April 3: Trump has repeatedly said that the U.S. has done more tests “than any other country anywhere in the world,” and he went even further on April 2, making the false claim that this was the case “both in terms of the raw number and also on a per capita basis the most.” Despite having conducted more than 1 million tests, the U.S. is still behind Germany, Italy and South Korea on a per-capita basis.", "A chart by Our World in Data shows those three countries had conducted significantly more tests per-million people than the United States as of April 1. The chart notes: “There are substantial differences across countries in terms of the units, whether or not all labs are included, the extent to which negative and pending tests are included and other aspects.”", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]