["Last week, India Today broadcast a series of sting operations investigating the violence in Delhi’s Jawaharlal Nehru University (JNU) campus that left 36 injured on January 5. The broadcast was anchored by journalist Rahul Kanwal.", "Since January 12, a 20-second clip of Kanwal began circulating on social media with a claim that he said chanting ‘Vande Mataram’ is anti-national. BJP’s Mumbai spokesperson Suresh Nakhua posted the video with the message, “So, @rahulkanwal of @IndiaToday says ” Chanting Vande Mataram is anti national”. Now let’s see how Rahul spins this one.” At the time of writing this article, Nakhua’s tweet garnered over 6,500 retweets.", "So, @rahulkanwal of @IndiaToday says ” Chanting Vande Mataram is anti national”.", "Now let’s see how Rahul spins this one.", "Video via @gujjutweeter pic.twitter.com/eN6cewHVC4", "— Suresh Nakhua 🇮🇳 ( सुरेश नाखुआ ) (@SureshNakhua) January 12, 2020", "Interestingly, Nakhua had tweeted the same clip in February 2016 with a similar narrative. At the time, the tweet had gathered close to 120 retweets.", "National media in-charge of J&K BJP youth wing BJYM Rohit Chahal posted the same video with the message, “According to @rahulkanwal singing Vande Mataram is Anti National activity ! #RahulKanwalExposed”.", "According to @rahulkanwal singing Vande Mataram is Anti National activity ! #RahulKanwalExposed pic.twitter.com/DsCte7mowB", "— ROHIT CHAHAL (@rohit_chahal) January 13, 2020", "Saurabh Khamar, a member with BJP Andhra’s social media & IT cell, who flaunts a profile picture with PM Modi, tweeted a video of crowding chanting Vande Mataram and took a jibe at Kanwal. “Can we file anti nationals charge sheets on this 30k People @rahulkanwal ???”, reads his tweet.", "Rahul Kanwal responded to the viral claim via a tweet. “Here’s what happened. @indiatoday SIT exposed lawyers who accepted on camera they bashed up Kanhaiya in court while cops watched. Lawyers attacking Kanhaiya chanted Vande Mataram. To attack someone and chant Vande Mataram is anti-national. Said it then, will say it now. Jai Hind,” the journalist wrote.", "Here’s what happened. @indiatoday SIT exposed lawyers who accepted on camera they bashed up Kanhaiya in court while cops watched. Lawyers attacking Kanhaiya chanted Vande Mataram. To attack someone and chant Vande Mataram is anti-national. Said it then, will say it now. Jai Hind. pic.twitter.com/JybiiEXXZO", "— Rahul Kanwal (@rahulkanwal) January 13, 2020", "With a relevant keyword search on India Today’s YouTube channel, Alt News found that the viral video is part of a February 17, 2016 broadcast. “Groups of unruly lawyers yet again displayed hooliganism outside the Patiala Court, attacking Kanhaiya Kumar as the JNUSU president was brought in,” reads its description.", "Kanwal was moderating a discussion where advocate Rajeev Yadav was one of the guests. In 2016, when the top court was hearing the JNU sedition row, Yadav shouted ‘Vande Mataram’ inside the courtroom and was chided by the bench. The lawyer was escorted out by security officials and had to submit an unconditional apology before the Supreme Court for his actions.", "During the India Today debate, Yadav defended his sloganeering. He believed that the lawyers defending former JNUSU president Kanhaiya Kumar were representing a “traitor”, to which Kanwal responded, “But for this reason, there are judges. A judge will decide which issue is right, which lawyer is wrong. You are arguing that in the court. You argue with Prashant Bhushan in the court. Why are you raising slogans like this? Why are you are doing the anti-national activity? Why are you doing the anti-legal activity? I allege that what you did is anti-national. The slogans of Vande Mataram, you raised, is anti-national activity.”", "Kanwal’s reply to Yadav’s argument that chanting Vande Mataram is not anti-national was, “to raise [slogans] inside the court, is to spoil the dignity of the Supreme Court. It’s totally wrong. It hurts the dignity of this country. Your act is wrong.”", "A 20-second bit from the complete discussion was clipped to take out the context and portray Rahul Kanwal as against the slogan of ‘Vande Mataram’ when in fact he was suggesting that sloganeering inside a courtroom is unacceptable.", "Swarajya columnist Shefali Vaidya and former Shiv Sena member Ramesh Solanki also tweeted the clip with the false narrative. Their tweets have garnered a combined retweet count of nearly 3,600.", "IAS officer Sanjay Dixit also quote-tweeted the same video and opined, “Rahul Uvach: @rahulkanwal loftily declares Vande Mataram to be anti-National. In Khilafat 1.0, even Muslim leadership regarded it as national, but 100 years down the line, the ‘sickular’ media finds it anti-National. Khilafat 2.0 is being led by such disgusting specimens!”.", "Many other people on Facebook and Twitter have shared the clipped video.", "It may be reiterated that journalist Rahul Kanwal did not say that chanting ‘Vande Mataram’ is anti-national but sloganeering in the court of law is anti-national and anti-legal.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]