["About this rating", "Hillary Clinton said that many millennial voters who found appeal in Bernie Sanders' campaign are living in their parents' basements due to their being unable to find adequate jobs in the current market.", "Clinton did not call millennial Sanders supporters \"basement dwellers.\"", "On 30 September 2016, various web sites published a leaked audio  recording from a February 2016 fundraising event in Virginia at which Hillary Clinton made brief remarks before taking questions from the audience.  One of those audience questions\nreferenced the \"cynicism\" of some voters, to which Clinton responded by \"examining the forces that leave many young voters disaffected\" and analyzing why many of them supported the campaign of Bernie Sanders, a candidate whom Clinton felt offered a \"false promise\" to voters with concerns for their futures.", "The audio clip was often shared under such misleading headlines claiming that Clinton had called millennial voters \"basement dwellers.\" The Week,  for instance, used the title \"Hillary Clinton Calls Bernie Sanders Supporters Uninformed Basement Dwellers in Hacked Audio Clip.\"", "Although outlets such as The Week may have been attempting to paraphrase Clinton's comments, the Democratic presidential nominee never actually used the phrase \"basement dwellers.\" Regardless, a rumor began circulating that Clinton had used that exact phrase, and soon enough the hashtag #basementdwellers (referencing something she didn't say) was trending alongside #basketofdeplorables (referencing something she did say).", "However, Clinton never used the phrase \"basement dwellers.\"  Rather, she expressed sympathy with young college-educated voters who had little choice but to remain at home due to being unable to find self-supporting jobs in the current market and had grown cynical of a system they felt had failed them:", "Some are new to politics completely. They’re children of the Great Recession. And they are living in their parents’ basement. They feel they got their education and the jobs that are available to them are not at all what they envisioned for themselves. And they don’t see much of a future. I met with a group of young black millennials today and you know one of the young women said, “You know, none of us feel that we have the job that we should have gotten out of college. And we don’t believe the job market is going to give us much of a chance.” So that is a mindset that is really affecting their politics. And so if you’re feeling like you’re consigned to, you know, being a barista, or you know, some other job that doesn’t pay a lot, and doesn’t have some other ladder of opportunity attached to it, then the idea that maybe, just maybe, you could be part of a political revolution is pretty appealing. So I think we should all be really understanding of that and should try to do the best we can not to be, you know, a wet blanket on idealism. We want people to be idealistic. We want them to set big goals. But to take what we can achieve now and try to present them as bigger goals.", "Lima, Christiano.   \"Clinton gives her take on Sanders supporters in leaked fundraising recording\"\r\n    Politico.   30 September 2016.", "Fang, Lee.   \"Hacked Audio Reveals Hillary Clinton Sees Herself Occupying 'Center-Left to Center-Right'\"\r\n    The Intercept.   30 September 2016.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]