["By Angelo Fichera", "Posted on January 22, 2021", "Social media posts point out that the web address antifa.com now redirects to the White House website. That’s true, but in need of some important context: Whoever owns a domain name can instruct it to reroute to whichever website they’d like.", "After President Joe Biden was sworn into office, social media users and websites drew attention to the curious fact that the URL “antifa.com” is set up to automatically take users to the official White House website.", "That’s true, but many of the posts spreading that information stand to mislead users because they omit an important bit of context: Anyone who owns a domain name can create such a redirect. In other words, the owner of antifa.com can set up the redirect to whitehouse.gov without the White House’s permission.", "“Someone just told me to go to antifa.com because it goes to WH,” read a popular Jan. 20 tweet from a conservative commentator. “This is so weird.”", "The website 100percentfedup.com raised eyebrows, too. Its headline asked, “Why Does Antifa Web Address Take Users To White House Website?”", "Antifa is an umbrella term used to describe anti-fascist activists and groups.", "The website claim isn’t exactly new: During the 2020 election, the same URL was made to redirect to Biden’s official campaign website — JoeBiden.com, as PolitiFact explained in early September.", "A Biden campaign official said at the time that “whoever owns antifa.com is redirecting it to our website as a troll.”", "Sebastian Angel, a University of Pennsylvania assistant professor of computer and information science, likened domains to phone books, in which domain names are mapped to machines hosting particular website IP — or internet protocol — addresses.", "“When someone buys a domain name, they buy the right to an entry in the phone book,” he told us in an email. And “the owner of a domain name is free to write whatever IP address they want in their entry.”", "Angel said, in this case, the White House wouldn’t have to authorize the redirect — or be a part of that decision in any way. Whoever owns “antifa.com” can do this “unilaterally without any help or coordination,” he said.", "Who, exactly, owns antifa.com isn’t clear. A domain registration record on WhoIs.com shows the domain is registered through a third-party service.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "Angel, Sebastian. Assistant professor of computer and information science, University of Pennsylvania. Email to FactCheck.org. 22 Jan 2021.", "“Antifa.com.” Whois.com. Accessed 21 Jan 2021.", "Flaherty, Rob (@Rob_Flaherty). “So whoever owns antifa.com is redirecting it to our website as a troll. What we do know was that the website was registered with a Russian registrar for a while. Odd! The VP very obviously has/wants nothing to do with fringe groups. Wish Trump could say the same.” Twitter. 31 Aug 2020.", "Putterman, Samantha. “Antifa.com redirects to Biden’s campaign website, but anyone can buy, redirect a domain.” 1 Sep 2020.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]