["अरे! ये क्या? राहुल जी, भाषण में ही सही, समय पर किसान क़र्ज़ माफ़ी न करने पर आखिरकार आपने मध्यप्रदेश के मुख्यमंत्री बदल ही दिए! क्या बात है? आप जैसे महान व्यक्ति ही ऐसे बड़े काम चुटकी में कर सकते है। (Arre what is this Rahul ji, if only in speeches, eventually you replaced the MP CM for not waiving farmers’ loans on time? Only a great person like you can accomplish such a huge task in a jiffy- translated).", "These words have been tweeted by BJP leader and former MP CM Chowkidar Shivraj Singh Chouhan, along with a video clip of a speech of Congress president Rahul Gandhi. The video clip is 13 seconds long.", "अरे! ये क्या? राहुल जी, भाषण में ही सही, समय पर किसान क़र्ज़ माफ़ी न करने पर आखिरकार आपने मध्यप्रदेश के मुख्यमंत्री बदल ही दिए! क्या बात है?", "आप जैसे महान व्यक्ति ही ऐसे बड़े काम चुटकी में कर सकते है। pic.twitter.com/ljKHbXHzaO", "— Chowkidar Shivraj Singh Chouhan (@ChouhanShivraj) May 16, 2019", "In the clip, Rahul Gandhi is heard saying, “…Chief Minister of Madhya Pradesh Bhupesh Baghel ji, Chief Minister of Chhattisgarh Hukum Singh Karada ji…”, mockingly suggesting that the Congress president has said that the CM of MP is Bhupesh Baghel (and not Kamal Nath). Chouhan’s tweet has been retweeted by union minister Chowkidar Smriti Irani.", "Expectedly, the video clip has been shared in droves by social media users on Facebook, who have posted it on their timelines.", "The video of Rahul Gandhi, tweeted by Chouhan and retweeted by Irani has been clipped. Gandhi was addressing a rally in Neemuch, Madhya Pradesh on May 14. The video of the same is posted below, uploaded on YouTube by the Congress party on its official account.", "As can be seen in the above video, at 00:07 minutes, Rahul Gandhi begins his speech by saying, “Kamal Nath ji, Madhya Pradesh ke Chief Minister, Bhupesh Baghel ji, Chhattisgarh ke Chief Minister, Hukum Singh Karada ji, P C Sharma ji…”", "Rahul Gandhi had referred to Kamal Nath, followed by his designation as the Chief Minister of Madhya Pradesh. He did the same with Bhupesh Baghel who he introduced first by name and then his designation as the CM of Chhattisgarh. The part where he mentions Kamal Nath was left out of the video clip, so as to suggest that Gandhi has referred to Bhupesh Baghel as the CM of MP.", "The India Today group misreported the event, stating that Rahul Gandhi had bungled with the names of the chief ministers of Congress-ruled states. An article published on the website was titled, ‘Rahul Gandhi mixes up names of CMs of Congress-ruled states, Twitter has field day’. The channel even tweeted about it.", "News Tak, the digital news channel of the India Today group, had reported on May 15 that Rahul Gandhi had committed a gaffe at his rally in Neemuch, MP. The video report was published with the title, “Blunder by Rahul Gandhi in his Neemuch speech” (translated). The report was laced with text which said, ‘Bhupesh Baghel called CM of MP’ and ‘Hukum Singh Karada called CM of Chhattisgarh’.", "The video of the News Tak report also began exactly at the point where the name of Kamal Nath was omitted, so as to make it seem as if Rahul Gandhi had committed a faux pas. This was however not the case, as pointed out above.", "8 constituencies of Madhya Pradesh will vote in the final phase of the Lok Sabha election on May 19. As expected, ahead of polling, misinformation related to the state has reared its head.", "Update: The article has been updated to include misreporting by India Today", "Donate Now", "Arjun Sidharth is a writer with Alt News. He has previously worked in the television news industry, where he managed news bulletins and breaking news scenarios, apart from scripting numerous prime time television stories. He has also been actively involved with various freelance projects. Sidharth has studied economics, political science, international relations and journalism. He has a keen interest in books, movies, music, sports, politics, foreign policy, history and economics. His hobbies include reading, watching movies and indoor gaming.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]