["News agency Indo-Asian News Service (IANS) published a report titled, “Imran Khan reads chart upside down, claims Covid curve flattening.” The report claimed that Pakistan’s Prime Minister Imran Khan made a gaffe and claimed that the coronavirus curve in the country was flattening while in reality, he read the chart upside down.", "The IANS article was carried by news outlets like Newsd and Outlook. The latter has taken down the report. Its archive can be accessed here. The article published by Newsd mentions Aarti Singh Tikoo’s name in the byline. She is the Foreign and Strategic Affairs Editor at IANS. The report claimed that Khan while holding a chart of the coronavirus cases in the country said, “See, it’s right there. The cases seem to be tapering to a flat line.”", "It further stated, “However, a political aide Saleem Kheshgi, noticing that the Prime Minister had goofed up, quickly whispered something into his ear. Khan’s mood changed quickly, Pakistan Today reported.” It may be noted that the report cites Pakistan Today.", "Alt News found that the report cited by the news agency is a satirical piece. It was published in the satirical section of Pakistani news website Pakistan Today. The satirical section is called ‘The Dependent’. It appears that the name – The Dependent – is inspired by British news outlet The Independent.", "The website clearly mentions the word ‘satire’ in bold letters in the featured image published along with the article on Khan.", "Leaving no room for doubt, the author’s biography at the bottom of the article also has a disclaimer which reads, “The above piece is a work of satire and does not present itself as the truth.”", "Twitter handle Not The Dependent tweeted a screenshot of the IANS article and ridiculed the news agency for not being able to differentiate between a “satire and actual news reports.”", "Learn to differentiate between satire and actual news reports @ians_india", "And hands off our PM. He may be a petty, facile, undemocratically imposed lackey without principles, but he’s OUR petty, facile, undemocratically imposed lackey without principles! pic.twitter.com/mrTIeS4SBl", "— Not The Dependent (@DependentNot) May 7, 2020", "Journalist Aarti Singh Tikoo took to Twitter and apologised for her error by saying that she mistook “satire for serious news.”", "I mistook satire for serious news. The hate-AartiTikoo brigade in its frenzy is projecting as if my mistake is the biggest ever crime. Yes, stupid of me; I apologise for my error. But imagine the journos who deliberately peddle Pakistani propaganda & bigotry against India daily.", "— Aarti Tikoo Singh (@AartiTikoo) May 8, 2020", "A piece of satirical news about Pakistan’s PM Imran Khan reading the coronavirus chart upside down and declaring that the curve has flattened in his country was published as actual news by news agency IANS and subsequently carried by media outlets like Newsd and Outlook. Last year in December, IANS had fallen for satirical news of “crazy sex run by Irish sheep after drinking viagra”.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A claim that Nobel laureate Amartya Sen has passed away went viral on social media…", "Within hours of Prime Minister of Canada Justin Trudeau alleging that “agents of the government…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…", "On the front page of its national edition dated August 22, Hindi daily Dainik Jagran…", "In his reply to the no-confidence motion brought by the Opposition in the Lok Sabha,…"]