["About this rating", "A picture supposedly showing Republican U.S. Sen. Lindsey Graham with Geert Wilders, a far-right politician from the Netherlands, was widely shared on social media in March 2021 along with a caption stating that the photograph had \"just\" been taken:", "This is a genuine photograph of Graham and Wilders. However, it was not \"just\" taken.", "Wilders, who has been accused of spreading racist and Islamophobic views (he once compared the Quran to Adolf Hitler's \"Mein Kampf\"), posted the photograph to Twitter in September 2019 along, with a caption explaining that it was taken at the Ambrosetti Forum, an annual international economic conference in Italy. Wilders quickly deleted it, but Washington Post reporter John Hudson managed to capture a screenshot of the original post:", "Kevin Bishop, a spokesperson for Graham, confirmed at the time that the photograph was real. Bishop said that Graham took pictures with several people at the forum, and that he did not know why Wilders deleted the photograph.", "The Washington Post reported at the time:", "Kevin Bishop, a spokesman for Graham, said Sunday that the senator took pictures with many of the attendees at the forum and that Graham has no idea why Wilders deleted the tweet with the picture of them.", "“Mr. Wilder took a photo with Sen. Graham as did many others at the conference,” Bishop said, adding that he has “no idea why Mr. Wilder removed the photo from Twitter. You may want to ask him.”", "This is a genuine photograph of Graham and Wilders. However, it was taken in 2019, not 2021. It should also be noted that being photographed with someone does not automatically mean that you share that person's views.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]