["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "One Facebook user wrote that they were \"in tears\" after seeing a post of a groom kissing the bride as his groomsmen lined up behind him in what looks like a single-file group hug.", "\"He’s paralyzed and his friends held him up to kiss his beautiful bride,\" the Sept. 22 post says. \"Much respect! This is true friendship. Don’t scroll without sharing.\"", "This post, which has indeed been shared more than 56,000 times, was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Other Facebook users were also moved to tears, but more in the spirit of the crying-while-laughing emoji.", "\"This is a fraternity thing,\" one user wrote in the comments, \"they ain’t holding him up.\"", "This claim has been around since at least December 2016, when the website Diply posted a story titled: \"People are so wrong about this viral photo showing ‘paralyzed man’ held up at wedding.\"", "It says the bride posted the photo on Instagram that year. The account credited with the photo is now private, but Diply published two others that show the bride and groom standing, unassisted.", "As AFP Fact Check notes, someone commenting on a similar Facebook post in 2016 wrote that the groom \"belongs to the fraternity Omega Psi Phi and this is a traditional marriage pose that symbolizes how your brothers will always be there to support you.\"", "We didn’t find any other examples of wedding photos like the one featured in the Facebook post, but we found several photos of the pose in different contexts searching for Omega Psi Phi Fraternity and line brothers. This Omega Psi Phi Pinterest page has multiple such images.", "We rate this Facebook post False.", "Facebook post, Sept. 22, 2019", "Diply, People are so wrong about this viral photo showing ‘paralyzed man’ held up at wedding, Dec. 12, 2016", "AFP Fact Check, Paralysed groom held by his friends to kiss the bride?, Oct. 29, 2019", "Watch the Yard, The brothers of Omega Psi Phi at Shaw University just crossed a new line, visited Jan. 22, 2020", "Onnidan Fan Forum, Lesbian ‘bruh-therhood’ steals traditions from men of Omega Psi Phi, May 23, 2016", "FWI from a PWI, PWI feels: Omega Psi Phi Fraternity, Inc., Nov. 13, 2016", "Pinterest page, visited Jan. 22, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]