["About this rating", "Some forms of Ecstasy are brightly colored and look like candy.", "These forms of Ecstasy are not \"new,\" they're not intended to appeal to children, and they're not likely to end up in kids' Halloween trick-or-treat bags.", "In September 2015, many Facebook users  shared photographs along with warnings that the images depicted a \"new shapes of Ecstasy\" that \"can kill kids through overdoses,\" and therefore parents should be vigilant to ensure no such items turned up in their children's trick-or-treat bags on Halloween:", "If your kids get these for Halloween candy, they ARE NOT CANDY!!! They are the new shapes of \"Ecstasy\" and can kill kids through overdoses!!! So, check your kid's candy and \"When in doubt, Throw it out!!!\" Be safe and always keep the shiny side up!!!", "Many of the readers commenting on the photographs observed that the substance depicted appeared to be MDMA (colloquially called \"ecstasy\", \"X\", \"E\", or \"Molly\" for its more potent form), a popular party drug recognized partly by its colorful and candy-like appearance:", "The \"ecstasy in Halloween candy\" warning appeared to be a variant of age-old rumors about poison (and other dangerous substances) being randomly handed out to children in trick-or-treat loot, a persistent but largely baseless fear that's dogged Halloween celebrations for decades. Despite long-held beliefs that Halloween candy tampering is both commonplace and regularly results in harm to children, reports of actual attempts to do so are virtually non-existent (or based on half-truths).", "Excessive concern over colorful drugs (such as strawberry meth) either making their way into the hands of kids or being manufactured to appeal to them isn't a new concern either: tales circulated in the 1970s claiming LSD merchants were targeting children by peddling their wares via attractive temporary tattoos. By sharp contrast, dire warnings about drugs designed with a candy-like appearance intended to \"hook\" kids have never come true — which stands to reason, as schoolchildren aren't the most promising market for illicit recreational drugs. (LSD and MDMA also are largely not addictive substances.)", "As is often the case with such rumors, the public seemed to conflate the existence of a drug that looked child-friendly (such as blue star tattoos, pink meth, or colorful MDMA tablets) with deliberate manufacture of those substances with an intent to attract children. Prior to its September 2015 circulation on social media as a cautionary tale, the photograph of Ecstasy used here appeared primarily on blogs discussing (presumably adult) recreational drug use.", "An important distinction to bear in mind is that the MDMA depicted is not a new form designed to appeal to children: MDMA tablets have historically been produced with a variety of shapes and colors befitting its status as a \"party drug.\" Another is that recreational drugs (including MDMA) are generally expensive. The small collection of pills depicted here represents a street value of hundreds of dollars, so the notion that a neighbor would be distributing them to trick-or-treaters for no ostensible reason is rather implausible (especially given how many drug users tend to carefully guard their stashes and often won't readily share them with friends, much less randomly-selected small children). So while the image of Ecstasy circulating on Facebook might at first appear to represent a true threat to kids on Halloween, there's little reason to suspect Molly will be lurking in any plastic pumpkins this year.", "Another related rumor warned parents of the potential for deadly, drug-laced, oversized Gummy bears being handed out to unknowing children on Halloween:", "This warning didn't even specify the name or type of drug that these Gummi bears supposedly harbored, but we're pretty sure drugs that cause \"brain death and/or death\" have few aficionados — and even fewer repeat users.", "Nonetheless, on 19 October 2015, police in Jackson, Mississippi, shared the popular \"warning\" about MDMA in Halloween candy. That claim was subsequently aggregated to blogs and news web sites as an \"urgent Halloween warning\" from police (not as repetition of a dubious, ancient urban legend):", "Police warn if you get these in your trick-or-treat bag, they're not candy. https://t.co/knBDVIOc48 pic.twitter.com/r3ygkWckjB", "— AJC (@ajc) October 21, 2015", "In May 2017, a similar warning about \"pink teddy bear\" ecstasy tablets began spreading on Facebook:", "PLEASE SHOW THIS TO YOUR KIDS AND WARN THEM NOT TO TAKE THIS FROM THERE FRIENDS BECAUSE IT IS NOT CANDY!!! IT IS ECSTASY!!! PLEASE FORWARD TO EVERYONE YOU KNOW!!!", "Once again, images of MDMA tablets were taken out of their original context and presented as a tactic used by drug dealers to entice children. The image of the tablets in a bag first appeared on MDMA-related sites in 2016 (captioned \"Purple Bears w/ 180mg MDMA\") aimed not at children, but at users of the substance. In March 2017, the British Sun tabloid  utilized the same \"stock image\" in a news story about four young teenagers hospitalized after purportedly ingesting teddy bear-shaped MDMA tablets:", "FOUR schoolgirls, 13, were taken to hospital after “taking teddy bear ecstasy pills” in Manchester.", "The youngsters swallowed the pink, “teddy bear” pills near the Civic Centre in Wythenshawe, and were admitted to hospital [in March 2017], police have said.", "Sky News and the BBC also covered the incident, and all reports indicated the teenagers willingly ingested the \"teddy bear ecstasy\" as a recreational drug (not because the unknowingly believed it to be candy).", "Gupwell, Katie.   \"'Pink Teddy Bear' Ecstasy Warning After Man Was Taken Into Intensive Care.\"\r\n    Wales Online.   21 December 2016.", "Lake, Emma.   \"CHILD PILL ALERT: Four Schoolgirls Aged 13 Taken to Hospital After ‘Taking Teddy Bear Ecstasy Pills’.\"\r\n    The Sun.   7 March 2017.", "The Sun.   \"Four 13-Year-Old Girls Treated in Manchester After Taking 'Ecstasy' Pills.\"\r\n    8 May 2017.", "BBC News.   \"'Teddy Bear Ecstasy' Hospitalises Wythenshawe Teenagers.\"\r\n    7 March 2017.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]