["The photos were published here on Facebook on March 7, 2020.", "Below is a screenshot of the misleading post:", "The post’s Hindi-language caption translates to English as: “Ramdev is admitted in AIIMS hospital, doctors informed that he had an overdose of cow urine to ward off Coronavirus.”", "AIIMS is an acronym for the All India Institute of Medical Sciences hospital in Delhi.", "On several occasions, Ramdev has promoted the use of cow urine for its health benefits. According to this March 14, 2020 India TV report, Ramdev says cow urine is “effective in [treating] blood pressure, constipation and even cancer”.", "Since the novel coronavirus outbreak, these assertions have gained increased traction. On March 14, 2020, for instance, dozens of Hindu activists held a “cow urine party” in the Indian capital to protect themselves from the new coronavirus. Here is an AFP report on the event.", "The photos of Ramdev were also shared alongside similar claims on Facebook here, here and here and on Twitter here and here.", "However, the claims are false.", "A reverse image search found the photos have circulated online since at least June 2011 in local media reports on a nine-day hunger strike that Ramdev undertook to protest corruption.", "The first photo was published in this report published on June 12, 2011 by India Today, an English-language Indian news magazine. The report is headlined “Baba Ramdev ends fast against black money”.", "The photo's caption reads: “Baba Ramdev just after breaking his fast in a Dehradun hospital on Sunday, June 12, 2011”.", "The second photo was found in this report by the Indian newspaper The Hindu Business Line, titled “Ramdev’s condition stable, to be discharged tomorrow”. The article was published on June 13, 2011.", "The report reads, in part: “The condition of yoga guru Ramdev is stable and he will be discharged tomorrow provided all his parameters record improvement, doctors attending on him said today.", "“Ramdev had given up his nine-day fast yesterday after being persuaded by Sri Sri Ravishankar and other spiritual leaders. He had been on a hunger strike since June 4 demanding a tougher anti-corruption law and seeking a return of black money stashed away abroad.”", "Below is a comparison the photos in the misleading Facebook post (L) and the photos published by the India Today and The Hindu (R):", "Additionally, Tijarawala SK, Ramdev’s spokesperson, took to Twitter on March 5, 2020 to deny the false claims, saying Ramdev is “completely healthy”.", "The tweet translates to English as: “There is no truth in this, Ramdev is completely healthy. People have heard him speaking on various news channels in the past couple of days talking about coronavirus. Today he is in Bangalore.”", "The novel coronavirus was first detected in the Chinese city of Wuhan in late December 2019 and has since spread exponentially worldwide. As of March 18, 2020, the viral disease has killed almost 8,000 people and infected close to 200,000, according to this AFP report.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]