["“A 50-year-old man is playing basketball in the female teen league, because he identifies as a young teenager. Mental issues? Prove me wrong,” says text in a March 11, 2021 Facebook post above a photo of a tall transgender woman in a basketball uniform sitting in a room alongside her teammates.", "The claim appears on Facebook, Twitter, and Gab in English, while similar posts also appear in Portuguese and Polish.", "The claim comes as the debate on transgender athletes in women’s sports intensifies in the US, with Mississippi’s governor signing a bill on March 11, 2021 barring transgender women and girls from competing in women’s athletics, a year after Idaho did so.", "Around two dozen other states have considered restrictions on transgender athletes.", "Although the photo in the posts is real, the social media posts falsely claim the person in the foreground identifies as a “young teenager” and states that she is currently playing.", "An online search for “Mission Saints,” the team name visible on the women’s jerseys, shows that the photo pictures Gabrielle Ludwig, a transgender woman who gained national attention when she joined the Mission College’s women’s basketball team, in California, in 2012.", "Ludwig, who is six feet, six inches tall and played while in her 50s, moved from player to assistant coach for a year following the 2013- 2014 season, Mission Saints Head Coach Corey Cafferata told AFP by phone. Ludwig’s biography on the Mission Saints webpage confirms this.", "“She hasn’t been an assistant coach for seven years. She played for me eight years ago,” he said, citing age as the main reason for Ludwig’s departure from the team, before she moved out of the area.", "“No, no that’s not true,” he said of claims that Ludwig identified as a young teenager. “Gabbi never said, ‘I’m an 18-year-old kid’, never. She was a 52-year-old woman that had a full time job, that had a partner at home, and three kids.”", "Ludwig was born in Germany and moved to the US as a child, played basketball as a male in her youth, and served in the US Navy during Operation Desert Storm, all before joining the Mission Saints.", "“They can’t say that,” Cafferata said of claims that Ludwig was playing in a teen league.", "“This is a community college, it’s a college league,” he said, adding that most other players were between 18 and 20 years old.", "Cafferata said that she did not particularly stand out athletically compared to the other women: “I would say they were better than Gabbi, because they were younger, they were in better shape.”", "Referring to paperwork affirming her female gender, Cafferata said, “When Gabby came to me, she was within the rules.”", "“This story is so old,” Cafferata said. “There have been other transgendered people after her who played here, Gabbi was just the first one.”", "Ludwig did not respond to AFP Fact Check’s requests for comment.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]