["“U.S. Postal Worker Caught at Canadian Border With Stolen Ballots In Car Trunk,” reads the November 5, 2020 tweet, which has also been shared on Facebook and Instagram.", "If readers clicked on the story link in the tweet they would have found accurate information, but the headline led many on social media to believe the case was evidence of fraud, as can be seen in the comments.", "There is no indication that this person “stole” the ballots with the purpose of interfering with the election.", "According to allegations in a Department of Justice statement, 813 pieces of mail, including three absentee ballots, were found on November 3 in postal worker Brandon Wilson’s vehicle at the Peace Bridge border crossing between the Canadian province of Ontario and the US state of New York as part of a routine search by the border agents.", "Department of Justice spokeswoman in Buffalo, Barbara Burns, said the ballots had been sent from the Erie County, New York board of elections.", "“The ballots were not filled out,” she confirmed.", "Wilson told investigators that “he had intended to deliver the mail and had forgotten to return the mail pieces to the post office,” according to the justice department statement.", "He was charged with “delay or destruction of mail,” which carries a maximum penalty of five years in prison and a $250,000 fine.", "AFP has debunked several claims about purported fraud in the 2020 US election, where voters turned in unprecedented numbers to postal ballots which were considered safer than voting in person during the pandemic.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]