["About this rating", "In July 2019, convicted sex offender and hedge-fund manager Jeffrey Epstein was arrested on charges related to the sex trafficking of minors. In addition to the severity of the alleged crimes, Epstein’s arrest made headlines due to his connections to well-known public figures and politicians, including President Donald Trump and former President Bill Clinton.", "The news of Epstein’s arrest sent political partisans into overdrive as they attempted to show that politicians on their side were less involved with Epstein than politicians on the other side. On 15 July 2019, the Daily World Update website waded into this contretemps by publishing an article positing that a judge in the case had set Epstein free on probation and without bail after meeting with Bill and Hillary Clinton:", "After Clintons Meet With Judge, Epstein Gets Probation", "If you’ve been following the news on the case of Jeffrey Epstein, you know the sordid details that the supposed hedge-fund manager is accused of: counts of providing underage women as sexual slaves to scores of famous men, including Donald Trump, Dick Cheney, and entertainer Phil Collins. Some people say Bill Clinton was also on that list. Well, it looks like those some people may have been some kind of balls-on right.", "Adjudicator Judge Hammond Dixcheeze was set to deliberate on Epstein’s possible bail amount this Monday, when several witnesses saw former President Bill Clinton enter his chambers for a private chat. One hour later, Clinton exited, and the judge announced that the accused would not require any bail payment and would be simply set free on probation. Sound suspicious?", "None of this was true, of course: Epstein has not been set free without bail or on probation, nor has any judge currently dealing with his case met with the Clintons. The story was a complete fabrication from Daily World Update, a site that is part of the America's Last Line of Defense (LLOD) network of websites and social media accounts infamous for generating politically inflammatory misinformation under the guise of proffering \"satire.\"", "Gunnington, Fallis.   \"After Clintons Meet with Judge, Epstein Gets Probation.\"\r\nDaily World Update.   15 July 2019.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]