["One complaint about Congress is that its members make rules that apply to everyone but themselves.", "That complaint, mostly untrue, is being used again in the campaign against Obamacare. For example, Fox News anchorman Bill Hemmer announced on Aug. 8 that President Obama \"personally intervened to make sure that members of Congress and their staffers will not have to live with Obamacare.\"", "The Wall Street Journal opined on Aug. 5 that the politicians had moved \"to create a special exemption for themselves from the Obamacare health coverage that everybody else is mandated to buy.\"", "Yet when U.S. Rep. James Langevin, a Democrat representing Rhode Island’s Second Congressional District, was interviewed Aug. 12, 2013, by WPRO's Gene Valicenti, Langevin said flatly that he's now going to have to buy his health insurance from the \"exchanges\" that serve as online marketplaces for health care policies.", "\"Obamacare, as you mentioned, is going to be in effect very soon. We've seen some very positive effects,\" he said, citing the elimination of lifetime caps and the ban on insurance companies denying coverage because of a preexisting condition. \"And people will very soon be choosing their health care through the health insurance exchanges, including members of Congress.\"", "\"I’ll be choosing my health care plan from the new exchange that Rhode Island is setting up,\" Langevin said. (Rhode Island’s exchange, HealthSource RI, starts enrollment Oct. 1 for plans that take effect in 2014.)", "So who is correct here? We decided to check Langevin's statement that members of Congress will have to buy from an exchange, sometimes referred to as a health insurance marketplace.", "Here's the short answer: members of Congress are treated differently under the law, but not in the way critics of Obamacare say. Here’s why.", "Under Obamacare, people must either get health insurance coverage or pay a fine, beginning Jan. 1, 2014.", "Generally, workers and their dependents who are covered by an employer's health insurance are all set. More than half the population is already covered that way. (Beginning in 2015, companies employing 50 or more must offer coverage or pay a penalty.)", "The exchanges -- set up by individual states or the federal government (if a state doesn't want to operate one) -- are designed to offer one-stop shopping for small businesses seeking affordable plans for their workers and for people without insurance looking to buy a policy.", "Because members of Congress and their staffs are already covered by the same health insurance plans that cover other federal employees, they wouldn’t have needed to buy their insurance through an exchange.", "But when Obamacare was being debated, some argued that Congress and congressional staff members should be required to buy their insurance through an exchange system, saying that would ensure that the system would work properly. If ordinary citizens would have to use the exchange, the argument went, so should Congress.", "That provision ultimately became part of Obamacare, formally known as the Patient Protection and Affordable Care Act. In passing it, members of Congress made themselves and their staffers exempt from the provision of the law that would have let them stay with their existing health plan, like everyone else already covered by an employer's health insurance plan.", "But that opened up a different issue, and it revolves around paying for their insurance.", "Most individuals who buy their coverage on the exchange will have to pay for it out of their own pocket. Many will get help from a federal subsidy in the form of a tax credit that varies based on family size and income.", "Yet members of Congress, and some of their staff, make too much money to quality for any subsidy.", "So they would have to pay twice. Not only would they lose their company-subsidized insurance (in this case, the \"company\" is the federal government), they would have to pay for their new insurance plan entirely out of their own pocket.", "To resolve the issue, the Obama administration announced Aug. 7, 2013, that the money already being spent to pay for Congress’ current health insurance plan would be applied to any policy purchased from an exchange.", "(The government currently covers up to 75 percent of the premiums of the federal plan, with enrollees paying the rest. Members of Congress and their staffs would still have to pay their share of the bill.)", "It was this proposed rule that prompted critics over the past few weeks to allege that the Obama administration was creating another exemption for Congress members and their staffs.", "But Congress had already agreed to live by the system it created. What the new rule actually does is continue the federal government’s contribution toward its employees’ insurance coverage.", "So when U.S. Rep. James Langevin said he would be required to buy his health insurance through one of the Obamacare exchanges, his statement was True.", "(If you have a claim you’d like PolitiFact Rhode Island to check, e-mail us at [email protected]. And follow us on Twitter: @politifactri.)", "PolitiFact.com, \"Obama is right on federal health care for janitors and senators,\" Aug. 11, 2009, and \"Did members of Congress exempt themselves from complying with the health care reform laws?\" Jan. 16, 2013, accessed Aug. 14, 2013", "WPRO.com, Rep. James Langevin interview, Aug. 12, 2013, accessed Aug. 13, 2013", "ProvidenceJournal.com, \"R.I. is spreading the word about 2014 health insurance overhaul,\" Aug. 12, 2013", "KFF.org, \"Health Reform\" and \"Subsidy Calculator,\" Henry J. Kaiser Family Foundation, accessed Aug. 14, 2013", "Census.gov, \"Employment-based Health Insurance: 2010,\" February 2013, accessed Aug. 15, 2013", "MediaMatters.org, \"Right-Wing Media Miss On Congressional Health Care In Attack On Obama 'Dictatorship,'\" Media Matters for America, Aug. 8, 2013, accessed Aug. 14, 2013", "WSJ.com, \"Congress' ObamaCare Exemption,\" The Wall Street Journal, Aug. 5, 2013, accessed Aug. 14, 2013", "FactCheck.org, \"Congress and an Exemption from 'Obamacare'?\" Aug. 7, 2013, accessed Aug. 14, 2013", "OPM.gov, \"Healthcare,\" \"Fact Sheet: Health Insurance Coverage: Members of Congress and Congressional Staff,\" and \"Questions and Answers -- Health Insurance Coverage: Members of Congress and Congressional Staff,\" U.S. Office of Personnel Management,\" accessed Aug. 14, 2013", "Reuters.com, \"Congress wins relief on Obamacare health plan subsidies,\" Aug. 7, 2013, accessed Aug. 15, 2013", "TPMDC.com, \"Obamacare Fix Avoids Financial Blow For Hill Staffers,\" Talking Points Memo, Aug. 7, 2013, accessed Aug. 14, 2013", "HealthAffairs.org, \"Implementing Health Reform: A Proposed Rule On Congressional Exchange Participation,\" Aug. 7, 2013, accessed Aug. 14, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]