["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "On the campaign trail, Donald Trump has often recited statistics about the economic plight of African-Americans, arguing that Democrats have done little to improve the lives of one of their core constituencies. The Republican presidential nominee did so again during a rally in Springfield, Ohio, on Oct. 27.", "\"Nearly half of African-American children under the age of 6 are living in abject poverty,\" Trump said.", "It turns out that the poverty rate for young African-Americans is disproportionately high, but not nearly as high as Trump suggests.", "While the Trump campaign did not respond to an inquiry for this article, we suspect that he came across the statistic in a \"State of Working America\" report published by the liberal Economic Policy Institute.", "An infographic packaged with the report said, \"45.8 percent of young black children (under age 6) live in poverty, compared to 14.5 percent of white children.\"", "If that were a current statistic, Trump would be on pretty solid ground. But it’s not.", "It’s not obvious from the infographic, but the State of Working America report was published in 2012. And the data itself is now six years old.", "The full text of the report says, \"In 2010, close to half (45.8 percent) of young black children (under age 6) were in poverty, compared with 14.5 percent of white children.\"", "The problem is that 2010 was during and just after the Great Recession, so poverty rates were unusually high.", "To find out what the rates are now, we turned to data from the U.S. Census Bureau and the Bureau of Labor Statistics. The most recent data we found is for children under age 5 and covers 2015. That’s slightly different, but Census data specific to poverty levels among children age six do not change the percentage significantly.", "For African-Americans under five, the poverty rate was 37.4 percent. That’s quite a bit lower than the \"almost half\" of African-American children that Trump cited.", "The percentage falls even further if you give weight to Trump’s use of the term \"abject poverty\" and look at the poorest of the poor -- those with incomes at half of the poverty level or less.", "For African-Americans under 5, that half-of-poverty rate is 20.4 percent. That’s even further from \"almost half.\"", "We should note that compared to other racial and ethnic groups, the poverty levels for African-Americans are indeed high. Here’s a summary for children under 5:", "Group", "Percent at poverty level", "Percent at half-of-poverty level", "African-American", "37.4 percent", "20.4 percent", "Hispanic", "30.2 percent", "13.1 percent", "White", "12.8 percent", "8.4 percent", "Asian", "11.9 percent", "5.0 percent", "Our ruling", "Trump said, \"Nearly half of African-American children under the age of 6 are living in abject poverty.\"", "The poverty rates in question were as high as Trump says they were at the depths of the Great Recession, but they have since eased, to somewhere between 20 percent and 37 percent, depending on which income threshold you use. Still, the rates for African-American children are disproportionately high, so Trump has a point even if his statistics are too old and exaggerate the scale of poverty in that age group. On balance, we rate the statement Half True.", "Donald Trump, rally in Springfield, Ohio, Oct. 27, 2016", "Economic Policy Institute, infographic from State of Working America, 2012", "Economic Policy Institute, State of Working America (full text), 2012 edition", "U.S. Census Bureau, \"Historical Poverty Tables: People and Families - 1959 to 2015\" (main index page), accessed Oct. 27, 2016", "U.S. Census Bureau, \"POV-01. Age and Sex of All People, Family Members and Unrelated Individuals Iterated by Income-to-Poverty Ratio and Race\" (main index page), accessed Oct. 27, 2016", "U.S. Census Bureau, \"POV-34. Single Year of Age--Poverty Status\" (main index page), accessed Oct. 27, 2016", "Email interview with Kayla Blado, spokeswoman for the Economic Policy Institute, Oct. 27, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]