["About this rating", "Some evidence suggests that chemicals contained in sunscreen can be absorbed into the skin and bloodstream. And some studies have linked exposure to certain chemicals commonly found in sunscreen with endocrinological, reproductive, and developmental issues, although those findings do not necessarily apply to levels currently found in most sunscreen products.", "Absorption does not necessarily equate to risk. The scientific community is uncertain about the short- and long-term implications of absorption of some sunscreen ingredients in humans. As such, the U.S. Food and Drug Administration has requested further research into the safety and efficacy of some chemicals and their potentially associated health effects.", "In the summer of 2020, Snopes readers inquired about the accuracy of widely circulated Facebook posts that claimed some ingredients in common sunscreens can be absorbed into the bloodstream and pose neurological threats to children. One claim in particular was shared thousands of times. That post by a Florida mother alleged that chemicals in her infant daughter's sunscreen may have been connected to \"weird episodes\" of \"zoning out\" and \"dropping [of] her head,\" which could have led to petit mal seizures, a temporary and sudden loss of consciousness also known as absence seizures.", "Some elements of this claim are true, while other points are either unproven or misleading. Research has indicated that active ingredients found in sunscreen can be absorbed into the body’s bloodstream after application. However, the neurological effects of these ingredients remain poorly understood and understudied.", "According to the American Academy of Dermatology Association, consumers can choose from two types of sunscreen: chemical sunscreens that work like a sponge to absorb the sun's rays, and physical sunscreens that act as a shield for the skin. Physical or mineral sunscreens generally consist of titanium dioxide and zinc oxide, both of which are known for their chalky appearance when applied to the skin. Chemical sunscreens, on the other hand, typically contain the chemicals oxybenzone, avobenzone, octisalate, octocrylene, homosalate, and octinoxate that reduce the white, pasty appearance.", "In the United States, sunscreen is classified as an over-the-counter (OTC) drug and is monitored and enforced by the U.S. Food and Drug Administration (FDA). By and large, most sunscreen products were approved before the modern, governmental standardization of drug evaluation and approval processes, requiring that drug manufacturers prove the safety and efficacy of their own products. As such, sunscreens have not been subject to rigorous drug safety testing, according to a 2014 panel held by the FDA Center for Drug Evaluation and Research.", "Evidence that sunscreen can be absorbed into the body was first presented in 1997, and subsequent research has further indicated this to be true. A study published in 2008 in coordination with the National Health and Nutrition Examination Survey — an ongoing nationwide survey to collect data on the health of Americans — found that 97% of urine samples collected as part of a national health survey contained the sunscreen ingredient oxybenzone.", "The 2020 social media posts came five years after a class-action lawsuit was filed against Babyganics, a skincare company that was sued for allegedly misrepresenting some of its baby products, including sunscreen, as \"natural\" and having a misleading ingredient list. According to Truth in Advertising, a nonprofit advertising watchdog organization, Babyganics was accused of violating state laws regarding how a company is allowed to market its products. The suit was settled out of court for $2.2 million, according to Business Wire.", "In an email, Babyganics told Snopes that octinoxate was removed from the SPF 50 lotion ingredient list in 2015 due to its potential effects on ocean reefs. That said, many Babyganic lotions still contain octisalate and octocrylene — two ingredients currently listed as chemicals to be considered for further safety and efficacy review by the FDA. The company went on to address Rackley’s viral claims in an Instagram post dated June 25, 2020.", "We want you to know that the FDA regulates all sunscreens, including ours, to make sure they meet safety and effectiveness standards. We have chosen the active sunscreen ingredients in our products because the FDA believes, based on the available science, that they are safe and effective.", "Following the lawsuit, the FDA proposed a rule in February 2019 that would bring sunscreen regulations up-to-date with scientific understanding of the effects of some ingredients, as part of an ongoing review of over-the-counter products. In particular, the agency requested further research to investigate the extent to which the skin absorbs ingredients, and whether that absorption has any effect on the skin or body.", "\"It's a high priority for the FDA, and we continue to work toward establishing final marketing requirements for sunscreens. As part of this rule, the FDA has asked industry and other interested parties for additional safety data on 12 active sunscreen ingredients currently available in marketed products,\" wrote the FDA in a news release.", "A proposed rule is the first step in the regulatory process and asks interested parties to submit comments and deliver a monograph — or \"recipe book\" — detailing the safety and efficacy of all ingredients included in products. Any sunscreen that contains active ingredients not listed in the monograph must go through a New Drug Application process and cannot be sold until it has been approved. Snopes contacted the FDA to determine whether the final monograph was submitted by its Nov. 26, 2019, deadline, and which chemicals were included in its pages. We received the following response:", "The proposed rule provided extensive background information about the ingredients in sunscreens, UVA and UVB protection and a variety of other important considerations relevant to sunscreen use. It requested additional safety studies to fill in the current data gaps for certain sunscreen ingredients and is aimed at bringing nonprescription, OTC sunscreens that are marketed without FDA-approved applications up to date with the latest science to better ensure consumers have access to safe and effective preventative sun care options. Among its provisions, the proposal addressed sunscreen active ingredient safety, dosage forms and sun protection factor (SPF) and broad-spectrum requirements. It also proposed updates to how products are labeled to make it easier for consumers to identify key product information.", "The ‘‘Coronavirus Aid, Relief, and Economic Security Act,’’ or the ‘‘CARES Act,’’ which was enacted in March of 2020, includes an important legislative initiative that reforms and modernizes the way most nonprescription (OTC) drugs are regulated in the United States, including sunscreens. Among other things, it replaces rulemaking with an order process for establishing many requirements for marketing of most nonprescription drugs. The FDA is committed to using the new tools provided in the Act to promote innovation and improve the safety and effectiveness of OTC monograph drugs. The CARES Act also has provisions that specifically address sunscreen, including one that requires that FDA issue a proposed revised sunscreen order not later than 18 months after the enactment of the Cares Act (i.e., by September 27, 2021). The FDA's analysis of this recently-enacted OTC monograph reform legislation, including its sunscreen provisions, is ongoing. We look forward to providing updates to stakeholders as we implement this important new law.", "As part of its review, the FDA will determine which sunscreen ingredients are \"generally recognized as safe and effective (GRASE) and not misbranded.\"", "A first step in the FDA review to provide a better understanding of the safety and efficacy of certain sunscreen ingredients included a study conducted by agency researchers that was published in the Journal of the American Medical Association (JAMA) in January 2020. The study described how six of the most commonly used active ingredients found in sunscreen (avobenzone, oxybenzone, octocrylene, homosalate, octisalate, and octinoxate) can be absorbed into the body's bloodstream after application. Results from the study show suggest that some sunscreen active ingredients may be absorbed. The 2020 results build on findings from a pilot study published in May 2019, which found four active ingredients (avobenzone, oxybenzone, octocrylene, and ecamsule) were absorbed through the skin and into the body when sunscreen was used at its maximum dosage.", "A JAMA editorial in response to the 2019 study co-written by Dr. Robert Califf and Dr. Kanade Shinkai noted that while systemic absorption was considered \"well above the FDA guidelines,\" that didn’t necessarily mean sunscreen was unsafe. However, it does \"raise many important questions about sunscreen\" and the processes for its evaluation and approval, particularly when weighing the benefits against the risks in children.", "\" ... The fact that an ingredient is absorbed through the skin and into the body does not mean that the ingredient is unsafe, nor does the FDA seeking further information indicate such. Rather, this finding calls for further industry testing to determine the safety and effect of systemic exposure of sunscreen ingredients, especially with chronic use,\" said Dr. Janet Woodcock, director of the FDA’s Center for Drug Evaluation and Research, in a statement.", "In short, the FDA still contends that \"absorption does not equal risk,\" and the proposed rule is meant to provide \"additional safety studies to fill in the current data gaps for these ingredients.\"", "Generally speaking, no evidence exists to suggest that current doses of ingredients found in common sunscreens are \"neurotoxic\" or result in epilepsy. However, a 2017 review published in the journal Toxicology Reports found that some adverse neurotoxic effects of chemicals used in sunscreen may occur \"at concentrations substantially higher than those observed in environment and human tissues,\" which could offer insight into such conditions in sensitive populations and potentially lend further insight into dosage recommendations. In particular, the review found potential neurotoxic effects of ingredients in both chemical and physical sunscreens, including octocrylene, zinc oxide, and titanium dioxide — three chemicals reported in the Babyganics ingredients list, noted the monthly publication Practical Dermatology.", "The research published in Toxicology Reports found potential links between common sunscreen ingredients and endocrinological issues, impairment of gene expression and regulation, and reproductive issues, among others. It is important to note that many of the studies included in the review analyzed the implications of environmental exposure to the chemicals in large doses on animals, both in controlled and uncontrolled environments, and did not necessarily look at the impact directly on humans at chemical levels seen in sunscreen. Snopes contacted the American Neurological Association for further clarification and will update the article accordingly.", "While the FDA continues to review the short- and long-term effects of certain sunscreen ingredients, experts recommend continuing to use sunscreen and other sun-protective measures.", "McNeal, Stephanie.   \"A Mom Is Going Viral After Linking Her Baby’s Seizures Without Scientific Evidence To Ingredients In A Popular Sunscreen.\"\r\n    Buzzfeed News.   1 July 2020.", "Downs, C.A. et al.   \"Toxicopathological Effects of the Sunscreen UV Filter, Oxybenzone (Benzophenone-3), on Coral Planulae and Cultured Primary Cells and Its Environmental Contamination in Hawaii and the U.S. Virgin Islands.\"\r\n    Archives of Environmental Contaminatino and Toxicology.   20 Oct 2015.", "Blüthgen, Nancy, et al.   \" Accumulation and effects of the UV-filter octocrylene in adult and embryonic zebrafish (Danio rerio),\"\r\n    Science of the Total Environment.   1 April 2014.", "Fass, Oliver, et al.   \" Female sexual behavior, estrous cycle and gene expression in sexually dimorphic brain regions after pre- and postnatal exposure to endocrine active UV filters.\"\r\n    NeuroToxicology.   March 2009.", "Janjua, Rezaq Nadeem, et al.   \" Systemic Absorption of the Sunscreens Benzophenone-3, Octyl-Methoxycinnamate, and 3-(4-Methyl-Benzylidene) Camphor After Whole-Body Topical Application and Reproductive Hormone Levels in Humans.\"\r\n    Journal of Investigative Dermatology.   July 2004.", "Krause, M. et al.   \"Sunscreens: Are They Beneficial For Health? An Overview of Endocrine Disrupting Properties of UV‐filters.\"\r\n    International Journal of Andrology.   22 May 2012.", "Akhiyat, Sophia and Edit Harken.   \"Update on Human Safety and the Environmental Impact of Physical and Chemical Sunscreen Filters.\"\r\n    Practical Dermatology.   Feb 2019.", "Ruszkiewicz, Joanna.   \"Neruotoxic Effect of Active Ingredients in Sunscreen Products, A Contemporary Review.\"\r\n    Toxicology Reports.   27 May 2017.", "Turney, Amanda.   \"FDA In Brief: FDA Announces Results From Second Sunscreen Absorption Study.\"\r\n    FDA In Brief.   21 Jan 2020.", "Califf, Robert and Kanade Shinkai.   \"Filling in the Evidence About Sunscreen.\"\r\n    JAMA.   6 May 2019.", "Matta, Murali, et al.   \"Effect of Sunscreen Application on Plasma Concentration of Sunscreen Active Ingredients.\"\r\n    JAMA.   21 Jan 2020.", "Michele, Theresa.   \"Shedding More Light on Sunscreen Absorption.\"\r\n    FDA Voices.   21 Jan 2020.", "\"Sunscreen Drug Products for Over-the-Counter Human Use.\"\r\n    Federal Register.   26 Feb 2019.", "\" Maker of Babyganics Sued in NY Federal Court for False Marketing Practices, Halunen Law Announces.\"\r\n    Business Wire.   7 Sept 2016.", "Calafat, Antonia M. et al.   \" Concentrations of the Sunscreen Agent Benzophenone-3 in Residents of the United States: National Health and Nutrition Examination Survey 2003–2004.\"\r\n    Environmental Health Perspectives.   1 July 2008.", "Cameron Hayden, Michael Roberts, Heather Benson.   \"Systemic Absorption of Sunscreen After Topical Application.\"\r\n    The Lancet.   20 Sept 1997.", "Updated to include an emailed statement received from the U.S. Food and Drug Administration.", "Madison Dapcevich is a freelance contributor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]