["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A recent Facebook post uses a video clip of a debate between then-President Donald Trump and Joe Biden to raise suspicions about something visible around Biden’s wrist.", "Previous social media posts after the Sept. 29 debate wrongly said Biden was wearing a wire to aid him during the debate.", "Now the footage is being cast as evidence that Biden isn’t human.", "\"THIS PROVES 100% THAT PRESIDENT JOE BIDEN IS NOT A ‘HUMAN’ BEING,\" a description of the video says.", "Someone narrating the clip claims that something \"that looks like live little serpents\" emerges from Biden’s suit jacket.", "\"That s--- is alive,\" the narrator says. \"It kind of looks like he’s shaking his head a little bit.\"", "The camera then pans to Biden and the narrator says: \"That’s not a human being, people.\"", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The clip used in the Facebook video comes from about the 28:20 mark in this C-SPAN video of the debate. Debate moderator Chris Wallace asks Biden about reopening the economy and schools.", "Something is visible on Biden’s left wrist before it slips back into his shirt sleeve but it appears to be the rosary beads that Biden wears to remember his late son, Beau Biden.", "\"I have not taken off the rosay Beau was wearing when he passed since then,\" Biden said during a 2017 interview. \"It’s my connection with him.\"", "The Biden campaign told the Associated Press after the September debate that the then-presidential candidate was wearing the rosary. A spokesperson for the campaign also told Agence France-Presse at the time that what the Facebook post calls a serpent — or serpents — is Beau Biden’s rosary.", "We rate this claim Pants on Fire.", "Facebook post, Jan. 24, 2021", "PolitiFact, Biden did not wear a wire during the first presidential debate, Sept. 30, 2020", "The Associated Press, Biden did not wear a wire during the presidential debate, Sept. 30, 2020", "Agence France-Presse, Biden accused of wearing wire during presidential debate, Sept. 30, 2020", "HuffPost, Joe Biden wears rosary beads in honor of his late son, Nov. 13, 2017", "Religion News Service, Like Joe Biden, many Catholics find the rosary to be a comfort and anchor in crisis, Nov. 23, 2020", "C-SPAN, First presidential debate, Sept. 29, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]