["By Chloe Wilson", "Posted on October 16, 2018", "Q: Is it true that “pro-choice activist” Elena Travis has received a “world record” number of abortions?", "A: No. This story was made up by a satirical website.", "World News Daily Report, a self-described satirical website, published an article on Oct. 9, stating that a California woman received a record-breaking number of abortions. The site includes a disclaimer at the bottom of each page that says: “World News Daily Report assumes all responsibility for the satirical nature of its articles and for the fictional nature of their content.”", "The made-up story, though, received more than 500,000 interactions on Facebook, including 47,000 shares, according to CrowdTangle data. It was also shared on YouTube and 4chan, an open, image-sharing forum, without the disclaimer. Some 4chan users commented that it was fake, but comments by others indicated that some thought it was real.", "The bogus story states that “Elena Travis,” who is described as a “34-year-old Pro-Choice activist,” officially broke the world record after receiving her 27th abortion. The photos that accompany the story are actually stock photos from Getty Images.", "Aside from the misidentified photos and a disclaimer at the bottom of the story, there are other indications that the story is false. There is no byline on the story and the clinic mentioned as performing the “historic operation” does not seem to exist. A Google search for “Sacramento Street Health Center” yielded no results.", "We’ve written once before about World News Daily Report and have included the website in our “Misinformation Directory,” which lists websites that spread misinformation on the internet.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on the social media network.", "“A 34-year-old Pro-Choice activist has officially broken a world record after receiving her 27th abortion.” World News Daily Report. 9 Oct 2018.", "“California: Pro-Choice Activist Proudly Breaks World Record By Getting Her 27th Abortion.” Earth Changes YouTube Channel. 12 Oct 2018.", "“Happy Patient.” Getty Images. Undated, accessed 16 Oct 2018.", "“IV Drip.” Getty Images. Undated, accessed 16 Oct 2018.", "“Misinformation Directory.” FactCheck.org. 6 Jul 2017.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]