["The photos were shared here on Facebook on October 1, 2020.", "“#BREAKING AZERBAIJAN Picture shows DESTROYED Russian Made S-300 Air Defence Systems of Armenia. Turkey made Harop Drones proved very effective against Russian Air Defence Systems. #azerbaijan #AzerbaijanArmy #azerbaijanis #azerbaycan #azerbaijanarmenianconflict #AzerbaijanNotAlone #armenia #ArmenianOccupation,” reads the post's caption.", "The caption refers to recent clashes between Armenia and Azerbaijan, as AFP reported here.", "Heavy shelling between the two countries persisted on October 1 despite fresh calls from world leaders for an end to days of fighting over the disputed Nagorny Karabakh region.", "The photos were also shared here, here, here and here on Facebook, and here, here, here and here on Twitter alongside identical claims.", "The claim, however, is false.", "A reverse image search found the photos were published here on a Greek-language website on December 5, 2016.", "The headline translates to English as: “S300, oops that fell as well.”", "Below is a screenshot comparison of the photos shared in the misleading post (L) and the photos published on the Greek site (R):", "According to the report, the photos show a Russian-made S-300 Air Defence System that was damaged in an accident.", "The report also includes a high-quality video of the accident that was posted here on YouTube on December 4, 2016.", "The video’s Russian-language title translates to English as: “The pride of PVO RF (Russian Federation Air Force) the S-300 system. The Ashuluk polygon (airfield) August 2016.”", "A keyword search on Google found the accident was reported here by science and technology website Popular Mechanics on December 6, 2016.", "According to the report, the incident happened at a missile base in southwestern Russia.", "A further keyword search on Google found the photos and the video were also published here in a report by a Turkish-language website on December 4, 2016.", "The headline reads: “The crash of the Russian S-300 missile”.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]