["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Democratic state Rep. Patrick Rose of San Marcos, seeking re-election in a district whose voters preferred Republican John McCain for president in 2008, depicted the GOP nominee as a high-tax advocate in a recent TV ad that debuted online Sept. 24.\n\nTo creepy music in the background and grainy video of the challenger, Jason Isaac, the ad's narrator says Isaac \"supports higher sales taxes. The tax plan he's peddling means Texans would pay the highest sales taxes in America, up to 14.5 percent. So if Isaac gets his way, you'll pay more for every loaf of bread, every prescription, everything you buy in Texas.\"\n\nAnother Rose ad revisits the tax-hike warning about Isaac with: \"Hey Jason, you can't be serious.\"\n\nGutsy or whack, is Isaac selling a tax surge?\n\nRose's campaign consultant, Randy Thompson, shared a transcript of an Aug. 17 interview of Isaac on an Internet radio program titled \"Texas Sons of Liberty Riders.\" We verified the transcript after Isaac's campaign consultant, Corbin Casteel, provided a web link to the archived audio.\n\nOn the show, Isaac said he favors lowering the 10 percent state cap on annual increases in home appraisals to 3 percent and eventually wiping out property taxes altogether.\n\nIsaac also told the hosts that lost revenue from eliminating property taxes could be recovered from higher sales taxes, saying: \"A lot of people like the consumption-based model and there's a group out there, the Texas Public Policy Foundation, they released a study earlier this year that said if you just eliminated property taxes and you wanted to make a pure consumption (tax) base... sales tax is an easier way to put it.\"\n\nIsaac then said: \"You increase the sales tax to 14 and a half percent and you've got a wash. It balances out. You could eliminate all your property taxes but everything you buy, you pay a 14 and a half percent tax.\"\n\nWe confirmed that in April 2009, the conservative-leaning Austin-based public policy foundation issued a report on wiping out property taxes and replacing that revenue with sales taxes. The study says that if the sales tax is limited to items it now covers, it would need to be raised to about 14.5 percent. If it were expanded to all property sales, the state rate could be 12.5 percent, the study says, and if expanded to cover \"all services taxed by at least one other state,\" the rate could be 9 percent.\n\nA sales tax rate of 14.5 percent would--take a breath-- more than double the current Texas rate of 6.25 percent, on which local jurisdictions may tack on up to 2 percent more. As of January, California's 8.25 percent statewide sales tax was the highest in the country, according to the Washington-based Federation of Tax Administrators.\n\nBut there was more to Isaac's interview than talking up a sales tax hike, which he noted could also be counterproductive: \"My thought process is you get above 9 and a half (percent sales tax) and you're gonna start driving people to the black market... they're gonna order everything off of Amazon.com... But I like the consumption-based model.\"\n\nIn a follow-up e-mail, Rose's consultant, Thompson, said Isaac has failed to tell voters precisely how he'd replace the lost property tax revenue. Thompson shared a transcript from a Sept. 12 forum in which Isaac concedes he doesn't have the answer, aside from using money from the state's so-called rainy day fund. \"But,\" Isaac said, according to the transcript, \"I believe if you start to cut property taxes, your tax base is going to grow\" because more people will be able to afford homes and more people will buy more goods and services, resulting in greater sales-tax revenue.\" Isaac reaffirmed that position in an interview with us. He also said that while he favors wiping out property taxes, \"I don't have the answers\" on how to replace the revenue.\n\nIsaac's campaign, responding to Rose's ad, distributed a statement saying Isaac does not support raising the state sales tax rate to 14.5 percent, but believes \"Texans deserve options to create a more sustainable tax model and that we need creative new solutions in this tough economy.\" On his campaign website, Isaac states he \"believes that a consumption-based model is one possible solution, but there are limitations.\"\n\nSo, Isaac wants Texas property taxes to go to zero sometime. He says he's uncertain how to get there, yet he supports the \"consumption\" model, meaning a reliance on sales taxes. And he approvingly referred to a study by a conservative group showing that one way to eliminate property taxes in Texas is to raise the state sales tax to 14.5 percent.\n\nContrary to Rose's statement, though, there's no sign Isaac is peddling a plan to bump the state sales tax to 14.5 percent--indeed, there's flat-out no plan to peddle. Still, there's a shred of truth to Rose's statement because Isaac has saluted the idea of swapping higher sales taxes for cuts in property taxes.\n\nWe rate the statement Barely True.", "Blog Talk Radio, website, audio of Sons of Liberty - Texas Sons of Liberty Riders, Aug. 17, 2010 (accessed Oct. 4, 2010)\n\nE-mail, response to PolitiFact Texas, Randy Thompson, consultant to Patrick Rose campaign, Sept. 30, 2010\n\nFederation of Tax Administrators, Washington, \"State Sales Tax Rates and Food & Drug Exemptions,\" Jan. 1, 2010 (accessed Oct. 4, 2010)\n\nInterview, Jason Isaac, Dripping Springs, Oct. 5, 2010\n\nJason Isaac campaign, website and \"Fact Check,\" responding to Patrick Rose campaign advertisement, Sept. 24, 2010\n\nPatrick Rose campaign, response to PolitiFact Texas, Sept. xx, 2010\n\nState Rep. Patrick Rose, state website, \"District Election Analysis, House District 45,\" accessed Oct. 4, 2010\n\nTexas Comptroller of Public Accounts, website, \"Texas Sales Tax, Frequently Asked Questions\" (accessed Oct. 4, 2010)\n\nTexas Public Policy Foundation, press release, \"Research: Texas economy would benefit by abolishing property tax,\" and study, \"Enhancing Texas’ Economic Growth Potential Through Tax Reform,\" April 28, 2009", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]