["“BREAKING: CBN bans importation of textile materials,” reads the March 5 Facebook post by the Nigerian Tribune newspaper, which has nearly a million followers on Facebook.", "The link in the Facebook post leads to an article (here's an archived version) on the Nigerian Tribune's website with the same headline. But the article itself -- which is only four lines long -- contains nothing which actually backs up the claim that Nigeria has banned textile imports.", "Instead, the article states -- correctly -- that the CBN has added textiles to a list of items that are not eligible for foreign exchange.", "This means that Nigerians or Nigerian businesses planning to import any of these items from another country cannot buy dollars, euros or any other foreign currencies from authorised forex dealers in Nigeria -- predominantly the banks -- with which to pay their suppliers.", "Therefore, anyone seeking to import textiles, or any other items on the list, would have to buy their dollars or other foreign currencies from the black market, where the prices are slightly higher. The CBN trades $1 for N305 officially, but also has an importer/exporter window which authorises currency exchanges between people that want to buy naira in order to invest in Nigeria, and people that want dollars or another currency in order to buy imports. The same $1 sells at this window for about N360. On the black market, $1 sells for even more than N360.", "The CBN has rationed the sale of foreign currency to businesses and individuals since 2015, when the price of crude oil -- the mainstay of the Nigerian economy -- suffered a drastic fall on global markets. Oil was, and remains, Nigeria’s biggest source of foreign exchange earnings, so the fall in prices left the government scrambling to ensure it wasn’t going to run out of foreign currency reserves.", "The bank at the time released a list of 41 items not eligible for foreign exchange, including toothpicks, rice, cement and even Indian incense sticks. The bank said the policy was designed to conserve foreign exchange and boost local production of the 41 items.", "It stated categorically that “for the avoidance of doubt, please note that the importation of these items are not banned, thus importers desirous of importing these items shall do so using their funds without any recourse to the Nigerian foreign exchange markets”.", "Fertiliser was added to the list in December 2018.", "On March 5, CBN governor Godwin Emefiele told a meeting with Nigerian cotton producers that the bank was adding textiles to the items not eligible for foreign exchange, as seen in the video below.", "Just like the items that were already on the list, the restrictions do not mean that Nigerians are banned from importing textiles -- just that anyone wanting to do so will not be able to buy the foreign currency needed for the purchase through an authorised forex trader. They’d have to get their currency on Nigeria’s well-established informal or “black” market for forex, which can in some cases be done legally.", "The policy makes imports of textiles more expensive for the importer, and more difficult. But it does not make them impossible.", "CBN spokesman Isaac Okorafor confirmed to AFP that Emefiele’s announcement was “not a ban on the importation of textiles”.", "Instead it is “a restriction of access to forex from the Nigerian forex market to importers of textile, meaning that importers can source their own forex autonomously,” he said.", "“No authorized forex dealer is allowed to sell forex from the Nigerian forex market to anyone importing textile into Nigeria,” he added.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]