["At a campaign rally in Minneapolis, President Donald Trump marveled at the crowd size.", "\"So we have 20,000-plus inside,\" he said. \"We set a new record. And we have 25,000 people we still love outside. And close to 100,000 wanted to come tonight.\"", "An Oct. 11 Facebook post seized on that line.", "\"20,000 inside, 25,000 outside, all to hear the POTUS speak!\" it says. \"Ask yourself, does this look like a country that wants to impeach our president?\"", "An image below the text shows the streets packed with people outside of an arena.", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "We’re not fact-checking Trump’s claim about the crowd size here but Minnesota Public Radio has looked at his boast. In short: the Target Center where Trump appeared can hold approximately 20,000 people, but a precise count of how many people were there is difficult. Even if more than 20,000 attendees were in the center that day, it’s not the first time — a basketball game and a U2 concert drew 20,412 and 20,200, respectively.", "As for those who didn’t make it inside the arena, Minnesota Public Radio reported that \"the president’s assertion that 25,000 were left on the outside is dubious given that an overflow space wasn’t full and reporters on the outside of the arena saw nothing nearing that number.\"", "The accuracy of the photo, however, is easier to fact-check. It’s not showing the Trump crowd.", "It’s not outside the Target Center, where the Minnesota Timberwolves play. It’s in Cleveland, Ohio, on June 22, 2016, during a victory parade after the Cavaliers won the 2016 NBA championship. Angelo Merendino shot the photo for Getty Images.", "We rate this Facebook post False.", "Facebook post, Oct. 11, 2019", "New York Times, At Minneapolis rally, an angry Trump reserves his sharpest attack for Biden, Oct. 10, 2019", "Minnesota Public Radio, Fact check: President Trump’s Minneapolis rally speech, Oct. 10, 2019", "Getty Images, Angelo Merendino photo of Cleveland Cavaliers victory parade, June 22, 2016", "News 5 Cleveland, It’s been 3 years since the Cavs championship parade, but it feels like yesterday, June 22, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]