["By Angelo Fichera", "Posted on October 22, 2018", "Q: Did former Vice President Joe Biden say “no ordinary American cares about his constitutional rights”?", "A: No. That viral quote is false and has circulated for several years.", "A quote making the rounds on social media has been falsely attributed to former Vice President Joe Biden, who may run for president in 2020.", "“No ordinary American cares about his constitutional rights,” reads the supposed quote. It was included in a popular meme, posted Oct. 20 on Facebook, that bears the logo of the conservative group Turning Point USA.", "The quote has circulated online for years, although there is no evidence Biden ever said that.", "A YouTube video, for example, was posted in October 2015 and titled, “Biden: no ordinary American cares about his constitutional rights.” It’s been viewed over 30,000 times.", "The video doesn’t show Biden saying that. Instead, it’s a clip of him talking about “roadblocks” set up by the “organized opposition” to gun control.", "Biden spoke at Western Connecticut State University in February 2013 at a conference on gun violence. It was convened two months after the Sandy Hook Elementary School shooting in Newtown, Connecticut, which left 20 children and six adults dead. The shooter had also killed his mother and later took his own life.", "“They say all you’re going to do … [is] deny law-abiding citizens their rights under the Second Amendment,” Biden said. “Not true.”", "He went on to add, “Let me say at the outset to all the press: No law-abiding citizen in the United States of America has any fear that their constitutional rights will be infringed in any way. None, zero.”", "The day Biden made his remarks, a headline on the conservative website Breitbart paraphrased the then-vice president this way: “Biden: No Ordinary American Cares About Their Constitutional Rights, Facebook Questions are Plants.”", "That appears to be how those words became attributed to Biden.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on the social media network.", "“Biden: No Ordinary American Cares About Their Constitutional Rights, Facebook Questions are Plants.” Breitbart.com. 21 Feb 2013.", "“Federal Response to Gun Violence Conference with Vice President Joe Biden at Western Connecticut State University.” Video. Connecticut Network. 21 Feb 2013.", "Kegu, Jessica. “Joe Biden reveals how he’ll decide whether to run for president in 2020.” CBS News. 18 Oct 2018.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]