["A 19-year old Dalit woman who was allegedly gang-raped in Hathras succumbed to injuries on September 29. She was subsequently cremated by Uttar Pradesh police without the consent of her family. The incident sparked protests led by the civil society and politicians who attempted to visit the victim’s family. On October 5, Congress leader Udit Raj, along with a team 15 people heading to Hathras, was stopped by the police. In response, Raj and his associates — activists Yogita Bhayana, Alka Mahajan, and Shilpi Arora — staged a sit-in protest on the road. Around 1 pm, a live video of the protest was uploaded on Raj’s Twitter handle.", "An eight-second clip from the protest has gone viral. It shows Raj tapping on the shoulder of a woman, whispering in her ear and sharing a laugh. This video is circulating on Twitter and Facebook with the insinuation that Raj was getting intimate with a woman during a protest against rape.", "Twitter user @erbmjha posted this clip and wrote, “People chanting “Bharat Mata ki Jai” Look what @Dr_Uditraj is doing (kiss emoji).” This video has been viewed over one lakh times (archived link). Readers should note that in past Alt News has documented @erbmjha spreading misinformation on numerous occasions. Several Twitter accounts have posted the viral video with identical text.", "People chanting “Bharat Mata ki Jai”", "Look what @Dr_Uditraj is doing 👉😘👈 pic.twitter.com/RIlpgyHbTi", "— BALA (@erbmjha) October 5, 2020", "Hindu Yuva Vahini member Shandilya Gaurav Chaudhary posted the video and wrote in Hindi, “Breaking News: Soon to be National President of INC Udit Raj’s behaviour.” This video has gained over 60,000 views (archived link). Many Twitter users have posted the clip along with the text written by Chaudhary.", "ब्रेकिंग न्यूज : @INCIndia के होने वाले राष्ट्रीय अध्यक्ष @Dr_Uditraj की हरकत । pic.twitter.com/FDBgOZpBY0", "— Shandilya Gaurav Chaudhary (@igauravbjp) October 5, 2020", "BJP MP Indu Tiwari also posted the video and wrote, “Udit Raj is demonstrating qualities one should have to be a Congress President. Keep it up.” This video has been viewed over 20,000 times. (archived link)", "उदित राज, कांग्रेस अध्यक्ष के लिए जो योग्यता होनी चाहिए उसका प्रर्दशन कर रहा है । ये इस तरह से प्रदर्शन करते हैं । @Dr_Uditraj pic.twitter.com/2kRBpiYdIS", "— Indu Tiwari (@indutiwarijbp) October 5, 2020", "In order to gain context about what’s happening in the video, Alt News reached out to Udit Raj. “I’m aware that a short clip has gone viral that shows me with Shilpi Arora ji from the protest on October 5. We were sitting on a dharna (protest) at NH24 because police stopped us to proceed to Hathras. I just patted Shilpi Arora ji for raising slogans and commented if she is from JNU which made her laugh. The video is mischievously presented.“ Arora is the state president of Uttaranchal Punjabi Mahila Mahasabha.", "We then reached out to Arora who provided a more detailed account of the short conversation captured on camera. “First of all, I would like to begin by stating that Raj ji hasn’t misbehaved with me in the viral video. He tapped on my shoulder and whispered in my ear so that I hear what he was saying. Raj ji jokingly asked, “Kya aap JNUite hai ?” (Are you from JNU?). I found it funny. I wondered if only college students can raise slogans?”", "Alt News heard the audio multiple times and noticed that at the fourth and seventh seconds, Raj says, “JNUite hai?” and “JNUite” respectively. Readers are requested to use earphones while listening to the audio clip.", "Arora also made a similar response while replying to BJP’s youth wing ABVP member Yashdeep Parashar who also shared the viral video on October 6. In her tweets, she stated that Raj asked if she was from JNU. Arora also firmly said that she would have reported him had he misbehaved.", "This slideshow requires JavaScript.", "“I know Raj ji for a while now. We both strongly feel about women empowerment,” she further told Alt News.", "A short clip that shows Congress leader Udit Raj and Uttaranchal Punjabi Mahila Mahasabha president Shilpi Arora having a casual conversation was misrepresented on social media. While Raj’s behaviour was questioned with insinuations there was a public display of affection towards a fellow member during a protest against rape, the woman herself has denied the allegations.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]