["By Saranac Hale Spencer", "Posted on November 11, 2019", "Memes circulating widely on social media misidentify a former White House staffer as the whistleblower who touched off the impeachment inquiry into President Trump.", "Pictures of White House staffers from 2016 flooded social media last week, with many of them bearing a red circle around the face of a man wearing glasses. Those memes claim that he is the whistleblower who filed an Aug. 12 complaint about the actions of President Donald Trump regarding Ukraine. He isn’t.", "He is actually R. David Edelman, who has worked at the Massachusetts Institute of Technology as the director of MIT’s Project on Technology, Economy & National Security since March 2017.", "While we don’t know the identity of the whistleblower, we do know it’s not Edelman.", "Lawyers representing the whistleblower have fought back against attempts to identify their client; they cite concerns for their client’s safety and respect for the integrity of the whistleblower system, which they say affords anonymity to those who report complaints. But we know that he or she was a federal government employee at least as of the time of the July 25 phone call between Trump and Ukrainian President Volodymyr Zelensky, the crux of the complaint, because the whistleblower wrote that he or she had received this information “[i]n the course of my official duties.”", "Whistleblower complaint, Aug. 12: Over the past four months, more than half a dozen U.S. officials have informed me of various facts related to this effort. The information provided herein was relayed to me in the course of official interagency business. It is routine for U.S. officials with responsibility for a particular regional or functional portfolio to share such information with one another in order to inform policymaking and analysis.", "Edelman left his government job in January 2017. He had been a special assistant to the president for economic and technology policy during the Obama administration, and he was listed on the annual report to Congress for White House staff in 2016, but not in 2017 during Trump’s first year in office.", "Also, he told us he is not the whistleblower. In a phone interview on Nov. 8, Edelman explained how he found out he had been swept up in the misinformation machine. The day before, he woke up to an email from a friend who wrote at the bottom of the message, “By the way, you won’t believe what I saw online,” with a copy of the meme. “I didn’t think much of it,” Edelman said.", "But, by midday, he realized that the reach of the misidentified picture had continued to grow. Some versions on Facebook have each been shared thousands of times, and some have been shared on Twitter, too. So, Edelman tweeted a correction with a screenshot of one version of the meme that identified him as the whistleblower and a “NERD.”", "“I’m sure they meant that as a sick burn,” Edelman said, but, in his line of work, that’s a compliment. He wrote in his tweet, “the ‘NERD’ circled below is…this nerd. Me.”", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "Kamm, Nicholas. US Vote Obama Reaction. AFP/Getty Images. 9 Nov 2016.", "Walsh, Susan. 2016 Election Obama. Associated Press. 9 Nov 2016.", "Bakaj, Andrew and Mark Zaid. Lawyers representing the whistleblower. “Statement of November 6, 2019, Concerning the Suspected Identity of the Whistleblower.” Compass Rose Legal Group. 6 Nov 2019.", "Whistleblower complaint. U.S. House of Representatives Permanent Select Committee on Intelligence. 12 Aug 2019.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]