["Social media users are sharing a video that, according to them, is the original footage of Swami Vivekananda’s Chicago address. On January 21, 2023, a user shared the clip and wrote, “This is a rare video of Shri Swami Vivekananda’s lecture which Swami Vivekananda gave on 13 September 1893 in Chicago, USA”.", "शायद कितने ही भाई होंगे जिन्होंने आजतक हिदू ह्रदय सम्राट श्री स्वामी विवेकानंद जी को देखा भी नही होगा जिन्होंने डूबते हुए सनातन धर्म को बचाया उन्ही श्री स्वामी विवेकानंद जी के व्याख्यान का ये एक दुर्लभ वीडियो जो स्वामी विवेकानन्द ने अमेरिका के शिकागो में 13 सितम्बर1893 को दिया। pic.twitter.com/yggVowh1Al", "— रंजना सिंह (हिंद की लाडली) (@RajputRanjanaa) January 21, 2023", "Alt News received requests on its WhatsApp helpline number to check the veracity of the video.", "A 2:26-minute clip supposedly of the great spiritual guru Swami Vivekananda was then circulating on social media. Facebook user Kajalben Bhalara asserted that it showed Vivekananda’s speech on September 13, 1893.", "Rare video- dated 13.9.1893- Parliament of religions at Chicago addressed by swami vivekananda", "Posted by Kajalben Bhalara on Tuesday, 1 October 2019", "A few more people on Twitter and Facebook shared the video with a similar narrative.", "With a keyword search on Google, Alt News found the YouTube video titled, “Swami Vivekananda -2012 New Full Movie (English)“.", "From 13:38 minutes in the video posted below, the relevant portion which picturizes Swami Vivekananda delivering the speech in Chicago can be seen.", "The same movie in Hindi was uploaded by the YouTube channel of Sri Ramakrishna Math Chennai on September 28, 2018. According to the certificate issued by ‘Central Board of Film Certification’, the name of the movie is ‘Vivekananda by Vivekananda’ produced by Beehive productions.", "In conclusion, a clipping from a movie based on Swami Vivekananda’s life was shared in 2019 as the original footage of the monk’s speech in Chicago. the same clip is viral again in 2023.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]