["About this rating", "On 16 February 2016, a photograph purportedly showing future presidents Bill Clinton and George H.W. Bush sitting at a table with segregationist Alabama governor George Wallace was posted to a Facebook group along with the caption \"Planning for 'The New World Order'\":", "This meme was shared to a page called: \"Our NEXT President Bernie\" in an apparent attempt to either show that American politics consists of a relatively small group of co-conspirators, to discredit Bush and Clinton by linking them to former Alabama governor George Wallace (who was well known for being a segregationist in the 1960s), or both.", "Although it's difficult to discern the motivation for the sharing of this photograph with that particular caption, we can say it is real. CBS News included the photograph in a gallery of images from Wallace's political career and reported that the photograph was taken in 1983, at Bush's residence in Kennebunkport, Maine.", "At the time, Bush was serving as vice president under Ronald Reagan, Bill Clinton was the governor of Arkansas, and George Wallace was at the beginning of his final term as governor of Alabama:", "Wallace and his third wife, the former Lisa Taylor, meet with Vice President George Bush and Arkansas Gov. Bill Clinton at a lobster bake at Bush's residence at Kennebunkport, Maine, July 30, 1983. The third Mrs. Wallace, whom the governor married in 1981, was 30 years his junior and half of a country-western singing duo, Mona and Lisa, who had performed during his campaign in 1968.", "While it's impossible to tell what the three men were discussing when the photograph was taken, the picture captures a common occurrence: politicians hobnobbing and shaking hands.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]