["Bernie Sanders at the Iowa Democratic presidential debate. (AP)", "During a discussion of American foreign policy and military involvement in the Middle East at the Democratic debate in Iowa, presidential candidate Bernie Sanders turned the discussion to the care provided to American veterans with a startling statistic: 500,000 returned service members have experienced post-traumatic stress disorder and traumatic brain injuries.", "\"When you talk about the long-term consequences of war, let's talk about the men and women who came home from war,\" Sanders said. \"The 500,000 who came home with PTSD and traumatic brain injury. And I would hope that in the midst of all of this discussion this country makes certain that we do not turn our backs on the men and women who put their lives on the line to defend us.\"", "Sanders has been making this claim for more than a year, including on Twitter in 2014, in a 2014 CNN interview and at a Minnesota campaign event last summer.", "But is it true? Have 500,000 American veterans really returned home from recent conflicts with PTSD and brain injuries?", "Sanders’ claim is at the higher end of the range of estimates available.", "The U.S Department of Veterans Affairs estimates that between 11 and 20 percent of veterans from Operation Iraqi Freedom and Operation Enduring Freedom (Afghanistan) have PTSD in a given year. As of late 2014, about 2.7 million troops had served in Iraq or Afghanistan. That’s a wide range: 11 percent of 2.7 million is 297,000; 20 percent is 540,000.", "Additionally, a U.S. Senate resolution identifies \"more than 390,000\" cases of PTSD among veterans of Operation Enduring Freedom, Operation Iraqi Freedom and Operation New Dawn in Afghanistan, citing the secretary of Veterans Affairs as its source.", "Those figures only account for PTSD, not traumatic brain injury, or TBI, which Sanders also referenced.", "A 2013 Congressional Research Service paper on traumatic brain injury found that almost 57,000 Operation Enduring Freedom and Operation Iraqi Freedom veterans were evaluated or treated for \"a condition possibly related to TBI\" by the VA.", "That number is slippery though. It’s not clear that all of those nearly 57,000 actually received a TBI diagnosis, and it doesn’t account for the potentially thousands more veterans who experienced a traumatic brain injury but did not receive care through the VA.", "The VA also estimates that brain injuries account for 22 percent of all combat casualties in Iraq and Afghanistan.", "The Defense Department, meanwhile, identifies 333,169 instances of traumatic brain injury among service members between 2000 and 2015. That’s a big number, but there are some caveats that come with it: It includes all U.S. forces, not just those deployed to Iraq and Afghanistan, and is overwhelmingly comprised of concussions and \"mild TBI\" that by definition lasts less than 24 hours.", "Also worth noting: that same U.S. Senate resolution noting 390,000 PTSD cases also references \"more than 615,000\" veterans of recent conflicts who have been diagnosed with \"at least 1 mental health disorder.\"", "Our ruling", "Sanders said 500,000 U.S. troops came home from Iraq and Afghanistan \"with PTSD and traumatic brain injury.\"", "No firm numbers exist for the number of veterans who have returned from America’s most recent conflicts with post-traumatic stress disorder or traumatic brain injuries, but Sanders’ claim of 500,000 does fall within the range of estimates provided by the VA and other sources.", "Sanders’ statement needs that caveat. As such, we rate it Mostly True.", "Bernie Sanders tweet, \"Some 500,000  men and women have come back from Iraq and Afghanistan   with PTSD or TBI.,\" July 24, 2014", "Transcript, Bernie Sanders interview on CNN's \"State of the Union,\" Oct. 12, 2014", "Video, Bernie Sanders Town Hall Q&A in Rochester, Minn., July 2, 2015", "U.S. Department of Veterans Affairs, \"How Common is PTSD?\" Aug. 13, 2015.", "U.S. Department of Veterans Affairs, \"Analysis of VA Health Care Utilization among Operation Enduring Freedom (OEF), Operation Iraqi Freedom (OIF), and Operation New Dawn (OND) Veterans,\" January, 2015", "U.S. Senate, \"Resolution Designating the month of June 2015 as \"National Post-Traumatic Stress Disorder Awareness Month\" and June 27, 2015, as \"National Post-Traumatic Stress Disorder Awareness Day,\" June 25, 2015", "Congressional Research Service, \"Traumatic Brain Injury Among Veterans,\" Jan. 4, 2013", "U.S. Department of Veterans Affairs, \"Traumatic Brain Injury and PTSD\" Aug. 17, 2015", "U.S. Department of Defense, \"DoD Numbers for Traumatic Brain Injury,\" Aug. 18, 2015", "FactCheck.org, \"Sanders’ PTSD Statistic,\" July 28, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]