["About this rating", "On Dec. 17, 2017, a Sunday, the Chick-fil-A fast-food restaurant located in the Hartsfield-Jackson Atlanta International Airport opened and began to make chicken sandwiches. Chick-fil-A has traditionally been closed on Sundays. However, on this Sunday, passengers were stranded due to a power failure in the airport. In response, the fast-food restaurant chain opened to deliver free food.", "The airport's Twitter account tweeted photographs of Chick-fil-A's chicken sandwiches being handed out to passengers. Dan Cathy, chairman and CEO of Chick-fil-A, was pictured as one of the people giving out free food. Chick-fil-A's corporate headquarters is based in Atlanta, Georgia.", "Business Insider reported on the late Sunday evening opening, writing that \"Chick-fil-A broke from tradition and opened on a Sunday — and there's an incredible backstory.\"", "Hartsfield-Jackson Atlanta International Airport lost power Sunday afternoon, causing more than 1,000 flights to be grounded. As day turned to night, the city of Atlanta turned to Chick-fil-A to help craft a solution.", "Atlanta's mayor, Kasim Reed, called the fast-food chain at about 10 p.m. and asked for assistance, a company spokeswoman, Amanda Hannah, told Business Insider in an email.", "Chick-fil-A is not open on Sunday because of the founder's religious beliefs. But on this Sunday, Chick-fil-A employees \"immediately mobilized,\" Hannah said, making sandwiches and delivering them to an emergency operations center to be distributed to stranded passengers.", "Hannah also said that Chick-fil-A does \"open occasionally to serve communities in need,\" which meant that this wasn't the first time a Chick-fil-A location opened on a Sunday. The company explained its policy and detailed previous Sunday openings on the Chick-fil-A website:", "Every Chick-fil-A restaurant closes on Sundays, so Team Members are guaranteed at least one weekend day to spend outside of the restaurant. The tradition dates back to Truett Cathy’s original restaurant, The Dwarf Grill, which closed on Sundays because the diner was open 24 hours a day, and he wanted to give his team a day off to rest and to worship if they choose.", "Chick-fil-A also believes in using that day off to strengthen communities, both close to home and throughout the cities its restaurants serve. In that spirit, sometimes Operators make exceptions when their communities are in need.", "For example, in the wake of the Pulse nightclub shootings in Orlando in 2016, Team Members at Chick-fil-A Lee Vista volunteered on Sunday to feed first responders and blood donors.", "In December 2015, after tornadoes ripped through Texas, team members at several restaurants near Dallas spent their Sunday preparing and distributing free food to first responders and people affected by the tornadoes.", "The company once appeared to endorse a Sunday opening by mistake. In 2019, the company planned to back National Sandwich Day, but later backed out after realizing the special day would fall on a Sunday.", "To see how seriously Chick-fil-A takes its Sunday closures, look to the Chick-fil-A location at Mercedes-Benz Stadium, where the Atlanta Falcons NFL team plays. NFL football games are mostly played on Sundays, which means that the restaurant is closed during most home games. For Falcons games, the restaurant would only be open on Monday and Thursday nights, or perhaps for Saturday playoff games. However, the company explained that the stadium location is still open for \"about 100 events a year,\" including \"Atlanta United soccer games, concerts, college football games, high school football games, band competitions and more.\"", "Jordan Liles is a Senior Reporter who has been with Snopes since 2016.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]