["A purported text ‘transcript’ of Pacquiao's interview with Karen Davila for national news organisation ABS-CBN was published in this Facebook post on July 9, 2019.", "Below is a screenshot of the misleading Facebook post:", "The post, captioned “Hello?”, was shared more than 31,000 times but has now been taken down.", "The supposed transcript is written in a mixture of English and Tagalog. Below is the full exchange translated in English:", "MANNY: I have no degree, I only have life experiences. How about you, do you have a degree?\n\tDAVILA: Yes _ and I have been trained in many business seminars.\n\tMANNY: Good _ so how much have you earned while working for ABS-CBN?\n\tDAVILA: Why do you want to know?\n\tMANNY: Have you earned P1 billion by working with ABS-CBN?\n\tDAVILA: Not that much.\n\tMANNY: Okay _ I have no degree but I earned more than a billion pesos from my experience. So why are you insulting me in public, that you can’t even earn as much as I do?\n\tDAVILA: (Speechless)", "The post also contains two pictures separated by a dark diagonal line – one of Pacquiao and one of Davila.", "There is text in a quote balloon below Davila’s face, which translated to English says: “Do you have a college degree?”", "The same text and screenshots from the interview were shared thousands of times elsewhere on Facebook, for example here and here.", "A reverse image search on Google for the screenshot in the misleading posts found it originated from this video posted to ABS-CBN’s verified YouTube channel on February 19, 2019. The interview was produced for the news channel's programme “Headstart”.", "The screenshots in the misleading post are screenshots from that interview; a matching image of Pacquiao can be seen at the 28 seconds mark of the YouTube video.", "Below is a comparison of the picture (L) in the misleading post with the screengrab of Pacquiao (R):", "AFP contacted Regina Reyes, head of ABS-CBN’s Integrated News & Current Affairs on July 11, 2019, to request a full copy of Davila’s interview with Pacquiao, parts of which were posted on February 19 on YouTube.", "Full footage of the two-part Headstart news program was emailed to AFP on July 16. Pacquiao’s interview was about one hour in length.", "The issue about the college degree was brought up during the show when Davila asked Pacquiao, an incumbent senator, about his plans for possibly seeking a higher post in 2022. The exchange appears from 23 minues 39 seconds mark to the 27 minutes 36 seconds mark in the full interview.", "Other clips taken from the interview were also uploaded to YouTube at the time by ABS-CBN. The same section, about the college degree, can be watched here from 0:16-4:20:", "AFP has transcribed the part of the interview about Pacquiao’s college degree. Below is a full transcript, translated to English:", "Davila: Now you are going around with Inday Sara. Is that right? Is this already a prelude to 2022?", "Pacquiao: No comment. I don't know.", "Davila: But you did say, I was researching, you did say in a speech, I think you were either in Europe, one of the countries in Europe, and you did say that you were open for running for president in 2022, that you're open.", "Pacquiao: What I said is, uhm, I don't have any plan to run a higher office or I will think about it, I'm thinking about it, I'm happy to be a senator, that I can do my job and then I bring honor to our country, I'm already happy with that, that I was able to do my job. That's what's inside my heart. Thinking about higher, uhm, that's not yet on my mind.", "Davila: You're not thinking yet of running for a higher office. I mean, it's quite powerful, what Mayor Inday Sara's doing, going around every single city, province, under Hugpong, has an agreement been made, will you be open - I mean, I've been hearing that she might be president, you might be vice president, would you be open to something like that?", "Pacquiao: I'm not yet, you know currently Karen, It hasn't crossed my mind yet, of thinking about trying for 2022, no, what I'm thinking about now is the solution to our country's problems, especially economically, especially that there are so many people suffering from poverty today, our taxes are so high. The public is suffering. I'm thinking, the solution, I'm currently researching about it, studying it, and then, I'm doing a powerpoint presentation for an economics solution.", "Davila: Before we drop this, I just want to ask you, in the debates now, it's being asked, do you think a college degree is needed if one wants to be a senator, a college degree if you run for president? Do you agree with that, Manny?", "Pacquiao: For me, I do agree with it, and -", "Davila: But if that's the case, you may not qualify.", "Pacquiao: But I'm studying now.", "Davila: College degree.", "Pacquiao: Yes, I'm studying.", "Davila: Do you have a degree now?", "Pacquiao: I'm close to having one.", "Davila: Wow, okay, wait, before we, so you are finishing your college degree?", "Pacquiao: I'm studying.", "Davila: Where?", "Pacquiao: In-", "Davila: Is this a secret?", "Pacquiao: Yes.", "Davila: Ah, okay, but can you share it, so you are working on the side to gain a college degree?", "Pacquiao: What is necessary is, the most important thing is, you know the situation of the problem of our country.", "Davila: But hang on, are you finishing your college degree now or not?", "Pacquiao: I'm finishing it.", "Davila: What school?", "Pacquiao: School, wait. You may know it.", "Davila: Where is it?", "Pacquiao: Here in Manila.", "Davila: That's big news,what is the name of the school?", "Pacquiao: I'll whisper it to you later.", "Davila: So this is a secret, but you're preparing in that way.", "Pacquiao: I'm preparing. I'm the kind of person that doesn’t need to be told what to do, I do what I need to do, you know what I want to - like boxing, I'm a boxer, champion, but actually boxing is not my only sport, I play basketball, volleyball, chess, billiard, I play everything.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]