["What’s so special about chemical weapons?", "As President Barack Obama appeals to Congress to authorize a limited military strike against Syria, he has focused on intelligence that the country killed its own citizens in a chemical attack.", "Yet far more Syrians have died in the nation’s two-year-old civil war in other ways. What’s the difference?", "U.S. officials and lawmakers explain that there’s long-standing international agreement that chemical warfare simply isn’t okay.", "Democratic National Committee chairwoman Debbie Wasserman Schultz, for example, recently described a \"100-year-old international norm not to use chemical weapons.\"", "Have the world’s nations opposed such weapons since the early 1900s?", "Taboo since before they were fully developed", "Wasserman Schultz, a South Florida congresswoman, explained the president’s position in an interview Sept. 2, 2013, with CNN’s Wolf Blitzer.", "He asked her why Obama sought congressional support to punish the Syrians when previous presidents had acted without lawmakers in Grenada, Panama, Somalia, Iraq, Yugoslavia and Libya.", "\"Why do you believe it’s necessary now?\" he asked.", "\"Well, let's be clear,\" she said. \"The president … does not believe that he is required to seek Congress' authorization.\"", "Instead, she said, congressional authorization for a targeted strike would help Syrian leader Bashar Assad understand that \"his violation of a 100-year-old international norm not to use chemical weapons against either your own people or as a legitimate weapon of war will have a certain and severe response. And that he has to be held accountable for atrocities like that.\"", "A hundred years ago, the world had yet to face the horrors of World War I, when nearly 100,000 people were killed by grenades and artillery shells loaded with chemicals like chlorine and mustard gas. Nor had they experienced the million casualties that followed from chemical attacks worldwide.", "Yet, it turns out, some international agreement against gas attacks predated the war — and even full development of the weapons themselves.", "An early ban", "Wasserman Schultz’s office sent us a declaration from world powers at an International Peace Conference at The Hague — dated 1899. It banned projectiles designed to spread \"asphyxiating or deleterious gases.\"", "It was binding only among signing countries in the case of a war between two of them, and didn’t apply if a non-signing country jumped into the battle. It was worded as a limited agreement, not a moral condemnation. It came before general use of the weapons themselves.", "It was signed by more than two dozen countries, and ratified by all the major powers — except the United States.", "The American representative to the conference didn't agree to the declaration partly because he thought gas warfare, which had not yet been fully developed, was just as humane as other warfare, according to instructions to the American delegates and their official reports.", "But the Hague Declaration marked the start of international consensus on the topic, says Richard Price, a political scientist at the University of British Columbia who wrote a book called The Chemical Weapons Taboo.", "\"I think it's fair to say 'international norm' at that point,\" Price told PolitiFact.", "World War I was the first major test. Nations flunked.", "Fierce debate broke out over the reach of the ban, Price said, which restricted only projectiles, not all chemical warfare. Countries pointed fingers as thousands died in brutal chemical attacks in which victims choked and burned.", "Peace treaties, then the 1925 Geneva Conference, went much further than the Hague Declaration.", "World leaders in Geneva noted that \"the use in war of asphyxiating, poisonous or other gases, and of all analogous liquids, materials or devices, has been justly condemned by the general opinion of the civilized world.\"", "They wrote that prohibition of such weapons would be \"universally accepted as part of international law\" and appealed to the \"conscience\" of nations.", "The Geneva Protocol has since been ratified by 137 states, according to a white paper from the White House Office of Legislative Affairs provided by Wasserman Schultz’s office.", "But the United States, which pushed for the Geneva Protocol, didn't ratify it until 1975.", "Since then, chemical attacks have been rare, with just a few notable exceptions — such as Iraq’s use of them in the 1980s against Iran. Those attacks, it turned out, took place with American support.", "Syria, by the way, was among countries in agreement against chemical weapons, ratifying the Geneva Protocol in 1968.", "But Syria has been less cooperative since then, as one of the only holdouts to 1992’s Chemical Weapons Convention. (The United States actually ratified that one.) That agreement to entirely eliminate chemical weapons \"for the sake of all mankind\" includes 189 nations that represent about 98 percent of the world’s population, according to the United Nations.", "It may not be binding law for Syria, but it certainly represents an international norm, Price says.", "Our ruling", "Wasserman Schultz mentioned on CNN a \"100-year-old international norm not to use chemical weapons.\" An international peace conference at The Hague before World War I did take up the use of chemical weapons, limiting their use between world powers more than 100 years ago. But disagreement about whether their use was humane led the American representative to hold out.", "Backlash after atrocities during World War I led to even broader international condemnation in 1925, nearly 90 years ago. Yet there weren't votes in the U.S. Senate to ratify that agreement until the 1970s.", "Now most of the world agrees such weapons ought to be eliminated entirely. But it was a long slog to get there.", "World powers did reach some international agreement against chemical weapons more than 100 years ago, though the context requires some clarification. We rate Wasserman Schultz’s claim Mostly True.", "CLARIFICATION: This article was updated to reflect that though gas projectiles hadn't been fully developed for practical use at the time of the Hague Declaration, some use of chemicals as weapons predated the 1899 agreement. Also, Syria didn't ratify the Geneva Protocol until 1968.", "CQ Newsmaker Transcripts, \"DNC Chairwoman Rep. Wasserman Schultz Interviewed on CNN,\" Sept. 2, 2013, subscription only", "CNN Transcripts, \"PIERS MORGAN LIVE: Obama Administration Works to Convince Congress to Support Syria Strike,\" Sept. 2, 2013", "White House, \"Remarks by the President Before Meeting with Members of Congress on the Situation in Syria,\" Sept. 3, 2013", "White House, \"President Obama's Decision on Syria,\" Aug. 31, 2013", "White House, \"Statement by the President on Syria,\" Aug. 31, 2013", "White House, \"Government Assessment of the Syrian Government’s Use of Chemical Weapons on August 21, 2013,\" Aug. 30. 2013", "U.S. State Department, \"Protocol for the Prohibition of the Use in War of Asphyxiating, Poisonous or Other Gases, and of Bacteriological Methods of Warfare (Geneva Protocol),\" accessed Sept. 4, 2013", "Archive.org, Hague Declaration of 1899 on Asphyxiating Gases, accessed Sept. 3, 2013", "United Nations Office for Disarmament Affairs, \"CHEMICAL WEAPONS,\" accessed Sept. 3, 2013", "United Nations Office for Disarmament Affairs, \"1925 GENEVA PROTOCOL,\" accessed Sept. 3, 2013", "United Nations Office for Disarmament Affairs, \"SECRETARY-GENERAL'S MECHANISM FOR INVESTIGATION OF ALLEGED USE OF CHEMICAL AND BIOLOGICAL WEAPONS,\" accessed Sept. 3, 2013", "Organization for the Prohibition of Chemical Weapons, \"Convention on the Prohibition of the Development, Production, Stockpiling and Use of Chemical Weapons and on their Destruction (Chemical Weapons Convention),\" accessed Sept. 3, 2013", "United Kingdom’s Joint Intelligence Organisation, \"Syria: Reported Chemical Weapons Use,\" Aug. 29, 2013", "PBS Newshour, \"Obama to the NewsHour: No Decision on Syria, Taking Action on Voting Rights,\" Aug. 28, 2013", "Foreign Policy, \"Exclusive: CIA Files Prove America Helped Saddam as He Gassed Iran,\" Aug. 26, 2013", "Washington Post's Fact Checker, \"History lesson: When the United States looked the other way on chemical weapons,\" Sept. 4, 2013", "The Chemical Weapons Taboo, Richard M. Price, Cornell University Press, 1997", "Wisconsin Law Review, \"BANNING POISON GAS AND GERM WARFARE: SHOULD THE UNITED STATES AGREE?\" 1969", "Washington Post's WorldViews, \"Should the the U.S. strike Syria? These are the five smartest arguments,\" Sept. 3, 2013", "Washington Post's Wonkblog, \"‘They must be really bad if even Hitler wouldn’t use them,’\" Sept. 3, 2013", "Washington Post's Wonkblog, \"What political scientists can tell us about war, Syria and Congress,\" Sept. 3, 2013", "Organisation for the Prohibition of Chemical Weapons, \"Brief History of Chemical Weapons Use,\" accessed Sept. 5, 2013", "National Geographic, \"Chemical Warfare, From Rome to Syria. A Time Line,\" Aug. 22, 2013", "Email interview with Jonathan Beeton, communications director for Rep. Debbie Wasserman Schultz, Sept. 3-4, 2013", "Interview with Richard Price, professor of political science, University of British Columbia, Sept. 3, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]