["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A website called TeddyStick.com cited an unproven statistic about U.S. Rep. Maxine Waters, D-Calif., and her attendance record at \"congressional meetings.\" (Getty Images)", "A blog post that accused U.S. Rep. Maxine Waters, D.-Calif., of being an absentee congresswoman for decades relied on a fake statistic from a thread on Reddit.", "\"Democrat Maxine Waters Has Shown Up To Only 10% Of Congressional Meetings For 35 YEARS,\" read the headline on a June 7, 2017, post on TeddyStick.com. Facebook users flagged the post as being potentially fabricated, as part of the social media site’s efforts to combat fake news.", "The website, which doesn’t list contact information and has hidden its registration data, attacked Waters, an African-American woman, for allegedly inciting racial strife and refusing to do her job.", "The writer, who is credited on the post as Sam Di Gangi, wrote:", "\"Now the demented Democrat is looking even more foolish since an observant Reddit user known as 1tch has taken the time to gather the facts together showing that 'Over Her 35 Years In Congress Maxine Waters Has Missed 90% Of Congressional Meetings.' \"", "The source is simply a Reddit thread from June 7, 2017, which contains no evidence at all. It’s just a series of comments posted on Reddit’s \"the_donald\" forum. We contacted a Waters spokesman, who chose not to comment.", "Waters is a long-serving legislator, but she hasn’t been in Congress for 35 years. She first started representing a California district in 1991, so she’s been in Washington for 26 years. She became a state legislator in 1977 and served until joining the U.S. House of Representatives, which amounts to 40 years of lawmaking experience.", "Beyond that, it’s wrong to say Waters missed 90 percent of her \"congressional meetings,\" even though exactly how those those meetings are defined isn’t specified.", "It’s possible the post referred to her voting record, but that would be way off. As a commenter on the Reddit thread noted, GovTrack.us notes Waters has missed 7.6 percent of her votes since January 1991. That’s higher than the 2.2 percent average among all House members, but nowhere near a 90 percent absentee rate.", "The statistic also could mean all her committee meetings, but that isn’t right, either. Of course, no member of Congress attends every single hearing, but the Washington Examiner did analyze meeting records for members of Congress in 2014.", "Waters was not among the 20 highest absentee rates, which was comprised of 12 Republicans and eight Democrats. U.S. Rep. Niki Tsongas, D-Mass., came in first, missing 96 percent of hearings in the Examiner’s analysis.", "We spot-checked Waters’ 2015-16 record as ranking member of the House Committee on Financial Services, which also gives her ex officio status on a half-dozen subcommittees, meaning Waters could attend meetings for those subcommittees if she chose. By our count, Waters missed 37 percent of the hearings listed on the Government Publishing Office’s website.", "There’s no evidence Waters attended a paltry 10 percent of meetings, however you count them. TeddyStick.com used a dubious source that appeared to have just made up the stat.", "We rate this statement Pants On Fire!", "TeddyStick.com, \"Democrat Maxine Waters Has Shown Up To Only 10% Of Congressional Meetings For 35 YEARS,\" June 7, 2017", "Reddit, \"Over Her 35 Years In Congress Maxine Waters Has Missed 90% Of Congressional Meetings.,\" June 7, 2017", "Washington Examiner, \"Many House members miss more than two-thirds of their committee meetings,\" Sept. 29, 2014", "Government Publishing Office, Committee on Financial Services hearings, accessed June 14, 2017", "GovTrack.us, U.S. Rep. Maxine Waters missed votes, accessed June 14, 2017", "Interview with Twaun Samuel, Waters spokesman, June 14, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]