["The claim has been shared more than 500 times since it was published on Facebook here March 15, 2021.", "The post’s lengthy caption reads in part: “On levelling false sexual harassment allegations on the Pakistan's Pop Star Ali Zafar, his colleague Singer Meesha Shafi sentenced to three years imprisonment in a Defamation case filed by Ali Zafar three years back.”", "Superimposed text below the photos of the two pop stars reads: “Pakistani Singer Meesha Shafi Faces 3 Years in Jail for Falsely Accusing Ali Zafar of Sexual Harassment.”", "In April 2018, Shafi took to Twitter to publicly accuse Zafar of “sexual harassment of a physical nature.”", "Zafar, in return, denied the allegations on Twitter and later filed a defamation case against Shafi, as noted in a media report here.", "Meanwhile, after a dismissal from a lower court, the Pakistani Supreme Court agreed to hear Shafi’s cases, as her lawyer Nighat Dad noted on Twitter here on January 11, 2021.", "Similar posts claiming Shafi was sentenced to three years imprisonment for defamation were also shared on Facebook here, here and here.", "The claim, however, is false.", "A Google search found that Zafar’s defamation case against Shafi is still ongoing in a court in the Pakistani city of Lahore, as Dawn newspaper reported here. The next hearing is scheduled for March 27, 2021.", "The Dawn report reads: “A judicial magistrate on Thursday (March 11, 2021) summoned singer Meesha Shafi and another person in a criminal case registered under the cybercrime law against the singer on the complaint of actor-cum-singer Ali Zafar.", "“The magistrate adjourned further hearing till March 27 and issued summons for the appearance of Shafi and Maham Javed. The lawyers of the suspects were directed to come with arguments on the next hearing.”", "Shafi and her legal team also refuted the false claim that she was sentenced to three years in jail, calling it “false information” and “fake news.”", "“Another day, another campaign spreading false information,” Shafi said on Twitter here on March 15, 2021.", "Shafi’s tweet was posted as a reply to a tweet from another of her lawyers, Asad Jamal, who posted a statement condemning the false claim.", "“It is being incorrectly reported that ‘a Pakistani court has awarded three years of imprisonment to my client Meesha Shaft for causing irreparable damage to Ali Zafar’s career thanks to false allegations’,” the statement reads. “Let there be no confusion that no such verdict has been passed by any court in Pakistan.”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]