["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "When disaster strikes in Florida, Gov. Rick Scott dons his Navy cap. Scott served in the Navy back in the 1970s.", "A left-leaning veterans group used the cap as a jumping-off point in a new attack ad against Scott, saying he cheated veterans when his former health care company defrauded government health care programs. VoteVets endorsed U.S. Sen. Bill Nelson over Scott in the Nov. 6 matchup.", "\"I see Rick Scott wearing that Navy hat everywhere he goes. But let me tell you what he did to veterans,\" Navy veteran Alan Madison of Vero Beach says in the ad. \"His hospital company stole millions, defrauding the military’s health care program. Scott pled the Fifth and walked away with a fortune. And today he’s worth over 200 million bucks. But veterans like me, we got cheated.", "A few days later, Scott fired back with a TV ad featuring images of himself wearing, yep, that Navy hat as he toured damage from Hurricane Michael. (Scott joined the Navy in 1979 and served 29 months, ending as a radar technician, according to the Tampa Bay Times.)", "After touting his hurricane relief efforts, Scott’s ad pivots to Democratic opponent and Sen. Bill Nelson: \"And Sen. Nelson? Running false attack ads mocking Gov. Scott's service in the Navy.\"", "The VoteVets ad is tough, but it isn’t inaccurate. Scott’s former health care company defrauded government health care programs, including Tricare, which serves the military and their families.", "Scott is wrong to refer to it as an ad by Nelson.", "\"We have nothing to do with it,\" said Nelson spokesman Dan McLaughlin.", "The Medicare fraud case is well documented. Its connection to the military health care program is also real but has been less discussed in Scott’s political campaigns.", "Scott started what was first Columbia in 1987, purchasing two El Paso, Texas, hospitals. Over the next decade he added hundreds of hospitals, surgery centers and home health locations. In 1994, Scott’s Columbia purchased Tennessee-headquartered HCA and its 100 hospitals, and merged the companies.", "In 1997, federal agents went public with an investigation into the company, focused on whether Columbia/HCA had committed fraud of government programs.", "Scott resigned as CEO in July 1997, less than four months after the inquiry became public. Company executives said had Scott remained CEO, the entire chain could have been in jeopardy.", "During his 2010 race, the Miami Herald reported that Scott had said he would have immediately stopped his company from committing fraud — if only \"somebody told me something was wrong.\" But there were such warnings in the company’s annual public reports to stockholders, which Scott had to sign as president and CEO.", "Scott wanted to fight the accusations, but the corporate board of the publicly traded company wanted to settle. (Scott did give a deposition in 2000 in which he invoked the Fifth Amendment multiple times.)", "In December 2000, the U.S. Justice Department announced that Columbia/HCA agreed to pay $840 million in criminal fines, civil damages and penalties.", "Assistant Attorney General David Ogden spoke about the claims related to government health care programs, including Tricare.", "\"We will make sure that crime against the federal government does not pay,\" Ogden said. \"Under today's agreement, HCA is resolving civil claims that the company, generally during the 1990s, engaged in fraudulent billing practices affecting Medicare, Medicaid, the Department of Defense Tricare program and the Federal Employees Health Benefits program.\"", "The Justice Department’s announcement in 2000 stated that Columbia billed government programs for lab tests that were not medically necessary, not ordered by physicians, as well as other violations.", "The government settled a second series of claims with Columbia/HCA for $881 million. The total for the two fines was $1.7 billion, setting a record at the time. When the government announced the conclusion of the case in 2003, it again mentioned Tricare as one of the government programs defrauded by the company. (The Justice Department’s 2003 press release is shown during the VoteVets ad.)", "A Pentagon spokeswoman, Major Carla M. Gleason, told us that as a result of the federal government's settlements with Columbia/HCA, Tricare received two recovery payments — one for about $4.7 million and the other for $6.9 million. Gleason said she no longer had direct access to the case files and therefore wasn’t certain if that was the total amount of the fraud against Tricare.", "We asked the Scott campaign for any evidence to refute the allegations and why his campaign said the VoteVets ad was Nelson mocking Scott’s Navy service. Scott spokeswoman Lauren Schenone didn’t respond directly to those questions.", "\"Scott took accountability for mistakes his company made,\" Schenone said, \"and made certain every penny that was owed was paid.\"", "But Scott resigned years before the fines were settled.", "VoteVets said Scott’s \"hospital company stole millions, defrauding the military’s health care program.\"", "Scott stepped down as CEO of Columbia/HCA in 1997 as the federal government was investigating his company. A few years later, the company reached a $1.7 billion settlement with the government for defrauding Medicare and other government programs including Tricare which serves the military. A Pentagon spokeswoman said that Tricare received recovery payments in the millions.", "We rate this claim True.", "VoteVets, \"VoteVets Launches Massive $4 Million Ad Blitz in Florida Senate Race, Taking On Rick Scott's Record....and That Hat,\" Oct. 12, 2018", "VoteVets, Sen. Bill Nelson, Accessed Oct. 17, 2018", "Center for Responsive Politics, VoteVets, 2018", "USA Today, \"Florida's governor always wears this Navy hat. It's now the target of this scathing midterm ad,\" Oct. 12, 2018", "U.S. Attorney General Janet Reno, Transcript of news conference, (Accessed in Nexis) Dec. 14, 2000", "Miami Herald/Tampa Bay Times, \"Gubernatorial candidate Scott says he would have stopped Medicare fraud at Columbia/HCA if he knew,\"  Sept. 19, 2010", "Tampa Tribune, \"Scott: Politics is like business,\" May 30, 2010", "Tampa Tribune, \"GOP protests, but anti-Scott ad is fact-based; He pleaded Fifth in fraud inquiry of hospital chain,\" June 25, 2014", "New York Times, \"Columbia Ouster Costs Nearly $10 Million,\" Nov. 14, 1997", "Associated Press, \"HCA and U.S. Justice Department to settle health fraud investigation,\" Dec. 14, 2000", "New York Times, \"HCA to Pay $95 Million In Fraud Case,\" Dec. 15, 2000", "Palm Beach Post, \"Ex-workers: Scott a hands-on CEO ;", "The GOP candidate deflects questions on fraud while he led Columbia/HCA.,\" Oct. 17, 2010", "Jacksonville Business Journal, \"Ex-Columbia chief helps grow Solantic,\" April 17, 2006", "Naples Daily News, \"Naples' Rick Scott for Fla. governor?\" April 25, 2010", "United States Department of Justice press release, \"Largest Government Fraud Settlement in U.S. History,\" Dec. 14, 2000", "U.S. Justice Department, Press statement RE: HCA, Dec. 18, 2002", "U.S. Department of Justice press release, \"Largest health care fraud case in U.S. history settled,\" June 26, 2003", "New York Times, \"HEALTH CARE'S GIANT: Powerhouse Under Scrutiny -- A special report.\" March 28, 1997", "Tampa Bay Times The Buzz, In which a respected investigative reporter calls Rick Scott a creepy, amoral, Machiavellian criminal, Oct. 7, 2014", "Tampa Bay Times, \"Giant ad buy rips Rick Scott and his Navy cap,\" Oct. 12, 2018", "Tampa Bay TImes, \"Rick Scott is already using Hurricane Michael in a political ad,\" Oct. 16, 2018", "PolitiFact, \"Florida Democrats slam Gov. Rick Scott for defrauding US taxpayers,\" April 19, 2018", "PolitiFact, \"Rick Scott, former healthcare CEO, faces questions about past,\" May 20, 2010", "PolitiFact, \"Rick Scott and the fraud case of Columbia/HCA,\" June 11, 2010", "PolitiFact, \"Group’s ad attacks Rick Scott over history as Columbia/HCA CEO,\" June 15, 2010", "PolitiFact, \"Rick Scott dodges answers invoking 5th amendment 75 times, Florida Democratic Party says\"Oct. 12, 2010", "PolitiFact, \"Rick Scott claims his company caused national healthcare inflation to nosedive,\" Dec. 9, 2010", "Interview, Eric Schmeltzer, VoteVets spokesman, Oct. 17, 2018", "Interview, Dan McLaughlin, Sen. Bill Nelson campaign spokesman, Oct. 17, 2018", "Interview, Lauren Schenone, Gov. Rick Scott campaign spokeswoman, Oct. 17, 2018", "Interview, Maj Carla M. Gleason, Defense Press Operations, Oct. 22, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]