["By Eugene Kiely, Robert Farley, Lori Robertson and D'Angelo Gore", "Posted on September 13, 2018", "In a pair of early morning tweets, President Donald Trump rejected Puerto Rico’s official estimate of 2,975 hurricane-related deaths after Hurricane Maria and, in the process, made some false and misleading claims:", "With parts of the East Coast bracing for Hurricane Florence, the president in recent days has praised his administration’s handling of past hurricanes.", "At the White House on Sept. 11, Trump said his administration deserves “A-plusses” for its response last year in Texas during Hurricane Harvey and in Florida for Hurricane Irma.", "He also said the administration’s handling of Puerto Rico during and after Hurricane Maria was “incredibly successful,” although the Federal Emergency Management Agency in a July report acknowledged that it was caught short-handed when Hurricane Maria hit Puerto Rico. Emergency supplies — including water, cots and tarps — were in short supply because weeks earlier they had been diverted from Puerto Rico to help victims of Hurricane Irma.", "“In response to Hurricane Irma impacts, FEMA distributed more than 80 percent of its inventory for selected commodities from the Caribbean Distribution Center warehouse [in San Juan, Puerto Rico],” FEMA’s report said. “Hurricane Maria struck before supplies were replenished.”", "But Trump’s praise for his administration’s response to Hurricane Maria largely drew criticism from some because of the high number of estimated deaths attributed to the storm.", "On Aug. 28, the Milken Institute School of Public Health released a report estimating that there were 2,975 “excess deaths in Puerto Rico due to Hurricane Maria” over about a six-month period, from September 2017 through the end of February 2018.", "“The President keeps adding insult to injury and I think his words are despicable,” San Juan Mayor Carmen Yulín Cruz told CNN. “He says he has done a good job when 3,000 people have died.”", "On Sept. 13, Trump rejected Puerto Rico’s official estimate in two early morning tweets.", "3000 people did not die in the two hurricanes that hit Puerto Rico. When I left the Island, AFTER the storm had hit, they had anywhere from 6 to 18 deaths. As time went by it did not go up by much. Then, a long time later, they started to report really large numbers, like 3000…", "— Donald J. Trump (@realDonaldTrump) September 13, 2018", "…..This was done by the Democrats in order to make me look as bad as possible when I was successfully raising Billions of Dollars to help rebuild Puerto Rico. If a person died for any reason, like old age, just add them onto the list. Bad politics. I love Puerto Rico!", "— Donald J. Trump (@realDonaldTrump) September 13, 2018", "Let’s get some of the easy stuff out of the way, beginning with the president’s criticism of the Democrats and the report’s methodology.", "It’s not true that the higher death estimate “was done by the Democrats in order to make [Trump] look as bad as possible.” It was an independent study commissioned by Puerto Rico and undertaken by researchers at George Washington University’s Milken Institute School of Public Health.", "In February, Puerto Rico announced that the Milken Institute School of Public Health would lead a study of “deaths associated with Hurricane Maria after its passage through the Island.”", "At the time, Puerto Rico had estimated that there were 64 deaths caused by Hurricane Maria, but the estimate was considered low because of the lingering effects that the hurricane had on the island. For example, nearly half of Puerto Rico’s residents were still without power at the end of the year — more than three months after the devastating storm had passed.", "“The methodology will seek to analyze all data available related to mortality, including death certificates, to determine how many more deaths than usual could be related to the hurricane,” Puerto Rico said in announcing the study.", "Trump also misrepresented the study’s methodology, claiming it counted deaths “for any reason, like old age.”", "The researchers did an “excess mortality study,” which takes into account the usual number of deaths that could be expected from September 2017 through February 2018. The 2,975 figure is the estimated number of “excess” deaths that researchers say occurred during that time.", "Table 1 of the report shows the number of “observed,” “predicted” and “excess” number of deaths during the post-hurricane period. There were 16,608 “observed” deaths and 13,633 “predicted” deaths — meaning that 2,975 “excess deaths” were “related to Hurricane Maria.”", "The “predicted” number of deaths was based on “past mortality patterns,” including deaths and population, from 2010 to 2017. People dying of “old age,” as Trump put it, would be part of the “predicted” number, not the “excess” number.", "The 2,975 figure is not an exact count of hurricane-related deaths. But the researchers said they are 95 percent confident that the number of direct and indirect deaths falls between 2,658 and 3,290.", "In his tweet, the president ignored the number of indirect hurricane-related deaths that occurred after the storm, as opposed to those directly caused by the storm.", "Trump recalled that when he visited Puerto Rico after the hurricane there were “anywhere from 6 to 18 deaths” caused by the storm. That’s not wrong. Hurricane Maria made landfall on the island on Sept. 19, 2017, and Trump visited Puerto Rico on Oct. 3, 2017. At the time, he was told that the death toll stood at 16. He said to those in attendance that they should be “very proud” of the number of deaths compared with those caused by Hurricane Katrina.", "“If you look at the — every death is a horror,” he said. “But if you look at a real catastrophe like Katrina, and you look at the tremendous hundreds and hundreds and hundreds of people that died, and you look at what happened here with, really, a storm that was just totally overpowering — nobody has ever seen anything like this.”", "After all this time, however, we now know that the death toll was much higher than 18. As we said, the official death toll as of February was 64 deaths — but even then the number was considered too low.", "In an April report, the National Hurricane Center said the death toll in Puerto Rico was “highly uncertain” and there could be hundreds of direct and indirect hurricane-related deaths.", "“In Puerto Rico, the death toll is highly uncertain and the official number stands at 65, which includes an unknown number of indirect deaths,” the report said. “It should be noted that hundreds of additional indirect deaths in Puerto Rico may eventually be attributed to Maria’s aftermath pending the results of an official government review.”", "Katrina is a good example of the uncertainty associated with documenting deaths from hurricanes.", "For example, the National Hurricane Center in December 2005 — several months after the storm — issued a report on Katrina that put the death toll at 1,833 (about 1,500 directly related to Katrina and several hundred indirectly) in five states. That estimate was based on “reports to date from state and local officials in five states.” (That figure has since been revised down to 1,100.)", "Other research has produced different numbers.", "Louisiana State Epidemiologist Raoult Ratard co-authored a study with researchers from the Centers for Disease Control and Prevention and concluded, in a paper published in August 2008, that there were 971 Katrina-related deaths in Louisiana and 15 deaths among Katrina evacuees in other states. (A follow-up study also co-authored by Ratard revised the number to 1,170.) Both studies analyzed death certificates and autopsy reports as well as the Disaster Mortuary Operational Response Team’s confirmed victims database for the two months immediately after the storm. Drowning was the most common cause of death (40 percent), followed by injury and trauma (25 percent) and heart conditions (11 percent).", "But in a phone interview, Ratard told us that methodology might not be the best to use to gauge storm-related deaths in Puerto Rico.", "The storms in Louisiana and Puerto Rico are “two different situations,” Ratard told us, and so comparing the methods used to track deaths doesn’t make sense. In Louisiana, many people evacuated shortly after the storm, making it difficult for researchers to track long-term effects of the storm. And so, he said, they stuck to documenting what happened during the flood and the immediate aftermath.", "In Puerto Rico, the situation was different, Ratard said. No one could evacuate. So it’s entirely appropriate, he said, to look at the mortality rates in the months after the storm and compare them to similar periods in past years.", "“I can see why they used the methods they used,” he said. “In Puerto Rico, it was easier to document the long-term impact.”", "“My impression is that they have a valid point in estimating the long-term effects” in Puerto Rico, he said. From what he knows about the research, he said, “it sounds reasonable to me.”", "Although Trump ignores the indirect deaths attributed to Hurricane Maria, the National Hurricane Center is interested in indirect deaths and makes an attempt to count them.", "In August 2016, Edward N. Rappaport, the deputy director of the NHC, and B. Wayne Blanchard, then with FEMA, wrote about indirect deaths in the journal of the American Meteorological Society. They wrote that “direct deaths do not tell the whole story. They do not include the important class of indirect fatalities–casualties that, while not directly attributable to one of the physical forces of a tropical cyclone, would not be expected in the absence of the storm. These losses can occur in significant numbers.”", "John Mutter, professor of earth and environmental sciences and of international and public affairs at Columbia University, has studied the impact of natural disasters and the death toll of Hurricane Katrina. Mutter told us that it’s difficult to measure the death toll from hurricanes for several reasons, including deciding when to start counting and when to stop, and whether various deaths should be considered hurricane-related. “A lot of people die from the exacerbation of preexisting conditions,” particularly the elderly, he said.", "People also go missing, and a lot of people can die in the aftermath. But how long should the “aftermath” be?", "“There are no rules about this,” Mutter said, “no uniform standard on when you start or when you stop.”", "But both of the experts we interviewed said the methodology used by the researchers at the Milken Institute School of Public Health was reasonable — contrary to the president’s tweet questioning the high death toll estimate, the methodology used by the researchers and the motivation of the Puerto Rico government in seeking the best estimate.", "Mutter said the study was using “tried and true methodologies” to get an estimate, which will have some admitted uncertainty. Such statistical models are often used in estimates of civilian casualties in conflicts, he said.", "In a statement, the Milken Institute School of Public Health stood by its “state-of-the-art mathematical model” and the findings that it produced. Hurricane Maria was “a very deadly storm” and “the number – 2,975 – is the most accurate and unbiased estimate of excess mortality to date,” it said.", "It’s not clear what Trump meant when he wrote, “I was successfully raising Billions of Dollars to help rebuild Puerto Rico.” We didn’t receive a response to emails we sent to the White House for clarification.", "The federal government certainly has appropriated billions of dollars in disaster relief for Puerto Rico. In June, the Puerto Rico newspaper El Nuevo Día reported that “promised federal allocations” for the U.S. territory “total about $31.6 billion,” according to its analysis. The majority of that — about $20 billion— was awarded by the Department of Housing and Urban Development through its Community Development Block Grant — Disaster Recovery Program.", "At the time, El Nuevo Día noted that the amount appropriated by the government was about one-third of the $94.4 billion that Puerto Rico estimated in November it would need to rebuild. Then, in August, the island increased its request to Congress to $139 billion.", "In addition to those federal funds, Trump’s inauguration committee announced late last September that it was donating $3 million to three different charities involved in the hurricane relief efforts. That was not long after the Associated Press reported that the committee, which had raised $107 million for Trump’s inauguration ceremonies, had not donated any of its leftover money to charity, as it had pledged to do.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]