["About this rating", "In November 2016, the Collin's Dictionary included the term \"snowflake generation\" as one of its top ten words of the year (although technically, this is a phrase, not a word). It came with the following definition:", "noun: the young adults of the 2010s, viewed as being less resilient and more prone to taking offence than previous generations", "Not long afterward, internet rumors appeared asserting that the etymology of the word \"snowflake\" (at least, as a semi-pejorative term rather than the politically neutral word for an an actual flake of snow) actually dates back to World War II, when it was used by Nazi soldiers to refer to the human remains of people who were incinerated in crematoriums:", "The term was not included in the Holocaust Encyclopedia provided by the United States Holocaust Memorial Museum, and while the word \"snowflake\" was repeatedly found in the Museum's archive collection, it was never used in the manner described above.", "The United States Holocaust Memorial Museum told us that they were not familiar with Nazi soldiers using the term \"snowflake,\" and  the education team at the Illinois Holocaust Museum also said that they were unaware of the term being used during the Holocaust.", "So where did this rumor come from? The only source we could find that identified \"snowflake\" as a Nazi term was the \"Racial Slur Database\":", "Slur: Snowflake.\nRepresents: Jews.\nReasons & Origins: When they would burn the Jews and the ashes would come out the smoke stacks. (See Schiendler's List)", "However, this entry is unreliable. The Racial Slur Database carries a disclaimer at the bottom of the web site stating that the entries were created \"entirely from data gleaned off the 'net and via submissions from people like you and your parents. It's supposed to be funny and/or informational. Calm down.\"", "While the movie Schindler's List did include a scene where human remains fall from the sky like snow, nobody used the term \"snowflake\" to derisively refer to people who were killed and cremated:", "The 1999 movie Fight Club, based on the 1996 book of the same name, may have been where the derisive term \"snowflake\" originated:", "“You are not special. You're not a beautiful and unique snowflake. You're the same decaying organic matter as everything else. We're all part of the same compost heap. We're all singing, all dancing crap of the world.”", "Emily Brewster, lexicographer and associate editor at Merriam-Webster, said that \"snowflake\" has been used as an insult since the Civil War, but evolved from a different context and never had anything to do with Germany's National Socialists party:", "“A snowflake was a person who was opposed to the abolition of slavery,” Brewster said. “They were called snowflakes because it said they valued white people over black people.”", "A related derogatory term, \"snowball,\" appears in in Bartlett’s Dictionary of Americanisms from 1848, but again, has nothing to do with Nazi Germany:", "“Snowball” was also used as a term for a black person, (lexicographer Jonathon) Green said, as far back as the 1780s; Bartlett’s Dictionary of Americanisms from 1848 defines snowball as “a jeering appellation for a negro.” For a time, snowflake and snowball were used interchangeably in this manner. “It’s this thing about, ‘ha, ha, ha, here’s a black person, let’s call him something white,’” said Green. And even as snowflake and snowball were used in technically non-racial contexts, like as slang for cocaine, “it’s [still] to do with the whiteness.”", "We have found no record of the term \"snowflake\" being used by Nazi soldiers in reference to human remains.", "Stolworthy, Jacob.   \"Collins Dictionary's 10 Words of the Year, From 'Brexit' and 'Snowflake Generation' to 'JOMO.'\"\r\n    Think Progress.   3 November 2016.", "Goldstein, Jessica.   \"The Surprising History of ‘Snowflake’ as a Political Insult.\"\r\n    Think Progress.   19 January 2017.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]