["About this rating", "On 15 April 2016, the World News Daily Report (WNDR) web site published an article reporting that scientists in North Carolina had successfully created \"the first fully living dinosaur embryo in millions of years\" using DNA from chicken skin:", "A 68 million-year-old DNA sample retrieved from soft tissue cells found in a recently excavated pregnant Tyrannosaurus Rex fossil has led researchers at North Carolina State University to produce the first fully living dinosaur embryo in millions of years.", "The pregnant Tyrannosaurus Rex’s DNA, that was preserved in “extremely good condition” according to experts, was introduced into the skin cells of a chicken, a modern relative to the Tyrannosaurus Rex.", "“We often think of the T-Rex as this huge crocodile-like bipedal reptile but in fact, its closest modern relative are birds and the T-Rex was actually the dinosaur equivalent of a chicken” explains Linda Rushmore, head researcher at the North Carolina Museum of Natural Sciences’ Paleontology Research Lab.", "“The similarity of both DNA’s actually surprised us at first and we are extremely enthustiac about the positive results and growth of the embryo,” she adds.", "World News Daily Report is a fake news site, and the story was completely fabricated, but the article gained enough traction online (including being copied and reproduced by multiple websites which included no disclaimers) that the North Carolina Museum of Natural Sciences published a statement informing the public that it was a hoax:", "A recent “news story” falsely reports an account of the recreation of a Tyrannosaurus rex embryo in the Paleontology Research Lab of the NC Museum of Natural Sciences. This story is a complete fabrication and the personnel cited in the report are, as far as we can tell, made up. For accurate information regarding dinosaur DNA research, check out this blog post:", "https://news.ncsu.edu/2016/03/dino-dna/.", "WNDR typically attaches unrelated images to fictional clickbait headlines to generate traffic from social media shares. In this case, their photo of  of \"French bioethicist Jacques Clement\" was in fact a photograph of University of Washington's associate professor of genome sciences John Stamatoyannopoulos, and their picture of the \"Paleontology Research Lab\"  where the T. rex cloning was supposedly carried out was just a Getty Images stock photograph. And the overall story was simply a rehash of one of several dinosaur cloning hoaxes to circulate on social media in recent years.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]