["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Former president Jimmy Carter said in 2017 that he voted for Bernie Sanders during the 2016 primary.", "Carter has not endorsed Sanders, or any other candidate, so far in the 2020 presidential primary.", "Has former President Jimmy Carter endorsed Bernie Sanders for president in 2020?", "No.", "We came across the false claim in a blog post that’s been circulating recently on social media. Its headline says: \"FORMER PRESIDENT JIMMY CARTER HAS ENDORSED BERNIE SANDERS.\"", "Carter supported Sanders’ bid in 2016, but he did not formally endorse him during his run then and has not endorsed any candidate so far in the 2020 presidential primary.", "The blog post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The post, published by a blog called \"Liberty Inquiries\" on March 7, 2020, is almost entirely taken from a 2017 story about Carter’s previous support for Sanders.", "That story, published by website Talking Points Memo, reported on Carter’s disclosure that he voted for Sanders during the 2016 Democratic primary.", "In May 2017, Sanders joined Carter for a discussion at the Carter Center in Georgia. At one point during the event, Carter says: \"Can y’all see why I voted for him?\"", "But the recent blog post being shared on Facebook falsely plants Carter’s comment as a 2020 endorsement for Sanders, changing a line from the 2017 article, which originally said: \"Carter previously stayed mostly mum about the 2016 election\" to \"Carter previously stayed mostly mum about the 2020 election.\"", "Years ago Carter said he voted for Sanders in the 2016 primary. He has not endorsed him, or anyone else yet, in 2020.", "Pants on Fire!", "Archive.is, FORMER PRESIDENT JIMMY CARTER HAS ENDORSED BERNIE SANDERS, March 7, 2020", "Talking Points Memo, Jimmy Carter Reveals That He Voted For Bernie Sanders In Democratic Primary, May 9, 2017", "CSPAN, Human Rights discussion, May 8, 2017", "FactCheck.org, Carter Hasn't Endorsed in 2020 Primary, March 10, 2020", "Daily Beast, Jimmy Carter Reveals He Voted for Bernie Sanders in Democratic Primary, May 9, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]