["About this rating", "In March 2018, a false (and potentially harmful) viral message spread around WhatsApp groups and social networks in India, warning recipients of an impending major earthquake in and around the capital city of Delhi.", "The message, which was riddled with spelling and grammatical errors, typically went something like this:", "According to NASA, the biggest earthquake will hit Delhi soon. The Rector's [sic] Scale is 9.1 or may be 9.2.\nDate has not cleared yet but it may occur in Between 7th of April to 15th April.\nLoss of life has declared in Lacs [millions].\nThe Centre of This Biggest rector's [sic] scale earthquake would be Gurugram.\nThis is the 2nd time in World's History that huge loss of life and property has declared by NASA.\nThis is biggest Earthquake may occure [sic] in Delhi NCR [National Capital Region].\nSpread to all your relatives or friends who stay in Delhi NCR.\nThis earthquake will be the largest as it covers the areas like In India ( Delhi, Haryana, Punjab, J&K to Tamilnadu, Rajasthan to Bihar.\nIn Pakistan Rector's Scale would be 4-4.2 maximum. \nIf possible move at least for a week from Delhi NCR. \nGovt will take action very soon on This to save life of People.", "Even with such glaring mistakes, the message still managed to trick some recipients into thinking it was real; according to Mumbai-based Times Now News, it was shared widely in WhatsApp groups in India before moving on to social media.", "In reality, NASA did not issue any warning about an earthquake hitting India in April 2018, because no earthquake prediction exists (although seismic alarms can and do save lives, but that is a matter of seconds rather than days or weeks). As the United States Geological Survey explains:", "Neither the USGS nor any other scientists have ever predicted a major earthquake. We do not know how, and we do not expect to know how any time in the foreseeable future. An earthquake prediction must define 3 elements: 1) the date and time, 2) the location, and 3) the magnitude.", "Yes, some people say they can predict earthquakes, but here are the reasons why their statements are false:", "An earthquake measuring 9.1 or 9.2 on the Richter scale (not \"Rector's\") would rank among the largest in recorded history, according to USGS data, so it's perhaps not surprising that some people were concerned enough about the well-being of their friends and family to share the alert.", "It's not clear what the origins of the hoax were, or whether it was intended simply as a prank or with more malicious motivations in mind. The Delhi urban area has a population of around 26 million people and a sudden mass exodus could potentially have serious consequences.", "Times Now.  \"Viral WhatsApp Message Claims Delhi To Be Hit By a 9.1 Magnitude Earthquake -- What's the Truth?\"\r\n  Times Now.  21 March 2018.", "U.S. Geological Survey.  \"FAQs -- Can You Predict Earthquakes?\"\r\n  U.S. Geological Survey.  Unknown publication date.", "U.S. Geological Survey.  \"20 Largest Earthquakes in the World.\"\r\n  U.S. Geological Survey.  Unknown publication date.", "United Nations.  \"The World's Cities in 2016.\"\r\n  United Nations.  2017.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]