["The Facebook page behind the adverts calls itself Government Jobs Application Page and has been running since 19 November, 2018. We've archived it here. It has no shortage of followers -- more than 84,000 as of 23 December, 2019.", "The company address is listed as 1402 Voortrekker Road in Durban, KwaZulu-Natal. As the Google Street Map below shows, Voortrekker road ends in a cul-de-sac at number 333.", "The neighbourhood is less than nine kilometres (six miles) from the southern point of Durban harbour and is dominated by heavy industry, chemical factories, warehousing and various manufacturing businesses.", "A message sent to the listed mobile number was returned as “failed”.", "There is scant information in the “About” section of the Facebook page and the website address in the header (www.rsajobseekers.com) does not work.", "Since last year, however, the page has posted prolifically, each time calling on people to apply for a host of jobs in the private and public sector. See examples here, here and here.", "The adverts follow a cookie-cutter format: most of the jobs are for unskilled positions such as till operators, packers, cleaners, drivers and general workers; candidates need only have some high school education; and salaries tend toward lower-income brackets.", "It is strikingly similar to this AFP fact check a month ago.", "Among the companies mentioned are major supermarket and clothing chains Pick n Pay, Shoprite, Pep, Spar and Woolworths, fast-food outlets like KFC and Hungry Lion, government departments and Coca Cola, to name a few.", "Typically, a post asks people to respond in the comments with a particular word or phrase to indicate their interest, with the promise that they will further be contacted with instructions to apply.", "Otherwise, job hunters are directed to a link that clicks through to an application form on a website with the domain www.careerhost24.com -- that has since been taken down.", "The broken URL is similar to a legitimate jobs directory in South Africa called www.careers24.com.", "Woolworths, Shoprite and Pick n Pay, all three large multinational food and clothing retailers, told AFP the jobs published under their company names were fake.", "Pick n Pay, once it was alerted to the Facebook page, added a warning to its own website, calling the jobs promotion a “scam”.", "Shoprite, in a statement, confirmed it had “no association” with the Facebook page in question and added that it would never ask a candidate to pay a fee to apply for a job.", "“Anyone requesting such a fee is not doing so on behalf of the Shoprite Group and is not operating with our knowledge or consent,” said the company.", "“We would advise that online users (or job applicants) only use reliable sources or rather refer to the Careers section on our website to be sure that the information that they are accessing is authentic and current. Good consumer advice will always be to not provide personal details to an unknown third party.”", "A Woolworths corporate press officer said “their” advert was fake, adding: “Our ‘seasonals’ closed two months ago; we never have open ads or put salaries on our ads.”", "The apparent abundance of work advertised on the discredited recruitment page jars with the true economic situation in South Africa.", "The country’s official unemployment rate remains stubbornly high and was measured at 29.1 percent in the third quarter of 2019, according to the national statistics agency, Stats SA. The expanded unemployment figure, which takes into account discouraged job seekers, was unmoved from the previous quarter at 38.5 percent (see screenshot below).", "Just last month, a report by TimesLIVE quoted Transnet -- the state-owned logistics giant that also featured on the Facebook page -- extensively in a story that offered tips on how to avoid falling for job scams.", "Jobs portal jobs.co.za also has this warning on its website. It says scammers use well-known companies as part of the deception because these brands are seen as credible.", "The ultimate goal, it says, is either to get a victim to hand over personal details in order to steal their identity or to part with money in exchange for the empty promise of a job.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]