["By Lori Robertson", "Posted on April 19, 2017", "President Donald Trump blamed the Obama administration for allowing “bad MS 13 gangs to form in cities across U.S.” due to “weak illegal immigration policies.” The MS-13 gang was formed in Los Angeles in the 1980s and had spread across the country years before Barack Obama was elected president.", "Trump made the claim in an early morning tweet April 18:", "The weak illegal immigration policies of the Obama Admin. allowed bad MS 13 gangs to form in cities across U.S. We are removing them fast!", "— Donald J. Trump (@realDonaldTrump) April 18, 2017", "Later that day, Attorney General Jeff Sessions also cited the MS-13 gang in remarks about efforts to combat transnational criminal organizations, claiming that the gang “now has more than 10,000 members in at least 40 states in this country – up significantly from just a few years ago.” But the FBI has been using the 10,000 estimate for years, as early as 2006.", "It’s certainly possible that MS-13 membership has increased either recently or since 2006, but the Justice Department was unable to provide numbers showing that. Nora Scheland in the FBI’s national press office told us in an email that she had “no further data and no year-by-year data that I can provide” beyond the estimate of 10,000 “MS-13 members and associates.”", "Trump claimed that the Obama administration “allowed” MS-13 to “form in cities” across the country, but its origins and spread date back much earlier than Obama’s time as president.", "We asked the White House press office for support for the president’s claim, but we have not received any.", "The gang called MS-13, or Mara Salvatrucha, originated in Los Angeles in the 1980s, according to several accounts, at a time when El Salvador was embroiled in a civil war.", "A 2005 National Gang Threat Assessment report by the National Alliance of Gang Investigators Association and funded by the Justice Department said that the “primarily El Salvadoran” gang “formed in the Rampart area of Los Angeles, which was heavily populated by Mexican-American gangs. After being constantly victimized by the dominant Mexican gangs, El Salvadoran immigrants banded together for protection, thus enlarging their membership and force. The group called itself Mara Salvatrucha, or MS, and as it grew in size, it aligned with the Mexican Mafia under the Los Surenos umbrella.”", "A Congressional Research Service report, updated in 2008, explained that “[t]he more recent emergence, growth, and expansion of two Latino street gangs, the Mara Salvatrucha (MS-13) and the 18th Street Gang (also known as the Mara 18 or M-18), have raised concern among policy makers for several reasons,” including whether the gangs were becoming transnational criminal organizations. CRS explains the origins of MS-13 as the 2005 threat assessment does:", "CRS report, “The MS-13 and 18th Street Gangs: Emerging Transnational Gang Threats?” updated Jan. 30, 2008: During this period [1980s], thousands of Salvadorans fled the civil war in their country. By the end of the 1980s, some estimates indicate that more than 300,000 Salvadorans had settled in Los Angeles. One hypothesis on the gang formation asserts that Salvadorian immigrants during this period banned together and formed the MS-13 gang. MS-13’s early membership is reported to have included former guerrillas and Salvadoran government soldiers whose combat experience during the Salvadoran civil war contributed to the gang’s notoriety as one of the more brutal and violent Los Angeles street gangs. Moreover, the gang developed a widely reported reputation of employing unusual methods of violence, including using machetes in gang attacks. Despite the gang’s reputation, sources in law enforcement indicate that little evidence exists to substantiate that the MS-13 gang is more violent than other street gangs.", "By the time of the 2005 threat assessment report, the gang had spread across the U.S. Since the 1980s, the report said, “the gang has successfully migrated from southern California to the East Coast, establishing a significant presence in Virginia, Maryland, North Carolina, and New York.”", "Washington, D.C., and its suburbs were of particular concern. The report described MS-13 as “one of the newest threats to the [South] region, especially in Washington, DC, Virginia, and the surrounding areas.”", "The previous year, in December 2004, in fact, the FBI had formed the MS-13 National Gang Task Force to “counteract this growth” of the gang. The task force’s focus was on “maximizing the flow of information and intelligence, coordinating investigations nationally and internationally, and helping state and local law enforcement improve operations and prosecutions targeting MS-13.”", "That was, of course, four years before Obama would be elected president.", "The CRS report, too, says MS-13 had “established presence in Washington DC; Northern Virginia; certain cities in Maryland; Nashville, Tennessee; New York, New York; Houston, Texas; and other rural and urban areas.”", "While MS-13 was spreading from Los Angeles to other parts of the United States, it was also spreading in Central America.", "“It’s a Los Angeles export,” says Jorja Leap, a professor in the University of California at Los Angeles’ Luskin School of Public Affairs and author of the book, “Jumped In: What Gangs Taught Me about Violence, Drugs, Love and Redemption.” Leap, whose research focuses on gangs and high-risk youth, told us MS-13 members went back to Central America and “found very fertile ground” to expand there.", "A 2005 Heritage Foundation report on the spread of MS-13 and the 18th Street Gang (or Calle 18, in Spanish) said that “Oscar Bonilla, president of El Salvador’s National Council for Public Security, which manages delinquent rehabilitation programs, believes that Salvatruchas showed up as deportees as early as 1992, and Calle 18 members began arriving in 1996,” settling in “capital city slums and former guerrilla strongholds.”", "The 2005 gang assessment and a Los Angeles Times investigation published the same year say that an unintended complication of deportations was the spread and cross-border activities of the gang.", "“Newly organized cells in El Salvador have returned to establish strongholds in metropolitan Washington, D.C., and other U.S. cities,” the Oct. 30, 2005, L.A. Times report said. “Prisons in El Salvador have become nerve centers, authorities say, where deported leaders from Los Angeles communicate with gang cliques across the United States.”", "Here’s the 2005 report’s explanation of the problem:", "2005 National Gang Threat Assessment: Another aspect of Hispanic gang membership impacting law enforcement efforts concerns implications rising from illegal immigrant arrests and deportation. Deported individuals often maintain their ties to gangs in the United States, resulting in the extension of criminal enterprises into other countries. Hispanic gang members find it easier to access drugs and weapons in their home countries and courier the items back to the Untied States rather than to conduct their operations within the United States. U.S. currency used to pay for drugs and weapons is easily exchanged and has a much higher value in many foreign countries.", "Leap, however, cautions that poverty is the root cause of gangs, not immigration. “It’s no surprise that gangs are developing in Central America” in impoverished areas, she says. “As long as people are poor we’re going to have gangs.”", "Leap told us what causes gangs to flourish isn’t immigration policy, as Trump claimed, but economics.", "“Gangs do not flourish because of weak immigration policies. Gangs flourish because of economic disenfranchisement. It’s a money thing, not an immigration thing,” she says.", "In fact, the 2005 Heritage Foundation report recommended “anti-gang strategies” that targeted “root social processes as well as sanction criminal behavior.” In addition to reducing illegal immigration, particularly through better controls of foreign workers, the conservative think tank recommended strengthening neighborhoods and providing prevention and family programs domestically — and internationally, sharing information among law enforcement and supporting more robust economies.", "Those types of efforts were launched under the George W. Bush administration and continued under Obama’s. A 2008 Department of Justice fact sheet lists several initiatives, including school- and neighborhood-based programs and international law enforcement coordination. In 2005, First Lady Laura Bush spearheaded a three-year initiative to keep boys out of gangs. In October 2012, the Obama administration’s Treasury Department designated MS-13 as a “transnational criminal organization,” giving authorities the power to block and seize the gang’s financial assets.", "And in January 2016, the FBI wrote about how the FBI and State Department had sponsored six Central American Law Enforcement Exchange programs since 2009, the FBI said, to bring together international law enforcement personnel working on gang violence, in particular by MS-13 and the 18th Street Gang.", "MS-13 is still active. In one high-profile case, 13 MS-13 members were indicted in early March for seven murders that occurred over the last three years in Long Island. CNN reported that since September 2016, 125 MS-13 members have been arrested, according to the Suffolk County police commissioner.", "Attorney General Sessions also claimed in remarks to the Organized Crime Council on April 18: “According to the National Gang Intelligence Center, MS-13 now has more than 10,000 members in at least 40 states in this country – up significantly from just a few years ago.” But the Justice Department was unable to provide any historical numbers showing this “significant” increase.", "The DOJ press office first referred us to a January 2008 FBI assessment of MS-13 that used similar figures: “MS-13 operates in at least 42 states and the District of Columbia and has about 6,000-10,000 members nationwide,” the FBI page said.", "In fact, the FBI used the 10,000 estimate two years earlier, in 2006, and later, in 2009. The 2008 CRS report we referred to earlier cited an estimate of 8,000-10,000 for 2005, referring to the 2005 National Gang Threat Assessment as the source in a footnote. (We did not find those figures in the 2005 report, however.)", "It’s certainly possible that the number of MS-13 gang members in the country has grown, but we could find no available figures to back-up Sessions’ claim that 10,000 current members in 40 states is “up significantly from just a few years ago.” What we did find shows the FBI has been using a similar estimate for at least a decade.", "Leap, at UCLA, cautioned us that accurate data on gang membership was difficult if not impossible to come by. “The membership of any gang is a moving target,” she said, explaining that there are people who claim membership simply to show off, people who are affiliated but not active members, former members who left the gang and then actual active gang members.", "We told the DOJ press office that it appeared the 10,000 figure had been a longstanding estimate from the FBI. We asked if there were yearly estimates available or if gang membership was difficult to precisely measure. Spokesman Peter Carr responded that it was the latter — “difficult to precisely measure.”", "As we said earlier, the FBI press office told us that it could provide no figures beyond the 10,000 estimate.", "The 2015 National Gang Threat Assessment report, published by the NGIC, says that street gangs overall “continue to impact communities across the United States and do not show signs of decreasing membership nor declining criminal activity.” It said that according to a survey of law enforcement agencies, “street gang membership increased in approximately 49 percent of jurisdictions over the past two years, stayed the same in 43 percent, and decreased in about eight percent of jurisdictions.” But the report included no hard numbers for membership overall, or membership in specific gangs. A footnote said: “For detailed information on membership numbers, the NGIC recommends contacting state and local law enforcement agencies directly.”", "Sessions didn’t mention the Obama administration in his remarks, and a fact sheet issued by the department on April 18 said that “great progress was made diminishing or severely disrupted [sic] the gang” in certain areas in 2009 and 2010.", "But Sessions also said in his remarks: “Because of an open border and years of lax immigration enforcement, MS-13 has been sending both recruiters and members to regenerate gangs that previously had been decimated, and smuggling members across the border as unaccompanied minors.” The DOJ spokesman said that information came from NGIC intelligence and a variety of court cases, pointing to six examples.", "Five of those cases originated during the Bush administration and one under Obama.", "One case the DOJ referred us to involves a June 2008 indictment and March 2011 sentencing of seven North Carolina MS-13 members on several charges, including racketeering, murder and cocaine trafficking. The DOJ press release said that evidence at the trial showed the gang members’ racketeering enterprise, begun in 2003, had “communicated with its leadership in El Salvador” and that one of those convicted “was sent by MS-13 leaders in El Salvador to run what members called ‘The Program’ in the Charlotte and Greensboro, N.C.-areas.”", "And in July 2014, José Juan Rodriquez-Juarez, along with 11 other MS-13 “top-ranking members” were indicted in New Jersey on racketeering, drug trafficking and other crimes, according to a DOJ press release. Rodriquez-Juarez allegedly was the leader of MS-13’s “national program,” which sought to create a leadership structure for all of the local MS-13 gangs in the U.S. and coordinated the effort with MS-13 leaders in El Salvador.", "We are in no way diminishing the danger posed by MS-13 in some communities in the U.S. As we mentioned earlier, 13 members of the gang were also recently indicted for murders on Long Island. But the president gets the history of the gang wrong in claiming it spread “in cities across U.S.” during Obama’s time in office, and there’s no support for Sessions’ claim that the estimate of 10,000 gang members is “up significantly from just a few years ago.”", "FactCheck.org Rating:", "Read More", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]