["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Julian Castro, former secretary of Housing and Urban Development, and candidate for the 2020 Democratic presidential nomination, speaks during a town hall meeting at Grand View University, Feb. 21, 2019, in Des Moines, Iowa. (AP Photo/Charlie Neibergall)", "Julián Castro, seeking the Democratic nomination for the 2020 presidential election, is proposing sharp changes to immigration laws in a stark contrast with President Donald Trump’s policies.", "Castro used to be mayor of San Antonio, Texas, and he served as Housing and Urban Development secretary in the last few years of the Obama administration. In an online post, he recounted his family’s migrant background, criticized Trump’s \"zero tolerance\" immigration policy, and advocated for a pathway to citizenship for the estimated 11 million people living in the United States illegally.", "Castro emphasized what he said is a little-known but significant policy, Section 1325, \"central to today’s inhumane and flawed immigration system.\" The law dates back to the 1920s and got a new push during George W. Bush’s presidency, he said.", "\"These laws got a new life in 2005, when the Bush administration decided to charge those that crossed the border with criminal violations, rather than civil ones,\" Castro wrote in a Medium post published April 1.", "Did Castro accurately characterize the Bush administration’s practice?", "We found that some immigrants were prosecuted for improper entry even before 2005. But in 2005 the Bush administration did launch a program to prosecute most immigrants before deporting them. Castro’s statement is accurate but needs clarification.", "8 U.S. Code Section 1325 lays out legal consequences for immigrants who enter or attempt to enter the United States at a time or place not designated by immigration authorities; who elude examination or inspection by immigration officers; and who enter or attempt to enter under false pretenses.", "For the first commission of any of those offenses, a person can be fined or imprisoned for a maximum of six months, or both. Subsequent offenses can lead to a fine or imprisonment for a maximum of two years, or both.", "The law has been around for decades.", "Operation Streamline is what Castro had in mind when he referenced 2005 policy changes by the Bush administration, his campaign said. The program allowed Border Patrol agents to refer for prosecution all individuals apprehended at the border, making exceptions for parents traveling with minors, juveniles and select others. It started in response to increased illegal entries of people from countries other than Mexico.", "Before 2004, Border Patrol referred a limited number of immigrants to the Justice Department for criminal prosecution, said a 2015 report from the Office of Inspector General within the Department of Homeland Security. Historically, the government generally returned most Mexican nationals to Mexico through a voluntary return process, and administratively detained and processed immigrants for deportation through the civil immigration system, the report said.", "Prosecutions under Section 1325 have ebbed and flowed over different administrations; not all have enforced it the same way, said Brian Owsley, assistant law professor at the University of North Texas at Dallas, College of Law and former U.S. Magistrate Judge for the Southern District of Texas.", "One of the reasons why Section 1325 was used before and after 2005 was to get people in the federal criminal system— if someone came in improperly a second time they could then be charged for illegal re-entry (a felony), Owsley said.", "The Clinton, Bush, and Obama administrations all prosecuted immigrants under Section 1325. The Trump administration does, too.", "Trump’s \"zero tolerance\" prosecution policy is said to have been modeled after Operation Streamline. However, Trump’s policy is different from policies of other administrations in that it led to the separation of thousands of children from their parents. After public outcry over the separations, Trump signed an executive order to keep families together, \"where appropriate and consistent with law,\" and based on available resources. The order did not end the prosecution policy.", "Immigration experts emphasized that immigration is typically a civil matter— for instance, entering with a legitimate basis for seeking asylum is not a criminal act, and those cases are reviewed by immigration courts within the Justice Department. Yet Bush wasn’t the first one or the only one to prosecute immigrants for illegal entry into the United States.", "Castro said that the Bush administration in 2005 \"decided to charge those that crossed the border with criminal violations, rather than civil ones.\"", "Immigrants who cross the border illegally were prosecuted for immigration offenses even before 2005. But the Bush administration introduced Operation Streamline in late 2005 to prosecute most immigrants who crossed the border illegally.", "Castro’s statement is accurate but needs clarification or additional information. We rate it Mostly True.", "Medium, Julián Castro post, Putting people first, published April 1, 2019", "Email interview, Julián Castro campaign, April 2, 2019", "Email and phone interview, M. Isabel Medina, Ferris Family Distinguished Professor of Law, Loyola University New Orleans College of Law, April 4, 2019", "Phone interview, Michael A. Olivas, immigration law professor at the University of Houston Law Center, April 3, 2019", "Email and phone interview, Brian Owsley, assistant law professor at the University of North Texas at Dallas, College of Law and former U.S. Magistrate Judge for the Southern District of Texas, April 3, 2019", "Email interview, Migration Policy Institute spokeswoman Michelle Mittelstadt, April 3, 2019", "Office of Inspector General, Department of Homeland Security, Streamline: Measuring its effect on illegal border crossing, May 15, 2015", "Cornell Law School, 8 U.S. Code § 1326. Reentry of removed aliens; 8 U.S. Code § 1325. Improper entry by alien", "Justice Department, 65 U.S. Attorneys’ Bulletin, July (II) 2017", "Trac Syracuse University database, Criminal Prosecutions for Illegal Entry Up, Re-Entry Down, Latest Figures as of May 2016", "PolitiFact, No, Donald Trump’s separation of immigrant families was not Barack Obama’s policy, June 19, 2018; Donald Trump's executive order ending his administration's separation of immigrant families, June 25, 2018; Donald Trump falsely says family separations were Obama policy, Nov. 29, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]