["About this rating", "On 28 April 2017, a number of unreliable web sites began publishing stories reporting that rock musician and conservative icon Ted Nugent had been killed in a hunting accident in Montana:", "Ted Nugent, 70’s rocker turned hunting guide and conservative icon, was shot and killed early this morning in a tragic hunting accident. While setting up his tree stand just outside a wildlife reserve in Montana, Nugent was fired on and hit in the chest by a hunter with a scope nearly a quarter of a mile away who believed he was a brown bear.", "There are no legitimate news reports of any ill fate befalling Nugent — in fact, he made a Facebook Live video with his wife Shermane on the same afternoon the death hoax starting circulating, in which they confirmed he is indeed alive and well:", "She posted another live video a few minutes later in which her husband's voice could be heard while she played with the couple's dogs:", "Nugent's spokeswoman Linda Peterson also confirmed in an e-mail that reports of Nugent's untimely death were \"fake news.\"", "Nugent is famous for his rock career, but has also become an outspoken supporter of conservative political figures, such as former Alaska Governor Sarah Palin and President Donald Trump. He most recently made news when he was pictured alongside Palin and fellow rock singer Kid Rock at the White House, where they all dined with President Trump. Nugent is also a divisive figure due to comments he has made about former President Barack Obama and Secretary of State Hillary Clinton that have been characterized as racist, sexist and potentially inciting violence.", "Nugent hunts and is an ardent Second Amendment advocate (he sits on the board of the National Rifle Association), but he was also the target of a type of fake news known as a \"celebrity death hoax.\" He was not killed in a Montana hunting accident.", "Thrush, Glenn. \"4 Hours at the White House with Ted Nugent, Sarah Palin and Kid Rock.\"\r\n  The New York Times. 20 April 2017.", "Ramirez, Kristie. \"Ted Nugent’s Truck.\"\r\n  Texas Monthly. May 2012.", "Graham, David A. \"Quote of the Day: Ted Nugent Threatens Barack Obama.\"\r\n  The Atlantic. 17 April 2012.", "Stryker. \"BREAKING: Conservative Icon Ted Nugent Killed in Hunting Accident.\"\r\n  thelastlineofdefense.org. 28 April 2017.", "Brown, Stephen Rex. \"Gun Supporters Call for Ted Nugent to Be Removed From NRA Board.\"\r\n  New York Daily News. 11 February 2016.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]