["About this rating", "A few case reports — scientific papers that describe isolated scientific observations —  have linked lesions found in a person's mouth to the practice of fellatio.", "However, while partaking in fellatio may potentially impart markings or injuries that would be apparent during a dental examination, the limited research on this topic suggests most fellatio acts would not be \"detectable\" by a dentist; several other potential causes would have to be ruled out before a fellatio-related diagnosis could be made.", "A TikTok video published by user \"thyrants\" opens with the assertion that \"the dentist can find out whether someone has given [head] or not.\" It concludes with what appears to be a person, perhaps a medical professional, in a dental chair discussing the reality of \"fellatio-associated erythema of the soft palate.\" A scientific paper on the topic is used as a backdrop. \"Sometimes we can tell,\" the seated man says. \"It's usually bruising on the soft palate called petechiae, but unless the patient's really young or we see signs of abuse, we don't care.\"", "Based on reports dating back to the 1920s, the act of performing fellatio can in some cases leave visible markings or lesions — usually round spots that occur as a result of bleeding known as petechiae — inside that person's mouth, but that doesn't mean such an outcome is common or that dental professionals can regularly ascertain if you \"have\" or \"have not\" performed the act.", "In 1928, the first report of fellatio-induced mouth lesions was published in the French Journal of Venereal Diseases. According to a 2017 paper revisiting the work, the paper was notable not only for that first, but also for the enthusiasm in which the corresponding doctor described the case, which involved a sex worker with what he determined to be a particularly strong work ethic. As described in that 2017 paper and translated from French, the doctor described this patient as a “conscientious partner” who \"had attached herself to work like an octopus to its prey.\"", "The TikTok video highlights a case report from 2018 that describes a 47-year-old-man with a lesion discovered during a dental exam:", "While examining the oral cavity we found a circular-shaped erythematous lesion with a clear centre on the patient’s soft palate. The patient was asymptomatic and unaware of the lesion. ... The patient acknowledged ... being sexually active with men. His sexual activity included the practice of oral sex, with the last instance being 3 days prior to this visit. ... With this information, we concluded that the erythema on the soft palate was associated with the practice of oral sex.", "Indeed, several case reports like these can be found in the scientific record. According to a 2013 report that summarized the literature on fellatio-associated oral lesions, there is likely more than one mechanism of injury from the sex act. \"Direct and forceful contact of the distal penis against the palate may result in mucosal injury with rupture of submucosal vessels and hemorrhage,\" the authors reported in that paper. Another potential cause, as described in the 2018 paper, is the \"the negative pressure created while sucking,\" which could also damage tissue in the mouth.", "Though work in this area is extremely limited, it is not clear that a majority —  or even many —  cases of fellatio result in lesions. The 2018 study shown in the TikTok video cited a thesis study conducted on Peruvian sex workers that aimed to screen \"for the presence and frequency of fellatio-related lesions.\" That work found that out of 132, \"only 17 sex workers had fellatio-related lesions ... while the rest did not have any type of injury.\"", "In any event, lesions created during fellatio are, in most cases, asymptomatic and only detected later during a dental examination or while the person is brushing their teeth. The lesions typically are resolved on their own. The point of highlighting these cases is not to suggest that your dentist can deduce deep secrets about your sex life, but instead to suggest the possibility that oral sex-related injury should be considered if someone with an unexplained mouth lesion comes into the office of a medical practitioner. \"Those working in the area of head and neck medicine should consider fellatio as an addition to the differential aetiology of intraoral petechiae,\" a 2013 case report concluded.", "The observation of petechiae in the mouth could be the result of several non-fellatio related causes, as well. This is another reason why it is largely inaccurate to suggest dentists can tell if you have recently performed oral sex. More accurately, fellatio-related injuries could be diagnosed by a dentist when clinical observations are combined with their patients' stated medical and sexual history. \"Because the fellatrix or fellator may be unaware of the etiology of the lesions or may be reluctant to provide these details of the sexual history,\" the 2013 case report argued, \"the clinician needs to have a high index of suspicion based on the patient's clinical presentation and collaborating history of preceding fellatio.\"", "Because there are several causes for petechiae in the mouth and because most acts of fellatio do not leave marks, the claim that a dentist can tell if you have or have not performed oral sex on a penis is \"Mostly False.\" Those caveats aside, some acts of fellatio could potentially be detected by a dentist when observations of lesions are combined with a patient's own medical and sexual history.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]