["Chicago Mayor Rahm Emanuel’s 2018 budget address included a series of statements highlighting the city’s economic growth under Emanuel’s leadership.", "Emanuel noted the building boom that has dotted the city’s skyline with \"58 cranes\" and a surge in corporate relocations as well as heavy foreign investment in Chicago. He topped it with a claim about the city’s economy as a whole.", "\"And over the last six years,\" Emanuel said, \"Chicago’s economy has grown faster than the economies of New York City, Washington, D.C., or the national average.\"", "This has become a standard talking point that Emanuel has repeated often in interviews and public settings.", "We’ve heard it often, yet we’ve never heard an explanation of what constitutes the economic growth Emanuel claims. We thought it was time for a closer look.", "Emanuel’s claim covers a lot of ground, so we contacted his office to find out whether it’s based on specific data, studies or reports. Despite several attempts and an assurance that we’d hear back with an answer, we never did.", "So our next stop was the Bureau of Economic Analysis at the U.S. Department of Commerce, which is the official source for measuring economic growth nationally and regionally. The numbers there present a mixed bag on Emanuel’s statement.", "Using gross domestic product as a yardstick from 2011 through 2016 (the most recent year available), Chicago’s economy grew 7.4 percent, which was better than Washington, D.C., (3.8 percent) but lower than that of New York (7.6 percent) and the U.S. as a whole (10.9 percent).", "Chicago also led Washington but trailed New York and the nation when using growth in personal income as a standard, said BEA economist Jeff Newman.", "Geoffrey J.D. Hewings, emeritus director of the Regional Economics Applications Laboratory at the University of Illinois, found largely the same results but offered a caveat to judging Emanuel’s statement.", "\"The main problem is that generalities like this depend upon context. Clearly, there is little appreciable difference in the economic performance between Chicago, (New York) and the U.S. as a whole; Chicago does do better than D.C.,\" Hewings said in an email. \"However, given the fiscal problems in Illinois, it is surprising that Chicago has done as well as it has and of course, the city of Chicago has faced significant fiscal challenges as a result of rather creative accounting manipulations in the last decade.\"", "Another potential measure of economic growth is unemployment, the standard measure of which is gauged by Metropolitan Statistical Area rather than by individual cities.", "Using the latest full-year average unemployment figures from the U.S. Bureau of Labor Statistics, we found metropolitan Chicago reduced its unemployment by 41 percent -- from 9.9 percent to 5.8 percent -- between 2011 and 2016. That’s better than Washington’s 37 percent but behind New York’s 44 percent and the United States’ 45 percent reduction in unemployment during that time.", "In September 2017, greater Chicago’s seasonally adjusted unemployment rate was 5.1 percent and its year-to-date average is 4.7 percent, according to the Illinois Department of Employment Security.", "But a report by Moody’s Analytics in June noted that Chicago’s declining unemployment, which this year dipped \"below the national rate for the first time in a decade,\" may not be cause for celebration.", "\"The decline over the past year is larger than that in all but a handful of metro areas and divisions in the country. However, it occurred only because the labor force is contracting,\" wrote Moody’s analyst Sarah Crane.", "Crane cautioned, however, that Emanuel’s claim still has some merit.", "\"Chicago’s economy is advancing,\" Crane said in an email, \"but its relative performance to New York, D.C. or the U.S. depends on which economic measures are considered.\"", "Emanuel said that \"over the last six years, Chicago’s economy has grown faster than the economies of New York City, Washington, D.C., or the national average.\"", "We don’t know exactly what criteria Emanuel bases this statement on because his office did not respond to repeated requests for specifics. But the most obvious benchmarks for judging economic growth don’t back him up.", "Chicago did better than Washington, D.C., on certain metrics, but we found no evidence of it out-performing the New York or national economies over an extended period. We find this statement Mostly False.", "Rahm Emanuel’s 2018 budget address, transcript, Oct. 18, 2017", "Private Sector Employment Trends in the Chicago Area and the Rest of Illinois, report by RCF Economic & Financial Consulting, Inc., February 2017; accessed Oct. 12, 2017", "Economic report, Chicago/Naperville/Arlington Heights MSA, Moody’s Analytics, June 2017; accessed Oct. 19, 2017", "Economic report, Washington, D.C. MSA, Moody’s Analytics, June 2017; accessed Oct. 19, 2017", "Economic report, New York City MSA, Moody’s Analytics, June 2017; accessed Oct. 19, 2017", "Chicago Area Economic Survey, U.S. Bureau of Labor Statistics, Sept. 27, 2017; accessed Oct. 12, 2017", "Illinois unemployment report, Illinois Department of Employment Security, Oct. 19, 2017", "The conundrum of Chicago's economy, Crain’s Chicago Business, March 4, 2016; accessed Oct. 12, 2017", "Why Chicago's powerhouse economy can't jump-start stalled Illinois, Better Government Association, April 27, 2017; accessed Oct. 12, 2017", "Economic fact sheet for Chicago-Elgin-Naperville Metropolitan Statistical Area, Bureau of Economic Analysis, U.S. Department of Commerce; accessed Oct. 18, 2017", "Employment status of the civilian noninstitutional population 16 years and over, 1982 to date, U.S. Bureau of Labor Statistics; accessed Oct. 18, 2017", "U.S. Census Bureau Quick facts; accessed Oct. 18, 2017", "Measuring the Economy: A Primer on GDP and the National Income and Product Accounts, Bureau of Economic Analysis, U.S. Department of Commerce; accessed Oct. 18, 2017", "Email, Geoffrey J.D. Hewings, emeritus director, Regional Economics Applications Laboratory, University of Illinois at Urbana-Champaign; Oct. 19, 2017", "Email, Sarah Crane, analyst, Moody’s Analytics, Oct. 19, 2017", "Telephone interview, Gary Steinberg, U.S. Bureau of Labor Statistics, Oct. 18, 2017", "Email, Jeff Newman, Bureau of Economic Analyis, U.S. Department of Commerce, Oct. 18, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]