["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "It's HALF TRUE that Facebook shut down a Chick-Fil-A appreciation day.", "U.S. Sen. Ted Cruz, fresh from questioning Facebook founder Mark Zuckerberg at a hearing, asserted that Facebook inappropriately killed an appreciation day for Chick-Fil-A, the chicken restaurant that serves customers in more than 150 Texas places.", "We hadn’t heard that before. Was Facebook down with that?", "Cruz’s April 11, 2018, commentary on the Fox News website centered on what the Texas Republican described as Facebook’s suppression of conservative news stories and the like, making Facebook, Cruz wrote, far from a neutral public forum--a critique that Zuckerberg hadn't embraced.", "Cruz put Facebook’s suppression of chicken appreciation this way: \"Facebook’s actions have ranged from seemingly petty things – like shutting down a ‘Chick-Fil-A Appreciation Day’ to blocking posts from journalists, specific religious groups and most recently, grassroots Trump supporters Diamond and Silk,\" Cruz asserted.", "Cruz cites 2012 account", "Asked the basis of Cruz’s Chick-Fil-A claim, Cruz spokeswoman Catherine Frazier provided a web link to a July 2012 Huffington Post news story that said that for some time over perhaps two days, a Facebook \"events\" page urging people to patronize Chick-Fil-A had been taken offline.", "According to the story, former Arkansas Gov. Mike Huckabee created the page -- urging Aug. 1, 2012, visits to the chain -- because he was upset that Chick-Fil-A was the target of criticism in the wake of Chick-fil-A President Dan Cathy’s saying that \"his company supports ‘the biblical definition of the family unit.’\"", "We saw that the HuffPo story mentioning Huckabee’s Facebook events page touting the intended appreciation day debuted at 10:09 a.m. July 24, 2012. Nearly eight hours later, a 5:55 p.m. update of the story quoted Huckabee saying the page had been yanked down that morning.", "\"The Facebook event is no longer available,\" HuffPo reported, \"and Gov. Huckabee has written the following on his Facebook page: ‘A number of you are asking questions about the Chick Fil-A event. The event disappeared from my page this morning and we have asked Facebook to look into this. I will update you as soon as I know more. The event is still on and the info should be back up soon.’\"", "The next day, at an unspecified time, the HuffPo story was updated to say: \"The Facebook event is back and more than 125,000 people have signed up to participate.\"", "Huckabee said on the restored Facebook events page, which was live when we started to fact-check Cruz’s claim:", "\"I ask you to join me in speaking out on Wednesday, August 1 ‘Chick Fil-A Appreciation Day.’ No one is being asked to make signs, speeches, or openly demonstrate. The goal is simple: Let's affirm a business that operates on Christian principles and whose executives are willing to take a stand for the Godly values we espouse by simply showing up and eating at Chick Fil-A on Wednesday, August 1. Too often, those on the left make corporate statements to show support for same sex marriage, abortion, or profanity, but if Christians affirm traditional values, we’re considered homophobic, fundamentalists, hate-mongers, and intolerant. This effort is not being launched by the Chick Fil-A company and no one from the company or family is involved in proposing or promoting it.", "\"There's no need for anyone to be angry or engage in a verbal battle. Simply affirm appreciation for a company run by Christian principles by showing up on Wednesday, August 1 or by participating online – tweeting your support or sending a message on Facebook.\"", "After Cruz made his claim, we reached out to Huckabee and didn’t hear back. But Huckabee specified in a July 25, 2012, Facebook post pointed out to us by Frazier that the Facebook page he’d created to talk up Chick-Fil-A had been taken down for 12 hours. It seems, Huckabee wrote then, \"we caught a 12 hour bug… We still aren’t sure why it happened, we have been told by Facebook ‘it was a mistake,’ clearly we think it was a mistake too but aren’t so convinced it was an accident.", "\"Could it be,\" Huckabee went on, that \"we were were attacked because of our beliefs? Could it be that Facebook has a glitch in their system with a VERY NARROW target? Who knows if we will ever know for sure, but one thing we do know for sure is that we are back up and running…\" Huckabee’s post closed: \"So we got knocked down, but hey! WE ARE BACK UP!\"", "The page’s temporary vanishment evidently didn’t stop the appreciation day. According to the Facebook events page launched by Huckabee, some 653,000 people participated that day.", "Facebook responds", "We also asked Facebook and Chick-Fil-A about the accuracy of Cruz’s claim.", "By email, Facebook spokeswoman Sarah Pollack responded that the events page devoted to celebrating Chick-Fil-A was \"mistakenly removed by our automated systems after we received a report that content on the page violated our policies.\" Pollack went on: \"The event did not violate our policies and we worked to restore it as soon as we were aware. The event page was restored within ten hours and is still live today.\"", "Asked which policies were at issue, Pollack replied that she didn’t have more detail because the event page \"didn’t violate any of our policies.\" See Facebook’s \"community standards\" policies here.", "We also heard back from Jackie Jags, a Chick-Fil-A spokeswoman. Jags advised by email that the one-time appreciation day \"was not initiated by the company.\"", "We told Frazier, of Cruz’s campaign, that we’d learned that Facebook restored Huckabee’s pro-Chick-Fil-A page within 12 hours and that it looked like the declared appreciation day occurred after all.", "By email, Frazier reiterated that the page was initially yanked off-line by Facebook. Cruz’s claims about Facebook, she wrote, \"are based in fact.\"", "Our ruling", "Cruz wrote that Facebook shut down a \"Chick-Fil-A Appreciation Day.\"", "This claim delivers only half the bird--we mean, story.", "In 2012, Facebook says, it responded to an objection by removing an events page encouraging turnout at Chick-Fil-A restaurants. But the appreciation day page didn’t violate Facebook’s community standards, the company says, and it was put back online within 12 hours; the celebration occurred after all.", "On balance, we rate Cruz’s claim Half True.", "HALF TRUE – The statement is partially accurate but leaves out important details or takes things out of context. Click here for more on the six PolitiFact ratings and how we select facts to check.", "Emails, Catherine Frazier, senior communications adviser, Ted Cruz campaign, April 12-13, 15 and 19, 2018", "News story, \"Mike Huckabee Calls For National ‘Chick-Fil-A Appreciation Day,'\" The Huffington Post, posted 10:09 a.m. July 24, 2012,  updated July 25, 2012 (web link provided by email, Catherine Frazier, April 12, 2018)", "Mike Huckabee Facebook post, 4:14 p.m. July 25, 2012 (accessed April 18, 2018)", "Emails, Sarah Pollack, associate manager, Policy Communications, Facebook, April 13, 2018", "Web page, \"Community Standards,\" Facebook, undated (accessed April 18, 2018)", "Emails, Jackie Jags, manager, External Relations, Chick-Fil-A, April 13, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]