["About this rating", "Actor Jeff Goldblum has been handing out free sandwiches from a food truck in Sydney, Australia.", "It's not a new line of work for the multi-talented actor. He is on record saying it's part of research or promotion for a new film project.", "He has not divulged what that project may be.", "On 25 April 2017, social media users began posting photographs and videos showing Jurassic Park and Independence Day actor Jeff Goldblum handing sausage sandwiches out from a food truck which was cheekily named \"Chef Goldblum's.\"", "Heard about a \"Chef Goldblum\" foodvan in Sydney, went down and got to give compliments to the Chef himself!#ChefGoldblum #JeffGoldblum pic.twitter.com/cUhONoBSfY", "— Leon Sjogren (@Leonsjogren) April 26, 2017", "Goldblum, who is also an accomplished pianist and the frequent subject of Internet memes, told Australian radio host Merrick Watts he was handing out food in Sydney as part of a promotion for an upcoming film project, though he was tight-lipped about the nature of that project:", "It's kind of a secret, it's a mystery that I can't divulge but I'm filming something here that has something to do with food. What do you think about that. ... I was giving out sandwiches, that I was, I can tell you that.", "The brief interview, which aired on 104.9 Triple M Sydney on 26 April 2017, can be heard here:", "It's unclear how long Goldblum plans to hand food out but Australian social media users said he was at Wynard Park and chatting with people when they got to the window.", "Chef Jeff Goldblum in Australia launching his restaurant truck. No wonder line so long, he's chatting to everyone pic.twitter.com/26Zf5Q26IA", "— alex dunnin (@AlexDunnin) April 26, 2017", "Standard day in Sydney. Getting a sausage sandwich from @jeffgoldblum in a Chef Goldblums van ? #jeffgoldblum #chefgoldblum #sydney #lunch #foodtruck #dreamjob @thefancybanger", "A post shared by missfeelgood (@missfeelgood) on Apr 25, 2017 at 9:28pm PDT", "Goldblum will reprise his role as eccentric mathematician Ian Malcolm in a 2018 Jurassic Park sequel but did not say whether the role is related to his food truck adventures.", "Morabito, Greg.  \"Oh Hey, Why Is Jeff Goldblum Working at an Australian Sausage Truck?\"\r\n  Eater.com.  26 April 2017.", "Lieu, Johnny.  \"Jeff Goldblum's Handing Out Free Sausages in a 'Chef Goldblum's' Truck.\"\r\n  Mashable.com.  26 April 2017.", "Izadi, Elahe.  \"Beloved Living Meme Jeff Goldblum Will Be in the Next ‘Jurassic World’ Movie.\"\r\n  The Washington Post.  26 April 2017.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]