["About this rating", "U.S. President-elect Joe Biden is known for making confusing statements — sometimes as jokes, and sometimes as gaffes. One particular statement made during a December 2020 interview with CNN’s Jake Tapper that appeared to be a joke fell flat, leading to questions and criticism from conservatives and to widespread coverage by conservative media.", "In the interview conducted alongside Vice President-elect Kamala Harris, they talked about their working relationship. Biden also described how he and Harris were “simpatico” on their philosophies of government, and how they approached many issues.", "His full remarks:", "When we disagree, it’ll be […] so far it’ll be just like when Barack and I did, it’s in private. She’ll say I think we should do A, B, C or D, and I’ll say I like A, don’t like B and C, and just go okay […] Like I told Barack, if I reach something where there's a fundamental disagreement we have based on a moral principle, I'll develop some disease and say I have to resign [...] We’ve discussed at length our views on foreign policy, on domestic policy, on intelligence, and the great thing is she has a background in the senate on the intelligence committee, she has a background in the senate on a whole range of things that are going to be pertinent to what we have to do.", "It is not clear what Biden meant when he said he would “develop some disease” and \"resign,\" but some outlets interpreted this as an attempt at a joke. Harris simply smiled during the remarks.", "Nur Nasreen Ibrahim is a reporter with experience working in television, international news coverage, fact checking, and creative writing.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]