["By Eugene Kiely", "Posted on May 14, 2019", "Sen. Kamala Harris acknowledges that a 2010 state truancy law she sponsored resulted in some parents being jailed. But she misleadingly claims that jailing parents was an “unintended consequence” of the law.", "In fact, the law added Section 270.1 to the California Penal Code to allow prosecutors to fine and/or jail a parent “who has failed to reasonably supervise and encourage the pupil’s school attendance.” Under the law, which was signed by Gov. Arnold Schwarzenegger on Sept. 30, 2010, a parent could face up to a year in jail and $2,000 fine. The law took effect in 2011.", "Harris, a Democratic candidate for president, was San Francisco District Attorney from 2004 to 2011. As district attorney, she launched a three-stage program to lower the San Francisco United School District’s truancy rates in 2006. If the first two stages — education and intervention — failed, then parents could be prosecuted.", "“Parents of truant children who do not change course in Stage 2 are subject to prosecution,” the district attorney’s office said in a brochure that describes the initiative. “Parents must report to a specialized Truancy Court we created that combines close court monitoring with tailored family services. We have SFUSD and Children and Family Services on hand to resolve underlying issues such as transportation, unstable housing, substance abuse, mental health, neglect or unresolved special education needs. Parents who are continually reluctant to send their children to school are subject to fine or imprisonment.”", "The brochure said that 20 parents in San Francisco were prosecuted for truancy in 2008. We don’t know how many were prosecuted in all, but the Los Angeles Times writes that no one was jailed. “Harris issued citations to parents whose children missed more than 50 days of school, but none of them were put in jail,” the Los Angeles Times wrote in an April 17 story.", "However, as the San Francisco District Attorney, Harris sponsored a state Senate bill — SB 1317 — that was introduced by state Sen. Mark Leno, who is also from San Francisco. The state bill was modeled on her truancy initiative in San Francisco, and did result in some parents being jailed.", "Los Angeles Times, April 17: Harris took that advocacy statewide, sponsoring a 2010 law to make it a misdemeanor for parents whose young children miss more than 10% of school days a year without a valid excuse. Parents could be punished with a maximum $2,000 fine, up to a year in county jail or both.", "In an interview on CNN’s “State of the Union,” Harris said her initiative improved school attendance in San Francisco and “not one parent was sent to jail.” Host Jake Tapper then asked about the state law that she sponsored.", "Tapper, May 12: Well, you pushed for a statewide law, right, a statewide truancy law.", "Harris: And the state…", "Tapper: And people were thrown into jail under that law.", "Harris: Not by me.", "Tapper: Not by you, but you supported the law.", "Harris: I supported the law that — this is what I supported, and our initiative was that in the — and here’s — we’re going to get in the weeds, but give me the patience of time to explain it.", "When I was looking at the issue of truancy, I realized that, when we define truancy, we defined it as three or four unexcused absences, you’re truant. I was seeing kids that were missing up to 80 days of a 180-day school year. So, my point was, why isn’t the education code recognizing that?", "What ended up happening is, by changing the education code, it also changed — it, by reference then, was in the penal code. And then that was an unintended consequence.", "And if I could do it over again, I would have made sure that it would not have increased penalties or the ability to prosecute anywhere in the state to prosecute parents, because that was never the intention. And it was never anything that I did.", "The possibility of jailing parents was not an “unintended consequence,” and the bill did not just change the education code. It also created a new section to the California Penal Code, as we have already noted.", "Harris knew this, of course.", "After taking the oath of office as the California attorney general in January 2011, Harris said in her inaugural address that she was “putting parents on notice” that they could face “the full force and consequences of the law” if their kids miss too many days of school.", "Harris, Jan. 3, 2011: We know chronic truancy leads to dropping out, which dramatically increases the odds that a young person will become either a perpetrator or a victim of crime. Folks, it is time to get serious about the problem of chronic truancy in California. Last year we had 600,000 truant students in our elementary schools alone, which roughly matches the number of inmates in our state prisons. Is it a coincidence? Of course not.", "And as unacceptable as this problem is – I know we can fix it. In San Francisco, we threatened the parents of truants with prosecution, and truancy dropped 32 percent. So, we are putting parents on notice. If you fail in your responsibility to your kids, we are going to work to make sure you face the full force and consequences of the law.", "In 2013, her office issued the first statewide report on truancy. In a press release about the report, her office described the 2010 state law as “combining meaningful services with smart sanctions in the California Penal Code.”", "California attorney general’s office, Sept. 30, 2013: The initiative also served as a model for SB 1317 (Leno), which defined “chronic truancy” for the first time under state law and established the initiative’s model of combining meaningful services with smart sanctions in the California Penal Code.  The bill was sponsored by then-District Attorney Harris and was enacted in law in 2010.", "The 2013 report itself urged district attorneys to jail parents “in only the most extreme cases,” because “it is both traumatic for children and families and costly for taxpayers.” It provided no statistics on prosecutions, but it said that on average “district attorneys reported prosecuting 3 [to] 6 Section 270.1 cases per year.” It provided one example, saying the Kings County district attorney used “Penal Code 270.1” to jail “a mother whose two elementary school children had a combined 116 absences in a single school year.” (The report links to a news story that says the woman was sentenced to 180 days in prison.)", "We don’t know how many people have been arrested, fined or jailed since the 2010 state law went into effect. The state attorney general’s office does not keep such data, and referred us to local jurisdictions. In a March story on Harris and the impact of the law, HuffPost provided some county-level data. It said, for example, that Kings County “has charged 19 misdemeanors under Harris’ law in the past four years, and at least two mothers have been sentenced to jail.”", "We asked Harris’ campaign about her use of the phrase “unintended consequences” regarding the imprisonment of some parents under the law. It referred us to comments that she made on April 17 to Pod Save America.", "But Harris gave PSA some of the same answers that she gave to Tapper.", "Harris said the educational code did not adequately deal with chronic truancy cases. She even repeated her claim that imprisonment was an “unintended consequence” of the state law.", "She also said the arrests were “not under my watch,” and that she had “no control” over the arrests — even though she sponsored the state law that allowed for the arrests, and her office provided guidance to local district attorneys on when prosecutions should and should not be made.", "“My regret is that I have now heard stories where, in some jurisdictions, DAs have criminalized the parents. And I regret that that has happened,” Harris told the PSA host, Jon Favreau, a former speechwriter for President Barack Obama. “And the thought that anything that I did could have led to that, because that certainly was not the intention — never was the intention.”", "That’s some serious spinning. Harris said she has “now heard stories” about parents being jailed, but as we said her first statewide report on truancy contained an example of a parent being jailed under the state law. It gave advice on when to prosecute and not prosecute cases. A year later, the attorney general’s 2014 report on truancy said that “prosecution should be a last resort” — but it did not say imprisoning parents should never be done.", "Clearly, the state law intended for some parents to be jailed for their children’s chronic truancy, despite Harris’ claim that jailing parents was an “unintended consequence” of the law. She may regret the law, but she can’t redefine it.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]