["About this rating", "In April 2017, President Donald Trump extended the Veterans Choice Act (a piece of legislation that was signed into law by President Obama in 2014) which gave veterans greater access to health care providers.", "This was not an executive order; this bill did not grant veterans free health care; this bill does not allow veterans to receive care at any hospital; Trump signed this extension in April 2017, not March 2018.", "In March 2018, a Facebook post deriding \"Trump haters\" and touting one of the president's accomplishments — an executive order that grants veterans free health care at any hospital in the United States — started going viral:", "For all the Trump haters; today President Trump signed an executive order allowing our veterans to get 100% medical bills paid at hospitals other than a V.A. hospital. This will save the lives of many American service men and women who have been on V.A. waiting lists, some for years and many dying while waiting. Now they can go to ANY hospital they want... This is how our veterans SHOULD be treated!!! Thanks President Trump!!!", "There are a number of problems with this Facebook post, starting with the claim that President Donald Trump signed an executive order \"today\" (5 March 2018). A list of Presidential actions (including executive orders) available on the White House's web site shows that no executive order at all, whether for veteran's health care or anything else, was signed on this date.", "The language in this post seems to be referring to the Veterans Choice Act, which was signed into law by President Obama in August 2014. President Trump signed a bill to extend this program a few months before it was set to expire in August 2017:", "President Donald Trump extended the Veterans Choice Act on Wednesday to set the stage for a push in Congress to expand the program and allow more access to private care for veterans.", "Flanked by veterans at an Oval Office ceremony, the president signed the bill to extend the Choice program, which was to expire on Aug. 7, and allow the expenditure of the remaining $950 million in the program.", "This was not an executive order; furthermore, the Veterans Access, Choice, and Accountability Act of 2014 did not accomplish all of the things set out in this Facebook post, such as grant free health care at any hospital.", "The Veterans Choice Program expanded the \"availability of medical services for eligible Veterans with community providers,\" but it did not grant veterans the opportunity to receive completely free health care at any hospital of their choosing.  A fact sheet provided by the Department of Veterans Affairs laid out the criteria for veterans to seek health care outside established providers:", "As directed by the Choice Act, VA will administer the “Veterans Choice Fund” to implement the Veterans Choice Program (“the Program”). The Program will operate for 3 years or until the Fund is exhausted. The Program will provide Veterans who were enrolled as of August 1, 2014 or eligible to enroll as a recently discharged combat Veteran with a Veterans Choice Card, and allow those Veterans who are unable to schedule an appointment within 30 days of their preferred date or the clinically appropriate date, or on the basis of their place of residence to elect to receive care from eligible non-VA health care entities or providers. This is separate from VA’s existing program providing Veterans care outside of the VA system. Eligible non-VA entities or providers must enter into agreements with VA to furnish care, must maintain the same or similar credentials and licenses as VA providers, and must submit to VA a copy of any medical records related to care and services provided under the Program for inclusion in the Veteran’s VA electronic medical record.", "The VA elaborated on the criteria that veterans must meet in order to seek treatment at outside providers. Even then, the choice of hospitals is limited to the facilities that have agreed to participate in the program. Furthermore, this bill does not include a provision stating that it covered all of the health care provided at these facilities. Some veterans may be eligible for free health care services, but most are required to pay for a portion of their treatment:", "While many Veterans qualify for free healthcare services based on a VA compensable service-connected condition or other special eligibilities, most Veterans are required to complete a financial assessment or means test at the time of enrollment to determine if they qualify for free health care services. Veterans whose income exceed VA income limits as well as those who choose not to complete the financial assessment at the time of enrollment, must agree to pay required copays for health care services to become eligible for VA healthcare services.", "The future of the program is uncertain, however. Critics of the program say that it's too expensive, and that it could eventually lead to downsizing.", "Hicks, Josh.   \"A Simple Summary of the New VA Bill.\"\r\n    The Washington Post.   29 July 2014.", "Jackson, David.   \"Obama Signs Veterans Health Care Bill.\"\r\n    USA Today.   7 August 2014.", "Rein, Lisa.   \"‘It’s Killing the Agency’: Ugly Power Struggle Paralyzes Trump’s Plan to Fix Veterans’ Care.\"\r\n    The Washington Post.   9 March 2018.", "Sisk, Richard.   \"Trump Signs Bill to Extend Veterans Choice Program.\"\r\n    Military.com.   19 April 2017.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]