["A video currently viral on social media shows a woman seizing purported fake Aadhaar cards from a group of Burqa-clad voters. It is being claimed that the woman was a Muslim worker of the BJP from Muzaffarnagar, a constituency that went into polls on April 12. “@संजीव बालियान-मुज़फ़्फ़रनगर अगेन,बीजेपी की मुस्लिम कार्यकर्ता द्वारा फ़र्ज़ी वोटिंग का रंगे हाथ पकड़ना,पहचान पत्र किसी और का वोट कोई और डाल रहा है (@Sanjeev Balyan- Muzaffarnagar again, fake voting caught red-handed by BJP’s Muslim worker. Identity card belongs to someone else and votes are being cast in the name of another person,” claims the narrative affixed to the video.", "The video is being shared in the backdrop of Muzaffarnagar BJP candidate Sanjeev Balyan’s allegations that people were casting fake votes dressed as burqa-clad women. To support Balyan’s claims, social media was earlier brimming with old images of burqa-clad men being falsely shared as them casting fake votes in the ongoing Lok Sabha elections.", "@संजीव बालियान-मुज़फ़्फ़रनगर अगेन,बीजेपी की मुस्लिम कार्यकर्ता द्वारा फ़र्ज़ी वोटिंग का रंगे हाथ पकड़ना,पहचान पत्र किसी और का वोट कोई और डाल रहा है pic.twitter.com/OEStN2vdzp", "— V K SHARMA (@VictoriousNamo) April 11, 2019", "“Muslim women got caught in fraud voting, wearing burqa in #Muzaffarnagar in uttar pradesh. Do you beat @narendramodi like this? Where is Election Commission?,” is another caption used to share the video.", "Muslim women got caught in fraud voting, wearing burqa in #Muzaffarnagar in uttar pradesh.", "Do you beat @narendramodi like this?", "Where is Election Commission?", "😠😠@TajinderBagga @Payal_Rohatgi @dscair1 @RitumoudgilRitu @Voice_For_India @followaanchal @TarekFatah @ShefVaidya pic.twitter.com/JsgDMcOViG", "— Sandeep singh🇮🇳💞🇮🇱 (@singhsandeep792) April 11, 2019", "The video is viral on Facebook and WhatsApp alike with the caption – “उत्तर प्रदेश के मुजफ्फरनगर में बुर्का पहनकर फर्जी वोटिंग करती हुई पकड़ी गयी मुस्लिम महिलाये (Muslim women wearing burqa were caught in Uttar Pradesh’s Muzaffarnagar casting fake votes.)”", "If one carefully listens to the video, the woman takes her name and that of her party in the first few seconds. “मैं BSPप्रत्याशी शेला हूँ ,“ she can be heard saying. Alt News found that a woman named Shaila Khan was fielded by the Bahujan Samajwadi Party in 2017 as the candidate for Rampur nagar palika chairperson.", "Upon searching for “Shaila Khan BSP fake voting Rampur elections”, we found that the video currently viral was posted by a YouTube user in 2017 as – “Rampur Nagar Nikay Election Cheating.”", "While Alt News was unable to locate news articles reporting the alleged incident, we found that Shaila Khan was indeed a BSP worker. A campaign poster of the BSP carried her photograph.", "Posted by Momin Khan on Wednesday, 22 November 2017", "An old video was lifted from the internet and circulated as an incident pertaining to the ongoing general elections. The woman in the video was a BSP member and not a BJP worker. After BJP’s Muzaffarnagar candidate Sanjeev Balyan’s claim that fake votes were cast in Muzzafarnagar by people dressed up in burqas, this was the second attempt to support his allegation using misinformation.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]