["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Tuberculosis stands second to AIDS as the world’s deadliest infectious disease, killing about 1.5 million people in 2014. Only a small percentage of those deaths took place in the United States, yet the American government is the pre-eminent funder of tuberculosis research.", "HIV/AIDS activist Marcus Low, policy head for the South African-based Treatment Action Campaign, drove home that point when a United Nations taskforce met in Johannesburg. Low’s group urged the panel to recommend a global research and development treaty that would have governments commit money to tuberculosis -- an infection most often in the lungs -- and other disease research. By the World Health Organization’s estimate, research spending worldwide falls about $1 billion short each year.", "South Africa’s Business Day cited Low on March 19, 2016, as saying, \"Most funding for tuberculosis research was provided by the U.S. National Institutes for Health.\"", "We asked Low if the paper had quoted him accurately. He offered a clarification.", "\"A better formulation of that line would have been, ‘the top contributor to TB research and development, according to a report published by Treatment Action Group, is the NIH’,\" Low told us.", "We’re not sure if that means the reporter got it wrong, or Low misspoke. Whichever it is, Low went on to tell us that the line in the news article is unclear.", "\"If most is read as more than any other, then it is correct,\" Low said. \"If most is read as more than 50 percent, then it is not correct.\"", "Let us make things crystal clear about the American research effort. The NIH is the single-largest source of TB research money.", "The best overview of global tuberculosis research comes from the Treatment Action Group, a New York advocacy organization. The group assembled information from over 100 government, foundation and drug company research efforts. It’s most recent report found that the U.S. National Institutes of Health spent over $200 million on tuberculosis research in 2014.", "That was more than any other single entity, and represented more than 30 percent of the global investment in TB research and development. A bit over $674 million was spent worldwide.", "The U.S. total grows to nearly a quarter of a billion dollars when you add in the money from the U.S. Agency for International Development, the Centers for Disease Control and Prevention and assorted other agencies. In raw dollars, the United States government has no match.", "But the United States is a big country with the world’s largest economy. So we assessed where America stands when you factor in population and Gross Domestic Product. Do that and an unexpected nation earns some bragging rights -- Singapore.", "While the small Asian nation spends about 3 percent what America does, relative to its size, it comes out on top in both of the relative rankings. The United Kingdom and Switzerland also show up in the top three, depending on the measure. (Methodology note: We adjusted spending by European Union members according to their contributions to the EU. Population data came from the U.S. Census Bureau, and GDP data came from the World Bank.)", "Why Singapore? Mike Frick, project officer at the Treatment Action Group, said he’s not exactly sure. It might have its roots in the legacy of the multinational drug company Novartis.", "\"Novartis's TB research used to be based in Singapore,\" Frick said. \"That has ended, but suggests there is some institutional capacity for TB research already established there.\"", "Certainly, the National University of Singapore is eager to build support there for continued government funding. In a March 24, 2016, webpost, it touted that it is well placed to lead the fight against tuberculosis.", "\"Singapore is located at the heart of the TB epidemic, being close to Cambodia, Myanmar, Indonesia, China and India -- countries with the highest number of TB cases in the world,\" the posting said.", "A professor at the university’s school of public health wrote in an op-ed about TB research and \"the breadth of Singapore's growing research infrastructure and human resources.\" All of which suggests that at least some Singaporeans see this as a competitive niche that ought be expanded.", "The drivers behind the spending in the United States are a combination of tradition and political activism tied to AIDS.", "Audrey Jackson, a senior fellow at the Center for Strategic and International Studies, told us the federal government has put money into health research for decades.", "\"The U.S. has been a huge funder of science,\" Jackson said. \"Through the National Institutes of Health, it has funded a great deal of basic science and early work to translate findings into clinical applications.\"", "Jackson noted that TB funding at the NIH itself has been flat for the past five years, \"even declining if you factor in inflation,\" but that the latest White House budget calls for an increase.", "Dick Chaisson, director of the Center for TB Research at Johns Hopkins University, said the AIDS epidemic played a key role in reigniting the tuberculosis research effort in America.", "\"Back in the 1970s, it was assumed that TB was a done deal, and all the scientific discoveries that were needed had been made, so science moved on to other issues.\" Chaisson said. \"It turns out that the discoveries of the past were not good enough to result in TB elimination, and the advent of HIV and the emergence of drug-resistant TB made things even worse.\"", "Around 1990, New York City became ground-zero for the resurgence of tuberculosis. The New England Journal of Medicine reported that \"with 3 percent of the country's population, New York City accounted for a remarkable 61 percent of cases of multidrug-resistant tuberculosis in the United States.\"", "Frick said that because the disease hit New York, and in particular, people with AIDS, there was ample political lobbying power to draw in the federal government. By 1992, Congress had made an emergency appropriation of $100 million to combat TB. Of that, $40 million went to New York City.", "\"That was a time when an institutional will to engage with TB research came together,\" Frick said. \"A lot of young doctors spent their formative years in that effort and now are making decisions.\"", "A ready example supports Frick’s generational point. In 1992, New York City used part of its $40 million to create the Bureau of Tuberculosis Control. The man it picked as founding director was a young CDC doctor named Tom Frieden.", "Today, Frieden leads the CDC where he makes the case for more federal funding for disease control and oversees the more than $14 million it spends on TB research.", "Our ruling", "Low said that most funding for tuberculosis research comes from the U.S. National Institutes of Health. Whether he used those exact words is a bit unclear, but in the sense that the NIH is the single-largest funder of research, the statement is correct.", "The only caveat is that when we factor in the size of the economy, the United States as a whole falls to third and Singapore rises to the top.", "We rate this claim Mostly True.", "Business Day, Global health activists lobby UN panel in SA on medicine access, March 19, 2016", "Treatment Action Group, 2015 Report on Tuberculosis Research Funding Trends, 2005–2014: A Decade of Data, November 2015", "U.S. Census Bureau, International demographics, 2014", "Statista, Share of total contributions to the European Union budget, 2015", "World Bank, World development indicators", "National University of Singapore, Singapore in a prime position to lead fight against tuberculosis, March 24, 2016", "Straits Times, Singapore in a prime position to lead fight against tuberculosis, March 24, 2016", "James Colgrove, Epidemic City: The Politics of Public Health in New York, May 2011", "New England Journal of Medicine, Tuberculosis in New York City — Turning the Tide, July 27, 1995", "Lancet Infectious Diseases, Priorities for tuberculosis research: a systematic review, Dec. 10, 2010", "Congressional Research Service, U.S. Response to the Global Threat of Tuberculosis: Basic Facts, June 15, 2012", "World Health Organization, Tuberculosis data", "World Health Organization, Global tuberculosis report, 2015", "Aeras/Tuberculosis Vaccine Initiative, TB Vaccine Research & Development A Business Case for Investment, December, 2013", "Center for Strategic and International Studies, Strengthening the U.S. approach to tuberculosis research and development, June 2014", "Interview, Mike Frick, project officer at the Treatment Action Group, March 31, 2016", "Interview, Audrey Jackson, senior fellow, Global Health Policy, Center for Strategic and International Studies, March 31, 2016", "Email interview, Dick Chaisson, founding director of the Center for TB Research at the Johns Hopkins University, March 30, 2016", "Email interview, Marcus Low, director of policy, Treatment Action Campaign, March 31, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]