["The screenshot was shared in a Facebook post published on January 29, 2021.", "“WHO now saying You do not need to Wear a Mask,” the article headline reads.", "“In a telling admission made on January 22, 2021, the World Health Organization now say there is no scientific medical reason for any healthy person to wear a mask outside of a hospital. Sadly, our corrupt politicians and mainstream media only relate the bad news,” the text reads.", "“If you do not have any respiratory symptoms, such as fever, cough, or runny nose, you do not need to wear a medical mask. When used alone, masks can give you a false feeling of protection and can even be a source of infection when not used correctly.”", "The post features a photo of WHO chief Tedros Adhanom Ghebreyesus.", "The screenshot was shared in multiple Facebook posts, including here, here, and here alongside a similar claim.", "The claim is false.", "Face mask advice", "The screenshot in the misleading posts shows part of this article on Principia Scientific International, a website that has promoted conspiracy theories about the pandemic. The article was later updated to clarify the WHO said that wearing face masks can be beneficial in slowing the spread of the coronavirus.", "Early in the coronavirus pandemic, the WHO recommended health workers should be given priority access to face masks in order to avoid shortages of personal protective equipment (PPE).", "It later updated its advice in June 2020, recommending people to wear fabric masks, particularly in countries with high levels of Covid-19 cases and in places where physical distancing was difficult, such as on public transport and in shops, AFP reported here.", "The WHO urged people aged over 60 and those with underlying health conditions to wear a medical mask in areas with community-level virus transmission.", "This marked a change to previous advice that medical masks should only be worn by people with Covid-19 symptoms; those caring for an infected person and health workers dealing with a suspected or confirmed coronavirus patient.", "Press conference comments", "In a press conference on January 22, 2021, the WHO’s Technical Lead for Covid-19, Dr Maria Van Kerkhove said that wearing face masks must be combined with additional measures in order to control the spread of the virus.", "“We are seeing that the interventions that are in place are working but I should say with the use of masks, masks are one aspect of control, one aspect of reducing the spread of this virus and they can't be used alone. We need to emphasise that because not one solution is enough; not masks alone, not physical distancing, not hand hygiene; you've heard us say that quite a lot,” Van Kerkhove said.", "The guidance is supported by the WHO’s public advice on masks, which also states that masks alone were insufficient to prevent the spread of the virus.", "“Masks should be used as part of a comprehensive strategy of measures to suppress transmission and save lives; the use of a mask alone is not sufficient to provide an adequate level of protection against Covid-19,” the advice reads.", "“If Covid-19 is spreading in your community, stay safe by taking some simple precautions, such as physical distancing, wearing a mask, keeping rooms well ventilated, avoiding crowds, cleaning your hands, and coughing into a bent elbow or tissue.”", "AFP Fact Check has previously debunked misinformation about the WHO’s advice on masks, including a fake WHO document which falsely claimed the global health body does not recommend mask-wearing during the pandemic.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]