["About this rating", "The DEA recently approved a new oral liquid formulation of dronabinol — a synthetic version of the active ingredient in marijuana — as a schedule II drug.", "This is not the first time the DEA has approved dronabinol, which is wholly different than K2, Spice, and other recreational “synthetic cannabis” products.", "On 5 July 2016, the United States Food and Drug Administration approved a New Drug Application from Insys Therapeutics for a drug they dubbed Syndros — an oral solution of the synthetic version of the most prominent psychoactive ingredient in marijuana. The pharmaceutical was approved for use by AIDS and chemotherapy patients:", "Insys Therapeutics, Inc. today announced that the U.S. Food and Drug Administration (FDA) has approved Insys’ dronabinol oral solution, SyndrosTM, an orally administered liquid formulation of the pharmaceutical cannabinoid dronabinol, a pharmaceutical version of tetrahydrocannabinol (\"THC\").", "Syndros is approved for use in treating anorexia associated with weight loss in patients with AIDS, and nausea and vomiting associated with cancer chemotherapy in patients who have failed to respond adequately to conventional antiemetic treatments.", "After any new drug is approved by the FDA, it must then be scheduled by the Drug Enforcement Administration, a legal classification which determines the legal handling and prescribing restrictions on the drug, if any. The DEA issued its first \"interim\" ruling — a legally binding ruling subject to change after a period of public comment — on Syndros on 23 March 2017, placing the formulation in the Schedule II grouping of \"drugs with a high potential for abuse, with use potentially leading to severe psychological or physical dependence\", which allows for prescription, albeit in a limited fashion. This rule was adopted in a final form without changes on 22 November 2017.", "Numerous reports have highlighted the DEA's apparent inconsistency and hypocrisy in approving a bioidentical-but-synthetic version of THC for an approved medical use, while keeping plant-origin THC as a Schedule I drug. A Schedule I drug has \"no approved medical use,\" something the DEA touched on in their final ruling:", "The DEA notes that FDA-approved products of oral solutions containing dronabinol have an approved medical use, whereas marijuana does not have an approved medical use and therefore remains in schedule I.", "A viral post from cannabis culture website Herb.co reported the decision with the narrative that the DEA was approving synthetic marijuana as medicine \"while the real thing remains illegal.\" While the bulk of the reporting was factual (though incomplete), it included a number of pictures with captions describing medical emergencies attributed to so-called \"synthetic marijuana\" products like K2 and Spice.", "This is misleading, as such products — though unregulated — generally contain a mixture of THC-like chemicals that are not, in fact, chemically identical to THC, but have similar and sometimes more potent or dangerous effects. The DEA has not scheduled these products as medicine, and the companies that produce them — many of which operate in clandestine fashion to avoid detection by the FDA — have not submitted their products for review by the Food and Drug Administration to be considered pharmaceuticals.", "Herb.co’s reporting was incomplete, additionally, because they implied this was a recent change in policy. In fact, synthetic THC, a chemical with the generic pharmaceutical name dronabinol, has been approved for the same indications as Syndros in capsule form since 1985. This form, under the brand name Marinol, was originally scheduled (like Syndros) in the more restrictive Schedule II grouping before being shifted to Schedule III in 1999.", "The reason for the differing classifications of dronabinol in capsule form versus oral spray form stems from their differing potential to be abused, according to the DEA:", "[The Department of Health and Human Services] indicated that the formulation of Syndros (oral solution) is easier to abuse than Marinol because this liquid formulation can be manipulated to produce concentrated extracts of dronabinol for abuse by inhalation (smoking or vaping) or through other routes of administration. Because of the large amount of dronabinol in Syndros oral solution it has a greater potential for extraction than Marinol and thus has a greater abuse potential.", "Although it is factual to say that the DEA approved a synthetic version of THC — legally giving it medicinal value — while keeping plant based THC a Schedule I drug with \"no currently accepted medical use,\" this ruling applies only to dronabinol, and not to recreational products like K2 or Spice. And while there are arguments to make about logical inconsistencies in the DEA’s treatment of synthetic versus natural THC, such arguments are not a new feature of the debate around marijuana legalization, as they have been proffered since dronabinol was first approved for use by the FDA in 1985.", "Insys Therapeutics, Inc..   \"Insys Therapeutics Announces FDA Approval of Syndros\"\r\n    5 July 2016.", "U.S. Food and Drug Administration.   \"New Drug Application (NDA).\"\r\n    Accessed 30 November 2017.", "U.S. Drug Enforcement Administration.   \"Drug Schedules.\"\r\n    Accessed 30 November 2017.", "Federal Register.   \"Schedules of Controlled Substances: Placement of FDA-Approved Products of Oral Solutions Containing Dronabinol [(-)-delta-9-trans-tetrahydrocannabinol (delta-9-THC)] in Schedule II.\"\r\n    22 November 2017.", "Federal Register.   \"Schedules of Controlled Substances: Placement of FDA-Approved Products of Oral Solutions Containing Dronabinol [(-)-delta-9-trans-tetrahydrocannabinol (delta-9-THC)] in Schedule II.\"\r\n    23 March 2017.", "Hamilton, Keegan.   \"Synthetic THC Is Safer Than Actual Weed, According to The DEA.\"\r\n    Vice News.   22 November 2017.", "Margolin, Madison.   \"Synthetic Weed Gets FDA Approval, This Time in Liquid Form.\"\r\n    Motherboard.   27 July 2016.", "Tomoski, Miroslav.   \"The DEA Approves Synthetic Marijuana as Medicine While the Real Thing Remains Illegal.\"\r\n    Herb.co.   25 November 2016.", "Castaneto, Marisol, et al.   \"Synthetic Cannabinoids: Epidemiology, Pharmacodynamics, and Clinical Implications.\"\r\n    Drug and Alcohol Dependence.   1 November 2017.", "U.S. Food and Drug Administration.   \"Marinol (dronabinol) Capsules, for Oral Use, CIII.\"\r\n    Accessed 30 November 2017.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]