["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Ken Paxton, the Texas attorney general, said in September 2017 that Barack Obama used an order to \"unilaterally confer\" citizenship on immigrants. Pants on Fire!", "The lead lawyer for Texas state government hailed President Donald Trump’s rescission of predecessor Barack Obama’s move affording young unauthorized immigrants, sometimes called \"Dreamers,\" renewable shields from deportation.", "Moreover, Attorney General Ken Paxton charged in a Sept. 5, 2017, press release, Obama \"used that lawful-presence dispensation to unilaterally confer U.S. citizenship.\"", "A reader asked us to check on that.", "In his release, Paxton said the program that Trump gave Congress six months to restore granted lawful presence and work permits to nearly a million \"unlawfully present aliens.\"", "That's close to solid. The Pew Research Center recently estimated that fewer immigrants, nearly 790,000 people with roots mostly in Mexico, have received work permits and deportation relief through the Obama-launched Deferred Action for Childhood Arrivals program.", "Yet citizenship wasn’t a declared offering via DACA. The June 2012 Homeland Security memo announcing the program said: \"This memorandum confers no substantive right, immigration status or pathway to citizenship. Only the Congress, acting through its legislative authority, can confer these rights.\"", "Iowa senator touts figures", "So, what citizenship provision was Paxton talking about? By email, Kayleigh Lovvorn, a spokeswoman for the attorney general’s office, replied that DACA wasn’t intended to be a path to citizenship. But, Lovvorn wrote, figures released by U.S. Citizenship and Immigration Services indicate that 39,514 DACA recipients have been approved for Lawful Permanent Resident status,\" green cards, her email implying that such individuals could later seek citizenship.", "A web search led us to a Sept. 1, 2017, press release from Sen. Chuck Grassley, R-Iowa, publicizing the USCIS figures. Grassley’s release said preliminary data \"indicate that the Obama administration allowed thousands of DACA recipients to exploit an immigration law loophole to obtain green cards. The data also show that more than a thousand DACA recipients have already obtained citizenship.\"", "As of Aug. 21, 2017, Grassley’s release said, 45,447 DACA recipients had been approved for \"advance parole\" with 3,993 applicants getting applications denied. \"This approval,\" the release says, \"allows a DACA recipient to travel out of the country and legally return, making them eligible to adjust their immigration status and receive a green card.\"", "We’ll delve into \"advance parole.\" But first, more numbers from Grassley’s release: 59,778 DACA recipients have applied for green cards with 39,514 approved. Also, the release said, 2,181 of the green-card recipients have applied for U.S. citizenship--with 1,056 becoming citizens, which would break out to 0.1 percent of DACA recipients becoming citizens, by our calculation.", "We spotted no elaboration in the release--and didn’t draw any from Grassley aides or Homeland Security--demonstrating that any of the tallied individuals obtained citizenship by virtue of being a DACA recipient.", "On the other hand, legal experts supportive of DACA told us the advance parole aspect of the program may have helped individuals attain legal residency and citizenship. In each instance, the experts stressed, a person getting citizenship would first need to have been sponsored by an immediate family member--most commonly a spouse--who was already a legal permanent resident or citizen, which would have been required regardless of an applicant’s DACA participation.", "Natalia Drelichman, an attorney for Austin-based American Gateways, which serves refugees and other immigrants, said by phone: \"The fact that individuals are eligible to apply for green cards if they have a qualifying relative, somebody who can apply for them, is old news.\"", "Drelichman and others stressed that attaining citizenship, for any immigrant, is a multistep process. \"Only some DACA recipients will be eligible for green cards,\" Drelichman said. \"And the path from green card to citizenship is long and requires meeting certain obligations, including payment of federal income taxes, at least three years of continual legal permanent residency, and passing the\" required \"civics and history exam,\" Drelichman said. \"There is no direct route to citizenship uniquely available to DACA holders.\"", "Employing advance parole", "We dug into advanced parole after hearing back from Arwen FitzGerald, a USCIS spokeswoman, who reaffirmed by email that an estimated 40,000 DACA recipients have received Legal Permanent Resident status and another 1,000 have become citizens.", "FitzGerald also said: \"The majority of these cases received their status through a grant of advance parole.\"", "Separately, the Fact Checker at The Washington Post said in a Sept. 7, 2017, analysis that Grassley’s release failed to account for DACA recipients who wouldn’t have needed advance parole to seek legal residency because the beneficiaries had previously entered the U.S. with visas and not left in the meantime. All told, that story estimated that about 3,000 DACA recipients may have used the advance parole strategy to pursue legal residency.", "Advance parole, experts told us, reflects an element of immigration law that permits certain people living in the U.S. without legal authorization--including some members of the military and some juveniles-- to travel to a home country for a specified purpose and then have the opportunity, with federal approval, to return--and no longer be considered someone who’d entered the U.S. without permission.", "That clean-slate distinction can provide a lift because under U.S. law, it’s more difficult for someone living in the country after entering without legal permission to seek legal status.", "‘An important strategy’", "In a June 2016 memo on advance parole options for DACA recipients, the San Francisco-based Immigrant Legal Resource Center, which says it focuses on advancing immigrant rights, said DACA recipients approved for advance parole will, on return, \"be paroled into the U.S., which is considered a lawful entry. This reentry with parole allows some of those immigrants more opportunities to seek permanent residence,\" according to the memo, which otherwise called such a request \"an important strategy to consider.\"", "DACA recipients (unlike other immigrants seeking advance parole) must present a specific humanitarian, educational or employment reason for traveling to another country, the memo noted. Still, the center advised, someone who obtained advance parole wasn’t guaranteed re-entry. \"When an advance parole recipient presents herself at a U.S. port-of-entry upon her return,\" the center said, \"she will be subject to inspection by an immigration official who will make a discretionary decision as to whether she will be paroled into the United States.\"", "As Trump rescinded the DACA program, Homeland Security said new applications from DACA recipients for advance parole would no longer be accepted.", "Lawyers comment", "Drelichman, among expert attorneys we reached, called Paxton's statement \"very misleading.\" If \"you have DACA\" status, she said, \"it doesn’t necessarily mean you’ll be a U.S. citizen.\"", "David Leopold, a Cleveland immigration lawyer and former president of the American Immigration Lawyers Association, also was critical, deeming Paxton’s claim \"a gross mischaracterization\" of DACA, which did not confer citizenship, Leopold said.", "A San Diego immigration attorney, Cesar Luna, noted by phone that whether a person landed advance parole or not, she or he still would have needed a sponsoring immediate family member to pursue citizenship. \"You have to have another latch,\" Luna said.", "Our ruling", "Paxton said President Obama used the order creating DACA \"to unilaterally confer U.S. citizenship.\"", "It’s flat-out incorrect to say that Obama via DACA conferred citizenship on anyone. That’s not how the system works, and the attorney general should know better. This unsupported characterization traces to a few DACA recipients--about a tenth of 1 percent—who gained citizenship in part by returning from abroad with a clean slate in accord with existing laws not amended by DACA.", "We find the claim incorrect and ridiculous. Pants on Fire!", "PANTS ON FIRE – The statement is not accurate and makes a ridiculous claim. Click here for more on the six PolitiFact ratings and how we select facts to check.", "Press release, \"AG Paxton Applauds President Trump’s Decision to Phase Out DACA,\" Texas Attorney General Ken Paxton, Sept. 5, 2017", "Email, Jessica Pumphrey, communications associate, Pew Research Center, Sept. 13, 2017", "News analysis, \"DACA has shielded nearly 790,000 young unauthorized immigrants from deportation,\" Pew Research Center, Sept. 1, 2017", "Memo from Janet Napolitano, Secretary of Homeland Security, \"Exercising Proset¢orial Discretion with Respect to Individuals Who Came to thei.Jnited States as Children,\" June 15, 2012", "Email, Kayleigh Lovvorn, media relations specialist, Communications Division, Office of Attorney General Ken Paxton, Sept. 7, 2017", "Story, \"Did Obama allow a ‘back door’ to citizenship through DACA?,\" the Fact Checker, The Washington Post, Sept. 7, 2017", "Press release, \"Data Indicate Unauthorized Immigrants Exploited Loophole to Gain Legal Status, Pathway to Citizenship,\" U.S. Sen. Chuck Grassley, Sept. 1, 2017", "Email, Arwen FitzGerald, public affairs officer, U.S. Citizenship and Immigration Services, Department of Homeland Security, Sept. 7, 2017", "Document, \"Fact Sheet: Modes of Entry for the Unauthorized Migrant Population,\" Pew Hispanic Center, May 22, 2006", "Memo, \"DACA, Advance Parole, and Family Petitions,\" Immigrant Legal Resource Center, June 2016", "Memo from Elaine C. Duke, acting Secretary of Homeland Security, \"Memorandum on Rescission Of Deferred Action For Childhood Arrivals (DACA),\" Sept. 5, 2017", "Phone interview, Natalia Drelichman, director of legal programs, American Gateways, Sept. 7, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]