["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "The U.S. achieved energy independence during Donald Trump’s presidency according to production versus consumption, but if you factor in imports and exports, it was far from it.", "President Joe Biden’s cancellation of the project won’t affect energy production, meaning it won’t affect U.S. energy independence.", "The pipeline would have transported oil extracted in Canada, not the U.S.", "During a March 2 radio appearance on the Marc Cox Morning Show on 97.1 KTFK, Former Missouri Gov. Eric Greitens told listeners he’s evaluating the possibility of running for Senate in 2022. Such a run became more probable after Sen. Roy Blunt announced that he wouldn’t run for another term.", "While explaining his views and would-be platform, Greitens attacked President Joe Biden’s energy policy and praised former President Donald Trump’s. He specifically went after Biden for nixing the Keystone XL pipeline project.", "\"Look at what he did, for example, coming into office and killing the Keystone XL pipeline,\" Greitens said. \"Not only did he kill 11,000 jobs with the stroke of the pen, he also imperiled one of Donald Trump's most significant achievements, which was that we had achieved American energy independence under President Trump.\"", "Repeated attempts to reach Greitens via his website and social media were unsuccessful.", "On Biden’s first day as president, he signed an executive order revoking the permit for construction of the Keystone XL pipeline, an 875-mile pipeline that would have carried a heavy crude oil mixture from Alberta to Nebraska. This led to the project being suspended in the early days of construction. It was originally authorized by then-President Trump in March 2019 but met with criticism over its effect on the environment and its encroachment on indigenous peoples’ territory.", "PolitiFact has already looked at statements claiming that the order killed 11,000 jobs before and rated them Half True. But we wanted to take a closer look at the rest of Greitens’s statement.", "Achieving complete energy independence was one of Trump’s big campaign promises and something he worked for while in office. PolitiFact tracked most of Trump’s campaign promises, including this one — rating it a Compromise.", "There are two generally accepted definitions of energy independence.", "One says that energy independence occurs when the country produces more energy than it consumes. By that definition, the U.S. achieved energy independence in April 2019.", "The U.S. Energy Information Administration releases a monthly report tracking energy statistics. According to that report, the U.S. produced 7.918 quadrillion Btu in November 2020. (A British thermal unit, or btu, is a measurement of energy consistent with the amount of heat required to raise the temperature of a pound of water by 1 degree Fahrenheit.) In that same month, the U.S. consumed 7.603 quadrillion Btu.", "Some experts prefer a different definition of energy independence: no energy imports. Here, the U.S. doesn’t have to rely on other countries or be subject to global market disruptions. It’s independent from the global market. By this definition, the U.S. is far from achieving energy independence. The Energy Information Administration’s monthly report shows that the U.S. imported 1.598 quadrillion Btu in November 2020.", "But if the U.S. is producing more energy than it consumes, why is it importing energy?", "Well, much of the energy the U.S. produces is exported to other countries. Of the 7.918 quadrillion Btu the U.S. produced in November 2020, it exported 1.958 quadrillion. This left the country short of the 7.603 Btu Americans consumed that month, so energy was imported to make up the difference.", "So why does the U.S. export so much energy?", "According to the American Petroleum Institute, a group that represents the oil and gas industry, companies need to in order to refine it properly. Crude oil is not a consistent homogenous product, it says. Different types of crude oil — particularly those with different viscosities or sulfur levels — require different types of refinery infrastructure to process it properly. Not all of the oil extracted from U.S. soil can be processed well in the U.S.", "This claim circulated around social media in the days after Biden’s executive order and other similar actions. PolitiFact found it to be Mostly False.", "This claim relies on the notion that canceling the Keystone Pipeline would decrease American energy production.", "However, the pipeline would be transporting oil extracted in Canada. Energy production is defined as the amount of primary energy extracted from nature, so this won’t affect the amount of energy the U.S. actually produces, only potentially the amount it imports and where it is imported from.", "Greitens said that when Biden canceled the Keystone XL pipeline, he \"imperiled one of Donald Trump's most significant achievements, which was that we had achieved American energy independence under President Trump.\"", "According to one definition of energy independence, the U.S. achieved energy independence under Trump. Another definition says it means no net imports. Either way, his claim that Biden’s action threatened that energy independence doesn’t hold up. The action won’t affect U.S. energy production, only imports.", "We rate this Mostly False.", "97.1 KTFK, The Marc Cox Morning Show, March 2, 2021", "The White House, Executive Order on Protecting Public Health and the Environment and Restoring Science to Tackle the Climate Crisis, Jan. 20, 2021", "TC Energy, Keystone XL Project Overview, accessed March 10, 2021", "The White House, Presidential Permit, March 29, 2019", "PolitiFact, How Biden’s Keystone XL pipeline executive order affects American jobs, Jan. 21, 2021", "PolitiFact, Trump-O-Meter: Achieve energy independence, July 15, 2020", "U.S. Energy Information Administration, Monthly Energy Review, Feb. 23, 2021", "EnergyEducation.ca, Energy Production, accessed March 10, 2021", "The American Petroleum Institute, Why the U.S. nust import and export oil, June 14, 2018", "PolitiFact, Do Biden’s executive orders have any effect on US energy independence?, Feb. 18, 2021", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]