["Following the Murshidabad triple murder case, a quotation ascribed to journalist Ravish Kumar has been shared on social media. “बंगाल में हिन्दू मरे हैं इसलिए मुझे कोई फर्क नहीं पड़ता –#रविश कुमार #Ndtv” (Those killed in Bengal are Hindus, so it makes no difference to me- translation). The comments on the post make it evident that a section of social media users believe such a statement has been made by Kumar.", "We found that several users have shared it on Facebook with the narrative that this statement has been made by Ravish Kumar.", "The alleged quote has been shared in Facebook groups, attracting several likes and shares.", "The statement attributed to Ravish Kumar regarding the Murshidabad triple murder case is fake. In a conversation with Alt News, Kumar rubbished the statement. He said, “I have not said this, but it has been shared in my name. Ever since the brutal murder of the teacher and his family in Murshidabad, even before the police investigates, I have been made a target. All kinds of memes were circulated in UP and Bihar. I can never be a supporter of violence.” (translation).", "Had Ravish Kumar indeed made such a controversial statement, it would invariably have been covered by mainstream media. However, we found no news report to the effect.", "On October 8, in Murshidabad, West Bengal, a family of three – Bandhu Pal, his pregnant wife and 8-year-old son – was brutally murdered. Following the incident, the BJP claimed that Pal was an RSS worker. Some media organizations reported this claim as true. An attempt to communalize the incident was observed on social media. However, police investigation revealed that the accused in the case was one Utpal Behera, and the murder was the result of a monetary dispute.", "It may be reiterated that the statement ascribed to Ravish Kumar and shared on social media is fake. In the past, several such fake quotations ascribed to Kumar have been circulated.", "Donate Now", "Kinjal Parmar holds a Bachelor of Science in Microbiology. However, her keen interest in journalism, drove her to pursue journalism from the Indian Institute of Mass Communication. At Alt News since 2019, she focuses on authentication of information which includes visual verification, media misreports, examining mis/disinformation across social media. She is the lead video producer at Alt News and manages social media accounts for the organization.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]