["By Saranac Hale Spencer", "Posted on April 20, 2018", "Q: Are Muslim nurses excused from washing their hands before medical procedures in Britain?", "A: No. That is an old misrepresentation that has been circulating online since 2010.", "A false story that started in Britain eight years ago has immigrated to America.", "In 2010, the website for the far-right British National Party claimed that the country’s National Health Service had changed its hygiene rules to allow Muslim nurses to skip washing their hands before seeing patients. It wasn’t true, but the claim had an appeal that allowed it to re-emerge several times over the years — including in 2013, 2014 and 2016. In March, it showed up on a website called hardcoreUSAnews.com.", "That recent version concludes: “So it’s true. Sharia law is actually hazardous to your health. Wonder if it would be possible to get a Surgeon General’s warning slapped on every Koran sold in the U.S.?”", "That story was posted on Facebook page called World Against Terrorism, which has more than 35,000 followers. Some Facebook users flagged the story as potentially false. It is.", "The original claim from the British National Party was posted shortly after the United Kingdom’s Department of Health updated its recommendations on uniforms for health care workers in March 2010.", "The original story said, in part: “female Muslim staff will now be exempt from the rule that all personnel be scrubbed and bare below the elbow.” That is a complete misrepresentation of what the amended recommendations from the department actually advised.", "After convening a group of Islamic scholars, chaplains, health policy makers, and infection prevention experts, the department recommended that uniforms can include long sleeves when the worker is not directly caring for patients and workers can use disposable forearm covers when they are also using gloves. The covers, with elastic at the elbow and wrist, are to be treated the same as gloves. In all instances, the guidance states, “Strict procedures for washing hands and wrists must still be observed.”", "That clear requirement for hand washing is made at least twice in the document.", "Still, hardcoreUSAnews.com wrote in its recent story: “Muslim nurses in the UK have now been granted the option of participating in medical operations without washing their hands.”", "That’s just not accurate.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk false stories flagged by readers on the social media network.", "“Islamic Colonisation of Britain Continues: NHS Relaxes Hygiene Measure to Accommodate Muslim Staff but Bans Crucifix.” BNP.org.uk. 11 Apr 2010.", "“U.K Hospitals: Muslim Surgical Nurses, Actually All Muslim Nurses, No Longer Required To Wash Their Hands….” theconservativetreehouse.com. 29 Apr 2013.", "“Muslim Nurses Refuse To Wash Hands Before Operations, Say It ‘Compromises Religious Beliefs.” jewsnews.co.il. 20 Oct 2014.", "“Muslim Nurses refuse to wash hands in UK Hospitals according to Sharia Law.” terrornewsnetwork.com. 9 May 2016.", "“MUSLIM NURSES REFUSE TO WASH HANDS BEFORE OPERATIONS, THE REASON WHY IS INSANE.” hardcoreUSAnews.com. 12 Mar 2018.", "Department of Health. “Uniforms and workwear: Guidance on uniform and workwear policies for NHS employers.” NationalArchives.gov.uk. Mar 2010.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]