["About this rating", "On 12 June 2015, a computer graphics wunderkind by the name of Kaleb Lechowski uploaded a video to YouTube that seeming showed a rather large spider breaking out of a banana skin in the same manner that a chick fights its way out of an egg shell:", "In September 2016, that video began making the rounds online and left many viewers wondering whether it was real. That was easily determined by noting that the end of the video included a copyright notice crediting Lechowski, who first drew public attention with the 2013 dystopian animated short film \"R'ha.\" That film was so convincingly animated that Lechowski captured the attention of Hollywood:", "Despite being the work of a student, R'ha is so good it's already attracted the attention of Hollywood executives. After seeing Lechowski's creation online, Scott Glassgold, of the managing company IAM Sports & Entertainment, was impressed. \"His work is not only professional, it's extraordinary,\" Glassgold [said]. \"There are shots in there that look like they are from a 150-million-dollar movie.\" Glassgold has experience with science fiction, [and] he sold the shorts Rosa and True Skin to studios last year.", "Lechowski is currently in the process of turning \"R'ha\" into a full-length film. The short, which was shared widely across the Internet, tells a dark, futuristic story of a planet inhabited by machines enslaved by lizard-like aliens who rebel against their captors. In the film, a machine interrogates an alien using electrical shock as a mechanism of torture.", "Aside from his background as a CGI artist, Lechowski's YouTube page seems to indicate that he either has a penchant for creating animated insects, or he has a major infestation problem in his apartment. One video shows a very large centipede-like insect crawling out of a speaker, while another depicts a spider roughly the size of his hand hanging out on his wall. In yet another video, he throws an object at his wall to scatter a virtual colony of spiders.", "Lechowski is a resident of Berlin, Germany, and according to Mashable, was educated at Berlin's Mediadesign Hochschule. When the banana video was released in 2015, Lechowski acknowledged it was fake:", "I used a chopstick to pierce the banana from behind. Then I removed the stick from the image and inserted a spider that I created, using Blender, the 3D software.", "There's no doubt Lechowski has a promising career ahead of him in cinema and animation, as long as he doesn't get overrun by the apparent virtual insect farm in his apartment.", "Franceschi-Bicchierai, Lorenzo.   \"22-Year-Old's Sci-Fi Digital Short Gets Hollywood's Attention.\"\r\n    Mashable.   14 January 2013.", "Guillory, Nick.   \"People Are Freaking Out Over This Video of a Spider Coming Out of a Banana.\"\r\n    BuzzFeed.   12 June 2015.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]