["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "It’s one of Margaret Thatcher’s most memorable quotes, spoken to President George H.W. Bush after Iraq’s 1990 invasion of Kuwait: \"Remember, George, this is no time to go wobbly.\"", "It evokes the image of a weak-spined Bush, bolstered by the Iron Lady.", "Dick Cheney, the defense secretary who would become vice president, recently called it \"an old wives’ story.\"", "And we said: Really?", "Cheney fondly recalled the former British prime minister, who died Monday, in an interview that day with Fox News anchor Greta Van Susteren.", "Van Susteren: \"But there's that famous quote where, apparently, she told President Bush 41 not to go wobbly.\"", "Cheney: \"That's not true.\"", "Van Susteren: \"That's not true?\"", "Cheney: \"Not true, no.\"", "Van Susteren: \"That's a falsehood.\"", "Cheney: \"An old wives' story. There was never any doubt about what the president was doing. He didn't need any bucking up.\"", "The same day, the Christian Science Monitor published: \"Margaret Thatcher: 'This is no time to go wobbly' and other memorable quotes.\" The New York Times mentioned the line in her obituary.", "Is the quote just \"an old wives’ story\"?", "Bush and Thatcher", "We’ve reviewed speeches, transcripts, books and more, and we can tell you: Bush and Thatcher agree that she said it.", "Bush himself publicly told the story in a 1991 speech as he awarded Thatcher the Medal of Freedom. He mentioned it in a 1998 book. She mentioned it in her 1993 memoirs and in a Frontline interview.", "But the popular account of her admonition that \"this is no time to go wobbly\" has taken on a life of its own — one doesn’t match Bush and Thatcher’s accounts.", "In Bush and Thatcher’s versions, it happened during a phone call three weeks after Iraq invaded Kuwait.", "The leaders disagreed about how to respond to ships leaving Iraq in defiance of U.N. sanctions. The Bush administration, at the urging of U.S. Secretary of State Jim Baker, wanted to delay a few days to win support from the Soviet Union through the U.N. Security Council — a historic collaboration Baker later said marked the true end of the Cold War.", "Thatcher, on the other hand, urged prompt action.", "Bush says in his 1998 book she warned him \"this is no time to go wobbly\" around Aug. 22 as he explained why they would delay using force until they got specific authorization from the U.N. on Aug. 25. Thatcher says in her 1993 memoir she warned \"this was no time to go wobbly\" as he explained on Aug. 26 why, even with new U.N. authorization to enforce sanctions, they would let a ship through.", "But some accounts place the quote earlier — on Aug. 2, the same day that Iraq invaded. That timing suggests Thatcher bolstered Bush’s early response, such as his declaration Aug. 5 on the White House lawn that \"this will not stand, this aggression against Kuwait.\"", "In one account, she made the remarks on Aug. 2  in \"an aside at an Aspen Institute conference,\" as reported by the Christian Science Monitor.", "In another, she made the comment on that same trip to Aspen, Colo., but in the vacation home of diplomat Henry Catto, according the New York Times, which cited Catto’s autobiography.", "But those accounts don’t match the recollection of Philip Zelikow, a National Security Council staffer under Bush, or of Bush’s national security adviser, Brent Scowcroft, who spoke about it in 1996. Both were part of the Aspen trip.", "\"The ‘wobbly’ comment has indeed been widely misunderstood and long ago became a factoid,\" Zelikow told PolitiFact.", "Zelikow, now a history professor and associate dean at the University of Virginia, recalled the encounter as part of an oral history project for the University of Virginia’s Miller Center.", "\"I remember her using that line later in the context of arguments over the rules of engagement in the embargo and so forth,\"  Zelikow said in April 2000. \"There was an argument about whether we should be willing to fire on Iraqi ships, and there were a number of these fairly complicated conversations later in August and then in September.\"", "In any telling, Thatcher warned Bush against wobbliness in August or September 1990. The precise date — and, especially, whether he needed such advice — is a matter of some dispute.", "But by March 1991, the phrase had entered White House lore, the president himself said.", "\"Those who work with me in the White House know we use that expression often and have used it during some troubling days,\" Bush said in his medal speech for Thatcher. \"And never, ever will it be said that Margaret Thatcher went wobbly.\"", "Our ruling", "Cheney called \"that famous quote\" nothing but \"an old wives' story.\" But Bush and Thatcher themselves recount a phone call near the end of August 1990 in which Thatcher admonishes \"this is no time to go wobbly.\"", "Popular accounts of the \"wobbly\" quote shift the statement to the beginning of August, giving it an early starring role that several insiders dispute.", "Instead, Bush and Thatcher describe a later, narrower discussion about when and how to enforce U.N. sanctions. Still, they agree she made the comment, and Bush says it became a common expression around the White House. We rate Cheney’s claim False.", "Fox News, \"Dick Cheney pays tribute to Margaret Thatcher,\" April 8, 2013", "CQ Newsmaker Transcripts, \"Former Vice President Richard B. Cheney Interviewed on Fox News,\" April 8, 2013, subscription only", "Email interview with Philip Zelikow, associate dean for the Graduate School of Arts and Sciences and White Burkett Miller professor of history, University of Virginia, April 10, 2013", "George H.W. Bush Presidential Library and Museum, \"Remarks Upon Presenting the Presidential Medal of Freedom to Margaret Thatcher,\" March 7, 1991", "George H.W. Bush Presidential Library and Museum, declassified confidential memo of meeting with President Carlos Andres Perez of Venezuela, May 3, 1991", "Margaret Thatcher Foundation, \"Remarks by President Bush ('This will not stand, this aggression against Kuwait'),\" Aug. 5, 1990", "Margaret Thatcher Foundation, \"Gulf War: Bush-Thatcher phone conversation (no time to go wobbly) [memoirs extract],\" 1993", "Frontline, \"Oral history: Margaret Thatcher,\" accessed April 9, 2013", "\"A World Transformed,\" by George H.W. Bush and Brent Scowcroft, Alfred A. Knopf, 1998", "\"The Iron Lady: Margaret Thatcher, from Grocer's Daughter to Prime Minister,\" by John Campbell, Penguin, Oct. 25, 2011", "\"Ambassadors at Sea: The High and Low Adventures of a Diplomat,\" by Henry E. Catto, University of Texas Press, 1998", "\"Cold War endgame: oral history, analysis, debates,\" edited by William Curti Wohlforth, Penn State Press, 2003", "Associated Press, \"Thatcher Bucked Up Bush With Some Tough Advice During Gulf Crisis,\" March 8, 1991, via Nexis", "Washington Post, \"Bush Honors 'Indomitable' Thatcher With the Medal of Freedom,\" March 8, 1991, via Nexis", "Associated Press, \"Thatcher To Bush: `No Time To Go Wobbly,'\" March 8, 1991", "Christian Science Monitor, \"Margaret Thatcher: 'This is no time to go wobbly' and other memorable quotes,\" April 8, 2013", "New York Times, \"‘Iron Lady’ Who Set Britain on a New Course,\" April 8, 2013", "New York Times, \"Henry E. Catto Jr., Who Served 4 Presidents, Dies at 81,\" Dec. 21, 2011", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]