["By Angelo Fichera", "Posted on May 8, 2019", "Popular social media posts claim that climate change is a “made-up catastrophe,” despite a large body of evidence that supports the scientific consensus that it is real.", "Comprehensive national and international reports in the last year alone have offered warnings about the impacts of climate change. The United Nations’ Intergovernmental Panel on Climate Change published a special report about the ramifications of continued warming, for example, and the U.S. government highlighted current and future risks in its National Climate Assessment.", "But a post liked by thousands on Instagram and shared repeatedly throughout social media claims climate change isn’t real, calling it a “made-up catastrophe used by globalists & socialists to instill fear and guilt to tax, regulate, and remove our freedoms while pretending to be saving the planet.”", "There’s a lot to unpack in that statement, but we’ll focus on the core falsehood: that climate change is a “made-up catastrophe.”", "Climate change is actually understood through a large body of scientific evidence that has been gathered over many years. The theory of the greenhouse effect — that greenhouse gases such as carbon dioxide trap the sun’s heat in the atmosphere — has been repeatedly proven since it was first proposed in 1824.", "Today, NASA notes, studies show that “97 percent or more” of active climate scientists believe human-caused warming is occurring. The agency calls the fact that “Earth’s climate is warming” a matter of “scientific consensus.”", "The 2018 National Climate Assessment — prepared by the U.S. Global Change Research Program, which involves 13 federal departments and agencies — states that “global average temperature has increased by about 1.8°F from 1901 to 2016, and observational evidence does not support any credible natural explanations for this amount of warming; instead, the evidence consistently points to human activities, especially emissions of greenhouse or heat-trapping gases, as the dominant cause.”", "It adds: “Sixteen of the last 17 years have been the warmest ever recorded by human observations.”", "The U.N.’s Intergovernmental Panel on Climate Change, as we’ve written before, found that it is “extremely likely” — defined as being between a 95 and 100 percent probability — that the majority of the increase in global average surface temperature between 1951 and 2010 was due to human activities.", "Climate change effects are already being felt, the federal National Climate Assessment report said — citing the impact of higher temperatures on droughts, extreme weather events, coral reef ecosystems and more.", "The U.N.’s 2018 special report warns of exacerbated risks — including sea-level rise, loss of biodiversity, species extinction, crop loss, and limits on water supplies and economic growth — if trends continue.", "But to say climate change is a “made-up catastrophe” is to ignore the scientific conclusions established by actively publishing climate scientists from around the world.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "Impacts, Risks, and Adaptation in the United States: Fourth National Climate Assessment, Volume II. U.S. Global Change Research Program. 2018.", "McDonald, Jessica. “The Science Trump Got Wrong in the Post Interview.” FactCheck.org. 28 Nov 2018.", "“Scientific Consensus: Earth’s Climate is Warming.” NASA. Accessed 7 May 2019.", "Special Report: Global Warming of 1.5 ºC. United Nations Intergovernmental Panel on Climate Change. 2018.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]