["About this rating", "A warning (reproduced above) that became very popular on Facebook in mid-January 2016 held that criminals were posing as lost motorists, gaining the trust of fellow drivers before slashing their faces and robbing them.", "This version of the face-slasher warning was typically accompanied by a photograph purportedly depicting an unfortunate victim of this form of crime:", "That photograph was real but stemmed from an entirely separate and unrelated incident. The individual depicted was Mob Wives television personality London Rene, who was stabbed during a nightclub altercation in January 2015.", "However, the warning itself came well before the image later attached to it. On 12 February 2014 the Singapore Times published an article reporting that the warning first circulated via text message in Singapore:", "The police have checked and confirmed that no reports have been lodged on cases of slashing and robbery targeted at car drivers. It comes in response to a text message being circulated among members of the public alleging that several cases have occurred.", "The text message warned drivers not to open their car window if someone, holding on to a name card, knocked and asked for directions. Once the window is wound down, the attacker would use a cutter placed under the name card to slash the victim's face before robbing them, claimed the text. It also said that six car owners have already made police reports.", "On the same date, the Singapore Police Force addressed the rumor on their official Facebook page, noting that\nthey had \"checked and confirmed that no reports have been lodged on such incident\" and cautioning residents against \"spreading unsubstantiated information which may generate unnecessary public alarm, causing fear and panic in the community\":", "“Cutters disguised as name cards used to slash and rob car owners”We note that a text message has been circulating...", "Posted by Singapore Police Force on Wednesday, February 12, 2014", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]