["A Facebook post, which we’ve archived here, shares one of the many misleading images online purporting to show content from South Africa's sex education curriculum with a caption that reads, 'This is what your government will be teaching grade 4's (ten year Olds) in 2020.'", "The Facebook user who shared the post, Vytjie Mentor, is a South African politician. An ex-member of the country's leading party, the African National Congress (ANC), she joined the African Christian Democratic Party (ACDP) in March 2019.", "AFP has contacted the African Christian Democratic Party (ACDP) for comment.", "A Google reverse search image of the excerpt led us to an Afrikaans version of the children’s book in a (paywalled) Netwerk24 news article dated August 17, 2018. The website was sent images of the book’s cover, the page excerpt and the index page showing its publishing information.", "The book \"Het die Ooievaar My Gebring?\", as seen in the Afrikaans-language article, is a translated book by Richard Pooler originally published in English as \"Did the Stork Bring Me?\". It has been released by various publishers around the world, including in 1991 by Faircape Books, in 1993 by Struik Uitgewers and again in 2003 by Ampersand Press, according to the index page. It is subtitled, \"An Illustrated Guide to the 'Facts of Life' and AIDS for Curious Kids\".", "A search for the book online shows it is no longer available for purchase.", "A spokesman for South Africa's Department of Basic Education (BDE) Elijah Mhlanga said on Twitter that the department is not familiar with the book and that it’s not part of the curriculum.", "FAKE NEWS ALERT!\n\t\tThis is an old picture. Very old image that keeps doing the rounds. We don't know it. It's not DBE book. We have been repeating the same thing and we will not get tired of distancing ourselves from it because it's not our book. pic.twitter.com/hm85QFPkKA", "Another set of images we’ve archived here and here on Facebook, have been shared over 6,000 times, alleging similar graphic content will be used to teach children in primary schools in 2020.", "Some of the comments on the posts show the concern and outrage some parents felt at seeing the proposed imagery.", "However, an internet search for HOW A BABY IS MADE and author Per Holm Knudsen as seen in one of the images, finds this article about the “most traumatising children’s book in the world” published in 1975 by Piccolo Books -- it can still be found here on Amazon.", "Another controversial book excerpt purportedly in the curriculum has gained mild traction on this Facebook post.", "The caption reads: “From next year, our grade 4 learners will be reading this book. How is this possible? Who agrees to this kind of teachings? Why is this happening now? Are we as a nation ready? This is the future of our children…”.", "The same book was also shared by a social media user who thought the images circulating might have come from a book called \"The Amazing True Story of How Babies Are Made\" by Australia-based author Fiona Katauskas.", "A Google search for the book reveals the illustration does come from the 2015 title, not from South Africa’s school curriculum.", "South Africa’s Department of Basic Education (DBE) said that ‘no new content’ has been added to the sex education curriculum, but that the lesson structure and support materials are being piloted in areas that have recorded high HIV infection rates and prevalence of sexual abuse.", "Comprehensive Sexuality Education (CSE) ‘has been part of the curriculum since the year 2000. The only change is that in 2015 the DBE developed Scripted Lesson Plans (SLPs) which are currently being tested in five (5) provinces in order to strengthen the teaching of CSE in schools,” said a statement from the department when it released all the lesson plans.", "#DBENews Basic Education Department releases Scripted Lesson Plans to the public to allay fears regarding Comprehensive Sexuality Education content: https://t.co/6pb16F7vmX@ElijahMhlanga pic.twitter.com/LvloQx43lb", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]