["About this rating", "Congressman Ryan Zinke is offering a commemorative \"ISIS Hunting Tag\" to people who donate to his campaign.", "The \"ISIS Hunting Tag\" is a government issued license to kill terrorists.", "On 24 March 2016, a Facebook page purporting to be that of Montana Rep. Ryan Zinke posted an offer for an \"ISIS Hunting Tag\":", "ISIS is getting stronger. Click here now to get your limited edition ISIS hunting tag for $15, and join Commander Zinke in the fight against ISIS -- together we'll send a message to Barack Obama that we must put an end to terrorism at home and abroad.", "The Facebook message redirected people to a campaign donation web site that further explained the message behind the tags:\nI'm proud to put 23 years of military service to work for you every day in Congress. But the policies coming out of the \"lead from behind\" Obama Administration are only making matters worse. Obama's foreign policy is a policy of retreat, which does nothing but create power vacuums and opportunities for emboldened terrorists.", "If you agree with me that we need to put an end to terrorists at home and abroad, then I need your support. Our campaign just printed a limited amount of these commemorative campaign stickers. If you donate $15 right now, I will send you a limited edition ISIS hunting tag.", "The tags drew mixed reactions. While some applauded Zinke for his stance on ISIS and the fight against terrorism, others criticized him for attempting to capitalize on people's fears by posting his \"ISIS Hunting Tags\" shortly after the terrorist attack in Brussels:\nWhile our allies and friends from across the world from Istanbul to Brussels are facing another wave of terrorist violence that has targeted civilians, many Americans and their leaders are calling for sober reflection on how we can help prevent future attacks and how we can help those affected. Others, like Montana’s sole representative in Congress, Ryan Zinke, are more interested in cheap theatrical stunts that cheapen the lives lost in the attacks and turn them into opportunities to raise campaign cash.", "The tags are real, in the sense that they exist and can be purchased.  Whether or not these tags are an official part of Zinke's campaign is uncertain, as they originated with a Facebook page that wasn't verified (his official page is, but the tags don't show up on those, and there is a second campaign donation page that links from his official web site, as well). It's possible that Zinke created the pages and the \"ISIS tag\" campaign separately. It's also possible that it was set up by someone unrelated to the campaign (this is the internet, after all).", "In case the point was unclear, however, these tags do not provide anyone with an actual license to kill anyone, no matter how much is donated. The site, whether or not it belongs to Zinke's re-election campaign, does carry a disclaimer clarifying this point:\nDisclaimer: This is a commemorative sticker issued by the campaign. It is not a government issued hunting tag.", "We've reached out to Zinke's campaign for clarification and will update accordingly.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]