["The screenshots were posted here on February 13, 2021 in a Facebook post since shared more than 1,900 times.", "The post features three screenshots of New Zealand’s Prime Minister Jacinda Ardern.", "The Thai-language text above the screenshots translates in English as: “The Prime Minister of New Zealand encouraged people to do outdoor activities to prove that New Zealand has finally returned to normal as the majority of people have been vaccinated. During today's activity, no one had to wear a mask to cause them breathing problems.\"", "The post’s Thai-language caption reads in English: “So cool”.", "New Zealand has been widely praised for its handling of the pandemic, with just 25 deaths in a population of five million as reported by AFP.", "The Pacific island nation was ranked top among 98 countries for its pandemic response, with border closures, “go early, go hard” lockdowns and testing regimes largely keeping the virus at bay.", "The screenshots have been shared here, here and here alongside a similar claim.", "However, the claim is misleading.", "As of February 18, 2021, New Zealand has not started its Covid-19 vaccination drive. The government announced on February 15, 2021 it had received its first batch of coronavirus vaccines.", "Doses of the Pfizer-BioNTech jab would be given out to border and quarantine workers from February 20, after quality control checks, the health ministry said.", "New Zealand’s biggest city Auckland began a snap three-day lockdown on February 15 after three family members were found to be infected with that variant of the virus that emerged in Britain.", "The New Zealand government still advises people to wear masks or face coverings in addition to basic hygiene measures, in order to protect people against Covid-19. Here is a link to the government’s latest advice as of February 18.", "The screenshots in the misleading post were taken from a video that in fact shows Ardern participating in an annual barbecue event on New Zealand’s Waitangi Day.", "Google reverse image and keyword searches found this video which was livestreamed on Ardern’s official Facebook page on February 6, 2021.", "The video’s caption reads: “Good morning from Waitangi and our annual breakfast!”", "The Waitangi Treaty Grounds is where New Zealand's founding document was signed by indigenous Maori and representatives of the British crown in 1840.", "Below is a screenshot comparison of images in the misleading post (L) and in Ardern’s livestream (R):", "Further keyword search found this report published by 1 News, run by New Zealand's state-owned broadcaster TVNZ on February 6, 2021.", "The article’s headline reads: “Jacinda Ardern serves up Kiwi BBQ breakfast at Waitangi Day commemorations”.", "About 2,500 people turned up for the barbecue breakfast, although coronavirus fears prompted groups such as the Maori Party to stay away, TVNZ reported.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]