["About this rating", "On 21 April 2017, the Daily Mox web site reported that Frito-Lay had issued a recall of two of its products.", "Frito-Lay Recalls Jalapeño Flavored Lay’s Kettle Cooked Potato Chips and Jalapeño Flavored Miss Vickie’s Kettle Cooked Potato Chips Due to Potential Presence of Salmonella.", "Most people do not associate Salmonella with chips, but the bacteria is not limited to raw meats. In this case, the Salmonella could be found in the seasoning sprinkled on the chips.", "The article then includes the full text of a press release by Frito-Lay, which states:", "Frito-Lay today announced it is voluntarily recalling select Jalapeño Flavored Lay’s Kettle Cooked potato chips and Jalapeño Flavored Miss Vickie’s Kettle Cooked potato chips due to the potential presence of Salmonella in the seasoning.", "The Daily Mox story uses somewhat alarming language in its headline, warning readers, that:", "THIS IS A HEALTH HAZARD SITUATION WHERE THERE IS A REASONABLE PROBABILITY THAT THE USE OF THE PRODUCT CAN CAUSE SERIOUS, ADVERSE HEALTH CONSEQUENCES.", "This appears to be somewhat exaggerated. According to Frito-Lay, the recall was done out of \"an abundance of caution\" and no Salmonella had actually been found in any Frito-Lay product.", "This action is the direct result of a supplier’s recent recall of a seasoning blend which includes jalapeño powder that could contain Salmonella. Although no Salmonella was found in the seasoning supplied to Frito-Lay, the company has decided to recall these products out of an abundance of caution.", "No illness related to this matter has been confirmed to date.", "Nevertheless, the basic facts contained in the Daily Mox report were accurate as Frito-Lay did indeed issue a recall of two of its products on 21 April 2017. The company issued a statement on the recall, and the U.S. Food and Drug Administration (FDA) has an entry on it as well. Readers should be wary of fake online reports about product recalls. If in doubt, check the web site of the FDA, which tracks and publishes food and drink-related recalls, or the Consumer Product Safety Commission (CPSC), for most other types of consumer product recalls. You can also check the web site of the company that makes the product and look for a press release there about a reported recall.", "In July and August 2017, the Frito-Lay recall once again circulated as new news in an item titled: \"Alert!! One Of America’s Most POPULAR Potato Chip Brands Just Issued MASSIVE Recall- Throw Them Away NOW.\" However, the outdated claim simply rehashed the original recall notice, which was at the time several months old.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]