["About this rating", "An animated image purportedly showing cars narrowly missing each other at a busy intersection was posted to Imgur in October 2017:", "no you go, ok i'll go, ok , now you go. ok now i go.", "This gif, which has been posted with other captions, such as \"What kind of hick town\" and \"traffic without women,\" only shows a portion of the original video, which extends for about another 30 seconds and ends with a major crash involving a small yellow car, police cruiser, and a truck. This portion of the video, which you can view below, has a much more obvious CGI quality:", "If the unrealistic optics of the final crash sequence wasn't enough to convince viewers that the footage is fake, the original video was also labeled an \"experiment\" in \"visual effects.\"", "YouTube user Iñaki Merro uploaded the original video on 30 May 2017. Merro responded to several comments beneath his original post, explaining that the video was created with special effects and that he used the 3D modeling software SketchUp to create the crash sequence. Merro also said that he filmed several cars at this intersection and then edited the footage together to make it seem as if the cars were nearly crashing:", "Manfred Schwab: My guess: these are 2 one-way roads with a traffic light above. You film cars moving in either direction with decent distances between each other, and then overlay these two sequences. Certainly still a lot of editing work that it looks so much like real (incoming car completely hidden by outgoing car!).\nAs for the car crash: I watched a few other videos from Iñaki Merro, he seems to be quite good at editing artificial crashes (at least that's what I hope for the driver of the small car).", "Iñaki Merro: Thanks Manfred! your guess right, but i dont understand the term traffic light above! my english is not great.\nim learning visual effects, thanks for the support!", "Manfred Schwab: traffic light = semáforo.\nWas it shot at the crossing of Ciudad De Rodez and San Martín ?", "Iñaki Merro: Yes! im from Pígüé! BsAs Argentina! How do you know the the name of the streets?!", "Iñaki Merro: Waw! Yes, the crash is a simulation!", "Merro's YouTube page has several other experiments in visual effects. Here's another one of his videos which features exploding trucks, gun shots, and levitating vehicles:", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]