["About this rating", "On 1 May 2019, a quote ostensibly uttered by U.S. actor Sean Penn about his alleged desire to move to Venezuela in the event of President Donald Trump's re-election started to circulate on social media:", "This Facebook meme reads: \"Sean Penn: '[Venezuela President Nicolas] Maduro is way better than Trump, any day, no question about it ... If Trump wins again, I'm moving my family to Venzuela [sic] where they'll be safe!'", "This is not a genuine quote from the Oscar-winning actor. We could not find this quote in any news reports or interviews with the actor, and the Facebook poster who appears to have originally shared this quote provided no citations about where and when the actor ostensibly made this statement.", "The included image comes from an appearance Penn made on The Today Show in September 2018. While that interview generated at least one controversial comment — Penn said that the spirit of the \"MeToo\" movement had been to \"divide men and women\" — this interview did not include this alleged viral quote from the actor.", "Penn has previously voiced his support for Maduro, as well as his disdain for Trump, but it appears that this particular quote was made up as something the actor's critics believe he \"probably would say,\" but not something he actually said.", "Specia, Megan.   \"What Is Happening in Venezuela and Why It Matters.\"\r\n    New York Times.   30 April 2019.", "Stump, Scott.   \"Sean Penn Says Spirit of Much of #MeToo Movement is to 'Divide Men and Women.'\"\r\n    E! Online.   17 September 2018.", "Von Finn, Natalie.   \"Sean Penn Mourns Death of Venezuelan President Hugo Chávez.\"\r\n    E! Online.   5 March 2013.", "Kreps, Daniel.   \"Sean Penn: Donald Trump Is 'An Enemy of Mankind.'\"\r\n    Rolling Stone.   13 January 2018.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]