["By Eugene Kiely", "Posted on March 31, 2017", "As the Senate considers Judge Neil Gorsuch for the Supreme Court, senators on both sides have engaged in partisan spin over the number of votes required to approve his nomination:", "The Senate Judiciary Committee is schedule to vote April 3 on President Donald Trump’s nomination of Gorsuch to the U.S. Supreme Court after a one-week delay at the request of the Democrats. The Republican-controlled committee is expected to approve the nomination at that time and send it to the full Senate for a final vote, which Senate Majority Leader Mitch McConnell says will happen by April 7.", "The Republicans have 52 votes in the Senate, just one more than required for Gorsuch to be approved. But the Democrats have threatened to filibuster the nomination. Typically, the Senate majority leader can end a filibuster by filing a cloture motion, which if approved would place a limit on the floor debate and set a time for a vote. But a cloture motion requires 60 votes and, in this case, that would require at least eight Democrats to cross the aisle and vote with the Republican majority.", "It is this two-step voting process — which is rare for Supreme Court nominees — that is causing senators in both parties to spin the facts.", "Sanders, the independent senator who ran for the Democratic presidential nomination in 2016, frequently claims that the Senate rules “require” 60 votes for a Supreme Court nominee. We wrote about an earlier instance of this, but the senator repeated it again in interviews on MSNBC’s “Morning Joe” on March 29 (at about the 5-minute mark) and CNN’s “State of the Union” on March 26.", "Sanders, March 29: Right now as you know, the rule, the current rule is that it requires 60 votes for a Supreme Court nomination.", "Sanders, March 26: [W]e have a rule that says, appropriately, I think, that for a Supreme Court justice, a lifetime term, one of the most important positions in the United States government, that it should require 60 votes, because that would make it bipartisan.", "In both cases, Sanders is referring to the 60-vote threshold that is required to pass a cloture motion and end a threatened filibuster. Sanders makes it seem like this is common practice, but it is not.", "The Senate adopted the cloture rule in 1917. At that time, a cloture motion could not be used to end debate on presidential nominees, and it required the approval of two-thirds of the senators present in order to pass. The rule was expanded in 1949 to include presidential nominees, and it was changed again in 1975 to require three-fifths, or 60 votes, to pass, according to the nonpartisan Congressional Research Service.", "But cloture motions have been filed only four times since 1949 on Supreme Court nominations. (See Table 4 of the CRS report.) It happened most recently in 2006, when President George W. Bush nominated Samuel Alito to the highest court. The cloture motion passed 72-25 on Jan. 30, 2006, and Alito was confirmed 58-42 a day later with four Democrats voting yes.", "In arguing against Gorsuch’s nomination, Sanders continually conflates the cloture motion (which requires 60 votes) with the nomination vote (which requires 51 votes). But a cloture vote is not required unless Democrats force one, as they did in 2006.", "Murphy, a Connecticut Democrat, declared his opposition to Gorsuch in a Facebook post that leaves a false impression regarding the level of Senate support for the current Supreme Court justices.", "Chris Murphy, March 28: I trust that if moving this nomination forward does not receive the support of at least 60 Senators, a threshold which the confirmation of every current Supreme Court Justice cleared, President Trump will then nominate someone less extreme, who can garner bipartisan support in the Senate.", "Murphy wasn’t in the Senate in 1991, but that year President George H.W. Bush’s controversial nominee, Clarence Thomas, was approved to sit on the high court by a slim 52-48 margin. Despite their concern about Thomas’ fitness to serve on the court, the Democrats did not attempt to filibuster his nomination, and the Republicans did not have to file a cloture motion.", "In that case, the Senate Judiciary Committee was deadlocked 7-7 after days of hearings that included explosive allegations by Anita Hill that Thomas had sexually harassed her when he was her supervisor at the Department of Education and the Equal Employment Opportunity Commission. In voting 7-7, the committee sent Thomas’ nomination to the Senate floor without recommendation.", "Shortly before the Senate vote, there were articles at the time that said the Democrats were considering a filibuster — which would have meant the Republicans would have needed to get 60 votes to end the debate on the nomination. At a Sept. 27, 1991, hearing of the Senate Judiciary Committee, Republican Sen. Orrin Hatch pointed out the irony of the Democrats using a filibuster to block an African American from the Supreme Court.", "“Before I got here this morning, I even heard talk of a filibuster,” Hatch said. “Now, that would really — wouldn’t that be just the greatest irony of all? The filibuster today is being used by both sides almost without care. But in the early days, I once felt that the filibuster was used solely in civil rights matters to stop the onward push for civil rights. Can you imagine liberals talking about filibustering the second black nominated to the Supreme Court of the United States of America? Shame.”", "In the end, the two parties reached an agreement to bring the nomination to the floor without requiring a cloture vote.", "Murphy spokesman Chris Harris objected to our characterization of the senator’s Facebook post, saying the senator was “very careful” in his wording. “He said ‘moving [the] nomination forward’ received the support of 60 Senators. That is 100% true,” Harris told us in an email.", "It’s true that Thomas’ nomination moved to the floor for a vote by unanimous consent. That means no senator objected to a floor vote, but Thomas did not have the support of 60 senators.", "Updated, March 31: This article was updated to include a response from Sen. Chris Murphy’s office, which objected to our characterization of the senator’s remarks as “false.” We originally wrote that Murphy “incorrectly said ‘every current Supreme Court Justice cleared’ a 60-vote threshold.” We changed that to say “Murphy left the false impression that ‘every current Supreme Court Justice cleared’ a 60-vote threshold.”", "The Democrats don’t have a monopoly on spinning the Supreme Court vote. GOP Sens. John Barrasso and John Thune gave incomplete accounts of past votes on Supreme Court nominees.", "In a CNN interview on March 29, Barrasso claimed “every Supreme Court vote in the United States Senate, for over 200 and some years, has been an up-or-down vote,” while Thune in a floor speech a day earlier said, “There has never been a successful partisan filibuster of a Supreme Court nominee.”", "We will look at these claims together because they deal with the few times when cloture was invoked on a Supreme Court nomination.", "First, Barrasso is technically right that every Supreme Court vote has been an up-or-down vote — because, as we noted earlier, it takes 51 votes to approve any nomination, including those to the high court. However, as we also noted, there were four times when Supreme Court votes were preceded by cloture votes. They occurred in 1968, 1971, 1986 and 2006.", "In three of the four cases, the cloture vote was successful, and the Supreme Court nominations were approved on a straight up-or-down vote. But it took 60 votes to get to an up-or-down vote, so it is misleading for Barrasso to suggest that it is unprecedented for the Democrats to demand 60 votes for Gorsuch’s nomination to advance.", "The one successful filibuster occurred in 1968, when President Johnson nominated Supreme Court Justice Abe Fortas to be chief justice. Thune’s office told us it did not count Fortas as a “successful partisan filibuster,” because Democrats and Republicans alike voted against cloture. That’s true. But the opposition was led by the Republicans and joined by Southern Democrats who were critical of what they viewed as the liberal rulings of Chief Justice Earl Warren’s court. The opposition was described by CQ Almanac as “the conservative coalition.”", "Here’s a quick recap, courtesy of CQ Almanac: On June 26, 1968, the day that Johnson made his appointment, a group of 19 Republican senators signed a letter opposing the nomination of Justice Fortas to replace the retiring Chief Justice Warren. As they did in 2016 when President Obama nominated Merrick Garland, the Republicans expressed the belief that a president in his last year in office should not be allowed to fill a Supreme Court vacancy.", "“It is the strongly held view of the undersigned that the next Chief Justice of the United States, and any nominees for vacancies on the Supreme Court should be selected by the newly-elected President of the United States, after the people have expressed themselves in November’s elections,” the 19 GOP senators wrote. “We will, therefore, because of the above principle, and with absolutely no reflection on any individuals involved, vote against confirming any Supreme Court nominations of the incumbent President.”", "Opposition to Fortas grew after committee hearings brought to light some damaging information, including “involvement of Fortas in White House affairs” and disclosure of a $15,000 payment that the justice received from American University for a nine-week seminar on law. “The money had been raised by his former law partner from among five former business associates, one of whom had a son involved in a federal criminal case,” CQ Almanac wrote.", "On Oct. 1, 1968, the cloture motion on Fortas’ nomination needed 59 votes — two-thirds of the senators voting that day — but it failed, 45-43, and President Johnson withdrew the nomination three days later at Fortas’ request. The cloture vote was supported by 35 Democrats and 10 Republicans.", "The Washington Post described Fortas’ defeat as a “successful 1968 GOP-led filibuster.” The New York Times described the debate as “partisan and often bitter.”", "“Justice Fortas was criticized for his liberal opinions while a Justice, his continuing practice of advising President Johnson on policy matters, and for what a number of senators viewed as excesses of the Warren Court,” the Times wrote. “When his supporters in the partisan and often bitter debate, failed to end a filibuster, Justice Fortas asked that his name be withdrawn.”", "It remains to be seen what will happen to Gorsuch’s nomination. If they are unable to get the 60 votes to end a filibuster, the Republicans could change the cloture rule to allow the motion to pass with 51 votes — the so-called nuclear option. It is unclear yet if the Republicans will do that. One thing is for sure: Both sides are spinning the facts.", "FactCheck.org Rating:", "Read More", "FactCheck.org Rating:", "Read More", "FactCheck.org Rating:", "Read More", "FactCheck.org Rating:", "Read More", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]