["About this rating", "A photograph purportedly showing eerily beautiful, red-tinted clouds over a large wildfire in California began making its way online in early August 2018:", "The wildfire in California burned through more than 270,000 acres in California in August 2018, making it the state's second largest fire in history. This photograph, however, didn't have anything to do with that enormous conflagration.", "This image images to show Altocumulus clouds taken from an airplane at sunset. Before this image was attached to the wildfire claim, it was shared with the following caption on Reddit: \"Altocumulus clouds & a sunset at 30,000ft.\"", "Interestingly, one of the comments on that 31 July 2018 post joked that it would be an interesting \"plot twist\" if this image were actually taken over California. A few days later, this photograph was in fact being shared with the claim that it showed \"Clouds over the California fires, 30,000 feet up.\"", "Some commenters asserted that this image was originally shared by meteorologist Owen Shieh and posted a screenshot purportedly showing Shieh's original Facebook message:", "HoaxEye, a Twitter account dedicated to debunking viral images, managed to contact both Shieh and Province and posted a screenshot of their correspondence. Province confirmed that he was the one who took the photograph and stated that the image actually shows a sunset somewhere over Hawaiian waters:", "I managed to contact the persons who posted/took the viral sunset photograph. They confirmed the facts:\nhttps://t.co/irt1DVt1QC ping @SwiftOnSecurity @debunker pic.twitter.com/GXHBGplwZL", "— HoaxEye (@hoaxeye) August 8, 2018", "Shieh also confirmed to us that this photograph was originally posted to his Facebook page (where it is only visible privately to friends) and stated that the viral claims attached to this image are incorrect.", "Michael Lowry, an atmospheric scientist, explained why these clouds appeared to \"glow\" red in the photograph (which he tweeted was taken near Hawaii, not California, and was unrelated to fires or volcanoes):", "This is woefully dishonest. This was taken from a C-17 ~40 min from Oahu, not CA (and not by Peter Singer). The glow is from a sun angle below the horizontal plane illuminating shallow altocumulus clouds. Not fires. Not lava. Thankfully I don't believe everything on the twitters. https://t.co/OLFKFrzioI", "— Michael Lowry (@MichaelRLowry) August 6, 2018", "This photograph also resembles other media capturing sunset views taken from altitudes just above a cloud layer:", "Wildfires do create unique-looking clouds, but they wouldn't resemble the ones shown in the viral photograph. CNN meteorologist Brandon Miller explained that pyrocumulus clouds often form over wildfires, as the extreme heat of those blazes forces air to rise rapidly:", "Normal cumulus clouds form because the sun's rays heat the ground, forming warm air that rises because it is less dense than the cooler air above. As it rises, the air cools and condenses to form the cloud.", "During a wildfire, however, the extreme heat from the flames forces air to rapidly rise. As the fire burns trees and other plant life it causes the water inside them to evaporate into the rising air. This additional moisture in the atmosphere condenses in the cooler air above, on smoke particles also produced by the fire.", "Here's a video from Accuweather about these pyrocumulus \"fire clouds\":", "McKay, Rich.   \"California Wildfire Becomes Second Largest in State History.\"\r\n    Reuters.   6 August 2018.", "Kalmowitz, Andy.   \"What Are Pyrocumulus Clouds?\"\r\n&nbsp   Accuweather.   Retrieved 7 August 2018.", "Jones, Judson.   \"How Wildfires Create Towering Pyrocumulus Clouds.\"\r\n    CNN.   25 July 2016.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]