["About this rating", "In January 2020, a photograph supposedly showing a group of KKK members marching behind a presidential campaign sign for Donald Trump and Mike Pence was circulated on social media, along with a message saying \"This is all you need to know about why you should vote Blue in 2020\":", "This is not a genuine photograph of KKK members holding a Trump-Pence sign. This a digitally manipulated image created from a photograph that originally featured a \"Fraternal White Knights of the Ku Klux Klan\" sign.", "The original photograph was taken in July 2009 and showed members of the Klan marching through Pulaski, Tennessee, in honor of Nathan Bedford Forrest, a Confederate army general who led the KKK in the 1860s:", "The original picture was taken by Spencer Platt and is available via Getty Images with the following caption:", "Members of the Fraternal White Knights of the Ku Klux Klan participate in the 11th Annual Nathan Bedford Forrest Birthday march July 11, 2009 in Pulaski, Tennessee. With a poor economy and the first African-American president in office, there has been a rise in extremist activity in many parts of America. According to the Southern Poverty Law Center in 2008 the number of hate groups rose to 926, up 4 percent from 2007, and 54 percent since 2000. Nathan Bedford Forrest was a lieutenant general in the Confederate Army during the American Civil War and played a role in the postwar establishment of the first Ku Klux Klan organization opposing the reconstruction era in the South. (Photo by Spencer Platt/Getty Images)", "While the photograph of the KKK holding a Trump-Pence sign is fake, Trump did receive some support from the infamous group during the 2016 election. The official newspaper of the KKK, The Crusader, endorsed Trump for president.", "But the Trump campaign publicly rejected the Crusader's endorsement: \"Mr. Trump and the campaign denounces hate in any form. This publication is repulsive and their views do not represent the tens of millions of Americans who are uniting behind our campaign.”", "Sakuma, Amanda.   \"KKK Paper 'The Crusader' Backs Trump; Campaign Rejects It.\"\r\n    NBC News.   2 November 2016.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]