["About this rating", "On July 28, 2019, an image supposedly showing two large whales swimming beneath the Samuel De Champlain Bridge in Quebec, Canada, started going viral on social media  (with the caption \"One of the largest blue whales ever caught on camera during a helicopter ride today\":", "One popular posting of this image (with more than 25,000 shares) used the caption: \"SCOOP DE L'HÉLICOPTÈRE TVA CE MATIN. Une baleine et son baleineau passant sous le nouveau pont Samuel-de-Champlain!\" or \"Scoop of the vat helicopter this morning. A Whale and its calf passing under the new Samuel De Champlain Bridge!\"", "This is not a genuine photograph of a whale and its calf beneath the Samuel De Champlain Bridge. This is a composite of at least two different photographs that was created by digital artist Umut Reçber.", "Recber posted this image to Instagram on July 26 along with the caption, \"Mother.\" Recber, whose Instagram page carries the quote \"everything you can imagine is real,\" also penned a brief note explaining that the image was a composite and not a genuine photograph:", "NOTE: This is my own digital manipulation study. It was created by bringing two photos together. Photoshop was used as a tool. Thanks to everyone who conveyed their best wishes to me for the artwork I have done. I hope you will be pleased with my work. Good day to everyone.)", "We're not entirely sure which bridge is pictured in this composite. The original image is available via stock photography websites and doesn't feature any large whales swimming beneath the bridge. Here's a side-by-side comparison of the composite image (left) and the original (right):", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]