["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "This photo has been digitally altered from its original image, with the words on the sign being changed from \"Lancaster County\" to \"Women of the Democrat Party.\" The altered image is viral on Facebook. We rate it False.", "A digitally manipulated photograph going around social media attempts to link a group of female Klu Klux Klan members to the Democratic party.", "The vintage black-and-white image shared on Facebook on Aug. 1 shows a group of women wearing KKK attire and holding a sign that reads: \"Women of the Democrat Party.\" A caption above the photo says, \"You gotta love history!\"", "The viral photo, which has more than 200 comments and 1,700 shares, was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The image is authentic, but it has been altered: The wording on the sign has been changed.", "A reverse-image search revealed that the original version of the photograph had one major difference – instead of \"Women of the Democrat Party,\" the sign actually says \"Lancaster County.\"", "The picture appears in Getty Images stock photos. Its caption doesn’t give an exact date that the photo was taken but does reveal the location:", "\"K.K.K. Arrive at Washington. Photo shows women members of the Klan from Lancaster County Pa.\"", "The photo is most likely from one of the large KKK marches on Washington that occurred in the mid-1920s.", "Timeline, a historical news website, published an article about the formation of a KKK branch for women. The same photo of the group of women appears in the story, with the caption: \"A contingent of women Ku Klux Klan members from Pennsylvania arrive in Washington D.C. for a march in 1926.\"", "A vintage photograph shared on social media shows a group of women KKK members posing with a sign that says \"Women of the Democrat party.\"", "While the women could have certainly belonged to the Democratic party, the sign’s wording in the photo has been digitally manipulated to link the party to the hate group.", "This altered image is False.", "Facebook post, Aug. 1, 2019", "TinEye, Reverse Image search, August 7, 2019", "Getty Images, Female Klan Members Arriving in Washington,", "Timeline, The KKK started a branch just for women in the 1920s, and half a million joined, June 28, 2017", "The Atlantic, When Bigotry Paraded Through the Streets, Dec. 4, 2016", "Mashable, Sept. 13, 1926  KKK Washington Parade, accessed Aug. 7, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]