["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "President Donald Trump waves as he boards Air Force One at Andrews Air Force Base, Md., on Sept. 30, 2020, the day after the first presidential debate of 2020. (AP)", "• Trump is wrong about the job gains on his watch; the actual increase is about 450,000 prior to the pandemic.", "• As for Obama and Biden, they saw gains of 916,000 if you start counting with the recovery from the Great Recession, which is the fairest comparison if you also ignore the losses under Trump during the pandemic.", "Reaching back to one of his core agenda issues from the 2016 presidential campaign, President Donald Trump touted his record on manufacturing jobs during the first presidential debate in Cleveland.", "Referring to the manufacturing sector, Trump said, \"I brought back 700,000 jobs.\" By contrast, Trump said, under President Barack Obama and Vice President Joe Biden, Trump’s 2020 opponent, \"They brought back nothing.\"", "Trump is exaggerating gains on his own watch, even before the coronavirus pandemic, and he’s offering a misleading assessment of what happened during the Obama administration.", "We looked at manufacturing employment data from January 2009, when Obama took office, through August 2020, the most recent month available. Here’s what the data looks like, with Obama’s tenure in blue and Trump’s in red.", "This shows that Trump is wrong to say that 700,000 manufacturing jobs were created on his watch. The actual rise prior to the coronavirus pandemic was about 450,000 manufacturing jobs. (If you do account for the recession prompted by the pandemic, which is not advisable since the economy is so volatile at the moment, manufacturing employment has declined by 237,000.)", "The situation under Obama is trickier to parse.", "During Obama’s entire tenure in the White House, manufacturing employment fell by 192,000. Keep in mind, though, that Obama inherited the Great Recession. A fair comparison between Trump and Biden excludes both recessions.", "From the low point of the recession in 2010, the manufacturing sector added 916,000 jobs on Obama’s watch. That was roughly seven years, about twice the amount Trump’s been in office, so on an annual basis, the manufacturing employment gains per year were roughly similar between the two presidents. In fact, you can see in the chart that the pace of increase was fairly constant for Obama’s final seven years and Trump’s first three years.", "In awarding Trump a Promise Broken for his pledge to bring back manufacturing, we also noted that another metric, gross manufacturing output by quarter, found nothing special on Trump’s watch. Manufacturing output rose during the first year and a half of Trump's presidency, but at a rate not much faster than during most of Obama's presidency. And after that, output stagnated or even declined slightly.", "\"There was nothing special or extraordinary about Trump's two years of manufacturing job growth, other than to say he benefited from synchronized global growth, which is very rare, and juice from the corporate tax cut, which probably shifted investment and hiring forward a bit,\" Scott Paul, president of the Alliance for American Manufacturing, told us in June.", "Finally, presidents can have an impact on economic conditions, but they are not the only factor. Among the things out of their control are external economic shocks such as oil price fluctuations, changes in technology, and the state of the global economy.", "Trump said that in the manufacturing sector, \"I brought back 700,000 jobs. They brought back nothing.\"", "Trump is wrong about the job gains on his watch; the actual increase is about 450,000 prior to the pandemic.", "As for the record under Obama and Biden, Trump wants to have his cake and eat it, too. If he’s going to ignore the coronavirus pandemic, then it’s fairest to ignore the Great Recession in comparing himself with Obama. And during the post-recession recovery, Obama oversaw gains of 916,000 manufacturing jobs.", "We rate the statement False.", "Donald Trump, remarks during the first presidential debate, Sept. 29, 2020", "Federal Reserve Bank of St. Louis, all employees in manufacturing, accessed Sept. 30, 2020", "PolitiFact, \"Bring back manufacturing,\" July 15, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]