["About this rating", "On Jan. 20, 2021, a small crowd including former U.S. presidents and members of Congress gathered near the steps of the nation's Capitol for Joe Biden's first remarks as president. Multiple news organizations broadcast the roughly 21-minute address live, and that footage included brief shots of the event's audience, including former President Bill Clinton.", "When the cameras panned to Clinton, 74, several social media users took screenshots or recordings of video that they framed as evidence that he dozed off during Biden's speech. The New York Post claimed in a headline, \"Clinton appears to fall asleep during Joe Biden's inauguration speech\":", "The images indeed showed the former president with his eyes closed at the ceremony. Snopes reviewed footage from news outlets including BBC News, CBS News, and C-SPAN — all of which captured Clinton's condition during Biden's speech.", "However, no evidence we reviewed definitively proved Clinton lost consciousness for a period of time. Clinton did not comment on the accusation, nor release any statement or take any action that would help determine its legitimacy, and no member of the crowd (which included journalists tasked with the job of reporting attendees' reactions) gave any indication that Clinton did or did not fall asleep.", "Furthermore, it is an indisputable fact that human beings can close their eyes for more reasons than to sleep. Among such scenarios are times of prayer or meditation, moments in which closed eyes foster concentration, or rest that falls short of actual sleep.", "In sum, while recordings of Biden's inaugural address indeed captured Clinton sitting in the crowd with his eyes closed, we found no evidence to confirm or deny that he was actually asleep.", "Jessica Lee is Snopes' Senior Assignments Editor with expertise in investigative storytelling, media literacy advocacy and digital audience engagement.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]