["A video of a man publically executed and later hanged to a crane has been widely shared on social media. The message shared along with the video claims that a rape convict was executed by a court within 15 minutes of committing the crime. “దుబాయ్ దేశములో 5 సంవత్సరాల బాలికను రేప్ చేసిన 15 నిమిషాలొ న్యాయస్తానం వాన్ని షూట్ చేయమని ఆర్డర్ వేసింది (In Dubai, this man who raped a 5-year-old girl was sentenced to be shot down by the court in 15 minutes -translated)”, reads the message posted by Facebook user Purush Achanta on December 2, 2019. [Warning: Visuals in the article are disturbing. Viewers discretion is advised].", "దుబాయ్ దేశములో 5 సంవత్సరాల బాలికను రేప్ చేసిన 15 నిమిషాలొ న్యాయస్తానం వాన్ని షూట్ చేయమని ఆర్డర్ వేసింది pic.twitter.com/ypk4fJQ4iR", "— K.Jeevan Chaitanya (@KJeevanChaitan3) December 2, 2019", "Many other people on Facebook and Twitter shared the video with the text “after 15 mins of rape in Dubai.”  The claim is viral on social media since October 2018. A similar claim by Twitter handle @iMandisi had amassed over 24,000 retweets.", "A Google search with relevant keywords revealed that the video is from Yemen and not Dubai, United Arab Emirates. A Yemeni man convicted of raping and murdering a four-year-old was publically executed in the capital Sanaa. Hussein al-Saket, the 22-year-old convict, was shot several times by a police officer at the city’s Tahrir Square, then his body was hanged from a crane for the crowd to see. A judge named Rajeh Ezzedine who attended the execution said that the man was found guilty of abducting, raping, and murdering a young girl.", "“Pictures show the 22-year-old lying on a rug on his front before being executed and his body hanging from a crane while onlookers film and photograph the scene on their phones. This is the second public execution for a similar offence in the capital controlled by Shia Houthi rebels in the last two weeks,” reported the British newspaper Independent on August 14, 2017. It stated that this was the second public execution for a similar offence in the country’s capital controlled by Shia Houthi rebels after 41-year-old Muhammad al-Maghrabi was executed for raping and murdering a three-year-old girl in July 2017.", "In the image posted below, a screenshot from the video is compared with a Getty Images photo to corroborate that it’s a video of the same incident.", "Moreover, the claim that the man was executed within 15 minutes of committing the crime is false. According to a report by UK news outlet Daily Mail, the girl was abducted and raped in November 2015. Speaking to the news outlet, Amal al-Matari, the mother of the victim, had said, “I felt so relieved even after it had taken all this time – one year and eight months ago. I am more than happy and content now that justice has been done. I know my innocent daughter Safaa will now rest in peace and in heaven”. She thanked the public for pressing for the execution and added, “We are grateful to all those who have stirred our case again, especially that they had done so after the execution of the killer of the other child last month and had they not done so, our case would have stalled.”", "In conclusion, a video of a Yemeni man, who was executed in public for abducting, raping and murdering a four-year-old girl, was shared with the false claim that a rape convict in Dubai was sentenced to death in public within 15 minutes of perpetrating the crime.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]