["Several social media users have been sharing a photo of Home Minister Amit Shah and AIMIM Chief Asaduddin Owaisi seated together. Twitter user @Samiullah_inc posted the image tagging Congress members Alka Lamba, Rohan Gupta, and Youth Congress President Srinivas BV. It was retweeted by over 150 handles at the time of writing.", "The picture has also made its way to Facebook.", "Bjp b tem owisi brathor", "Posted by Ekhlaque Parwez on Saturday, March 6, 2021", "Alt News performed a reverse image search using Yandex and found the original photo in an article by The News Minute. However, a different man is seen here with Owaisi. This story is dated February 28, 2018. It discusses Hyderabad MP Asaduddin Owaisi and his brother, MLA Akbaruddin Owaisi, requesting the state government to relocate displaced street vendors. The two leaders met the Commissioner of Greater Hyderabad Municipal Corporation (GHMC) B Janardhana Reddy and the Chief Secretary of Municipal Administration and Urban Development (MAUD) Arvind Kumar to discuss the matter. He wrote a letter to the state government stating that construction work for the Charminar Pedestrianization Project (CPP) would leave several hawkers unemployed, and three bridges should be built on the River Musi to allow them to sell their products there.", "This image was posted by the official Asaduddin Owaisi Facebook page along with information about the agenda for the meeting.", "AIMIM President Barrister Asaduddin Owaisi along with Floor leader Akbaruddin Owaisi met Principal Secretary MA&UD Mr…", "Posted by Asaduddin Owaisi on Tuesday, February 27, 2018", "The image has been morphed to show Amit Shah having a discussion with Akbaruddin and Asaduddin Owaisi.", "Amit Shah’s photo has been cropped from an image of the Home Minister with Captain Amarinder Singh, the Chief Minister of Punjab.", "There have been no discussions between the BJP and Owaisi about entering into an alliance ahead of assembly elections in several states. The image has been morphed. Earlier during the Hyderabad municipal elections in December 2020, a four-year-old photograph of Union Minister Smriti Irani with Owaisi was shared to spread a false rumour about the two teaming up for the polls.", "Donate Now", "A journalist and a dilettante person who always strives to learn new skills and meeting new people. Either sketching or working.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]