["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "U.S. Rep. Paul Ryan’s role as a potential deal-maker on immigration reform has drawn criticism from the Federation for American Immigration Reform, which opposes legal status for illegal immigrants and wants to reduce legal immigration to the United States.", "The group questions why Ryan, the Janesville Republican, would welcome more foreign laborers to America at a time when unemployment remains stubbornly high in Wisconsin.", "\"Does Congressman Ryan think Wisconsin workers aren’t good enough to get the job done?\" the group asks in a TV ad. The group fleshed out its complaint in an August 5, 2013 news release.", "\"Congressman Ryan needs to explain to thousands of Wisconsin workers, who are struggling to find jobs to support their families, why he wants to increase immigration in order to avert a labor shortage that clearly does not exist,\" said FAIR president Dan Stein.", "Then came this claim:", "\"Ryan's advocacy for amnesty and immigration increases has intensified as unemployment has been on the rise throughout Wisconsin. In June, unemployment increased in 30 of the state's 32 largest cities and in 56 of the state's 72 counties.\"", "Those don’t sound like good numbers.", "But Gov. Scott Walker has touted a declining statewide unemployment rate. And the Milwaukee Journal Sentinel reported that June’s private-sector job gain was the largest month-to-month increase since 2003.", "What gives?", "As we reported in an August 5, 2013 item, Ryan is open to granting legal status and eventually citizenship to those who came here illegally, if they get in \"back of the line,\" pay penalties and jump through other hoops over a 15-year period. He wants border security tackled first.", "In this item, we won’t evaluate whether \"amnesty\" is the proper description of what Ryan supports. The word means different things to different people.", "But we’ll examine whether \"unemployment has been on the rise throughout Wisconsin\" as Ryan stepped up his consensus-building efforts in the House, as the group claims.", "A look at the numbers", "There’s no dispute that unemployment rates still reflect widespread joblessness lingering after the Great Recession, with 210,000 people still unemployed in June 2013. FAIR’s larger point is well taken.", "But FAIR says things are getting worse.", "The group refers to a time period when Ryan’s advocacy \"intensified\", and cites the June unemployment figures in claiming that unemployment has been \"on the rise throughout Wisconsin.\"", "It’s accurate to say, as FAIR did in backing up its claim, that unemployment increased in 30 of the state's 32 largest cities and in 56 of the state's 72 counties in June when compared to the previous month.", "Janesville, for example, saw its rate rise from 8.5 percent to 9.0 percent. Milwaukee rose from 9.9 to 10.6 percent. The figures, which are estimates, were reported by the state’s workforce development agency.", "The data supports the group’s claim if you interpret \"throughout Wisconsin\" as a geographical reference. Unemployment rose in most counties, and nearly all major municipalities.", "But there’s one inconvenient fact.", "In June, the statewide unemployment rate actually dropped from 7.0 percent to 6.8 percent despite the negative news in many local communities.", "How can that be?", "The figures are estimates drawn from a small sample, so the local numbers are less reliable than the statewide figure, noted Laura Dresser, a labor economist and associate director of the Center on Wisconsin Strategy. The size of the changes in different communities influences the bottom line, too.", "\"I would say it is most responsible to watch any of these trends over time -- i.e. statewide unemployment ticking mostly but very slowly down -- or to watch the trend in municipalities over a long horizon as well,\" Dresser told us. \"Only when you see month after month moving the same directions can you really think of it as a trend.\"", "Then there’s the matter of the time frame.", "It’s reasonable to say that Ryan’s public role \"intensified\" in June and July -- before and after the Senate passed its version of immigration reform. And as FAIR noted, the latest unemployment stats are from June.", "But Ryan was revving up his push back in May. He barnstormed Wisconsin early that month, pushing for reform. A Journal Sentinel article at the time noted Ryan \"has plunged into the fray, using his stature with conservatives to promote a sweeping bipartisan compromise in Congress.\"", "The time frame matters because the unemployment rate increase in June was not the norm for 2013.", "The statewide unemployment rate has nudged up and down for the last year, settling in June at 6.8 percent, below the U.S. rate of 7.6 percent. (Wisconsin’s rate is down from the recession’s 9.2 percent peak in 2009).", "And, notably, rates in larger municipalities and counties have been on a roller coaster in 2013, rising in some months, falling in others, state data shows.", "In May, for example, 24 of the 32 largest municipalities saw a rate decrease, as did all counties but two.", "So the claim of an unemployment rate \"on the rise\" is true only if we’re talking about a one-month trend.", "Finally, what about the part of the claim that Ryan favors \"immigration increases?\"", "Ryan has told interviewers that fixing the legal immigration system now could help solve future labor shortages.", "\"Not now, but in the future we're going to have labor shortages,\" Ryan said on The Laura Ingraham Show, June 19, 2013. \"We have 10,000 people retiring each and every day in America when the Baby Boomers retire. We are not like Europe, we're not like Japan in that our birthrates are really low, but they're not high enough. Immigration, in a decade or so, can help us.\"", "Our rating", "FAIR says \"unemployment has been on the rise throughout Wisconsin\" as Ryan stepped up advocacy of \"immigration increases.\"", "The group chose its words pretty carefully, clearly focusing on Ryan’s recent actions and the corresponding -- and overwhelmingly negative -- unemployment trend in most major municipalities and many counties in the most recent month. And it’s true Ryan is endorsing \"immigration increases.\"", "But saying the rate \"has been on the rise\" suggests more than a one-month trend -- and there is no such trend in recent months. And for that one month, statewide unemployment in June fell, not rose, undercutting FAIR’s statement.", "There’s an element of truth here, but some critical facts create a different impression.", "That’s our definition of Mostly False.", "FAIR web site press release, Aug. 5, 2013", "Email exchange with Ira Mehlman, media director, Federation for American Immigration Reform, Aug. 7, 2013", "Minneapolis Star-Tribune, \"Unemployment rates increase in most Wisconsin cities, counties in June,\" July 24, 2013", "Milwaukee Journal Sentinel, \"Private-sector employment rose 13,800 in June, state says,\" July 18, 201", "Wisconsin’s Worknet, Wisconsin County Unemployment Rates, June 2013", "Wisconsin Department of Workforce Development, press release on local unemployment rates, July 24, 2013", "Wisconsin Department of Workforce Development, press release on local unemployment rates, June 26, 2013", "Wisconsin Department of Workforce Development, press release on local unemployment rates, May 22, 2013", "Wisconsin Department of Workforce Development, press release on local unemployment rates, April 24, 2013", "Wisconsin Department of Workforce Development, press release on local unemployment rates, March 20, 2013", "Wisconsin Department of Workforce Development, press release on local unemployment rates, January 23, 2013", "Wisconsin Department of Workforce Development, press release on local unemployment rates, July 25, 2012", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]