["The January 4, 2021 post shares a message from someone claiming to work at BfArM, Germany’s Federal Institute for Drugs and Medical Devices, who said they “managed to sneak an ampoule of the vaccine secretly” in order to perform at-home tests on the sample. The post claims that this unnamed vaccine is “slightly radioactive” and dangerous “enough to cause disease and genetic damage,” adding that there “could be radium in this vaccine.”", "Similar claims can also be found in German, Italian, Romanian and Serbian Cyrillic.", "While the claim does not say what the allegedly stolen vaccine is for, it circulated online as countries around the world seek to immunize their populations against Covid-19, and is part of a trend of inaccurate information aimed at raising fears about vaccines.", "“No vaccines are stored at the BfArM so such substances cannot be ‘smuggled out,’” Maik Pommer, a spokesman for the institute, told AFP by email.", "“Vaccines are not within the remit of the BfArM,” he said, adding that the main task of the Federal Institute for Drugs and Medical Devices is the authorization and supervision of medicinal products.", "“The licensing and monitoring of vaccines is the responsibility of the Paul Ehrlich Institute (PEI), the Federal Institute for Vaccines and Biomedicines,” he said.", "Susanne Stöcker, spokeswoman for the PEI, said by email that “the fact that this person claims to have stolen the ampoule from BfArM shows that this text is fake news. It proves that the person doesn’t even know which of the German regulatory authorities is responsible for vaccines. I can confirm that the Paul Ehrlich Institute, Federal Institute for Vaccine and Biomedicines is responsible for vaccines.”", "When asked if there was any evidence of a dose or ampoule of any vaccine being snuck out of the PEI, Stöcker said: “No.”", "“There is no radium in any vaccine,” Scott Halperin, Director of the Canadian Center for Vaccinology, said in an email.", "Referring to the green glow of a syringe pictured in the post, Halperin said “that wouldn’t be radium, which has a bluish color. No vaccines contain phosphors which would make them glow.”", "Julie Bettinger, a vaccine safety scientist at British Columbia Children’s Hospital’s Vaccine Evaluation Center, said by email that “no vaccines that protect against preventable diseases are radioactive, and I am not aware of any vaccine approved in Canada or the US that contains radium.”", "Bettinger also said that “there is really strict tracking of the vaccines so it would not be possible for someone to ‘sneak’ one out.”", "More of AFP Fact Check’s reporting on health misinformation can be found here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]