["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Violent crime higher now than eight years ago, unemployment well into the double digits, and more than half of Newark’s high schoolers forgoing their education.", "Are things that bleak in the Brick City?", "Republican Steve Lonegan, who is challenging Newark Mayor Cory Booker, a Democrat, for a vacant U.S. Senate seat on Oct. 16, addressed those issues during a Sept. 23 interview with radio host John Gambling on WOR 710 AM.", "\"Violent crime is up since the last year of Sharpe James’ administration,\" Lonegan told Gambling. \"This year it’s higher. … The unemployment rate is almost 15 percent. The high school dropout rate is over 50 percent.\"", "Those statistics offer a troubling view of the city and while there’s some accuracy to the claims, they leave out critical details.", "Let’s first address violent crime, then go to unemployment and education.", "Lonegan campaign spokesman Will Gattenby said in an e-mail that the violent crime claim is based on numbers from the FBI’s annual detailed report on crime statistics known as the Uniform Crime Report. Lonegan’s camp compared UCR data from 2005 and 2012.", "The FBI’s UCR defines violent crime in four categories: murder and nonnegligent homicide; forcible rape; robbery; and aggravated assault.", "The number of violent crime offenses in Newark last year totaled 3,219. The 2005 total was 2,821.", "James Allen, Booker’s communications director, said it would be \"a fair benchmark\" to use 2006 to measure violent crime since James, also a Democrat, left office that year and Booker succeeded him on July 1, 2006.", "The results are the same, though. When compared with 2012 UCR data, overall violent crime is up, as Lonegan claims, but he fails to note that offenses in three categories have fallen: homicides and manslaughters, rapes, and aggravated assaults.", "Here's a look at Newark's violent crime statistics, according to the data from the FBI's Uniform Crime Report:", "VIOLENT CRIME TOTAL", "MURDER/NON-NEGLIGENT HOMICIDE", "Sources: FBI website, Crime In The United States (Uniform Crime Report), 2005, 2006, 2012", "Robberies are driving that category's increase, according to Allen, who said the stealing of iPhones and smartphones represents a significant number of those crimes.", "\"While the rise of smartphones over the last five years has made them increasingly prevalent targets for robberies, the generic UCR classification of ‘violent crime’  gives equal weight to a smartphone robbery and a first-degree murder -- despite the vastly different nature and frequency of those crimes,\" Allen said in an e-mail.", "Next, unemployment.", "Newark’s unemployment rate has largely been stuck between 14 percent and 16 percent for much of Booker’s tenure as mayor, according to data from the U.S. Bureau of Labor Statistics.", "It’s worth noting, however, that Booker’s tenure also bookends the recession, which lasted from December 2007 to June 2009, according to the National Bureau of Economic Research. BLS data shows a sharp uptick in the city’s unemployment rate during the recession and after it ended.", "Comparatively, Newark’s unemployment measured as a percent change is lower than unemployment increases for the state and nation, according to BLS data.", "Finally, let’s look at Newark’s dropout rate, which Lonegan said exceeds 50 percent.", "\"The number of students who start 9th grade and graduate within four years via HSPA is 32.2%,\" Gattenby told us.", "That methodology has been cited by Gov. Chris Christie, who has claimed multiple times that the graduation rate for an incoming Newark freshman who finishes high school in four years is 23 percent.", "The Truth-O-Meter handed Christie a Pants on Fire for repeating the claim. Like Christie, Lonegan looks only at one group of students -– those who graduate by passing the High School Proficiency Assessment (HSPA), a state standardized test. But there are other routes to graduation, including the Alternative High School Assessment. Also, some students are exempt from testing.", "In total, 55 percent of students graduated from Newark’s high schools in four years, according to data from the 2009-2010 school year, PolitiFact New Jersey determined in January 2012.", "Jarrad Toussant, Booker’s senior education adviser, told us that the district’s graduation rate for June 2012 was 68 percent. The remaining 32 percent either graduated after more than four years or dropped out, he said.", "The Newark School District, which Toussant said tracks dropout data, did not respond to our request for comment.", "Our ruling", "Lonegan said, \"Violent crime is up since the last year of Sharpe James’ administration. This year it’s higher. … The unemployment rate is almost 15 percent. The high school dropout rate is over 50 percent.\"", "Overall violent crime is up whether measured from 2005 or 2006 to 2012, but the increase is skewed by a sharp uptick in robberies, according to UCR statistics. Violent crime is down in other categories.", "Unemployment during Booker’s tenure has hovered between 14 percent and 16 percent, but the impact of the recession on those figures can’t be disregarded.", "Lonegan’s claim about Newark dropouts is based on students who graduate following a standardized testing route, but that doesn’t consider all of the district’s high schoolers. There are other routes to graduation.", "Each claim has a varying degree of accuracy to it, but each claim also leaves out important details and context. That’s why we rate the overall claim Half True.", "To comment on this article, go to NJ.com.", "John Gambling show, Interview with Steve Lonegan, Sept. 23, 2013, accessed Sept. 24, 2013", "NJ.com, Menendez calls on feds to award funds to Newark police after 10-day homicide surge, Sept. 10, 2013, accessed Sept. 24, 2013", "U.S. Bureau of Labor Statistics website, accessed Sept. 24, 26 and 27, 2013", "E-mail interviews with Peggy Quinn and Mark Glander, spokespeople, U.S. Department of Education, National Center for Education Statistics, Sept. 24, 2013", "E-mail interviews with Will Gattenby, spokesman, Lonegan For Senate, Sept. 24-25 and Oct. 2-3, 2013", "PolitiFact New Jersey, Cory Booker has overseen \"five years in a row\" of increases in violent crime, murders in Newark, Steve Lonegan claims, Aug. 25, 2013, accessed Sept. 24 and 25, 2013", "PolitiFact New Jersey, Chris Christie repeats misleading statistic on Newark’s high school graduation rate, Jan. 5, 2012, accessed Sept. 26, 2013", "FBI website, Uniform Crime Report, Crime in the United States 2012, accessed Sept. 25, 2013", "Project Vote Smart website, Sharpe James biography, accessed Sept. 25, 2013", "NJ.com, Newark Mayor Cory Booker says crime down over past 3 years, Jan. 4, 2010, accessed Sept. 25, 2013", "Newark Police Department Comstat crime report for Week Ending Sept. 15, 2013, accessed Sept. 26, 2013", "Newark Police Department Comstat crime report, Yearly Average Comparison Vs. 2006, March 1, 2013, accessed Sept. 27, 2013", "FBI website, Uniform Crime Report, Crime in the United States 2005, accessed Oct. 1-2, 2013", "FBI website, Uniform Crime Report, Crime in the United States 2006, accessed Oct. 3-4, 2013", "Phone interview with James Allen, Cory Booker communications director, and Jarrad Toussant, Cory Booker senior education adviser, Oct. 2, 2013", "E-mail and phone interviews with James Allen, Cory Booker communications director, Oct. 3, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]