["“लोग कहते है की पुलिस जान बुजकर गाड़ी रोकते है, अब इसको क्या कहेंगी जनता ? पुलिस जम्मू कश्मीर” (“People complain that police deliberately stop commuters, what will the public say now? Police Jammu Kashmir”- translated).", "The above message has gone viral on social media, along with a video which shows uniformed personnel rip open the seat of a two-wheeler to find a stash of weapons and hundreds of bullets.", "लोग कहते हैं कि पुलिस वाले जान बूझकर गाड़ी रोकते हैं! अब इसको क्या कहेगी जनता ? पुलिस जम्मू कश्मीर!!", "Posted by Anoop Awasthi on Tuesday, September 24, 2019", "The video is 4:19 minutes long and has been shared by several users with identical text, suggesting that the same is circulating on WhatsApp. According to the accompanying claim, J&K police has apparently seized weapons and bullets hidden inside the seat of a two-wheeler.", "The video has also been posted on Twitter.", "लोग कहते है की पुलिस जान बुजकर गाड़ी रोकते है अब इसको क्या कहेंगी जनता? – पुलिस जम्मू कश्मीर pic.twitter.com/t8Xg6ESidU", "— Sujitkumar Rasal (@SujitkumarRasal) September 23, 2019", "Alt News’s fact-check found that the video in question is not from Jammu & Kashmir, as claimed. It is in fact from Pakistan and is a recent incident. Alt News’s search was directed by the uniform worn by the personnel seen in the video. Black shirt and khaki trousers are worn by police in parts of Pakistan.", "Alt News searched online with Urdu text and found that the incident had taken place at Kohat, which is in the Khyber Pakhtunkhwa (formerly NWFP) province of Pakistan. This video was posted on September 17 by the official Facebook page of Kohat police. According to the description of the video, Kohat police had busted a smuggling operation with the seizure of the motorcycle at a checkpoint. One rifle, four pistols, 60 chargers and 1,600 cartridges had been recovered from the seat of the motorcycle. The smuggler was arrested and a case was registered against him.", "کوہاٹ/ اسلحہ برآمد", "کوہاٹ: شکردرہ پولیس نے اسلحہ سمگل کرنے کی کوشش ناکام بنادی ہے", "کوہاٹ: شکردرہ پولیس کی گرگرو کنڈاؤ چیک پوسٹ پر کامیاب کاروائی", "کوہاٹ: ناکہ بندی کی کاروائی میں چیکنگ کے دوران موٹر سائیکل کے خفیہ خانے سے بڑی تعداد میں اسلحہ و ایمونیشن برآمد", "کوہاٹ: کاروائی میں ہتھیاروں کے بین الصوبائی سمگلر بصیر سکنہ گودی بانڈہ کوہاٹ کو حراست میں لیا گیا", "کوہاٹ: پکڑے گئے اسلحے میں 1ریپیٹر, 1رائفل , 4 پستول,6 چارجر اور 1600 کارتوس شامل ہیں", "کوہاٹ: پکڑا جانیوالا اسلحہ موٹر سائیکل کے ذریعے درہ آدم خیل سے پنجاب سمگل کیا جارہا تھا", "کوہاٹ: کاروائی کے دوران اسلحہ کی بھاری کھیپ سمیت گرفتار سمگلر کے خلاف تھانہ شکردرہ میں مقدمہ درج کرلیا گیا. ایس ایچ او یوسف حیات", "Posted by DPO Kohat on Tuesday, September 17, 2019", "It may be noted that the viral video showing hidden weapons being recovered from a motorcycle, is from Khyber Pakhtunkhwa in Pakistan. It is not from Jammu & Kashmir.", "Donate Now", "Arjun Sidharth is a writer with Alt News. He has previously worked in the television news industry, where he managed news bulletins and breaking news scenarios, apart from scripting numerous prime time television stories. He has also been actively involved with various freelance projects. Sidharth has studied economics, political science, international relations and journalism. He has a keen interest in books, movies, music, sports, politics, foreign policy, history and economics. His hobbies include reading, watching movies and indoor gaming.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]