["About this rating", "What could possibly be better than owning a sex robot? Owning a sex robot that can make you dinner and clean your home for you. Right, guys?", "That's the grim and unimaginative premise of a fake, January 2018 post on the \"satirical\" Huzlers web site, which falsely reported that technology companies had been leaking their plans to produce and sell just such a machine by 2019.", "According to reports, tech companies that are producing realistic sex robots are trying to reach the next level in creating sex robots that can cook and clean. Company spokesperson’s say the cooking and cleaning sex robots can be available for purchase as soon as next year.", "Despite citing \"reports,\" the article does not include any specific sources, and we could find no corroboration for a specific plan to market an automaton that cooks and cleans as well as providing sexual gratification, by 2019.", "The article goes on to quote \"Jan Kunchai,\" an engineer at RealBotix. RealBotix is an actual company, known for creating the sex robot \"Harmony,\" but we couldn't find any evidence of a \"Jan Kunchai\" working there.", "Inventors and designers have been working on developing sex robots for years, and companies like RealBotix have produced prototypes that could actualize what had previously been only theoretical plans or non-functioning prototypes.", "At the same time, British company Moley Robotics has come up with a prototype for a robotic kitchen, which consists of two robotic arms that can carry out a recipe stored in its memory based on 3-D videos of the movements made by a human. According to the company, the kitchen is scheduled to go on sale to the public in 2018.", "Robot vacuum cleaners (like the Roomba) and mopping robots are already available on the market, although they are limited to fairly basic functions and can't navigate any surface other than a floor.", "A fully-functioning, human-like robot that can cook, clean and provide sexual gratification is a theoretical possibility, but the technological sophistication required to produce one is not even close to being in place, and certainly won't be by 2019. That's not to mention the many ethical dilemmas presented by the prospect of such an invention.", "The article is no more than a hoax based on a bad joke. In case there were any doubt, Huzlers describes itself as \"the most infamous fauxtire & satire entertainment website in the world.\" Based on its 10,600 Facebook followers, not even that is true.", "Trout, Christopher.  \"RealDoll's First Sex Robot Took Me to the Uncanny Valley.\"\r\n  Engadget.  11 April 2017.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]