["About this rating", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "In early August 2020, social media users reported that Facebook had banned posts using the hashtag #SavetheChildren, leading Snopes readers to inquire about whether the censorship had occurred, and why the platform would choose to block such posts.", "While it is true that Facebook temporarily disabled #SavetheChildren posts that violated community standards or showed depictions of child abuse, the platform did not permanently ban the hashtag. This claim is outdated.", "Facebook posts using #SavetheChildren were reportedly banned or censored from Aug. 5, 2020, until the early morning of the next day. Publications and users reported that statuses could still be shared, but posts that had used the hashtag did not show results. Instead, they returned a warning that the post violated community standards.", "In an email to Snopes, Facebook confirmed that the hashtag had been temporarily disabled.", "“We temporarily blocked the hashtag as it was surfacing low-quality content,\" wrote Dami Oyefeso, a Facebook spokesperson. \"The hashtag has since been restored, and we will continue to monitor for content that violates our Community Standards.\"", "A Snopes search on both the mobile and desktop versions of Facebook revealed that the hashtag had been reinstated as of this publication. Search results included a variety of disinformation and misrepresented facts and events surrounding pedophilia rings, as well as potentially triggering images of children being abused, exploited, or presented in situations that suggest sexual exploitation.", "Social media users speculated that the temporary disabling of the hashtag was because many of the images associated with #SavetheChildren violated Facebook community standards, which have a specific rationale for any content related to minors that include “imagery that depicts non-sexual child abuse regardless of sharing intent.”", "Some believe that some social media users have abused the hashtag as a way to spread anti-mask sentiment in the midst of the COVID-19 pandemic. A number of social media influencers have argued that children wearing masks may be at a heightened risk of abduction or less likely to be spotted after having been kidnapped. Others have connected mask mandates to the “global elite and their fetish for children.”", "Save the Children is a humanitarian organization that provides education and social services to children around the world. Bill and Melinda Gates donated to the organization and conspiracy theorists and tabloids have connected Bill Gates with convicted sex offender and sex trafficker Jeffrey Epstein.", "Dickson, EJ.   \"Mom Influencers on Instagram Are Spreading Anti-Mask Propaganda.\"\r\n    Rolling Stone.   24 July 2020", "Dwilson, Stephanie Dube.   \"Was #SavetheChildren Banned on Facebook? Hashtag Was Censored.\"\r\n    Heavy.   10 Aug 2020.", "Dwilson, Stephanie Dube.   \"#SavetheChildren Versus #SaveOurChildren: Viral Bill Gates Posts Explained.\"\r\n    Heavy.   11 Aug 2020.", "Dwilson, Stephanie Dube.   \"#SavetheChildren Versus #SaveOurChildren: Viral Bill Gates Posts Explained.\"\r\n    Heavy.   11 Aug 2020.", "Salo, Jackie.   \"Why #SavetheChildren Was Temporarily Banned From Facebook.\"\r\n    New York Post.   6 Aug 2020.", "Bain, Ellissa.   \"Facebook: Why Was #SavetheChildren Banned? Social Media Site Censors Internet Movement!\"\r\n    HITC.   6 Aug 2020.", "Alonzo, Isaiah.   \"Wonder Why #SaveTheChildren Was Blocked on Facebook? Check Out This Altered Photo of Tom Hanks.\"\r\n    Tech Times.   6 Aug 2020.", "Madison Dapcevich is a freelance contributor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]