["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "• The Canadian government has not enacted a law that criminalizes COVID-19 restrictions or prevents enforcement of those guidelines.", "• There are places in Canada where you can be fined for disobeying COVID-19 public health orders.", "• The post appears to be referring to a proclamation issued by a “council of citizens’ assemblies.”", "A Facebook post claims Canada passed new legislation against COVID-19 public health orders.", "\"Canada has just criminalized all CV19 measures requiring masks, distancing, quarantining & vaccines — meaning they cannot force/fine you to wear a mask etc,\" the text on the photo post reads. \"Any attempt to impose such measures is now considered a CRIME.\"", "That’s not true. The caption of the post mentions a \"law\" passed by \"a council of citizens’ assemblies\" on Sept. 8. The actions of this group do not have legitimate standing in Canada.", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Claims about this new \"law\" have been publicized by a group called the Republic of Kanata, which describes itself as \"a new society growing up within the shell of the old. Citizens are united within a new jurisdiction in local Republican Assemblies that replace the existing Canadian government structures.\"", "Republic of Kanata says its law \"struck down and criminalized\" all COVID-19 measures, such as those requiring masks, social distancing or quarantining. The law also encourages people to \"actively resist\" coronavirus regulations.", "According to a Republic of Kanata press release, \"The law was issued by the National Council of Common Law Assemblies (NCCLA), which unites more than forty such Assemblies across Canada within the jurisdiction of the Republic of Kanata.\"", "Although a group of people want this to be law, it is not.", "The group has no legal authority in Canada. A spokesperson for the Canadian House of Commons confirmed that no such law has been passed to criminalize public health measures for COVID-19", "The post also incorrectly claims that Canadian cities and provinces can no longer implement COVID-19 safety requirements or impose fines for violating those measures.", "In several places in Canada, there are fines and other penalties for violating the public health orders designed to slow the spread of COVID-19.", "In Canada’s Alberta province, fines for violating orders for self-isolation begin at $1,000. Canada’s capital city of Ottawa has required masks in enclosed public spaces since July, and police officers can impose $200 fines.", "On Sept. 10 — two days after the Facebook post’s supposed-law criminalized the COVID-19 measures — officials in Quebec announced the police would begin handing out fines to people who aren’t wearing masks in accordance with public health regulations.", "An image on Facebook says, \"Canada has just criminalized all CV19 measures requiring masks, distancing, quarantining & vaccines — meaning they cannot force/fine you to wear a mask etc. Any attempt to impose such measures is now considered a CRIME.\"", "The caption of the post refers to a \"law\" passed by a \"a council of citizens’ assemblies\" that is not real, enforceable law in Canada. People can also be fined for violating the public health orders designed to slow the spread of COVID-19 in many places in Canada.", "We rate this claim False.", "CBC, \"Quebec will hand out fines to those who refuse to wear masks,\" Sept. 10, 2020", "CTV News Montreal, \"Quebec will fine those who don’t wear masks,\" Sept. 10, 2020", "Alberta, \"Help prevent the spread,\" accessed Sept. 10, 2020", "Global News, \"Ottawa council passes mask bylaw with fines of $200 for violators,\" July 15, 2020", "Ottawa, \"Temporary Mandatory Mask By-law (By-law No. 2020 – 186),\" accessed Sept. 11, 2020", "Ottawa Public Health, \"Learn more on the Temporary Mandatory Mask By-law,\" accessed Sept. 11, 2020", "Email interview with Canadian House of Commons spokesperson, Sept. 11, 2020", "Canada Department of Justice, \"Government of Canada’s response to COVID-19,\" accessed Sept. 11, 2020", "Republic of Kanata, \"Republic of Kanata,\" accessed Sept. 11, 2020", "Republic of Kanata, \"Media,\" Sept. 8, 2020", "YouTube, \"National Law in Canada Strikes Down Police State Measures, Empowers Citizens to Resist,\" Sept. 7, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]