["After years of repeating conspiracies that President Barack Obama was not born in the United States, Donald Trump finally backed away from the so-called birther movement earlier this month.", "But that didn’t stop the question from coming up during a key exchange at Monday’s presidential debate in New York.", "Hillary Clinton said Trump embraced a \"racist lie\" and it demonstrated a pattern that carried over from his business practices.", "\"Donald started his career back in 1973 being sued by the Justice Department for racial discrimination because he would not rent apartments in one of his developments to African-Americans,\" she said.", "That’s quite the charge, but is it true?", "Yes. It turns out he was.", "In 1973, Trump, as a 27-year-old, was president of his father’s realty company, Trump Management. It operated nearly 40 apartment buildings, mostly in New York City. By all accounts, including his own, Trump was a hands-on president and very active in managing the day-to-day business operations.", "That year, the federal government filed a complaint against Trump, his father Fred Trump, and Trump Management. The complaint alleged that the Trumps violated the Fair Housing Act, part of the Civil Rights Act of 1968, by discriminating against tenants and potential tenants based on their race.", "\"The defendants, through the actions of their agents and employees, have discriminated against persons because of race in the operation of their apartment buildings,\" the complaint reads.", "Black people, the government found, were often told a Trump Management complex had no availability when apartments were available for rent.", "In one instance, a black man asked about two-bedroom apartments at Trump’s Westminster complex in Brooklyn on March 18, 1972, and a superintendent told him nothing was available. On March 19, 1972, the black man’s wife, who was white, visited the complex and was offered an application for a two-bedroom apartment on the spot.", "The government lawyers also interviewed several people who said executives for Trump Management discouraged rental agents from renting to black people. In one case, the government said the company’s comptroller instructed a rental agent to attach a sheet of paper that said \"C\" for \"colored\" to every application submitted by a person of color.", "Trump vehemently denied the claims, which he called \"absolutely ridiculous,\" according to a 1973 New York Times article. Trump and his company filed a countersuit the following December, claiming the government made baseless charges and asking for $100 million in damages. The court dismissed the countersuit.", "Trump’s campaign did not respond to our requests for comment. But he did offer an explanation in the debate.", "\"As far as the lawsuit, yes, when I was very young, I went into my father's company, had a real estate company in Brooklyn and Queens, and we, along with many, many other companies throughout the country -- it was a federal lawsuit -- were sued,\" Trump said. \"We settled the suit with zero -- with no admission of guilt. It was very easy to do.\"", "Indeed, both parties settled in 1975 after a protracted legal battle. Trump claimed victory, writing in his 1987 memoir, Art of the Deal: \"In the end, the government couldn’t prove its case, and we ended up taking a minor settlement without admitting any guilt\"", "However, under the agreement, Trump Management had to train employees about their obligations under the Fair Housing Act and to launch a two-year marketing program to inform the community about their fair housing practices, including giving a weekly list of vacancies to the New York Urban League, among other requirements.", "It’s also worth noting that most of these suits are typically settled and often quickly -- \"north of 98 percent,\" Robert Schwemm, law professor at the University of Kentucky and an expert in housing discrimination law, previously told PolitiFact. And in every settlement, the agreement allows the defendant to take voluntary action to remedy the problem without admitting guilt.", "\"That doesn’t mean there wasn’t lots of evidence\" against Trump, Schwemm said.", "Our ruling", "Clinton said that Trump \"started his career back in 1973 being sued by the Justice Department for racial discrimination because he would not rent apartments in one of his developments to African-Americans.\"", "Both parts of the statement are carefully worded and accurate. The Justice Department sued Trump, his father and their company under the Civil Rights Act in 1973. In many instances, the government said, prospective black tenants were blocked from renting in his buildings.", "The case was settled and Trump never admitted guilt, though his company had to agree to stipulations meant to prevent future discrimination at his rental properties.", "We rate the statement True.", "https://www.sharethefacts.co/share/a1eeeec4-fa30-47b3-a119-110b7b898ef1", "PolitiFact, \"Clinton ad: Trump Management was charged with discriminating against black people,\" Sept. 14, 2013", "Hillary for America, \"Everything,\" first aired Aug. 27, 2016", "U.S. District Court for the Eastern District of New York,Donald Trump Affidavit, December 1973", "U.S. District Court for the Eastern District of New York, Federal Housing Act complaint against Trump, October 1973", "U.S. District Court for the Eastern District of New York, plaintiff’s response to defendants’ interrogatories, March 1974", "U.S. District Court for the Eastern District of New York, Trump case consent order, June 10, 1975", "New York Times, \"Major Landlord Accused Of Antiblack Bias in City,\" Oct. 13, 1973", "New York Times, \"Realty Company Asks $100‐Million ‘Bias’ Damages,\" Dec. 13, 1973", "New York Times, \"‘No Vacancies’ for Blacks: How Donald Trump Got His Start, and Was First Accused of Bias,\" Aug. 27, 2016", "Daily Beast, \"DOJ: Trump’s Early Businesses Blocked Blacks,\" Dec. 15, 2015", "Village Voice, \"How a Young Donald Trump Forced His Way From Avenue Z to Manhattan,\" July 20, 2015", "Washington Post, \"Inside the government’s racial bias case against Donald Trump’s company, and how he fought it,\" Jan. 23, 2016", "Email interview, Clinton spokesman Josh Schwerin, Sept. 13, 2016", "Email interview, Clinton spokesman Josh Schwerin, Sept. 26, 2016", "Email interview, George Galster, Wayne State University professor of urban affairs, Sept. 13, 2016", "Email and phone interviews, Robert Schwemm, University of Kentucky law professor, Sept. 13, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]