["A communal clash had broken out in Bhainsa, Nirmal District, Telangana on March 7. “The police said that the violence broke out after an argument over a bike accident between two individuals, which later escalated to a fight between two religious groups, and spread to the entire town, ” reported The News Minute. The violence led to vandalism, arson and stone-pelting. On March 12, the police arrested a man identified as Sai Teja for igniting fresh violence in the riot-hit Bhainsa.", "Social media was soon brimming with images shared with #SaveHindusOfBhainsa to portray Bhainsa violence.", "Twitter user @shashikant2907 posted the following images along with the text, “In a case of deliberate, large-scale violence, a Muslim mob attacked members of the Hindu community and looted and burnt their property in Bhainsa town of Telangana. The Muslim mobs on a rampage also pelted stones at police who rushed to the spot.” Image 2 was also shared on Twitter @AngrySaffron. This was quote-tweeted by BJP supporter Shefali Vaidya.", "This image is from the 2020 Delhi communal riots. The photo is credited to the Press Trust of India and dated February 25, 2020. It was published by India Today and several other media outlets.", "This image is also from the Delhi violence in 2020. The image was clicked by Sajjad Hussain on February 26 and is accessible on Getty Images.", "The third image shows a burnt van. Just like the others, it was posted by Twitter user @shashikant2907. He wrote, “Jihadi mob attacks Hindu homes in Bhainsa, Telangana 18 houses of Hindus burnt and properties looted.” Image 1 and 3 were also tweeted by Twitter user @Malathi___.", "This image is from communal violence that erupted in Bhainsa last year. It was published by The News Minute in January 2020.", "Twitter user @ShuchiRecites posted two images and wrote, “Stand with the One who is left Helpless Heart Breaking #SaveHindusOfBhainsa.” The two images show a vehicle set ablaze and burnt two-wheelers.", "Alt News couldn’t find the context behind the first image posted by @ShuchiRecites. However, the second image was taken during the 2020 communal violence in Bhainsa. The image was published by The New Indian Express in January 2020.", "Twitter user @PiyushTweets1 posted a set of four images including image 3 and the images posted by @ShuchiRecites. He wrote, “19 H!ndu houses set on fire, but no one is talking about it. Why? Because we are neither peaceful nor we take law & order in our hands and start riots. Surprised to see the silence of BJP on #BhainsaRiots Might be cause WB election is more important than H!ndu life in Telangana.” This tweet was retweeted over 800 times. Image 5 (bottom left) was also shared by @gopugoswami.", "Just like image 3 and 4, the following image is from the 2020 communal riots in Bhainsa. The image was published by The Hindu and shot by reporter S. Harpal Singh in January 2020.", "After the recent communal violence in Bhainsa, several images of riots in the past were shared on social media. These do not represent the aftermath of the clashes in the communally sensitive area in Telangana.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "Amid the ongoing Israel-Palestine conflict, media outlet Times Now put out a report claiming that…", "A 45-second video clip is being shared widely on social media where a group of…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…"]