["About this rating", "A man dressed in a Joker face makeup announced his candidacy for governor of a region in Japan in early March 2021, shocking many across the internet as social media users pointed out his nontraditional, political attire.", "Yuusuke Kawai, a businessman based in the western region of Chiba Prefecture, announced his candidacy on March 4. A video of his announcement was shared to YouTube five days later, showing the candidate dressed in white face paint and a maroon suit in the likeness of DC comic book supervillain, The Joker. A Google translation revealed that the text overlay on the video below, which was posted to Kawai’s YouTube channel, included information about the candidate and appeared to include mocking language.", "A screenshot of the now-viral video was shared to Twitter shortly thereafter, and had been retweeted more than 2,600 at the time of this writing.", "Whether Kawai’s candidacy is merely a publicity stunt is unclear (he even pushed out this outlandish music video with his tell-tale makeup). But a scan of his Instagram, Twitter, and Facebook profiles showed that the claim about his candidacy is true.", "According to Kawai’s official YouTube page, the candidate said that a goal of this election would be to see a turnout of 40% or more voters. If he won the election slated for March 21, Kawai would govern the more than 6.2 million people who call Chiba Prefecture home. And in doing so, his political party would make the region of Chiba Prefecture a  \"land of dreams and magic,” according to his political platform.", "At the time of this writing, Kawai was a representative for the Japanese temporary staffing and recruitment company River Junction, of which Kawai is listed as the CEO. A statement issued by the company on March 4 announced Kawai’s candidacy in less than 30 words.", "“We would like to inform you that our representative, Kawai, has run for the Chiba Governor's election (March 4th notification day, March 21st election day). That's all,” it read.", "Snopes contacted the political hopeful to ask him the inspiration behind his makeup, but did not receive a response at the time of publication. We will update the article accordingly with the results of the March 21 election.", "Madison Dapcevich is a freelance contributor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]