["An article on an opinion commentary website claims Boston Public Schools suspended its advanced class program because \"too many students in them are white or Asian,\" which it called a \"shocking reason.\"", "The story \"Boston schools place ‘color of our skin’ above ‘content of our intellect’ in halting advanced program\" was posted March 1 to Human Events, a magazine-turned-blog founded in 1944, according to a Twitter profile for the website. The conservative publication was endorsed by late-Republican President Ronald Reagan, per a membership page. A link to the story posted on the magazine's Facebook page recently went viral.", "The story references a Feb. 26 report by local NPR affiliate GBH News. BPS Superintendent Brenda Cassellius recommended a one-year suspension of the school system's Advanced Work Classes for fourth- to sixth-graders, according to the report.", "Cassellius admitted the suspension was influenced by the racial demographics of students selected for AWC, most of whom are white or Asian, according to Human Events.", "The magazine accused BPS of forcing students to learn at the same level.", "\"Every student — no matter the age, race, gender, religion — learns in a different way and at a different speed,\" the article states.", "USA TODAY reached out to Human Events for comment.", "The claim does not include several updates to the GBH News piece requested by BPS officials, USA TODAY has learned.", "Boston Public Schools suspended Advanced Work Classes enrollment on Feb. 3 for one year due to the pandemic and \"disparate impacts on Boston Public Schools students,\" according to a statement released by the school system.", "Enrollment in the program is determined by a placement test given in the third grade. Eligible students are selected by lottery, per the statement.", "Xavier Andrews, BPS director of communications, told USA TODAY the AWC program will continue next school year.", "\"BPS was unable to administer the exam that is included as part of the program’s policy this past fall because most of our students were learning remotely,\" he explained in an email. \"As a result, the Boston School Committee approved a one-year pause of the testing component of the policy. A working group was recently established to discuss concerns around declining enrollment in the program, equitable access for all learners, and to provide a recommendation as to the future of the program.\"", "Program enrollment declined by over half in the last seven years, according to Andrews.", "Andrews also said GBH News clarified its original story upon request. A correction tweet was sent from the outlet's Twitter account on Feb. 28 noting changes to the headline, but a Feb. 26 tweet linking to the story has not been updated.", "The outlet reported that advanced classes are made up of students who are 70% white and Asian, but the citywide student population is nearly 80% Black and Hispanic.", "\"There's been a lot of inequities that have been brought to the light in the pandemic that we have to address,\" Cassellius told GBH News. \"There's a lot of work we have to do in the district to be antiracist and have policies where all of our students have a fair shot at an equitable and excellent education.\"", "The AWC suspension will affect only five of 123 schools in the BPS system, according to Andrews. More than 90% of students entering the advanced program from the fourth grade this year are enrolled in three of the five schools, per a Jan. 27 report from Cassellius.", "We rate this claim PARTLY FALSE, based on our research. A conservative online magazine claimed Boston Public Schools suspended an advanced placement program because students were \"too white and Asian.\" BPS acknowledged racial disparities in its Advanced Work Class program. But enrollment testing was suspended due to the pandemic, not the racial makeup of advanced placement classes, according to the superintendent.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook."]