["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "With the Islamic State of Iraq and Syria growing in the Middle East, nearly half of Americans think the country is less safe than it was before Sept. 11, 2001, according to a recent poll.", "Some Republicans have expressed concern that the southern border is so porous, members of the extremist group could slip into the United States from Mexico. And a few have said such a plot is already in the works -- but federal agencies don’t agree.", "Rep. Trent Franks, a Republican from Arizona, said his state faces an imminent threat in a recent phone conference with conservative nonprofit Staying True to America’s National Destiny. BuzzFeed picked up Franks’ comment, and it made its way around the Internet.", "\"It is true, that we know that ISIS is present in Ciudad Juarez or they were within the last few weeks,\" Franks said. \"So there’s no question that they have designs on trying to come into Arizona. The comment that I’ve made is that if unaccompanied minors can cross the border then certainly trained terrorists probably can, too. It is something that is real.\"", "Several other politicians have made similar claims, including Texas Gov. Rick Perry, Rep. Lou Barletta, R-Pa., and Sen. Marco Rubio, R-Fla. And the claims are spreading around conservative online media, like the Daily Caller, Breitbart News and pundit Sean Hannity at Fox News.", "This clashes with the federal government’s assertion that there is currently no credible threat that ISIS is planning an attack on United States soil.", "With Franks and so many others claiming that the threat is certain and looming, we decided to see whether or not their evidence is credible. Based on our talks with experts and statements from law enforcement officials, the possibility of ISIS attacking the U.S. by crossing the southern border seems unlikely. The certainty that Franks suggests about what we \"know\" is wrong.", "The origins", "In a statement to PolitiFact, Franks said he got the information from a report circulating around the Internet. Franks has since learned that Homeland Security believes the report was \"overstated,\" and his subsequent comments reflect that -- though he remains concerned about the possibility of terrorists crossing the border.", "The report is from Judicial Watch, a conservative media website, and it claims that \"Islamic terrorist groups are operating in the Mexican border city of Ciudad Juarez and planning to attack the United States with car bombs or other vehicle borne improvised explosive devices,\" citing several anonymous \"high-level federal law enforcement, intelligence and other sources.\"", "We couldn’t find any other media outlets that independently verified the story, and no federal officials would corroborate its claims, either.", "Without knowing anything about Judicial Watch’s sources -- such as rank or agency -- it’s hard for us to assess the article’s credibility. In an interview with PolitiFact, Judicial Watch president Tom Fitton would not go into any further detail.", "The article says the Department of Homeland Security did not respond to their multiple requests.", "We asked Homeland Security about the threat in Juarez, and they said, \"There is no credible intelligence to suggest that there is an active plot by (ISIS) to attempt to cross the southern border.\"", "The topic came up a few times in recent congressional hearings, and administrators reiterated the lacking evidence of an imminent threat.", "In a Sept. 10 hearing before the House Homeland Security Border and Maritime Security Subcommittee, Rep. Lou Barletta, R-Pa., said, \"We know that terrorist networks have been using our porous southern border and a broken immigration system to enter the United States.\"", "DHS Deputy Under Secretary for Analysis Jennifer Lasley responded.", "\"To date, we have not had credible reporting that either Hezbollah or any other terrorist group has been taking advantage of our borders to move individuals in and out,\" Lasley said. \"It's something we are always looking for, but to date, we have not seen credible evidence of that.\"", "Later in the same hearing, Rep. Beto O’Rourke, D-Texas, discussed his conversations with DHS, when administrators told him that there has never been evidence of terrorists entering the United States via the southern border. He posed the same question to DHS administrators present at the hearing.", "In response, John Wagner, acting assistant commissioner for Custom and Border Patrol’s Office of Field Operations, said it is much more likely that ISIS and other Islamic extremists would come to the United States by commercial plane. Wagner said the number of people suspected in terrorist activity caught on the southern border is in the tens, while those on commercial jets is in the thousands.", "Both Rep. Franks and Fitton of Judicial Watch mentioned to us that the government has intercepted ISIS social media posts that indicated a potential attack carried out by crossing the border.", "This came up in a Sept. 10 Senate Homeland Security Committee hearing. Sen. John McCain, R-Ariz., asked Undersecretary for Intelligence and Analysis Francis Taylor about recent reports of Twitter and Facebook exchanges in which ISIS \"urged infiltration\" across the U.S.-Mexico border.", "\"Yes, sir, there have been Twitter, social media exchanges among ISIL adherents across the globe speaking about that as a possibility,\" Taylor said, adding: \"I'm satisfied that we have the intelligence and the capability at our border that would prevent that activity.\"", "This admission energized the discussions in the conservative media. But social media threats should be taken with a grain of salt, said Colin Clarke, an expert on international security at the Rand Corporation, a think tank.", "\"ISIS could say ‘we would never consider (crossing the border),’ and would we take that seriously?\" Clarke said. \"It’s really just one small sliver of evidence.\"", "It’s possible, but unlikely", "We talked to several national security experts, and each one said they haven’t seen credible evidence that ISIS is staging a plot that involves crossing the southern border. They also said that scenario is highly unlikely.", "\"There is big difference between a theoretical risk or a risk that is worth worrying about,\" said David Schanzer, director of Duke University’s Triangle Center on Terrorism and Homeland Security.", "The general sentiment among experts was: It’s possible that ISIS could sneak through the border -- illegal immigrants do it every day. But why would they?", "Schanzer noted that ISIS members who have U.S. passports or visas could enter the country legally via plane. (The 9/11 hijackers had U.S. visas.) Whereas if they crossed the border illegally, they would run the risk of getting caught.", "Another possibility is that someone living in the United States could become radicalized over the Internet and then stage an attack, like the men who carried out the Boston Marathon bombings last year, Clarke said, adding that this was his biggest concern.", "Additionally, ISIS is \"overwhelmingly focused\" on Iraq and Syria, said Daniel Benjamin, former ambassador at large and coordinator for counterterrorism at the State Department. The group likely does not have the wherewithal to stage an attack on American soil at this point.", "In order to cross the border and stage an attack, ISIS would need a broad network in place in the United States that could provide them with intelligence, weapons, money, sanctuary, training and more, Clarke added.", "And this is not a new claim.", "In 2011, then-presidential candidate Mitt Romney (and several other Republican candidates) said the Islamic militant group Hezbollah was working in Mexico, and we rated that claim Mostly False. (We found some evidence of Hezbollah sympathizers working in South and Central America,but little evidence for the group \"working\" in Mexico.)", "In 2010, Judicial Watch published a story with the headline: \"Feds Warn Of Terrorists Sneaking Into U.S. Through Mexico.\"", "O’Rourke, the Texas representative, has said that he came across an El Paso newspaper story from 1981 about Libyan terrorists in Juarez, though evidence of such a group was never found.", "Despite years of these claims, Schanzer said he is not aware of a \"single person arrested for a terrorism-related offense after crossing the border illegally.\"", "We should note that in 2011, an Iranian plotted to assassinate the Saudi Arabian ambassador to the United States, and his plan involved Mexican drug traffickers, according to the Washington Post. The man, who had previously lived in Texas, thought his contact in Mexico was a drug smuggler, when it was actually a U.S. Drug Enforcement Administration informant.", "The man was arrested at John F. Kennedy International Airport in New York, where he flew from Mexico.", "Our ruling", "Franks said, \"It is true that we know that ISIS is present in Ciudad Juarez.\"", "We found that it is highly unlikely that ISIS would operate in Mexico and stage an attack that involves crossing the border. The claims originated in an article with unnamed sources, published by a right-wing outlet. We could not find one law enforcement official or another media outlet that independently verified or corroborated the claims.", "It’s a far stretch to say \"we know\" with certainty that ISIS is in Juarez, so we rate this claim Mostly False.", "STAND, Conversation with Trent Franks, posted Sept. 12, 2014", "Judicial Watch, \"Imminent Terrorist Attack Warning,\" Aug. 29, 2014", "Judicial Watch, \"Feds Warn Of Terrorists Sneaking Into U.S. Through Mexico,\" May 28, 2010", "CQ transcripts, \"Senate Homeland Security and Governmental Affairs Committee Holds Hearing on Cybersecurity and Terrorism Threats,\" Sept. 10, 2014", "C-SPAN, \"Domestic Threat by Western Terrorists,\" Sept. 10, 2014", "Buzzfeed, \"Arizona Congressman Claims It’s ‘True That We Know That’ ISIS Is On The U.S. Border,\" Sept. 14, 2014", "The Economist, \"High anxiety,\" Sept. 16, 2014", "Washington Post, \"Notorious Iranian militant has a connection to alleged assassination plot against Saudi envoy,\" Oct. 14, 2011", "The Guardian, \"Jeh Johnson: 'No credible information that ISIS planning to attack the US,'\" Sept. 10, 2014", "New York Times, \"U.S. Pushes Back Against Warnings That ISIS Plans to Enter From Mexico,\" Sept. 15, 2014", "New York Times, \"Perry Says Terrorists Could Be Entering the U.S. From Mexico,\" Aug. 21, 2014", "Arizona Republic, \"Experts: ISIS more likely to enter U.S. by plane than via Southwest border,\" Sept. 10, 2014", "Breitbart, \"Obama administration denies threat of ISIS crossing southern border,\" Sept. 16, 2014", "Daily Caller, \"Report: ISIS Planning Imminent Terror Attack At U.S. Border,\" Aug. 29, 2014", "FactCheck.Org, \"9/11 Hijackers and Student Visas,\" May 11, 2013", "NBC/Wall Street Journal survey, Sept. 7, 2014", "PolitiFact, \"Mitt Romney says Hezbollah in Latin America poses an imminent threat to the United States,\" Nov. 23, 2011", "Email interview, Franks spokesman Ben Carnes, Sept. 15, 2014", "Email interview, DHS spokeswoman Marsha Catron, Sept. 15, 2014", "Phone interview, Judicial Watch president Tom Fitton, Sept. 17, 2014", "Email interview, Daniel Benjamin, former ambassador-at-large and coordinator for counterterrorism at the State Department, Sept. 16, 2014", "Email interview, David Schanzer, director of Duke University’s Triangle Center on Terrorism and Homeland Security, Sept. 16, 2014", "Phone interview, Colin Clarke, national security expert for Rand Corporation, Sept. 16, 2014", "Email interview, Bruce Riedel, director of the Intelligence Project at the Brookings Institution, Sept. 15, 2014", "Email interview, Bruce Hoffman, director of the Center for Security Studies at Georgetown University, Sept. 15, 2014", "Email interview, William McCants, foreign policy fellow at Brookings, Sept. 15, 2014", "Email interview, Tim Nichols, director of Duke University’s Counterterrorism and Public Policy Fellowship Program, Sept. 16, 2014", "Email interview, Tom Vinger, spokesman for Texas Department of Public Safety, Sept. 16, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]