["The photos were published here on Facebook on July 29, 2020.", "The first photo shows a smiling woman and man standing together; the second and third show a woman with a bruised back and a black eye.", "Part of the post’s Hindi caption translates to English as: “One more girl became a victim of love jihad. A TV channel in Kerala has started a series about the girls who are married after falling to love jihad in Malayalam. Every girl says in the beginning, my Abdul is not like other Muslims, it is very noble, but when the eyes are open, there are three consequences in front of the girls, either buried in a suitcase or sold in the brothel, or a baby machine.”", "“Love Jihad” is a term coined by hardline Hindu groups in India to describe a conspiracy that Muslim men seduce and marry Hindu women to covert them to Islam. The groups also claim that the women are abused and killed if they do not accept Islam, as AFP reported here.", "Malayalam is the regional language of the south Indian state of Kerala.", "The photos were also shared here, here, here and here on Facebook and  here, here, here and here on Twitter, alongside similar claims.", "The claim, however, is misleading; two of the three photos in the misleading posts circulated in reports about a Muslim domestic violence victim in Bangladesh.", "First photo", "A reverse image search on Google found the first photo published here on June 26, 2020 in a report by the Dhaka Tribune, a newspaper in Bangladesh.", "The article’s Bengali headline reads: “Heart-wrenching status update by a housewife, describing the atrocities she faced from her in-laws”.", "It reads, in part: “A housewife in Dhaka posted a 'heartbreaking' status on social media Facebook alleging that her husband, father-in-law and mother-in-law were abusing her for not receiving dowry.", "“The wife, Sumaiya Hasan, alleged in her Facebook account: I have six pictures showing the torture. I also sued, but they persuaded me (reconciled) and abused me again. He wants money from me. My mother-in-law told my husband that he would give you money only if he killed me. They beat me in front of them.”", "Below is a screenshot comparison of the first photo in the misleading Facebook post (L) and the Dhaka Tribune photo (R):", "Second photo", "Keyword and reverse image searches found the second photo, showing a woman’s bruised eye, published in this June 27, 2020 article by Dhaka Tribune.", "It is headlined: “Alleging torture by husband and in-laws, woman demands justice on social media”.", "The article reads: “A housewife from Dhaka posted a heart-breaking Facebook status update, saying that her husband, father-in-law and mother-in-law were continuously torturing her to demand dowry from her family. Sumaiya Hassan, the housewife, shared her story at 3:10pm on Friday along with six photos showing several wounds on her body.”", "Below is a screenshot comparison of the second photo in the misleading post (L) and the Dhaka Tribune photo (R):", "Hassan’s Facebook post, mentioned in the Dhaka Tribune report, has since been removed from the platform.", "However, Hassan published this Facebook post on her account thanking the police for their help.", "The post, written in a mix of Bengali and English, reads: “The police asked me to file a complaint after seeing my [Facebook] post, but my mother and I have decided not to do so as I have an eight-month old baby and I want to raise the child with my husband. We have resolved the issue and my husband has promised not to raise his hands on me.”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]