["About this rating", "On March 18, 2021, various right-wing websites and personalities spread incendiary headlines that conflated two separate organizations and led to false social media claims that the \"leader\" of Drag Queen Story Hour was arrested on child pornography charges.", "Conspiracy sites like Gateway Pundit and Big League Politics posted headlines that read, \"Milwaukee Judge and President of Drag Queen Story Hour Group Arrested, Charged With Child Pornography\" and \"BREAKING: Former President of Drag Queen Story Hour Foundation and Children’s Court Judge Arrested on Seven Counts of Child Porn.\"", "Republican U.S. Rep. Lauren Boebert of Colorado also falsely claimed that the \"drag queen story hour leader\" had been arrested.", "Boebert's tweet read: \"Unsurprisingly, for the winner of this week's 'This Should Have Been A Red Flag Award', we learn that drag queen story hour leader and the former CEO of horribly named 'Cream City Foundation' has been arrested for child pornography.\"", "For additional context, \"Cream City\" is a nickname for Milwaukee, which is a reference to the cream color of bricks used to build the city's historic buildings.", "We explain below why these headlines and claims are misleading.", "Drag Queen Story Hour (DQSH) is a national organization with chapters in various cities that organizes events where drag queens read books to kids. The events are often held in public libraries, bookstores, and schools, and they are sometimes the focus of conservative groups' protests.", "The aim of these events is to give children \"glamorous, positive, and unabashedly queer role models. In spaces like this, kids are able to see people who defy rigid gender restrictions and imagine a world where people can present as they wish, where dress up is real,\" per the organization's website.", "Brett Blomme was arrested on suspicion of possession of child pornography in March 2021. According to the criminal complaint, Blomme was charged with seven felony counts of possession of child pornography following an investigation led by the Wisconsin Department of Justice, Division of Criminal Investigation.", "Blomme's arrest no doubt made headlines in part because he had been elected to serve as a Milwaukee County circuit court judge in August 2020. According to local news reports, Blomme served as a judge in the county's Children's Court.", "Prior to his election to serve as a judge in Milwaukee, Blomme held various positions of public trust. He worked as an assistant city attorney for the city of Madison and as an attorney in the Wisconsin Public Defender's office, according to his LinkedIn profile. He also held two positions with local charities, the AIDS Resource Center of Wisconsin and Cream City Foundation.", "Blomme never had a leadership position with either Drag Queen Story Hour's national organization or its Milwaukee chapter.", "According to his LinkedIn page, Blomme was the president and CEO of the Cream City Foundation from July 2017 until August 2020, leaving that post when he was elected to serve as circuit court judge.", "Cream City Foundation is a Milwaukee-based LGBTQ advocacy nonprofit organization that offers grants and scholarships. Its current president and CEO is Gary Balcerzak, who took the post when Blomme left in August 2020.", "According to Jonathan Hamilt, the executive director Drag Queen Story Hour's national umbrella organization, Cream City Foundation acted as a fiscal sponsor to DQSH's Milwaukee chapter so that the group could give and receive money as a nonprofit organization. However, Hamilt said, DQSH Milwaukee operates as a separate entity.", "In an emailed statement, Hamilt told Snopes that \"DQSH Milwaukee has never been run by the Cream City Foundation nor Brett Blomme,\" and neither Cream City Foundation nor Blomme have participated in planning, organizing, hosting or performing at any of DQSH Milwaukee's events, Hamilt wrote.", "\"Brett has never held a title or position within our organization ever,\" Hamilt added.", "We reached out to Cream City Foundation for comment but didn't receive a response in time for publication. We will update this story if we hear back.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]