["About this rating", "In mid-2020, social media users began circulating a purported advertisement promoting the concept that \"Pedophilia is a natural sexual orientation\" and that \"It is in our responsibility to reflect and to overcome our negative feelings about pedophiles.\" The alleged ad image carried logos implying the support of organizations such as TED and NAMbLA and was said to have been allowed by Facebook to run on their social media network:", "In fact, this \"ad\" never ran on Facebook, nor was it endorsed by TED. It was a years-old hoax created from a stock image.", "Back in May 2018, the University of Würzburg in Germany held a TEDx-sponsored event with the theme of “Future Societys” [sic], at which a speaker gave a controversial presentation on the subject of “Why our perception of pedophilia has to change” and stated that \"pedophilia is an unchangeable sexual orientation.\" (TEDx events \"are organized independently under a free license granted by TED\" and \"are not controlled by TED,\" according to the parent organization.)", "Spurred by a Breitbart article about the controversy created by that TEDx presentation (dubbed \"#TEDogate\"), users on the 4chan imageboard website began creating and posting disparaging memes about it, including the one displayed above:", "Afterwards, that image was circulated by itself on Facebook, without any context explaining its origins, as if it were a genuine advertisement that had been run on the social media network.", "Ciccotta, Tom.   \"TED Talk Organization Under Fire for Bizarre ‘Pedophilia’ Lecture.\"\r\n    Breitbart.   22 June 2018.", "Palma, Bethania.   \"Did a TEDx Speaker Say Pedophilia Is an ‘Unchangeable Sexual Orientation’?\"\r\n    Snopes.com.   26 July 2018.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]