["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Some gun-control advocates use as part of their arsenal in the national debate on this issue that most Americans support their effort, including background checks.\n\nGeorgia state Sen. Nan Orrock, an Atlanta Democrat, made a specific claim about public support for such checks during a floor debate about Senate Bill 101, which she feared would expand access to guns.\n\n\"More than 80 percent of Americans believe we need to have universal background checks,\" Orrock said.\n\nSB 101 would allow Georgians as young as 18 to be granted a gun license if they’ve completed basic military training, as long as they were not dishonorably discharged. The bill also would eliminate a ban on guns in public housing, unless a ban is required by federal law or regulation. It passed the Senate by a 41-10 vote and is being reviewed by the state House of Representatives.\n\nPolitiFact Georgia decided to do some checking to see whether the senator is correct or is she exaggerating public support for such guidelines.\n\nAfter the December shootings of 20 children and six adults at Sandy Hook Elementary School in Newtown, Conn., President Barack Obama put Vice President Joe Biden in charge of coming up with legislation to stem such violence. In January, Obama announced a series of proposals that includes background checks for all gun sales.\n\nFederal law currently requires federally licensed gun dealers to conduct background checks before selling a firearm. There is no federal law that requires private gun dealers to do such background checks. A handful of states (Georgia is not one of them) require private dealers to conduct background checks. Gun control advocates want to require private dealers to conduct such a check, which is commonly known as a \"universal background check.\"\n\nSeveral Democrats, including Obama, have said about 40 percent of all guns are sold without a background check. PolitiFact has reviewed this claim several times and noted it’s based on a 1997 study, rating it Half True.\n\nLiz Flowers, a spokeswoman for the state Senate Democrats, sent us several polls she says support Orrock’s point.\n\nHere’s a look at some of the polls Flowers sent us and some we found:", "There was a margin of error of about 3 percentage points to 4 percentage points in each poll.\n\nOur partners at PolitiFact in Washington recently fact-checked a claim by Obama that \"overwhelming majorities of Americans\" support gun legislation \"like background checks.\" PolitiFact noted some of the same polls we reviewed. PolitiFact concluded more than 80 percent of Americans support universal background checks. Obama’s claim, though, was rated Mostly True because his statement suggested strong support for other proposals by his administration, not just universal background checks.\n\nTo sum up, the senator said more than 80 percent of Americans support universal background checks on gun purchases. In each recent poll we reviewed, the public support for universal background checks was well above 80 percent.\n\nWe rate Orrock’s claim True.", "Georgia Senate video, March 4, 2013.", "CBS News/New York Times, \"9 in 10 back universal gun background checks,\" Jan. 17, 2013.", "CNN Polling Center, \"Americans overwhelmingly approve of background checks for gun purchases,\" accessed March 6, 2013.", "Email from Liz Flowers, spokeswoman, Georgia Senate Democrats, March 6, 2013.\n\nFox News poll, Jan. 18, 2013.", "Georgia Senate Bill 101.", "Mayors Against Illegal Guns Georgia poll on gun legislation, March 5, 2013.", "Pew Research Center, \"In Gun Control Debate, Several Options Draw Majority Support,\" Jan. 14, 2013.", "PolitiFact, \"President Barack Obama says an 'overwhelming' majority supports gun legislation like background checks,\" Feb. 12, 2013.", "White House gun violence plan.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]