["A video of Delhi chief minister Arvind Kejriwal has gone viral on social media. In the video, Kejriwal can be seen in a vehicle surrounded by people while there a scuffle on the road. The viral video claims that a person was mishandled by Aam Aadmi Party (AAP) during Kejriwal’s roadshow and the CM watched as a mute spectator.", "BJP IT cell head Amit Malviya tweeted this video claiming that a man was lynched at a Kejriwal roadshow. This comes in the backdrop of a person protesting against Citizenship Amendment Act thrashed at Amit Shah’s rally allegedly for chanting anti-CAA slogans.", "AAP workers indulge in brutality, lynch a man in Arvind Kejriwal’s road show, who remains a mute spectator, doesn’t intervene, goes around his program as if nothing is happening…", "Is this man even fit to be in public life let alone occupy a public office?pic.twitter.com/baYVtrY7Qi", "— Amit Malviya (@amitmalviya) January 31, 2020", "A user @GatimaanBharat claimed that AAP workers “lynched” a man in front of Kejriwal. He tweeted, “AAP workers mob lynching a man in front of Kejriwal. Kejriwal just watches. Never asks his followers to stop even once. Kejriwal is practically presiding over a mob lynching. #शाहिनबाग_का_भंडाफोड़ (Hashtag translation #ShaheenBagh_Debunked).”", "AAP workers mob lynching a man in front of Kejriwal", "Kejriwal just watches. Never asks his followers to stop even once.", "Kejriwal is practically presiding over a mob lynching. #शाहिनबाग_का_भंडाफोड़pic.twitter.com/OqG8vtfa4C", "— દેશભક્ત મોદી (@GatimaanBharat) January 31, 2020", "Similarly, another Twitter user with the handle @bpjIndia shared the viral video along with the same text on January 31.", "It is noteworthy that Malviya reshared a video by one ‘Amit Raina’ posted on May 8, 2019, which proves that the incident is not recent.", "A man getting lynched in front of Delhi CM @ArvindKejriwal . He does not intervene. This man promises to make Delhi crime free if it becomes a full state but refuses to intervene in a crime that’s happening before his own eyes pic.twitter.com/PL4bK3UP8b", "— अमित रैना Amit Raina (@rainaamit) May 8, 2019", "The video in question is from May 4, 2019, incident when Kejriwal was slapped during a rally at Moti Nagar, New Delhi. The viral clip does not show the slap but its aftermath. The Hindu’s report from the day said, “Mr. Kejriwal who has been carrying out roadshows across the Capital ahead of Lok Sabha elections was standing in his open roof vehicle when the incident happened. In a video, a man in a red t-shirt and black pants can be seen climbing on the vehicle’s bonnet and attacking the CM and abusing him. The man is then pulled down by the crowd.”", "On May 4, Hindustan Times uploaded a video which captured this event. It’s noteworthy that the music played in Hindustan Times report and viral video is the same.", "Alt News did a keyword search on Twitter and found that Times of India journalist Raj Shekhar Jha tweeted a video about the incident on May 4, 2019.", "Arvind Kejriwal slapped by a man in west Delhi. Act caught on camera. The man, Suresh, was then assaulted by AAP volunteers.", "* strong language. pic.twitter.com/2vTzDyS6w1", "— Raj Shekhar Jha (@rajshekharTOI) May 4, 2019", "Alt News analysed the viral video and Jha’s video. In both the videos, two men (highlighted in red), one in a blue shirt and the other in a white shirt, can be spotted.", "In conclusion, the viral video is from a 2019 incident where Delhi chief minister Arvind Kejriwal was slapped during a roadshow and AAP supporters and workers brutally thrashed the attacker. It has gone viral ahead of Delhi assembly elections set to be held on February 8.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]