["In the backdrop of global COVID-19 outbreak, Kannada channel Public TV aired a show on March 14 where it was claimed that four Muslim youths in Sultan Street, Bhatkal in Karnataka refused coronavirus testing for “religious reasons” after returning from Dubai.", "The anchor said, “Won’t get coronavirus test done. In our religion, there is no scope for the test…This is what four youths who returned from Dubai have said – that they won’t be getting (coronavirus) test done. They have come to Bhatkal, the four youths. When they were asked to get coronavirus test done because they had come from abroad, they said in our religion there is no scope for the test.”", "The channel ran the show based on a localite’s statement who claimed, “They [the four youths] have come [from abroad]. When health officials went to meet them, they shouted,” to which the anchor opined that the youths should be taken into custody and tested.", "Right-wing website OpIndia picked up the news the next day and tweeted, “Islam does not approve: Four Muslims who returned from Dubai threaten health officials in Karnataka, refuse to undergo Coronavirus test.”", "Islam does not approve: Four Muslims who returned from Dubai threaten health officials in Karnataka, refuse to undergo Coronavirus testhttps://t.co/wTj5vDURmX", "— OpIndia.com (@OpIndia_com) March 15, 2020", "Another right-wing website My Nation also reported the alleged incident based on Public TV’s broadcast.", "4 youths have refused to undergo Coronavirus tests after they returned from Dubai, saying their religion doesn’t permit them to do so. #coronavirusindia #CoronaVirusUpdates #WHO #pandemic https://t.co/FBxvPM3TLr", "— MyNation (@MyNation) March 15, 2020", "The claim was shared sans any source by Mahesh Hegde, founder of fake news blog Postcard News. Kanchan Gupta quote-tweeted a tweet which shared the Public TV broadcast and termed the alleged action of the youths “minorytism”.", "It is worth noting that the complete broadcast was based on statements by a local, not health officials or the district administration. The show oscillated between reiterating unverified claims by a random person and the anchor’s criticism of the ‘irresponsible’ behaviour of the youths. Interestingly, the religion angle was introduced by the anchor. The local could not be heard mentioning the religious identity of the youths or that they refused testing due to their faith.", "Alt News decided to dig deeper.", "We found a YouTube video of a joint press conference by the Bhatkal Deputy Superintendent (DySP) and Assistant Commissioner (AC) Bhatkal where they stated that there were no novel coronavirus cases in Bhatkal and that rumour mongers will be dealt with seriously.", "Alt News spoke with Uttara Kannada District Magistrate (DC) Dr Harish Kumar K who stated that no incident was reported in his district where four men returning from Dubai refused testing for religious reasons. He said the process of testing individuals returning from foreign countries was going on smoothly with full cooperation from all.", "“Whoever has come to my district in the last 20 days, they are under home surveillance. Our health workers screen them daily to check their body temperature or any other symptoms. There is some resistance when people think they have an infected person in their midst who might have contracted the virus from abroad. So they insist on being shifted to hospitals.” The officer informed that he believes the reaction is due to panic and not religious apprehensions. “I haven’t received any such complaints from paramedical personnel and health officials which state that people refused testing for religious reasons. The people have been cooperating. As a district magistrate, I can say it hasn’t taken any communal turn.”", "In a conversation with Assistant Commissioner S Bharat, who said that he had seen the video being circulated on social media, we were again informed that the news is false. “I have not heard of any religious objections to testing,” he said.", "To corroborate further, Alt News contacted Syed Parvez, President of Majlise Islah Wa Tanzeem, a social welfare organisation in Bhatkal. His organisation is closely working with district authorities to inspect people who have returned from foreign trips. He told Alt News, “The health department is working with NGOs here. We are being given lists of all persons who returned from foreign trips. We have been inspecting all people. There was a case where we paid a visit to a family that hadn’t travelled but were relatives of those who had. They were sceptical of getting tested because they couldn’t understand why. We explained to them that we test people who come in contact with travellers, then they cooperated.” He further added that his residence is located in Sultan Street and no such incident had occurred in the area. “There were people who had returned from foreign travel in Makhdoom colony. But all of them cooperated. There has been no case in Bhatkal,” he said.", "Therefore, Public TV broadcast a claim on March 14 where the channel said that four Muslim youths refused to be tested for coronavirus in Bhatkal, Karnataka for religious reasons. The claim was based on the statement of a localite and the channel did not bother to speak with local health workers. Alt News contacted multiple authorities and found this information to be false. The dubious news was promoted by OpIndia and My Nation the next day despite the police addressing the rumours on March 14 itself. This was not the first time that Public TV, OpIndia and My Nation propagated misinformation.", "Donate Now", "Co-founder, Alt News Co-Founder Alt News, I can be reached via Twitter at https://twitter.com/zoo_bear", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]