["The Facebook post above, from 4 January, has clocked up more than 70,000 views. The picture shows two dust-covered women in the back of a truck, surrounded by men in army camouflage. The post uses the image to claim that African girls are suffering sexual and physical abuse at a modern-day slave market in Libya.", "These posts here and here make the same allegations to convey similar anti-Arabic and Islamophobic sentiment. Between them, the three social media posts have been shared hundreds of times.", "But while the picture was indeed shot in Libya, it does not show women being sold at a slave market. It was one of many taken on a dramatic day by Reuters photographer Hani Amara on 6 December, 2016 as Libyan forces moved through the city of Sirte and cleared it of combatants loyal to Islamic State.", "Women and children were among those freed from the clutches of the militants, including the two women seen in the photo.", "Amara confirmed to the AFP bureau in Libya's capital Tripoli that he shot the picture on the day of Sirte's liberation from Islamic State.", "The screenshot below comes from the Reuters news agency’s website and is watermarked to denote copyright ownership.", "Amara’s caption accompanying the picture reads: “Women sit in a pickup truck after they were released by Libyan forces from Islamic State-held ground as forces clear Ghiza Bahriya, the final district of the group's former stronghold of Sirte, Libya December 6, 2016.”", "Here is a written AFP account of the fighting can be found.", "Amara has documented his coverage of the events in Sirte on December 2016 on his Twitter account.", "pic.twitter.com/pndCAOhKd1", "pic.twitter.com/Wz3BiT1xIx", "In May 2019, Amara was shot and wounded while covering fighting in Libya’s capital, Tripoli.", "Violence continues to blight Libya, between forces from the UN-backed Government of National Accord, based in Tripoli, and loyalists from the opposition Libyan National Army, under the control of General Khalifa Haftar.", "However, peace talks are on the cards after a push by Turkey and Russia to bring an end to the fighting.", "For more on the difficulties and dangers of reporting in Libya, read this AFP blog post here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]