["About this rating", "On 2 November 2016, the conspiracy-obsessed alternative health website Natural News posted a story with the headline: “Americans' Health Deteriorating Under Obamacare as Life Expectancies Plunge.”", "Although the article does not directly demonstrate that ObamaCare is the cause of this “deterioration,” the headline’s claim is what is being shared online. The actual text of the article — a brief description of an annual report that adjusts an actuarial life expectancy calculation — proffers no information about causation:", "For many years, the assumption has been that the United States leads the world as an advanced civilization, dominating in categories like education, quality of life, and life expectancy. But a new study released this year by the Society of Actuaries (SOA) paints a much different picture, suggesting that Americans are less healthy and will more than likely live much shorter lives compared to those in previous generations.", "Over the past several years, the report explains, American health has taken a major downturn. Life expectancy amongst 65-year-olds is down by about six months, on average. It's also down for younger Americans, who are likewise expected to live about six months less than in previous generations. In nearly every generational category, including \"Baby Boomers,\" \"Generation X,\" and \"Millennials,\" life expectancy is down, and will likely continue to go down.", "The report to which Natural News is referring (“Mortality Improvement Scale MP-2016”) was released by the Society of Actuaries on October 20, 2016, per an SOA release:", "Society of Actuaries (SOA) today released its annually-updated mortality improvement scale for pension plans, MP-2016, incorporating three additional years of Social Security Administration (SSA) data on U.S. population mortality. The updated improvement scale suggests U.S. mortality continues to improve, but at a slower average rate of improvement than previous years, which may decrease pension plan obligations slightly.", "A distinction glossed over in the Natural News story is that the actual number the SOA is changing is an algorithmic factor used to predict future changes to life expectancy improvements based on past mortality data; the study does not suggest that current generations will live fewer years than their predecessors, as life expectancies overall are rising.", "The change in the estimate of life expectancy presented here stems from the fact that its prediction a year earlier was based on what looked to be — but turned out not to be — a trend toward increasing improvements in mortality rates across the country. The change reported in this new study results from tempering that earlier projection. However, life expectancies are still expected to rise across the board, just at a slower rate than was predicted in 2015.", "This lagging rate of improvement to mortality rates in the United States compared to other developed nations is a well-documented observation with no single, widely accepted answer. What is important to note, however, is that not every group in the United States is seeing its mortality rates improve at similar rates. There are major differences depending on your income level, ethnicity, and economic mobility.", "A landmark 2006 study by a team of Harvard investigators divided the country into “eight Americas,” based on race and county combinations across the U.S., in order to compare the mortality rates of each group. The study concluded that it is unlikely that a single factor — i.e., health care access — can be solely responsible for this disparity:", "Disparities in mortality across the eight Americas, each consisting of millions or tens of millions of Americans, are enormous by all international standards. The observed disparities in life expectancy cannot be explained by race, income, or basic health-care access and utilization alone.", "A study published a decade later in the Journal of the American Medical Association reported:", "Between 2001 and 2014, individuals in the top 5% of the income distribution gained around 3 years of life expectancy, whereas individuals in the bottom 5% experienced no gains. As a benchmark for this magnitude, the NCHS estimates that eliminating all cancer deaths would increase life expectancy at birth by 3.2 years.", "This same study, which uses data as recent as the SOA report, suggested that insurance access in the lowest income bracket did not appear to play a role in determining life expectancy:", "Measures of health insurance coverage and spending (the fraction of uninsured and risk-adjusted Medicare spending per enrollee) were not significantly associated with life expectancy for individuals in the bottom income quartile.", "What these detailed studies of mortality rates suggest is that treating longevity predictors as a single number based on age and gender masks their more nuanced realities, which impedes efforts to identify any cause (or causes) for potential changes to them.", "The goal of the SOA report was not to identify a cause, but to create an improved algorithm to allow pension funds to estimate how long their clients might be alive, based on the most recent data from the Social Security Administration.", "A final flaw in the Natural News-insinuated link between Obamacare and lower-than-expected improvements to life expectancy predictions is that the most recent data the SOA used was from the early months of 2014, and most of the changes to its earlier assessment came from the addition of data from 2012 and 2013.", "It is unclear, based on the Natural News story, what specific mechanisms of the ACA’s rollout would have affected mortality rates. While some of the Affordable Care Act’s provisions first launched in 2010, the majority of its more substantial provisions (such as the individual mandate) didn’t take effect until 2014, which is a year that the SOA study’s dataset didn’t even include in its entirety.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]