["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "In his first major education speech, President Obama endorsed charter schools, merit pay for teachers and increases in school spending. He justified his agenda partly by saying American students are slipping compared to counterparts around the world.", "\"We've let our grades slip, our schools crumble, our teacher quality fall short, and other nations outpace us,\" Obama said in the March 10 speech to the United States Hispanic Chamber of Commerce. \"In eighth grade math, we've fallen to ninth place.\"", "Since Obama brought up math, we decided to check his. Turns out we had to pull out the red pen.", "We asked the White House to defend Obama's claim, and received no response. His claim that eighth grade math students in the United States are in ninth place internationally almost certainly comes from the Trends in International Mathematics and Science Study, a periodic comparison of math and science achievement carried out since 1995 by research institutions and government agencies worldwide.", "The\n\nmost recent study\n\n, published in 2007, did indeed show U.S. eighth graders in ninth place behind five East Asian countries and Hungary, England and Russia.", "But it was misleading to say they had \"fallen\" to ninth place. In 1995, they\n\ncame in 28th\n\n. In 1999, they\n\nmoved up to 19th\n\n. In 2003, they climbed\n\nto 15th\n\n. So rather than falling, U.S. students have actually\n\nimproved\n\nin the past decade.", "We considered giving the president partial credit since American students did come in ninth. But the point of his statement was that they had \"fallen\" to that position and that mathematics performance in the United States is getting worse relative to other countries. And that's just plain False.", "New York Times,\n\nPresident Obama’s Remarks to the Hispanic Chamber of Commerce\n\n, March 10, 2009, accessed March 12, 2009", "Trends in International Mathematics and Science Study,\n\nTable 1. Average mathematics scores of fourth- and eighth-grade students, by country: 2007\n\n, accessed March 11, 2009", "Trends in International Mathematics and Science Study,\n\nTable 5. Average mathematics scale scores of eighth-grade students, by country: 2003\n\n, accessed March 11, 2009", "Trends in International Mathematics and Science Study,\n\nMathematics and Science Achievement of Eighth-Graders in 1999\n\n, accessed March 12, 2009", "Third International Mathematics and Science Study, 1995, \n\nKey Findings\n\n, accessed March 12, 2009", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]