["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Democratic U.S. Rep. Kyrsten Sinema says she’s looking out for older Arizonans, and her voting record backs her up.", "In her bid for U.S. Senate, Sinema pointed to her vote against a \"new age tax.\"", "\"We need to make it easier for Arizonans to afford their health care. That’s why I voted to stop a new ‘age tax’ on coverage for people age 50 and over,\" Sinema tweeted Sept. 8. Her tweet included an image with text that said: \"Arizonans age 50 & over could be charged 5 times more for their health care under the ‘age tax’.\"", "We need to make it easier for Arizonans to afford their health care. That’s why I voted to stop a new “age tax” on coverage for people age 50 and over. #AZSen pic.twitter.com/g6Ydh7xkna", "Sinema is campaigning against Republican U.S. Rep. Martha McSally for the seat held by retiring Republican Sen. Jeff Flake. The election is Nov. 6.", "Did Sinema vote to stop a new \"age tax\" that could have charged Arizonans 50 years and older five times more for their health care?", "Sinema in 2017 voted against a Republican bill that allowed insurance companies to charge certain people 50 and older up to five times more what they would charge younger adults. It wasn't a \"tax\" levied by the government. The bill would have increased the cap by which people could charge some people over 50.", "Her claim mimics attacks we’ve seen against Republicans, omitting the same caveats: This provision applied to people buying insurance on the individual and small-group markets. It didn’t apply to seniors on Medicare, or to people 50 and older with coverage sponsored by large employers. Current law allows insurers to charge older adults three times what they charge younger adults.", "The American Health Care Act was part of an effort to repeal the 2010 health care law signed by President Barack Obama. The bill retained some parts of the Obama-era law, including the prohibition on insurance companies from denying coverage for a pre-existing health problem.", "The Republican bill passed the House in May 2017 by a vote of 217-213, with Sinema voting against it and McSally for it. The Senate failed to pass its own measure.", "Before Obamacare, as the Republicans called it, older adults paid about four or five times more for premiums than what younger adults paid, according to a Kaiser Family Foundation analysis.", "Obamacare changed the rules so that insurance companies could still charge older adults more than younger adults, but only by up to three times.", "Here’s a sample of the 2018 age rating curve:", "• A 50-year-old pays 1.786 times the amount that a younger person pays;", "• A 55-year-old pays 2.230 times the amount that a younger person pays; and", "• Someone 64 and older pays 3 times the amount that a younger person pays.", "The 2017 House bill that Sinema voted against sought to increase the ratio to 5-to-1 for certain adults over 50. It allowed states to set a different ratio. However, the proposal didn’t apply to seniors on Medicare, or people older than 50 who had coverage through large employers.", "Katie Keith, a researcher for the Center on Health Insurance Reforms at Georgetown University, said the policy change would have made overall premiums \"significantly more unaffordable.\"", "The Trump administration would have to figure out how to set an age rating curve, Keith said, \"but all of these numbers would shift up significantly, even if not five times as much, at all ages over 50.\"", "The age rating works on a curve that increases with each year of age (for adults), so \"it's probably most accurate to say that seniors 50 and over could be charged up to 5 times more,\" Keith said.", "It's an open question as to whether Arizona would have set a different ratio under the Republican repeal, Keith said. Under current law, states can request ratios less than the federal standard, but Arizona — like most states — hasn’t done that, Keith said.", "The 2017 health care bill also could have increased health care costs for older adults, because the legislation would have replaced income-based tax credits with a credit based on age.", "Under the proposal, adults under 30 would get a $2,000 credit; adults over 60, a $4,000 credit; and individuals who made more than $75,000 annually (or a couple who filed jointly earning $150,000) would have tax credits phased out.", "According to AARP calculations, under AHCA, 50- to 64-year-olds making $25,000 annually would be eligible for tax credits that are on average 50 to 80 percent less than what they would receive under current law.", "\"Generally, people who are older, lower-income, or live in high-premium areas (like Alaska and Arizona) receive less financial assistance under the AHCA,\" said a Kaiser Family Foundation analysis. \"Additionally, older people would have higher starting premiums under the AHCA and would therefore pay higher premiums.\"", "Sinema said she voted to stop a new \"age tax,\" under which \"Arizonans age 50 & over could be charged 5 times more for their health care.\"", "Sinema voted against the Republican effort to repeal Obamacare, which would have allowed companies to charge individuals 50 and over up to five times more than what they charged younger adults.", "Sinema’s ad glosses over a few important points. The bill’s provision only applied to people who bought insurance through the individual and small-group markets. It wouldn’t have applied to people on Medicare (and are 65 and older) or with coverage through larger employers.", "The current health care law allows insurers to charge this age group three times as much for insurance as younger adults. Although Sinema's tweet references a \"new\" age tax, it may be unclear to some that the charges wouldn’t be fives time more than the current situation.", "Sinema’s statement is partially accurate but leaves out important details. We rate it Half True.", "Twitter, @KyrstenSinema tweet, Sept. 8, 2018", "Congressional Research Service, H.R. 1628: The American Health Care Act", "(AHCA), May 26, 2017", "Phone interview, Sam Berger, senior advisor at Center for American Progress, Sept. 13, 2018", "Email interview, Katie Keith, a researcher for the Center on Health Insurance Reforms at Georgetown University, Sept. 13, 2018", "Email interview, Hele Hare, Sinema campaign spokeswoman, Sept. 12, 2018", "PolitiFact Florida, GOP health care bill charges five times more for people over 50, liberal group says, May 11, 2017", "Centers for Medicare & Medicaid Services, Memo on Guidance Regarding Age Curves and State Reporting, Dec. 16, 2016", "Congress.gov, H.R.1628 - American Health Care Act of 2017", "AARP, Insight on the Issues - Adequate Premium Tax Credits Are Vital to Maintain Access to Affordable Health Coverage for Older Adults, March 2017", "PolitiFact, Trump-O-Meter: repeal Obamacare, last updated Dec. 21, 2017", "Kaiser Family Foundation, How Affordable Care Act Repeal and Replace Plans Might Shift Health Insurance Tax Credits, March 10, 2017", "PolitiFact, 4 questions on the fight over Obamacare and what happens next, July 20, 2017", "Kaiser Family Foundation, Premiums and Tax Credits Under the Affordable Care Act vs. the American Health Care Act: Interactive Maps, April 27, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]