["While funding from the CARES Act stimulus package makes its way to businesses, households and institutions across the U.S., social posts speculate that organizations are forwarding funds to political causes.", "“Sooooo…..the virus bill gives 25 million dollars to the Kennedy center....200million to PBS....in return the Kennedy center donates 5 million to the Democratic party and PBS donates 25 million to the Democratic party,” a Facebook user wrote. The post has received more than 54,000 shares and 5,000 reactions.", "The Facebook user did not respond to a request for comment.", "There is no evidence that the Kennedy Center has made any political contributions to the Democratic Party. Furthermore, the Kennedy Center is barred from making any political contributions.", "Fact check:Did PBS donate coronavirus stimulus money to the Democratic Party?", "As a 501(c)(3) tax-exempt organization, the John F. Kennedy Center for the Performing Arts is prohibited from making political donations to or participating in political activity. The center, which normally serves as a hub for the nation’s performing artists, announced March 17 that all performances and events were canceled due to COVID-19.", "\"The Kennedy Center is a federal instrumentality and has never donated to any political organization,\" Brendan Padgett, a spokesperson for the Kennedy Center, told USA TODAY.", "In March, the Kennedy Center received $25 million as part of the CARES Act stimulus package. The funds were designated to fund “employee compensation and benefits, grants, contracts, payments for rent or utilities, fees for artists or performers, information technology, and other administrative expenses.”", "The center is further required to provide a report to Congress this fall explaining how all provided funding was used.", "Established by Congress in 1958 as the National Culture Center, the Kennedy Center is governed by its board of trustees in a public-private partnership with the federal government. The center is funded by an annual allocation from Congress alongside outside donations. A recent $250 million expansion was achieved through a fundraising campaign.", "President Donald Trump has spoken positively about the stimulus package’s allocation to the Kennedy Center.", "“It was $35 million but we took off 10, but I am a fan of that,” Trump said. “The Kennedy Center has suffered greatly because no one can go there. It is essentially closed. And they do need some funding. I said, ‘Look, that was a Democrat request. That was not my request.’ And I said you have got to give them something. It is something that they wanted. The Democrats have treated us fairly.”", "Despite the additional funding, the center furloughed 60% of its full-time employees in late March. The move, which came after its part-time staff was already furloughed, received backlash from the public and lawmakers.", "A statement from the center said that even with the extra cash, the center expects to run out of funding as soon as July. The statement also outlines how the center will allocate the $25 million it received from the CARES Act. None of the funding will support the Democratic Party.", "In April, the center rescinded the furlough for employees represented by the D.C. Federation of Musicians after negotiations. Instead, performers will see a 35% pay cut through September.", "We rate this claim FALSE because it is not supported by our research. There is no evidence the Kennedy Center has used its funding to donate to the Democratic Party or affiliated groups. It is also legally barred from such activity. All funding allocated to the center in the coronavirus stimulus package has been earmarked for specific needs, each concerned with compensation for workers and maintenance. Even with additional funding from the federal government, the center remains under serious financial stress."]