["One of the articles in Tanzanian newspaper Fahari Yetu was shared as a screenshot here. According to the Swahili article, Rajoelina made the allegations during an interview on French news channel France 24.", "A similar article, headlined “WHO offered $20m bribe to see COVID-19 medicine poisoned - Madagascar President\", appeared in another newspaper, Tanzania Perspective, on May 14, 2020. A screenshot of the publication was shared hundreds of times on Facebook here and here.", "The claims also appeared on Facebook in French here and here.", "Madagascar's herbal concoction", "Madagascan President Andry Rajoelina last month launched a herbal concoction he claims can prevent and cure the novel coronavirus. The drink, which was developed by the Malagasy Institute of Applied Research (IMRA), is derived from artemisia -- a plant with proven efficacy in malaria treatment -- and other indigenous herbs.", "However, the WHO has warned against \"adopting a product that has not been taken through tests to see its efficacy\" while the Africa Centres for Disease Control and Prevention has said the herbal drink should be \"tested rigorously\".", "President Rajoelina has defended the supposed COVID-19 remedy and even shipped the herbal concoction to Tanzania upon request by President John Pombe Magufuli. As reported by AFP, several African nations have also expressed interest in the purported remedy, known as Covid-Organics.", "No evidence", "Although the Madagascan leader is on record questioning WHO concerns about the herbal drink, there is no evidence he accused the agency of trying to bribe him to poison Covid-Organics.", "The first claim, which appearred in the newspaper Fahari Yetu, purported that Rajoelina made the bribery accusations against the WHO during an interview on France 24. But AFP listened to France 24's interview (below) and did not find any mention of the claim.", "While the Tanzanian Perspective’s article did not mention where Rajoelina made the supposed claims, there was no trace of any such statement in local media or on his social media channels, where the president posts regular updates.", "The Madagascan presidency also flatly denied making the allegations.", "\"The Madagascan presidency absolutely denies all these allegations,\" Lova Ranoramoro, director of the presidential office, told AFP on May 14, 2020.", "\"Since the launch of the Covid-Organics remedy, many words have been falsely attributed to President Andry Rajoelina,\" she said.", "The Tanzanian Perspective has previously published false claims which AFP has debunked here.", "Similar bribery claims", "This is not the first time such bribery claims linked to Covid-Organics have appeared online.", "AFP Fact Check debunked similar claims (in French) that China and the United States offered the Madagascan president “many millions” to poison the Covid-Organics remedy.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]