["By Robert Farley", "Posted on January 30, 2018", "Firing back at criticism from Jay-Z, President Donald Trump went too far when he claimed the black unemployment rate is the lowest in recorded history “because of my policies.”", "While it’s true that the black unemployment rate recently reached its lowest level in decades, the rate has been in steady decline for about the last seven years.", "Trump has boasted repeatedly about the record-low unemployment among African Americans. But in response to criticisms leveled by rap mogul Shawn “Jay-Z” Carter in a Jan. 27 interview on CNN, Trump took full credit for the milestone in black unemployment.", "Jay-Z said reports that the president called African nations “shitholes” was “disappointing and hurtful … because he’s, like, looking down on a whole population of people.”", "Somebody please inform Jay-Z that because of my policies, Black Unemployment has just been reported to be at the LOWEST RATE EVER RECORDED!", "— Donald J. Trump (@realDonaldTrump) January 28, 2018", "As the chart below illustrates, the black unemployment rate has been in a years-long downward trend that continued under Trump. The part in red represents the months under Trump’s presidency", "When Trump took office in January 2017, the black unemployment rate was 7.8 percent, the lowest it had been in nearly 10 years, according to the Bureau of Labor Statistics. Under Trump, it dropped a full percentage point to 6.8 percent in December. That’s the lowest rate since the bureau began regularly breaking out unemployment rates by race in 1972.", "A similar drop of 1 percentage point was recorded during the same 11-month period in 2016. The drop was even more pronounced in each of the three years before that. It fell 1.9 percentage points in 2015, 1.5 percentage points in 2014 and 1.8 percentage points in 2013.", "In other words, the downward trend has continued under Trump, albeit at a slower pace than in recent years.", "(It’s also true that the continued positive trend under Trump comes despite some economists’ predictions that his policies would result in higher unemployment. In fairness to those economists, Trump was not able, in his first year, to implement some policies they feared would most harm the economy, such as enacting tariffs on imports from Mexico and China, and forcing millions of immigrants in the country illegally to leave.)", "“Presidents routinely take credit for any good news, and so there is little difference here,” Kent Smetters, a professor of business economics and public policy at the University of Pennsylvania’s Wharton School, told us via email. “In reality, it is very challenging to trace economic outcomes so early in a presidential term back to a specific policy. Historically, the black unemployment rate often decreases after the general unemployment rate decreases, which has been happening over the past several years.”", "Indeed, the overall unemployment rate has been steadily declining since reaching a peak of 10 percent in October 2009. The unemployment rate had fallen to 4.8 percent when Trump took office in January 2017, and has continued to decline under Trump’s leadership, to 4.1 percent in December.", "Meanwhile, however, the gap between white and black unemployment remains largely unchanged under Trump. While black unemployment fell to 6.8 percent in December, the white unemployment rate that month was 3.7 percent. So the white rate is 46 percent lower than the black rate, about the same as the gap in December 2016.", "The number of employed black Americans rose by 354,000 in the first 11 months under Trump. But that rise is dwarfed by the gains in the previous three years: 541,000 in 2016, 767,000 in 2015 and 710,000 in 2014.", "Considered another way, the labor force participation rate for black Americans in December was 62.1 percent, slightly lower than the 62.3 percent rate in January 2017, just before Trump took office. The labor participation rate is the percentage of those age 16 and older who are working or looking for work.", "In addition to his boasts about black unemployment, Trump has been exaggerating gains by women during his presidency, saying for example that there are “more women in the workforce today than ever before.” As we recently wrote, while more women are working now than when he took office, the employment gains by women were 34 percent larger over the same period, from January to December, in each of the last two years. In fact, the 863,000 women who joined the workforce in 2017 is the smallest increase since 2012 and below the historical norm for the past 54 years, dating to 1964.", "FactCheck.org Rating:", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]