["About this rating", "Since at least February 2020, an online advertisement appeared across the internet, displayed on websites that partnered with the Taboola advertising platform: \"Experts Reveal The Potentially Hidden Truth Behind The Titanic.\"", "Readers who clicked on the ad were led to a story on a website called Serendipity Times. Its headline read: \"Experts Discovered The Real Reason The Titanic Sank – And The Truth Had Been Covered Up For Decades.\"", "This story was a variation of our previous reporting on the theory that a coal fire had accelerated the sinking of the Titanic.", "In 2017, a new documentary was released, titled, \"Titanic: The New Evidence.\" The crux of the documentary was that photographs had been found that were captured during the ill-fated ship's construction. The pictures purportedly supported the theory that a coal fire on the ship's hull was ignored.", "However, the Serendipity Times advertisement and headline were misleading. There was no indication that the coal fire theory or the documentary's found photographs had been \"covered up for decades.\" The words \"covered up\" implied purposeful deceit, for which there was no evidence. In reality, the pictures had simply been gathering dust in an attic. The coal fire theory itself also was not new.", "As for the legitimacy of the coal fire theory and the 2017 documentary, our previous reporting took an in-depth look into both.", "Further, reporting from The New York Times said that experts found the coal fire theory to be \"compelling, but were divided over how important a role the fire may have played.\"", "In an interview, Richard de Kerbrech, a marine engineer based on the Isle of Wight who has written two books on the Titanic disaster, said that the fire would have damaged the ship’s bulkhead, a wall of steel within the ship’s hull, and made it more vulnerable after it was pierced by an iceberg. An official British inquiry, in 1912, mentioned the fire, but the judge who presided over it, whom critics saw as sympathetic to shipping interests, played it down.", "“This discovery is a revelation and could change our knowledge of the history of what happened,” Mr. de Kerbrech said.", "The story from the Times also quoted David Hill, described as \"a former honorary secretary of the British Titanic Society.\" He argued that, \"while the damage caused by the fire to the steel walls protecting the hull may have hastened the disaster, the blaze was not the decisive factor.\"", "\"When the Titanic hit the iceberg close to midnight on April 14, 1912, it created a 300-foot-long line of damage on the starboard section of the hull, including punctures and gashes, that opened up too many compartments to the sea, so that the weight of the water dragged the bow down so low that the ship eventually sank,” he said. “A fire may have accelerated this. But in my view, the Titanic would have sunk anyways.\"", "He added: \"It amazes me how this ship still captures the global imagination. It was not the worst-ever catastrophe at sea. But it is the one everyone remembers.\"", "We previously covered another story about an \"old camera\" found on the ocean floor that purportedly had photographs from the Titanic. This false claim had also first appeared in misleading online advertisements.", "Snopes debunks a wide range of content, and online advertisements are no exception. Misleading ads often lead to obscure websites that host lengthy slideshow articles with lots of pages. It's called advertising \"arbitrage.\" The advertiser's goal is to make more money on ads displayed on the slideshow's pages than it cost to show the initial ad that lured them to it. Feel free to submit ads to us, and be sure to include a screenshot of the ad and the link to where the ad leads.", "Jordan Liles is a Senior Reporter who has been with Snopes since 2016.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]