["By Angelo Fichera", "Posted on February 2, 2021", "A meme purports to list actions taken by President Joe Biden in his “first 48 hours” in office — but most of the points are misleading or wrong. For example, the purported tax changes are proposals — some of which need additional context — and would require legislation before they can be implemented.", "It’s true that President Joe Biden has had a busy first two weeks in office — signing a flurry of executive orders, a move that has prompted some criticism.", "But a meme shared on Instagram and Facebook distorts the facts about Biden’s early actions, claiming to show a list of his work during his “first 48 hours.” It further instructs social media users to “brace yourselves for what’s coming!!”", "A few of the bullet points are accurate, but other items are proposals that have not become law or distortions of what has actually occurred.", "Among the accurate claims: Biden did recommit the U.S. to the Paris Agreement and he did halt U.S. departure from the World Health Organization. And there was a terrorist attack in Baghdad, Iraq, on Jan. 21 — the day after Biden was sworn in (though it’s unclear if the meme is suggesting that the attack is somehow connected to Biden taking office).", "Here are the facts on some of the other claims in the meme.", "Claim: “Ready to deploy soldiers to Middle East (wars).”", "Facts: There is no evidence Biden in his first days proposed deploying more soldiers to the Middle East.", "Claim: “Rejoins the TPP (massive job loss to China).”", "Facts: There has been no formal effort yet to rejoin the Trans-Pacific Partnership, a trade agreement from which Trump withdrew the U.S. in 2017.", "Biden has signaled he would possibly try to renegotiate the partnership, but that has not happened yet and certainly did not happen in his first 48 hours.", "Claims: “Men with wigs can enter girls restrooms,” and “Men with wigs can compete in women sports.”", "Facts: The meme may be referring to an executive order that Biden signed on his first day, which seeks to ensure that existing federal laws protecting against sex discrimination are enforced to protect against discrimination on the basis of gender identity and sexual orientation. But federal agencies have yet to lay out how exactly the order will be put into motion.", "The order says “[c]hildren should be able to learn without worrying about whether they will be denied access to the restroom, the locker room, or school sports” and cites a 2020 Supreme Court decision that held that Title VII’s prohibition on employment discrimination on the basis of sex also covers gender identity and sexual orientation.", "“In Title VII, Congress adopted broad language making it illegal for an employer to rely on an employee’s sex when deciding to fire that employee,” the court ruled. “We do not hesitate to recognize today a necessary consequence of that legislative choice: An employer who fires an individual merely for being gay or transgender defies the law.”", "Biden’s executive order posits that the same rationale should apply to other laws prohibiting sex discrimination — such as Title IX, which protects against sex discrimination in schools and educational programs receiving federal money — “so long as the laws do not contain sufficient indications to the contrary.”", "It further directs federal agencies to “review all existing orders, regulations, guidance documents, policies, programs, or other agency actions” relating to “Title VII or any other statute or regulation that prohibits sex discrimination, including any that relate to the agency’s own compliance with such statutes or regulations” and determine whether they “are or may be inconsistent with the policy set forth in section 1 of this order.”", "“The head of each agency shall … consider whether to revise, suspend, or rescind such agency actions, or promulgate new agency actions, as necessary to fully implement statutes that prohibit sex discrimination and the policy set forth in section 1 of this order,” it adds.", "The order gives the agencies 100 days to develop plans to carry out any actions relating to the order.", "Meanwhile, some state legislators have introduced measures aimed at preventing transgender girls from participating in women’s sports.", "Claim: “We’ll be charged a hefty fine for not having health insurance (Obama care).”", "Facts: Biden and Democrats in Congress may well indeed, at some point, reintroduce the penalty associated with the individual mandate under the Affordable Care Act. But that hasn’t happened yet.", "As we’ve explained before, the individual mandate requires Americans to have insurance or pay a penalty, but in 2017 that penalty was reduced to $0 by Republicans in Congress. In a lawsuit now before the Supreme Court, Republican state officials have asked that the mandate be declared unconstitutional since there’s no longer a tax associated with it — and that the entire health care law be dismantled. (The Supreme Court had previously, in 2012, ruled the mandate was constitutionally valid as a tax.)", "Some have observed that if the penalty is increased from $0, it may undermine Republicans’ current legal argument against the mandate.", "Claim: “Revokes Keystone Pipeline, 57,000 go jobless.”", "Facts: Biden did sign an executive order rescinding a March 2019 permit for the Keystone XL Pipeline — a pipeline slated to run from Alberta, Canada, through the U.S., to Nebraska. The executive order said “the significance of the proposed pipeline for our energy security and economy is limited” and that the U.S. would “prioritize the development of a clean energy economy, which will in turn create good jobs.”", "But the pipeline project was not employing “57,000,” as the meme claims.", "Terry Cunha, a spokesman for the company behind the pipeline, TC Energy, told us in an email that 1,000 unionized jobs will be lost in the coming weeks as a result of the permit being revoked.", "Those were construction jobs — and therefore temporary.", "“The project was prepared to hire 11,000 union workers during the construction of the project,” Cunha said, citing an October 2020 press release that said the project expected to employ 11,000 Americans in 2021.", "A 2014 State Department report on the pipeline estimated that, after construction, the project “would generate approximately 50 jobs during operations” — 35 permanent employees and 15 temporary contractors.", "Claim: “Corporate taxes jump from 21.0% to 28.8%.”", "Facts: Biden has proposed during his campaign to raise the corporate tax rate from 21% to 28% (not 28.8%); a 2017 law dropped it to 21% from 35%.", "That hasn’t happened yet, though.", "“All of these tax proposals would require legislation to be enacted, which hasn’t happened yet,” Garrett Watson, a senior policy analyst at the Tax Foundation, noted in an email to FactCheck.org.", "Claim: “Income & payroll taxes from 37.0% to 52.0%.”", "Facts: The top federal income tax rate is currently 37% — which this year applies to individual taxpayers with income of more than $523,600 (or $628,300 for married filing jointly).", "Biden has, again, proposed raising taxes on those earning above $400,000 — which the meme fails to make clear.", "Specifically, for those earning above $400,000, Biden has pitched raising the income tax rate to 39.6%. In addition, he has supported adding a payroll tax of 12.4% on earned income above $400,000.", "“The 52% number for income and payroll tax is adding together the 39.6% rate above $400K and the proposed 12.4% Social Security payroll tax on income above $400K,” Watson said. “This would be the case for both employees and self-employed individuals, but it would be a top rate” — meaning income above the $400,000 — “not an effective rate on all income.”", "Claim: “Small business taxes from 29.6% to 39.6%.”", "Watson said the “small business taxes” refers to those business owners taxed at the aforementioned 37% top rate — “offset by the Section 199A passthrough deduction (20%),” which is available to some business owners, “yielding a rate of 29.6%.”", "But Watson said the deduction “is already curtailed for higher earners in service industry professions, and it would be curtailed further by Biden for income above $400,000.”", "In other words, the deduction is already in many cases not available to higher-income earners, so for many the change would be from 37% to 39.6%, Watson added.", "Claim: “Capital gains & divident taxes from 23.8% to 43.4%.”", "It’s true that capital gains are currently taxed at a 23.8% top rate, “as it is 20 percent plus the 3.8 percent net investment income tax (NIIT),” Watson said.", "“Biden has proposed taxing capital gains and dividends above $1,000,000 at an ordinary rate of 39.6 percent,” he said.", "Watson pointed out that the Biden campaign said that the 39.6% would be inclusive of NIIT — “so a 43.4 percent rate is probably too high,” he added. And he reiterated that that tax rate would apply to income over $1 million.", "But, as we said, that — like the other tax proposals — has not yet become law.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "Bostock v. Clayton County, Georgia. U.S. Supreme Court. Decided 15 Jun 2020.", "Cunha, Terry. Spokesperson, TC Energy. Email to FactCheck.org. 28 Jan 2021.", "“Executive Order on Preventing and Combating Discrimination on the Basis of Gender Identity or Sexual Orientation.” White House. 20 Jan 2021.", "“Executive Order on Protecting Public Health and the Environment and Restoring Science to Tackle the Climate Crisis.” White House. 20 Jan 2021.", "“Final Supplemental Environmental Impact Statement for the Keystone XL Project | Executive Summary.” Bureau of Oceans and International Environmental and Scientific Affairs, U.S. Department of State. January 2014.", "“Letter to His Excellency António Guterres.” White House. 20 Jan 2021.", "Maizland, Lindsay. “Biden’s First Foreign Policy Move: Reentering International Agreements.” Council on Foreign Relations. 21 Jan 2021.", "“Paris Climate Agreement.” White House. 20 Jan 2021.", "Quilantan, Bianca. “States challenge Biden on rights for transgender students.” Politico. 28 Jan 2021.", "Robertson, Lori. “How the Supreme Court Could Rule on ACA Case.” FactCheck.org. 10 Nov 2020.", "“Title IX and Sex Discrimination.” U.S. Department of Education. Revised April 2015.", "“Title VII of the Civil Rights Act of 1964.” U.S. Equal Employment Opportunity Commission. Accessed 29 Jan 2021.", "Watson, Garrett, et. al. “Details and Analysis of President Joe Biden’s Tax Plan.” Tax Foundation. 22 Oct 2020.", "Watson, Garrett. Senior policy analyst, Tax Foundation. Email to FactCheck.org. 28 Jan 2021.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]