["About this rating", "A photograph purportedly showing a group of nuns holding guns has been circulated online for several years, along with the claim that it depicts the Vatican Women's Rifle Team:", "The Vatican decided that Nuns with Guns was not a good image for the Catholic Church, so the Vatican Women's Rifle Team was disbanded in February, 1938. Sister Juliette left to join the French resistance as a sharpshooter. She was credited with the assassination of several Nazi officials and awarded the Médaille Militaire.", "The earliest iteration of the above-displayed claim that we have been able to uncover came from the humor web site BlandX.  That web site also claimed that the Vatican Women's Rifle Team participated in the 1936 Summer Olympics in Berlin:", "For the first and only time in Olympic history, the Vatican City fielded teams in several events, including the Womens' Rifles. The team, lead by Mother Superior Maria Grazia, didn't win any medals, but became minor celebrities. In 1937, they did an international exhibition tour of several Latin American countries and then the United States, where using the stage name \"Nuns With Guns\" they were a major attraction at the 1937 State Fairs in Iowa and Minnesota.", "There was no truth to these claims. In addition to the presence of contrary factual evidence (the Vatican did not participate at the 1936 Olympics), they can be dismissed through their source: BlandX is a humor web site that bills itself as being the \"culmination of a long chain of bad jokes.\"", "The same article reporting that the Vatican had a women's rifle team at the 1936 Olympics also said that two women from Hungary took silver in the (fictional) \"Pairs Barrel Tossing\" event:", "We were unable to locate the original source of the barrel-tossing photo, but there was no such event at the Olympics in 1936, nor in any other Olympic competition.", "However, while the claim that the Vatican had a women's rifle team at the 1936 Olympics is false, the \"nuns with guns\" image appears to be real. While we have not been able to locate the specific source of the image, it was most likely taken in 1957 at Camp Mishannock in Massachusetts, as a photograph from Corbis Images entitled \"Row of Nuns Aiming Rifles\" appears to show the same group of nuns:", "Original caption: Kingston, MA: Sisters of Divine Providence set their sights as they try out new .22 caliber guns presented to them at camp Mishannock by Harrington and Richardson of Worcester, Massachusetts. The guns will be used in a rifle training program at the camp. Pictured (R to L) are: Sister Noel, camp director; Sister Rosaria; Sister Wilfrid; Sister Mary Janet and Sister Mary. Three of the nuns will be instructors in the rifle program. Photo filed 7/12/57.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]