["About this rating", "A video featuring crowds of people \"interacting\" with virtual animals was shared on Facebook in February 2017 along with a message claiming that the footage showed a \"7D Hologram Park\" in Japan, where visitors can touch, feel, and even smell these digital creations. The video features clips from a variety of locations:", "The \"animals\" shown in this video were not part of a virtual zoo or a '7D' hologram exhibit, but instead are part of an advertising campaign for National Geographic that was reappropriated and made into a viral video.", "In 2011, National Geographic teamed up with the British digital advertising agency Appshaker to create an \"augmented reality\" exhibit in various malls:", "We built the animated content using Maya (film industry standard animation software), with the movements and mannerisms mimicking actual animal footage in the wild. The content and the sound was optimized for the shopping mall environments and our system then locks and matches the floor marker, allowing us to know exactly where the physical content sits in relation to people. This creates a \"content channel\" where all the action is.", "Although the footage appears to show people interacting with these virtual animals, Appshaker's setup does not use holograms. The animals were projected onto a screen, where they appeared to be in close proximity to the filmed audience. A \"behind the scenes\" video offers a closer look at the setup:", "Another video we found further explains how this type of exhibit is made:", "Most of the footage in the viral Facebook clip can be found on the Appshaker web site. The one exception appears to the the video's final segment, which purportedly shows a \"7D\" hologram whale \"splashing\" children in a gymnasium. That clip was created by a different company, Magic Leap, and we debunked it here.", "Kiefaber, David.   \"National Geographic Lets You Pet Dinosaurs at the Mall.\"\r\n    AdWeek.   17 November 2011.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]