["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Donald Trump and Barack Obama meet at the White House on Nov. 10, 2016.", "Barack Obama called the Trump administration’s response to COVID-19 “an absolute chaotic disaster.”", "A Twitter post, retweeted by Trump, claims that Obama is the first ex-president to speak ill of his successor.", "From Hoover to Truman, Ford to Carter and beyond, ex-presidents have criticized the person who followed them into office.", "In a call with past members of his administration, former President Barack Obama criticized the Trump administration for bungling the response to the coronavirus.", "\"It would have been bad even with the best of governments,\" Obama said May 8. \"It has been an absolute chaotic disaster.\"", "Obama’s words drew anger from President Donald Trump’s supporters, one of whom tweeted on May 10: \"Barack Hussain Obama is the first Ex-President to ever speak against his successor, which was long (a) tradition of decorum and decency.\"", "Trump retweeted the claim, adding the comment: \"He got caught, OBAMAGATE!\"", "He got caught, OBAMAGATE! https://t.co/oV6fum0zIS", "By tradition, former presidents extend some graciousness to their successors. But there is no hard and fast rule. And as you’ll see, former presidents have, when it suited them, criticized the person who followed them into the White House.", "The first example that leaped to mind of three presidential historians we contacted is President Herbert Hoover, who lost to Franklin Delano Roosevelt in 1932.", "\"He railed against the New Deal, FDR, liberalism and, in some ways, modernity itself, from the time he left office in 1933 until his death in the mid-1960s,\" said Jeffrey Engel, director of the Center for Presidential History at Southern Methodist University.", "At the 1936 Republican convention, Hoover cast Roosevelt and the New Deal as a step toward dictatorship.", "\"The New Deal may be a revolutionary design to replace the American system with despotism,\" Hoover said. \"Their product is the poisoning of Americanism.\"", "A generation later, Harry Truman seized the moment at the Democrats’ convention in 1956 to attack his Republican successor, Dwight Eisenhower, Claremont McKenna College’s John Pitney noted.", "\"For three and half years, the Eisenhower administration has been using every trick and device to pry our water power, and our forest, our parks and oil reserves out of the hands of people and into the pockets of a few selfish corporations,\" Truman said Aug. 17, 1956.", "Jump forward to 1977, when Republican Gerald Ford ridiculed the economic policies of the man who ousted him from office, Jimmy Carter.", "\"Mr. Carter's anti-inflation program came in like a lion,\" Ford said three months into Carter’s presidency. \"It's going out like a mouse.\"", "Carter carried on the tradition. In November 1982, he said President Ronald Reagan had undermined confidence in America’s global leadership.", "\"There's not that assured feeling now that our country is in the forefront of peace, nuclear arms control, human rights and environmental concern that it was before,\" Carter said in a news conference.", "At the same event, Carter chastised Reagan for faulting Carter for the problems Reagan faced.", "\"There is always the temptation for an incumbent politician to blame all his mistakes on his predecessor,\" Carter said. \"Most are willing to withstand the temptation. Mr. Reagan, apparently, is not.\"", "The idea that Obama is the first president to criticize his successor has been around since at least 2018, when Snopes found it false, citing Presidents George H.W. Bush and Bill Clinton as recent examples.", "\"Trump’s claim is simply not true under any possible definition of ‘speak against’ or ‘successor,’\" said Rutgers University historian David Greenberg.", "A Twitter post, retweeted by Trump, claimed that Obama \"is the first ex-president to ever speak against his successor.\"", "There are several examples of former presidents criticizing the person who followed them into office. For much of the past century, Republicans have spoken ill of Democrats, and Democrats have done the same with Republicans.", "While the tradition of exercising restraint exists, it has its limits, and in at least one case, an ex-president spoke out as early as three months into the new administration.", "We rate this claim False.", "Donald Trump, Retweet, May 10, 2020", "Dickinson State University, 1912 speech attacking William H. Taft, accessed May 11, 2020", "Pepperdine University, Crisis to Free Men: Herbert H. Hoover, Republican National Convention, June 10, 1936, accessed May 11, 2020", "Truman Library, Press Release of Speech Delivered by Harry S. Truman Before the Democratic National Convention, August 17, 1956, accessed May 11, 2020", "Washington Post, Ford Ridicules His Successor's Inflation Effort, April 17, 1977", "UPI, Jimmy Carter criticized President Reagan Wednesday for making 'radical'..., Nov. 10, 1982", "Snopes, Was Barack Obama the First Ex-President to ‘Publicly Speak Against’ His Successor?, Nov. 6, 2018", "Email exchange, Jeffrey A. Engel, director, Center for Presidential History, Southern Methodist University, May 11, 2020", "Email exchange, John Pitney, professor of American politics, Claremont McKenna College, May 11, 2020", "Email exchange, David Greenberg, professor of history, Rutgers University, May 11, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]