["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Democratic presidential candidate Hillary Clinton is airing a new TV ad in Colorado that touts her battle-tested preparation for \"the toughest job in the world.\"", "\"The world a president has to grapple with, sometimes you can't even imagine,\" a narrator says in the 30-second ad, which begins with images of protest in a foreign land, a war zone and a tornado churning near vehicles on a roadway.", "The ad says the former first lady, senator and secretary of state is \"the one who's proven she can get it done,\" ticking off a string of achievements.", "We’re focusing on a single claim, that one of the things Clinton got done was \"winning health care for 8 million children.\"", "Clinton has often cited this achievement. During the 2008 presidential campaign, PolitiFact rated one campaign ad as Half True because it implied she’d single-handedly \"stood up for universal health care when almost no one else would.\" In another instance, we rated her comment True because she qualified her claim, saying she \"helped\" create the children’s health coverage program -- along with others.", "Let’s revisit the facts.", "It's correct that the Children’s Health Insurance Program -- known as CHIP -- provides health care coverage to more than 8 million children, according to Medicaid. Created in 1997, when it was known as the State Children's Health Insurance Program, it promotes health coverage for low-income children by providing federal funding to states.", "The current ad gives Clinton credit for \"winning\" legislation that congressional lawmakers passed when she was first lady.", "Her campaign website has a more nuanced statement: \"As first lady, she refused to give up when Congress defeated health care reform. Instead, she worked with Republicans and Democrats to help create the Children’s Health Insurance Program, which now provides health coverage to more than 8 million children. Senator Ted Kennedy said that if not for Hillary, the Children’s Health Insurance Program wouldn’t be in existence today.\"", "The late-Sen. Kennedy received much of the credit for CHIP because the Massachusetts Democrat shepherded the legislation through a Republican-controlled Congress. Utah Sen. Orrin Hatch was the lead Republican co-sponsor.", "Yet, in 2007, Kennedy told the Associated Press that Hillary Clinton played a critical role.", "\"The children's health program wouldn't be in existence today if we didn't have Hillary pushing for it from the other end of Pennsylvania Avenue,\" Kennedy said.", "Nick Littlefield, a senior health adviser to Kennedy at the time, agreed.", "\"She wasn't a legislator, she didn't write the law, and she wasn't the president, so she didn't make the decisions,\" Littlefield told the Associated Press. \"But we relied on her, worked with her and she was pivotal in encouraging the White House to do it.\"", "But the new Clinton ad has no qualifiers, stating \"she's the one who's proven she can get it done… winning health care for 8 million children.\"", "Our ruling", "A Clinton campaign ad says one of her accomplishments was \"winning health care for 8 million children.\"", "That statement is largely accurate. Clinton was key to creating the Children’s Health Insurance Program, which provides coverage for 8 million children. But the ad leaves out the contributions of others.", "Because of that caveat, we rate her statement Mostly True.", "Interview with Josh Schwerin, Hillary Clinton spokesman, February 16, 2016", "Medicaid.gov, \"Children's Health Insurance Program\"", "HillaryClinton.com, \"Affordable health care is a basic human right\"", "Associated Press, \"Clinton Claims Credit for Child Program, \" October 5, 2007", "PolitiFact.com, \"Clinton promoted children's health care,\" January 6, 2008", "PolitiFact.com, \"Standing up, but not alone,\" October 8th, 2007", "PolitiFact.com, \"Clinton promoted children's health care,\" January 6, 2008", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]