["The five-minute video has been shared repeatedly on Facebook, for example here where it has been viewed nearly 650,000 times since it was posted January 18.", "It has also been viewed nearly 200,000 times since it was posted here on the “Pendukung#2019GantiPresiden” page, which supports Prabowo Subianto, the sole challenger to incumbent Joko Widodo, in Indonesia’s upcoming presidential elections.", "The post’s translated caption reads: “A raid on illegal workers from China carried out hastily just ahead of the presidential election to disprove what has been publicly declared a hoax.”", "Widodo has repeatedly rejected claims that Indonesia has been flooded with millions of undocumented workers from China, according to this Jakarta Post report.", "One comment on the Facebook post said: “Everything done by the current administration is only aimed at attracting voters because the election is imminent. Why did the government not do this raid in previous years? Many people have reported similar cases yet nothing was done by the government to respond. For sure, I will vote for Prabowo on April 17.”", "But the video does not show a recent raid on illegal Chinese workers.", "AFP used multiple keyframes from the video obtained using digital verification tool InVid and found the footage was taken from this clip uploaded by Indonesia’s manpower ministry to their official YouTube channel on March 18, 2015 and titled: “[ANGRY..!!] When manpower minister Hanif Dhakiri nabs illegal foreign workers.”", "The clip’s description says it shows a team from the ministry arresting five undocumented workers from China at a mining site in South Kalimantan province on March 14, 2015.", "At 1:22 in the video, a blue banner appears with text saying: “A raid by the manpower minister at the PT Merge Mining Industry’s mining site in Banjar regency, South Kalimantan, Saturday, March 14. The arrested illegal workers are from China.”", "The banner can also be seen at 1:22 in the clip featured on the false Facebook posts.", "Below are the screenshots comparing the exact moment from the two clips.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]