["About this rating", "Harris did date former San Francisco Mayor and State Assembly Speaker Willie Brown for a period of time between 1994 to 1995. In his capacity as speaker, Brown appointed her to two political posts — first to the California Unemployment Insurance Appeals Board, and then to the Medical Assistance Commission.", "Although Brown was technically still married during the time period that he dated Harris, he had been estranged from his wife Blanche Brown for more than a decade. Harris' first, successful run for office in 2003 happened well after the relationship ended, and Harris sought to distance herself from Brown.", "On Aug. 11, 2020, Joe Biden, the presumptive Democratic presidential nominee, selected U.S. Sen. Kamala Harris, D-Calif., as his running mate. Harris, who is the daughter of Jamaican and Indian immigrants, made history as the first woman of color nominated as vice president on a major party ticket.", "Predictably, the internet lit up with rumors about Harris, who has been married to her husband, attorney Douglas Emhoff, since 2014. Snopes readers asked about articles and memes circulating on social media stating that years prior, Harris had an \"extramarital\" affair with former San Francisco Mayor and California Assembly Speaker Willie Brown, with some claiming that Harris' political success was achieved by being Brown's so-called mistress.", "A tawdry headline from Teaparty.org story read, \"Flashback: Kamala Harris Launched Her Political Career In Bedroom As Mistress Of Married Mayor Willie Brown.\"", "Here's an example of a meme circulating on Facebook, which appears to have been generated during Harris' run in the presidential primaries:", "These narratives are misleading by way of exaggeration. Harris dated Brown in the mid-1990s, but Brown had been estranged from his wife since 1981. Brown did appoint Harris to two political posts in 1994 while he served as Speaker of the California Assembly, but that was years before Harris won her first election in 2003. She was already working as an assistant district attorney in Alameda County when she took on the appointments.", "It's never been a secret Harris dated Brown in the mid-1990s, although it may not be well known outside political circles in California. Brown addressed their past relationship in a terse piece published by the San Francisco Chronicle on Jan. 26, 2019, a day before Harris officially launched her presidential campaign:", "Yes, we dated. It was more than 20 years ago. Yes, I may have influenced her career by appointing her to two state commissions when I was Assembly speaker.", "And I certainly helped with her first race for district attorney in San Francisco. I have also helped the careers of House Speaker Nancy Pelosi, Gov. Gavin Newsom, Sen. Dianne Feinstein and a host of other politicians.", "The history of the relationship and political appointments Brown gave Harris have also been reported in California-based news outlets for years. Los Angeles Magazine reported in 2019:", "Willie Brown was a fixture in California politics for years, serving as speaker of the state assembly for 15 years, and known as something of an unofficial deal-maker and influencer. He first met Harris in 1994, when she was an assistant district attorney in Alameda County. He was 60 years old at the time, and had been estranged from his wife, Blanche Brown, since 1981.", "In his capacity as speaker, Brown appointed Harris to two political positions. The first was a six-month appointment to the California Unemployment Insurance Appeals Board; the second was a role on the Medical Assistance Commission, a body tasked with negotiating contracts to control Medi-Cal costs. At the time, Brown had a reputation for filling many openings with his personal associates and inner circle; when Harris vacated the Appeals Board gig, he replaced her with his longtime buddy Philip S. Ryan.", "Harris ended the relationship–which was conducted in the open and frequently reported on at the time–in late 1995, shortly before Brown was sworn in for his first of two terms as mayor of San Francisco.", "Harris didn't run for political office until well after her relationship with Brown ended. In 2003, she made a successful bid for the office of San Francisco district attorney, a position she held until she was elected to serve as the attorney general of California, taking office in 2011. She held that post until she was elected in 2016 to serve in the United States Senate representing the state of California.", "Harris has been beset by allegations that Brown influenced her career for years. At the time of her first run for office for San Francisco district attorney, SF Weekly quoted Harris distancing herself from Brown:", "I refuse to design my campaign around criticizing Willie Brown for the sake of appearing to be independent when I have no doubt that I am independent of him — and that he would probably right now express some fright about the fact that he cannot control me.", "His career is over; I will be alive and kicking for the next 40 years. I do not owe him a thing.", "In regards to the political appointments, Harris went on to state:", "These jobs were created before I was born. Whether you agree or disagree with the system, I did the work. I worked hard to keep St. Luke's Hospital [in San Francisco's Mission neighborhood] open. I brought a level of life knowledge and common sense to the jobs. I mean, if you were asked to be on a board that regulated medical care, would you say no", "It's true that Harris dated Brown between 1994 and 1995. During that time, when he was serving as speaker of the California assembly, Brown gave Harris two political appointments. Although it's true that Brown was married at that time, the relationship was no secret, since Brown had long been separated from his wife. All of Harris' electoral victories occurred years after her relationship with Brown ended. We rate this claim \"Mixture,\" because while there are elements of objective fact — Brown and Harris dated, Brown appointed Harris to two posts — other elements are sensationalized and misleading.", "Zhou, Li. \"Willie Brown’s Op-Ed About Kamala Harris, Explained.\"\r\n  Vox. 28 January 2019.", "Brown, Willie. \"Sure, I dated Kamala Harris. So What?\"\r\n  San Francisco Chronicle. 26 January 2019.", "Castro, Peter. \"No Mere Mayor.\"\r\n  People. 24 June 1996.", "Martin, Brittany. \"Kamala Harris Dated Willie Brown Decades Ago and Her Critics Claim It Matters.\"\r\n  Los Angeles. 29 January 2019.", "Hakim, Danny, et al. \"'Top Cop' Kamala Harris’s Record of Policing the Police.\"\r\n  The New York Times. 9 August 2020.", "Byrne, Peter. \"Kamala's Karma.\"\r\n  SF Weekly. 24 September 2003.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]