["According to a tale currently spreading across Canadian social media, sex traffickers have devised a new tactic in order to abduct their victims. Criminals, the rumour goes, are placing a $100 bill wrapped with a red ribbon on parked car door handles. They are laced with a debilitating agent in order to incapacitate victims once they touch the bill, leaving them vulnerable to abduction.", "In all cases, the Facebook posts mention that the information “is shared from a friend,” or a relative of a friend, however AFP has found no instances of anyone telling the story from a personal point of view.", "A copied and pasted version of the post has been shared across Canada, partly because the text specifies that this tactic is used at the Northgate Mall, a common name for shopping centers in North America. Northgate Mall is also the name of the first mall in the United States, opened in 1950 in Seattle.", "In Canada, viral versions of the same post mention the Northgate Village, a mall in Burnaby, a suburb of Vancouver in British Columbia, the Northgate Centre in Edmonton, and the Northgate Shopping Centre in Winnipeg. In the United States, identical versions of the story were shared from Revere, near Boston, Cincinnati, in the midwestern state of Ohio and in the Pacific Northwest.", "However, nothing suggests that such abduction tactics are being used in any of those cities, or elsewhere in North America in 2020.", "“We’ve seen it around quite a lot on social media. We’ve not been able to verify this. Police haven’t received any reports of that,” Cheryl Voordenhout, spokesperson for the Edmonton Police Department, told AFP. Following AFP’s inquiry, the Edmonton Police Department released an official statement on the matter.", "“Nothing of that sort has been reported here in Winnipeg,” Winnipeg Police Service media officer Ally Siatecki told AFP in an email. This information was corroborated by Mitch Natividad, the Northgate Shopping Centre building manager, who wrote that there was “nothing to worry because nothing like that has ever happened to our mall.”", "“We are aware of these social media posts and to date we are unable to locate a report or investigation related to the complaint being outlined in the posts,” the Burnaby Royal Canadian Mounted Police (RCMP) told AFP in a statement regarding the Northgate Village mall.", "The Burnaby RCMP advised, “We caution people to think twice, do some research and if they are concerned about whether this occurred or not to contact police before sharing these posts.”", "A Google News search for “Northgate Mall abduction,” also reveals nothing akin to the viral story.", "The available data on child abductions further refutes the idea that strangers generally loom in public spaces in the hope of kidnapping children. In Canada and in the United States, the majority of child abductions are carried out by a child’s relative.", "According to this data from Canada’s National Centre for Missing Persons and Unidentified Remains, only 27 children were abducted by strangers out of 42,233 reports of missing minors in 2018. The report added that 92 percent of missing minor reports were removed from the list within a week, and that 73 percent of cases are runaways.", "Abductions by strangers “are so rare that when they do happen, the impact is great and that’s why people are so fearful of stranger abduction,” Karen Chymy, director of operations for MissingKids.ca, a resource center for missing children, told AFP.", "AFP Fact Check has debunked similar stories, including false reports of thwarted abductions at Canada’s Wonderland and of a child’s abduction at an Ontario mall.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]