["About this rating", "On 22 May 2019, the conservative nonprofit Turning Point USA posted an inaccurate meme on its Facebook page purporting to show an image of starving citizens eating trash in Venezuela.\n\nThe image on the bottom half of the meme doesn't depict people in Venezuela eating garbage. The picture was taken by a Reuters photographer in 2013, according to the caption. \"Scavengers search for items to recycle at a waste dump in Bogor, a city in Indonesia's West Java province,\" the caption reads.", "Venezuela is suffering extreme economic instability — about 90 percent of the population lives in poverty, according to a UN report cited by American Public Media's \"Marketplace,\" and Reuters reported that some Venezuelans have been reduced to scavenging for edible food in garbage bins.\nBecause of this, the South American country has been the focus of ideologues campaigning against socialism as an economic model. Its woes have been used as a cudgel against some American politicians like U.S. Sen. Bernie Sanders (I-Vermont) and U.S. Rep. Alexandria Ocasio-Cortez (D-New York), who bill themselves as democratic socialists.\nThe Trump administration had made a priority of ousting Venezuela's socialist President Nicolás Maduro (whom Trump has referred to as a \"Cuban puppet\"), recognizing instead his political opponent Juan Guaidó as president. Despite that rhetoric, Maduro has remained in office.", "Venezuela is suffering extreme economic instability — about 90 percent of the population lives in poverty, according to a UN report cited by American Public Media's \"Marketplace,\" and Reuters reported that some Venezuelans have been reduced to scavenging for edible food in garbage bins.", "Because of this, the South American country has been the focus of ideologues campaigning against socialism as an economic model. Its woes have been used as a cudgel against some American politicians like U.S. Sen. Bernie Sanders (I-Vermont) and U.S. Rep. Alexandria Ocasio-Cortez (D-New York), who bill themselves as democratic socialists.", "The Trump administration had made a priority of ousting Venezuela's socialist President Nicolás Maduro (whom Trump has referred to as a \"Cuban puppet\"), recognizing instead his political opponent Juan Guaidó as president. Despite that rhetoric, Maduro has remained in office.", "Winn, Patrick. \"The World Is Ignoring One of Cheap Oil’s Biggest Victims.\"\r\n  PRI. 12 December 2016.", "DeYoung, Karen, and Dawsey, Josh. \"With Maduro Entrenched in Venezuela, Trump Loses Patience and Interest in Issue, Officials Say.\"\r\n  The Washington Post. 19 June 2019.", "Valderrama, Shaylim. \"Warding Off Hunger, Venezuelans Find Meals in Garbage Bins.\"\r\n  Reuters. 1 March 2019.", "Anand, Anu and Chiriguayo, Danielle. \"A Look at Venezuela's Economy as Maduro Begins His Second Term.\"\r\n  Marketplace. 10 January 2019.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]