["About this rating", "The Trump administration FDA pushed back required start dates for agricultural water testing.", "Agricultural water testing regulations were delayed and not overturned, President Trump himself did not order the rollback of testing dates, the cause of the autumn 2018 E. coli outbreak has not been determined, and agricultural water testing would not have begun everywhere even if the original start dates had not been pushed back.", "U.S. government officials reported three major outbreaks of Escherichia coli (E. coli) bacteria in 2018. One was associated with ground beef, but two others associated with romaine lettuce garnered widespread news coverage throughout the year.", "The first outbreak, during the spring, affected 210 people in 36 states and led to 96 hospitalizations and five deaths, while the second outbreak began in October and was still ongoing as of 4 December. Up to that date, 43 people in 12 states had been infected, with 16 of those requiring a visit to the hospital.", "On 25 November 2018, a viral tweet placed the blame for the autumn E. coli outbreak at the doorstep of President Donald Trump himself, claiming that his alleged decision to overturn Obama-era regulations about farm water testing was the cause of the outbreak.", "Dr. Eugene Gu. a controversial surgeon with outspoken progressive views and a large following on Twitter, posted the following claim:", "We have an outbreak of E. Coli O157:H7 which makes you vomit blood, have bloody diarrhea, and even pee blood as you lose your kidneys. It’s all because Trump overturned Obama-era rules to test our farm water. Farmers save $12 million so that we pay $108 million in medical costs.", "We have an outbreak of E. Coli O157:H7 which makes you vomit blood, have bloody diarrhea, and even pee blood as you lose your kidneys. It’s all because Trump overturned Obama-era rules to test our farm water. Farmers save $12 million so that we pay $108 million in medical costs.", "— Eugene Gu, MD (@eugenegu) November 25, 2018", "Dr. Gu's claim, that the November 2018 outbreak of E. coli was \"all because of\" a purported decision made by President Trump or his administration to overturn existing regulations, was off the mark in a few ways.", "Postponed, not \"overturned\"", "First, the Trump administration did not \"overturn\" the regulations in question. Rather, the U.S. Food and Drug Administration (FDA) proposed (rather than definitively ruled) that compliance dates for beginning agricultural water inspections should be pushed back by four years.", "Moreover, the decision to offer that proposal was taken by the FDA itself and was not the result of a directive from President Trump.", "In his tweet, Dr. Gu appeared to allude to a set of regulations introduced in January 2016 that tightened standards and procedures around testing agricultural water for contaminants, including the presence of E. coli bacteria.", "As is standard practice for many new or enhanced agricultural or environmental regulations, businesses and farms were given time to get up to speed with the demands of the new rules. This preparation time is known as a \"compliance period.\"", "However, in September 2017 the FDA proposed extending these compliance periods after consulting with stakeholders from the agriculture industry. The 2016 regulations imposed different requirements and compliance periods for (broadly speaking) two kinds of farms: those involving sprouts and those not involving sprouts. This bifurcation was due to the fact that sprouts are unusually vulnerable to contamination due to what the FDA described as the \"warm, moist and nutrient-rich conditions needed to grow them.\"", "For all other farms, here is a breakdown of the compliance dates for beginning water testing under the original 2016 rules and under the FDA's proposal to extend the compliance periods:", "Although the FDA only proposed pushing back the compliance dates, the agency also made it clear that they would not be enforcing the original compliance dates, stating: \"The FDA does not intend to enforce the agricultural water requirements for covered produce other than sprouts while the rulemaking to extend the compliance dates is underway.\" This meant that, in effect, the first of the three compliance dates (26 January 2018) had been postponed.", "However, the original compliance dates for the other two of the three categories of farm had not passed by the time the October 2018 E. coli outbreak began. This is important to bear in mind when evaluating Dr. Gu's claim that the outbreak was \"all because\" of the decision to push back compliance dates.", "If the outbreak began in a farm or farms with an annual product value of less than $500,000, then the FDA's decision was likely unrelated to the October E. coli outbreak. That brings us to the second weakness in Dr. Gu's claim.", "Causes unknown", "As of 4 December 2018, the Centers for Disease Control (CDC) had not identified the exact cause and source of the autumn 2018 E. coli outbreak, although the agency did advise consumers to avoid romaine lettuce harvested in the Central Coastal region of California, adding \"If you do not know where the romaine is from, do not eat it.\"", "On their website, the CDC outlined how \"Shiga toxin-producing E. coli\" (STEC), the specific type of E. coli found in the autumn 2018 outbreak, can spread:", "Infections start when you swallow STEC -- in other words, when you get tiny (usually invisible) amounts of human or animal feces in your mouth. Unfortunately, this happens more often than we would like to think about. Exposures that result in illness include consumption of contaminated food, consumption of unpasteurized (raw) milk, consumption of water that has not been disinfected, contact with cattle, or contact with the feces of infected people.", "Some foods are considered to carry such a high risk of infection with E. coli O157 or another germ that health officials recommend that people avoid them completely. These foods include unpasteurized (raw) milk, unpasteurized apple cider, and soft cheeses made from raw milk.", "Sometimes the contact is pretty obvious (working with cows at a dairy or changing diapers, for example), but sometimes it is not (like eating an undercooked hamburger or a contaminated piece of lettuce). People have gotten infected by swallowing lake water while swimming, touching the environment in petting zoos and other animal exhibits, and by eating food prepared by people who did not wash their hands well after using the toilet. Almost everyone has some risk of infection.", "So although the CDC identified romaine lettuce from a particular region of California as being related to that outbreak, it remains unclear how the infection spread and what role, if any,  agricultural water may have played in carrying the bacteria.", "This lack of knowledge about the cause of the outbreak is an added reason to cast doubt on the notion expressed in Dr. Eugene Gu's viral tweet that allegedly lax water inspection standards were to blame for the autumn 2018 E. coli outbreak.", "U.S. Centers for Disease Control.   \"Food Safety Alert -- Outbreak of E. Coli Infections Linked to Ground Beef.\"\r\n    20 September 2018.", "U.S. Centers for Disease Control.   \"Multistate Outbreak of E. Coli O157:H7 Infections Linked to Romaine Lettuce (Final Update.)\"\r\n    28 June 2018.", "U.S. Centers for Disease Control.   \"Food Safety Alert -- Outbreak of E. Coli Infections Linked to Romaine Lettuce.\"\r\n    26 November 2018.", "Kelman, Brett.   \"This Vanderbilt Doctor Got Political. Then He Sued Trump and Won. Now He's Out of a Job.\"\r\n    The Tennessean.   8 June 2018.", "Food and Drug Administration.   \"FSMA Final Rule on Produce Safety.\"\r\n    19 October 2018.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]