["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Democratic vice presidential candidate Sen. Kamala Harris, D-Calif., responds during the vice presidential debate with Vice President Mike Pence Wednesday, Oct. 7, 2020, at Kingsbury Hall on the campus of the University of Utah in Salt Lake City. (AP)", "Sen. Kamala Harris said “Joe Biden will not end fracking” at the vice presidential debate.", "During a Sept. 4, 2019, town hall hosted by CNN, then-presidential candidate Harris said she was “in favor of banning fracking.”", "The statement Harris made in 2019 doesn’t mean she’s lying now. As Biden’s running mate, she’s campaigning on his platform. He has not called for a ban on fracking.", "An article shared widely on Facebook wrongly claims that Sen. Kamala Harris was \"caught in a major lie\" over Democratic presidential nominee Joe Biden’s position on fracking.", "The Oct. 7 article from the Western Journal, a conservative news and political commentary website, says Harris’ comments during the Oct. 7 vice presidential debate flew in the face of \"a history of promises\" she and Biden had made to ban hydraulic fracturing, or fracking.", "The article was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The article juxtaposes Harris’s comment during the vice presidential debate with a much different comment the California senator made more than a year earlier. Other Facebook posts that drew similar traffic have paired video footage of the two comments back to back.", "\"Joe Biden will not end fracking,\" Harris said during the debate, in response to Vice President Mike Pence’s false claim to the contrary. \"He has been very clear about that.\"", "\"There’s no question, I’m in favor of banning fracking,\" Harris said some 13 months earlier, in response to an activist’s question during a Sept. 4, 2019, town hall hosted by CNN.", "Taken side by side, the two quotes show two different positions. But that doesn’t mean she was lying during the vice presidential debate.", "There’s a key detail that explains her shift: Harris is now Biden’s running mate, meaning she is tied to his platform. When she made the initial comment in 2019, she was a primary presidential candidate running against Biden and vying for the party’s nomination with her own positions.", "Biden’s official campaign platform does not call for a ban on fracking, although the former vice president’s past comments from the campaign trail have led to some confusion on his stance.", "During a March debate with Sen. Bernie Sanders, for example, Biden said he supported \"no new fracking\" — a comment his campaign later clarified, saying he was only referring to his stated policy calling for a ban on new permits for oil and gas drilling on federally owned lands.", "George Upper, the Western Journal’s editor in chief, pointed in an email to other comments Biden has made that appeared to reflect an anti-fracking stance, such as a moment where he told an activist in September 2019, \"I guarantee you, we’re going to end fossil fuel.\"", "\"Harris is on the record with multiple similar statements,\" Upper said.", "But Biden’s plan isn’t as simple as he’s sometimes made it seem. After he said during a July 2019 debate that he would \"work (fossil fuels) out,\" his campaign clarified that he supports eliminating subsidies for fossil fuels and a gradual shift toward clean energy with the goal of achieving net-zero emissions by 2050. Both proposals are listed on his campaign website.", "According to Biden’s campaign website, he supports \"banning new oil and gas permitting on public lands and waters.\" PolitiFact has fact-checked several statements — including false claims from President Donald Trump and his reelection campaign — about Biden and fracking.", "Biden says that he won’t shut down existing fracking operations on public land, and that he’ll allow fracking to continue on private lands, where most of it takes place.", "Regardless, Harris was speaking for her own candidacy in 2019 when she said she was in favor of banning fracking. She wasn’t \"caught in a major lie\" during the vice presidential debate.", "We rate this Facebook post Mostly False.", "The Western Journal, \"Fact Check: Harris Says Biden Won't Ban Fracking, Video Shows Her and Biden Saying They Would,\" Oct. 7, 2020", "The Biden campaign website, \"The Biden Plan for a Clean Energy Revolution and Environmental Justice,\" accessed Oct. 11, 2020", "The Associated Press, \"Town hall video doesn’t prove Harris lied about fracking during debate,\" Oct. 8, 2020", "USA Today on YouTube, \"Vice Presidential Debate 2020 (FULL): Mike Pence and Kamala Harris face off in SLC | USA TODAY,\" Oct. 7, 2020", "FactCheck.org, \"Misleading Ad Targets Biden on Fossil Fuels, Fracking,\" June 10, 2020", "CNN Politics on Twitter, Sept. 4, 2019", "EnergyNow.com, \"Biden Clarifies Fossil-Fuel Policy After Debate: Campaign Update,\" Aug. 1, 2019", "PolitiFact, \"Fact-checking the 2020 vice presidential debate, Kamala Harris vs. Mike Pence,\" Oct. 7, 2020", "PolitiFact, \"Fact-checking Trump’s claim that Biden would ‘immediately’ eliminate fracking and mining in Pa.,\" Sept. 25, 2020", "PolitiFact, \"No, Joe Biden doesn’t want to ban fracking and kill the Wisconsin jobs the industry supports,\" Aug. 17, 2020", "PolitiFact, \"Joe Biden called for limits on fracking, not a ban,\" June 19, 2020", "PolitiFact, \"In debate, Joe Biden said no more oil drilling and no new fracking, didn’t say shutdowns,\" March 15, 2020", "Email interview with George Upper, editor in chief at the Western Journal, Oct. 12, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]