["इन सुअरों द्वारा ये शिक्षा दी जाती है मदरसों में..फिर कहते हैं हिन्दू भाईचारा नही रखते Hinduism -0 and Islam -3(These pigs teach this in the madrasas .. Then they say Hindus don’t keep the brotherhood Hinduism -0 and Islam -3 -translated). This message was posted in a public group named WE SUPPORT NARENDRA MODI, which has more than 28 lakh members. It shows a madrasa teacher claiming Islam to be a superior religion to Hinduism.", "The image has been shared on many other public groups on Facebook like एक करोड़ हिंदुओं का ग्रुप (एड होते ही 150 हिंदुओ को एड करो) जय श्री राम with more than 500,000 members, I Am Proud Indian with over 11 lakh members and अगर आप राजपूत हैं तो Join कीजिये ये ग्रुप,देखते हैं FB पर कितने राजपूत है which has more than 18 lakh members. Moreover, it was widely shared on Facebook and Twitter with different text but the same context.", "A tweet by a user Pooja Goswami(@PoojaGoswami_01) has been retweeted and ‘liked’ more than 650 times at the time of writing. The tweet has now been deleted. The account is followed by more than 60000 followers. Controversial journalist Jagrati Shukla has also retweeted the tweet from Pooja Goswami(@PoojaGoswami_01).", "Alt News did a reverse image search and found that the image was from a report of April 10, 2018.", "This a photograph of a Madrasa named Darul Uloom Husseini in Gorakhpur, Uttar Pradesh. Many news organisations had reported the story and carried the photograph, out of which an article from Outlook reported, “This Madrasa has become a center for modern education, where along with Arabic and English, Sanskrit is also taught (translated from Hindi)”. It further states, “The specialty of this Madrasa is that Sanskrit is being taught by a Muslim teacher. Probably, this is the first time ever that Sanskrit is also being taught in Madrasa”.", "It has often been observed how false imagery is woven out of thin air and pushed relentlessly. All it takes is a minor tweaking of a photograph. Despite being called out multiple times for posting and sharing misinformation, some notorious pages, groups, and accounts continue to spew venom on social media.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A purported video of a Muslim man beating a temple priest with a bat is…", "A picture depicting the Pakistani flag apparently bigger in size and apparently placed higher than…", "Amid the ongoing war between Israel and Hamas, a video of a fleet of cars…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "A clip featuring Pakistan men’s Cricket team captain Babar Azam is viral on social media…"]