["A video of Maharastra’s Samajwadi Party (SP) leader Abu Azmi has gone viral on social media with the claim that his supporters chanted ‘Pakistan Zindabad’ at Mumbai’s Wadala station in the leader’s presence. Twitter handle @Saaho_ser posted the video with the message, “वडाला रेलवेस्टेशन पर SPनेता अबुआजमी के समर्थकों पर कथित पाकिस्तान ज़िंदाबाद के नारे लगाने का आरोप है (At Wadala station, supporters of SP leader Abu Azmi allegedly raised Pakistan Zindabad slogans -translated)”. The tweet had amassed over 3,100 retweets before it was taken down. Below is a tweet which shared the video with the same caption.", "आजादभारत मे वीर शिवाजी की धरती पर लगरहे पाकिस्तान जिंदाबाद के नारे? बालासाहब_ठाकरे जी हम शर्मिंदा हैं! सेकुलरिज्म और तुष्टिकरण सगे भाई हैं? वडाला रेलवेस्टेशन पर SPनेता अबुआजमी के समर्थकों पर कथित पाकिस्तान ज़िंदाबाद के नारे लगाने का आरोप है…. pic.twitter.com/UUlAs2k4pI", "— आदित्य अग्रवाल (@Adityaagrawal77) May 17, 2020", "The video was also shared by GSVKapoor who later took it down and several others on Twitter.", "On land of Chatrapati Shivaji Maharaj a very shameful act.", "On Wadala railway station in front of Namajwadi party leader Abu Azmi, Slogans of “Pakistan Zindabad” were raised.", "It’s same land were Bala Sahib didn’t allowed Pakistani players to come!!", "As a hindu I feel betrayed!! pic.twitter.com/FvSQyh5B9j", "— That Kashmiri Guy (@ThtKashmiriGuy) May 17, 2020", "Several Alt News application users have requested us to fact-check this viral video. Similar requests were also received on our official WhatsApp number (+917600011160).", "Alt News found that this was a TikTok video that was uploaded by Jabir Khan on May 15.", "In the original video posted below, one can clearly hear that a group of people are chanting – “Abu Asim Azmi Zindabad(3) Mumbai police Zindabad(3) Sajid Bhai Zindabad(2)” – and not Pakistan Zindabad as claimed on social media.", "@MumbaiPolice @CMOMaharashtra @DGPMaharashtra it can be clearly hear in the video guy is Shouting @MumbaiPolice zindabad & Sajid Bhai Zindabad but this Women is spreading hatred by her post in which she is saying tht the guy is Shouting Pakistan Zindabad. Arrest her @abuasimazmi pic.twitter.com/QrIqrpHya3", "— Moin Qureshi (@Al_Quraesh) May 17, 2020", "Furthermore, Alt News reached out to SP district president Sajid Siddiqui. He said, “This video was taken on May 14 at Chatrapati Shivaji station on Platform 18. The train was scheduled from CST to UP’s Banda city. We were working from 4-5 days to send these migrant workers back home. Initially, they were told that money will be collected for the tickets. Later Zone-4 DCP Saurabh Tripathi helped us and made sure that they boarded free of cost”. Siddiqui sent us a photograph of him walking along with Abu Azmi.", "He also sent us a video shot from a different angle where the same people can be heard raising the slogans.", "While tagging the office of Uddhav Thackeray and the Maharashtra cyber cell, Azmi called for strict action to be taken against those who put out the misinformation.", "@TwitterIndia @MahaCyber1 @OfficeofUT-महोदय-@CAPratikKarpe और @GSVKapoor इन दो महानुभावों को मेरे वीडियो में “पाकिस्तान ज़िंदाबाद” के नारे सुनाई दे रहे है। महामारी से लड़ने के बजाए इन्हे #FakeNews फैलाकर हिन्दू-मुस्लिम को आपस में लड़ाना है। इनके खिलाफ मैं कड़ी कार्रवाई की जाए। pic.twitter.com/uRguNVDBNq", "— Abu Asim Azmi (@abuasimazmi) May 17, 2020", "A video of SP leader Abu Azmi was therefore shared with the false narrative that his supporters were heard raising ‘Pakistan Zindabad’ slogans at Mumbai’s Wadala station.", "Donate Now", "Co-founder, Alt News Co-Founder Alt News, I can be reached via Twitter at https://twitter.com/zoo_bear", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]