["By Saranac Hale Spencer", "Posted on April 17, 2019", "An old meme from Ben Carson’s days as a Republican candidate for president is circulating again. But there’s still no evidence that he said, “My mother raised me with no help from the government.”", "In November 2015, Ben Carson briefly led the polls for candidates seeking the Republican nomination for president.", "Now that he’s the secretary of the Department of Housing and Urban Development, a meme from his days as a candidate is circulating again on Facebook. The meme claims that on Nov. 7, 2015, Carson said: “My mother raised me with no help from the government. We had food stamps and welfare and Section 8 housing, but we made it on our own.”", "Many of those posting it now are doing so in defense of Rep. Alexandria Ocasio-Cortez, adding the observation: “And conservatives want to laugh at AOC?”", "Carson wrote in his 1990 autobiography, Gifted Hands, that his family relied on government assistance, specifically food stamps, for a time when he was growing up. But there is no evidence in the public record that Carson said what the meme claims.", "Nov. 7, 2015, was a Saturday; Carson sent one tweet that day, but it was about donations to his campaign. The only extensive comments we found him making were in an interview taped that night for a segment that aired on NBC’s “Meet the Press” the next morning. In that interview, Carson answered questions about his claims of being a violent teen and being offered admission to West Point. He did not talk about food stamps and public housing, as the meme claims.", "Actually, an early version of the Carson meme included the web address of a now-defunct Facebook page that described its content as political “satire and parody.” That indicates the meme was never meant to be taken seriously in the first place.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on the social media network.", "Polls — 2016 Republican Presidential Nomination. RealClearPolitics.com. Accessed 16 Apr 2019.", "NBC’s “Meet the Press.” “Ben Carson Answers Questions on His Past.” NBCnews.com. 7 Nov 2015.", "NBC’s “Meet the Press.” Transcript. NBCnews.com. 8 Nov 2015.", "Carson, Ben (@RealBenCarson). “We the People have made 10,000 donations each day this week, raising $3.5M this week alone. Thank you biased media.” Twitter. 7 Nov 2015.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]