["About this rating", "In April 2019, a video supposedly showing a branded blimp from retailing giant Amazon releasing dozens of delivery drones took off on social media.", "One popular posting on Facebook was accompanied with the caption \"The future delivery is here,\" a Twitter user on Twitter was less enthused about the sight of an Amazon blimp:", "This right here is borderline dystopian pic.twitter.com/otXBLShtdd", "— ok g (@g_awd) March 31, 2019", "This is not a genuine video clip of an Amazon blimp releasing delivery drones, but rather a computer-generated clip created by a digital artist.  That arist wrote on Twitter (translated roughly via Google) that the Lockheed Martin P-791, an experimental hybrid airship, served as the inspiration for her design of the Amazon blimp. The artist also posted a few diagrams of her unfinished work:", "午後のネタバレ。信じてる人は皆無だろうけど一応。thetaVでHDRI作ってそのままライティングした。後ろに余計なものも入れてみたけどあまり気づかれてない模様。 pic.twitter.com/o4P8z5agz9", "— zozi(厳島神社の人） (@zozi009) April 1, 2019", "The artist, @zozi009, frequently publishes such videos on Twitter and has also shared a compilation of her work on Nicovideo.jp:", "While this video of an Amazon blimp may be a digital creation, the Seattle-based company has in fact been working on developing delivery drones, and Amazon CEO Jeff Bezos even once predicted that such delivery drones would be commonplace by 2018. The company has seen some success with their drone-delivery program, but they're apparently still a ways away from the futuristic scene depicted above:", "The hype over commercial drones is, so far, largely just that. One of the people who contributed to that hype was Jeff Bezos, the Amazon founder. In a “60 Minutes” interview in December 2013, he predicted that deliveries by drones could become commonplace within five years.", "The fifth anniversary of Mr. Bezos’s prediction has come and gone, but widespread deliveries by drone are not yet a reality, neither by Amazon nor by any other company.", "Rosen, Ellen.   \"Skies Aren’t Clogged with Drones Yet, But Don’t Rule Them Out.\"\r\n    The New York Times.   19 March 2019.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]