["By Robert Farley", "Posted on September 5, 2019", "In an address to veterans, Vice President Mike Pence said “VA hospitals were removing Bibles” and “banning Christmas carols” under the last administration, and “will not be religion-free zones” under this administration. But VA hospitals have never been “religion-free zones.” And there’s less to the isolated incidents than Pence’s claim suggests.", "Officials at some Veterans Affairs hospitals removed Bibles from public memorials for prisoners of war and those missing in action. But Bibles were, and still are, available to any veteran in a VA hospital who wants one.", "And there was one instance in 2013 of Christmas carolers from a Christian school in Augusta, Georgia, being told by officials at a VA medical center that they could only sing songs from a list of nonreligious carols. But that situation was resolved, and the carolers returned after missing a year.", "Pence’s comments come on the heels of the recent unveiling of new VA policies on religious and spiritual symbols that VA Secretary Robert Wilkie said are meant to “bring simplicity and clarity to our policies.” Pence referenced those policies during a speech on Aug. 28 at the American Legion National Convention in Indianapolis.", "Pence, Aug. 28: And as we meet the health care needs of our veterans, let me make you another promise: This administration will always make room for the spiritual needs of our heroes at the VA as well. You might’ve heard even today that there’s a lawsuit to remove a Bible that was carried in World War II from a Missing Man Table at a VA hospital in New Hampshire. There’s a lawsuit underway. It’s really no surprise because, under the last administration, VA hospitals were removing Bibles and even banning Christmas carols in an effort to be politically correct. But let me be clear: Under this administration, VA hospitals will not be religion-free zones. We will always respect the freedom of religion of every veteran of every faith. And my message to the New Hampshire VA hospital is: The Bible stays.", "Let’s start with Pence’s initial reference to a controversy that unfolded this year (under the Trump administration) at the Manchester VA Medical Center in New Hampshire, where a Bible was displayed atop a “Missing Man Table” — a common POW/MIA memorial at military and veterans’ facilities. It was temporarily removed from a foyer table at the VA center in January after a complaint from the Military Religious Freedom Foundation, which said it was acting at the request of 14 patients of various faiths. But the Bible returned in February, this time under a protective plexiglass covering.", "A VA spokesman told the AP in May that the Bible had initially been removed “out of an abundance of caution.” The spokesman said that after consulting with lawyers (and after receiving numerous complaints from veterans and others), the medical center determined its decision to remove the Bible was “incorrect,” and it returned the Bible to the display, calling it  “a secular tribute to America’s POW/MIA community.”", "However, the Bible in question was not “carried in World War II,” as Pence said. A reporter for the New Hampshire Union Leader interviewed the veteran who donated the Bible — a 100-year-old New Hampshire man who was once a POW in a German prison camp. The story noted, “He actually did not carry it during the war, but was given the Bible by a family member after he escaped captivity and returned home.”", "In May, Air Force veteran James Chamberlain filed a lawsuit claiming the Bible’s inclusion in the memorial display violated the U.S. Constitution’s guarantee of freedom of religion. Specifically, the suit said including the Bible violated the First Amendment‘s establishment clause, which, according to Cornell Law School’s Legal Information Institute, “not only forbids the government from establishing an official religion, but also prohibits government actions that unduly favor one religion over another. It also prohibits the government from unduly preferring religion over non-religion, or non-religion over religion.”", "The lawsuit, which describes Chamberlain as a “devout Christian,” seeks a permanent removal of the Bible from the display.", "“Despite his strong personal religious beliefs, he believes that the Christian Bible has no place being displayed on the POW/MIA table at the entrance way to the MVAMC, where he gets his care,” the lawsuit states. “As a Christian, he respects and loves all his military brothers and sisters and does not want to be exclusionary by the placement of the Christian Bible.”", "After referencing the New Hampshire controversy, Pence went on to say that “under the last administration, VA hospitals were removing Bibles … in an effort to be politically correct.”", "A spokesman for Pence pointed to an April 2016 article in the Washington Examiner about VA officials removing Bibles from POW/MIA memorial displays at several VA hospitals around the country, after complaints from the Military Religious Freedom Foundation. The VA’s actions drew the attention, and ire, of members of the Congressional Prayer Caucus, whose co-chairmen sent a letter to the VA secretary protesting the removal of the Bibles.", "So it’s accurate to say some Bibles had been removed from public displays at VA hospitals.", "On July 3, the VA issued a directive on religious symbols in VA facilities that stated, “Religious symbols may be included in a passive display, including a holiday display, in public areas of VA facilities [including in public entrances] if the display is of the type that follows in the longstanding tradition of monuments, symbols, and practices that simply recognize the important role that religion plays in the lives of many Americans. Such displays should respect and tolerate differing views and should not elevate one belief system over others.”", "That clarifies the VA’s position on displaying Bibles as part of POW/MIA memorials in public areas, though the matter may ultimately be up to the courts to decide.", "Based on background articles provided by Pence’s press office, the vice president’s comment that “under the last administration, VA hospitals were removing Bibles” was limited to the POW/MIA memorial displays. More broadly, Bibles are allowed in VA hospitals, for those who want them, and VA hospitals have never been “religion-free zones,” as Pence put it. We last wrote about this issue when, in 2013, Rep. Louie Gohmert wrongly complained that the Obama administration VA hospitals would not allow a friend to provide a Bible, or for a Bible to be on display.", "As we wrote then, there was no prohibition against having a Bible or a cross, providing one to a friend, or a service member talking to friends about their faith. (Though we have written before about the limits of evangelizing and proselytizing in the military.)", "Here’s what Lt. Cmdr. Nate Christensen, a Defense Department spokesman, told us at that time:", "Christensen, July 17, 2013: The Department of Defense places a high value on the rights of members of the Military Services to observe the tenets of their respective religions and respects (and supports by its policy) the rights of others to their own religious beliefs, including the right to hold no beliefs. The Department does not endorse any one religion or religious organization, and provides free access of religion for all members of the military services.", "Service members may exercise their rights under the 1st Amendment regarding the free exercise of religion unless doing so adversely affects good order, discipline, or some other aspect of the military mission; even then, the Department seeks a reasonable religious accommodation for the service member.  In general, service members may share their faith with other service members, but may not forcibly attempt to convert others of any faith or no faith to their own beliefs.", "According to the VA, the new policies on religious and spiritual symbols will:", "Though the new polices, and accompanying directives, clarify the VA’s position that “religious symbols may be included in a passive display … in public areas of VA facilities,” it is not clear how some of the other policies are different in practice than previous department policies. For example, the VA says the new policy will “[a]llow patients and their guests to request and be provided religious literature, symbols and sacred texts during visits to VA chapels and during their treatment at VA,” but there’s no indication that that hasn’t always been the VA practice.", "VA policy, both before and after the new policies, requires that VA chapels be maintained as “religiously neutral.” The Trump administration policies added language that said religious literature, such as Bibles, “must be made readily accessible to VA patients and visitors in a chapel at their request.” But both the old and new versions also say that the VA can buy or accept donations of religious items “for distribution to patients who request it, such as: religious literature, copies of the Scriptures, missals, mass leaflets, prayer books, yarmulkes (skull caps), taleysim (prayer shawls), wood to be burned for Native American traditional ceremonies, and other religious articles.” In short, it was the policy both before and after the recent changes that the VA may make religious literature, such as Bibles, available to veterans upon request.", "When we asked the VA press office how some of these new policies differ in practice from the old ones, a spokeswoman said only that she had provided “numerous examples” to back up Pence’s claim that “under the last administration, VA hospitals were removing Bibles and even banning Christmas carols.”", "Michael L. Weinstein, the founder and president of the Military Religious Freedom Foundation, scoffed at Pence’s claim that VA hospitals during the Obama administration were removing Bibles. “Bibles are plentiful” in VA facilities, Weinstein said.", "There is a “huge amount of evangelizing and proselytizing” that goes on in VA facilities, Weinstein said. And when his members deem those practices to have stepped over the line, he said, the organization often files complaints on behalf of those members to bring the VA into compliance with the law. Bibles were not removed from POW/MIA memorial displays as a result of a VA directive, he said, but rather in response to threats of legal action.", "As for the Christmas caroling dispute, Pence’s office referred us to three news articles — all of them about the same incident at a VA medical center in Augusta, Georgia.", "Here’s what happened: In 2013, students from a local Christian school who annually sang Christmas carols at the Charlie Norwood Veterans Affairs Medical Center were told the week before Christmas that they could only sing songs from an approved list that included nonreligious songs, such as “Jingle Bells,” “Rudolph the Red Nosed Reindeer” and “White Christmas” — songs the hospital’s Pastoral Service “deemed appropriate for celebration within the hearing range of all veterans,” the Augusta Chronicle reported.", "At the time, the VA cited a 2008 VA policy (pre-Obama administration) that stated that the VA “may restrict or prohibit any practice that it deems detrimental to the health or safety of patients. The choice to receive spiritual or pastoral care, the choice to complete a spiritual assessment, and the choice to participate in a religious or spiritually-based treatment program always remains the private choice of the veteran.”", "That decision was challenged by the Alliance Defending Freedom.", "“After receiving a letter from ADF and meeting with the leadership from the school, the VA Medical Center reversed course and publicly announced that it would welcome back the Christmas carolers,” ADF’s senior counsel, Matt Sharp, told FactCheck.org via email.", "“We welcome holiday music within our medical centers, and our Veterans and their families welcome the spirit and consideration of those who donate their time,” the VA said in a released statement at the time. “For carolers singing religious songs, we are happy to provide more private areas for groups to sing for Veterans who choose to participate.”", "We could not confirm with the VA hospital or the Christian school whether the carolers returned to perform in a private room. Sharp said he did not have any details about where the carolers sang the following year. But he said they were invited back by the VA medical center the following Christmas, and there were no restrictions on what songs they could sing.", "In a March 2014 story on a pending deal to bring back the carolers, the Augusta Chronicle said then-Rep. Jeff Miller, who chaired the House Committee on Veterans Affairs, wrote to then-VA Secretary Eric Shinseki criticizing the caroling controversy and several other incidents in which Christmas gift bags and letters were turned away at other VA facilities. Shinseki sent Miller a letter that said the VA has no policy prohibiting VA hospitals from accepting such gifts.", "Shinseki did not directly address the caroling incident, but wrote, “Out of respect for the diverse religious beliefs of our veterans, organizations are asked to work with local facility staff to ensure materials of a religious nature are available for those veterans who would like to participate.”", "A spokesman for the Augusta VA chalked the controversy up to a misunderstanding, telling the Augusta Chronicle at the time, “It won’t happen again.”", "The VA issued an eight-page memo on Nov. 7, 2014, that speaks directly to the Christmas caroling issue. In an FAQ, the memo made clear that singing religious songs is permitted at VA facilities under certain conditions. The head of the facility must approve requests to sing and can select the location, but not the songs. The policy said: “Once the director authorizes holiday singing in a designated location, VA must remain neutral regarding the views expressed by the group or individual generally or in its holiday songs (e.g., religious or secular). Directors are encouraged to seek advice from VA Chaplain Service in making these decisions.”", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]