["President Donald Trump speaks in Monaca, Pa., on Aug. 13, 2019, during a visit to Shell's soon-to-be completed Pennsylvania Petrochemicals Complex. (AP)", "President Donald Trump kept up his criticism of New York during a recent speech in Pennsylvania about energy and manufacturing.", "\"From 2010 to 2017, natural gas production plummeted by nearly 70 percent in New York, but it soared almost 1,000 percent in Pennsylvania,\" Trump said at the Shell Pennsylvania Petrochemicals Complex. \"And New York won't allow us to build a pipeline across because New York is sort of a long state and we can't have pipelines going across, helping a region that's not a wealthy region at all.\"", "Trump has criticized New York and its elected leadership many times in the past, and we wondered if his latest claim about natural gas production in New York and Pennsylvania was accurate.", "We turned to the U.S. Energy Information Administration, part of the U.S. Department of Energy, for statistics about natural gas production in New York and Pennsylvania. The administration collects, analyzes and publishes \"independent and impartial energy information,\" according to its website.", "In New York, natural gas production totaled 35.8 billion cubic feet in 2010 and 11.4 billion cubic feet in 2017. That’s a 68 percent decrease.", "In Pennsylvania, production in 2010 totaled 572.9 billion cubic feet. By 2017, production totaled 5.5 trillion cubic feet, according to the administration. That’s an increase of 854 percent, when unrounded numbers are used.", "In addition to researching the federal energy data repository, we researched natural gas production data in each state, and found similar results.", "The New York State Department of Environmental Conservation provided similar statistics for 2010 and 2017, and it calculated that production fell by 66 percent.", "In Pennsylvania, the dramatic increase in natural gas production can be attributed to \"unconventional\" wells, or wells that are drilled deep into shale formations through a process known as hydraulic fracturing, or fracking. Natural gas drilling in the Marcellus Shale region in Pennsylvania began in 2004, according to the state. The Marcellus Shale, which generally lies under parts of Pennsylvania, New York, Ohio, and West Virginia, is currently the \"most prolific natural gas area in the United States,\" according to the U.S. Energy Information Administration.", "In 2017, Pennsylvania recorded 5.36 trillion cubic feet of natural gas was produced from unconventional wells, which at the time was the largest natural gas production figure on record, according to the state’s Department of Environmental Protection.", "Natural gas production from these unconventional wells grew by 1,360 percent between 2010 and 2017, according to  Elizabeth Rementer, the Department of Environmental Protection press secretary. Rementer also confirmed that the calculation of an increase in 854 percent of total natural gas production between 2010 and 2017, taken from federally collected data, is accurate.", "The dramatically different trends in natural gas production in each state can be tied to their different response to hydraulic fracturing. While Pennsylvania has seen significant growth in this kind of production, making it the second-largest producer in the country, behind Texas, New York, citing health risks associated with the practice, banned this kind of natural gas extraction in 2014.", "While New York has \"one of the most energy-efficient economies in the nation,\" it relies on other states, including Pennsylvania, and Canada, for most of its natural gas needs, according to the U.S. Energy Information Administration.", "Trump also referenced a pipeline across New York state. He could have been referring to a decision New York regulators made in May to deny a new natural gas pipeline, citing concerns about water quality. The pipeline would have connected natural gas fields in Pennsylvania with New Jersey and New York. Press officers at the White House did not respond to our request for information.", "President Trump said between 2010 and 2017, natural gas production in New York fell by nearly 70 percent, while production in Pennsylvania grew by nearly 1,000 percent.", "In Pennsylvania, total natural gas production grew by 854 percent between 2010 and 2017.", "In New York, total natural gas production fell by between 66 and 68 percent.", "Trump’s statement was mostly accurate, but there’s enough difference between 854 percent and nearly 1,000 percent to warrant a Mostly True ruling.", "C-SPAN video, \"President Trump Remarks on U.S. Energy and Manufacturing,\" 56 minute mark, Aug. 13, 2019. Accessed Aug. 14, 2019.", "White House, Remarks by President Trump on American Energy and Manufacturing, Monaca, Pa., Aug. 13, 2019. Accessed Aug. 15, 2019.", "Democrat and Chronicle, \"President Trump accuses New York’s Democratic leaders of leading ‘Witch Hunt,’\" July 1, 2019. Accessed Aug. 15, 2019.", "U.S. Energy Information Administration website, Mission and Overview, Accessed Aug. 15, 2019.", "U.S. Energy Information Administration, table, Primary Energy Production Estimates in Physical Units, New York, 1960-2017. Accessed Aug. 15, 2019.", "U.S. Energy Information Administration, table, Primary Energy Production Estimates in Physical Units, Pennsylvania, 1960-2017. Accessed Aug. 15, 2019.", "Email correspondence, New York State Department of Conservation press office, Aug. 15, 2019.", "Email correspondence, Elizabeth Rementer, press secretary, Pennsylvania Department of Environmental Protection, Aug. 15, 2019.", "Pennsylvania Department of Environmental Protection, 2017 Oil and Gas Annual Report, Accessed Aug. 15, 2019.", "New York Times, \"New York Rejects Keystone-Like Pipeline in Fierce Battle Over the State’s Energy Future,\" May 15, 2019. Accessed Aug. 16, 2019.", "New York Times, \"Citing health risks, Cuomo bans fracking in New York State,\" Dec. 17, 2014.  Accessed Aug. 16, 2019.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]