["About this rating", "In April 2018, an outrage-instigating meme circulated on Facebook reporting that Jim Lowe, a retired Marine Corps captain, had been forbidden from flying both the American flag and the Marine Corps colors outside his home. The meme instructs users to \"like\" and \"share\" if they agree he should be allowed to do so:", "According to local news reports, the dispute over the flags stemmed from Lowe flying both the Stars and Stripes and the Marine Corps colors from the exterior of his home despite a community rule that allowed only one flag. But Lowe had maintained that because Marines refer to their banner as \"colors,\" it shouldn't count as a flag. The homeowners association had threatened to fine Lowe or even place a lien on his house if he didn't comply.", "The situation escalated to the point where Lowe threatened to move out of the community, but he never made good on it. According to the local newspaper, The Citizen, Lowe passed away in his Sun City-Peachtree home on 12 September 2016 — but not before the combat veteran was able to \"give 'em hell.\" Local news station WTXF reported that in October 2013, Lowe won the battle to fly both the American flag and Marine Corps colors outside his home.", "Fox News. \"Georgia Marine Vet Loses Fight to Fly American, Marine Corps Flags.\"\r\n  27 August 2013.", "Wing, Nick. \"Georgia Veteran Plans to Leave Retirement Community After Being Told He Can’t Fly Two Flags.\"\r\n  HuffingtonPost.com. 27 August 2013.", "The Citizen. \"James Madison Lowe II, Age 76.\"\r\n  16 September 2016.", "Dillon, Denise. \"Veteran Wins Battle to Fly U.S., USMC Flags Outside Home.\"\r\n  WAGA. 30 September 2013.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]