["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "It’s the most wonderful time of the year — to spread misinformation.", "The holiday season brings out a lot of good, but it is also a prime time to resurface old rumors, embellishments and hoaxes.", "One example is a claim about the Obama administration’s war on a White House nativity scene.", "Social media posts (like this one) claim the Obamas removed the nativity scene, but it’s \"back in the White House thanks to First Lady Melania Trump.\"", "The story was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The posts are not true: The holy family display has been showcased in the East Room — without interruption — since it was donated to the White House in the 1960s.", "Here’s how we know.", "The 47 figures of the nativity scene, known as the White House crèche, are made of carved wood and terra cotta and were created in Naples, Italy, in the late 18th century, according to White House archives. The crèche was donated to the White House by philanthropist Jane Engelhard in 1967, and it has been displayed every Christmas since then.", "In 1978, Engelhard donated 10 additional figures and funds for a new tableau, which was first displayed in 1999.", "The rumor of the Obamas \"banning\" the famous nativity scene is seemingly brought back to life every Christmas season, despite being continuously debunked.", "The rumor is said to have started back in 2009, during Obama’s first year in office.", "The New York Times reported that the Obama administration was considering a \"non-religious\" Christmas at the White House, which included a thought of whether to display the crèche.", "In the end, tradition won out, and the crèche was placed in its usual spot.", "In 2015, an Obama White House press release also touted the crèche as a \"long-standing holiday tradition.\"", "\"Donated to the White House in the 1960s, this piece has sat in the East Room for the holidays for more than 45 years, spanning nine administrations,\" the announcement says.", "In 2016, photo evidence of the nativity scene display was captured by HGTV during a White House Christmas tour. You can see the online gallery of the tour here.", "Finally, a Trump administration news release about this year’s decorations also noted the streak of the famous scene’s presence in the White House, saying \"for the 51st year, the White House crèche will also be on display.\"", "Social media posts say the Obamas banned the display of the White House’s famous nativity scene throughout the years and credit First Lady Melania Trump for bringing it back.", "This is a long-standing hoax that tends to resurface during the holidays. There was no break for the White House nativity.", "The Obamas continued the tradition of showcasing the nativity scene in the East Room, according to previous news releases, archives, fact-checks and photo evidence. A Trump administration release also notes that the scene has been on display for over 50 years, since it was donated in 1967.", "We rate this claim Pants on Fire.", "Facebook post, Nov. 23, 2018", "Snopes, \"Did the Obama White House Ban Nativity Scenes?\" December 2016", "People Magazine, \"Melania Trump Unveils White House Christmas Decor, Reigniting Lies About Obama and Nativity Scene,\" November 2017", "FactCheck.org, \"Holiday Hoax About Obamas Resurfaces,\" Nov. 28, 2018", "The Hill, \"Trump’s first White House Christmas includes annual Nativity scene,\" November 2017", "HGTV, \"White House Christmas Tour 2016 (Gallery),\" Accessed Dec. 4, 2018", "Whitehouse.gov, \"First Lady Melania Trump Unveils Christmas at the White House 2018\" Nov. 26, 2018", "Whitehouse archives, \"2015 White House Holidays – A Timeless Tradition,\" Accessed Dec. 4, 2018", "Whitehouse archives, \"East Room at Christmas White House Archives,\" Accessed Dec. 4, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]