["The video was published here by a New Zealand-based Facebook user on July 18, 2020. The clip has been viewed more than 22,000 times.", "Text superimposed over the bottom of the video reads: “Snowhaven Accommodation Ohakune, New Zealand”.", "The Facebook post’s caption states: “Here it is guys armed military in towns training up to control towns near you,", "“Getting conflicting messages but have spoken to someone in the army he has said this is “fairly new this kind of training and that things have definitely changed. But then people claiming this is common??", "“Either way martial law is here and ready to be enforced with lockdown kind of a reality check to how things may look in the near future.”", "One Facebook user commented on the video claiming it shows “martial law”, while another said: “this has been happening for years and years”.", "Ohakune is a small town on New Zealand’s North Island, close to the active volcano Mount Ruapehu.", "New Zealand ended its coronavirus lockdown in late April, with Prime Minister Jacinda Ardern announcing some social distancing restrictions would remain, as AFP reported here.", "The same video was also viewed more than 15,000 times after it was published here on Facebook with a similar claim.", "It was also published here on Twitter, alongside a similar claim.", "The same video was shared again here with a claim which drew comparison with the current lockdown in the Australian state of Victoria.", "It was also shared here on Facebook with a claim that it shows soldiers who “want to come into our home and vaccine us”.", "The Facebook posts, however, are misleading.", "The video was filmed in Ohakune, as seen here on Google Street View.", "The New Zealand Defense Force (NZDF) military base at Waiouru is situated some 27km (16.7miles) from Ohakune.", "An NZDF spokesperson told AFP in a July 21 email that the video shows military personnel taking part in a yearly training exercise for overseas deployments.", "“The video shows participants in Exercise Santici, a training exercise for New Zealand Army Officer Cadets based at Waiouru [military base],” the NZDF spokesperson said.", "“It is carried out every year in and around Ohakune. The purpose is to train Officer Cadets in security and stability operations that they may have to use in overseas deployments.", "“Most Ohakune locals are used to seeing the exercise being carried out.”", "A spokesperson from the Ruapehu District Council, which presides over Ohakune, said military training exercises are run by the NZDF in the town.", "“The NZDF has a major training base in near-by Waiouru and uses Ohakune and other townships in the surrounding Waimarino area for training exercises from time-to-time,” the spokesperson said.", "The Ohakune community paper, Ruapehu Bulletin, covered the military exercises in the July 22, 2020 edition here.", "Another story here from the September 11, 2018 edition of the Ruapehu Bulletin reported on that year's Santici military exercises which also took place in and around Ohakune.", "Photos from the 2018 exercises were posted on the New Zealand Army's Facebook page here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]