["The image -- which shows a man lighting fireworks and a screenshot of a Hindi-language tweet -- was published in this Facebook post on November 3, 2019. It has been shared more than 750 times.", "The post's Hindi-language caption translates to English as: “This is Manoj Tiwari, Member of Parliament from North-East Delhi. He is busy playing with firecrackers and he absolutely doesn't pity on the current situation in Delhi. Ashamed to say that the Delhi has elected such a parliamentarian.”", "Manoj Tiwari is a former singer who was elected parliament for India’s ruling Bharatiya Janata Party (BJP) to represent the constituency of North East Delhi in the capital.", "New Delhi has been suffering from heightened levels of air pollution in the aftermath of the Hindu festival of Diwali. The smog crisis has been partly blamed on the widespread use of fireworks in Diwali celebrations. AFP reported on the pollution issue here.", "Below is a screenshot of the misleading Facebook post:", "The November 1, 2019 tweet at the bottom of the image makes reference to the pollution crisis. It translates to English as: “My eyes are burning in Delhi today, what about yours??”", "The same image was published here, here, here and here on Facebook as well as here and here on Twitter alongside the same claim.", "The claim is false; the photo has circulated in media reports since at least 2014. It shows the politician lighting fireworks to celebrate the Delhi government’s decision to establish a public holiday for a", "A Google search found the same photo published here alongside an October 29, 2014 report on the website for Indian media outlet The Pioneer.", "Below is a screenshot of the report:", "The headline states: “Chhath Puja now a public holiday!”", "Chhath Puja refers to a Hindu festival mostly celebrated across eastern state of Bihar and northern state of Uttar Pradesh in India.", "The same photo was also published here on Indian news website Outlook India, as seen in the screenshot below:", "The photo caption credits the image of Press Trust of India photographer Manvender Vashist.", "The caption states: \"BJP MP Manoj Tiwari burns crackers as he celebrates with Purvanchalis after declaration of Chhath puja as a public holiday in Delhi.\"", "Contemporary news reports show Tiwari expressing his happiness over the declaration of Chhath Puja as a public holiday in New Delhi here and here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]