["About this rating", "Dozens of eBay bidders placed bids of over $1,000 on at least four listings for empty PS5 boxes.", "We confirmed with eBay that transactions were never completed for the four listings.", "New PlayStation, Xbox, and Nintendo gaming systems have traditionally been hard to find on launch days. High demand and low inventory has meant that the value of the video game consoles skyrocket. When PlayStation 5 (PS5) released in November 2020, it may not have been a shock to learn of bidding wars on eBay as gamers desperately tried to get their hands on the new technology. However, some people might be surprised to learn that eBay sellers were also listing empty PS5 boxes that were receiving bids for hundreds and even thousands of dollars.", "Empty boxes for brand new video game consoles have a long history of being sold on eBay for various reasons, such as for a joke. The eBay listings often explicitly state \"box only\" or \"empty box\" in the item name. However, some bidders miss this important text. For example, Kotaku reported that in 2013 eBay buyers bid thousands of dollars for an empty PlayStation 4 box, despite the fact that the item name read: \"Empty Sony PlayStation 4 PS4 Aus Pal Packaging/Box.\" The listing was eventually removed before the auction ended.", "Fast forward to November 2020. TikTok user @wowitsbobby posted that a listing for an empty PlayStation 5 box was selling for $2,025.", "It's true that the video showed a real eBay listing for an empty PS5 box with buyers who were bidding thousands of dollars. The listing's title read: \"Sony Playstation 5 PS5 Disc Version **** BOX ONLY NO CONSOLE **** SENDING ASAP.\"", "The winning bidder later had regrets and posted \"SCAM!\" in a negative review for the eBay seller. The seller, eBay user avraa101, responded: \"Item description clearly stated what buyer would receive. Not a scam.\"", "However, we confirmed with eBay that the seller for this listing was never paid after the winning bidder discovered it was for an empty PS5 box.", "Other empty PS5 boxes went for $1,200, $1,275, and $1,300. Once again, eBay confirmed that no payments were ever made by the winning bidders for these three listings.", "The seller with the $1,300 sale posted another listing that included a real PS5 and components and said the empty box listing was a joke: \"So if you seen my earlier listing it was a joke to see that people don't read! $1300 for a bunch of empty boxes. Luckily I'm not a POS and canceled the fake Listing.\"", "After contacting eBay about listings for empty PlayStation 5 boxes, we received this statement:", "We have been taking action to remove fraudulent listings from our marketplace. For any purchase, but especially highly-priced or in-demand items, we recommend that buyers exercise caution and thoroughly read the listing description. Buyers who receive an item which is not as described are entitled to a refund via our eBay Money Back Guarantee, provided the transaction is completed on the eBay marketplace. eBay is committed to providing a safe, secure online shopping experience to millions of people globally; our protections include state-of-the-art detection tools to monitor listings on the site and robust systems to screen and verify new members.", "A company spokesperson confirmed that making listings for photos of items and empty boxes do not comply with its No Items Listing Policy. They also told us that eBay doesn't allow sellers to misrepresent what they're listing for sale on eBay.", "In the past, the empty PS5 boxes on eBay became a topic of discussion on Reddit. One person said: \"Anyone know where I can actually buy the box? I'm pranking someone.\" Another person mentioned that \"panicked\" parents and grandparents might be the bidders: \"Chances are some panicked parent or grandparent that's trying to get a kid what they want for Christmas is going to buy it. Probably not knowing much about computers or what they are doing just trying to make a kid happy. To me, there's no excuse for this crap, legal or not.\"", "While some eBay listings for empty PS5 boxes have received bids for hundreds or thousands of dollars, we also have found quite a few listings that ended under $50. There are a number of reasons that bidders might purchase empty boxes for a lower price. It might be for a prank. Influencers might want to pretend they own a PS5 for brownie points on social media. Others might simply just want to display the box in their home until they are able to find and buy a PS5 for themselves.", "Jordan Liles is a Senior Reporter who has been with Snopes since 2016.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]