["Several news channels including Zee News, ABP Ganga and News18 UP have telecasted news about TIME magazine appreciating Yogi Adityanath government’s handling of the COVID-19 crisis. It was a similar spectacle on most channels with screens displaying content from the magazine, anchors commending the Uttar Pradesh Chief Minister and on-screen text heaping lavish praises on him. The ‘news’ was also reported in print by Patrika.", "This slideshow requires JavaScript.", "‘Duniya ne bhi mana Yogi ka karnama’ (The world also acknowledges Yogi’s feat), read the text on Zee News. The channel also tweeted stating, “कोरोना काल में यूपी सरकार के काम बजा डंका, CM योगी को TimeMagazine ने सराहा”. (During Corona times, the work of UP government widely recognized, TIME magazine praises.)", "कोरोना काल में यूपी सरकार के काम बजा डंका, CM योगी को #TimeMagazine ने सराहा@myogioffice @CMOfficeUP #UttarPradesh @UPGovt @nhm_up @shalabhmani @MrityunjayUP @Dr_raheessingh https://t.co/VDeUzNb0eb", "— Zee Uttar Pradesh Uttarakhand (@ZEEUPUK) January 6, 2021", "Right-wing propaganda website OpIndia published a Hindi report captioned as, “जिस ‘TIME’ मैगजीन ने कहा था कट्टर, वही हुआ CM योगी का मुरीद” (TIME magazine which referred to him as a radical is now in awe of CM Yogi.)", "“Hang in there, better times are ahead” — the article in TIME magazine about Uttar Pradesh government’s COVID management was first shared by Chief Minister Adityanath’s Office on December 15, 2020. Praising Adityanath for his “deft handling”, his office urged readers to read the “full report in TIME”.", "“Hang In There, Better Times are Ahead”@UPGovt Innovate Covid Management Model.", "UP CM Shri @myogiadityanath Ji’s deft handling of the COVID-19 situation is an extraordinary example of health administration under most trying circumstances.", "Read full report in @TIME … pic.twitter.com/0PKV8V1VBe", "— Yogi Adityanath Office (@myogioffice) December 15, 2020", "The post didn’t get much traction at that time but two weeks later, the content made its way to mainstream media via social media where it was shared by Ashish Chahan, the CEO of BSE and BJP supporter, Rishi Bagree.", "Congratulations Shri @myogiadityanath ji for setting an example for the world on how to fight COVID. The UP Model getting applauded and recognized by TIME magazine speaks a lot about the efficient governance. @navneetsehgal3 pic.twitter.com/ZIBt4eFrnl", "— Ashish Chauhan (@ashishchauhan) January 4, 2021", "— Rishi Bagree 🇮🇳 (@rishibagree) January 3, 2021", "It was also shared by Swatantra Dev Singh, the president of the Bharatiya Janata Party in Uttar Pradesh", "“Being positive in a negative situation is not naive, it is leadership. No other leader exemplifies this than the UP CM Shri @myogiadityanath Ji”", "Time magazine has published an article on UP’s covid management model.", "A matter of great pride for Uttar Pradesh. pic.twitter.com/tsunTNmdVR", "— Swatantra Dev Singh (@swatantrabjp) January 6, 2021", "On closer look, it turns out that the three-page article is an advertorial by Uttar Pradesh government. The article carries the text “content from Uttar Pradesh” on top. Advertorials are paid advertisements written in the style of an editorial. Moreover, unlike reports, the piece does not have an author byline.", "The fact that it is an advertorial explains why the article cannot be found on Time magazine’s website and there is no online link for it. A Twitter user who got printed copy of the magazine pointed out that it is not available in the international and American editions.", "Newslaundry has traced the content to a media release by the UP government that was sent to journalists in early December. It is noteworthy that the tweet by CM Yogi Adityanath’s Office posted on December 15 did not make an attempt to clarify that the TIME piece is not an article but an advertorial provided by the UP government.", "The channels that ran the news seem oblivious of the fact that TIME magazine has been critical of CM Adityanath. Ironically, Zee News has forgotten that a few months ago it did a ‘Taal Thok Ke’ program on TIME Magazine’s ‘Anti India Campaign’. In an article by TIME on India’s preparedness to handle COVID, CM Adityanath featured in the government-sponsored misinformation subsection. The article said that “elected officials from Prime Minister Narendra Modi’s Bharatiya Janata Party have promoted unproven therapies” and went on to state, “Chief Minister of Uttar Pradesh Yogi Adityanath suggested that COVID-19 and other diseases could be overcome with the help of Yoga”.", "News18 which presented UP government’s ad as a ‘report’ in both print and broadcast, transformed its Hindi story into a fact-check after the organisation was called out for publishing false news.", "Sponsored content of this nature can be deceptive and difficult for readers to distinguish from real content. It is understandable that social media users may fail to make the distinction between a report and sponsored content but it is unforgivable to see mainstream media carry an advertorial as ‘news’.", "Donate Now", "Nobody's cheerleader, I tweet at @samjawed65", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]