["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Two Texas Republicans have invoked God's ways in dramatic fashion recently. State Rep. Leo Berman of Tyler called Democratic President Barack Obama \"God's punishment on us\" April 24. And this week, Gov. Rick Perry suggested the April 20 British Petroleum oil rig explosion on the Gulf Coast could have been an \"act of God.\"", "Perry, speaking Monday at a governors conference about job creation sponsored by the U.S. Chamber of Commerce in Washington, warned that banning offshore drilling could hurt the economy. \"From time to time, there are going to be things that occur that are acts of God that cannot be prevented,\" he said.", "Critics howled that Perry was dismissing the situation's seriousness. A day later, Perry defended the comment. He told reporters: \"Here's what I said, and I think it's an interpretation issue with one reporter, is what I think. If you will go look up the definition of 'act of God,' we've used it in legal terms for a long time in this state and the — nobody knows what happened, and I said that in my remarks, that there were, you know, a lot of speculation. It could have been an act of God, it could have been, you know, who knows?\"", "Texas law works in mysterious ways?", "Barron's Law Dictionary defines \"Act of God\" as the \"manifestation of the forces of nature which are unpredictable and difficult to anticipate; 'the result of the direct and immediate and exclusive forces of nature, uncontrolled or uninfluenced by the power of man and without human intervention, [which] is of such character that it could not have been prevented or avoided by foresight or prudence.' Examples are tempests, lightning, earthquakes and a sudden illness or death of a person.\"", "The legalese dates back to Roman law, and judges have since continued to rule that an act of God doesn't depend on divine influence. In 1609, a British court ruled that a fire caused by lightning was an act of God. In 1785, a court ruled a fire not caused by lightning wasn't, according to a 1996 article in the American Journal of Public Health.", "Steve Bickerstaff, an adjunct law professor at the University of Texas at Austin, said that when someone who has previously expressed a strong religious affiliation — like Perry — calls an oil rig explosion an act of God, it sounds like that person is suggesting the disaster is celestial retribution. Bickerstaff said: \"My first reaction was, 'Oh, no — we're back to God taking revenge on us. But, actually, the term act of God has very prominent historical significance, very commonly used in contracts.\"", "Bickerstaff concurred that the term has had historic uses in Texas and the United States, and it's in most contracts, particularly between big businesses.", "Take a house knocked down by an earthquake. Did someone cause that? \"Well, if they didn't build the house adequately according to code and requirements, then yes,\" Bickerstaff said. \"But the earthquake itself is an act in which they have no control.\"", "And the oil rig explosion? No way to know yet, Bickerstaff said. \"Was the company negligent? Was it BP, or the company operating the rig? I don't know. Was the system flawed in some way? We don't know.\"", "We're not endeavoring to judge, so to speak, whether the rig explosion was an \"act of God.\" That said, we quickly found several state laws that use the phrase.", "It's illegal for a railway company to obstruct a street, railroad crossing or public highway for more than five minutes, but \"it's a defense to the prosecution under this section that the train obstructs the street, railroad crossing or public highway because of an act of God or breakdown of the train,\" according to a transportation law that took effect in 1995.", "An insurance carrier isn't liable to pay for an employee's injury if, among other exceptions, the injury \"arose out of an act of God, unless the employment exposes the employee to a greater risk of injury from an act of God than ordinarily applies to the general public,\" according to a 1993 law about workers' compensation.", "An agriculture-related law that took effect in 2003 protects people who violate rules about artificially controlling the weather if they can prove the violation \"was caused solely by an act of God, war, strike, riot or other catastrophe.\" A law enacted in 1997 similarly protects people who violate certain state water laws.", "Summing up: We're not judging whether the BP explosion was an \"act of God.\" That said, Perry's follow-up statement reflects the term's prevalence in law. We rate that statement as True.", "C-SPAN, U.S. Chamber of Commerce: Governors Summit on Economy and Jobs, May 3, 201", "Politico, Rick Perry: Oil spill may be an 'act of God,' May 3, 201", "Tyler Morning Telegraph, TV personality Glenn Beck makes stop in Tyler, April 25, 201", "Austin American-Statesman, Perry's critics pounce on 'act of God,' May 5, 2010", "Dallas Morning News, Gov. Perry, annoyed, defends 'act of God,' comment, May 4, 2010", "Barron's Law Dictionary, Steven H. Gifis, 1996", "American Journal of Public Health, Accidents and Acts of God: A history of the terms, by Herman Loimer, Mag Driur and Michael Guarnieri, PhD, MPH, January 1996", "Texas Transportation Code, Title 6. Roadways, Sec. 471.007 Obstructing railroad crossings; offense, accessed May 5, 2010", "Texas Labor Code, Title 5. Workers' Compensation, subchapter b. Coverage Requirements, Sec. 406.032 Exceptions, accessed May 5, 2010", "Texas Agriculture Code, Title 9. Weather and climate, chapter 301, Weather modification and control, Sec. 301.202 Act of God, accessed May 5, 2010", "Texas Water Code, chapter 7. Enforcement, Sec. 7.251, accessed May 5, 2010", "Interview with Steve Bickerstaff, adjunct law professor at the University of Texas at Austin, May 5, 2010", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]