["Columnist Harbir Singh quote-tweeted a tweet which shared a photograph of a turbaned woman holding an automatic weapon. The original tweet claimed that the image showed US Congresswoman Ilhan Omar at an Al-Qaeda training camp in Somalia. Singh also claimed that the woman was Omar but at a camp of a Somali warlord, not Al-Qaeda (archive).", "Likely This is @IlhanMN at the camp of a Somali warlord, not Al Qaida. But still, funny how she played with child-killer, AK-47 toting gangs in Somalia then joined anti-gun liberals in America.", "Sad what fools decent white people have been made by jihadis from Somalia & Pakistan. https://t.co/ls1q8hruya", "— Harbir Singh (@HarbirSingh_) October 24, 2019", "Singh is the husband of journalist Aarti Tikoo Singh who recently spoke at the US House Foreign Affairs Committee hearing on “Human Rights in South Asia” in Washington, of which Congresswoman Omar was also a part. Tikoo and Omar took opposing stands on the journalist’s reportage of alleged human rights violations in Kashmir. Since the testimony, their exchange has become a heated topic of discussion.", "Singh’s tweet was retweeted by Pakistani-Canadian author Tarek Fatah.", "This same image was earlier shared by supporters of US President Donald Trump.", "Ilhan Omar, circa 1993. She needs to go. pic.twitter.com/zWHKaJpojr", "— Justinfo (@justinfo202) August 1, 2019", "In fact, the image was also shared by Republican state senator, Oley Larson, who later took it down.", "This photograph does not show Omar but a woman recruit of the Somali Army at a military training campus at Halane, Mogadishu. The image is available in the archives of Associated Press, according to which it was shot on February 25, 1978. Omar wasn’t born until four years later in 1982.", "The Congresswoman had also tweeted about the misinformation on October 22, 2019, after the image was shared by Larson.", "This is pure propaganda designed to stir up hate and violence coming from a GOP state rep.", "Facebook’s unwillingness to crack down on hate speech and misinformation is not just threatening my life, but our democracy. https://t.co/InzMY5gvKw", "— Ilhan Omar (@IlhanMN) October 21, 2019", "An image of a woman recruit of the Somali army holding an automatic weapon was shared by Harbir Singh as US Congresswoman Ilhan Omar at a training camp of a Somali warlord. Omar is the first Somali-American elected to the US Congress. She was targetted using this photograph as the woman recruit in the picture is wearing a traditional Somali turban akin to the ones often adorned by Omar.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]