["About this rating", "In November 2016, a clip from an episode of the 1950s western television series Trackdown was published to YouTube, along with the claim that it \"predicted Donald Trump\" by featuring a snake oil salesman character named \"Trump\" who claimed that only he could prevent the end of the world ... by building a wall around the town:", "The television series Trackdown really did produce an episode featuring a \"Trump\" character who came to town claiming that only he could prevent the end of the world by building a wall (and also sold special force propelling umbrellas to deflect meteorites). The episode (S1, E30) aired on CBS in 1958 and was titled \"The End of the World,\" featuring actor Lawrence Dobkin playing the role of \"Walter Trump.\" A synopsis of the episode from the Classic TV Archive reads as follows:", "Walter Trump, a confidence man, puts on a long robe and holds a tent meeting in the town of Talpa. He tells the townspeople that a cosmic explosion will rain fire on the town and that he is the only one that can save them from death. Ranger Hoby Gilman attempts to prove Trump is a fraud.", "While Dobkin appeared in at least three other episodes of Trackdown, this was the only occasion in which he portrayed the Walter Trump character", "A relevant portion of dialog from this episode has been transcribed below:", "Narrator: The people were ready to believe. Like sheep they ran to the slaughterhouse. And waiting for them was the high priest of fraud.", "Trump: I am the only one. Trust me. I can build a wall around your homes that nothing will penetrate.", "Townperson: What do we do? How can we save ourselves?", "Trump: You ask how do you build that wall. You ask, and I'm here to tell you.", "A representative for MeTV, a Chicago network that airs reruns of Trackdown, confirmed that the episode was real. The rep said that the after Hoby tells Walter Trump that he is under arrest, the character gets shot by another character and may have been killed:", "A full version of the episode was uploaded to YouTube on 14 January 2017:", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]