["U.S. President Donald Trump with Queen Elizabeth II, inspects the Guard of Honour at Windsor Castle in Windsor, England. (AP Photo/Pablo Martinez Monsivais)", "It is not true that Queen Elizabeth II made political statements about Muslim refugees or that she sided with President Donald Trump on immigration policy.", "A website purporting to be the Chicago Sun-Times published a story headlined, \"Queen Elizabeth Says: ‘Muslim Refugees Are Dividing Nationality, I Fully Agree With Donald Trump We Should…’(VIDEO).\"", "The story posted July 16 on chicagosuntimes.live (the website for the real Chicago Sun-Times is chicago.suntimes.com) offers no video or any other evidence that backs its headline, because the monarch did not make that claim.", "This story was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The false claim comes on the heels of Trump’s July 13 meeting with Queen Elizabeth II in England. Neither Trump nor the queen made public statements during their televised meeting.", "As head of state, Queen Elizabeth II \"has to remain strictly neutral with respect to political matters\" and the ability to make and pass legislation rests with Parliament, according to the monarch’s website.", "In a July 13 press conference with British Prime Minister Theresa May, Trump linked terrorism to immigration, said immigration has \"been very bad for Europe\" and that it was \"changing the culture.\" Trump won the U.S. presidential election touting a hard-line immigration stance, promising to ban Muslims from entering the United States and to remove Syrian refugees from the country (both promises are Stalled).", "There’s no evidence that Queen Elizabeth II made any comments about deporting Muslim refugees.", "We rate this fabricated story Pants on Fire!", "Chicagosuntimes.live, Queen Elizabeth Says: \"Muslim Refugees Are Dividing Nationality, I Fully Agree With Donald Trump We Should…\"(VIDEO), July 16, 2018", "WhiteHouse.gov, Remarks by President Trump and Prime Minister May of the United Kingdom in Joint Press Conference, July 13, 2018", "PolitiFact, Trump-O-Meter immigration promises", "Royal.uk, The Queen and Government, The Queen's role in Government, The Role of the Monarchy", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]