["Sanders supports raising the federal minimum wage to $15 an hour.", "But he doesn’t propose raising the income tax rate to 52% for low-wage earners.", "Sanders’ plan raises the tax rate to 52% for only income earned over $10 million.", "Let’s be clear. Sen. Bernie Sanders, I-Vt., wants to raise tax rates on wealthy Americans. And he wants to raise the federal minimum wage to $15 an hour (and pay for universal health care, among other things).", "But Sanders isn’t proposing huge tax increases on low-wage workers to make the math work.", "A Facebook post on \"Bernie logic,\" gets the details wrong.", "\"Bernie Logic,\" the post reads.", "\"Nobody can live on $7 an hour. We must raise the minimum wage to $15 an hour. Also we must raise the tax rate to 52%.", "\"$15 an hour * 52% = $7.80. $15 an hour - $7.80 = $7.20.", "\"$7.20 an hour!!!\"", "Sanders does support a new federal minimum wage to $15 an hour. What he doesn’t propose is raising tax rates to 52% for those low-wage earners.", "Instead, Sanders has proposed increasing the tax rate for the country’s highest earners to 52%; the new tax rate would apply to income earned only above $10 million.", "That’s a significant increase over the current top tax rate of 37%. The Sanders campaign says the increase would generate an additional $700 billion in tax revenue over 10 years. ]", "But the tax rate wouldn’t affect minimum wage or low-wage workers, whether they earned $7.25 an hour, $15 an hour or $200 an hour.", "That’s logic. This post is False.", "Facebook post, Feb. 15, 2019", "IRS, IRS provides tax inflation adjustments for tax year 2020, Nov. 6, 2019", "Bernie Sanders campaign, How Does Bernie Pay for His Major Plans?", "Bernie Sanders Senate office, Sanders Statement on House Passage of $15 Minimum Wage, July 18, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]