["The video was published here on Facebook on August 4, 2019.", "It has been viewed more than 900 times.", "The 58-second video shows armed soldiers staging a drill a news reporter provides commentary.", "Below is a screenshot of the misleading post:", "The post’s Hindi language caption translates to English as: “Watch the live encounter video of how the Indian Army is sending the terrorists to 72 splendid women companions in heavens. Modi has already started turning Kashmir into paradise.”", "Modi refers to Indian prime minister Narendra Modi.", "The same video was published here and here on Facebook with a similar claim.", "It was also shared on Twitter here with a similar claim.", "The claim is false; the video has circulated in media reports since 2016 and a mock drill by Indian and US troops.", "In the top left corner of the video, a logo for India’s national broadcaster Doordarshan News, also known as DD news, can be seen.", "A YouTube search with keywords 'DD News Kashmir encounter operation' found this corresponding video published on the verified YouTube channel of DD News on October 25, 2016.", "The video, which is two minutes and two seconds in length, is titled; “Know how Indian Army carries out search operations in Kashmir valley (Hindi)”.", "The caption states: “Do you know how our security forces carry out Cordon and Search Operations in the valley in J and K? How do our forces proceed when they receive an input that terrorists are hiding in a house in a village? Our Correspondent Nandita Dagar explains.’", "The YouTube video corresponds with the video in the misleading posts from the 25 seconds mark until the one minute 21 seconds mark.", "Below are screenshots of the video shared in misleading Facebook post (L) and the screenshots from the original DD News YouTube video (R) :", "A journalist in AFP’s Delhi bureau analysed the DD News YouTube video.", "At the beginning of the clip, the anchor’s comments in Hindi translate to English as: “Do you know how cordon and search operations are carried out in Jammu and Kashmir? When security forces receive an input that terrorists are hiding in a house in the village then how do they react, our correspondent Nandita Dagar presents a special report.”", "The reporter’s subsequent comments in Hindi translate to English as: “When Army has decided to launch the search party, the village headman made an appeal to all the villagers to evacuate.\"", "“People were angry, and whenever the locals are angry, they protest and argue with armed forces, there is a higher probability of terrorists hiding in there. Security forces are searching every house and gunshots are heard.”", "“Over there two terrorists are running and security forces have gunned them down. Locals are being asked to assemble by Army to identify that none of the terrorists are hiding in disguise as locals or has escaped as a civilian. The medical team arrives with relief material and refreshments to take care of the people.”", "The anchor can then be heard saying: “This entire operation is really sensitive and how the army takes care of locals in between an encounter is also considered.”", "At the one minute thirty-eight seconds mark of the YouTube video, the uniform worn by some military personnel features a star logo, which corresponds with the official star logo on the uniform worn by US Army personnel.", "Below is a screenshot of the video at the point, with the star logos highlighted with a red square:", "In this press release published on September 26, 2016, India’s Ministry of Defence also shared information about the joint exercise called ‘Exercise Yudh Abhyas 16’ which translates into English as: 'Exercise for war practice 16'.", "The US Army also published this report about the exercise on its official website on September 20, 2016.", "The joint exercise also found mentions in several national media reports in India, including here and here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]