["About this rating", "A mass shooting in El Paso, Texas, on Aug. 3, 2019, allegedly driven by hate for Latino people and immigrants, prompted renewed scrutiny of some of U.S. President Donald Trump's anti-immigrant rhetoric and racially charged comments and policies.", "Patrick Crusius has been charged in the attack that killed 22 people and injured dozens in the Saturday morning attack at a busy Walmart near the U.S.-Mexico border. Crusius is believed to have posted a manifesto online before the attack, calling immigration from Spanish-speaking countries a \"Hispanic invasion of Texas.\"", "Some people pointed to that alleged motive as reflective of some of Trump's own rhetoric toward immigrants.", "One particular incident involving Trump now under intense review happened at a May 2019 rally in Florida. During a rant about immigration across the southern border, in which Trump referred to it as an \"invasion,\" an audience member shouted \"shoot them!\" Trump responded by laughing and joking about the comment.", "Trump, talking about migrants on the southern border: “How do you stop these people?”", "Crowd: “Shoot them.”", "Trump, chuckling: “That’s only in the Panhandle you can get away with that stuff.”pic.twitter.com/f5BGxpJA85", "— Tim O'Brien (@TimOBrien) August 4, 2019", "As hoaxes and misinformation often follow mass shootings, some questioned whether the incident with Trump really happened.", "@snopes @vinnysgreen #snopestips ?? https://t.co/GZWvRWloI3", "— Nondescript Cat ?????? (@violiav) August 4, 2019", "In this case, the incident did happen and was well-documented at the time by numerous media outlets, some with cameras rolling.", "During that speech, which was given on May 8, 2019, in Panama City Beach, Florida, Trump said, \" I mean, when you have 15,000 people marching up and you have hundreds and hundreds of people and you have two or three border security, people that are brave and great, and don't forget, we don't let them and we can't let them use weapons, we can't. Other countries do, we can't. I would never do that. But how do you stop these people? You can't.\"", "At this point an audience member shouted \"shoot them!\" Trump responded by laughing and stating, \"That's only in the Panhandle you can get away with that statement.\" In response, the audience cheered.", "During the same speech, Trump had referred to migration on the southern border as \"an invasion.\" He stated, \"This is an invasion. When you see these caravans, starting out with 20,000 people, that's an invasion. I was badly criticized for using the word invasion, it's an invasion and it's also an invasion of drugs coming in from Mexico, OK. It's an invasion of drugs.\"", "In summary, Trump's actual anti-immigrant statements have come under new scrutiny in light of reports that the suspect in the El Paso massacre allegedly penned a manifesto citing a \"Hispanic invasion of Texas\" as the motive for the crime.", "Cummings, William. \"'Only in the Panhandle': Trump Chuckles When Audience Member Suggests Shooting Migrants.\"\r\n  USA Today. 9 May 2019.", "Garcia, Victoria. \"Trump Defends National Emergency Declaration at Mexico Border, Says Dems 'Don't Mind Crime.'\"\r\n  Fox News. 8 May 2019.", "Baker, Peter and Michael D. Shear. \"El Paso Shooting Suspect’s Manifesto Echoes Trump’s Language.\"\r\n  The New York Times. 4 August 2019.", "Factbase.se. \"Speech: Donald Trump Holds a Political Rally in Panama City Beach, Florida - May 8, 2019.\"", "The Guardian. \"Trump Laughs After Audience Member Suggests Shooting Migrants.\"\r\n  YouTube. 9 May 2019.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]