["President-elect Joe Biden beat President Donald Trump in Georgia by 11,779 votes.", "On Jan. 3, the Washington Post broke the news of an hourlong call in which Trump attempted to persuade Georgia Secretary of State Brad Raffensperger to recalculate the state's vote in his favor.", "Soon after, the news was re-reported by online entertainment outlets like SmallJoys and became viral on social media. \"Trump Demands Brad Raffensperger 'Finds' Extra Votes in Leaked  Phone Call With Georgia's Secretary of State,\" the site reads.", "The information reported by SmallJoys about the call between Trump and Raffensperger is accurate. Its quotes are consistent with the report from the Washington Post, which obtained a recording of the conversation.", "\"So look. All I want to do is this. I just want to find 11,780 votes, which is one more than we have. Because we won the state,\" Trump said.", "“The people of Georgia are angry, the people of the country are angry. And there’s nothing wrong with saying, you know, that you’ve recalculated,\" he added.", "Raffensperger refused Trump's requests to \"recalculate,\" and told him that the allegations of electoral fraud he cited were untrue.", "“Well, Mr. President, the challenge that you have is, the data you have is wrong,\" Raffensperger said. Like Trump, Raffensperger is a Republican.", "Throughout the call, Trump repeated the phrase, \"There’s no way I lost Georgia.\"", "\"There’s no way. We won by hundreds of thousands of votes,\" he said.", "Trump pressured Raffensperger and his general counsel, Ryan Germany, when they refused his demands, such as locating thousands of ballots he baselessly alleged were destroyed.", "“That’s a criminal offense,” he said. “And you can’t let that happen. That’s a big risk to you and to Ryan, your lawyer.”", "Fact check:QR codes on Georgia ballots record votes as cast", "The information reported by SmallJoys about the aftermath of the call is also accurate.", "After the news broke, Trump took to Twitter to repeat unproven claims of electoral fraud in swing states like Georgia.", "\"The Swing States did not even come close to following the dictates of their State Legislatures. These States 'election laws' were made up by local judges & politicians, not by their Legislatures, & are therefore, before even getting to irregularities & fraud, UNCONSTITUTIONAL!\" he wrote.", "\"Sorry, but the number of votes in the Swing States that we are talking about is VERY LARGE and totally OUTCOME DETERMINATIVE! Only the Democrats and some RINO’S would dare dispute this - even though they know it is true!\" he added.", "Meanwhile, Democrats expressed outrage at his actions.", "Bob Bauer, a senior legal adviser to Biden, condemned Trump and his call to Raffensperger in a statement, per USA TODAY.", "\"We now have irrefutable proof of a president pressuring and threatening an official of his own party to get him to rescind a state's lawful, certified vote count and fabricate another in its place,\" he said. \"It captures the whole, disgraceful story about Donald Trump's assault on American democracy.\"", "Vice President-elect Kamala Harris also condemned Trump at a rally in Savannah, Georgia, according to a video of her remarks from The Hill.", "\"They filed six lawsuits — not one, not two — six lawsuits trying to challenge your voice in that election. And they failed every time. And the people's voice remains standing,\" she said.", "\"And then, the president of the United States, the current president of the United States, called the Senate race in Georgia — this senate race in Georgia — illegitimate,\" she added. \"He called it illegal and invalid. Illegal and invalid, suggesting that the people of Georgia are trying to commit a crime.\"", "More:Georgia election official: Trump legal team 'intentionally misled' voters on election fraud", "There is no proof to back any of the allegations of widespread fraud in Georgia that Trump levied on the call with Raffensperger, per the Associated Press.", "And it's patently false for Trump to say he won the state. All ballots in Georgia have been counted three times, including once by hand, to reveal that Biden won by 11,779 votes.", "No credible claims of widespread voter fraud or systemic errors in Georgia — or any other states — have been sustained by elections officials or courts of law.", "On Dec. 1, now-former Attorney General William Barr also told the Associated Press the U.S. Justice Department had uncovered no such evidence.", "USA TODAY has previously debunked a number of allegations Trump made on the call.", "For example, Trump claimed that after a \"major water main break,\" footage showed vote counters with ballots that \"weren’t in an official voter box, they were in what looked to be in suitcases or trunks.\"", "Though a pipe leak delayed vote counting, investigations surrounding the incident revealed nothing suspicious and confirmed that all ballots shown were in ballot containers, not suitcases, per USA TODAY.", "Fact check:Georgia 'suitcase' video is missing context", "Trump also claimed to have \"found tremendous corruption with Dominion machines,\" referencing technology made by Dominion Voting Systems.", "That's also false. A national election security coalition announced that \"there is no evidence that any voting system deleted or lost votes, changed votes, or was in any way compromised,\" per USA TODAY.", "Fact check:These 5 election statistics do not discredit Joe Biden's victory", "Based on our research, the claim that President Donald Trump tried to persuade elections officials in Georgia to recalculate the state's vote in his favor is TRUE. On Jan. 3, the Washington Post broke the news of an hourlong call in which Trump asked Georgia Secretary of State Brad Raffensperger to \"find 11,780 votes.\" Since then, Trump has doubled down on his baseless claims of electoral fraud, while Democrats have expressed outrage.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more."]