["About this rating", "On Aug. 26, 2019, the Twitter account Discover and Know (@myth_vs_facts) posted a photograph that supposedly showed \"how Chinese soldiers keep their posture\" — by placing a pin or needle in their uniform collars with the point facing toward the neck skin:", "This is how Chinese soldiers keep their posture. pic.twitter.com/WU8Y9DDLf5", "— Discover and Know (@myth_vs_facts) August 26, 2019", "This is a genuine photograph.", "It was taken in Beijing in February 2012 and shows a Chinese paramilitary policeman preparing for the National People's Congress. The picture is available via Getty Images with the following caption:", "A pin, used for training purposes, is placed on the collar of a Chinese paramilitary policeman undergoing a drill to prepare for the upcoming National People's Congress (NPC) in Beijing on February 28, 2012. China's parliament, the National People's Congress, is set to open its annual session on March 5. CHINA OUT AFP PHOTO (Photo credit should read STR/AFP/Getty Images)", "While this is a genuine photograph of a pin being used to correct posture, this is not a training method that all soldiers have to endure.  A 2009 article from The New York Times indicated that this is a corrective measure for soldiers whose postures aren't up to standards (emphasis ours):", "The Olympics that dazzled spectators last year showed China’s knack for meticulous preparation. Participants in the Thursday parade have engaged in similarly intense drills for months, according to reports in the Chinese news media.", "Soldiers have practiced endless hours to hold their rifles at precisely the same level. Photos show their instructors holding threads as rifle guides, or sticking needles in soldiers’ shirt collars, pointed at their necks, to correct poor posture.", "They have trained to stand motionless for a solid hour, to refrain from swaying during the second hour and not to collapse after three hours, reported Xinhua, the state-run news agency.", "We found one other photograph from Getty Images showing a Chinese officer with a pin being placed in his collar in an attempt to correct posture. The following picture is available with the caption: \"An officer sticks a needle in the collar of a paramilitary policeman to correct his posture during a training session in Hefei, Anhui province September 13, 2009.VCP (Photo by Jie Zhao/Corbis via Getty Images).\"", "LaFraniere, Sharon.   \"No Detail Is Overlooked as China Prepares to Celebrate.\"  \r\n     The New York Times.   28 September 2009.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]