["According to a meme shared more than a thousand times in Canadian Facebook groups, “The ‘safe’ limit for injected mercury is zero.” The problem, the post adds, is that, “The flu shot contains 25mcg of mercury. #HelloDementia.”", "The meme’s conclusion that flu shots are harmful to the human body is wrong.", "Thimerosal is a mercury-based preservative that prevents bacterial and fungal contamination of vaccines, and other consumer products such as cosmetics.", "According to the US Food and Drug Administration, \"Thimerosal is a preservative that has been used in some vaccines since the 1930's, when it was first introduced by Eli Lilly Company.\"", "Dr. Ian Gemmill, former chair of Immunize Canada, a coalition of non-governmental health organizations, told AFP that thimerosal is important because vaccine “contamination is possible and it is a very significant risk to health. So the last thing we want to do is to give an influenza vaccine that can pose a risk.”", "The Health Canada web page on thimerosal points to the important difference between the ethylmercury contained in thimerosal, and the methylmercury present in fish, which is a known to be dangerous if consumed in large amounts.", "In an interview with AFP, Dr Bryna Warshawsky, a public health physician at Public Health Ontario stressed that as a mercury-based substance, thimerosal “is not the kind of mercury that you find in fish and accumulates in the body.”", "Thimerosal contains 49.6 percent of mercury by weight, and is measured in vaccines in micrograms, or one millionth of a gram. As the meme states, the quantity of mercury in a dose is around 25 micrograms.", "“The amount of thimerosal in the multi-dose vials is infinitesimal. It’s been in use for decades and we do not have any evidence that any of those vaccines caused harm to anybody, because the dose is so small.” Gemmill said to AFP.", "Several academic, government, and non-governmental sources confirmed Gemmill’s conclusion.", "Health Canada states, “The amount of thimerosal in vaccines is small, and no studies have documented any associated adverse effects.”", "The World Health Organization also states on its website, “There is no evidence to suggest that the amount of thimerosal used in vaccines poses a health risk.”", "In particular, a theory linking Alzheimer’s disease or dementia to flu shots, which was popularized by a US doctor whose license was suspended, is disputed by Alzheimer's societies in Canada and the US.", "One Canadian study, found, “Past exposure to vaccines against diphtheria or tetanus, poliomyelitis and influenza may protect against subsequent development of Alzheimer's disease.”", "Another review by researchers from the Children’s Hospital of Philadelphia examined seven academic studies looking at a possible association between thimerosal in vaccines and autism, all of which failed to support the link.", "Each year, Health Canada releases the list of authorized vaccines for the upcoming influenza season and their ingredients. For the 2019-2020 season, nine vaccines have been authorized, five of which contain thimerosal.", "The five thimerosal-containing vaccines this season, Agriflu Seqirus, Fluviral, Afluria Tetra, Flulaval, and Fluzone Quadrivalent, only contain thimerosal when they are dispensed from multi-dose vials, as the larger quantity makes preservation more difficult.", "Gemmill said if people are uncomfortable with thimerosal in flu shots, they may ask their doctor for a pre-filled, single-dose vaccine, which does not contain any.", "The flu shot is a regular source of misinformation. AFP Canada also examined a false claim that the vaccine will cause people who get it to be contagious.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]