["About this rating", "Chuck Norris became the subject of at least two death hoaxes in 2020, one of which claimed his net worth purportedly \"left his family in tears.\" Earlier in 2020, a false rumor spread that the \"Walker, Texas Ranger\" star had died from the COVID-19 coronavirus disease. This prompted endless jokes, the likes of which had previously endured through the years:", "As for Norris' net worth leaving his family \"in tears,\" the claim appeared to originate in misleading online advertisements featuring one of the following photographs:", "Readers who clicked the advertisements were led inexplicably to a story on the website Cars & Yachts titled, \"59 Celebrities & Their Incredible Net Worth - Can You Guess Who Has The Biggest Bank Account?\" The list of \"59 Celebrities\" spanned 230 pages. Norris appeared on page 228. Nothing on that page mentioned anything about his family being left \"in tears\":", "Chuck Norris – $70 Million", "Chuck Norris is a former U.S. Air Force policeman-turned-martial artist and actor. He has several karate schools that he has set up around the U.S, and he happened to have taught several celebrities including Steve McQueen and Priscilla Presley. Norris made his acting debut in 1969 when he starred in \"The Wrecking Ball.\" He’s best known for his role in the TV series \"Walker, Texas Ranger.\" He is currently worth $70 million, with acting work and his karate business contributing to his wealth. Norris has also appeared in several infomercials endorsing Total Gym exercise equipment.", "\"Chuck Norris' net worth left his family in tears\" also appeared on a strange website with the domain \"97bb076.awfory.xyz.\" It was unclear how long the net worth hoax had been present on the internet.", "An earlier death hoax appeared in the form of a Facebook scam in 2012. Norris was born on March 10, 1940, and as of late 2020 was 80 years old.", "We previously reported on similar \"net worth left his family in tears\" hoaxes featuring Alex Trebek, Sean Connery, Jaleel White, Richard Gere, and Clint Eastwood. While Trebek and Connery died in 2020, White, Gere, and Eastwood were all still alive.", "Since everyone knows Norris wields the power to make onions cry, we're not concerned about the prospect of the Norris family being left in tears.", "Snopes debunks a wide range of content, and online advertisements are no exception. Misleading ads often lead to obscure websites that host lengthy slideshow articles with lots of pages. It's called advertising \"arbitrage.\" The advertiser's goal is to make more money on ads displayed on the slideshow's pages than it cost to show the initial ad that lured them to it. Feel free to submit ads to us, and be sure to include a screenshot of the ad and the link to where the ad leads.", "Jordan Liles is a Senior Reporter who has been with Snopes since 2016.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]