["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "With conservative Marco Rubio nipping at his heels in the race for the Republican nomination for U.S. Senate, Florida Gov. Charlie Crist is trying to pump up his conservative credentials.", "In a new radio advertisement for his campaign, he says, \"Here in Florida, I’ve slashed government by 10 percent. That’s $7 billion.\" It’s a statement Crist has also made on the campaign trail, and at a Hillsborough County Republican Party fundraiser earlier this month.", "It’s true that Florida’s budget has dropped by 10 percent, or about $7 billion, since Crist was elected governor in November 2006. The budget passed by the Legislature and approved by then-Gov. Jeb Bush in May 2006 came in at $73.9 billion. This year’s spending plan tops out at $66.5 billion.", "But can Crist, as his radio ad claims, really take credit for the cuts?", "In 2007, Crist did veto $459 million from the state budget, setting a state record with his veto pen.", "But the Florida Constitution requires that state lawmakers prepare a balanced budget, which is built around revenue generated by sales taxes, corporate taxes, other taxes and fees, and federal appropriations.", "And since 2007, that revenue has declined significantly as the nationwide recession has taken hold. State budget documents show that in the 2006-2007 fiscal year, $31.7 billion was available in the general revenue fund. This year, the fund had only $21.9 billion. (In fiscal year 2007, the fund had $28 billion, and in 2008, it had $24.3 billion.)", "With revenue down and a constitutional requirement for a balanced budget, Crist had to either cut spending or raise taxes.", "\"This is not a concerted effort on the part of our governor and Legislature to cut the budget,\" said Dominic M. Calabro, president and CEO of Florida TaxWatch. \"It is because of the worst economy Florida has had since the Great Depression.\"", "Crist has defended the budget-cut claim by saying that in other states, taxes were increased to cover shortfalls. While Crist didn’t push for tax increases to make up the entire shortfall, he did approve fee and tax increases this year — on everything from fishing licenses to initial vehicle registrations to cigarettes — that total $2.2 billion.", "So while it is true that state government has shrunk by 10 percent since Crist’s election, it had little to do with him, and a lot to do with the shrinking economy. For those reasons, we give Crist’s statement a Barely True.", "Florida Constitution", "Fiscal Analysis in Brief for Fiscal Year 2009-10", "August 2009 Revenue Estimating Conference workpapers", "August 2008 Revenue Estimating Conference workpapers", "August 2009 General Revenue financial outlook statement", "August 2008 General Revenue financial outlook statement", "August 2007 General Revenue financial outlook statement     General Revenue financial retrospect statement for FY 2006-07 and FY 2007-08", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]