["By Saranac Hale Spencer", "Posted on May 2, 2018", "Q: Did Comedy Central fire Michelle Wolf because of jokes she made at the White House Correspondents’ dinner?", "A: No. That claim was made up by a self-described satirical website. She left “The Daily Show” on Comedy Central in December.", "Michelle Wolf’s jokes at the White House Correspondents’ Association dinner have stirred up a lot of strong reactions. President Donald Trump called the comedian “filthy,” while feminist icon Gloria Steinem called her “smart, funny and daring.”", "A host of opinion pieces expressing similar viewpoints have cropped up since the April 28 event. And writers of false stories are capitalizing on the controversy surrounding Wolf’s performance.", "One story has been circulating on Facebook with the headline, “BREAKING: Michelle Wolf Fired — Comedy Central Apologizes To Sarah Sanders.”", "Some Facebook users rightly flagged it as potentially false. It is.", "The story originated on Daily World Update, a website that describes its content as satire. But other websites have copied it and presented it as news — without a disclaimer.", "There are a couple of things that indicate the story is made up. First, it claims that the CEO of Comedy Central is someone named Art Tubolls, a fictitious character who was used in other stories on a related, now-defunct website as a “correspondent,” a “legal analyst” and a “publicist.” But Comedy Central doesn’t have a CEO. The TV channel is owned by Viacom, whose CEO is Robert Bakish.", "Also, the story claims that Wolf was “fired” from her job at Comedy Central’s “The Daily Show.” But the show’s host, Trevor Noah, included a segment in his April 30 show, panning Wolf’s critics and explaining that she left the show in December to pursue her own series on Netflix.", "According to Netflix, “The Break with Michelle Wolf” is due to start streaming online May 27.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk false stories flagged by readers on the social media network.", "C-Span. “Michelle Wolf COMPLETE REMARKS at 2018 White House Correspondents’ Dinner.” YouTube. 28 Apr 2018.", "“BREAKING: Michelle Wolf Fired — Comedy Central Apologizes To Sarah Sanders.” DailyWorldUpdate.us. 29 Apr 2018.", "The Daily Show with Trevor Noah. “Michelle Wolf’s ‘Disgraceful’ Performance at the White House Correspondents’ Dinner.” YouTube. 30 Apr 2018.", "Netflix. “The Break with Michelle Wolf Comes to Netflix on May 27.” 11 Apr 2018.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]