["The article, which was first shared March 20, 2017, has been posted in Facebook groups with more than two million followers between them.", "The article says: “U.S department of States has announced travel sanction against the Philippines Vice president, Leni Robredo for her continued effort to destabilize the government. Leni, who resigned from Presidents Duterte cabinet last year citing political frustrations has been banned from entering the United States for unspecified period of time, State department noted.”", "Below is a screenshot of the article:", "Robredo traveled to the United States in October 2018. Here is a video of Robredo giving a talk on October 17, 2018 at the headquarters of the Center for Strategic and International Studies in Washington, DC.", "Here are pictures of Robredo in a meeting with David Miliband, president of the International Rescue Committee, in New York City in October 2018.", "There is no US agency called the “US Department of States”. There is a government body called the US Department of State or the State Department.", "A search of the official website of the US State Department revealed that no such announcement against Robredo has also been made.", "A search of transcripts of special press briefings and department briefings also showed that there had been no such announcement.", "Molly Koscina, press attaché and spokesperson of the US Embassy in the Philippines said that travel bans are not made public.", "\"Section 222(f) of the Immigration and Nationality Act (INA) prohibits us from discussing individual visa cases,” she told AFP in an email on January 29, 2019.", "The misleading article has been shared more than 2,000 times by Facebook groups and pages with almost two million followers since 2017.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]