["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Senate candidate John James speaks during a President Donald Trump rally at the MBS International Airport in Freeland on Sept. 10, 2020. (Mandi Wright, Detroit Free Press)", "While James’ campaign said in 2018 that he supports an exception to abortions in cases where the mother’s life is at risk, James and his campaign have repeatedly dodged questions on the matter.", "James supports overturning Roe v. Wade, which would make Michigan’s pre-Roe abortion ban enforceable. The law makes administering an abortion a felony in all cases except where the mother’s life is at risk.", "In a Facebook ad, Democratic incumbent Sen. Gary Peters says that when it comes to abortion, his Republican challenger John James is \"out of touch and too extreme\" for Michigan.", "\"John James opposes abortion, even refusing to make an exception when a woman’s life is at risk\" and \"wants to make it a felony even in cases of rape and incest,\" Peters’ ad claims. Peters is hoping to hold on to his seat in a state that President Donald Trump narrowly won in 2016.", "There is no question that James is on the record as opposing abortion. But we wanted to take a closer look at Peters’ characterizations.", "We found that James has repeatedly dodged questions when asked whether he would make an exception to abortion prohibtions in cases where a mother’s life is at risk. Meanwhile, James favors overturning Roe v. Wade. The 1973 Supreme Court case invalidated Michigan’s 1931 law that makes it felony to administer an abortion in all cases except when the mother’s life is at risk. This law is still on the books and could be enforced if Roe v. Wade is overturned. James has not said whether he supports Michigan’s pre-Roe abortion ban.", "James anti-abortion stance is clear. In a 2018 tweet, James wrote, \"I am 100% #ProLife because I believe life begins at conception and ends at a natural death. We will not stop fighting until we end abortion, for it is our sacred duty to protect the most vulnerable among us: the unborn.\" During a July 13, 2018, campaign event, James called abortion a form of \"genocide,\" according to audio released by the Michigan Democratic Party.", "Whether James supports an exception when a mother’s life is in danger is less clear. When James ran unsuccessfully for the Senate in 2018, his campaign said he supports an exception in such cases, but neither James nor his campaign have answered questions on his position since.", "Ahead of the 2018 primary election, when James was asked in a WILS-AM 1320 interview whether he supports exceptions in cases where the life of the mother is at risk or preganancies resulting from rape or incest, he answered: \"I believe the focus should be given to maintaining and protecting life and exhausting every remedy to wrap our arms around both the mother and the baby, making sure that we eliminate situations that put our women in these terrible situations that no one wants to be in.\"", "Asked again in that same interview whether he would criminalize abortions in cases where the pregnant woman’s life was in jeopardy and the pregnancy needed to be terminated to ensure the mother’s survival, he responded, \"if somebody’s life is in danger, you’re going to the hospital. You’re not going to Planned Parenthood. You’re creating a false dilemma.\"", "During his 2020 campaign against Sen. Peters, James’ campaign has continued to avoid the matter.", "In an interview on WXYZ-TV Detroit Oct. 4, James was asked whether is pro-life. James responded, \"I am pro-life and I will always vote to protect life, especially the life of the mother.\" But he did not specifically say that the life of a mother would be cause for an exception.", "During his 2020 campaign against Peters, James’ campaign has continued to avoid the matter. James’ campaign has stood out for not taking clear positions on a range of issues. Campaign spokesperson Abby Walls did not clarify whether James opposes exceptions to abortion for cases where a mother’s life is at risk when asked by a reporter for MLive. Walls declined to respond to a request for comment on James’ position from PolitiFact Michigan. But she did send a statement criticizing the ad: \"As a 30-year career politician, Sen. Peters’ lies and half-truths are so frequent, it’s almost impossible to keep track.\"", "Peters campaign press secretary C.J. Warnke defended the ad in an email: \"John James has said in his own words that he is ‘100% pro-life’ and does not support Roe v. Wade — that means outlawing abortion and putting a woman’s life at risk.\"", "With Republicans in the Senate hoping to vote on Trump’s Supreme Court nominee Amy Coney Barrett, activists on both sides of the issue are preparing to mobilize voters. In 2016, Trump promised to appoint justices who would overturn Roe v. Wade.", "The Detroit Free Press reported in 2018 that \"James made it clear he couldn't support any judge who didn't openly call for abortion to be outlawed except in almost all cases.\"", "James has also received a number of endorsements from pro-life groups, including the Susan B. Anthony List, Right to Life of Michigan and the Family Research Council Action’s PAC.", "Peters’ claim that James wants to make administering an abortion in cases of rape or incest a felony needs context. James has said Roe v. Wade should be overturned. If that happened, abortion regulations would revert to individual states.", "\"Michigan has a law on the books from 1931 that criminalizes virtually any form of abortion. It’s unconstitutional right now because of Roe,\" said Merissa Kovach, policy strategist for ACLU of Michigan. \"We could very quickly overnight become a state where virtually all abortion is criminalized.\"", "Michigan is one of only nine states in the U.S. with a pre-Roe abortion ban that has not been repealed. Michigan law stipulates that any person who administers an abortion is guilty of a felony. The law makes an exception in cases where the abortion is administered to save a woman’s life but makes no exception in cases of rape or incest.", "That said, James has not said whether he specifically supports Michigan’s pre-Roe ban.", "A Gary Peters campaign ad says \"John James opposes abortion, even refusing to make an exception when a woman’s life is at risk\" and \"wants to make it a felony even in cases of rape and incest.\"", "This lacks context.", "While James’ campaign stated in 2018 that he supports exceptions to abortion prohibitions in cases where the mother’s life is at risk, he has not provided a clear answer about where he stands now. Neither James nor his campaign have reiterated his support for such an exception, but neither he nor his campaign have said he would oppose them either.", "Meanwhile, James’ has been clear in his stated support for overturning Roe v. Wade, an action that would result in abortion regulations reverting to individual states. Michigan’s pre-Roe abortion ban makes administering abortion a felony except in cases where it is necessary to save a woman’s life. But James has not said whether he supports Michigan’s pre-Roe ban.", "The ad’s claims are partially accurate but leave out important details or take things out of context. We rate the ad’s claims Half True.", "UPDATE, Oct. 9, 2020: This story has been updated to reflect James’ comments on Oct. 4 , 2020, to WXYZ-TV Detroit. The ruling is unchanged.", "Peters for Michigan, Facebook ad, started running September 21, 2020", "Susan B. Anthony List, 2020 Endorsed Candidates, accessed October 1, 2020", "The Detroit Free Press, Todd Spangler, \"These Republicans are looking to unseat Michigan Sen. Debbie Stabenow,\" July 5, 2018", "NPR, Sarah McCammon, \"A Look At Amy Coney Barrett's Record On Abortion Rights,\" September 28, 2020", "MLive, Malachi Barrett, \"Michigan Democrats hit John James for anti-abortion comments,\" November 23, 2019", "The Michigan Penal Code, Act 328 of 1931, 750.14 Miscarriage; administering with intent to procure; felony, penalty.", "Right to Life of Michigan, Endorsements, October 1, 2020", "The Washington Post, Joe Fox, Ann Gerhart and Aaron Steckelberg, \"What could happen if Roe v. Wade gets struck down?,\" November 2, 2018", "FRC Action PAC, Press Release, \"FRC Action PAC Endorses John James for U.S. Senate in Michigan,\" February 10, 2020", "Family Research Council, Abortion, accessed October 1, 2020", "John James, tweet, January 23, 2018", "Merissa Kovach, policy strategist for ACLU of Michigan, phone call, September 30, 2020", "Angela Vasquez-Giroux, Director of Communications & Media Relations, email, October 1, 2020", "John James Revealed, YouTube, February 27, 2020", "The Detroit Free Press, Todd Spangler, \"In one of the nastier races, John James and Sen. Gary Peters offer different styles,\" September 24, 2020", "Abby Walls, John James for Senate Press Secretary, email, October 1, 2020", "C.J. Warnke, Peters for Michigan Press Secretary, email, October 1, 2020", "WXYZ Detroit, Chuck Stokes, \"Spotlight on the News: A conversation with GOP Senate candidate John James & MI SOS Jocelyn Benson,\" October 2, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]