["By Bala Thenappan", "Posted on August 4, 2020", "A viral Facebook post makes the false claim that the nasal swab test for COVID-19 damages the “blood-brain barrier” and can therefore lead to brain infections. Medical experts say the swab test is completely safe.", "To help control the spread of COVID-19, the Centers for Disease Control and Prevention has recommended getting a COVID-19 test for people who show symptoms of the disease, have come into contact with someone known to have the disease, or are in vulnerable groups.", "The most common form of testing for the novel coronavirus involves the use of a nasopharyngeal, or nasal, swab. The swab reaches deep into the back of a person’s nose and mouth to collect cells and fluids from the upper respiratory system, which can then be checked with diagnostic tests for the presence of the novel coronavirus known as SARS-CoV-2.", "The testing procedure involves inserting a 6-inch-long swab into the cavity between the nose and mouth for 15 seconds and rotating it several times. The swabbing is repeated on the other side. The swab is then inserted into a container and sent to a lab for testing.", "Dr. Shawn Nasseri, an ear, nose and throat surgeon based in Beverly Hills who has conducted many COVID-19 swab tests, told us in an email that the nasal swab “follows the floor of the nose and goes to where the nose meets the throat, or naso-pharynx.”", "Asked if the swab test is safe, Nasseri said, “Absolutely. The biggest risk is discomfort. The rare person — 1 in thousands — passes out from being super sensitive or gets a mild nosebleed. It’s estimated that close to 40 million or more swabs have been performed safely in the U.S. alone.”", "But in recent weeks, viral posts on Facebook falsely claim that the nasal swab test can cause serious health issues. One post says, “The stick deep into the nose causes damage to the hamato-encephalic barrier and damages endocrine glands. This test creates an entrance to the brain for every infection.”", "The hamato-encephalic barrier, also known as the “blood-brain barrier,” protects the brain from toxins that could be present in the blood.", "Dr. Yvonne Maldonado, a professor of epidemiology at the Stanford University School of Medicine, told us in an email that the Facebook claim “is not true.”", "“I have heard about it before and consulted with neurosurgeons, neurologists and other physicians and no one has heard of this situation occurring or even likely,” Maldonado said.", "Nasseri said that “it is incredibly implausible, if not impossible, to cross the skull base and blood-brain barrier with a swab unless someone uses a rigid metal instrument and is pointing the metal object 90 degrees in the wrong direction.”", "Dr. Morgan Katz, an infectious disease expert at Johns Hopkins University, told the Associated Press that the Facebook posts misunderstand what’s happening when the swab test is performed.", "The swab “would have to go through layers of muscle and fascia, as well as the base of the skull, which is a thick bone, in order to get anywhere near the blood-brain barrier, and I would say that it is not possible,” Katz said.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "Centers for Disease Control and Prevention. Overview of Testing for SARS-CoV-2. Accessed Aug 3 2020.", "Brueck, Hilary and Samantha Lee. “Here’s how coronavirus nose and throat swab tests really work, and why they don’t always give satisfying results.” Business Insider. 15 Apr 2020.", "Dr. Shawn Nasseri.  Ear, nose and throat surgeon. Email exchange with FactCheck.org. 3 Aug 2020.", "Dr. Yvonne Maldonado. Professor of epidemiology, Stanford University School of Medicine. Email exchange with FactCheck.org. 3 Aug 2020.", "Fauzia, Miriam. “Fact check: No, the COVID-19 nasal test doesn’t swab the blood-brain barrier.” USA Today. 9 July 2020.", "Marty, Francisco M., et al. “How to Obtain a Nasopharyngeal Swab Specimen.” New England Journal of Medicine. 28 May 2020.", "Swenson, Ali. “Test for COVID-19 does not involve collecting a sample from the blood-brain barrier.” Associated Press. 7 Jul 2020.", "UCDavis Health. “Coronavirus (COVID-19) testing: What you should know.” Accessed 3 Aug 2020.", "University of Queensland, Australia. “What is the blood-brain barrier?” Accessed Aug 3 2020.", "U.S. National Library of Medicine, National Institutes of Health. “The Blood-Brain Barrier.” Accessed Aug. 4, 2020.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]