["About this rating", "With restrictive abortion laws either being proposed or passed in multiple states in May 2019, Snopes.com readers have inquired about years-old reports about U.S. Rep. Scott DesJarlais, an anti-abortion Republican legislator from Tennessee who had testified almost two decades earlier during his divorce proceedings that he encouraged two women to seek abortions.", "Laws dictating near-total bans on abortion in states such as Alabama, Georgia, and Ohio were widely viewed as potential legal challenges to the U.S. Supreme Court's landmark 1973 Roe v. Wade ruling and drew nationwide protests. Because DesJarlais touted an anti-abortion agenda in his role as a public official, his story, while not new, was being viewed by critics as an example of political hypocrisy on the issue:", "Congressman Scott DesJarlais (R-TN) did—three times. https://t.co/yCXHyjzuA3", "— Christopher J. Hale (@chrisjollyhale) May 17, 2019", "The story about DesJarlais is a multi-layered one and stems from both an acrimonious divorce finalized in 2001 and a 2010 political election filled with mudslinging. Although DesJarlais, a physician, has won multiple re-election bids since the story surfaced, it resulted in his being reprimanded by the Tennessee medical licensing board over revelations that he slept with two patients, something he admitted to under oath during his divorce hearings.", "In 2010, DesJarlais unseated Democratic incumbent Lincoln Davis to represent Tennessee Fourth District in the U.S. House of Representatives — but in the days leading up to the election, Davis' campaign launched attack ads centered on accusations that had been levied against DesJarlais a decade earlier.", "In the course of divorcing him, DesJarlais' now-ex-wife had accused him of \"dry-firing\" (i.e., pulling the trigger of an unloaded gun) outside her locked bedroom door to intimidate her, holding a gun in his mouth for three hours, as well as engaging in \"an incident of physical intimidation at the hospital; and previous threatening behavior ... i.e. shoving, tripping, pushing down, etc.\" At the time, his campaign called those accusations \"baseless\".", "Those same divorce records were raised again in 2012 when DesJarlais was up for re-election. But unlike in 2010, hundreds of pages of hearings transcripts from 2001 were made public in 2012. (Snopes.com is not linking to the transcript because it contains the names of numerous private citizens.)", "The transcripts revealed that DesJarlais admitted to the incident with the gun, saying: \"It was never a loaded gun. It was never a suicide attempt. It was an attention-seeking act and I've testified to that.\" He added that he thought his actions were \"very shameful.\"", "During those same hearings, DesJarlais testified under oath that his wife at the time had one abortion before the two met. After the two entered into a relationship, he subsequently supported her decisions to undergo two abortions before the couple married in 1995.", "\"The second two [abortions], one she was on [an] experimental drug called Lupron and was not supposed to have gotten pregnant,\" DesJarlais testified. \"There were potential risks. It was a therapeutic. One was after she had gotten back from Desert Storm and things were not going well between us and it was a mutual decision.\"", "He added, \"I don't think that it was easy for either one of us. I think it was a very difficult and poor choice and I think that there are probably regrets both ways.\"", "DesJarlais also testified that he had a sexual relationship with a then-24-year-old patient, and that the woman had claimed he got her pregnant. According to the transcript, as part of a reconciliation attempt the couple orchestrated a recorded phone call in an effort to find out whether the young woman was telling the truth. In the call, DesJarlais pressured the young woman to seek an abortion and offered to drive her to Atlanta for her to do so -- although he stated during his testimony he never believed her to be pregnant in the first place.", "DesJarlais' then-wife's attorney, L. Thomas Austin, asked him if the young woman was one of \"the kind of women you prey on, Doctor,\" to which DesJarlais responded, \"No. Obviously it was a huge mistake.\"", "During the same hearing, DesJarlais admitted to having an affair with a second patient while writing her prescriptions, lavishing her with an $875 watch and buying her a plane ticket to Las Vegas. He also admitted to flings with a representative from a drug firm and with co-workers.", "Media reports prompted Citizens for Responsibility and Ethics in Washington (CREW), a government-accountability advocacy organization, to file a complaint about DesJarlais' conduct with the Tennessee Department of Health, who fined him $500 for unprofessional conduct over his affairs with the two patients.", "DesJarlais responded to the controversy on a radio show in December 2012, saying that he believed \"God gave me a second chance,\" adding: \"And I think unless some people see some sort of political advantage to grace and redemption ... they don't want to practice it on their own. I don't know what the reason is behind that, but I know God's forgiven me. ... I simply ask my fellow Christians and constituents to consider doing the same for me.\" (Our attempts to reach DesJarlais' current spokesman, Brendan Thomas, were unsuccessful.)", "The story has continued to haunt Desjarlais. It came up in 2015 when he voted for a bill that would have banned most abortions after the 20th week, and again in 2017 in stories about Tim Murphy, an anti-abortion Pennsylvania Republican who retired after his mistress revealed he had asked her to get an abortion. Nevertheless, DesJarlais has won every bid for re-election since the story broke.", "\"Despite a fixation by his political opponents on the details of a previous marriage from the 1990s, the people of Tennessee's Fourth District have shown they care much more about the Congressman's job in Washington than the details of a divorce,\" a spokesman for DesJarlais said in 2015.", "Carroll, Chris, and Kate Belz.   \"Scott DesJarlais Supported Ex-Wife's Abortions, Slept with Patients, Divorce Transcript Shows.\"\r\n    Times Free Press.   15 November 2012.", "Carroll, Chris and Kate Belz.   \"Scott DesJarlais Supported Ex-Wife's Abortions, Slept with Patients.\"\r\n    Times Free Press.   16 November 2012.", "Belz, Kate.  \" DesJarlais, Who Supported Ex-Wife's Abortions, Votes for Abortion Ban.\"\r\n    Times Free Press.   15 May 2015.", "BBC News.   \"Pro-Life Congressman to Retire After 'Urging Lover's Abortion.'\"\r\n    5 October 2017.", "Sher, Andy.   \"Scott DesJarlais Says God Has Forgiven Him.\"\r\n    Times Free Press.   1 December 2012.", "McArdle, John.   \"Old Divorce File Riles Tennessee.\"\r\n    Roll Call.   16 September 2010.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]