["The post was published on Facebook here on March 23, 2020. It has since been shared more than 20,000 times.", "Below is a screenshot of the misleading post:", "The post's Thai-language caption translates to English as: “Be careful”.", "Part of the Thai text overlaid in the image in the misleading post translates to English as: “#Warningtoday / If you are home alone or live with a baby or old people, and you wake up in the middle of the night and hear something similar to a water tap being opened or your water pipe has broken outside of the house. Do not leave!!!!! To discover what is because currently there are thieves who are using the method of turning your water tap the hardest so that you or the owner of the house to walk outside the house and that is when they will attack you and drug you.”", "The post features the logo of the CIB, an agency under the Royal Thai Police.", "The claim is false.", "Thailand’s CIB commissioner, Pol. Lt. Gen. Sutin Suppuang, said the claim is an “old hoax”.", "“I can confirm that this claim is 100% fake news, and it has been circulating around for a very long time,\" Suppuang told AFP by phone on May 6, 2020. \"Usually thieves attack their victims in different patterns, depending on their behaviours. I have never heard of this.\"", "Thailand’s Anti-Fake News Centre, a government-run platform within the Ministry of Digital Economy and Society, also published this report on January 9, 2020, describing the claims in the misleading post as “fake information”.", "Below is a screenshot of the Anti-Fake News Centre’s article:", "The Thai headline reads: “Central Investigation Bureau leaks the news about thieves hiding inside the house and opening the water taps is fake news causing public alarm among the people, don’t share!!”", "An example of the old hoax circulating on Facebook in 2018 can be seen here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]