["“ Singapore... got its independence five years after Nigeria [and] now has a real GDP per capita of $57,722, while Nigeria’s GDP per capita as at 2017 was $1,951.”", "“Today, adult literacy in Singapore is 98%, while adult literacy in Nigeria is just 57%.”", "“Unfortunately, more than 70% of Nigerians have pre-school children without access to Early Child Care Education.”", "“[The] mining sector contribution to GDP [is] below 1%...”", "“With the nation's entire federal budget peaking at around $30 billion...”", "“Less than 30% of the federal budget is allocated to capital expenditure.”", "“From 1999 to date, all the projections made by successive governments to grow the supply of electricity to Nigerians to either 6,000MW, 10,000MW or 20,000MW have not been met.”", "“Nigeria currently has 187 policemen for every 100,000 Nigerians, the UN recommends a ratio of 300 police officers to 100,000 people.”", "Please complete this form to receive the HTML sharing code.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "For democracy to function, public figures need to be held to account for what they say. The claims they make need to be checked, openly and impartially. Africa Check is an independent, non-partisan organisation which assesses claims made in the public arena using journalistic skills and evidence drawn from the latest online tools, readers, public sources and experts, sorting fact from fiction and publishing the results.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "© 2023 - Africa Check - All rights reserved.", "We will never charge you for verified, reliable information. Help us keep it that way by supporting our work.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "Support independent fact-checking in Africa."]