["About this rating", "On 28 January 2017, the Palmer Report blog posted a story reporting that top advisers to President Donald Trump believe he is misleading them about the veracity of allegations that Russians are keeping compromising information about him, and that they could potentially use it to blackmail him. The story was based entirely on posts made by an anonymous Twitter user under an account called \"Rogue POTUS Staff\":", "As Donald Trump’s behavior grows more extremist and erratic by the day since he took office, Americans have begun to increasingly rebel against him — including those within the government. Numerous federal employees have gone rogue by launching anonymous Twitter accounts where they’re revealing the truth about what’s going on behind the scenes. And now the most notable of those leakers has revealed that even Trump’s own most trusted advisors believe he’s misleading them on what Russia is holding over his head.", "The incredible revelation came today from the increasingly trustworthy @RoguePOTUSStaff account on Twitter, which has now correctly pegged multiple White House occurrences before they happened. This time around the rogue White House staffers are leaking the details of Donald Trump’s official phone call with Russian president Vladimir Putin today. Chief of Staff Reince Priebus and Speaker Paul Ryan convinced Trump to allow Mike Pence to sit in on the phone call with Putin, over fears that Trump is too beholden to the Russian leader. And after the phone call, that distrust took a turn for the worse.", "The story linked to the following message, which was posted on 28 January 2017 (Palmer says the \"unholy trinity\" refers to RNC chair Reince Priebus, House Speaker Paul Ryan and Vice President Mike Pence):", "#UnholyTrinity insistence to monitor Putin call was due to concern POTUS hasn't told full story about Putin attempts at blackmail.", "— Rogue POTUS Staff (@RoguePOTUSStaff) January 28, 2017", "The \"attempts at blackmail\" seem to be a reference to a dossier filled with claims about alleged ties between Russia and Trump, none of which has been verified.", "The \"Rogue POTUS Staff\" Twitter feed is a stream of what appear to be observations from one or more persons on the inside of the president's circle:", "Attempts to get POTUS to work on policy failed. Retreats to residence, skulking over McCain/Lindsey announcement and public protests.", "— Rogue POTUS Staff (@RoguePOTUSStaff) January 29, 2017", "Suspicion that Bannon urging POTUS to egg on protests, then call in National Guard to disperse, as demonstration of power. #resistpeacefully", "— Rogue POTUS Staff (@RoguePOTUSStaff) January 29, 2017", "That Twitter user also claims statements made are prescient, thereby proving validity:", "Rumors are true. Expect by end of the week. https://t.co/Mx89ZaY4ND", "— Rogue POTUS Staff (@RoguePOTUSStaff) January 30, 2017", "(The above statement claimed Trump would sign an executive order curtailing LGBT rights, which turned out to be false.) Because the identity of the person using the Twitter account is unknown and the allegations in the referenced dossier are unverified, no substantive evidence proves the claim that Trump's advisers believe he is compromised and is misleading them about it. Nor does it prove whether the Twitter user is indeed an insider, or just a very observant monitor of the news.", "Palmer, Bill.   \"Insider: Donald Trump’s Top Advisors Now Believe He’s Misleading Them on Russia Blackmail.\"\r\n    The Palmer Report.   28 January 2017.", "Bensinger, Ken et al.   \"These Reports Allege Trump Has Deep Ties to Russia.\"\r\n    BuzzFeed.   10 January 2017.", "Borger, Julian. \"John McCain Passes Dossier Alleging Secret Trump-Russia Contacts to FBI.\"\r\nThe Guardian. 11 January 2017.", "Edelman, Eric. \"Trump's Victory Could Give Russia Another Win.\"\r\nForeign Policy. 16 November 2016.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]