["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A new ad in Iowa claims the estate tax forces family farms and small businesses to be sold instead of passed down.", "However, the vast majority of farmers won’t owe anything in estate taxes.", "Provisions exist in the tax code to ease the tax’s burden, if one is owed, and to extend payments over 15 years.", "In a recent advertisement making rounds in Iowa online and on television, the National Republican Senatorial Committee targets Iowa’s Democratic U.S. Senate candidate Theresa Greenfield’s support for an estate tax.", "Dubbing the tax the Pelosi-Greenfield Death Tax, the advertisement says, \"This unfair tax would punish family farms and small businesses, forcing them to be sold off instead of passed on to the next generation.\"", "The ad references an op-ed by Greenfield in the Valley News in October 2017, when she was running in the Democratic primary for Iowa’s 3rd Congressional District. Greenfield’s article argues that a proposed tax bill, in which Republicans were trying to eliminate estate taxes entirely, would be a win for wealthy Americans and corporations, not farmers.", "The National Republican Senatorial Committee’s claim gets made frequently by those who see the estate tax as being unfair, and we’ve dealt with it several times from different perspectives in previous fact-checks. We zero in, here, on the claim made in the presumed competitive U.S. Senate race in Iowa that an estate tax would punish family farms and small businesses.", "The estate tax — in place in various iterations since 1916 — is a federal tax on property and asset transfers after the death of the owner. Some states impose their own estate taxes on top of the federal tax but Iowa does not.", "The tax only applies to estates valued above a specified amount, which has risen substantially in the past two decades. In 2000, estates worth more than $675,000 were subject to an estate tax, which would be worth a little more than $1 million in today’s dollars. But, the exempt value has risen beyond inflation-adjusted levels — to $5.49 million by 2017, when Greenfield’s op-ed was written.", "In 2018, the Tax Cuts and Jobs Act doubled the exemption on taxable estates and indexed it for inflation to $11.58 million. Tax cuts in the act will sunset after 2025 unless Congress decides to extend them or pass another tax bill.", "The exemption doubles if the estate is owned by a couple, so family farms and businesses owned jointly won’t pay a tax on an inherited estate unless the estate is valued above $23.16 million.", "Does the estate tax put a strain on small businesses and family farms, forcing them to sell to pay off the tax? The data says no.", "Family farms and small businesses are largely exempt from the tax because they usually don’t have enough assets to meet the minimum value for a tax.", "Of the 5,500 taxable estates in 2017, when the taxable value was $5.49 million, 80 were small farms and businesses, according to the Tax Policy Center, a Washington-based non-partisan think tank. The center defined a small business as one with farm and business assets totaling less than $5 million and making up at least half the estate.", "Since 2018,  the Tax Policy Center estimated 1,900 estates every year have been subject to the tax. None fell under the center’s definition of a small business, but about 140 had business and farm assets making up at least half the estate, according to the estimates.", "The U.S. Department of Agriculture estimated that 0.6 percent of the 38,106 farm estates created nationally in 2018 were required to file an estate tax return when the exemption was $11.18 million, and only 0.35 percent — 133 farms — ended up paying any taxes.", "Asked for comment, the National Republican Senatorial Committee referred to five sources, including an American Farm Bureau position statement arguing for repealing the tax. The statement says 91 percent of farm assets are tied up in land, equipment and buildings and not liquid, leaving farmers short of cash to pay an estate tax. The statement doesn’t provide evidence that this is a common occurrence. But the committee points to Kevin Kester, the former president of the National Cattlemen’s Beef Association, who wrote a 2017 opinion piece in U.S. News, saying his family would have to sell parts of its 22,000-acre California ranch to pay a $2 million tax bill when he inherited his ranch.", "The Republican Senatorial Committee also pointed to an open letter from 2001 that was penned by economist Milton Friedman arguing for a repeal of the tax. The letter was reissued in 2017 and signed by 727 economists.", "It’s true that there’s a cost associated with complying with the tax when it is owed. Wealthy families need to hire estate planners who can navigate the intricate tax code, and there are ways to structure an estate to lower the tax burden.", "Thomas Gelman, a lawyer at Phelan Tucker Law Firm who has been working in estate planning around Iowa City for 42 years, said multiple strategies exist for people — generally the wealthiest families with large estates — who are subject to the tax. They can transfer ownership of property during their lifetime, for example, or structure a family business to give up total ownership.", "\"There’s just multiple strategies about how you might accomplish that,\" Gelman said in an interview. \"And yes, they can become somewhat expensive and complicated to implement, but the federal estate tax is 40 percent. So, on every dollar you save tax on, you're saving 40 cents. And for people with enormous wealth, it usually justifies the effort.\"", "Heirs of small businesses and farms can defer tax payments, excluding interest, for up to five years after filing a return, and can pay what’s left in installments over 10 years. Small farms  also can be valued at their farm use value rather than fair market value, which assesses land based on how much it produces versus how much it could be sold for on the open market. This allows for additional exemptions of more than $1 million when passed down.", "Leonard Burman, a Tax Policy Center economist, said in a Daily Iowan interview the likelihood the tax would force family farmers or small-business owners to sell their assets is essentially nonexistent. \"If you have a farm that, by itself, would be subject to the estate tax, it’s a giant estate in California, it’s not a corn farm in Iowa,\" he said.", "The average size of a farm in Iowa was 351 acres in 2017, according to the U.S. Department of Agriculture. Combine that with the average value of Iowa farmland — $7,432 an acre, according to a 2019 Iowa State University survey — and you get an average farm value of about $2.6 million. Even when accounting for real estate, equipment, and other assets, this is a far cry from the $23 million that would make a couple-owned farm subject to the tax, the data shows.", "Gelman said that in 42 years of practicing estate planning, he hasn’t encountered a situation where a family had to sell a farm or business in order to pay the tax, though he has had clients who were subject to the tax take advantage of the provisions outlined above.", "\"The current federal estate tax, with the exemptions that are now applicable, do not force small farmers, in my experience, to have to sell off their farm,\" he said.", "The NRSC advertisement said the tax would \"punish family farms and small businesses, forcing them to be sold off instead of passed on to the next generation.\"", "Estate planning to prepare for the tax can be costly, and the few families that are subject to it do have an associated burden. With few liquid assets, very large farms like Kester’s could run into trouble paying the tax, but the ad left out the crucial fact that only a tiny fraction of farms and businesses will ever see a tax on their estates.", "Most family farms in Iowa are below the threshold that triggers an estate tax. There are also several mechanisms, specifically for small businesses and farms, to reduce the amount owed and extend the payment window when a tax is owed.", "While it’s possible that a handful of Iowa family farms and small businesses may be subject to the estate tax, it’s hard to find evidence that the tax is forcing average farmers and business owners to sell their estates. We rated this claim Mostly False.", "Phone interview with Leonard Burman, economist at the Tax Policy Center", "Phone interviews with Thomas Gelman, Iowa City lawyer", "National Republican Senatorial Committee, Family Traditions advertisement", "The Valley News, Greenfield says GOP tax plan won’t work for rural Iowans by Theresa Greenfield, Nov. 13, 2017", "Tax Policy Center, Who Pays the Estate Tax?", "Tax Policy Center, How Many People Pay the Estate Tax?", "U.S. Department of Agriculture, Federal Estate Taxes", "U.S. Department of Agriculture, Iowa Ag News — Farms and Land in Farms", "Iowa State University, 2019 ISU Land Value Survey", "Internal Revenue Service, Instructions for Form 706", "Internal Revenue Service, Estate Tax", "Congressional Research Service, Recent Changes in the Estate and Gift Tax Provisions", "Congressional Budget Office, \"Effects of the Federal Estate Tax on Farms and Small Businesses,\" July 2005.", "Des Moines Register, \"Iowa Poll: Theresa Greenfield leads Joni Ernst in tight race for U.S. Senate,\" by Brianne Pfannenstiel, June 13, 2020.", "Washington Post, \"Is the estate tax killing small farms and businesses?\" by Glenn Kessler, April 14, 2015.", "American Farm Bureau, Estate Tax Repeal", "U.S. News, An Unfair Burden to Farmers, by Kevin Kester, Oct. 3, 2017", "Friedmanletter.org, An Open Letter From Economists on the Estate Tax", "Beef. It’s What’s For Dinner, Kester Family", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]