["About this rating", "An age-old urban legend that claims cracking one’s knuckles will lead to arthritis may be old in every middle school child’s repertoire, but a look at the scientific literature finds that there is little evidence to suggest any level of truth to this myth.", "Knuckle or metacarpophalangeal (MCP) joint-cracking is a manipulation of the joint, either made through movement or by applying force. As a result, the characteristic “crack, pop, clunk, clink, crepitus, or snap” sound may issue from the knuckles.", "For decades, medical experts weren’t exactly sure what caused the telltale popping sound, and it is largely unclear whether there is any therapeutic benefit to cracking the knuckles, or if popping joints may be detrimental. Generally speaking, however, there is little evidence to suggest that cracking the knuckles leads to arthritis. But to understand why it is not widely believed that cracking the knuckles will result in arthritis, we must first understand what creates that distinctive sound in the first place.", "There are three types of joints in the human body: fibrous, cartilaginous, and synovial. A synovial joint is characterized as a cavity that is filled with connective tissue and synovial fluid, or joint lubrication, that is made up of about 15% gas. This gas is what leads to a process known as cavitation, in which carbon dioxide, oxygen and nitrogen bubbles contained within the synovial fluid collapse on themselves — but do not fully burst — creating a cracking sound. And if you’re unable to crack your knuckles consecutively, you’re not alone. After these gaseous bubbles collapse, what is known as a “refractory period” occurs where the gases that have been released from or contracted within the synovial fluid are reabsorbed. (On average, it takes a person about 20 minutes before they are able to crack their knuckles again.)", "The theory of cavitation was first proposed in 1971 in the peer-reviewed journal Annals of the Rheumatic Diseases. It was widely accepted as the leading cause until research published in the journal PLOS One in 2015 described real-time magnetic resonance imaging (MRI) that showed the knuckles cracking and in doing so, argued that the popping sound was actually the result of an expansion of the cavity rather than the collapse of a pre-existing bubble.", "The same hand following cracking with the addition of a post-cracking distraction force (right). Note the dark, interarticular void (yellow arrow). PLOS One", "That theory was largely turned on its head in 2018 when a study published in Scientific Reports turned to mathematical equations to once again reaffirm that the cracking sound comes from a collapse of bubbles.", "“Despite over sixty years of research, the source of the knuckle-cracking sound continues to be debated due to inconclusive experimental evidence as a result of limitations in the temporal resolution of non-invasive physiological imaging techniques,” wrote the study authors.", "This mathematical model showed how the knuckle-popping sound was generated and measured the acoustic signature, which in turn matched the sound measurements of cavitation bubble collapse.", "It is worth noting that another, less common cause of knuckle-popping is the snapping of tendons or scar tissue.", "In theory, this release of energy in the knuckles could damage the joints and their cartilage, as well as cause a strain on the ligaments and soft tissue – but there is no conclusive evidence to suggest that the collapsing of gaseous bubbles causes such injuries.", "“There is no evidence that cracking knuckles causes any damage such as arthritis in the joints. However, a couple of reports in the medical literature are available associating knuckle-cracking with injury of the ligaments surrounding the joint or dislocation of the tendons (attachments of muscles to bones) which improved with conservative treatment,” said Dr. Dimitrios Pappas in an interview with the Johns Hopkins Arthritis Center.", "A systematic review of research published in a 2018 issue of Clinical Anatomy further confirms that there is not enough evidence to link knuckle-popping and arthritis, despite decades of related research.", "For example, one 1975 study found that of 15 patients with a self-reported history of knuckle cracking, only one was diagnosed with degenerative joint disease. And the list goes on. Another cross-sectional study conducted in 1990 evaluated 300 participants for hand dysfunction and arthritis but did not find a significant difference in the prevalence of arthritis between those who do and do not habitually crack their knuckles.", "Perhaps some of the best evidence came from a 2011 case-controlled study that identified arthritis in the right-hand radiographs of participants between the ages of 50 and 89 and compared these radiographs were compared with those taken of people who did not have the disease. Once again, the prevalence of arthritis was similar in patients who cracked their knuckles (18%) and those who did not (21.5%).", "And a 2016 study that examined the effects of habitual knuckle-cracking on grip strength found no difference between those who crack and those who don’t while researchers the following year again found no difference in physical hand health between knuckle-crackers and not.", "“There is agreement in the literature regarding the formation of a bubble as part of the mechanism of knuckle cracking; however, the process by which the bubble is formed and the source of the cracking sound is not clear,” wrote the review authors in Clinical Anatomy. “The evidence for the association of knuckle cracking and osteoarthritis comes mainly from observational studies that have failed to show an association.”", "In short, there is no evidence to suggest that those who pop their knuckles are any more likely to develop arthritis than those who do not.", "Madison Dapcevich is a freelance contributor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]