["About this rating", "In recent years, many states in the U.S. have responded to multiple incidents of mass shootings by passing \"red flag laws\" intended to provide a means by which potentially dangerous (and armed) persons could be legally restricted prior to their engaging in harmful acts:", "They are state laws that authorize courts to issue a special type of protection order, allowing the police to temporarily confiscate firearms from people who are deemed by a judge to be a danger to themselves or to others.", "Often, the request for the order will come from relatives or friends concerned about a loved one who owns one or more guns and has expressed suicidal thoughts or discussed shooting people. The authorities may also request an order.", "How long the guns are taken away under these “extreme risk protection orders” depends on the circumstances, and can usually be extended only after another court hearing. The orders also bar the person they cover from purchasing guns", "In general, red flag laws authorize courts to issue a special type of protection order that allows police to temporarily confiscate firearms from persons deemed by judges to be a danger to themselves or to others. Advocates argue that such laws can help save lives without infringing on civil liberties, while opponents maintain that \"red flag\" seizures violate constitutional due process guarantees.", "In February 2018, a few weeks after a mass shooting at Stoneman Douglas High School in Florida left 17 people dead, U.S. President Donald Trump and Vice President Mike Pence Trump met with lawmakers to discuss the subjects of gun laws and school safety. Nikolas Cruz, the suspected shooter, had been able to legally purchase an AR-15 style semi-automatic rifle even though local police had previously received multiple calls about his potentially dangerous behavior, a subject that Trump and Pence discussed at that meeting.", "As can be seen in this video clip, Pence began speaking on the subject of how red flag laws were one mechanism that might provide \"local law enforcement additional tools if an individual is reported to be a potential danger\" while still allowing for due process. Trump interrupted and twice expressed the desirability of being able to take firearms away from citizens first and not involving the courts until afterward:", "Pence: Well, the category you spoke about Mr. President -- the gun violence restraining orders as they're called -- California actually has a version of this, and I think you ... in your meeting with governors earlier this week, individually and as a group we spoke about the state's taking steps. But the focus is to literally give families and give local law enforcement additional tools if an individual is reported to be a potential danger to themselves or others. Allow due process so that no one's rights are trampled, but [allow] the ability to go to court, obtain an order, and then collect not only the firearms, but any weapons in the possession ...", "Trump: We're going to take the firearms first and then go to court, because that's another system. Because a lot of times by the time you go to court ... it takes so long to go to court to get the due process procedures. I like taking the guns early, like in this crazy man's case that just took place in Florida; he had a lot of fires [and] they saw everything. To go to court would have taken a long time, so you could do exactly what you're saying but take the guns first, go through due process second.", "What Trump might have meant by his interjection here is difficult to discern. Critics of red flag laws have argued that even though court proceedings may be required before firearms are confiscated from residents, those proceedings don't meet the standards of \"due process\" because respondents are not guaranteed representation in court (since such proceedings are civil rather than criminal), and they do not have the right to fully argue their cases in court before confiscation orders are issued and acted upon.", "Perhaps Trump meant that initial court involvement should only be cursory in such cases to facilitate the necessity of acting quickly, while fuller court hearings could wait until after the potential danger has been neutralized. But the language he used certainly sounded to many like Trump was advocating that law enforcement be allowed to confiscate guns from citizens without any prior court involvement whatsoever.", "Vasilogambros, Matt.   \"Red Flag Laws Spur Debate Over Due Process.\"\r\n    The Pew Charitable Trusts.   4 September 2019.", "Williams, Timothy.   \"What Are ‘Red Flag’ Gun Laws, And How Do They Work?\"\r\n    The New York Times.   6 August 2019.", "Samuels, Brett.   \"Trump: 'Take the Guns First, Go Through Due Process Second.'\r\n    The Hill.   28 February 2018.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]