["About this rating", "We first encountered this item in April 2003, during the early days of the war in Iraq, and since then it has been passed from inbox to inbox variously titled \"Ann Rea's Son,\" Rea's Son,\" and \"Letter from a Mom.\"  It has also been circulated in variants that change the nationalities of those involved from American to Canadian, British, and Australian:", "One of my dear sons serves in the military. I'm a very proud Mom. He is still stateside here in California. He called me yesterday to let me know how warm and welcoming people were to him and his troops everywhere he goes. Telling me how people shake their hands, and thank them for being willing to serve and fight, for not only our own freedoms, but so that others may have them also.", "But he also told me about an incident in the grocery store where he stopped yesterday, on his way home from the base. He said that ahead of several people in front of him stood a woman dressed in a burkha. He said when she got to the cashier she loudly remarked about the U.S. flag lapel pin the cashier wore on her smock.", "The cashier reached up and touched the pin, and said, \"Yes, I always wear it.\"", "The woman in the burkha then asked the cashier when she was going to stop bombing her countrymen, explaining that she was an Iraqi.", "A gentleman standing behind my son stepped forward, putting his arm around my son's shoulders, and nodding towards my son, said in a calm and gentle voice to the Iraqi woman, \"Lady, hundreds of  thousands of men and women like this young man have fought and died so that you could stand here, in MY country and accuse a checkout cashier of bombing your Countrymen. It is my belief that, had you been this outspoken in YOUR OWN country, we wouldn't need to be there today.  But, hey! if you have now learned how to speak out so loudly and clearly, I'll gladly pay your way back to Iraq so you can straighten out the mess you are obviously here to avoid.\"", "Everyone in line, and within hearing distance, cheered the older Gentleman, coming forward as they reached for their wallets. The woman in the burkha left the store in silence.", "I am, like at least some that were in the store, outraged!  But it also warmed my heart to know that we as Americans are speaking out, calmly and succinctly (finally) to those that enjoy the freedoms here in the US.", "Hooray for Ann Rea's son, hooray for that checker, hooray for the gentleman in the store for his actions, hooray for Ann Rea for sharing this with all of us.", "God Bless America and Our Troops!", "Is it a true story? There was little in it that lent itself to independent verification: other than the protagonist's being identified as \"Ann Rea's son\" in some tellings (and, much later, as \"Hunter Green's son\"), the serviceman was not named, and neither his base nor his unit was mentioned. Likewise, none of the other characters in the story had a name or was in any other way identifiable: not the patriotic cashier, the burqa-clad woman, or the outspoken older man. Indeed, neither the name of the store nor the city where the incident purportedly took place was provided.", "Some readers questioned the anecdote on the basis of its key figure being described as garbed in a burqa (a head-to-toe covering worn by women in some Islamic traditions), pointing out that someone from Iraq would be unlikely to don such a garment given that Iraq is a far more secular part of the Muslim world than the nations in which women commonly wear burqas (such as Afghanistan and Pakistan) are. They correctly point out that in the U.S. a woman clad in such a garment would be a rare sight indeed and that anyone so garbed would be unlikely to be found shopping unaccompanied by her husband or other male relative, or to be addressing those she encountered in the outspoken manner attributed to the woman in this story. Yet it is possible that the story's author confused one unfamiliar article of clothing for another, describing the woman as clad in a burqa when he meant she was wearing a chador (a quite different kind of robe) or a hijab (a head scarf), the latter more commonly donned by Muslim women in the U.S.  (Later versions of the story changed the complaining woman from an Iraqi to a generic \"Muslim.\")", "As far as we known, in all the years since this story first made the rounds no one has stepped forward to claim authorship of it or to say \"Yes, I was that soldier\" or \"My mother was that cashier\" or \"I was another customer in the store that day and saw the confrontation.\"", "When confirming evidence is lacking, one should strive to remain skeptical of what are presented as real-life accounts that state in narrative form things people are predisposed to believe, especially those tales wherein wrongdoers get their comeuppance through being told off by others. The \"ungrateful Iraqi read the riot act over her lack of appreciation for the sacrifices Americans are making for her\" is too neat an illustration of a concept held too dearly by too many not to be viewed with a dose of suspicion.", "Cruz, Gilbert.   \"A Brief History of the Flag Lapel Pin.\"\r\n    Time.   3 July 2008.", "Emling, Shelley.   \"Should TV Journalists Be Flying the Flag?\"\r\n    The Atlanta Constitution.   25 September 2001   (p. D1).", "Malkin, Michelle.   \"Media's Blind Eye Missing a Parade of Red-White-Blue.\"\r\n    Reuters.   7 October 2001   (p. V5).", "Turegano, Preston.   \"Too Much Red, White and Blue on TV News for Objectivity?\"\r\n    The San Diego Union-Tribune.   2 October 2001   (p. E1).", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]