["About this rating", "President Trump visited with Pediatric Cancer patient Emilee Imbar during his trip to Israel.", "Trump didn't disappear for hours to visit Imbar. The meeting took place at the Yad Vashem Holocaust memorial, where the President delivered a speech, and only lasted for a few minutes.", "President Trump's international tour in May 2017 generated plenty of stories — some real and some fake — but one incident largely unreported by American news outlets was his visit with Pediatric Cancer Patient Emilee Imbar:", "During President Donald Trump’s roughly 27 hours in Israel this week, his schedule was so packed that only things of the utmost importance could be included.", "That included the dream of a 14-year-old girl who has been waging a seven-year fight against cancer.", "Although ignored in most mainstream media accounts of Trump’s whirlwind visit, the president and first lady Melania Trump took time to meet with Emilee Imbar, whose dream it was to meet Trump.", "It's true that Trump visited with Pediatric Cancer Patient Emilee Imbar during his trip to Israel, but the circumstances around the meeting were misreported by some outlets. For instance, Freedom Daily claimed that Trump \"slipped out of sight for a few hours\" to visit with Imbar.", "A story on Fox News pundit Sean Hannity's web site also made it seem as if Trump had paused his official visit in order to meet with Imbar:", "Donald Trump took time from his non-stop, jam-packed schedule while in Israel to visit a teenage cancer patient who desperately wanted to meet the American President while he was visiting the Middle East.", "In reality, Trump met with Imbar for a few moments at Yad Vashem, Israel’s memorial to the victims of the Holocaust, after delivering a speech on 23 May 2017. Shimi Gashaid, the Director of Rachashei Lev, told Israeli television network Hidabrut:", "On Tuesday Emily’s dream came true and she got to meet the president in a side room in Yad Vashem. The meeting lasted a few minutes in which President Trump asked Emily about her health and how she’s doing. He also thanked Emily for a drawing she made for him and gave him at the meeting.", "Shimi Gashaid said: “This was one of the most dramatic meetings I’ve seen. We were happy to see the heartfelt feelings of President Trump. The response of the White House staff was serious and positive, already from the first time I turned to them, Gashaid added. “We sat in Yad Vashem in the first row, along with the first tier of the White House staff. After Trump’s speech the emotional meeting took place in a side room of Yad Vashem.”", "Although it's true that this story was largely absent from the mainstream media, this isn't indicative of a \"media blackout\" of the event. In fact, the Jewish TV Network Hidabut noted that President Trump met with Imbar with \"little fanfare.\" The media did report on another hospital visit by Melania Trump -- the day after President Trump met with Imbar, the First Lady visited a children's hospital in Belgium.", "Rachashei Lev posted a picture of the meeting, which also included First Lady Melania Trump and Israel Prime Minister Benjamin Netanyahu, to their Facebook page:", "Rachashei Lev also posted an image of Emilee Imbar's letter:", "Yeshiva World News.   \"Trump In Israel Gave ‘Rachashei Lev’ Pediatric Cancer Patient Her Dream.\"\r\n    24 May 2017.", "Green, Naamah.   \"At Yad Vashem, Trump Also Honored Emily.\"\r\n    Hidabrut.   24 May 2017.", "Klein, Betsy.   \"Young Boy Learns of Heart Donor After Melania Trump Visit.\"\r\n    CNN.   24 May 2017.", "Hannity.com staff.  \"The Media Ignored This Touching Story During President Trump’s Visit to Israel.\" The   Sean Hannity Show.  25 May 2017.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]