["Jon Stewart and Andrew Napolitano debated Abraham Lincoln and the Civil War recently. We decided to fact-check several claims.", "Buying slaves to set them free is a much better fit with libertarian thinking than the use of force. That’s why in his recent debate with The Daily Show’s Jon Stewart, libertarian pundit Andrew Napolitano argued that Lincoln \"could have bought the slaves.\"", "\"Buying the slaves’ freedom is not as true as you might believe,\" Stewart rebutted. \"He offered them money for their slaves, in the border states -- those are the ones that hadn’t even seceded yet -- and they refused.\"", "We’re checking several claims from the debate between Napolitano and Stewart. Here, we’re looking at Stewart’s claim that  Abraham Lincoln tried to buy slaves freedom in border states, but the states \"all rejected it.\"", "We asked Columbia University historian Eric Foner.", "\"During the first two years of the war Lincoln repeatedly offered ‘compensated emancipation’ to the border slave states that remained in the Union and any Confederate states interested,\" Foner said. \"But they all rejected it. Lincoln was willing to pay but Southerners were not willing to give up their slaves, for money or for any other reason.\"", "We enlisted the help of historians, and history buffs on reddit, and they pointed us to Lincoln’s request to Congress in 1862 for money to buy the freedom of slaves. Here’s how that proposal began:", "\"Resolved that the United States ought to co-operate with any state which may adopt gradual abolishment of slavery, giving to such state pecuniary aid, to be used by such state in its discretion, to compensate for the inconveniences public and private, produced by such change of system.\"", "Republicans passed that over the objection of Democrats. Richard Striner, professor of history at Washington College, wrote that this resolution was Lincoln’s second attempt to pay slave owners to free their slaves. A year earlier, he had tried to get Delaware to pass a bill that would have cleared the way for Washington to spend $719,200 to free the state’s entire slave population, about 1,800 at that time. The bill failed in the Delaware Legislature.", "In one odd case, Lincoln personally offered to buy a slave from an owner in Kentucky. Kentucky was on the Union side but was unwilling to emancipate the slaves that lived there. In late 1862, when an escaped slave found refuge with a Union army regiment, and the Kentucky owner demanded his return, Lincoln wrote to the owner, \"I will pay you any sum not to exceed $500.\"", "Unusual circumstances surrounded this move by the president. The owner was a former member of Congress and former Kentucky Supreme Court justice. Lincoln had issued the preliminary Emancipation Proclamation two months earlier and wanted to head off a dispute in Kentucky. As it turned out, the owner refused Lincoln’s offer. The slave was not returned.", "Our ruling", "Stewart said Lincoln tried to free slaves in the border states by buying them. The record bears this out. Lincoln tried in Delaware and won congressional approval to apply the principle to all states. But with no slave owners willing to come to the table, the effort failed. The result was the Emancipation Proclamation.", "We rate the claim True.", "Comedy Central, The Daily Show, March 11, 2014", "Email interview, Eric Foner, professor of history, Columbia University, March 16, 2014", "New York Times, Abraham Lincoln’s audacious plan, Jan. 5, 2012", "Univeristy of Michigan, Collected works of Abraham Lincoln, March 6, 1862", "Marquette Law Review, Colonel Utley's Empancipation--or, How Lincoln Offered to Buy a Slave, Summer 2010", "National Archives, Preliminary Emancipation Proclamation, Sept. 22, 1862", "Reddit, Multiple claims about slavery and the Civil War - responses", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]