["About this rating", "Ekaterina Fedyaeva died after a medical error resulted in her mistakenly being poisoned with formalin.", "Fedyaeva was not given formalin intravenously and did not experience the functional equivalent of being \"embalmed alive.\"", "On 9 April 2018, a number of tabloid-like news reports suggested that a Russian woman had been \"embalmed alive\" after doctors mistakenly administered formalin intravenously instead of saline:", "Russian woman 'embalmed alive' after being given solution with formaldehyde instead of saline drip https://t.co/ft8UNewMj7 pic.twitter.com/Gny5xg9Cbz", "— National Post (@nationalpost) April 10, 2018", "One of the first articles to appear reported that 28-year-old Ekaterina Fedyaeva had been \"embalmed alive\":", "Ekaterina Fedyaeva's mother has accused medics of 'murder' after they put her daughter on a formalin drip - a solution contain formaldehyde - instead of saline.", "She was given a drip normally infused into the veins of the dead to prevent decomposition.", "Other news reports were light on details about the medical mishap, stating only that Fedyaeva had been given \"formalin, a solution that contains formaldehyde — which is used to preserve dead bodies.\"", "An article from the Russian news agency TACC (translated) clarified the chain of events, reporting that formalin had mistakenly been used instead of saline during a relatively routine removal of ovarian cysts:", "On March 15 [2018], medical personnel mistakenly introduced formalin instead of saline into the abdominal cavity of a 28-year-old female patient during a routine operation.", "After detecting what happened, doctors performed a [cleaning] of the abdominal cavity to remove the substance from the body. The next day, the woman was transferred to the Ulyanovsk Regional Clinical Hospital, then for the most effective course of treatment the patient was sent to the FGBU of the State Scientific Center of the All-Russian Medical Center named after A.I. Burnazyan FMBA of Russia. As previously reported, investigators of the regional SS of the Criminal Code initiated a criminal case of causing serious harm to human health through negligence as a result of improper performance by a person of their professional duties (Article 118 of the Criminal Code of the Russian Federation).", "The routine surgery took place on 15 March 2018. Early local reports contradicted the repeated claim that Fedyaeva was placed on a \"formalin drip,\" stating that an \"unknown nurse\" washed the surgical site with formalin instead of saline. Four days later, Fedyaeva was transported to Moscow where doctors worked to undo the damage caused by the administered formalin, but the patient succumbed to her injuries on 5 April 2018.", "Ongoing accounts published by local news sources provide a relatively clear timeline. No formalin drip was substituted for saline, nor was the patient injected with formalin. Initial English-language reports claimed Fedyaeva had been \"given a drip normally infused into the veins of the dead to prevent decomposition,\" suggesting that the medical mishap amounted to an accidental embalming, but according to morticians that was not even close to the case.", "In an assessment of the claims, mortician Caleb Wilde wrote that a \"slow, intravenous drip of formalin would have ripped apart the insides of Ekaterina Fedyaeva.\" Wilde repeated his skepticism that the story occurred in the manner reported, adding that \"formalin has a potent smell ... that burns when you breathe it in ... whoever put formalin in the IV bag (and I don’t know the protocols for filling IV bags) were either without a sense of smell, extremely dense, or they did it on purpose\":", "This per the often unreliable tabloid The Sun, “Ekaterina Fedyaeva was said to be undergoing routine surgery at a hospital in Ulyanovsk, in the Volga Federal District of Russia, when the hospital provided her on a formalin drip, which contains formaldehyde and is used to prevent corpses from decomposing.”", "I’m still hoping that this is some elaborate hoax. But it doesn’t seem to be. This is a once in a billion kind of mistake that could have only been made through a confluence of poorly designed and poorly practiced medical protocols.", "Pure formalin is a much strong[er] solution that the embalming fluid we use on dead bodies.", "Formaldehyde is a naturally occurring gas that is highly dissolvable in water. When it is dissolved in water, it’s called “formalin”, which is the liquid that was intravenously given to Ekaterina. Formalin is 40% formaldehyde.", "Embalming fluid is rated by formaldehyde index: strong embalming fluid has an index of 28% to 36%, medium fluid has an index of 19% to 27%, and weak fluid is 10% to 18% index. Even our strongest embalming fluid has less formaldehyde than pure formalin, and even much less when we mix the embalming fluid with water.", "After we mix the embalming fluid with water, the solution has a much lower amount of formaldehyde, often around 2%. In other words, what was injected into Ekaterina — if it was formalin with 40% formaldehyde — could have been up to 20 times stronger than the embalming fluid I would use in my prep room.", "With arterial fluid that is 2%, I can effectively harden and preserve most cases. This is how it happens: “Formaldehyde or glutaraldehyde fixes tissue or cells by irreversibly connecting a primary amine group in a protein molecule with a nearby nitrogen in a protein or DNA molecule through a -CH2- linkage called a Schiff base” ... To put it simply: formaldehyde literally rips apart tissue on a molecular level.", "Formalin or formaldehyde is extremely toxic and can easily be absorbed through the skin.", "Intravenous (or IV) fluids are used to infuse medications or fluids into the bloodstream of a living person. This process is effective for the living because of the process of circulation. As Wilde notes, the procedures of embalming differ dramatically from those of IV administration.", "Although embalming fluid (which is around five percent formaldehyde) is eventually introduced via a completely different apparatus, that process takes place only after the cadaver is drained of blood and fluids.", "Another question posed by many readers involved presence of formalin in the operating room. It is typically used for routine histology, and it was likely intended for the preservation and analysis of tissue collected during the operation. We contacted Wilde with additional questions about that subject, and he explained:", "Formalin is not something that would be found in a funeral home’s prep room. There are two main types of embalming fluids that embalmers use: one is arterial fluid and the other is cavity fluid. Arterial fluid generally comes in a 16-ounce bottle that we generally dilute in water. Formalin is 40% formaldehyde. Bottled arterial fluid ranges from a weaker 10% to a stronger 38% of formaldehyde. When we’re ready to use the arterial fluid for embalming, we then dilute it in water which should result in a fluid that is somewhere between the range of 1.5% to 2% formaldehyde. This fluid is then pumped through the arterial system by means of an embalming machine. We make an incision in an artery, which is where the arterial fluid enters. And we make an incision in a vein, which is where the blood is forced out of the deceased’s body. The embalming fluid should displace the blood and dissipate throughout the entirety of the arterial system. There are some parts of the body that aren’t thoroughly reached by the arterial system, such as the abdominal and chest cavities. For those areas, we use a large syringe-like instrument called a trocar which is the tool we use to reach the cavities. That fluid is much stronger than the arterial fluid. The cavity fluid that we use at our funeral home is 20% formaldehyde. Unlike arterial fluid, we do not dilute cavity fluid with water.", "Although I do not use formalin, I understand that it is generally injected to preserve specimens in the same way we use a trocar, except with a smaller instrument like a syringe. Unlike arterial fluid, formalin is not injected through the arterial system but through a syringe-type instrument that is fanned throughout the entirety of the tissue. Formalin is so strong that if it were injected through the arterial system with an embalming machine, I would imagine that the strength of the fluid would make distribution difficult. It’s likely that formalin would in effect cauterize the capillaries and render the embalming incomplete, resulting in some of the tissue being unreached by the fluid and more susceptible to decomposition.", "Fedyaeva's death remains under investigation, but initial reports indicated that a nurse mistakenly used formalin instead of saline to wash a surgical site. The patient was eventually transported to Moscow in efforts to reverse the damage, but she died a few days later. It appears that reports about inadvertent substitution of formalin for saline was correct, but the rest of the tragic medical mishap was misrepresented in many news accounts.", "Bever, Lindsey.   \"Her Surgery Was Supposed To Be Routine. Instead, This Russian Woman Was ‘Embalmed Alive.'\"\r\n    Washington Post.   9 April 2018.", "Jackson, Ashleigh.   \"Woman ‘Embalmed Alive’ After Tragic Hospital Mix-Up.\"\r\n    WSMV.   10 April 2018.", "Martin, Andrew.   \"Despite Risk, Embalmers Still Embrace Preservativ.\"\r\n    New York Times.   20 July 2011.", "Park-Mustacchio, Jenn.   \"I've Been An Embalmer For 14 Years And See My Share Of Bodies. Any Questions?.\"\r\n    The Guardian.   24 October 2013.", "Stewart, Will.   \"Russian Woman, 27, Dies In Agony After She Was ’Embalmed Alive’ Instead Of Being Put On Saline Drip In Hospital Blunder.\"\r\n    The Sun.   8 April 2018.", "Stewart, Will and Danyal Hussain.   \"Russian Woman, 27, Dies In Excruciating Agony After She Was 'Embalmed Alive' With A Formaldehyde-Based Drip Instead Of Being Put On Saline In A Horrific Medical Blunder.\"\r\n    Daily Mail.   8 April 2018.", "Wilde, Caleb.   \"My Thoughts On That Russian Woman Who Was 'Embalmed' Alive.\"\r\n    Confessions Of A Funeral Director.   9 April 2018.", "RT.   \"Смертельная халатность: как жительница Ульяновска умерла в больнице от введённого по ошибке формалина.\"\r\n    7 April 2018.", "TACC.   \"В Москве скончалась женщина, которой в больнице Ульяновска по ошибке ввели формалин.\"\r\n    5 April 2018.", "73Online.ru.   \"Страшная трагедия в МСЧ. Женщине после операции влили формалин вместо физраствора.\"\r\n    19 March 2018.", "73Online.ru.   \"Мама отравленной формалином Кати Федяевой: Это не ошибка, а преступление!.\"\r\n    24 March 2018.", "73Online.ru.   \"Екатерина Федяева умерла....\"\r\n    5 April 2018.", "KidsHealth.org.nz.   \"Drips (Intravenous Fluids Or Iv).\"\r\n    Accessed 10 April 2018.", "Microbiology Alliance.   \"Formaldehyde Fixatives.\"\r\n    Accessed 10 April 2018.", "Updated 11 April 2018, 1:04 P.M.: Added additional information about the embalming process, and purpose of formalin.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]