["Ever since former Vice President Joe Biden tapped Sen. Kamala Harris as his running mate, some observers have scrutinized how the pair had treated each other as competitors for their party's nomination.", "One post claims that they questioned each other's fitness to be president.", "\"So the two people who stood on stage in the Democratic debates and said the other wasn't fit to run the country......are teaming up to run it together,\" the post reads.", "The user did not respond to a request from USA TODAY for comment.", "Fact check:Claim that Biden called the Second Amendment 'obsolete' is satire", "In five debates as rivals for their party's nomination, Biden and Harris had their share of memorable moments — like their heated exchange on race.", "But neither suggested the other was unfit to lead the nation.", "A review of the transcripts from all five debates in which the pair squared off — in June, July, September, October and November 2019 — reveals neither Harris nor Biden said the other was not \"fit to run the country.\"", "Though they clashed over policy and their records, the only individual they called unfit to lead was President Donald Trump.", "Once they were no longer competitors, Biden and Harris exchanged friendly words.", "After Harris dropped out of the race on Dec. 3, Biden called her “a first-rate intellect, first-rate candidate, real competitor,\" per The New York Times.", "Harris endorsed Biden on March 8, per USA TODAY.", "\"I believe in Joe. I really believe in him, and I have known him for a long time,\" she said in a video at the time. \"One of the things that we need right now, is we need a leader who really does care about the people and who can therefore unify the people. And I believe Joe can do that.\"", "Fact check:Joe Biden did not botch the Pledge of Allegiance in speech", "Based on our research, the claim that Joe Biden and Kamala Harris said the other \"wasn't fit to run the country\" is FALSE. In five debates, neither suggested the other was unfit to lead the nation.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more."]