["About this rating", "Western Kentucky University's Student Government Association voted to give black students \"full and free access\" to the college.", "The vote was largely intended to be symbolic, and the university has confirmed it will not be implementing it as policy.", "On 25 April 2017, the American Bacon web site reported that Western Kentucky University would be granting free tuition to black students, as \"an apology\" for slavery.  The story carried the headline \"University Will Give Black Students Free Tuition as an Apology for Slavery\":", "In a nutshell: The college's student government did vote in favor of a motion that called for \"full and free access for all black people... to Western Kentucky University.\" However, the vote was not binding in any way, appears to have been largely symbolic, and the university has confirmed that it will not be implementing it as policy.", "On 11 April 2017, WKU students Andrea Ambam and Brian Anderson introduced a two-page resolution at a meeting of the Student Government Association. After a lengthy preamble, the resolution stated:", "Be it resolved that the Student Government Association at Western Kentucky University support Reparations for Black Students at WKU.  We call for a special task force to be established by the University to assess the feasibility of test-optional admissions and geographically-weighted admissions...", "...We demand reparations for the systematic denial of access to high quality educational opportunities in the form of full and free access for all black people (including undocumented, currently and formerly incarcerated people) to Western Kentucky University.", "At a meeting one week later, the motion was passed by 19 votes to 10, the Bowling Green Daily News reported.", "The following day, Brian Anderson — one of the authors of the resolution —suggested in a letter to the WKU Herald, the university's student newspaper, that the motion was primarily intended to be symbolic:", "While the resolution calls for free tuition for black students, we’re not expecting that to materialize anytime soon. What we do believe could come as a result of this legislation though, is a greater understanding from the university that more can be done for students that don’t benefit from systems that traditionally benefit white students like standardized testing for financial aid.", "The President of the Student Government Association, Jay Todd Richey, told the Bowling Green Daily News the motion was a \"conversation starter.\"", "The vote attracted national attention, with articles in Campus Report and the conservative web site The Blaze. On 20 April 2017, Tucker Carlson interviewed WKU student Andrea Ambam on his Fox News show. In that interview, Ambam —who also proposed the motion — told Carlson:", "The whole point of this resolution was to get a conversation started about reparations owed to black Americans, specifically in the form of education.", "The following day, Western Kentucky University President Gary Ransdell confirmed in a statement that the college would not be implementing free tuition for black students.", "We appreciate the Student Government Association’s interest in these issues, but it’s important to clarify that their resolution is not an official position taken by the University. I have read the SGA resolution, and I understand that their intent was to spark a conversation, but the University will not adopt any such policy.", "Despite this clarification, NBC News reported almost 10 days later:", "Black students at Western Kentucky University could potentially receive free tuition if a resolution passed by the student government is successful.", "On 25 April, the American Bacon web site claimed that WKU would \"give black students free tuition as an apology for slavery.\"", "(This is false, as had already been clarified by the university's president.)", "It is true that the college's Student Government Association did vote in favor of \"full and free access\" to Western Kentucky University for \"all black people\", as part of a proposed program of reparations.", "However, even the authors of the resolution have suggested that it had a largely symbolic purpose, and was primarily intended to spark conversation about the broader issues of racial inequality and access to higher education.", "Mudd, Aaron.  \"SGA passes resolution supporting reparations for black students.\"\r\n  Bowling Green Daily News.  19 April 2017.", "Simon, Mashaun.  \"Western Kentucky Univ. Students Pass Bill For Free Tuition as Reparations.\"\r\n  NBC News.  30 April 2017.", "Ransdell, Gary A.  \"Statement From WKU President Gary A. Ransdell on Recent Student Government Association Resolution.\"\r\n  WKU News.  20 April 2017.", "Anderson, Brian.  \"SGA Senators View Reparations Resolution as Step for Greater Understanding.\" \r\n  WKU Herald.  19 April 2017.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]