["About this rating", "On 29 October 2018, CNN host Don Lemon made comments about the terror threat posed by white men who have been radicalized by far-right extremist ideology, remarks which naturally generated controversy, particularly from commentators on the conservative side.", "Lemon's comments referred to a string of attacks carried out in October 2018 that targeted prominent Democratic figures, including former President Barack Obama and progressive philanthropist George Soros, who were sent mail bombs. Explosive devices were also sent to CNN itself. (None of those devices detonated, however.) Then, in rapid succession, two African-Americans in Kentucky and 11 Jewish people in Pennsylvania were killed in two separate attacks by avowed white supremacists.", "Lemon made the controversial remark during the transition between \"Cuomo Prime Time,\" a show hosted by Chris Cuomo, and Lemon's \"CNN Tonight,\" during which the two hosts often banter. On the day in question, Cuomo and Lemon were discussing the 24 October 2018 shooting death of Maurice Stallard, 69, and Vickie Lee Jones, 67, at a Kroger grocery store in Kentucky. Gregory Bush, the 51-year-old white man indicted for hate crimes in the shooting, allegedly attempted to enter a predominantly black church before the murders and was heard stating \"whites don't kill whites\" by a witness.", "Just four days later, on 27 October 2018, 11 people were murdered inside a Pittsburgh synagogue by another white man. The suspect, Robert Bowers, was a white nationalist who expressed anti-Semitic and racist sentiments before the shooting.", "It was against that backdrop that Lemon made the following remarks, which referenced the caravan of asylum-seekers from Honduras who were then making their way to the U.S.-Mexico border:", "I keep trying to point out to people not to demonize any one group or any one ethnicity. But we keep thinking that the biggest terror threat is something else -- some people who are marching towards the border, like it's imminent. And the last time they did this a couple hundred people came and they, you know, most of them didn't get into the country. Most of them tired -- you know got tuckered out before they even made it to the border.", "So we have to stop demonizing people and realize the biggest terror threat in this country is white men, most of them radicalized to the right, and we have to start doing something about them. There is no travel ban on them. There is no ban on, you know they had the Muslim ban, there is no white guy ban. So what do we do about that? And first of all, let me just say this. Maurice Stallard is the name. And Vickie Jones. And they have been lost in all of this, two people who were killed on Wednesday that you talked about. They have been lost about this and I know that people feel that this story has not gotten enough coverage, and we will honor them tonight in our program.", "Lemon's commentary inspired a number of conservative figures to take to social media and accuse him of racism. Fox News personality Todd Starnes, for example, tweeted, \"Is that unadulterated racism or bigotry?\" Sean Davis, co-founder of the blog The Federalist lamented, \"We have to stop demonizing people based on race or ethnicity and also white men are terrorists. This is CNN.\"", "Lemon responded to the criticism in another segment on 31 October 2018, during which he stated:", "Tonight I want to talk about an uncomfortable truth. The truth about who really carries out domestic terror attacks in this country. Earlier this week I made some comments about that in a conversation with Chris. I said that the biggest terrorist threat in this country comes from radicals on the far right, primarily white men. That angered some people. But let's put emotion aside and look at the cold, hard facts. The evidence is overwhelming.", "Lemon then cited an April 2017 study by the Government Accountability Office that reported: \"[F]rom September 12, 2001 through December 31, 2016, attacks by domestic or 'homegrown' violent extremists in the United States resulted in 225 fatalities, according to the [Extremist Crime Database]. Of these, 106 were killed by far right violent extremists in 62 separate incidents, and 119 were victims of radical Islamist violent extremists in 23 separate incidents.\"", "Lemon also cited statistics from the Anti-Defamation League which reported between 2007 and 2016, right-wing extremists were responsible for 74 percent of deaths at the hands of domestic terrorists.", "Ironically, perhaps, Lemon's show was interrupted while live on the air on 6 December 2018, after CNN's New York building was evacuated upon receipt of a bomb threat:", "We were evacuated in the middle of my live show. Bomb threat. We’re running taped programming. NYPD is investigating. Stay tuned. #cnn #nypd", "— Don Lemon (@donlemon) December 7, 2018", "Ephraim Mattos drew attention by issuing a press release stating his objections to Lemon's remarks.", "Bever, Lindsey.  \"CNN’s Don Lemon Doubles Down After Saying White Men Are ‘The Biggest Terror Threat in This Country.’\"\r\n    The Washington Post.   1 November 2018.", "Chokshi, Niraj.   \"Kroger Shooting Suspect Is Charged with Hate Crimes in Killings of 2 Black People.\"\r\n    The New York Times.   15 November 2018.", "Robertson, Campbell et al.   \"11 Killed in Synagogue Massacre; Suspect Charged with 29 Counts.\"\r\n    The New York Times.   27 October 2018.", "Lord, Rich.   \"How Robert Bowers Went from Conservative to White Nationalist.\"\r\n    Pittsburgh Post-Gazette.   10 November 2018.", "Government Accountability Office.   \"Countering Violent Extremism.\"\r\n    April 2017.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]