["About this rating", "On 10 March 2019, a Boeing 737 MAX 8 jet operated by Ethiopian Airlines crashed shortly after takeoff from the Ethiopian capital city of Addis Ababa, killing 157 people.   Shortly afterwards, a video was circulated via social media that purported to capture that horrible event:", "However, the circulated video had nothing to do with the tragedy in Ethiopia and actually showed the crash of a Boeing 747-400 cargo plane operated by National Airlines shortly after takeoff from Bagram Air Base in Afghanistan on 29 April 2013. Dramatic footage of the plane plummeting to the ground was recorded by a passing motorist:\nA cargo plane crashed in Afghanistan killing all seven crew members on board. All seven were U.S. citizens, the cargo carrier National Airlines said.\nThe crash happened shortly after takeoff from Bagram Air Base in Afghanistan, the U.S.-based company said. The Boeing 747-400 was en route to Dubai, United Arab Emirates.\n\"This was a purely cargo flight and no passengers were aboard,\" a company statement said. \"Cargo consisted of vehicles and routine general cargo.\"\nNational specializes in moving freight for the military and businesses, as well as charter passenger service in the Middle East.\n\nThe cause of the National Airlines crash was believed to have been an unstable shift in the cargo loaded on the plane:\nInvestigators sifting through the wreckage of a Boeing 747-400 cargo plane that crashed in Afghanistan on April 29 have found that several of the straps used to tie down the 16-ton MRAP fighting vehicles broke after takeoff.This has led to speculation that the massive armored vehicles shifted shortly after the civilian cargo plane took off from Bagram air base, sending it careering out of control.\nABC News reports that crash investigators believe that some of the heavy-duty nylon straps holding the Oshkosh M-ATV MRAP vehicles in place aboard the plane snapped shortly after it took off.\nIf the heavy cargo shifted dramatically as the pilots tried to climb, the crew would have been helpless to control the aircraft, aviation experts told ABC.\nThe last words the pilots radioed out was 'weight.'\n\nThis video was previously circulated, in similarly false fashion, with the claim that it depicted Malaysia Airlines Flight 17 from Amsterdam to Kuala Lumpur, which went down over eastern Ukraine on 17 July 2014, killing nearly 300 passengers and crew.  Evidence indicated that flight was shot down by a missile.", "However, the circulated video had nothing to do with the tragedy in Ethiopia and actually showed the crash of a Boeing 747-400 cargo plane operated by National Airlines shortly after takeoff from Bagram Air Base in Afghanistan on 29 April 2013. Dramatic footage of the plane plummeting to the ground was recorded by a passing motorist:", "A cargo plane crashed in Afghanistan killing all seven crew members on board. All seven were U.S. citizens, the cargo carrier National Airlines said.", "The crash happened shortly after takeoff from Bagram Air Base in Afghanistan, the U.S.-based company said. The Boeing 747-400 was en route to Dubai, United Arab Emirates.", "\"This was a purely cargo flight and no passengers were aboard,\" a company statement said. \"Cargo consisted of vehicles and routine general cargo.\"", "National specializes in moving freight for the military and businesses, as well as charter passenger service in the Middle East.", "The cause of the National Airlines crash was believed to have been an unstable shift in the cargo loaded on the plane:", "Investigators sifting through the wreckage of a Boeing 747-400 cargo plane that crashed in Afghanistan on April 29 have found that several of the straps used to tie down the 16-ton MRAP fighting vehicles broke after takeoff.This has led to speculation that the massive armored vehicles shifted shortly after the civilian cargo plane took off from Bagram air base, sending it careering out of control.", "ABC News reports that crash investigators believe that some of the heavy-duty nylon straps holding the Oshkosh M-ATV MRAP vehicles in place aboard the plane snapped shortly after it took off.", "If the heavy cargo shifted dramatically as the pilots tried to climb, the crew would have been helpless to control the aircraft, aviation experts told ABC.", "The last words the pilots radioed out was 'weight.'", "This video was previously circulated, in similarly false fashion, with the claim that it depicted Malaysia Airlines Flight 17 from Amsterdam to Kuala Lumpur, which went down over eastern Ukraine on 17 July 2014, killing nearly 300 passengers and crew.  Evidence indicated that flight was shot down by a missile.", "Meseret, Elias and Yidnek Kirubel.    \"Ethiopian Airlines Crash Kills 157, Spreads Global Grief.\"\r\n    Associated Press.   10 March 2019.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]