["By Saranac Hale Spencer", "Posted on September 9, 2020", "A meme circulating on Facebook falsely claims, “Not one politician has died from the virus.” Actually, at least five current or former politicians across the country have died due to COVID-19.", "More than 189,000 people in the U.S. have died from COVID-19, so far — including some national, state, and local politicians.", "But a meme is spreading this falsehood: “Not one politician has died from the virus, lost their job, or had their business looted.”", "Dozens of copies of the meme — which shows actor Tommy Lee Jones reading a newspaper — have been circulating on Facebook since at least July. One early version that was shared 35,000 times features the name “Mike Rilling,” which is stamped on many right-wing memes shared from a Facebook account with that name. We wrote about another one that included a made-up quote attributed to Sen. Elizabeth Warren in 2019.", "When the meme started circulating in early July, two state representatives already had died. State Rep. Bob Glanzer, of South Dakota, died on April 3 and State Rep. Reggie Bagala, of Louisiana, died on April 9. Local politicians had died, too, including Michael Yun, a councilman in Jersey City, New Jersey, who died on April 6, and Marny Xiong, chairwoman of the board of education in St. Paul, Minnesota, who died on June 7.", "Perhaps the most widely covered death of a politician came in late July, though, when former presidential candidate Herman Cain died from complications due to COVID-19 on July 30.", "Also, at least one politician had his office looted. Rep. Brendan Boyle reported on June 1 that his district office in Philadelphia had been looted during protests that followed the death of George Floyd.", "Despite easily accessed news stories that contradict the claim, the meme continues to circulate. On Sept. 4, Ben Swann — a purveyor of dubious claims and conspiracy theories that we’ve written about before — posted the meme on Facebook, with Rilling’s name removed. That version has garnered more than 3,500 shares.", "But, as we said, it’s not true. Politicians have died during the pandemic, and many more have been diagnosed with the disease, including Sen. Rand Paul, Sen. Bill Cassidy, and 14 U.S. representatives. The nonprofit, nonpartisan website Ballotpedia is keeping track of the deaths and diagnoses for public officials and politicians.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "Johns Hopkins University. Coronavirus Resource Center. Accessed 9 Sep 2020.", "Hale Spencer, Saranac. “Fake Elizabeth Warren Quote About Rape.” FactCheck.org. 29 Mar 2019.", "Associated Press. “South Dakota lawmaker dies of coronavirus.” 4 Apr 2020.", "Hughes, Clyde. “Louisiana lawmaker Reggie Bagala dies of coronavirus disease.” United Press International. 10 Apr 2020.", "Rosario, Joshua. “Jersey City Councilman Michael Yun dies after battle with COVID-19.” NJ.com. 6 Apr 2020.", "Walsh, Paul. “Marny Xiong, St. Paul school board chairwoman, dies at 31 of COVID-19.” Star Tribune. 7 Jun 2020.", "Boyle, Brendan (@RepBrendanBoyle). “If those who are currently breaking into and looting my office really want our voter registration forms because they’re in such high demand, then I would be totally cool with that.” Twitter. 1 Jun 2020.", "Blitzer, Ronn. “Former GOP presidential candidate Herman Cain dies at 74 from coronavirus complications.” Fox News Network. 30 Jul 2020.", "Thenappan, Bala. “Herman Cain Died of COVID-19, Not Cancer.” FactCheck.org. 31 Jul 2020.", "Gisales, Claudia and Audrey Carlsen. “How The Coronavirus Has Affected Individual Members Of Congress.” NPR. 28 Aug 2020.", "Ballotpedia. “Government official, politician, and candidate deaths, diagnoses, and quarantines due to the coronavirus (COVID-19) pandemic, 2020.” Accessed 8 Sep 2020.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]