["The photo was published in this Facebook post on November 29. It has been shared more than 900 times.", "The photo was published alongside another image which shows a man burning a Koran at an anti-Islam protest on November 19 in Norway.", "The post’s caption reads: \"❤️Allah says He has revealed the Quran and He will protect it❤️According To CNN & BBC News The Person Who Tried To Burn Holy Quran Has Suffered From An accident. His Both Hands Are Burned & He's in Coma. ALLAH O AKBAR (Allah is the Greatest) ?.\"", "Below is a screenshot of the misleading Facebook post:", "The same photo was published here, here, here and here on Facebook alongside a similar claim.", "The claim is false; the photo shows a man in an Oregon hospital recovering from a rare form of the plague that he contracted after being bitten by a cat.", "The same photo has previously circulated online alongside similar false claims, as debunked by AFP Indonesia in September 2019 here.", "Reverse image searches on Google and Yandex and keywords searches found the same image published in this July 18, 2012 report by The Guardian.", "Below is a screenshot of the photo in The Guardian’s report:", "The other photo in the misleading post is a screenshot from a video published here by RT, the state-funded Russian television network.", "The accompanying report states the video shows a man burning a Koran during an anti-Islam protest in Kristiansand, Norway. RT identifies the man as Lars Thorsen, the head of the Stop Islamization of Norway group that organized the protest.", "Thorsen was intercepted by a man who tried to stop the burning. The counter-protester’s face is superimposed in the top right corner of the image in the misleading Facebook post.", "“Last week, a young Muslim counter-protester tackled Lars Thorsen, the head of the Stop Islamization of Norway (SIAN), after he set a copy of the Koran on fire at an anti-Muslim rally in the city of Kristiansand. The video of the incident caused a strong reaction in Pakistan, where the man reportedly named Ilyas Umer was hailed as hero on social media for trying to “save” the most-revered book in Islam,” the RT report reads.", "Below is a screenshot of RT’s report:", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]