["About this rating", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "In July 2020, a rumor started to circulate online that typing any three-digit number followed by the words \"new cases\" into Google would return news articles or other reports about COVID-19 in search results. This, according to proponents of this claim, showed that the coronavirus pandemic was nothing more than a conspiracy theory.", "In all honesty, we had trouble following the logic of this false rumor.", "Those spreading these \"mind blowing\" search results also appeared a little unsure of what it meant. Most of the posts we encountered did not lay out any specific claims or accusations. Rather, these messages contained vague statements about how the world was being \"played.\" As best we can tell, the idea is that the Centers for Disease Control and Prevention (CDC) (or, possibly, some shadowy group of elites, George Soros, or another frequently invoked boogeyman) were gaming search results in order to inundate the population with coronavirus content and convince everyone that this \"hoax\" was in fact a real problem.", "There are, of course, a number of problems with this theory.", "Mostly true. We have not typed each of the 900 three-digit numbers (100-999) into Google followed by \"new cases,\" but we did perform a few dozen searches in this manner and in every instance we did get results related to rising COVID-19 cases. For some numbers (typically on the higher range of the three-digit set), Google had to dig back weeks or months in order to find news articles related to the specific search term.", "Not really. Although some may see (or claim to see) these search results as \"mind blowing,\" this actually isn't all that unusual considering the duration (approximately 8 months, as of this writing) and widespread impact of the COVID-19 pandemic.", "Consider this: The first case of COVID-19 in the United States was reported in January 2020. Since then, the disease has spread to all 50 states. In the approximately 200 days between the early COVID-19 cases and this writing, state, local, territorial, academic, and commercial entities have reported case numbers to the CDC. Many cities have also held daily press briefings. In addition to multiple entities recording and reporting on these numbers, there have also been national and local news outlets publishing articles on a daily basis about this data.", "Let's take a look at the math.", "If each of the 50 states issued daily reports about COVID-19 cases for 200 days, that would mean 10,000 reports could contain a three-digit number of COVID-19 cases. There are approximately 19,500 municipal governments in the United States. If every one of those governments reported a daily rise in cases over this 200 days, that's an additional 3,900,000 reports that could contain a three-digit number of COVID-19 cases. If you factor in local and national newspapers and websites (we'll use 13,000, the number of daily newspapers in circulation in 2014; the actual number is likely much higher due to an unknown number of online news websites), that's an additional 2,600,000 reports about COVID-19.", "Even if you reduced the number of possible days from 200 to 120 (lockdowns related to the COVID-19 pandemic started in March 2020), that's still millions of daily reports that could possibly show a three-digit rise in case numbers.", "It should also be noted that Google can return search results from international organizations, cities, and news outlets. In other words, there are millions of articles and reports that Google can comb through in order to find a result for each of the 900 possible three-digit numbers.", "Herein lies an even bigger hole in the conspiracy theory. Out of the dozens of social media posts we encountered from people spreading this rumor, we have not seen anyone correctly claim that the search results provided by Google were inaccurate. Our own searches resulted in genuine news articles from national and local media that cited credible sources.", "The fact that searching for any three-digit number followed by the words \"new cases\" results in genuine news articles about COVID-19 does not reveal that the world is being \"played.\" Quite the contrary: Testing this \"conspiracy theory\" actually shows that the COVID-19 pandemic is a real and widespread threat.", "This rumor appears to be an offshoot of a similar conspiracy theory that circulated last month. Previously, the word on the internet was that COVID-19 data was suspicious because a number of cities around the world had reported that there had been \"322\" cases or deaths from coronavirus. The fact that multiple locations had reported the same number of cases, according to proponents of this theory, \"proved\" that this pandemic was manufactured.", "Again, this is simply a matter of probability. With thousands of cities, states, countries, government organizations, academic institutions, and newspapers around the world reporting daily on COVID-19 cases and deaths, it is inevitable that some numbers are going to be repeated.", "USA Today reported:", "The content of the claim is ridiculous, as is the implication there is something shady or manufactured in the way these tallies are reported. The volume of media reports on COVID-19, the number of cases and the number of local and regional units of government means there is ample opportunity for tallies to add up to just about any number, particularly in the low triple digits. Google searches prove out that 322 isn’t even a particularly common number.", "Newspaper Association of America.   \"Newspaper Circulation Volume.\"\r\n    20 January 2016.", "National League of Cities.   \"Number of Municipal Governments & Population Distribution.\"\r\n    Retrieved 23 July 2020.", "CDC. \"FAQ: COVID-19 Data and Surveillance.'\"\r\n    3 June 2020.", "Charles, Craig.   \"Type Three Digit Number With 'New Cases' is Proof of COVID-19 Conspiracy? Fact Check.'\"\r\n    That's Nonsense.   16 June 2020.", "Litke, Eric.   \"Fact Check: Conspiracy Claims Linking COVID-19 Reports With the Number 322 Are Nonsense.'\"\r\n    USA Today.   16 June 2020.", "Koslof, Evan.   \"VERIFY: Here's the Real Story Behind the '322 COVID Conspiracy.'\"\r\n    WUSA9.   17 June 2020.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]