["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "The Cathedral of Christ King, located in Buckhead, opened in 1937. Archbishop Wilton Gregory has said it is one of our largest, most vibrant and fastest-growing parishes. Photo credit: Christ The King.", "Atlanta Archbishop Wilton D. Gregory has promised to find a new place to live since getting an earful from some Catholics -- and unwelcome national attention -- about his new 6,186-square-foot, $2.2 million residence on Habersham Road in Buckhead.", "In a statement he issued March 31, the archbishop said he had no desire to move to the Tudor-style mansion in the first place.", "\"However, the Cathedral parish has a problem, albeit a happy one,\" he said. \"The Cathedral of Christ the King is one of our largest, most vibrant and fastest-growing parishes — but it is landlocked.\"", "PolitiFact deemed the archbishop’s statement worthy of a fact check, given all the hoopla.", "A review of some numbers, as well as some number crunching, should settle the questions: Is it one of the largest of the 99 Catholic churches that are part of the Archdiocese of Atlanta? And is it one of the fastest-growing?", "We requested membership data for at least five years. But the bulk of what we received was from 2012 and 2013. And looking at that data and limited information that was provided from 1997, the answer to each question is yes.", "According to the Official Catholic Directory, the Cathedral of Christ the King was the second-largest church in the archdiocese in 1997, based on the number of families, or households. It had 3,505 at the time.", "Fast-forward to 2013, and the cathedral on Peachtree Road in Buckhead was the archdiocese’s third-largest parish, with 4,842 families. Only St. Michael’s in Gainesville and St. Thomas the Apostle in Smyrna were larger, with 7,054 and 6,844 families, respectively.", "The cathedral’s congregation grew 9.6 percent between summer 2012 and summer 2013, adding 426 families, according to the archdiocese’s data. By our calculations, that made it the archdiocese’s 15th-fastest-growing of all the churches that year and, among the bigger churches, the second-fastest-growing.", "St. Joseph’s in Dalton grew the most, 23.2 percent or 509 families, while more than 30 parishes in the archdiocese had virtually no growth or lost families in that same time, the data show.", "The cathedral was built in French Gothic architectural style and named \"the most beautiful building in Atlanta\" by Architectural Record in 1939, two years after its completion. Some would say it remains a contender today.", "Members of the parish come from more than 150 ZIP codes in metro Atlanta. Priests at the cathedral presided over more than 1,200 daily Masses, 624 weekend Masses, more than 500 Baptisms, 128 weddings and 49 funerals in 2013. Seven adult choirs and four children’s choirs chimed in at many of these events.", "The cathedral became part of the recent controversy after Joseph Mitchell, a parishioner at Christ the King and the nephew of \"Gone With the Wind\" author Margaret Mitchell, left $15 million and his home on tony Habersham Road to the archdiocese.", "Mitchell requested that the archdiocese use the inheritance for \"general religious and charitable purposes.\" He also asked that Christ the King get primary consideration.", "The cathedral was given $7.5 million for its building program and spent $1.9 million of that to buy the archbishop’s longtime residence nearby on West Wesley Road.", "The goal was to convert the archbishop’s old home into a rectory, or residence, for the cathedral’s six priests. That would allow the rectory that’s on the cathedral’s campus to eventually be replaced with worship and meeting space. (The cathedral is effectively landlocked. It’s surrounded by streets on three sides, and it is restricted from developing on its east side for 20 years. That was part of a deal negotiated with the neighborhood that allowed the church to develop a youth recreation area.)", "Meanwhile, Mitchell’s home on Habersham Road was torn down. In its place and with part of the proceeds from the sale of the West Wesley residence, the archbishop’s new $2.2 million mansion was built, equipped with two dining rooms, an elevator and a second-floor safe, or panic room.", "Gregory, long-rumored to be a candidate on the short list to succeed soon-to-be-retiring Chicago Bishop Francis George, moved to the new residence on Habersham in January.", "He initially defended the move, which critics said went against Pope Francis’ call for modest living. He later apologized.", "\"I am disappointed that, while my advisers and I were able to justify this project fiscally, logistically and practically, I personally failed to project the cost in terms of my own integrity and pastoral credibility with the people of God of north and central Georgia,\" Gregory wrote.", "The archbishop promised to sell the house and move elsewhere. We’re told that’s still the plan today.", "In summary: We decided to fact-check the archbishop’s statement largely on two points: Is the Cathedral of Christ the King one of the archdiocese’s largest churches? And is it one of the diocese’s fastest-growing churches.", "The data we were provided say yes. But they allowed only a limited comparison, and the information could not be independently verified.", "We rate the archbishop’s statement Mostly True.", "Top 10 parishes in 2013", "1997 Registration Data", "2013 Registration Data", "% Growth", "# Growth", "St. Michael, Gainesville", "1,500", "7,054", "370%", "5,554", "St. Thomas the Apostle", "1,514", "6,844", "352%", "5,330", "Cathedral of Christ the King", "3,505", "4,842", "38%", "1,337", "St. Joseph, Marietta", "2,053", "4,804", "134%", "2,751", "Our Lady of the Americas", "Mission of IHM, Data not Recorded", "4,665", "St. Ann", "3,960", "4,381", "11%", "421", "Transfiguration", "2,700", "4,323", "60%", "1,623", "St. Brigid", "Did not exist", "4,056", "St. Benedict", "2,604", "4,004", "54%", "1,400", "St. Thomas Aquinas", "2,524", "3,930", "56%", "1,406", "Source: Archdiocese of Atlanta", "Sources:", "Statement by Archbishop Wilton D. Gregory, The Georgia Bulletin", "Emails and phone interviews with Pat Chivers, spokeswoman for the Archdiocese of Atlanta", "Spreadsheet of church data, provided by the archdiocese", "\"Archbishop calls meeting to discuss mansion,\" by Mark Davis, \"The Atlanta Journal-Constitution,", "\"Archbishop apologizes for $2.2 million mansion,\" by Mark Davis, The Atlanta Journal-Constitution,", "\"Archbishop Wilton D. Gregory Will Sell Residence,\" statement on the website of the Archdiocese of Atlanta, dated April 5, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]