["Correction and update May 28, 2019: A previous version of this fact-check said that the photo of the two men was manipulated based on the analysis of a photo forensics expert. That determination has since been challenged by other photo forensics experts who say the image is authentic. French publisher AFP has since published a story quoting the men appearing in the photo. The men did not challenge the image's authenticity. We can no longer support the claim that the photo has been manipulated, and have removed that suggestion from this fact-check. The rating of the fact-check, which analyzes the claim that two Muslims were laughing as Notre Dame burned, remains Pants on Fire. The updated story is below.", "You can read more about the reporting of this story in a separate report.", "As Notre Dame burned in Paris, images of people grieving while they watched a fire damage the iconic cathedral started to populate social media feeds.", "\"It is like losing a member of one’s own family,\" one man told the New York Times, which reported onlookers were gasping, covering their mouths in horror and wiping away tears.", "But one image being shared on Facebook, among other platforms, is an image of two men who appear to be smiling as they duck under police tape with Notre Dame in flames behind them.", "\"Muslims laughing while Notre Dame is burning…\" said one account that posted the photo to Facebook on April 15.", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "That’s because posters didn’t  know anything about the men in the photo—what they’re doing and if they are Muslim, notably.", "Searching for the picture online, we found it posted on the website of Sputnik, a news site run by the Russian government. The image of the men, which has a Sputnik copyright symbol below it, is part of a 9:29 p.m. update about the fire that says \"evacuation underway at Notre Dame Cathedral, Paris’ Ile de la Cite.\" The post includes no description or caption information for the men, nor does it describe their attitude or religion.", "That image then spread across the internet, where others used it to support claims that the cathedral fire was a terrorist attack and fueled anti-Muslim rhetoric.", "The photo appeared on the website Red White and F You! With Mindy Robinson, which featured a story on the top of its homepage April 16 titled, \"Notre Dame Cathedral is Burning...and the Media refuses to state the obvious (it’s terrorism).\" (The fire’s cause is under investigation but still unknown.)", "\"Laughing and smiling,\" Robinson writes about the image with the men. \"Man, I sure do wonder what specific group of people stood to gain from all this #heavyMFsarcasm.\"", "One Twitter user described them as \"Extremist Muslims.\"", "But another Twitter user reached out to @HoaxEye about the image. The account is run by Janne Ahlberg from Finland, according to the Twitter bio, with the aim of debunking hoaxes. The tagline of the HoaxEye website: \"A fake image is worth zero words.\"", "When the user asked Ahlberg about the photo, Ahlberg replied, \"Saying that this is a photo of persons ‘laughing while Notre Dame is on fire’ is just appalling. (As far as I know) we don’t know yet anything about these persons, situation etc.\"", "In a statement, Sputnik said \"The men seen in the photograph are not mentioned once throughout the article and are of no relevance at all to the story. That other news organisations should seek to find an alternative meaning to this picture is the very definition of fake news. We are also shocked by comments made by these media outlets judging the religion of these two men solely by their appearance.\"", "We rate this Facebook post Pants on Fire.", "Facebook post, April 15, 2019", "The New York Times, \"Fire mauls beloved Notre-Dame cathedral in Paris,\" April 15, 2019", "The New York Times, \"Notre-Dame found structurally sound after fire, as investigation begins,\" April 16, 2019", "Red White and F You!, \"Notre Dame Cathedral is Burning...and the Media refuses to state the obvious (it’s terrorism),\" April 15, 2019", "Sputnik, \"Live updates: Massive fire engulfs iconic Notre Dame Cathedral (photo, video),\" April 15, 2019", "Tweet, April 16, 2019", "TheLibel.ie, \"Muslim man snapped laughing in Paris just 3 months before Notre Dame fire,\" April 16, 2019", "Email interview with Jeff Smith, associate director, National Center for Media Forensics, April 16, 2019", "Email interview with Catalin Grigoras, director, National Center for Media Forensics, April 16, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]