["By Lori Robertson", "Posted on January 4, 2019", "Democrats say the Trump administration is asking for more money for a border wall even though it has spent only 6 percent of the funds that Congress has appropriated for border security over the past two years. That’s misleading. About 60 percent has been awarded to contracts.", "This talking point raises wonky aspects of the federal budget process. But Democrats gloss over the fact that most of the money has been obligated and most has been specifically awarded to contracts.", "Andrew Meehan, a spokesman for U.S. Customs and Border Protection, told us that “CBP has obligated more than 90% of the funds provided in FY 2017 and 2018.” An “obligation” is “[a] definite commitment that creates a legal liability,” according to the Government Accountability Office. “An agency incurs an obligation, for example, when it places an order, signs a contract, awards a grant, purchases a service, or takes other actions that require the government to make payments to the public or from one government account to another,” GAO explains.", "More specifically, “nearly 60% of those funds are obligated onto a contract – referred to as contract award – by the U.S. Army Corps of Engineers,” Meehan said. The expenditure occurs after the work is completed, “making expenditure an inaccurate measure of execution,” he said in an email to FactCheck.org.", "The Democrats focus only on those actual expenditures. In an interview on ABC’s “This Week” on Dec. 23, Sen. Jeff Merkley said the president was “sitting on over $1 billion, 94 percent of what we sent him last year for border security he hasn’t bothered to spend. If you’re not going to spend nine out of 10 dollars on an issue, you obviously don’t care about it that much. This is politics, not policy.”", "But the president wasn’t “sitting on” all of that money. Some actions had been taken to transfer funds to the Army Corps of Engineers and further to award contracts. When we asked Merkley’s office about that, spokeswoman Martina McLennan responded: “Of the $1.3 billion Congress appropriated in FY18, as of the latest data Congress received from the Administration on November 26th, only 6 percent has been ‘expended,’ a term which means the same as ‘spent.’ While the Administration argues they have signed contracts with companies for more of the funds, those contracts do not mean funds have been spent, and construction has not yet even started on any of the projects obligated for the $1.3 billion Congress appropriated in FY18, which ended in September.”", "Let’s go through the numbers, provided by CBP.", "The fiscal year 2017 and 2018 appropriations included a total of $1.7 billion to CBP for new and replacement border fencing and barriers. And nearly all of that has been obligated to the U.S. Army Corps of Engineers. About $300 million is yet to be awarded to a contract, but was on hold during the government shutdown, Meehan said. And there was $175 million left for CBP “project management” support.", "Specifically, of the $341 million appropriated in fiscal 2017, $300 million was on contract by late December 2018, and 35 of the 40 miles of scheduled replacement pedestrian and vehicle barriers had been completed. The fiscal 2018 appropriations included $1.375 billion for 82 miles of new and replacement barriers. By July 2018, CBP had obligated — essentially transferred — $1.2 billion to the Army Corps. And by Dec. 31, 2018, nearly $700 million of that had been awarded to contracts.", "The Washington Post Fact Checker wrote about this issue on Jan. 3, tracing the Democratic talking point back to a Dec. 10 statement by Sen. Patrick J. Leahy. A member of Leahy’s staff told the Post that the obligations to the Army Corps amounted to just “a bureaucratic shift to another government agency.” But then, of course, there are the actual contract awards.", "CBP says nearly 60 percent had been awarded to contracts, and that’s documented by various CBP press releases on such contracts, as the Fact Checker noted.", "McLennan, in Merkley’s office, argues that the lack of actual expenditures shows the administration is “severely backlogged in their ability or interest in actually doing this work, which again begs the question why they would need $5 billion more for FY19.” But CBP’s Meehan told us the fiscal 2018 funds were obligated in less than nine months, a period of time he called “the equivalent of light speed in the federal contracting world.”", "In fact, the 2018 appropriations bill was belatedly signed into law on March 23, 2018 — that’s nearly six months after fiscal 2018 started on Oct. 1, 2017.", "Joshua Gordon, policy director at the Concord Coalition, a nonpartisan organization that advocates fiscal responsibility, told us this is one of the problems with the budgeting process. Agencies face difficulties when there are continuing resolutions and late passage of appropriations bills, “sometimes so late in the fiscal year, it’s almost impossible to get things done in that fiscal year.”", "Gordon says while the Concord Coalition primarily looks at outlays — which occur when the checks from the government actually clear — in this mini-controversy, the contracted amount “makes the most sense as a measuring stick.”", "One “piece of irony,” he notes, is that “it seems like the government shutdown is actually going to hamper the ability to get some of these contracts done.”", "Meanwhile, President Donald Trump claimed in the Jan. 2 cabinet meeting that he and Acting Defense Secretary Patrick Shanahan had instituted a new system to not pay government contractors if their work was unsatisfactory.", "“Somebody said that we didn’t spend the money,” the president began. “Well, we have spent it, but we don’t pay contractors before they finish the job. That’s one of the other things that Pat and I sort of instituted. We like to have people do the work. … We pay it when it’s finished so they do a good job. This way, if they don’t do a good job, we don’t pay them.”", "We asked the White House press office if and when the president had instituted such a new policy, and we didn’t receive a response.", "But the president had a point when he said, “not all of the money has been paid, but the money has been used.” About 60 percent has been awarded to contracts.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]