["The claim was published on Facebook here on May 8, 2020. It has been shared more than 21,000 times.", "The post's Thai-language caption translates to English in part as: “Thailand is the only developing country which is in the top ten list of the GHS Index by ranking as number 6 in the world and number 1 in Asia, meaning that Thailand has ranked no. 1 in the COVID-19 fight category, possessing the crown for the world champion in terms of pandemic prevention and has the lowest number of infected cases at present.”", "A similar claim about Thailand’s ranking was also shared on Facebook here, here, here, and here.", "But the claim is misleading.", "The Global Health Security Index was published in October 2019, months before the outbreak of COVID-19. The report describes itself as “the first comprehensive assessment and benchmarking of health security and related capabilities across the 195 countries”.", "In the report, Thailand is the highest ranking Asian country and the 6th most prepared country worldwide for an infectious disease outbreak. The GHS, however, has not been updated to reflect the COVID-19 pandemic and does not rank countries in any “COVID-19 fight category,” as claimed in the misleading posts.", "Below is a screenshot of the report’s pre-COVID-19 ranking categories:", "The misleading posts’ claim that Thailand has “the lowest number of infected cases” is also false, both in Asia and worldwide.", "As of May 15, 2020, Thailand has 3,018 confirmed cases on COVID-19, according to World Health Organization figures. Several regional countries -- including Cambodia, Vietnam, Myanmar, Nepal and Sri Lanka -- all have lower levels of confirmed infections to date.", "WHO Thailand specialist Dr. Richard Brown told AFP by email on May 15, 2020 that “it is incorrect to say that Thailand has the lowest number of cases of COVID-19 globally”.", "“Thailand has a total of 3017 cumulative cases confirmed to date and 56 deaths as of 12 May 2020. Looking at other countries in the region, where number of cases are lower than Thailand, Vietnam for instance has 288 confirmed cases and zero deaths. In Myanmar there have been 180 confirmed cases and six deaths.”", "The same findings are reflected in figures published by US-based John Hopkins University researchers.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]