["About this rating", "August 2016 saw the circulation of rumors holding that the Ford Motor Company had donated a large sum of money (typically between one and 100 million dollars) directly to the Black Lives Matter movement:", "TIME FOR BOYCOTT! Ford Just Gave $100 MILLION To THIS Radical Hate Group", "Ford used to be one of the most highly-respected and longest-running companies in the United States. Now, the automaker is not only shipping a huge portion of its jobs overseas, it is giving away an enormous sum of money to a separatist and racist hate group.", "Ford just donated $100 million dollars to Black Lives Matter.", "A (since removed) blog post published by Allen B. West's blog on 11 August 2016 called for a boycott of the automaker over the issue:", "Ford is investing in the Black-Led Movement Fund in partnership with Borealis Philanthropy Movement Strategy Center, and Benedict Consulting.", "Well, if you were ever looking for a reason not to buy a Ford vehicle or to trade one in you already have, this seems to be just as good as any.", "Looks like another American icon just caved to the liberal agenda. We see how well that worked out for Target…", "Hopefully enough people will express displeasure over this to prompt Ford to stop playing politics and get back to making cars.", "<!--\nHowever, the claim was resurrected by the unreliable American News on 24 September 2016 (during then-current high-profile Black Lives Matter protests), prompting a new wave of consumers threatening to boycott Ford over Black Lives Matter on Ford Motor Company's Facebook page:", "The claims appeared to stem from an 11 August 2016 article in Fortune, which was admittedly ambiguous in its reporting with respect to the Ford Foundation versus the Ford Motor Company:", "More than 50 organizations have already registered their support [for the Movement for Black Lives (M4BL)], but one, in particular, stands out. The Ford Foundation added their voice to the growing chorus of supporters, in the strongest possible terms.", "But the [Ford Foundation] is also planning on studying and underwriting what it calls a “new and dynamic form of social justice leadership and infrastructure,” by investing in the Black-Led Movement Fund, (BLMF) a pooled donor fund designed to support the work of the Movement for Black Lives (M4BL), and led by Borealis Philanthropy.", "In the first paragraph above, Fortune erroneously linked the word \"Ford\" in \"Ford Foundation\"  to the web site of the Ford Motor Company:", "The origins of the rumor lay with a 19 July 2016 announcement from the Ford Foundation titled \"Why black lives matter to philanthropy\" explaining why that foundation had \"made six-year investments in the organizations and networks that compose the Movement for Black Lives\":", "We are living in anxious, often frightening times. Earlier this month, the deaths of Philando Castile and Alton Sterling sparked a new round of public protest against the toxic blend of racism, hypermasculinity, and state violence that has taken the lives of too many black men and women and people of color in the US. At one protest in Dallas, a lone gunman killed five police officers—Lorne Ahrens, Michael Krol, Michael J. Smith, Brent Thompson, and Patrick Zamarripa. We’ve seen reductive attempts to frame the murders in Dallas as a confrontation between protesters and law enforcement, but that obscures the larger democratic principles at play: The officers died while protecting the right to freedom of expression and peaceful protest, and are inexorably linked to Philando Castile and Alton Sterling.", "These events — added to so many others, including the fatal shootings of three police officers in Baton Rouge on Sunday morning — have the potential to either deepen empathy and understanding among Americans or divide us even more sharply along lines of race, ethnicity, and gender. That’s why now is the time to stand by and amplify movements rooted in love, compassion, and dignity for all people. Now is the time to call for an end to state violence directed at communities of color. And now is the time to advocate for investment in public services — including but not limited to police reform — together with education, health, and employment in communities and for people that have historically had less opportunity and access to all those things.These are the reasons we support the Movement for Black Lives.", "However, the flaw in claiming that the Ford Motor Company donated millions of dollars to the Black Lives Matter movement is two-fold. First, although the philanthropic Ford Foundation is so named because it was created and originally funded by automobile icon Henry Ford (along with his son Edsel) and because the foundation was a large holder of Ford stock, those associations ended many years ago. No member of the Ford family or Ford Motor Company management sits on the Ford Foundation Board of Trustees, and the Ford Foundation began selling off its Ford Motor Company stock in the mid-1950's (a process that was completed in 1974). The completely separate Ford Motor Company Fund and Community Services is the current philanthropic arm of the Ford Motor Company.", "Second, although they may have common goals, the Black Lives Matter movement and the Movement for Black Lives are not the same thing. The latter is not a single group or movement, but rather \"a coalition of over 50 black-led organizations\":", "Black humanity and dignity requires black political will and power. In response to the sustained and increasingly visible violence against Black communities in the U.S. and globally, a collective of more than 50 organizations representing thousands of Black people from across the country have come together with renewed energy and purpose to articulate a common vision and agenda. We are a collective that centers and is rooted in Black communities, but we recognize we have a shared struggle with all oppressed people; collective liberation will be a product of all of our work.", "Some of the blog posts responsible for the spread of the rumor that the Ford Motor Company had given millions of dollars to Black Lives Matter were later edited to note that the Ford Foundation and Ford Motor Company had long since parted ways, but by then the claim had already been loosed into the wilds of social media, and the important distinction between the two entities was lost as the rumor traveled from blog to blog.", "McGirt, Ellen.   \"Who Is Funding Black Lives Matter.\"\r\n    Fortune.   8 August 2016.", "Yasui, Luna and Brook Kelly-Green.   \"Why Black Lives Matter to Philanthropy.\"\r\n    Ford Foundation Equals Change Blog.   19 July 2016.", "Ford Foundation.   \"A Legacy of Social Justice.\"\r\n    (Undated.)", "Ford Foundation.   \"History.\"\r\n    (Undated.)", "Ford Motor Company.   \"The Ford Motor Company Fund and Community Services.\"\r\n    (Undated.)", "Funding Universe.   \"The Ford Foundation History.\"\r\n    (Undated.)", "Borealis Philanthropy.   \"Black-Led Movement Fund.\"\r\n    (Undated.)", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]