["About this rating", "At 9:52 a.m. on 28 November 2016, an Ohio State University student from Somalia named Abdul Razak Ali Artan ran down several people with his car on the Columbus campus, then exited the vehicle and threatened others with a large knife or machete before he was shot dead by a state police officer. Eleven people were injured in the vehicular attack.", "Initial reports, however — including a warning tweet from the OSU Emergency Management office — erroneously identified the attack weapon as a gun:", "Buckeye Alert: Active Shooter on campus. Run Hide Fight. Watts Hall. 19th and College.", "— OSU Emergency Mngmnt (@OSU_EMFP) November 28, 2016", "And early news coverage replicated the error. Associated Press reported that at least eight victims were hospitalized after a \"shooting\" at Ohio State:", "On the basis of those erroneous initial reports, Sen. Tim Kaine (D-Va.) tweeted a message of support for those injured in what he termed a \"senseless act of gun violence\":", "Deeply saddened by the senseless act of gun violence at Ohio State this morning. Praying for the injured and the entire Buckeye community — Senator Tim Kaine (@timkaine) November 28, 2016", "Kaine's tweet immediately met with partisan attacks which ignored the fact that the type of weapon had been misreported at first. For example, the conservative news web site Breitbart accused Kaine of \"politicizing\" the incident to condemn gun ownership:", "The Washington Times did likewise:", "However, both those outlets (like many others) had themselves initially reported the attack as a shooting. This is how the story originally looked on Breitbart. for example:", "And, although the Washington Times replaced its own erroneous report with an updated page, its URL still contains the original error:", "https://www.washingtontimes.com/news/2016/nov/28/ohio-state-university-active-shooter-campus/", "For his part, Kaine issued an update as soon as he became aware that the earlier \"shooting\" reports were mistaken:", "Updated reports say attacker used a vehicle & knife. Horrifying & senseless. Relieved the scene is secure & praying for victims' recovery https://t.co/CzKRjM3qlO", "— Senator Tim Kaine (@timkaine) November 28, 2016", "Grinberg, Emanuella, Prokupecz, Shimon and Yan, Holly.   \"Ohio State University: Attacker Killed, 11 Hospitalized After Campus Attack.\"\r\nCNN.   28 November 2016.", "Noble, Andrea.   \"Police Investigate Motive of Ohio State Attacker.\"\r\nThe Washington Times.   28 November 2016.", "Associated Press.   \"At Least 8 Taken to Hospital in Ohio State\r\n28 November 2016.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]