["This October 2, 2019, Facebook post has been shared more than 12,000 times.", "It contains five pictures showing a person holding an Indonesian flag.", "Below is the screenshot of the misleading post:", "Translated to English, the caption of the post reads: “A vocational high school student is internationally famous.”", "The student in the photos was one of the protesters in a recent mass rally in Jakarta which opposed controversial bills and laws, ending with a clash between protesters and police.", "The original photo of the student clutching an Indonesian flag was taken by a photographer of Indonesian news outlet Kompas and published on Kompas website here.", "The photo caption, translated from Indonesian to English, reads: “Students protest to oppose the criminal law bill behind the parliamentary building, Palmerah, West Jakarta, Wednesday, September 25, 2019.”", "Below is a screenshot of the Kompas photo:", "The Kompas photographer Gary Lotululung, who took the photo, also posted the picture on his Twitter account here.", "A student carries the national flag during a demonstration against the government's proposed change in its criminal code laws outside the Indonesian Parliament in Jakarta, Indonesia, September 25, 2019.\n\n\t\tPix: Garry Lotulung #STMmelawan #HidupMahasiswa #TolakRUUKUHP #DemoPelajar pic.twitter.com/JspSgzVJBT", "Here is an AFP report dated September 24, 2019, about the protests.", "The same set of photos has also shared here, here, here and here with the same claim.", "This October 3, 2019, news report also published the photos, with a headline: “Photo of a vocational high school student carrying an Indonesian flag has been viral, appearing in all overseas newspapers!”", "The claim is false; four of the five photos are doctored versions of unrelated images and the fifth photo was a picture of a painting done by an Indonesian artist.", "Reverse image searches on Google and Yandex, as well as keyword searches, lead to the original photos.", "In the first photo, the original image shows US Congresswoman Alexandria Ocasio-Cortez holding a poster of a pledge against oil, gas and coal industry. The photo was first published by a Twitter account called No Fossil Fuel Money on August 16, 2017, here.", ".@Ocasio2018, Alexandria Ocasio-Cortez, candidate for Congress in NY-14, just signed the #NoFossilFuelMoney pledge! https://t.co/TdvVhA8Yrx pic.twitter.com/Xx54gtbylO", "The tweet says: “.@Ocasio2018, Alexandra Ocasio-Cortez, candidate for Congress in NY-14, just signed the #NoFossilFuelMoney pledge!”", "In the original picture, Ocasio-Cortez is holding a sign that says: “I pledge not to take contributions from the oil, gas, and coal industry and instead prioritize the health of our families, climate, and democracy over fossil fuel industry profits.”", "Below is a screenshot comparing the first misleading image (L) and the original image (R):", "The second image shows an edited image of Dutch football coach Ruud van Nistelrooy.", "The genuine photo shows van Nistelrooy holding a copy of Liwwadders magazine and was previously published by Dutch news site Liwwadders on January 7, 2015, here.", "Below is a screenshot of the photo on Liwwadders’ website:", "The headline, translated from Dutch to English, says: “Ruud van Nistelrooy is also eagerly awaiting the latest issue of Liwwadders.”", "The caption of the photo translates to English as: “Ruud van Nistelrooy is also eagerly awaiting the next issue of Stadsblad Liwwadders. The latest issue will appear at 100 distribution points, and partly door-to-door. Do you want to place an advertisement in this well-read magazine? Call René Wijnstra for a favourable offer: 06-81 86 82 60.”", "Below is a comparison between the second misleading image (L) and the original photo on Liwwadders’ website (R):", "The third misleading image is a doctored version of a photo from this photo tweeted by British actor John Cleese on September 16, 2017, with a caption that says: “Ask me anything on @reddit_ama”.", "Ask me anything on @reddit_amahttps://t.co/ddJCDlDMMA pic.twitter.com/kxqMSv696B", "In the genuine picture, Cleese is holding a Men’s Style page of the New York Times, with a photo of American actor Jon Hamm and a headline: “Jon Hamm: The Reboot. There’s life after Don Draper.”", "Below is a screenshot comparing the third misleading image (L) and the Twitter photo (R):", "The fourth misleading image combines two photos: a photo of Italian newspaper La Repubblica’s blank front page and another picture from a Jakarta protest.", "The genuine photo of La Repubblica’s front page was previously published in this June 11, 2010, report by Radio Free Europe/Radio Liberty.", "The Ukrainian-language report explains that La Repubblica’s blank front-page on June 11, 2010, was part of Italian media’s strike to protest then prime minister Silvio Berlusconi’s proposed “gag law” that would limit not only the ability of police to wiretap and but also to punish journalists who publish the transcripts of the recordings.", "The photo caption says: “La Repubblica blank page: ‘Gag law denies citizens the right of information.”", "The original protest photo edited into La Repubblica’s front page image has been shared online since at least October 1, 2019, for example here on Twitter.", "Ibu Pertiwi\n\t\tMaafkan kami yang harus berjuang kembali untuk REVOLUSI\n\t\tSetelah reformasi itu gagal mewujudkan mimpi2 kami kelak\n\n\t\t*Best Pic*#STMmelawan #MahasiswaHarusBergerak #atmaJaya#Unisba#palmerah #JokowiHarusLengser #jokowiMUNDUR #JokowiGakMampuUrusNegara pic.twitter.com/DPiJtxqlAK", "The tweet, translated from Indonesian to English, reads:\n\t“Mother Earth,\n\tPlease forgive us who have to fight for the REVOLUTION again\n\tAfter the reform fail to fulfill our future dreams\n\t*Best Pic*”.", "Below is a screenshot comparing the fourth misleading image (L) and the photo published by Radio Liberty (R):", "The fifth image shows a painting of the high school student clutching the flag, in a black frame with gold-coloured trimmings. The same painting was also shown in this video posted on YouTube on October 5, 2019.", "The title of the video says: “Viral Painting of Vocational High School Student red-white flag Work of Betawi Artist IWAN ASWAN”.", "Betawi is an ethnic group that is considered to be indigenous of Jakarta, the Indonesian capital.", "Iwan Aswan is a Jakarta-based artist. This is his Facebook page.", "In the video, Iwan says he painted the high school student protester because he was moved after seeing the viral photo of the student on social media.", "Below is a screenshot comparing the fifth image (L) and the YouTube video (R):", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]