["About this rating", "An old purported quote from theoretical physicist Albert Einstein embarked on another lap around the internet in April 2018 as some global citizens fretted about the start of a new world war after the United States, the United Kingdom, and France launched missiles at targets in Syria:", "\"I do not know with what weapons World War III will be fought, but World War IV will be fought with sticks and stones.\" - Albert Einstein.", "This quote (or at least a version of it) dates back to the 1940s, when the first nuclear weapons were being developed. Although Albert Einstein didn't actually develop the atom bomb, his work did make such a device possible:", "Albert Einstein did not work directly on the atom bomb. But Einstein was the father of the bomb in two important ways: 1) it was his initiative which started U.S. bomb research; 2) it was his equation (E = mc2) which made the atomic bomb theoretically possible.", "His work was so entwined with the development of nuclear weapons that Time featured a picture of Einstein on their July 1946 cover, in front of an explosion with the equation \"E=mc²\" written in the mushroom cloud:", "Einstein was, in other words, well aware of how nuclear weapons could affect the world. However, although he did repeatedly warn the world about the dangers of nuclear weapons, this quote doesn't appear to be an exact record of the physicist's words and even the earliest records appear to be anecdotal. In March 1947, reports appeared about an exchange that Einstein reportedly had with a group of friends at a dinner party:", "Professor Albert Einstein was asked by friends at a recent dinner party what new weapons might be employed in World War III. Appalled at the implications, he shook his head.", "After several minutes of meditation, he said. \"I don't know what weapons might be used in World War III. But there isn't any doubt what weapons will be used in World War IV.\"", "\"And what are those?\" a guest asked.", "\"Stone spears,\" said Einstein.", "Although these reports appear to be more anecdotal than factual, an account of Einstein saying something similar is reportedly documented in the Albert Einstein Archives at the Hebrew University of Jerusalem. In 1949, Liberal Judaism published an interview entitled \"Einstein at 70\" between Einstein and his contemporary Alfred Werner, which purportedly contains a similar exchange.", "Even if Einstein expressed this exact sentiment, he was not the first to do so. In September 1946, more than six months before the quote was first attributed to Einstein, a reporter attributed this quip to an unnamed Army lieutenant:", "Joe Laitin reports that reporters at Bikini were questioning an Army Lt. about what weapons would be used in the next war. I dunno, he said, but in the war after the next war, sure as hell, they'll be using spears!", "Einstein may have been paraphrasing something he had heard earlier during his interview with Werner — or this may simply be an anecdote relaying the physicist's attitude toward nuclear weapons. Einstein was, after all, a signatory on the Russel-Einstein Manifesto, which warned about the potentially world-altering devastation of nuclear weaponry:", "It is stated on very good authority that a bomb can now be manufactured which will be 2,500 times as powerful as that which destroyed Hiroshima.", "Such a bomb, if exploded near the ground or under water, sends radio-active particles into the upper air. They sink gradually and reach the surface of the earth in the form of a deadly dust or rain. It was this dust which infected the Japanese fishermen and their catch of fish.", "No one knows how widely such lethal radio-active particles might be diffused, but the best authorities are unanimous in saying that a war with H-bombs might possibly put an end to the human race.", "We found several other instances of people making similar statements at around the same time, indicating that this was a popular opinion at that time that was evidently shared by Albert Einstein. However, we have been unable to find a direct quote from the physicist that matches this particular meme.", "Croucher, Shane.   \"World War 3 Google Searches Spike After Trump Launches Syria Missile Strike.\"     Newsweek.   16 April 2018.", "Isaacson, Walter.   \"Chain Reaction: From Einstein to the Atomic Bomb.\"     Discovery Magazine.   18 March 2008.", "The Berkshire Eagle.   \"'Stone Age' Forecast Made by Einstein.\"     18 March 1948.", "Princeton University Press.   \"The Ultimate Quotable Einstein.\"     11 October 2010. (page #280).", "The Rotaian.   \"Albert Einstein, Citizen, Princeton, New Jersey.\"     June 1948.   (page #9).", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]