["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "California Gov. Jerry Brown delivered his final State of the State Address on Jan. 25, 2018.", "Democratic Gov. Jerry Brown reeled off statistics on California’s prison spending during his final State of the State Address after a total of 16 years as governor.", "Brown, who has followed a federal court order to reduce the state’s prison overcrowding, warned legislators at the state Capitol not to simply pass more crime laws but instead consider a holistic approach to criminal justice.", "He suggested California has gone too far on prison spending since 1970.", "\"The corrections budget then was about 3 percent of the general fund. Now, it’s 8.9 percent, about $12 billion,\" Brown said.", "Was the governor right? Has California’s prison spending nearly tripled as a share of the state’s general fund budget since 1970?", "We set out on a fact check.", "Our research", "California’s 1970-71 fiscal year budget, produced under then Gov. Ronald Reagan, backs up the first part of Brown’s claim. It lists the corrections department as 2.8 percent, or nearly $40 million, of the state’s $1.4 billion general fund budget that year.", "California's 1970-71 fiscal year budget.", "Brown’s 2018-19 budget proposal, meanwhile, also supports the claim. It shows the state expects to spend 9 percent, or nearly $12 billion, of its $132 billion general fund on the corrections department. That’s up about $1 billion from prison spending two years ago.", "Franklin Zimring, a UC Berkeley criminal justice professor, called Brown’s claim about the increased share of prison spending \"absolutely true.\"", "\"California’s prison population exploded from 1980 through the late 1990s and prison building metastasized in the state,\" Zimring said. \"We went from a little over 24,000 prisoners in California prisons to over 170,000 prisoners in 2010 and 2011.\"", "Zimring attributed the increase to the state’s booming population during that period, tough sentencing laws, particularly 1994’s Three Strikes law, and the national focus on drug crimes.", "Fewer inmates, higher costs", "California has sharply cut its prison population following a 2009 U.S. Supreme Court order for California to reduce prison overcrowding. The population reached a peak of 163,000 inmates in 2006, according to the Public Policy Institute of California. The state estimates it will house an average of about 119,000 prisoners this year.", "But as the inmate numbers have dropped, state corrections spending has continued to rise. That’s, in part, because California has the highest per capita inmate cost in the nation, at an estimated $80,000 annually for 2018-19, as we examined in a recent fact check. There’s been no corresponding reduction in prison staff as inmate numbers have fallen, causing per capita costs to spike. At the same time, prison staffing costs have increased.", "Jeffrey Callison, a state prisons spokesman, told us the conditions of the court order prevent California from closing prisons even as the inmate population is reduced.", "\"So long as the order is in effect we cannot close prisons because to do so would reduce our capacity, thereby pushing us back above 137.5 percent\" level of prison crowding, Callison said in an email. That level is tied to prison capacity and defined by the court, he said.", "Our ruling", "Gov. Jerry Brown recently claimed California’s corrections budget in 1970 was \"about 3 percent of the general fund. Now, it’s 8.9 percent, about $12 billion.\"", "California’s 1970-71 fiscal year budget supports the first part of Brown’s claim, listing prison system spending as 2.8 percent of that year’s general fund.", "Brown’s budget proposal for this fiscal year, meanwhile, shows the corrections department is now estimated to be 9 percent of the general fund, or $12 billion.", "A UC Berkeley criminal justice professor told us the governor’s spending claim rings true, noting the state’s prison population exploded during the 1980s and 1990s, driven by the state’s overall population boom, strict criminal sentencing laws and a national focus on drug crimes.", "The governor’s numbers are on the mark and there’s nothing significant missing from his statement.", "We rate Brown’s claim True.", "TRUE – The statement is accurate and there’s nothing significant missing.", "Click here for more on the six PolitiFact ratings and how we select facts to check.", "Jerry Brown, State of the State Address, Jan. 25, 2018", "PolitiFact California, Mostly True: California ranks 41st on per student spending but No. 1 per prisoner, Jan. 17, 2018", "State of California, Governor’s Budget, 2018-19, Department of Corrections and Rehabilitation, Summary of Adult and Juvenile Per Capita and Staff Ratios, Accessed January 2018", "State of California, Governor’s Budget, 1970-71, Accessed January 2018", "Franklin Zimring, professor of criminal justice, UC Berkeley School of Law, interview Jan. 25, 2018", "University of California, state spending on corrections and education, fact sheet, Accessed January 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]