["Bank of America announced it would donate $1 billion over four years to communities of color and minority-owned businesses affected by COVID-19.", "The bank did not pledge to contribute any money directly to the Black Lives Matter organization.", "Amid worldwide protests against police brutality and racial inequality, Bank of America announced a pledge to donate $1 billion to help support communities of color and minority-owned businesses affected by the COVID-19 pandemic.", "But some social media users have since shared a misleading post about the bank’s pledge, falsely saying that the funds are \"war money\" for the Black Lives Matter movement.", "The post reads: \"Bank of America just pledged one billion dollars to BLM. That’s war money ladies and gentleman. It’s coming.\"", "This is wrong.", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "RELATED: Conservative pundits share false claim about Black Lives Matter, ActBlue", "The bank announced the donation pledge June 2 and said the programs will be focused on assisting people and communities of color that are disproportionately affected by the health crisis.", "Areas of focus include health, job training, skill building and retraining, small business support and housing assistance.", "\"Underlying economic and social disparities that exist have accelerated and intensified during the global pandemic,\" Bank of America CEO Brian Moynihan said in the statement. \"The events of the past week have created a sense of true urgency that has arisen across our nation, particularly in view of the racial injustices we have seen in the communities where we work and live. We all need to do more.\"", "A Bank of America spokesperson told PolitiFact the post’s claim is incorrect, and said the pledge builds on the organization’s past efforts to support economic mobility and workforce development programs, but with an added emphasis on health services during the pandemic.", "The claim, which was shared on July 17, may have stemmed from a July 16 Lou Dobbs Tonight Fox Business segment, in which Dobbs erroneously reported that Bank of America and other corporations were pledging money to Black Lives Matter.", "Dobbs issued a correction and apologized for the mistake the next day.", "\"I reported to you that Bank of America, PepsiCo, Walmart, Apple and Comcast were pledging money to Black Lives Matter. They were, rather, pledges by those companies of investments to address economic and racial inequality,\" Dobbs says in the broadcast. \"I want to apologize to each of those companies for my mistake. We apologize to you for the error.", "Facebook posts claim that Bank of America pledged to donate $1 billion to the Black Lives Matter movement.", "This isn’t true. Bank of America announced it would donate the funds over the next four years to communities of color and minority-owned businesses that have experienced a greater impact from the COVID-19 health crisis.", "We rate this False.", "Facebook post, July 17, 2020", "Bank of America, press release, June 2, 2020", "Phone interview, Bill Halldin spokesperson at Bank of America, July 22, 2020", "Fox Business, Dobbs clarifies large corporations investing in racial justice, not donating to Black Lives Matter, July 17, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]