["About this rating", "In 2019 Democrats in the New York state Legislature blocked a bill that would have expanded eligibility for an existing program that offered tuition assistance to members of Gold Star families. Also, in a small number of states, certain education and Medicaid benefits are already available to immigrants living in the country illegally who meet specified criteria.", "None of the statements in the meme was unconditionally true nationwide in the U.S. And the New York bill in question did not stop tuition assistance being provided to families of service members who were killed in combat because those benefits were already in place.", "In January 2020, Snopes readers inquired about a meme that had been circulating on Facebook since July 2019:", "The meme presented three claims, which we unpack below:", "The above-displayed meme did not specify a specific state or branch of government, implying all Democrats were responsible for the actions in question; however, the first claim in the meme (\"Democrats killed a bill for tuition assistance for children of veterans killed in battle\") was similar to one we rated \"True\" in April 2019 as it pertained to New York state.", "And regarding that bill, \"killed,\" as the meme stated, is a strong word in this context, given that similar legislation was still listed as in committee and potentially set to take effect April 1, 2020, at the time of this writing. However, it’s true that in 2019 Democrats in a committee of the state New York Assembly voted to block a bill expanding the state's tuition aid program covering so-called \"Gold Star\" families, defined as immediate relatives of service members who \"lost their lives while engaged in hostilities, as a result of an international terrorist attack, or under certain other circumstances.\" The bill proposed offering \"free tuition\" not just to Gold Star families but also to dependent family of service members who died while performing official military duties.", "To be clear: The blocked bill proposed expanding the state’s Military Enhanced Recognition Incentive and Tribute (MERIT) scholarship program to include family members of those killed or disabled in non-combat situations. The MERIT program already provides tuition and other assistance to family members of military personnel killed or disabled while engaged in (or training for) hostilities.", "In other words, the children of someone “killed in battle,” as the meme put it, would seem to qualify for the existing tuition-assistance program. The proposed extension of funding would have also covered family members who were killed or disabled while not in combat.", "It should be noted for what reason the Democrats stopped the bill. According to Newsday:", "Democrats said they did not support the Republican proposal because it was released after legislators passed the state’s $175 billion budget April 1, [2019], meaning it would have no source of funding even if it were signed into law.", "Democratic legislators said their college aid proposal would go into effect April 1, 2020, presumably giving lawmakers time to include additional spending for military family scholarships in next year’s budget.", "Not wanting to wait, Gov. Andrew Cuomo, a Democrat, announced a plan on April 17, 2019, to immediately grant tuition assistance to family members of all New York service members who were killed while performing any official duties, effectively providing a stop-gap until the new legislation took effect in 2020.", "So while Democrats did indeed block a tuition-assistance bill for families of service members who were killed or disabled outside of combat, this applied only in New York state and tuition assistance remained available to families of service members who were killed or disabled while in service.", "The second claim (\"... THEN APPROVE subsidizing the education and healthcare of Illegal Immigrants\") was similar, in part, to one we rated as \"Mixture\" in February 2019.", "As we previously reported, New York’s DREAM Act (not to be confused with proposed federal legislation of the same name) allows undocumented high school students to qualify for in-state, college-tuition assistance to public universities and community colleges.", "Again, this legislation applied only to New York state.", "It is true that some Medicaid and Children’s Health Insurance Program (CHIP) benefits have been extended, with various conditions and exceptions, to immigrants of varying status in a few states, including New York.", "While the idea of promising health care to \"undocumented\" immigrants has certainly received support among Democratic presidential candidates leading up to the 2020 election, it is not a nationwide benefit, as the meme may suggest.", "Finally, it’s worth noting that the order of events presented in the meme is misleading, as the New York state DREAM Act was passed before the tuition-assistance bill.", "Given the kernels of truth presented in this overall oversimplified and misleading presentation, we rate this claim as \"Mixture.\"", "The New York State Senate.   \"Senate Bill S5187.\"\r\n    Accessed 03 February 2020.", "National Immigration Law Center.   \"Medical Assistance Programs for Immigrants in Various States\"\r\n    Accessed 03 February 2020.", "Campbell, Joe.   “New York to Make College Tuition Aid Available to ‘DREAMers.'”\r\n    Democrat & Chronicle. 23 January 2019.", "Military One Source.   \"Scholarship Opportunities for Surviving Family Members.\"\r\n    Accessed 03 February 2020.", "Evans, Martin C.   \"State Senate Dems Tout Bill to Aid Dependents of Fallen Vets Pay for College.\"\r\n    Newsday.  15 April 2019.", "Bond Huberman is a former editor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]