["About this rating", "Chinese-manufactured robots are very popular on the internet for their many impressive and lifelike feats, but one story really took us for a spin. A video of a pair of ballroom dancers went viral, with many claiming that the performers were not real, but were in fact robots created in China that were performing at the Shanghai Disneyland resort.", "Snopes readers sent us the same video of the couple dancing, with the woman in a white dress and her partner in coattails. Many asked us to confirm if they were, indeed, robots. You can watch the video, tweeted by the verified account of an Indian politician and actor, below:", "The tweet claims that these dancers were \"robots made in China,\" and this five minute performance was broadcast at Shanghai Disneyland. The same language has been circulating in others' tweets when sharing this video.", "The origin of this performance was actually a 2013 clip from British television show “Strictly Come Dancing\" that aired on BBC One. The performers were Abbey Clancy and Aljaž Škorjanec, who were dancing the Viennese waltz. You can see the performance shared from the official BBC YouTube account:", "https://www.youtube.com/watch?v=MpcAIFNVFfM&feature=youtu.be", "This false rumor is similar to another one from 2019 that claimed Chinese classical dancer Qin Xi was actually a robot performing at Shanghai’s Disneyland.", "Given that the actual video shows two very real people dancing on a British television show, and not two robots, we rate this claim as “False.”", "Nur Nasreen Ibrahim is a reporter with experience working in television, international news coverage, fact checking, and creative writing.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]