["By Eugene Kiely", "Posted on February 9, 2017 | Updated on February 9, 2017", "President Donald Trump falsely claimed a Democratic senator “misrepresents” a conversation that the senator had with Trump’s Supreme Court nominee, Judge Neil Gorsuch. In fact, Gorsuch’s spokesman confirmed the senator’s account.", "Gorsuch, a federal appeals court judge, has begun meeting with senators who will vote on his nomination.", "On Feb. 8, Gorsuch met with Sen. Richard Blumenthal, a Connecticut Democrat, who later told reporters that he asked the judge about Trump’s Twitter attacks on a federal judge who issued a temporary restraining order blocking the president’s immigration order. In a series of tweets, Trump attacked Judge James Robart as a “so-called judge” and warned that Robart’s ruling “put our country in such peril.”", "“If something happens blame him and court system,” Trump tweeted about Robart, an appointee of President George W. Bush.", "At a closed meeting with Blumenthal, Gorsuch told the senator that he found Trump’s remarks about Robart and the court “disheartening” and “demoralizing,” as reported by Bloomberg News and others.", "Trump accused Blumenthal of lying in a tweet on the morning after the senator’s meeting with Gorsuch.", "Sen.Richard Blumenthal, who never fought in Vietnam when he said for years he had (major lie),now misrepresents what Judge Gorsuch told him?", "— Donald J. Trump (@realDonaldTrump) February 9, 2017", "The only problem: Gorsuch’s office confirmed Blumenthal’s account, as reported by Bloomberg News, the Washington Post and others.", "Bloomberg News, Feb. 8: Ron Bonjean, a spokesman aiding Gorsuch in the confirmation process, confirmed Blumenthal’s account of their conversation in an e-mail and said Gorsuch “used the words disheartening and demoralizing.”", "Update, Feb. 9: Former Sen. Kelly Ayotte, who is guiding Gorsuch as he meets with senators, issued a statement that sought to clarify Gorsuch’s remarks. According to Fox News, Ayotte said the judge made it “very clear” in all of his meetings with senators that “any criticism” of judicial independence is “disheartening and demoralizing.”", "Fox News, Feb. 9: “Judge Gorsuch has made it very clear in all of his discussions with senators, including Senator Blumenthal, that he could not comment on any specific cases and that judicial ethics prevent him from commenting on political matters,” Ayotte said. “He has also emphasized the importance of an independent judiciary, and while he made clear that he was not referring to any specific case, he said that he finds any criticism of a judge’s integrity and independence disheartening and demoralizing.”", "FactCheck.org Rating:", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]