["By Vanessa Schipani", "Posted on May 25, 2018", "During a recent hearing on the role of innovation in addressing climate change, several Republicans made faulty claims about the climate, past and present:", "The congressmen — all members of the House Science, Space and Technology Committee — made their claims while questioning Philip Duffy, a physicist and the president of the Woods Hole Research Center, a climate change think tank. On a number of occasions, Duffy contested what the Republicans said, to no avail. We’ll take their claims one by one.", "Brooks, the congressman from Alabama, made two false claims during the hearing — one about river sediments and cliff rocks and another about ice in Antarctica — both during a debate with Duffy about the causes of sea level rise.", "Brooks asked why “sea levels have risen” since “human beings have been on the planet.” Duffy then correctly explained that “sea levels over the last 3 million years have gone up and down in line with the cycles of ice ages.”", "During their exchange, Duffy also said that “ground subsidence” is “a factor in some regions.” Ground subsidence, or the sinking of land, does contribute to land loss in some regions, such as in Louisiana, which we wrote about in March 2017.", "But those answers didn’t satisfy Brooks, so he pointed to factors he believed are causing sea level rise.", "Brooks, May 16: What about erosion? Every single year that we’re on Earth, you have huge tons of silt deposited by the Mississippi River, by the Amazon River, by the Nile, by every major river system and, for that matter, creek, all the way down to the smallest systems. And every time you have that soil or rock, or whatever is it, that is deposited into the seas, that forces the sea levels to rise because now you’ve got less space in those oceans because the bottom is moving up. What about the White Cliffs of Dover, California, where you have the waves crashing against the shoreline, and time and time again you’re having the cliffs crash into the sea? All of that displaces water which forces it to rise. Does it not?", "Duffy’s response: “I’m pretty sure that on human time scales those are minuscule effects.” Duffy is right again, as we’ll explain.", "Brooks doubled-down on these claims in a May 19 op-ed published on the news site AL.com. “Over the history of planet Earth, far and away the #1 cause of sea level rise has been erosion and its resulting deposits of sediment and rocks into the world’s seas and oceans,” he wrote, adding, “There is no close second cause of sea level rise.”", "This is false.", "According to a 2017 report by the U.S. Global Change Research Program, global sea level rise is “primarily driven by two factors,” both directly related to global warming.", "First, the oceans are expanding because water swells as it gets warmer. According the National Oceanic and Atmospheric Administration, the “oceans are absorbing more than 90 percent of the increased atmospheric heat associated with emissions from human activity.”", "Second, there’s also more water in the oceans because mountain glaciers and the Antarctic and Greenland ice sheets are melting, explains the 2017 report.", "We asked Steven Goodbred Jr., an environmental scientist at Vanderbilt University whom we interviewed for another piece on sea level rise, for his take on Brooks’ claim. He did say that “sediment does displace water,” but it has a minuscule effect “on shorter time scales (<100 years) due to the small volume of sediment relative to the immense volume of the oceans.”", "On time scales longer than 100 years, “it has no real effect” because of a process called isostasy, where “the added weight of sediment to the oceans causes the crust to sink and the reduced weight of the sediment eroded from the land causes it to rise,” Goodbred added. In other words, there’s “no net change in water level relative to land,” he said.", "Torbjörn E. Törnqvist, a geology professor at Tulane University in New Orleans whom we spoke with for the March 2017 piece on land loss in Louisiana, gave us the same explanation, adding that Brooks’ comments “are utter nonsense.”", "This brings us to the second false claim Brooks made. As he continued his exchange with Duffy, Brooks asked “would it surprise you to know that as global temperatures rise — assuming for the moment that they do — that that actually increases the amount of ice that is collected on Antarctica?” Brooks repeated these claims in his May 19 op-ed.", "Duffy’s response: “That’s not true sir.” Duffy is right — it’s not.", "We wrote about ice levels in Antarctica and Greenland in January, after President Donald Trump falsely implied the globe’s ice caps are at “record” high levels. According to NASA, both of these ice sheets have declined in mass since 2002. “Both ice sheets have seen an acceleration of ice mass loss since 2009,” the agency adds.", "During the hearing, Brooks supported his claim by saying that he “made a trip down to Antarctica and met with National Science Foundation scientists and they all agreed with global warming and they emphasized that you’re going to have an increase in the amount of ice in Antarctica because of global warming.”", "His explanation?", "“[P]rojected global warming will LOWER sea levels because warmer Antarctic air will carry more moisture above the Antarctic land mass, and deposit that moisture in the interior of Antarctica, where it will take hundreds of years to glacially make its way to the sea,” wrote Brooks in his op-ed. NSF “scientists opined that the increase in Antarctic continental ice will more than offset the loss of ice elsewhere on planet Earth.”", "We reached out to Brooks’ office to ask for the names of the NSF-funded scientists who gave him this information, but we received no response. We also contacted multiple researchers studying the topic, and they all agreed that Brooks’ explanation was inaccurate.", "Santiago de la Peña, a researcher at Ohio State University who studies glacier dynamics, told us that, while he was there when Brooks and other politicians visited Antarctica in 2014, he did “not recall having said conversation” with Brooks.", "“Current climate models do contemplate an increase of snowfall over Antarctica in a warming scenario, which is logical given a potential increase of moisture in the atmosphere,” he added, but “the increase would be of an order of magnitude smaller than total mass loss.”", "Erin Pettit, an associate professor at the University of Alaska, Fairbanks, who studies glaciers, told us that she “did meet with the congressional visitors as a whole for about 10 minutes,” but she didn’t speak with Brooks specifically. “The vast majority of the peer reviewed papers in recent years would not agree with the congressman’s statement,” she added.", "In short, while there might be some ice gained in the interior of Antarctica, there’s a net loss because ice is retreating along the coasts at a faster rate. Other experts in this area — Eric Steig at the University of Washington, David Holland at New York University and Richard Alley at Penn State — also told us Brooks’ claim was inaccurate for the same reasons.", "We’ve written plenty of times about claims made by Rep. Lamar Smith, who is the chairman of the House science committee. But rarely, if ever, has a scientist corrected him on the spot, as Duffy did during the hearing.", "While putting up a slide showing two graphs (see image below), Smith said, “You will see that for the last 100 years sea level rise has been basically constant,” adding, “It’s been going up at about 1.8 mm per year, and you’ll see that there appears to be no correlation between the increase in the sea level and carbon emissions.”", "Duffy interjected, pointing out to Smith that he had “shown a sea level record from one location.”", "Duffy, May 16: You’ve shown a sea level record from one location.", "Smith: Right, this is San Francisco. I’ve looked at also Boston, which appears to be the same.", "Duffy: The rate of global sea level rise has accelerated and is now four times faster than it was 100 years ago.", "Smith: Is this chart inaccurate then?", "Duffy: It’s accurate, but it doesn’t represent what’s happening globally. It represents what’s happening in San Francisco.", "Smith: All of the charts I’ve seen, whether it be San Francisco, whether it be Boston, or anywhere else, show about the same degree of increase.", "Again, Duffy is right.", "First, the rate of global sea level rise is around four times faster than what it was about 100 years ago. We reached out to Duffy for support for his claim, and he sent us a study led by James Hansen, a climate scientist at Columbia University. That paper summed up previous research on the topic, which showed the average rate of sea level rise was about 0.6 millimeters per year between 1900 and 1930. Between 1993 and 2015, the rate was about 2.6 mm per year, which is 4.3 times faster — and that’s the conservative estimate.", "However, we should mention that we’ve written previously that other climate scientists have said the Hansen paper’s future projections for global sea level rise are exaggerated, one of those scientists being Michael Mann, the director of the Earth System Science Center at Penn State University. We reached out to Mann to ask him if the paper’s summary of past observations is accurate, and he confirmed that it is.", "Second, Duffy is right that sea level rise in San Francisco, or any other specific location, “doesn’t represent what’s happening globally.” As we explained in March 2017, local sea level rise takes into consideration phenomena, such as ground subsidence, not just melting ice and the thermal expansion of the oceans, which is what scientists consider when they look at rise globally.", "Plus, juxtaposing sea level rise in one location with global carbon emissions is an apples-to-oranges comparison. When you look at sea level rise globally and compare it with global temperature rise, there is a strong association, says the 2017 Global Change Research Program’s report. And as we’ve written countless times, there’s also a causal link between global temperature rise and carbon emissions from human activity.", "When we reached out to Smith’s office for comment, his spokesperson didn’t provide us with any evidence to the contrary.", "Florida Rep. Bill Posey also questioned Duffy about the Earth’s climate previous to the development of human civilization — and made several scientific misstatements along the way.", "During their exchange, Posey asked Duffy what “the temperature on Earth [was] before the last ice age,” to which Duffy responded, “Before the last ice age, the last interglacial, well, similar to what it was about 100 years ago.”", "Duffy is a little off here. According to NOAA, “global mean annual surface temperatures were warmer than preindustrial [times] by about 1° to 2°C” during the last interglacial period, which started about 125,000 years ago.", "Posey followed up by rhetorically asking, “You think? You don’t think maybe it was 30 degrees warmer when dinosaurs roamed the Earth?” As we’ll explain, he’s much more than a little off.", "Duffy then responded by correctly stating, “There certainly have been epochs in the past when global temperature was warmer than it is now.”", "There have been periods during which the Earth’s mean temperature was warmer than it is today, but Posey is wrong to say that the mean global temperature was 30 degrees warmer at any point when dinosaurs roamed.", "NOAA explains: “Our planet probably experienced its hottest temperatures in its earliest days” at more than 3000 degrees Fahrenheit about 4.54 billion years ago. Even after “those first scorching millennia,” Earth “has sometimes been much warmer than it is now,” the agency adds. NOAA points to two such periods — between 600 and 800 million years ago and about 55 to 56 million years ago.", "NOAA points out that these record periods “occurred before humans existed.” It added, “Those ancient climates would have been like nothing our species has ever seen.” But did dinosaurs roam during either of these periods?", "Dinosaurs are traditionally thought of as living between 247 and 66 million years ago, a time known as the Mesozoic Era. However, scientifically speaking, dinosaurs still exist today, as research has shown that modern-day birds are a group of dinosaurs that survived the mass extinction of dinosaurs occurring 66 million years ago.", "So, a record warm period didn’t occur when dinosaurs, as we typically think of them, roamed the Earth. Still, since modern-day birds are technically dinosaurs, one could say dinosaurs were still around about 55 to 56 million years ago. But how hot was it?", "During this period — what scientists call the Paleocene-Eocene Thermal Maximum — evidence suggests that the planet’s global mean temperature rose “by as much as 5-8°C (9-14°F) to an average temperature as high as 73°F,” NOAA explains. The global average temperature over the past few years has hovered between 58 and 59 F, or upwards of 1.5 F above the 20th century average of 57 F.", "So that comes out to, at most, around 14.5 F warmer about 55 million years ago than now — not 30 F warmer, as Posey said. In degrees Celsius, the difference would be even smaller. And it’s also worth reiterating that this warm period did not occur during the previous interglacial period — or the last ice age — about 125,000 years ago, which is what Posey first asked Duffy about.", "In short, Posey’s statement is wrong on multiple counts.", "Posey made another false claim while questioning Duffy about the cause of the last ice age.", "Posey, May 16: What caused the end of the last ice age?", "Duffy: The ice ages are caused by oscillations in the Earth’s orbital parameters.", "Posey: Yeah, the last one was caused by a cataclysmic collision of an asteroid on this planet, I believe.", "Again, Duffy is right and Posey is wrong. There are additional factors, however.", "NOAA explains, “Variations in Earth’s orbit through time have changed the amount of solar radiation Earth receives in each season.” And the warmer periods — the interglacials — “tend to occur during periods of peak solar radiation in the Northern Hemisphere summer.” But there are likely other factors at play as well.", "Pettit, at the University of Alaska, put it this way: “Ice ages in general are caused by subtle changes in the Earth’s orbit and Earth’s tilt, with complexities introduced by feedbacks within our climate system and the arrangement of the oceans and continents.”", "One example of a feedback in the climate system is the ice-albedo feedback, NOAA explains. As solar radiation increases with changes to the Earth’s orbit, it melts ice covering the planet, which, in turn, leads to more solar radiation being absorbed by surface, leading to more warmth. Why? Because ice is more reflective, or has a higher albedo, than land or water.", "So where did Posey get this idea that an asteroid caused the last ice age? We contacted his office to find out, but we never received a response.", "Posey may be confusing the cause of ice ages with the theory that asteroid impacts caused the Younger Dryas. This is a period between 11,600 and 12,900 years ago when the planet’s climate got drastically colder, explains Nature in a September 2013 article.", "But as Pettit explained to us in an email, “That theory is definitely not the leading one, but more importantly it only applies to *one* particular cold period of a thousand years at the very end of the last ice age. It did *not* cause the last ice age.”", "Toward the end of their exchange, Posey asked Duffy: “What do you say to people who theorize that the Earth, as it continues to warm, is returning to its normal temperature?” Duffy responded: “If you want to characterize a temperature above today’s temperature as normal, you’re free to do that, but that doesn’t mean that’s a planet that we want to live on.”", "Posey then replied, “I don’t want to get philosophical,” adding, “I’m trying to stay on the science here.” But the fact of the matter is — he didn’t stick to the science, and neither did Brooks nor Smith.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]