["About this rating", "In February 2020, readers asked us about 2020 Democratic presidential candidate Joe Biden's claims that he was arrested in South Africa during the 1970s during an attempt to visit the imprisoned Nelson Mandela.", "On Feb. 11, Biden held a campaign rally in Columbia, South Carolina, ahead of that state's primary election on Feb. 29. There, the former vice president said:", "This day 30 years ago, Nelson Mandela walked out of prison and entered into discussions about apartheid. I had the great honor of meeting him. I had the great honor of being arrested, with our U.N. ambassador, on the streets of Soweto, trying to get to see him on Robbens [sic] Island. When he came to the United States, when he came to the White House — to the Senate, I was chairman of the committee, and he walked in, the most incredible thing I've ever felt in my life. He walked across in that private room with the big table we have in the executive room, and he walked over. And I said \"Mr. President,\" and he leaned out and he said \"Thank you, thank you for trying to come and see me.\"", "According to  The New York Times, Biden made the \"South Africa arrest\" claim a second time on Feb. 16, while speaking at a Nevada Black Legislative Caucus event, adding on that occasion that Mandela had, years later, thanked him specifically for the efforts to visit him in prison:", "“After he got free and became president, he came to Washington and came to my office. He threw his arms around me and said, ‘I want to say thank you.’ I said, ‘What are you thanking me for, Mr. President?’ He said, ‘You tried to see me. You got arrested trying to see me.’”", "The next day, Feb. 17, Biden appeared at a campaign event in Las Vegas, Nevada. At one point, he spoke in a lighthearted way about the difficulty he had had in persuading Jill Biden to accept his marriage proposal. Eventually she agreed, Biden said, after he returned from a visit to South Africa, where he was \"trying to see Nelson Mandela and getting arrested for trying to see him, on Robbens [sic] Island.\" (Relevant section begins around 25:00).", "After a Democratic primary debate in South Carolina on Feb. 26, Biden's Deputy Campaign Manager Kate Bedingfield explained to reporters that Biden had been separated from his traveling group at the airport during a visit to South Africa in the 1970s. In doing so, Bedingfield effectively stated that Biden's claim of having been arrested was false. On Feb. 28, Biden himself admitted \"I wasn't arrested,\" claiming that instead, police at an airport in South Africa had stopped him from entering a walkway with his black Congressional colleagues. Even before those admissions, considerable evidence existed to dismiss the veracity of the former U.S. vice president's anecdote.", "Firstly, it wasn't clear when his visit to South Africa took place, and when his supposed arrest came. In his recent accounts, Biden didn't specify the year in which he claimed to have been arrested, but he did frame the incident as having taken place during a trip when he was waiting for his future wife Jill to respond to his marriage proposal. Based on accounts provided previously by both Bidens, that would date the trip in question to 1977.", "In his 2007 book \"Promises to Keep: On Life and Politics,\" Biden wrote:", "\"Jill says I must have asked her to marry me five more times, and she kept saying she needed more time. I was as patient as I knew how to be. But in 1977, as I prepared to leave on a ten-day trip to South Africa, I finally broke: 'Look,' I told her, 'I've waited long enough. I'm not going to wait any longer ...'\"", "That account was reflected in Jill Biden's 2019 book \"Where the Light Enters: Building a Family, Discovering Myself.\" There, she dated the senator's marriage ultimatum to \"one afternoon in the spring of 1977,\" and wrote that her then-boyfriend was \"heading out on a congressional delegation to South Africa.\"", "However, we found no evidence that Biden visited South Africa at all in 1977, and it appears that both Bidens might have arrived at a confused timeline of events. According to several contemporaneous news reports, Biden did visit southern Africa in late 1976.", "In December of that year, he was one of around a dozen members of Congress to attend an African-American Institute conference in the small nation of Lesotho, which is located within the territory of South Africa. If the group did not take a direct flight to Lesotho, it is likely they would have flown to a city in South Africa, potentially Johannesburg, and traveled through South African territory to arrive in Lesotho.", "Among the members of Congress with whom Biden traveled to Lesotho in 1976 were Rep. Charles Diggs, D-Michigan, and Rep. Andrew Young, D-Georgia. In 2013, Biden spoke after the death of Mandela, and stated that he had traveled to South Africa in 1977, along with Diggs and other members of the Congressional Black Caucus. In his February 2020 speech in Columbia, South Carolina, Biden specified that he had been arrested along with \"our U.N. ambassador.\" That person was Andrew Young, a member of the U.S. House of Representatives in December 1976, but appointed ambassador to the United Nations by President Jimmy Carter after his inauguration in January 1977.", "Based on those facts, a strong possibility exists that Biden, over the course of the intervening decades, has mistakenly dated his December 1976 Africa trip to 1977. His destination during that trip was actually Lesotho (the location of the African-American Institute conference), but due to that country's unusual geographic situation, the visiting Congress members would likely have traveled through South Africa to get there, and so Biden might also have become confused in his recollection of his destination during the 1976 trip.", "It's not clear why or how Jill Biden recalled the trip taking place in the spring of 1977, specifically. Young, by then U.N. ambassador, did take a high-profile trip to South Africa in late May 1977, but Biden certainly did not join him, based on several news reports that placed the Delaware senator in the United States at that time.", "We asked Biden's campaign to clear up those significant discrepancies, but we received no response.", "Two other details provided by Biden undermined the credibility of his claim that he was arrested while trying to visit Mandela, even before his spokesperson walked it back.", "Firstly, the former vice president claimed in South Carolina to have been arrested along with the U.S. ambassador to the United Nations, a reference to Young, a Georgia congressman who traveled to Lesotho with Biden in December 1976 before he became U.N. ambassador (and who later served as mayor of Atlanta during the 1980s).", "In February 2020, Young told both The New York Times and The Washington Post that he himself had never been arrested in South Africa, and he said he did not think Biden was either.", "Secondly, in the same South Carolina speech, Biden said he was arrested with Young \"on the streets of Soweto\" while trying to visit Mandela on Robben Island (Biden repeatedly and mistakenly referred to the place where Mandela was imprisoned for 18 years as \"Robbens Island\").", "On its face, this claim appears utterly implausible since Soweto, a township of South Africa's largest city Johannesburg, is located nearly 900 miles northeast of Robben Island, which is off the coast of Cape Town — the two locations are effectively on opposite ends of the country. It might make more sense if Biden claimed to have been arrested in an airport while attempting to board a flight from Johannesburg to Cape Town in an effort to visit Mandela, but an arrest \"on the streets of Soweto\" does not stack up.", "Snopes asked Biden's campaign to provide any evidence or documentation that might support his claim of having been arrested in South Africa in the 1970s, and we asked the campaign to clarify significant discrepancies in the timeline presented by both Bidens in their respective books. Unfortunately, we did not receive a response of any kind.", "On Feb. 26, after a Democratic primary debate in South Carolina, Biden's deputy campaign manager spoke to reporters and fielded a question about the veracity of the arrest anecdote. In response, she effectively admitted that Biden's claim that he was arrested while trying to visit Mandela was false. Slate reported as follows:", "“He took a trip with a CODEL [congressional delegation] in the ’70s, he was separated from the CBC [Congressional Black Caucus] members that he was traveling with at the airport when he landed,” Biden’s deputy campaign manager and communications director, Kate Bedingfield, told the reporter. “When making that remark, he was talking about his long record of fighting apartheid.”", "So he wasn’t arrested?", "“He was separated from the group he was with at the airport,” she said.", "On Feb. 28, Biden himself admitted in a CNN interview \"I wasn't arrested.\" Instead, Biden claimed, he was referring to an incident in which he was separated from his black congressional colleagues at an airport in South Africa, where police stopped him from using the same airport walkway as them. Biden said, \"When I said 'arrested' I meant I was not able to move. Cops, Afrikaaners were not letting me go with them [the Congressional Black Caucus members], made me stay where I was. I guess I wasn't arrested, I was stopped. I was not able to move where I wanted to go.\"", "As such, we are issuing a rating of \"False.\"", "Glueck, Katie and Thomas Kaplan.  \"Biden Adds a Claim to His Biography: An Arrest in South Africa.\"\r\n    The New York Times.  21 February 2020.", "Newell, Jim.  \"Biden Camp Backs Away From His Story About Being Arrested Trying to Meet Mandela.\"\r\n    Slate.  26 February 2020.", "Glueck, Katie.  \"How Biden's Campaign Explains His 'Arrest' in South Africa.\"\r\n    The New York Times.  26 February 2020.", "Biden, Joe.  \"Promises to Keep: On Life and Politics.\"\r\n    Random House Publishing Group.  2007.", "Biden, Jill.  \"Where the Light Enters: Building a Family, Discovering Myself.\"\r\n  Flatiron Books.  2019.", "The Los Angeles Times/Washington Post News Service.  \"Congressmen Find Post-Election Period Good Time for Overseas Travel.\"\r\n  The Newark Advocate.  18 November 1976.", "United Press International.  \"13 Congressmen Fly First Class at U.S. Expense to Lesotho.\"\r\n  The News-Journal (Mansfield, Ohio).  2 December 1976.", "The Pittsburgh Courier.  \"Atlanta Prexy to Retire in '77; Morgan Head Returns From Africa.\"\r\n  25 December 1976.", "The West Schuylkill Herald.  \"Vincent McNamara Receives BS Degree.\"\r\n  26 May 1977.", "The Morning News (Wilmington, Delaware).  \"Biden Says 'Malarkey' to Jabs at Staff Costs.\"\r\n  28 May 1977.", "The Associated Press.  \"Panel Votes for Disclosure of Total Intelligence Budget.\"\r\n  The Lubbock Avalanche-Journal.  26 May 1977.", "Kessler, Glenn.  \"Biden's Ridiculous Claim He Was Arrested Trying to See Mandela.\"\r\n  The Washington Post.  25 February 2020.", "Updated [3 March 2020]: Added Feb. 28 remarks by Joe Biden.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]