["The photos, two of which are almost identical, were shared in this Facebook post on August 20, 2020. The post has been shared more than 62,000 times.", "The post’s states: \"GUYS! PLEASE PRAY FOR CALIFORNIA! / This is the first ever firenado in the history of the world, this happened in California, Intense! Events happening in the world are horrifying so we must continue to pray.\"", "The post circulated online as California continued to battle major wildfires. The fires have so far have burned one million acres and forced tens of thousands to leave their homes, AFP reported here on August 24, 2020.", "The photos were also shared alongside a similar claim here, here, here on Facebook; here and here on Twitter; and here in a website post.", "The claim, however, is misleading.", "A reverse image search on Google and subsequent keyword search found two of the photos corresponded with this Facebook video published on August 7, 2018. It was shared by the Facebook page for Leicestershire Fire and Rescue Service Ashby Station, a fire and rescue service in the UK county of Leicestershire.", "The video’s caption states: “Whist we were firefighting at Occupation Lane we witnessed a firenado or a fire whirl it's created as cool air enters the top of the hot air causing a swirl similar to how a tornado is formed.”", "A shortened version of the video, credited to the fire and rescue service, also appeared in this BBC report published on the same day.", "The BBC report states the fire occurred at “Ravensbourn Plastics Ltd on Occupation Lane, in Albert Village, Swadlincote.”", "Below is a screenshot comparison of the two photos in the misleading posts (L and C) and a frame in the fire service video (R):", "The third photo in the album does show a recent wildfire in California. It appears in this August 17, 2020 Reuters report, captioned: “A funnel appears in a thick plume of smoke from the Loyalton Fire in Lassen County, California.”", "It was also included in this New York Times article published on August 16, 2020. It is headlined: \"Fire Tornadoes Reported in Northern California Wildfire.\"", "It states in part: \"The National Weather Service said it was planning to investigate reports of a rare occurrence of fire tornadoes arising on Saturday from a 20,000-acre wildfire in Northern California.", "\"Dawn Johnson, a meteorologist with the service in Reno, Nev., said on Sunday that the agency had received reports of fire tornadoes in an area of Lassen County, Calif., about 25 miles northwest of Reno.\"", "Firenados are rare but there have been multiple sightings of them around the world in recent years, particularly in the US.", "This Washington Post article published on August 17, 2016, also includes footage of a firenado spotted in the US state of Colorado.", "This BBC article contains a video credited to the Cornelius Fire Department of a firenado in the US state of Oregon in August 2018.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]