["The claim was posted on Facebook here on March 11, 2021.", "The claim’s lengthy caption talks about a Covid-19 vaccination centre set up at Istora Gelora Bung Karno, a major sports stadium in Jakarta, and says that the programme is jointly run by “Indonesia’s State-Owned Enterprises Ministry, Health Ministry, the Jakarta provincial government and the Indonesia Healthcare Corporation”.", "The post adds that the centre is available for “all holders of Indonesian ID cards” including “those who are not registered as Jakarta residents”.", "The post circulated as Indonesia continues its Covid-19 vaccination campaign, which began in January 2021 and aims to inoculate nearly 182 million people in the next 15 months, as AFP reported here.", "The claim was also shared on Facebook here, here, here, here and here.", "The claim, however, is false.", "The Indonesian State-Owned Enterprises Ministry posted a series of tweets on March 10, 2021, debunking what it called “false information.”", "\"Sentra vaksinasi BUMN dan Kementerian BUMN itu adalah untuk pegawai publik dan lansia yang terdata di DKI Jakarta. Jadi bukan masyarakat umum,\"", "The statement translates as: “We regret the act by some parties that spread false information (hoax) in regards to the mechanism of the vaccination at the Covid-19 Vaccination Centre at Istora Senayan. A claim has circulated saying that the vaccination at Istora is open for anybody, not only for elderly people.", "“The claim even further says that anybody can be vaccinated by showing their ID cards only.", "“The vaccination centre, run by state-owned enterprises and the State-Owned Enterprises Ministry, is for public officials and elderly people who are registered as Jakarta citizens. So, it is not for the general public.”", "An Instagram story posted by the vaccination centre here on March 10, 2021, also says that their vaccination programme only caters to the elderly and employees of state-owned entreprises who have Jakarta ID cards.", "A March 10, 2021, report published by Indonesia’s state news agency Antara quoted Arya Sinulingga, the ministry’s special staff member, as saying that the vaccination centre organised by the ministry and the state-owned enterprises “is for public workers and the elderly who are registered as Jakarta residents”.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]