["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Republican candidate for President Donald Trump campaigns at Dorton Arena in Raleigh on Monday, Nov. 7, 2016, the day before Election Day. State Rep. Bobbie Richardson incorrectly tweeted that Trump wants to cut the CDC's budget by 80 percent.", "In his first year as president, Donald Trump made it clear that he wants to cut some government programs.", "He signed an executive order instructing budget writers to root out waste in the federal government. And his proposed budget included cuts to the Environmental Protection Agency, as well as education programs.", "Trump’s moves have sparked outcry among Democrats, who have argued that the cuts will make government less effective and endanger the environment. In North Carolina, state Rep. Bobbie Richardson recently took to Twitter to raise alarm about Trump’s latest budget proposal and how it affects the Centers for Disease Control and Prevention.", "Richardson, a three-term representative from Louisburg, is the Democratic whip in the state House.", "\"The president is cutting the CDC budget by 80%. Is this recklessness or deliberate action against preventive healthcare?\" Richardson tweeted on Feb. 3. She has about 1,000 followers.", "PolitiFact found this tweet questionable. The CDC is the nation’s primary source for developing and applying disease prevention methods and health education activities. Cutting the CDC budget by 80 percent would have a drastic impact on its ability to study America’s ability to help prevent illness across the country.", "What the CDC said", "Finding the truth seemed as simple as asking CDC officials about their budget. So we reached out to them. Bernadette Burden, a senior press officer for the CDC, responded Wednesday.", "She said the CDC’s budget proposal for fiscal year 2019, which starts in July, is $5.66 billion. That’s a decrease of approximately $1.4 billion – or 20 percent – compared to the spending level, Burden said in an email.", "A breakdown of spending in the current fiscal year is available on the CDC website. The CDC provided a fact sheet of Trump’s budget, which outlines where he aims to cut.", "Among other changes, Trump’s budget would cut $138 million from the program dedicated to chronic disease prevention and health promotion, cut $59.9 million from programs studying \"emerging and zoonotic infectious diseases,\" and $46 million from a program called \"Racial and Ethnic Approaches to Community Health.\" A zoonotic disease is a disease that can be transmitted from animals to people.", "Burden noted that the CDC adapted its budget request to includes program reductions and eliminations that Trump proposed last year.", "Misreading headlines?", "PolitiFact couldn’t find any news articles that verified Richardson’s claim. It’s possible that Richardson misquoted the headline from this Washington Post story: \"CDC to cut by 80 percent efforts to prevent global disease outbreak.\"", "The story says the CDC is downsizing one of its specific efforts – its epidemic prevention activities – because money is running out. The epidemic prevention programs \"train front-line workers in outbreak detection and work to strengthen laboratory and emergency response systems in countries where disease risks are greatest,\" the Post reported. The CDC is cutting its efforts in 39 out of 49 countries.", "It’s unclear if Richardson misread the Washington Post headline. Nonetheless, PolitiFact believes this opportunity is as good as any to remind folks to read stories before making judgements about news based on headlines.", "As for Richardson, her assistant, Anna Meadows, confirmed that neither she nor Richardson could find the original source for the tweet.", "\"She deleted the post after your inquiry, since she couldn’t find the source,\" Meadows said in an email.", "Our ruling", "Richardson tweeted that President Trump is \"cutting the CDC budget by 80 percent.\" The proposal is a 20 percent cut – which is not remotely close to Richardson’s claim. She deleted the tweet. So we rate this claim False.", "A tweet on state Rep. Bobbie Richardson’s Twitter account, @NCRepRichardson.", "Email correspondence with Bernadette Burden, senior press officer in the division of public affairs for the Center for Disease Control and Prevention.", "Email correspondence with Anna Meadows, legislative assistant to state Rep. Bobbie Richardson.", "Story by The Hill, \"Trump signs executive order to cut government waste,\" published March 13, 2017.", "Story by the New York Times, \"Trump Budget Would Cut E.P.A. Science Programs and Slash Cleanups,\" published May 19, 2017.", "Story by National Public Radio, \"President Trump's Budget Proposal Calls For Deep Cuts To Education,\" published May 22, 2017.", "The Centers for Disease Control and Prevention’s, \"Fiscal Year 2017 annual report;\" its \"Overview of the CDC FY 2018 Budget Request;\"and its fact sheet for \"President Trump’s fiscal year 2019 budget request.\"", "Story by The Washington Post, \"CDC to cut by 80 percent efforts to prevent global disease outbreak,\" published Feb. 1, 2018.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]