["About this rating", "On 8 December 2016, fake news site Thug Life Videos published an article reporting that a Canadian man named Kenneth Gillespie had been hospitalized for penile frostbite after drunkenly attempting to have sexual relations with a snowman:", "A 64 year-old was rushed into Centre hospitalier de l’Université Laval [in December 2016] with a most unusual medical complaint. He had frostbite of the P*NIS after getting drunk and trying to have s*x with a SNOWMAN.", "Kenneth Gillespie is known to locals as a drunk and a bit of a lecherous type, but this latest episode has had dire consequences. He was found passed out clutching onto his frozen junk by neighbors at 1.30am on Sunday morning and they called the ambulance straight away.", "The doctor in charge of Mr. Gillespie, Dr. Marc Arnadeu said this to a local TV news crew: “Frostbite of that area may sound funny but it is very serious indeed. Frostbite, of course, can cause infection and gangrene and ultimately this has led to Mr. Gillespie’s member being amputated. It’s very sad.”", "The snowman is thought to be okay, though. It’s since been rebuilt and cleaned ... Some in Gillespie’s neighborhood are less than pleased, though. One told the Montreal Gazette this: “ ... Several people have already vowed to dismember him after what he did to the kids’ snowman. He left a pile of empty bottles, a wrecked snowman and a trail of frozen man-juice in the middle of the community recreation ground. This b*stard’s worse than Bill Cosby.”", "On the surface, the tale of the sexy snowman appeared to be typical hoax news cooked up to garner social media traction. But iterations of a near-identical claim had been published several years earlier by Uproxx, The Frisky, and several radio blogs, all of which aren't generally considered fake news sites.", "Uproxx's 25 January 2013 item placed \"Kenneth Guillespie\" in Britain and made no mention of neighbors referencing Bill Cosby (who was not widely accused of sexual misconduct until October 2014, long after the snowman tale began trekking across the Internet):", "Regardless, this dude from the UK is obviously a freak in every way, so of course he was able to stick his diseased dong into an ice sculpture and impale it mercilessly until shooting a load.", "Habitual drunkard Kenneth Guillespie, 64, was found half-naked and screaming in agony next to the remains of the five-foot snow sculpture. And when he arrived for treatment at North Central infirmary in Blackburn, shocked medics found the booze-soaked layabout was suffering from FROSBITE of the JOHNSON. Someone At the hospital said that “Ken’s a regular visitor to A&E. Normally it’s just bumps and scrapes – or someone has giving him an ass whoopin’.", "“Occasionally he’ll get trapped in something or get an object wedged up him. But this is the most bizarre mishap yet.”", "But The unemployed former postman may not remain in one peice if the return to the scene of his whitemarish coupling — as local residents are said to be on the warpath.", "Ian Jessop of the Ramsgreave and Brownhill Community Security said: “ ... He left” a pile of empty bottles, a wrecked snowman and a trail of frozen man-juice in the middle of the community recreation ground.”", "Most accounts cited a (since-deleted) page on a web site called Busted in Acadiana which was dated 21 January 2013 and featured a (once widely-circulated) photograph of what appeared to be news article evidencing the claim:", "That image led to the original source of the story, Sunday Sport, an outlet described by Wikipedia as somewhat akin to the Weekly World News as an unambiguous peddler of complete fabrications:", "Sunday Sport is a British tabloid newspaper, published by Sport Newspapers, which was established in 1986. It prints plainly ludicrous stories, such as \"London Bus Found Frozen In Antarctic Ice\", or \"World War II Bomber Found On The Moon\". Defenders of the paper pointed out that it was not intended to be taken seriously.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]