["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Republican presidential candidate Herman Cain can’t get away from the subject of Islamic law.\n\nReporters have been dogging him on the issue since March, when a liberal blogger asked Cain whether he’d feel comfortable appointing a Muslim to his Cabinet if he became president. Cain said he would not appoint one because Islam demands they follow Sharia law, above all others -- including the U.S. Constitution.  \n\nSharia law is a wide-ranging set of rules that govern aspects of Islamic life including religious practice, daily living, crime and financial dealings. Muslims differ on its interpretation.  \n\nLater, Cain denied saying he would not appoint Muslims -- a statement PolitiFact Georgia ruled Pants on Fire. CNN anchor and moderator John King asked Cain about the subject again during the June 13 Republican primary debate in Manchester, N.H.\n\n\"Are American-Muslims as a group less committed to the Constitution than, say, Christians or Jews?\" King asked.\n\n\"There have been instances in New Jersey -- there was an instance in Oklahoma where Muslims did try to influence court decisions with Sharia law. I was simply saying very emphatically, ‘American laws in American courts,’ \" Cain replied.\n\nHave there been instances in New Jersey and Oklahoma where Muslims tried to \"influence court decisions with Sharia law\"?\n\nWe turned to news accounts and court documents to address the issue.\n\nFirst, we’ll consider Oklahoma, where voters approved the \"Save Our State Amendment\" Nov. 2. It forbids courts from using Sharia law as well as international law when they make decisions. A judge granted a request later that month for a preliminary injunction that bars the amendment from going into effect. It is being challenged in federal appellate court.\n\nDuring a Nov. 22 hearing in Oklahoma federal court, state Assistant Attorney General Scott Boughton defended the amendment on behalf of the state. He conceded under questioning by a federal judge that he did not know of any instances where Sharia law was used in state courts, according to The Oklahoman newspaper.\n\nAn Oct. 28 Los Angeles Times article on the proposed amendment found three cases that backers said demonstrate Sharia law is being used in U.S. courts. None of them took place in Oklahoma.\n\nA brief filed in federal court in support of the Oklahoma amendment did not assert that Sharia law had been used in Oklahoma courts. Instead, it listed one example from New Jersey.\n\nThis brings us to Cain’s mention of New Jersey during the June 13 debate. In 2009, state Superior Court Judge Joseph Charles denied a woman a restraining order after she reported her husband repeatedly beat and sexually assaulted her. She and her husband are Muslim.\n\nCharles asked their imam during the injunction hearing how Islamic law applies to sexual behavior. The imam testified that a wife must comply with her husband’s sexual demands, but a husband was forbidden to approach his wife \"like any animal.\"   \n\nCharles said he denied the restraining order in part because the husband’s \"desire to have sex when and whether he wanted to, was something that was consistent with his practices and it was something that was not prohibited,\" according to the decision.\n\nThe New Jersey appeals court ruled July 23, 2010, that Charles was wrong. His decision contradicted U.S. and state Supreme Court precedent on conflicts between criminal law and religion, the ruling said.  \n\nLet’s sum up.\n\nCain was wrong on Oklahoma. Voters did pass an amendment to the state constitution that would prevent the use of Sharia law in state courts, but supporters found no instance where \"Muslims did try to influence court decisions with Sharia law,\" as Cain said.\n\nThere was a New Jersey case in which a judge considered Islamic law when he denied a request for a restraining order.\n\nHowever, since the issue of Islamic law arose only when the New Jersey judge questioned the couple’s imam, it is unfair to accuse Muslims of trying to \"influence court decisions with Sharia law.\" The judge raised the subject.\n\nWe rule Cain’s statement Barely True.", "CNN.com, Republican primary debate transcript, June 13, 2011\n\nSuperior Court of New Jersey, Appellate Division, S.D. v. M.J.R, July 23, 2010\n\nJersey Journal, \"Court: Religion is no defense in couple’s non-consensual sex,\" Aug. 2, 2010\n\nFoxNews.com, Advocates of Anti-Shariah Measures Alarmed by Judge’s Ruling, Aug. 5, 2010\n\nOklahoma Secretary of State, \"Save Our State Amendment,\" accessed June 15, 2011,\n\nThe Oklahoman, \"Miles-LaGrange says she needs more time to review whether amendment is unconstitutional,\" Nov. 23, 2010\n\nThe Los Angeles Times, \"Measure would outlaw Islamic law in Oklahoma -- where it doesn't exist.\" Oct. 28, 2010\n\nU.S. District Court, Western District of Oklahoma, Muneer Awad v. Paul Ziriax, et al., amicus curiae brief, Nov. 16, 2010  \n\nU.S. District Court, Western District of Oklahoma, Muneer Awad v. Paul Ziriax, et al., order, Nov. 29, 2010\n\nPolitiFact Georgia, \"Cain denies claims he said he would not appoint Muslims,\" June 8, 2010,", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]