["This Facebook post with the photos was posted on a page with around 7,600 followers on May 28, 2018.", "It has since been shared more than 10,000 times. The post contains a photo collage of four pictures, which show a bearded man with a circular metallic device attached to his chest.", "The post’s caption translates to English as: “This man is a fanatic Hindu, he had a Shivling [representation of Hindu deity Lord Shiva] tattooed on his chest, Muslims attacked and took out his heart and carved an iron stamp there.", "“Now this poor man is roaming without a heart. The innocent poor Hindu has been mistreated a lot. He also does not have any money for the treatment. Through sharing the post each time on Facebook, he will get one Indian rupee. Requesting all Hindu brothers to help their fellow Hindu by sharing this as much as possible and remind the Muslims of their status.", "“All brothers do not forget to write \"Hail Lord Rama\" (Jai Shri Ram) in the comments.\n\t \n\t“Hail Lord Rama.\"", "Below is a screenshot of the post:", "The same photo collage was posted here on a Facebook page called “Teens of srinagar” on January 12, 2019, with a similar claim, but it did not give details of the religion of the man in the photos.", "That post has been shared more than 35,000 times.", "But the claim in the misleading posts is false; the photos show American actor Robert Downey Jr. on the set of the 2008 superhero film Iron Man.", "A reverse image search on Google revealed the images were published on the website and Instagram page of Jamie Kelman, a Los-Angeles based makeup artist for film and TV.", "Below is a screenshot of the one of the photos on his portfolio with a caption describing the makeup he created:", "Below are the images on his Instagram page:", "IRON MAN (2008) - It is the 10th Anniversary for IRON MAN and for MARVEL ENTERTAINMENT’s current universe of movies(MCU), so I am sharing some of my photos from my time as Key Makeup Artist on the original IRON MAN movie. It seems like I really should share, because this original film seems to have taken on a somewhat classic-movie nostalgia and I get it— it’s a really cool, great movie. Also people seem to love RDJ more than ever; I get that too- he’s very talented, and quite un-ugly. I had a blast working on it, one of my favorite career experiences ever. This prosthetic makeup was built by Stan Winston Studio, supervised by Shane Mahan, and applied by 3 of us— my boss, makeup department head Deborah La Mia Denaver, and by Richie Alonzo, and by me. I made a subsequent new sculpture and appliance for when it is more healed up and less ragged (previously posted). But this piece was made by the legendary artists of the late great Stan Winston’s Studio. Fun Fact: These pix are from the VERY first day of filming the first IRON MAN, they are dated March 12, 2007. The very first shot of principal photography was Tony Stark waking up in the cave, with the RT device wired to his chest to keep him alive, courtesy of character Yinsen (actor Shaun Toub) #marvel #ironman #makeup #makeupartist #fxmakeup #makeupfx #prosthetics #charactermakeup #promua #prostheticmakeup #specialmakeupeffects #setlife #specialmakeupfx #sfxmakeup #comicbookmovies #sws #stanwinstonstudio #moviemakeup #rdj #tonystark #shanemahan #richiealonzo #robertdowneyjr #excelsior", "A post shared by  Jamie Kelman (@jkelmakeup) on Mar 11, 2018 at 6:34pm PDT", "IRON MAN (2008) - Marvel Studios is celebrating its 10th anniversary— happy 10 years of massive success, Marvel! I was the Key Makeup Artist on their very first and imo still best Marvel Entertainment MCU movie, but I know I’m biased ;-)... not that I’ve seen all of them cause I haven't. Fun fact: before Marvel was owned by Disney, this first film was considered ‘an indie’ film, with distribution by Paramount. Stan Winston Studio (SWS) built the most beautiful robotic suits that I’ve ever seen for this movie. SWS, with Shane Mahan leading their team on this film, also made some other prosthetic makeups, including a fresh torn up version of this chest wound. We see their prosthetic at the first reveal of the new power-source on Tony Stark in the cave. But when production wanted another more healed version of his skin surrounding (and visually countersinking) the power-source in his chest, that build became my responsibility, with the support of Shane and my boss, Makeup Dept. Head Deborah LaMia Denaver. I applied this prosthetic makeup when it worked. Propmaster Russell Bobbitt was responsible for making the actual power-source prop, it was like a light-up hockey puck (see pic) Pictured here: silicone appliance makeup on the very brilliant actor, Robert Downey Jr that I sculpted, molded & ran at my home fx lab, KELMAN STUDIO. The clay sculpture is also in the pix (if u swipe) before it was molded. Also pictured is a sickly makeup on RDJ when his chest power device is stolen by Jeff Bridges villain character, leaving an empty gaping hole in his chest (hence the greenscreen paint to aid VFX to deepen the hole). Shoutout to his hairstylist Nina Paskowitz! If you’re an IRON MAN fan, I previously posted another prosthetic makeup I made for this film, when in the story ‘Tony Stark’ first suffers the shrapnel wound in his chest. Happy 10th Anniversary, Marvel— Excelsior! #marvel #ironman #makeup #makeupartist #fxmakeup #makeupfx #prosthetics #charactermakeup #promua #character #prostheticmakeup #specialmakeupeffects #setlife #specialmakeupfx #sfxmakeup #moviemakeup #rdj #robertdowneyjr #kelmanstudio #tbt #excelsior", "A post shared by  Jamie Kelman (@jkelmakeup) on Feb 21, 2018 at 10:22pm PST", "The caption of the first post dated February 22, 2018 shared by Kelman on Instagram says: “IRON MAN (2008) - Marvel Studios is celebrating its 10th anniversary – happy 10 years of massive success, Marvel! I was the Key Makeup Artist on their very first and imo still best Marvel Entertainment MCU movie, but I know I’m biased”.", "It also says: “Pictured here: silicone appliance makeup on the very brilliant actor, Robert Downey Jr that I sculpted, molded & ran at my home fx lab, KELMAN STUDIO.”", "Jamie Kelman told AFP by email that the images in the misleading Facebook post showed fake makeup from Iron Man.", "\"Yes it is absolutely fake makeup - I was the Key Makeup Artist on the original IRON MAN, and I personally took those photos of the makeup work that I had applied on actor Robert Downey Jr. as a wounded Tony Stark.\"", "\"Those pictures are from a dozen years ago in the makeup trailer and on-set during filming the first IRON MAN movie in 2007, here in Los Angeles, California.\"", "\"Yes the images are just makeup for telling the story of IRON MAN. Synthetic silicone rubber for skin, prosthetic glue and paint, with a bit of fake blood, etc,\" he said in a March 25 email.\n\t\t\t \n\t\t\tRobert Downey Jr. can be seen playing the role of Tony Stark in the film’s official trailer, embedded below:", "The posts contain no evidence to prove that Facebook is raising money for the purported heart transplant patient. Facebook had not responded to a request for comment by time of publication.", "AFP has debunked similar claims made in posts on Urdu-language Facebook pages.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]