["By Sydney Nixon", "Posted on March 22, 2021", "Columbia University will supplement its regular 2021 graduation ceremony with multicultural ceremonies for members of the Latinx, Asian, Black and other student communities who want to participate. Social media users are misrepresenting these voluntary ceremonies as “segregation.”", "As universities continue to grapple with COVID-19 safety concerns, many are beginning to announce their frameworks for in-person and virtual 2021 graduation ceremonies.", "Columbia University announced it will hold a virtual, university-wide commencement open to all graduates on April 30. In addition, it will offer “Multicultural Graduation Celebrations” online for Native American, LGBTQIA+, Asian, Black, Latinx, and first-generation and low-income community students.", "Columbia’s graduation plan was reported by Fox News on March 15 with the headline, “Columbia University hosting 6 separate graduation ceremonies based on income level, race, ethnicities.” The story noted that the university would also host “a more general commencement ceremony.”", "But the Fox News story was followed by social media posts that did not provide the context of the graduation ceremonies at Columbia.", "On March 16, two Facebook posts, which together received more than 2,500 likes and nearly 1,100 shares, described the multicultural celebrations as “segregated by race, and sexual preference” and “regressive, not progressive.”", "Blaire White, a conservative content creator, commented: “This is DISGUSTING. Congrats society, we’re so woke that we have segregation again.”", "The backlash against Columbia stemmed from a misinterpretation of the multicultural celebrations’ purpose and function.", "In an email to FactCheck.org, a university spokesperson said, “The smaller celebratory events held for particular communities are in addition to, not instead of, the main Commencement and Class Day graduation ceremonies. In most instances, these smaller, multicultural gatherings evolved from ceremonies originally created by alumni and students. The gatherings are voluntary, open to every student who wants to participate, and have become a highly anticipated and meaningful part of the Columbia graduation experience.“", "The Columbia Daily Spectator, an undergraduate-run newspaper, noted that identity-specific graduation ceremonies are not unique to Columbia. For more than 20 years, the Afro-American Cultural Center at Yale University has hosted an annual Black commencement, the newspaper reported, and “Lavender Graduations,” which celebrate the achievements of LGBTQ students, are held at 220 universities nationwide.", "Harvard University’s Black Graduate Student Alliance began hosting a ceremony for Black students in 2017.", "The Columbia newspaper writes that multicultural ceremonies hold significance as “hard-won commemorations of surviving what can be a hostile institutional and social environment” for some students.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "Dorman, Sam. “Columbia University hosting 6 separate graduation ceremonies based on income level, race, ethnicities.” Fox News. 15 Mar 2021.", "Harvard University. Harvard Black Graduate Student Alliance. “Black Graduation.” Accessed 22 Mar 2021.", "Melbourne, Abby. “Misinformation on Twitter sparks backlash against Columbia Multicultural Graduation Ceremonies.” Columbia Daily Spectator. 16 Mar 2021.", "Nietzel, Michael T. “College Commencement, 2021: The Live, The Virtual, The Drive Through.” Forbes. 25 Feb 2021.", "“Multicultural Graduation Celebrations.” Columbia College | Columbia Engineering. Accessed 22 Mar 2021.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]