["About this rating", "Active duty servicemen (or women) can be honorably discharged should they be on the receiving end of an unexpected windfall.", "Individuals with a high net worth are expressly prohibited from serving due to a propensity for insubordination.", "A long-circulating military rumor maintains that individuals with a high net worth (a million dollars in this iteration) are prohibited from serving due to a supposed propensity for refusing orders:", "My colleague works remotely from Japan, as her husband is stationed there. I'm not sure which branch of the U.S. military he serves in, but she stated that if you have a net worth of one million dollars, you are not allowed to serve because people with a high net worth also tend to refuse orders. Is this true? I've never heard that before and can't find anything about it on the web.", "It's certainly unambiguous that the majority of active servicemen and women are of modest means. While many now-wealthy folks once served, individuals who've abandoned lucrative careers or opportunities (or were born into money) often so rarely opt to serve that such a scenario is newsworthy. However, examples to the contrary remain, one being Senator John McCain's son James McCain:", "Mr. McCain did not bring cameras or a retinue. Instead, he brought his youngest son, James McCain, 19, then a private first class in the Marine Corps about to leave for Iraq ... Mr. McCain, now the presumptive Republican nominee, has staked his candidacy on the promise that American troops can bring stability to Iraq. What [Sen. McCain] almost never says is that one of them is his own son, who spent seven months patrolling Anbar Province and learned of his father’s New Hampshire victory in January while he was digging a stuck military vehicle out of the mud.", "Further back in history, all four of Joseph P. Kennedy, Sr.'s sons served in the military despite the family's wealth: Joseph P. Kennedy, Jr. was killed in action in August 1944, President John F. Kennedy was awarded a Purple Heart for heroic actions in the same year, Senator Ted Kennedy enlisted in 1951, and Robert F. Kennedy enlisted in 1944 six weeks before his eighteenth birthday. None circumvented active duty despite their families' wealth and fame.", "Clear examples to the contrary regarding wealth and eligibility to serve contradict claims that net worth is an absolute barrier to service due to a high likelihood of insubordination. A similar rumor was addressed in a 20 July 2010 Stars and Stripes column titled \"Can winning the lottery get you out of the service?\" Although the question addressed in that item didn't directly pertain to eligibility to serve, it did confirm the existence of scenarios in which newly acquired wealth disrupted a military career:", "Seaman Don Burdette was one of thousands of sailors aboard the USS Nimitz in 2004. But he was the only one to win millions. And after Burdette hit the California lottery for a $6.5 million payday, it was only a matter of days before the Navy bid him bon voyage.", "The Rumor Doctor came upon Burdette’s story after a reader downrange asked if it is possible to be discharged after winning a big jackpot. The Doctor scoffed at first, having shot down many ridiculous notions, but it turns out that all the services have some type of system in place that would allow the nouveau riche to slip off their boots and begin a new life.", "Burdette had served more than two years of a four-year contract at the time. He asked his division chief and others what he should do. They suggested he take the money and sail away.", "It took about a week-and-a-half to process his request for an honorable discharge, which ultimately had to be approved by his captain ... Marines who win the lottery can request an early discharge due to “unique circumstances,” said Marine Corps spokeswoman Maj. Shawn Haney.", "However, the scenario described didn't involve a question of eligibility to serve, merely a situation where wealth arose as a factor in the trajectory of a military career. That article also noted that sudden infusions of wealth were a potential distraction of which the military wasn't unaware, making such discharges perhaps best for all involved (again, in scenarios where individuals received unexpected windfalls in the course of service):", "And it just makes good sense, said Coast Guard spokesman Lt. Paul Rhynard, who believes it’s unreasonable to expect a Coast Guardsman who recently won the lottery to perform his duties the same as before.", "The Coast Guard no longer has any leverage over him, Rhynard said. “He’s not worried about whether he loses his job or not,” Rhynard said.", "Further supporting information can be found in military forms pertaining to requests for discharge following a \"once in a lifetime opportunity\":", "This provision of AR 635-200 provides for those soldiers who desire to leave active duty but who do not qualify under any other provision of AR 635-200.  Recent guidance (MILPER Message NR 97-095) emphasizes that requests under this provision will not be approved unless discharge is clearly “in the best interests of the Army,” not necessarily in the best interests of the soldier.  Individual requests which serve only the interest of the soldier, particularly those involving soldiers with critical military skills or bonus recipients, will not be approved except under exceptional circumstances.  Requests for separation more than three months before ETS normally will be disapproved.", "So while branches of the service were aware of and provided for scenarios in which an individual's sudden wealth placed their continued enlistment at odds with the best interests of the military, we could locate no specific provision barring wealthy individuals from serving, due to probable insubordination or otherwise.", "It appeared to be true that servicemen or women who encountered a windfall could under some circumstances be relieved of their obligation to serve, but the request seemed to be most often triggered by the individual and not their relevant military branch. It's possible the rumor was a byproduct of the idea such continued service was not in the \"best interests\" of the military, but that specific wording was derived from a protocol related to new wealth, not existing high net worth.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]