["About this rating", "In a day of deadly violence on Jan. 6, 2021, a mob of Trump supporters broke into the U.S. Capitol, interrupting members of Congress as they were counting electoral college votes that confirmed the victory of President-elect Joe Biden.", "Among right-wing extremist rioters was a man with an anti-Semitic sweatshirt that said \"Camp Auschwitz,\" a reference to a Nazi extermination camp during the Third Reich's genocide campaign against Jews during World War II. As writer and historian Mike Stuchbery observed, it not only contained Nazi imagery, the man's shirt also had the English translation of the phrase emblazoned over the death camp's entry:", "The man was seen on the British news station ITV with rioters entering the office of U.S. House Speaker Nancy Pelosi.", "Washington Post journalist Mike DeBois captured a screenshot from the ITV report of the man entering Pelosi's office with other rioters. He can be seen on the left side of the picture:", "The shirt garnered backlash for the company that sold it, TeeChip, with historian and television host Lindsey Fitzharris and the Auschwitz Memorial blasting the company on Twitter for profiting on hate. TeeChip claimed that the products and the seller had been banned, but Fitzharris posted pictures showing she found more items bearing the anti-Semitic message. As of this writing a search of TeeChip's site turned up no more such items.", "CNN identified the man in the sweatshirt as Robert Keith Packer, a Virginia resident. Packer was arrested on Jan. 13, 2021, on federal charges related to the attack on the Capitol.", "Updated with information about the man's identity.", "Updated to note Packer was arrested.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]