["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "• Christie said this claim is “completely false.”", "• We found no evidence to support that the governor said this.", "Former New Jersey Gov. Chris Christie spent several days helping President Donald Trump prepare for the presidential debate. A quote attributed to the Republican politician that has since emerged offers one tip — exploit Democratic presidential nominee’s stutter.", "\"People who overcome stuttering have a harder time maintaining their train of thought when interrupted,\" reads the statement that’s circulating on social media. \"Keep interrupting him and he’ll stumble when he tries to speak. This will enforce the ‘senile’ narrative.\"", "But Christie says he never said this.", "Posts sharing the quote were flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "One post that shared the quote refers to a post in a forum on Democratic Underground as a source. In the forum, someone shared a screenshot of a grammatically problematic tweet that said: \"VP Joe Biden has a speech impediment and Christie told Trump to interrupt him as much as possible, hoping Biden will be loose his cool.\"", "It wasn’t the only account to make that claim. CNN anchor Jake Tapper shared another on Oct. 6 with a caveat.", "\"I asked Gov Christie about this viral tweet and he says it’s ‘completely false’ and that Biden’s stutter ‘never came up as a subject’ in debate prep,\" Tapper tweeted.", "Some users chided Tapper for taking Christie at his word but others expressed bewilderment — they couldn’t find an original, credible source supporting the claim that he actually said this.", "Neither could we. We found multiple social media posts sharing the statement, but nothing to corroborate them.", "On ABC News after the presidential debate on Sept. 29, Christie said the plan was for Trump to be aggressive but that it was \"hotter than it was planned to be\" and that he could \"potentially turn that heat down\" going forward.", "Christie also addressed Biden’s performance, and he said that he thought Trump’s interruptions \"saved him\" at times when Biden was \"not seeming on the ball, getting numbers wrong, wandering in mid-sentence, not being able to finish thoughts.\"", "Still, there’s no record of Christie giving the advice that we could only trace to posts on social media and an online forum. Without evidence to support this claim, we rate it False.", "Facebook post, Oct. 3, 2020", "Tweet, Oct. 3, 2020", "The New York Times, Chris Christie, who helped Trump prepare for the debate, has the virus, Oct. 3, 2020", "The Atlantic, What Joe Biden can’t bring himself to say, January/February 2020", "Democratic Underground, Chris Christie instructed Trump to exploit Joe Biden’s stutter to make him lose his train of thought, Oct. 3, 2020", "Jake Tapper tweet, Oct. 6, 2020", "ABC News, Powerhouse politics roundtable, Sept. 29, 2020", "NJ.com, Christie helped Trump prep for first presidential debate, but said result was ‘hotter’ than expected, Sept. 30, 2020", "PolitiFact, Biden’s blunders: separating the real from the fake, Oct. 5, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]