["Posts shared on Facebook and Twitter argue against the removal of the smiling black figure from Aunt Jemima’s packaging, claiming that to do so would be to erase “her wishes and legacy.”", "“Nancy Green was her real name and she was born into slavery. When free she created this product and named it herself under contract with General Mills. She died one of Americas first black millionaire’s (sic),” the post reads.", "While Nancy Green was the face of the Aunt Jemima brand for several decades and contributed to its popularity until her death in 1923, she did not die a millionaire.", "Green was a freed slave who moved to Chicago where she worked for a white family as a cook and personal attendant. She was later hired by the R.T. Davis Milling Company to be the face of the Aunt Jemima pancake mix.", "A talented storyteller, Green travelled the United States to promote the brand, cooking pancakes and drawing crowds at shows, including the 1893 World’s Fair in Chicago.", "“From all the articles and newspaper count that I’ve read, none of them ever mentioned that she had any wealth,” Sherry Williams, president of the Bronzeville Historical Society in Chicago, told AFP.", "Maurice Manring, an independent historian and author of the book “Slave in a Box; The Strange Career of Aunt Jemima,” corroborated Williams’ account. “There’s no contemporaneous evidence that she was rich. There’s no suggestion that she was ostentatiously wealthy,” he told AFP.", "The Aunt Jemima pancake mix was developed in 1889 by Chris Rutt and Charles Underwood, who sold their company to R.T. Davis, according to the company’s website.", "“I’ve seen a lot of that in the last couple of weeks, where people say that Nancy Green invented the Aunt Jemima pancake mix and that’s not true,” Manring told AFP. Manring said that such stories are often the result of Aunt Jemima pamphlet ads that featured stories of the fictional character, who was eventually conflated with Green.", "One obituary for Green asserts that Green herself sold her pancake recipe to the milling company, though others state that it was her popular dish that made her a perfect spokeswoman for the new ready mix.", "Manring told AFP that the accepted story on the name is that Rutt saw a performance of the song “Old Aunt Jemima” at a minstrel show, and decided to adopt it for his brand due to its popularity.", "The brand icon, like the song it was named after, portrays a mammy, a Southern US archetype of black women who worked in white households and nursed white children. The mammy figure is rooted in the history of slavery, and will be removed from product packaging for that reason.", "“We recognize Aunt Jemima’s origins are based on a racial stereotype,” Kristin Kroepfl, Quaker Foods vice-president said in a news release.", "Green worked as a housekeeper until her death, despite a lifelong contract as Aunt Jemima.", "She died in 1923, and was buried without a grave marker in the corner of a Chicago cemetery.", "Williams, who worked to locate the probable location of Green’s remains, has been raising money to buy a headstone. She told AFP that recent media attention brought donations from $1,300 to $5,000.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]