["China culled around 18,000 chickens in Shaoyang city in the southern province of Hunan as a result of a flu outbreak, amidst the coronavirus epidemic. Social media rumours in India started circulating, mostly in Marathi and Hindi, that the broiler chicken has been infected with Coronavirus and people should avoid consuming it.", "Viral social media rumour in Marathi and Hindi:", "“बाॅयलर चिकनमध्ये कोरोना व्हायरस सांपडले आहे. तरी सर्वांना सूचित करण्यात येते की, बाॅयलर चिकन खाऊ नये.(मुस्लिम कम्युनिटी खार मुंबई.)”", "“BOILER CHICKEN ME KORONA VIRUS KO PAYA GAYA HAI. TAMAM LOGO SE APPEAL KI JATI HAI KE BOILER KE GOSHT KA ISTEMAL NA KARE…. MUSLIM COMMUNITY MUMBAI. KHAR. DUAA KI Appeal.” Rough translation: “There is a coronavirus in the broiler chicken. Thus, everyone is informed to avoid consuming broiler chicken. (Muslim community, Khar, Mumbai)”", "A Facebook user Jits Scenic has posted images of chicken with the message, “Carona virus has been found in boiler chicken.Request to all of you not to eat boiler chicken.And please share it everywhere.”", "“High alert: Chicken infected from corona virus found in Bangalore today, kindly circulate the message and avoid consumption of chicken. Spread to your dear ones.”", "Carona virus has been found in boiler chicken.Request to all of you not to eat boiler chicken.And please share it everywhere", "Posted by Jits Scenic on Tuesday, 4 February 2020", "The claim has been shared via Youtube videos as well.", "Alt News has received multiple fact-check requests on its official mobile application available on Google Play Store.", "False", "H5N1 and Coronavirus are two distinct infections, where H5N1 rarely infects people-people, Coronavirus is most infectious if people get in contact with those who are infected.", "In parallel to the novel coronavirus (2019-nCoV), the Chinese government has now confirmed another highly pathogenic strain of the H5N1 bird flu in Hunan province. The 18,000 chickens that had been culled in Shaoyang city in the southern province of Hunan were due to the H5N1 bird flu outbreak, as confirmed by China’s Ministry of Agriculture and Rural Affairs.", "Between 2003-2020, WHO data suggests that H5N1 avian flu has killed 455 people worldwide. The influenza A virus subtype H5N1, also known as A(H5N1) or simply H5N1, can be treated in humans by available antiviral medicines.", "The H5N1 virus is sensitive to high heat 70 degrees C or more. Average temperatures used for cooking, 100 degrees C or more (which is the boiling point of water) will denature the virus.", "To date, no evidence indicates that any person has become infected with the H5N1 virus following the consumption of properly cooked poultry or its products, even in cases where the food item contained the virus prior to cooking.", "The 18,000 chickens were thus culled due to H5N1 avian flu, and not the Coronavirus infection (2019-nCoV). While thoroughly cooked chicken remains safe for consumption, a large number of human infections with the H5N1 virus have been linked to home slaughter and improper handling of infected or dead chicken carcasses before cooking.", "Proper handling and cooking of chickens and other types of poultry can further lower the risk of human infections.", "It is noteworthy that the outbreak of Coronavirus has given rise to false messages on social media attempting to build a narrative against the consumption of meat. Earlier, a video of an exotic meat market in Indonesia was shared as a ‘dirty’ marketplace in Wuhan, China – the epicentre of CoV epidemic. Another video related to the 2019 African Swine Fever outbreak was also linked with CoV.", "Donate Now", "Alt News Science is no longer edited by Dr. Sumaiya Shaikh", "From 2017-2021, Dr. Shaikh was the Founding-Editor for Alt News Science. Her main role is as a neuroscientist researching violent extremism and psychiatry.", "Follow @Neurophsyik", "A video of a ladder moving on its own, purportedly from Jharkhand, is viral on…", "In a 2-minute video, a man recommends a “technique” to prevent infection from Omicron, the…", "A video of a set of iron nails that appear to melt after being placed…", "Several social media users have shared an image that shows two columns — ‘Cepa/variante’ (Spanish…", "A 90-second video of a man dissecting a banana has been shared on the internet…."]