["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "On Wednesday, the General Assembly passed legislation that would raise the state's minimum wage from $8 per hour to $9 per hour beginning next year. It now awaits the governor's signature.", "During the debate in the Senate June 11, the chief sponsor, Sen. Erin Lynch, a Warwick Democrat, said, \"One of the other pieces of opposition that's always raised relative to minimum wage is that it's mostly teenagers working part time that are making the minimum wage.\"", "Critics say \"we're putting an onerous policy on small business owners or other business owners,\" she said. \"The reality is that the average age of the minimum wage worker is 35 years old.\"", "We wondered: Is the typical minimum wage worker really 35?", "It turns out that Lynch isn't the first to make that claim. President Obama made the statement during a April 26, 2014, radio address that called for hiking the national minimum wage to $10.10 per hour.", "When PolitiFact National checked the statement in April, it concluded that it was Mostly False.", "Here's why.", "The source of Mr. Obama's statistic was a study from the Economic Policy Institute, a liberal think tank that promotes policies to help low- and middle-income workers.", "But the statistic didn't apply to the current minimum wage, which is $8 in Rhode Island and $7.25 nationally. It applied to people earning less than $11.10 per hour. In other words, the average age of workers making up to $11.10 is 35.", "After we left a message asking Lynch if she was using additional information, Senate spokesman Greg Pare sent us a three-page infographic from the Rhode Island AFL-CIO that makes the same claim. It cites the misquoted Economic Policy Institute paper as one source.", "John F. Killoy III, director of communications, mobilization, and research for the union organization, also referred us to a report from the liberal Center for Economic Policy and Research. It also found the average age to be 35, but it looked at people earning as much as $10 per hour which is, once again, well above the state and federal minimums.", "Those two reports were used, Killoy said, \"because there is very little data on minimum wage workers in Rhode Island and national data on minimum wage workers does not give the best picture because the Rhode Island minimum wage has consistently been higher than the federal minimum.\"", "In fact, the average age can be a misleading statistic, and choosing it skews the average age of the group receiving the minimum wage. For example, when a bad economy sends more 70- and 80-year-olds to jobs at WalMart, the average age increases dramatically.  You can see the skewing in the Center for Economic Policy report, where the average age of a low-wage earner is 34.9 years but 57.8 percent of them are younger than 35.", "So what's the median age of a worker earning the minimum wage?", "To quote PolitiFact National, \"In reality, the statistics on this specific point are murky. A different study by the Bureau of Labor Statistics found that 71 percent of minimum-wage workers are YOUNGER than 30 -- a starkly different picture of low-wage workers.\"", "According to the data on Table 7 of the BLS report, 50 percent of the 3.3 million workers earning minimum wage were age 24 and younger. That would put the median age for people receiving the minimum at or near 24 years old.", "\"But the BLS study has an important limitation,\" as PolitiFact National noted. \"It looked only at workers making exactly the federal minimum wage of $7.25 and below, so it doesn’t include workers from any of the 21 states and the District of Columbia that have enacted higher state minimum wages.\"", "In the end, Lynch was relying on an AFL-CIO fact sheet that took data on low-wage workers and mischaracterized it as data on minimum wage workers. That distinction is important.", "The evidence, including data from the two reports cited by the AFL-CIO, suggests that the actual age of the typical person now earning minimum wage is significantly lower than 35.", "Clearly a lot of people earning the minimum wage are not teenagers. That's the kernel of truth in Lynch's statement.", "But she seems so far off, we rate her assertion Mostly False.", "(If you have a claim you’d like PolitiFact Rhode Island to check, email us at [email protected]. And follow us on Twitter: @politifactri.)", "RILIN.state.RI.US, \"S2249 Substitute A; An Act Relating to Labor - Minimum Wages,\" Rhode Island General Assembly website, accessed June 12, 2014, and \"Lawmakers raise minimum wage to $9 in 2015,\" June 18, 2014, accessed June 19, 2014", "RICapTV.DiscoverVideo.com, Video on Demand, Rhode Island Senate session, June 11, 2014", "PolitiFact.com, \"Barack Obama says 'the average minimum wage worker is 35 years old,\" April 29, 2014", "EPI.org, \"Raising the Federal Minimum Wage to $10.10 Would Lift Wages for Millions and Provide a Modest Economic Boost,\" Economic Policy Institute briefing paper #371, Dec. 19, 2013, accessed June 12, 2014", "BLS.gov, \"Characteristics of Minimum Wage Workers, 2013,\" Table 7, U.S. Bureau of Labor Statistics report 1048, March 2014, accessed June 12, 2014", "Emails and interview, Greg Pare, spokesman, Rhode Island Senate, June 13 and 18, 2014", "Email and interview, John F. Killoy III, director of communications, mobilization and research, Rhode Island AFL-CIO, June 18, 2014", "CEPR.net, \"Low-wage Workers Are Older and Better Educated than Ever,\" Center for Economic and Policy Research issue brief, April 2012, accessed June 18, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]