["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "The Democratic race for Texas’ 29th Congressional district is turning to a hot-button issue: gun control.", "Gene Green, a Democrat, has represented Texas’ 29th District, which covers the eastern portion of Greater Houston, since 1993. In that time, he has been endorsed by the gun-owner rights group National Rifle Association several times and often received an A rating from the organization -- an issue his challenger, former Harris County Sheriff Adrian Garcia, is bringing to the fore in advance of the March 2016 Democratic primary.", "\"Gene Green is the NRA’s favorite Democrat in Congress,\" Garcia was quoted saying in his own Jan. 7, 2016, campaign media release. \"He’s part of the reason our president has had to use executive action to protect our people. When House Democrats reclaim a majority, the NRA will still have Gene Green in their pocket to block progressive gun safety measures. He is their insurance policy.\"", "Garcia continued: \"It’s no wonder the congressman has a lifetime A rating from the NRA. He signed on to a letter with Texas Republicans to prevent the restriction of armor-piercing bullets. He voted against the Brady Bill, he's voted against child safety locks, and later voted for the assault weapons ban repeal. He also voted for keeping the gun show loophole.\"", "There are a lot of specifics in Garcia’s claim, and we’ll get to those. We also wanted to check if Green has a \"lifetime A rating\" from the NRA and, although it’s harder to judge, if he could be the organization’s \"favorite Democrat.\"", "Lifetime rating?", "Garcia claimed Green had a \"lifetime A rating\" from the NRA. The NRA doesn’t award lifetime ratings; it says it only evaluates candidates each election cycle. Still, candidates sometimes use the term \"lifetime rating\" to promote consistently high -- or low -- NRA marks.", "According to Jennifer Baker, the association’s director of public affairs, the NRA evaluates candidates by looking at voting records, public statements, plus what he or she is doing \"behind the scenes\" in committee. Baker said that if a hopeful hasn’t held office, the group primarily considers answers to survey questions.", "According to NRA’s website, its ratings range from A+ -- for a legislator with \"not only an excellent voting record on all critical NRA issues, but who has also made a vigorous effort to promote and defend the Second Amendment\"-- to F, a \"true enemy of gun owners’ rights.\" Other ratings include AQ, a pro-gun candidate who has no voting record and whose rating is based on answers to survey questions, and \"?,\" meaning a candidate didn’t answer the NRA’s questionnaire, inaction the organization takes as indicative of \"indifference, if not outright hostility,\" to gun owners’ rights. Notably for this fact check, ratings for past election cycles only are available to NRA members.", "Baker told us by phone that when the NRA endorses a candidate, the group \"actively informs our members of our preference in that race.\" A candidate who has a high rating is not guaranteed to receive an endorsement, she said, and a candidate with a lower rating can sometimes be endorsed if the NRA thinks the opponent would be especially bad on its issues.", "We used an NRA member password and checked with the organization on ratings prior to 2002, which are not posted online at all, to verify Green’s record over the 24 years he’s run for election and re-election to Congress. He mostly received A-level ratings, but drew one C too:", "1992: rated \"A\" and endorsed", "1994: rated \"C,\" not endorsed", "1996: rated \"A+\" and endorsed", "From 1998-2010: rated \"A\" and endorsed", "2012: rated \"A-,\" not endorsed", "2014: rated \"A-,\" not endorsed", "The NRA has not released ratings for the 2016 election cycle, and does not yet have an expected date for their release.", "So, what happened in 1994, and after 2012?", "In 1994, Green voted for the Violent Crime Control and Law Enforcement Act, the sweeping crime bill signed by President Bill Clinton that included firearms control measures, Green told us by phone. \"I voted for the bill as part of a package, and that’s why the NRA for a couple years didn’t appreciate it,\" he said.", "Green’s campaign spokesman, Jose Borjon, pointed out that the 1994 legislation included the federal assault weapons ban, which expired in 2004. The bill, we noted, also prohibited juvenile possession of a handgun, prohibited anyone convicted of domestic abuse from buying firearms or ammunition, increased penalties for crimes involving guns and added licensing and registration requirements for firearms dealers.", "Green suggested that between 2010 and 2012, when his rating slipped to an A- after more than 15 years of A’s, gun legislation became an even more partisan issue, and the NRA allied itself more with the Republican Party. As that happened, Green said, he did not want to be associated with the organization. However, his grade only declined from an A to an A-.", "A December 2012 Washington Post article that Green mentioned to us referenced his distancing from the NRA, at the time related to the NRA’s effort to get then-Attorney General Eric Holder held in contempt of Congress after the Sandy Hook school shootings in Newtown, Conn. He joined fellow gun-friendly Democrat John Dingell, the longtime Michigan representative who retired in 2014, in criticizing the group.", "In the same month, Green told reporters at Hearst’s Washington bureau that instead of passing new gun legislation, Congress needed \"to find better ways to enforce current law.\"", "Voting record", "In Garcia’s release, the campaign offered background on the specific votes it referred to:", "-- The \"letter with Texas Republicans to prevent the restriction of armor-piercing bullets,\" Garcia’s campaign said, was Green’s June 3, 2015, \"yes\" vote for the Commerce, Justice, Science and Related Agencies Appropriations Act.", "That act included an amendment prohibiting the use of funds to classify ammunition as armor piercing in imports. The letter itself is a March 4, 2015, letter signed by Green, Texas Republicans and others to the Bureau of Alcohol, Tobacco, Firearms and Explosives opposing the agency’s proposed restrictions on armor-piercing bullets.", "-- Green, Garcia’s campaign said, voted in November 1993 against the Brady Bill, or the Brady Handgun Violence Prevention Act, so named for James Brady, who was shot during an assassination attempt on President Ronald Reagan. We checked, and Green did vote against the Brady Bill.", "-- Green’s vote \"against child safety locks,\" the Garcia campaign said, was his Sept. 24, 1999, \"no\" vote on a conference substitute for the Consequences for Juvenile Offenders Act.", "Green’s \"no\" vote was in response to a motion to instruct conferees, or a House vote to tell its conference committee members how to resolve an issue while negotiating a version of the bill between the House and the Senate. The issue at hand was a Senate amendment that required that child safety locks be sold with every handgun, among other regulations. Green voted no, to instruct committee members to reject that amendment.", "--Garcia’s reference to Green’s \"vote for the assault weapons ban repeal\" was Green’s March 22, 1996, \"yes\" vote for the Gun Crime Enforcement and Second Amendment Restoration Act.", "Green did vote for the legislation, which would have repealed the assault weapons ban that he earlier voted to put in place.", "--Green’s vote for \"keeping the gun show loophole\" was his June 18, 1999, \"no\" vote against the Mandatory Gun Show Background Check Act. Green, Garcia’s campaign said, voted against an amendment to regulate firearms transfers at gun shows and require criminal background checks to prevent the sale of guns to minors and felons.", "In response to these claims, Borjon, Green’s campaign spokesman, pointed out a few votes from Green’s tenure that tended toward gun control, including his 1994 vote in support of the Violent Crime Control and Law Enforcement Act. Borjon also emphasized Green’s vote for the 2005 Protection of Lawful Commerce in Arms Acts, which included the Child Safety Lock Act.", "Green himself emphasized to us that he supported the bipartisan gun legislation authored by California Democrat Mike Thompson and New York Republican Peter King, the Public Safety and Second Amendment Rights Protection Act. When we asked about Green’s voting record and his current stance on gun legislation, Green’s campaign said he supported President Obama’s 2016 executive action on gun safety.", "‘Favorite Democrat in Congress’", "Garcia’s campaign release also referred to Green as the \"NRA’s favorite Democrat in Congress.\" While that’s not a determination we can make, we looked at the current Democrats in Congress to see if like Green, any have garnered mostly high ratings and endorsements.", "Of the 232 Democrats in Congress as of early 2016, six had fielded A ratings from the NRA before their latest election. Four others, besides Green, had A- ratings. One was rated AQ.", "The \"A\" Democrats were: Rep. Sanford Bishop of Georgia, Sen. Joe Donnelly of Indiana, Reps. Collin Peterson and Tim Walz of Minnesota, Sen. Joe Manchin of West Virginia and Rep. Ron Kind of Wisconsin. Democrats besides Green with an A-: Rep. Cheri Bustos of Illinois, Sen. Jon Tester of Montana, Rep. Kurt Schrader of Oregon and Rep. Henry Cuellar of Texas. Sen. Heidi Heitkamp of North Dakota was rated AQ.", "We reached out to Sean Theriault, a professor at the University of Texas who studies Congress. He said: \"It looks like Green is among a group of Democrats who support the Second Amendment.\"", "Heading into the 2014 House elections, according to a ProPublica graphic Theriault sent us, 25 Democrats in Congress were rated from A- to A+. So, why did we identify only a dozen with that distinction? Many of the Democrats who drew high NRA marks in 2013 didn’t win re-election the next year.", "Our ruling", "Adrian Garcia said that his competitor in the Democratic race for Texas’ 29th district, Rep. Gene Green, has a \"lifetime A rating\" from the NRA and is the NRA’s \"favorite Democrat in Congress.\"", "Green has certainly been a strong supporter of gun rights over his 23 years in the House. The gun control measures Green’s campaign pointed out that he supported were part of packages like the 1994 crime bill, in which Green voted with his party.", "However, the votes Garcia cites seem to have been cherry-picked from Green’s long career in Congress. While Green has voted against child safety locks, as Garcia said, he also later voted for them. In recent years, Green has inched away from NRA interests, supporting bipartisan gun legislation and President Obama’s executive action on gun safety.", "Garcia’s claim on Green’s \"lifetime rating\" also misses Green’s 1994 sharp drop in favor with the NRA and his recent slight shift away from the organization.", "As for the NRA’s \"favorite Democrat,\" Green is not the only Democrat to support gun rights, or to be supported by the NRA. He’s not even the organization’s strongest Democratic supporter, based on its most recent ratings. He is part of a shrinking group of pro-gun Democrats.", "We rate this claim Mostly False.", "MOSTLY FALSE – The statement contains an element of truth but ignores critical facts that would give a different impression.", "Click here for more on the six PolitiFact ratings and how we select facts to check.", "Email release, Adrian Garcia for Congress, Jan. 7, 2016", "Phone interview with Jennifer Baker, director of public affairs, NRA, Jan. 13, 2016", "Phone interview with Catherine Mortensen, media liaison, NRA, Jan. 13, 2016", "Phone interview with Gene Green, Congressional representative, Texas’ 29th district, Jan. 13, 2016", "Email interview with Jose Borjon, communications director, Gene Green Congressional campaign, Jan. 13, 14 and 21, 2016", "Email interview with Sergio Cantu, spokesman, Adrian Garcia Congressional campaign, Jan. 14, 2016", "Legislation, Violent Crime Control and Law Enforcement Act, Congress.gov, 1994 (accessed Jan. 21, 2016)", "Article, \"Even before Newtown tragedy, NRA was losing Democratic support\", Washington Post, Dec. 19, 2012 (accessed Jan. 21, 2016)", "Article, \"Capitol Hill ground may be shifting on gun control,\" Houston Chronicle, Dec. 17, 2012 (accessed Feb. 1, 2016)", "Legislation, Commerce, Justice, Science, and Related Agencies Appropriations Act, Congress.gov, 2016 (accessed Jan. 21, 2016)", "Letter, from Congressional delegation to the Bureau of Alcohol, Tobacco, Firearms and Explosives, March 4, 2015 (accessed Jan. 21, 2016)", "Legislation, Brady Handgun Violence Prevention Act, Congress.gov, 1993 (accessed Jan. 21, 2016)", "Legislation, Violent and Repeat Juvenile Offender Accountability and Rehabilitation Act, Congress.gov, 1999 (accessed Jan. 21, 2016)", "Legislation, Gun Crime Enforcement and Second Amendment Restoration Act, Congress.gov, 1996 (accessed Jan. 21, 2016)", "Legislation, Mandatory Gun Show Background Check Act, Congress.gov, 1999 (accessed Jan. 21, 2016)", "Legislation, Protection of Lawful Commerce in Arms Acts, Congress.gov, 2005 (accessed Jan. 21, 2016)", "Legislation, Public Safety and Second Amendment Rights Protection Act, Congress.gov, 2013 (accessed Jan. 21, 2016)", "NRA ratings, NRAPVF.org", "Campaign finance record, Gene Green, OpenSecrets.org (accessed Jan. 21, 2016)", "Email interview, Sean Theriault, professor, University of Texas-Austin Department of Government, Jan. 20 and 21, 2016", "Graphic, \"Where Congress Stands on Guns,\" ProPublica, Jan. 16, 2013 (accessed Jan. 21, 2016)", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]