["By Eugene Kiely, Lori Robertson, Robert Farley and D'Angelo Gore", "Posted on October 31, 2019", "While the House has been conducting an impeachment inquiry, President Donald Trump and others in his administration have kept their focus on the White House-released memo on Trump’s July 25 phone call with the Ukrainian president, claiming that simply reading the “transcript” is all that’s needed to evaluate the impeachment probe. But congressional testimony has revealed key pieces of information beyond that conversation.", "Trump questioned the need for any more testimony in an Oct. 29 tweet, saying, “How many more Never Trumpers will be allowed to testify about a perfectly appropriate phone call when all anyone has to do is READ THE TRANSCRIPT!”", "Vice President Mike Pence similarly twice said in an Oct. 28 “PBS NewsHour” interview that if the American people “read the transcript,” they “will see the president did nothing wrong. There was no quid pro quo.”", "Earlier this month, on Oct. 2, Trump said, “The whistleblower was wrong. The only thing that matters is the transcript of the actual conversation that I had with the president of Ukraine. It was perfect.” (The transcript actually backed up the three main points the whistleblower made about the July phone call, as we’ve written before.)", "The House Democrats’ inquiry concerns Trump’s decision to withhold appropriated security aid to Ukraine and whether he did so to pressure Ukrainian President Volodymyr Zelensky to investigate Democrats and former Vice President Joe Biden, a potential 2020 political rival.", "Trump’s July 25 phone call was one of the events described in an Aug. 12 whistleblower complaint. Trump, according to the White House memo on the call, told Zelensky the U.S. “has been very very good to Ukraine” and asked for “a favor,” that Zelensky look into CrowdStrike, the cybersecurity firm hired by the Democratic National Committee after its computer network was hacked by Russian intelligence officers. That’s an apparent reference to a debunked conspiracy theory.", "In his phone call, Trump also asked Zelensky to investigate Biden and his son, Hunter. As we’ve written, Trump has distorted the facts when he has claimed that Joe Biden, as vice president, threatened to withhold “billions of dollars to Ukraine” unless it removed the prosecutor general who “was prosecuting” Biden’s son, Hunter, and Burisma, the Ukrainian gas company on whose board Hunter Biden had served. There’s no evidence Hunter Biden was ever being investigated or prosecuted.", "But the House impeachment probe has revealed that several government officials raised concerns about Trump’s phone call and actions before and after the call.", "While the testimony so far has occurred behind closed doors, many of the prepared opening statements have been released, and some details of the sessions have been reported by the press. The House is set to vote on a resolution on Oct. 31 that would set the rules for the next phase of the impeachment inquiry.", "Here are several key moments we have learned regarding Trump’s dealings with Ukraine.", "Time after time, Trump has falsely claimed that the White House released an “exact word-for-word transcript” or “verbatim transcript” of his July 25 phone call with Zelensky.", "But as we’ve written before, the White House memo of the call includes a “caution” note saying it “is not a verbatim transcript.” It is the “notes and recollections,” it said, of staff “assigned to listen and memorialize the conversation.”", "Ellipses are used three times in the memo, seeming to indicate missing words.", "And we have now learned that there were certain parts of Trump’s conversation with Zelensky that were not documented in the memo.", "The New York Times, citing three unnamed sources, reported that, in private testimony before House impeachment investigators on Oct. 29, Lt. Col. Alexander S. Vindman, a Ukraine expert on the White House’s National Security Council who listened in on the July 25 call, testified that certain words and phrases were omitted and that his subsequent attempt to have them included was not successful.", "“The omissions, Colonel Vindman said, included Mr. Trump’s assertion that there were recordings of former Vice President Joseph R. Biden Jr. discussing Ukraine corruption, and an explicit mention by Ukraine’s president, Volodymyr Zelensky, of Burisma Holdings, the energy company whose board employed Mr. Biden’s son Hunter,” the Times said. The newspaper also reported that Vindman “tried to change the reconstructed transcript made by the White House staff to reflect the omissions. But while some of his edits appeared to have been successful, he said, those two corrections were not made.”", "Vindman reportedly said that at the point in the memo where the third set of ellipses appears, Trump mentioned there being tapes of Biden — which the Times said was “an apparent reference” to Biden’s comments at a January 2018 event about his efforts as vice president to get Ukraine to force out Viktor Shokin as its prosecutor general.", "According to the memo, Trump said, “There’s a lot of talk about Biden’s son, that Biden stopped the prosecution and a lot of people want to find out about that so whatever you can do with the Attorney General would be great. Biden went around bragging that he stopped the prosecution so if you can look into it … It sounds horrible to me.” (As we’ve written, Biden didn’t brag about stopping “the prosecution.”)", "In his opening statement to House investigators, Vindman said he was concerned by the call and reported those concerns to the NSC’s legal counsel.", "“I did not think it was proper to demand that a foreign government investigate a U.S. citizen, and I was worried about the implications for the U.S. government’s support of Ukraine. I realized that if Ukraine pursued an investigation into the Bidens and Burisma, it would likely be interpreted as a partisan play which would undoubtedly result in Ukraine losing the bipartisan support it has thus far maintained. This would all undermine U.S. national security,” he said.", "It was known long before the whistleblower’s complaint that New York Mayor Rudy Giuliani, the president’s private lawyer, was working in Ukraine on behalf of his client. In May, the New York Times reported that Giuliani planned to visit Ukraine to encourage Zelensky to “pursue inquiries” involving political matters that could help Trump’s 2020 reelection: “One is the origin of the special counsel’s investigation into Russia’s interference in the 2016 election. The other is the involvement of former Vice President Joseph R. Biden Jr.’s son in a gas company owned by a Ukrainian oligarch.”", "But the impeachment inquiry has shed light on Giuliani’s influence on U.S. policy toward Ukraine inside the administration.", "In his Oct. 22 opening statement to the House committees, William B. Taylor, the chargé d’affaires at the U.S. Embassy in Ukraine, said there were “two channels of U.S. policy-making and implementation” in Ukraine, which he called “regular” and “highly irregular.”", "“[T]he irregular policy channel I had come to understand was guided by Mr. Giuliani,” Taylor said, and included Energy Secretary Rick Perry; Gordon Sondland, the U.S. ambassador to the European Union; and Kurt Volker, Trump’s special envoy to Ukraine at the time.", "Taylor, who spent his career in public service and had been ambassador to Ukraine from 2006 to 2009, was tapped for his current job by Secretary of State Mike Pompeo after Marie Yovanovitch’s assignment as U.S. ambassador to Ukraine was cut short in May.", "This is how Taylor described the U.S. policy toward Ukraine when he arrived in Kyiv in June:", "Taylor, Oct. 22: There appeared to be two channels of U.S. policy-making and implementation, one regular and one highly irregular. As the Chief of Mission, I had authority over the regular, formal diplomatic processes, including the bulk of the U.S. effort to support Ukraine against the Russian invasion and to help it defeat corruption. This regular channel of U.S. policy-making has consistently had strong, bipartisan support both in Congress and in all administrations since Ukraine’s independence from Russia in 1991.", "At the same time, however, there was an irregular, informal channel of U.S. policy-making with respect to Ukraine, one which included then-Special Envoy Kurt Volker, Ambassador Sondland, Secretary of Energy Rick Perry, and as I subsequently learned, Mr. Giuliani. I was clearly in the regular channel, but I was also in the irregular one to the extent that Ambassadors Volker and Sondland included me in certain conversations. Although this irregular channel was well-connected in Washington, it operated mostly outside of official State Department channels. This irregular channel began when Ambassador Volker, Ambassador Sondland, Secretary Perry, and Senator Ron Johnson briefed President Trump on May 23 upon their return from President Zelenskyy’s inauguration.", "In particular, Taylor said the “irregular channel” was working with the president to pressure Zelensky to state publicly that Ukraine would investigate Trump’s political rivals. That pressure included the withholding of U.S. security aid.", "“I became increasingly concerned,” Taylor testified, “that our relationship with Ukraine was being fundamentally undermined by an irregular, informal channel of U.S. policy-making and by the withholding of vital security assistance for domestic political reasons.”", "In his testimony, Taylor described in detail how he came to believe that security aid to Ukraine and a White House meeting for Ukrainian President Zelensky were being tied to Ukraine’s willingness to conduct investigations concerning Burisma and the 2016 election.", "Taylor said he first learned at a July 18 NSC meeting that the security aid was being held up at the direction of the president. “In an instant, I realized that one of the key pillars of our strong support for Ukraine was threatened. The irregular policy channel was running contrary to the goals of longstanding U.S. policy,” he said.", "A day later, Volker put Giuliani in touch with Andrey Yermak, a close aide to Zelensky, according to Volker’s Oct. 3 prepared written testimony and a text message posted to Twitter by Giuliani. In his opening remarks, Volker said Giuliani talked to Yermak about the need for Zelensky to issue a public statement that “would reference Burisma and 2016, in a wider context of rooting out corruption.”", "On Aug. 16, Yermak showed Volker a draft of an anti-corruption statement that “did not mention Burisma or 2016 elections.” Volker said he found it “perfectly reasonable” and Sondland, the U.S. ambassador to the European Union, “agreed it was an excellent statement.” But Giuliani criticized it, saying “the statement should include specific reference to ‘Burisma’ and ‘2016,’” Volker said.", "The idea of putting out an anti-corruption statement was shelved at around that time, Volker told the House committees. But Taylor testified that it continued into September.", "On Sept. 1, Sondland told Taylor that military aid for Ukraine also was contingent on “such investigations.”", "“[T]he push to make President Zelenskyy publicly commit to investigations of Burisma and alleged interference in the 2016 election showed how the official foreign policy of the United States was undercut by the irregular efforts led by Mr. Giuliani,” Taylor said.", "In his testimony, Taylor said that National Security Council aide Tim Morrison told him on Sept. 7 about a phone call earlier that day between Sondland and Trump. “According to Mr. Morrison, President Trump told Ambassador Sondland that he was not asking for a ‘quid pro quo.’ But President Trump did insist that President Zelenskyy go to a microphone and say he is opening investigations of Biden and 2016 election interference, and that President Zelenskyy should want to do this himself,” Taylor said.", "The next day, Sondland and Taylor spoke on the phone. Sondland told Taylor that Trump was “adamant that President Zelenskyy, himself, had to ‘clear things up and do it in public.'”", "“Ambassador Sondland said that he had talked to President Zelenskyy and Mr. Yermak and told them that, although this was not a quid pro quo, if President Zelenskyy did not ‘clear things up’ in public, we would be at a ‘stalemate.’” Taylor said.", "“I understood a ‘stalemate’ to mean that Ukraine would not receive the much-needed military assistance,” Taylor said. “Ambassador Sondland said that this conversation concluded with President Zelenskyy agreeing to make a public statement in an interview with CNN.”", "According to Taylor, Sondland described the arrangement in business terms.", "“When a businessman is about to sign a check to someone who owes him something,” Taylor recalled Sondland telling him, “the businessman asks that person to pay up before signing the check.” In his testimony, Taylor said he told Sondland “the Ukrainians did not ‘owe’ President Trump anything, and holding up security assistance for domestic political gain was ‘crazy.’”", "In a Sept. 9 text message, Taylor told Sondland: “As I said on the phone, I think it’s crazy to withhold security assistance for help with a political campaign.” After receiving that text message, Sondland called Trump. “I asked the President: ‘What do you want from Ukraine?’ The President responded, ‘Nothing. There is no quid pro quo.’ The President repeated: ‘no quid pro quo’ multiple times,” Sondland said in his opening statement to the committees on Oct. 17. “This was a very short call. And I recall the President was in a bad mood.”", "Sondland then sent this text to Taylor: “Bill, I believe you are incorrect about President Trump’s intentions. The President has been crystal clear no quid pro quo’s of any kind. The President is trying to evaluate whether Ukraine is truly going to adopt the transparency and reforms that President Zelensky promised during his campaign. I suggest we stop the back and forth by text If you still have concerns I recommend you give Lisa Kenna or S a call to discuss them directly.”", "On the same day, Michael Atkinson, the inspector general of the intelligence community, notified the House intelligence committee about the whistleblower’s complaint. Two days later, the Trump administration released the security aid to Ukraine.", "At that point, Taylor said he “reminded Mr. Yermak of the high strategic value of bipartisan support for Ukraine and the importance of not getting involved in other countries’ elections. My fear at the time was that since Ambassador Sondland had told me President Zelenskyy already agreed to do a CNN interview, President Zelenskyy would make a statement regarding ‘investigations’ that would have played into domestic U.S. politics.”", "At Taylor’s urging, he said, aides to Zelensky confirmed he would not do the CNN interview.", "One of the major revelations coming from the impeachment inquiry so far involves Trump’s former national security adviser, John Bolton.", "Bolton replaced H.R. McMaster as national security adviser in April 2018, but left office abruptly in mid-September after a falling out with Trump. In a Sept. 10 tweet, Trump said, “I informed John Bolton last night that his services are no longer needed at the White House. I disagreed strongly with many of his suggestions, as did others in the Administration.” Bolton disputed the president’s version of events in a tweet that same day: “I offered to resign last night and President Trump said, ‘Let’s talk about it tomorrow.’”", "One of the disagreements was over Ukraine policy, as described by at least two witnesses before the House committees overseeing the impeachment inquiry.", "In his prepared opening statement, Taylor recalled being told by Fiona Hill and Alexander Vindman, who were National Security Council officials at the time, that Bolton ended a July 10 meeting with Ukrainian officials over concern about the administration mixing politics with diplomacy. At that meeting, Sondland tied a possible Oval Office visit between Trump and Ukrainian President Zelensky with “investigations” — prompting Bolton to end the meeting, Taylor said.", "“Specifically, they told me that Ambassador Sondland had connected ‘investigations’ with an Oval Office meeting for President Zelenskyy, which so irritated Ambassador Bolton that he abruptly ended the meeting, telling Dr. Hill and Mr. Vindman that they should have nothing to do with domestic politics,” Taylor said of a July 19 conversation he had with Hill and Vindman. Bolton “also directed Dr. Hill to ‘brief the lawyers.’ Dr. Hill said that Ambassador Bolton referred to this as a ‘drug deal’ after the July 10 meeting. Ambassador Bolton opposed a call between President Zelenskyy and President Trump out of concern that it ‘would be a disaster,’” Taylor said.", "In her Oct. 14 testimony, Hill corroborated Taylor’s recollection of Bolton’s response to the July 10 meeting. The New York Times, in an account of Hill’s testimony, quoted Bolton as telling her: “I am not part of whatever drug deal Sondland and Mulvaney are cooking up.” She also told congressional investigators that Bolton told her: “Giuliani’s a hand grenade who’s going to blow everybody up.”", "But Sondland disputed media reports of Hill’s account. “To put it clearly: Neither she nor Ambassador Bolton shared any critical comments with me, even after our July 10, 2019 White House meeting,” Sondland said in his Oct. 17 prepared opening statement to the House committees.", "However, a third witness, Christopher J. Anderson, who was Volker’s special adviser for Ukraine negotiations from August 2017 until July 12, also told the House committees that Bolton had concerns about Giuliani’s involvement in Ukraine policy.", "In his Oct. 30 prepared opening remarks, Anderson said he and Volker met with Bolton on June 13 to discuss improving relations with Ukraine. At that meeting, Anderson said Bolton “cautioned [them] that Mr. Giuliani was a key voice with the President on Ukraine which could be an obstacle” to their efforts in Ukraine.", "Trump has maintained that one of the reasons he withheld security aid to Ukraine was because of concerns about corruption in the country. He told reporters on Sept. 23, “We want to make sure that country is honest. It’s very important to talk about corruption. If you don’t talk about corruption, why would you give money to a country that you think is corrupt?” His acting chief of staff, Mick Mulvaney, said in an Oct. 20 interview that Ukraine received the aid “[o]nce we were able to satisfy ourselves that corruption was actually — they were doing better with it.”", "But congressional testimony has shown that his top aides thought Zelensky was aggressively addressing corruption.", "Sondland said in his Oct. 17 prepared opening statement that the U.S. delegation to Zelensky’s inauguration on May 20 “developed positive views of the new Ukraine President and his desire … to address Ukraine’s well-known and longstanding corruption issues.”", "Three days later, on May 23, Sondland and other members of that delegation met with Trump to share that view. Sondland said they asked Trump to call Zelensky and host a visit with him. “However, President Trump was skeptical that Ukraine was serious about reforms and anti-corruption, and he directed those of us present at the meeting to talk to Mr. Giuliani, his personal attorney, about his concerns,” Sondland testified. “It was apparent to all of us that the key to changing the President’s mind on Ukraine was Mr. Giuliani.”", "Volker, the U.S. special envoy to Ukraine and another member of that delegation to Zelensky’s inauguration, made similar remarks in his congressional testimony, saying that in the May 23 meeting with Trump, “We stressed our finding that President Zelenskyy represented the best chance for getting Ukraine out of the mire of corruption it had been in for over 20 years.” Volker said that Trump was “very skeptical.” The president said Ukraine was “full of ‘terrible people’” who “’tried to take me down,’” Volker recalled, adding that Trump’s “negative view” was “rooted in the past,” and that Trump was “clearly receiving other information from other sources, including Mayor Giuliani.”", "Taylor also testified that he saw “encouraging” signs that Zelensky was serious about fighting corruption soon after Taylor assumed his post on June 17.", "Zelensky “had appointed reformist ministers and supported long-stalled anti-corruption legislation. He took quick executive action, including opening Ukraine’s High Anti-Corruption Court, which was established under the previous presidential administration but never allowed to operate,” Taylor said. “With his new parliamentary majority, President Zelenskyy changed the Ukrainian constitution to remove absolute immunity from Rada deputies, which had been the source of raw corruption for two decades. There was much excitement in Kyiv that this time things could be different — a new Ukraine might finally be breaking from its corrupt, post-Soviet past.”", "Editor’s Note: Click here for our full coverage on the impeachment inquiry.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]