["About this rating", "Despite a header clearly identifying it as \"satire,\" an article attributing fictitious quotes about President Trump's mental fitness to one of his sisters, Maryanne Trump Barry, prompted queries from readers as it made the social media rounds in January 2018.", "The web site Nova Magazine, which appears to specialize in a mixture of news and unfunny political satire, published the article. Here is an excerpt:", "Trump’s older sister is not happy about the behavior of her little brother, the President of the United States.", "Maryanne Trump Barry, Donald Trump’s older sister and a United States Circuit Judge, told reporters over the weekend, “Donnie’s not acting right. ”", "The 80-year-old also says she believes that President Trump might be forgetting to take his pills.", "“I don’t recognize the Donnie who’s in the White House right now,” added Judge Trump Barry, who friends describe as very loyal to her younger brother.", "“Donnie was never a smart boy, no matter what he tells you. In fact, the neighborhood kids used to call him ‘Donnie Dimwit.’ But recently he seems to be operating at an even lower IQ, and that’s not good for the country.”", "Although Trump does have two older sisters, one of whom is inactive Senior Circuit Court Judge Maryanne Trump Barry, apart from reportedly likening him to P.T. Barnum on a past occasion she has not been known to criticize her brother Donald in public — and certainly has said nothing on the order of the disparaging statements attributed to her in this article.", "The spoof was apparently inspired by the release of the Michael Wolff exposé Fire and Fury: Inside the Trump White House, which asserts that some of President Trump's own aides question the 71-year-old's mental stability and competence. The provenance and accuracy of some of Wolff's claims have been questioned by other journalists.", "His fitness for office has been defended by White House spokeswoman Sarah Huckabee Sanders, who called him an \"incredibly strong and good leader,\" and by Trump himself, who issued a tweet saying he qualifies as a genius, \"and a very stable genius at that!\"", "White House physician Navy Rear Adm. Ronny Jackson conducted a cognitive assessment of Trump during the presidents's annual medical exam and said he did \"exceedingly well,\" scoring 30 out of 30 on a test designed to detect mild cognitive impairment. \"I find no reason whatsoever to think the president has any issues whatsoever with his thought process,\" Jackson said during a 16 January White House press conference.", "Barbash, Fred.  \"Meet Donald Trump's Sister, the Tough, Respected Federal Judge Ted Cruz Called a 'Radical Pro-Abortion Extremist.\"\r\n  The Washington Post.  8 March 2016.", "Johnson, Jenna and Bernstein, Lenny.  \"Trump Did 'Exceedingly Well' on a Cognitive Test, Top White House Doctor Says.\"\r\n  The Washington Post.  16 January 2018.", "Katz, Matt.  \"Trump's Sister, the Judge: A Life Vastly Different, But Often Intertwined.\"\r\n  WNYC.  18 May 2016.", "Liptak, Kevin.  \"Trump Is 'in Excellent Health,' White House Doctor Says.\r\n  CNN.  13 January 2018.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]