["About this rating", "On 23 December 2016, the Federalist Papers Project published an article reporting that former United States presidents would be boycotting Donald Trump's 20 January 2017 inauguration ceremonies:", "SNUB! Former Presidents Refuse To Attend Trump’s Inauguration", "In what amounts to a snub of presidential proportions, three of the four living ex-U.S. Presidents might not be going to Donald Trump’s inauguration.", "So far, President Jimmy Carter is the only one who confirmed he will be attending.", "While it is true that Jimmy Carter was the only president scheduled to attend Trump's inauguration at the time the referenced report was published (he reportedly confirmed his attendance while teaching a Sunday school class in Georgia), the potential absence of the other former presidents would not be a \"snub of presidential proportions,\" or even a highly unusual occurrence.", "Former presidents are typically invited to attend their successors' inaugurations, but it is not uncommon for them to skip such events. For example, according to CBS News, Gerald Ford did not attend George W. Bush's second inauguration in 2005. And while all four living presidents were present at Barack Obama's inauguration in 2009, George W. Bush and George H.W. Bush did not attend similar ceremonies in 2013 after Obama's successful re-election bid.", "Furthermore, while the elder Bush said that health reasons would keep him from attending Trump's inauguration, the inauguration plans for George W. Bush were still unknown. A spokesperson for the younger Bush said “we simply don’t discuss his schedule this far in advance,” making claims that the former president had \"snubbed\" Trump premature, at best.", "Bill Clinton also did not announce whether or not he would attend the event. He attended the inauguration ceremonies for both Presidents George W. Bush and Barack Obama, but his invitation to Trump's inauguration brought extra scrutiny:", "For Trump’s inauguration, the Clinton camp has been especially divided over whether Bill Clinton should accept his invitation as a former president.", "After a particularly personal and vicious presidential contest between Trump and Hillary Clinton, the former president has been leaning toward skipping the inauguration confab, according to a source in the Clinton camp.", "Since the invitation is addressed only to the former president, and the former first lady attends as his guest, some have interpreted this caveat as an out for Hillary Clinton. There have been ongoing discussions over whether, as a former first lady, she should sit on the inauguration stage in front of the Capitol, where network cameras will pan to her every reaction.", "However, on 3 January 2017 a Hillary Clinton aide told USA Today that she would be attending Donald Trump's inauguration along with her husband, former President Bill Clinton. The same article that carried that news also noted that former President George W. Bush was scheduled to be present for the inaugural ceremony as well:", "Two months after her election loss, Hillary Clinton plans to be in the crowd for the Jan. 20 inauguration of President-elect Donald Trump.", "An aide to the Democratic nominee confirmed that she and former President Bill Clinton will attend [the] ceremony, speaking on condition of anonymity until plans are announced publicly.", "It will be the first joint public appearance by Trump and Hillary Clinton since the three presidential debates that preceded Trump's surprise election victory.", "Bill Clinton will be one at least three ex-presidents at the Jan. 20 inauguration of Trump; George W. Bush and Jimmy Carter have also announced plans to attend.", "Vejnoska, Jill.   \"Jimmy Carter says he’ll attend Donald Trump’s inauguration.\"\r\n    Atlanta Journal Constitution.   4 December 2016.", "CBS News.   \"So far, just one president has RSVP'd \"yes\" to Trump's inauguration.\"\r\n    23 December 2016.", "Palmeri, Tara.   \"Carter is only former president to RSVP for Trump's inauguration.\"\r\n    Politico.   22 December 2016.", "Jackson, David.   \"Hillary Clinton, Bill Clinton, George W. Bush to attend Trump inauguration.\"\r\n    USA Today.   3 January 2017.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]