["About this rating", "After U.S. President-elect Joe Biden experienced two hairline fractures in his foot when he took a spill while walking his adopted German shepherd, Major, in late November 2020, his furry friend-elect was quick to deny any wrongdoing.", "Deflecting any apparent guilt in the accident, Major shared a “statement” to Instagram on Nov. 29 and Twitter on Dec. 1. In the statement, Major supposedly stated that he wished his “adopted father” a “speedy recovery” and “strongly maintain[ed] that I have done nothing wrong.”", "Some media publications ran with the statement, reporting that the supposed statements came from Biden’s team. Snopes readers asked our team to verify whether members of the president-elect’s team had indeed shared the statement on behalf of Major.", "Our analysis determined that the statement came from the “pawficial” Instagram and Twitter accounts of the Biden’s two German shepherds, Champ and Major, which appear to be unofficial fan pages.", "“We are the First Dogs of the USA, Champ and Major Biden’s pawfficial fan page. You can call us #DOTUS. We love nom noms, snuggles & roaming in the WH!” reads the Instagram profile page of @first_dogs_usa, which had 65,200 followers at the time of this publication.", "It appears that the Twitter account by the same name, @firstdogsusa, joined the platform in June 2020, and had over 5,600 followers at the time of writing. The account is said to be “dedicated to the first dogs of the United States, Champ and Major Biden.”", "Neither account has been verified by the social media platforms. In response to our inquiries for another fact check, the Biden-Harris transition confirmed that, as of Dec. 14, neither Champ nor Major had any official social media presence. This provides confirmation that the source of the \"Bark\" statement, @firstdogsusa, was unofficial. Snopes sent a message to the account on Twitter in an attempt to clarify who runs the fan pages, but did not receive a bark back at the time of publication. We will update the article accordingly.", "Update [Dec. 17 2020]: This article was updated to include confirmation from the Biden-Harris transition team that neither Champ nor Major had any official social media presence at the time of publication.", "Madison Dapcevich is a freelance contributor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]