["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "President-elect Joe Biden puts on his face mask after speaking about jobs at The Queen theater on Dec. 4, 2020, in Wilmington, Del. (AP)", "Joe Biden did not “confirm” an agenda to implant microchips in Americans.", "A 2005 C-SPAN clip cited in the post shows Biden questioning then-Supreme Court nominee John Roberts about privacy rights.", "An old conspiracy theory about vaccines and microchips has resurfaced on Instagram. This time, President-elect Joe Biden is implicated.", "A Dec. 9 post shows a video of Biden in 2005, when he was a senator from Delaware. In the clip, Biden asks then-Supreme Court nominee John Roberts about how he’d rule on \"consequential decisions in the 21st century.\"", "\"Can a microscopic tag be implanted in a person’s body to track his every movement?\" Biden asks. \"There’s actual discussion about that. You will rule on that, mark my words, before your tenure is over.\"", "The account that posted the video, @endtime.signs, took Biden’s line of questioning as proof that the real goal behind the coronavirus vaccine is to implant Americans with microchips.", "\"This is the greater agenda, and he’s known it for years!\" the post’s caption says. \"The vaccine that we’re currently seeing is simply a stepping stone to the future chip that he mentions here.\"", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook, which owns Instagram.) The clip has more than 38,000 views.", "(Screenshot from Instagram)", "On Dec. 9, the U.S. set a record for the most COVID-19 deaths in a single day since the pandemic began. As federal regulators deliberate whether to issue emergency use authorization for a vaccine from Pfizer, anti-vaccine misinformation has proliferated on social media.", "This Instagram post is the latest example of that misinformation — the coronavirus vaccine is not part of a plan to track people using microchips. The video shows Biden criticizing the idea of tracking people with microchips, not supporting it.", "Back in April, we saw a false claim that Democrats are pushing for everyone to get implanted with microchips via mandatory vaccinations. The notion appeared to stem from an incorrect interpretation of something Microsoft founder Bill Gates said in March about a system for at-home COVID-19 testing.", "This video clip of Biden questioning Roberts in 2005 doesn’t add any new or relevant information to the false premise. The video was taken out of the larger context of a hearing during which Biden argued that a liberal interpretation of the Constitution was needed to protect the rights of Americans — particularly their right to privacy.", "Here’s what he said to Roberts, in context:", "\"Judge, I do not believe in a Constitution where individuals could for very long have accomplished what we did had we read it in such a narrow way. Like the Founders, I believe our Constitution is as big and as grand and as great as its people. Our constitutional journey did not stop with women being barred from being lawyers, with 10-year-olds working in coal mines, or Black kids forced into different schools than white kids. Just because in the Constitution nowhere does it mention sex discrimination, child labor, segregation — it doesn't mention it. Our constitutional journey did not stop then, and it must not stop now, judge. And we’ll be faced with equally consequential decisions in the 21st century.", "Can a microscopic tag be implanted in a person’s body to track his every movement? There is actual discussion about that. You will rule on that, mark my words, before your tenure is over. Can brain scans be used to determine whether a person is inclined toward criminality or violent behavior? You will rule on that. And, judge, I need to know whether you will be a justice who believes that the constitutional journey must continue to speak to these consequential decisions, or that we have gone far enough in protecting against government intrusion into our autonomy, into the most personal decisions we make. Judge, that is why this is a critical moment.\"", "The president-elect has not called for microchipping people who receive the COVID-19 vaccine, and there’s no evidence the vaccine is a \"stepping stone\" toward tracking people", "The Instagram post is inaccurate and makes a ridiculous claim. We rate it Pants on Fire!", "C-SPAN, Roberts Confirmation Hearing, Day 1, Sept. 12, 2005", "The Hill, \"US sets new record with over 3,000 COVID deaths in a single day,\" Dec. 9, 2020", "Instagram post, Dec. 9, 2020", "PolitiFact, \"No, Democrats aren’t pushing microchips to fight coronavirus,\" April 23, 2020", "Stat, \"FDA advisory panel endorses Pfizer/BioNTech Covid-19 vaccine,\" Dec. 10, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]