["New York Gov. Andrew Cuomo at a news conference at the Jacob Javits Center in New York City on March 24, 2020. (AP)", "• In the first round of federal funding for health care providers, New York state has received far less money than less-affected states, according to an analysis by Kaiser Health News.", "• Cuomo addressed only one segment of the stimulus aid, and glossed over the distinction between states and the health care providers within those states. The funding source he tweeted about sends money directly to providers, not to states.", "• Subsequent batches of funding are supposed to favor states with higher coronavirus case loads.", "New York Gov. Andrew Cuomo, whose daily press briefings on the state’s battle against the coronavirus have drawn wide coverage, has extended his rhetorical reach through social media.", "On April 12, Cuomo took to Twitter to spotlight what he saw as a disparity in federal funding between New York and states that had fewer coronavirus cases.", "\"Some states, like Montana and Nebraska, are getting more than $300,000 in federal stimulus money per reported COVID-19 case. New York is the hardest-hit state and yet we are getting only about $12,000 per case,\" Cuomo tweeted.", "Some states, like Montana and Nebraska, are getting more than $300,000 in federal stimulus money per reported COVID-19 case.New York is the hardest-hit state and yet we are getting only about $12,000 per case.We need a fair federal stimulus bill that is distributed by need.", "We found that the statement relies on a credible study of how one part of the federal funding is being divided among the states, though it glosses over the fact that it’s counting money going to health care providers directly, rather than to the states themselves.", "The number of coronavirus cases changes by day, and even by the hour. But at the time he made his claim, Cuomo was correct to say the difference between New York and the other two states was lopsided.", "New York has been hardest hit by the coronavirus. On April 12, the state reported a cumulative 195,031 known cases of the virus.", "Montana and Nebraska, which have far smaller populations, saw much smaller outbreaks of the virus at the time: Montana had 394 reported cases, while Nebraska reported 792.", "The money Cuomo is referencing comes from the $2.2 trillion federal coronavirus aid package passed in March, known as the CARES Act.", "While that bill earmarked $150 billion directly for state, local and tribal governments, the breakdown Cuomo is referring to comes from a different provision that provides funds directly to hospitals and other health care providers.", "This portion of the CARES Act allocates up to $100 billion to health care providers. When Cuomo sent his tweet, $30 billion of that total had been distributed.", "According to the U.S. Department of Health and Human Services, providers have received money from the stimulus bill based on a formula that involves how much money they received from Medicare reimbursements in 2019 (excluding payments under Medicare Advantage, which works through private insurers).", "HHS estimated that these Medicare reimbursements amounted to $484 billion in 2019. Because HHS wanted to push the first $30 billion of coronavirus aid out the door quickly, it allocated the money based on providers’ share of these reimbursements from 2019.", "In other words, the formula for this first stage of funding had nothing to do with the number of coronavirus cases a state was facing.", "Using these guidelines, Kaiser Health News, a PolitiFact fact-checking partner, calculated how much money providers in each state had received from the $30 billion. The publication based these numbers on a House Ways and Means Committee funds breakdown and New York Times daily coronavirus numbers.", "The analysis was originally published two days before Cuomo’s tweet.", "According to Kaiser Health News’ published analysis, hospitals and providers in New York state were due to receive stimulus money amounting to $12,000 per coronavirus case at the time.", "Providers in states with fewer cases, such as Montana and Nebraska, had received over $300,000 per case, according to the analysis.", "So Cuomo’s tweet tracks what the Kaiser Health News analysis found, though it’s worth noting that the total amount given to New York providers in this initial round, nearly $1.9 billion, was significantly more than what went to the other states: about $111 million for Montana and $225 million for Nebraska, according to the authors of the analysis.", "Jack Hoadley, an emeritus professor at Georgetown University’s Health Policy Institute, told PolitiFact New York that the Kaiser study’s methodology was sound. He added that later rounds should address this imbalance. HHS has said that the next wave of the $100 billion will take into account how many coronavirus cases each state has.", "This \"should respond at least in part to the concern raised by Gov. Cuomo,\" he said, though \"more information is needed before we can assess the dollars-per-patient metric\" down the road.", "Freeman Klopott, a spokesman for the New York State Division of the Budget, told PolitiFact that \"the tweet relied on information from a Kaiser Health News article and quoted it nearly word for word. There’s no question that the facts are accurate and there is a disparity in the federal funding structure among states in this regard.\"", "Cuomo tweeted, \"Some states, like Montana and Nebraska, are getting more than $300,000 in federal stimulus money per reported COVID-19 case. New York is the hardest-hit state and yet we are getting only about $12,000 per case,\"", "In the first round of funding for health care providers, New York state’s providers received far less money per coronavirus case than other, less-affected states, according to a credible analysis. However, Cuomo’s tweet addressed only one part of the federal funding, and it glossed over the distinction between states and health care providers in those states. The funding source Cuomo tweeted about sends money to providers, not the state.", "The statement is accurate but needs additional information, so we rate it Mostly True.", "Andrew Cuomo, tweet about coronavirus funding in New York State, April 12, 2020", "New York State Department of Health, NYS-COVID-19 Tracker, April 12, 2020", "Montana State Library, COVID-19 Tracker, April 12, 2020", "Nebraska Department of Health and Human Services, COVID-19 Tracker, April, 12, 2020", "Department of Human and Health Services, CARES Act Provider Relief Fund, accessed April 19, 2020", "Kaiser Health News, Furor Erupts: Billions Going To Hospitals Based On Medicare Billings, Not COVID-19, accessed April 18, 2020", "New York Times, Coronavirus in the U.S.: Latest Map and Case Count, accessed April 18, 2020", "New York Times, N.Y. Got $12,000 Per Virus Case, by One Count. Nebraska Got $379,000, April 14, 2020", "Email interview with Jack Hoadley, professor emeritus in the Health Policy Institute of Georgetown University’s McCourt School of Public Policy, April 27, 2020", "Email interview with Elizabeth Lucas, data editor for Kaiser Health News, April 29, 2020", "Email interview with Freeman Klopott, spokesman for the New York State Department of the Budget, April 29, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]