["By Saranac Hale Spencer", "Posted on April 3, 2020", "A viral video makes the bogus claim that House Speaker Nancy Pelosi’s Jan. 31 tweet criticized the Trump administration’s restriction on travelers from China to slow the spread of the novel coronavirus. Her tweet was unrelated to those travel restrictions.", "President Donald Trump instituted travel restrictions on five Muslim majority countries during his first year in office. This year, on Jan. 31, he added more countries to the list.", "House Speaker Nancy Pelosi, who has opposed that policy from the start, took to Twitter to criticize the expansion, calling it an “un-American travel ban.”", "Now, two months later, a video that’s been viewed more than 2 million times on Facebook and YouTube falsely claims that her tweet was about Trump’s decision on the same day to restrict travelers coming from China in an effort to slow the spread of the novel coronavirus.", "These are two distinct and unrelated actions that were each taken on Jan. 31. Pelosi’s tweet wasn’t about the restrictions imposed because of the coronavirus.", "In the first instance, Trump expanded his controversial ban on certain foreign nationals from mostly predominately Muslim countries. He added six new countries to the existing list of those affected — Burma (Myanmar), Eritrea, Kyrgyzstan, Nigeria, Sudan, and Tanzania. Half of them are majority Muslim, according to the Pew Research Center.", "Pelosi responded to that expansion in a tweet that said: “The Trump Admin’s expansion of its un-American travel ban is a threat to our security, our values and the rule of law. Barring more than 350 million people from predominantly African countries from traveling to the US, this rule is discrimination disguised as policy.”", "The video claims that tweet is evidence that Pelosi had initially characterized Trump’s move to restrict travel from China as “overreacting” to the novel coronavirus outbreak.", "It’s not. As we said, her tweet was addressing an unrelated policy that was signed on the same day.", "In the second action, which was aimed at addressing the spread of the novel-coronavirus, Trump limited travel for non-U.S. citizens, except for the immediate family of citizens and permanent residents, who were in China within two weeks of coming to the U.S.", "Pelosi has not addressed that policy on Twitter, or anywhere else that we could find. We searched the Congressional Record, reviewed her weekly press briefings and other public appearances, and scoured news coverage on LexisNexis. We could find no comment from Pelosi regarding her position on that decision.", "“The Dan Bongino Show,” which posted the video, did not respond to a request for comment.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "Trump, Donald. Presidential Proclamation Enhancing Vetting Capabilities and Processes for Detecting Attempted Entry Into the United States by Terrorists or Other Public-Safety Threats. 24 Sep 2017.", "Gore, D’Angelo and Lori Robertson. “Trump’s ‘Travel Ban’ Doesn’t Affect All Muslims.” FactCheck.org. 28 Jun 2018.", "Farley, Robert. “The Facts on Trump’s Travel Restrictions.” FactCheck.org. 6 Mar 2020.", "Pelosi, Nancy (@SpeakerPelosi). “The Trump Admin’s expansion of its un-American travel ban is a threat to our security, our values and the rule of law. Barring more than 350 million people from predominantly African countries from traveling to the US, this rule is discrimination disguised as policy.” Twitter. 31 Jan 2020.", "Trump, Donald. Proclamation on Improving Enhanced Vetting Capabilities and Processes for Detecting Attempted Entry. 31 Jan 2020.", "Trump, Donald. Proclamation on Suspension of Entry as Immigrants and Nonimmigrants of Persons who Pose a Risk of Transmitting 2019 Novel Coronavirus. 31 Jan 2020.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]