["In May 2018, Priyanka Chopra’s visit to a Rohingya refugee camp in Bangladesh’s Cox Bazaar as a UNICEF goodwill ambassador invited much slander and abuse. Now, a photograph showing Chopra wearing a burqa is being shared across social media platforms with the claim that the actress had donned the attire when she met ‘extremist’ Rohingya Muslims in Bangladesh.", "दोगले फ़िल्मबाजों का दोगलापन, भारत मे घूमो तो फूहड़ परिधान लेकिन बांग्लादेश के कट्टरवादी रोहिंग्या मुसलमानों से मिलते समय बुरखा 🤣", "Posted by योगी आदित्यनाथ की सेना on Thursday, July 5, 2018", "The above post is by the Facebook page Yogi Adityanath Ki Sena. It was posted on July 5 and has been shared more than 11,000 times so far. The accompanying message says, “दोगले फ़िल्मबाजों का दोगलापन, भारत मे घूमो तो फूहड़ परिधान लेकिन बांग्लादेश के कट्टरवादी रोहिंग्या मुसलमानों से मिलते समय बुरखा” (Hypocrisy of hypocrite film stars, will wear anything in India but will wear burqa when meeting extremist Rohingya Muslims in Bangladesh- translation).", "Individual users on Facebook have shared/uploaded this photograph, and it has also been shared by social media users on Twitter.", "In 2011, Priyanka Chopra had starred in a movie directed by Vishal Bharadwaj named ‘Saat Khoon Maaf’. It was for this movie that Chopra had donned a burqa. The photograph dates back to 2010. It was uploaded by Outlook on its website.", "Posted below is a YouTube video of an extract from the movie in which Priyanka Chopra can be seen wearing the same burqa.", "There is yet another occasion where Chopra wore a burqa. This was tweeted by her in October 2015 and was part of the promotional campaign for Quantico.", "My chauffeur Maqbool Bhai got the burka from Mohammad ali road Mumbai.. @SamiRattner styled it #Quantico https://t.co/nwKm6ygb6y", "— PRIYANKA (@priyankachopra) October 26, 2015", "The Facebook page ‘Yogi Adityanath ki Sena‘ which shared the misleading image of Priyanka Chopra is notorious for spreading mis/disinformation in form of fake or misleading quotes, images and videos. Some of the instances documented by Alt News include fake quotes attributed to Jyotiraditya Scidia, Ravish Kumar, Rana Ayyub and Nana Patekar.", "Actress Priyanka Chopra has been at the receiving end of right-wing trolling on social media in recent times. Recently, a controversial episode of the American television series Quantico which showed a Hindu extremist as part of a terror plot on New York had attracted much criticism and ridicule, coming shortly on the heels of her visit to the Rohingya refugee camp. Now, the actress is once again in the crosshairs and continues to be targeted relentlessly.", "Donate Now", "Arjun Sidharth is a writer with Alt News. He has previously worked in the television news industry, where he managed news bulletins and breaking news scenarios, apart from scripting numerous prime time television stories. He has also been actively involved with various freelance projects. Sidharth has studied economics, political science, international relations and journalism. He has a keen interest in books, movies, music, sports, politics, foreign policy, history and economics. His hobbies include reading, watching movies and indoor gaming.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "Trigger Warning: Sexual Violence A distressing video of a girl forced to take her clothes…", "A clip featuring Pakistan men’s Cricket team captain Babar Azam is viral on social media…", "A 13-second clip featuring Bollywood actor Shah Rukh Khan is being shared on social media…", "Union minister of information and broadcasting Anurag Thakur on September 26 announced Waheeda Rehman as…"]