["The video was published here on Facebook on July 7, 2020. It has been viewed more than 1.7 million times and shared 54,000 times.", "It was shared here in a Myanmar-based Facebook group.", "The 42-second clip is a split screen video that features Chan speaking on the left, and stacks of British and euro banknotes on the right.", "The text superimposed on the video reads: “STAY AT HOME. Jackie Chan gift money”.", "The post reads, in part: \"for all countries .. !!! Register from home and get prizes in 5 minutes, we are publishing this to help those who are affected by the explosion of CORONA virus. Pick the first letter of your name and you will receive a gift of your choice….Your money will be sent 5 minutes after registering your name\".", "The same video was also viewed here, here and here on Facebook alongside similar claims.", "The claim is false.", "Jackie Chan video", "A reverse Google Image search with keyframes extracted from the footage in the misleading posts found a longer version of the video published here on Jackie Chan’s official Facebook page on April 3, 2020.", "In the video, Chan says, in part: “Hello I am Jackie Chan. I know it is a very difficult time for everyone right now. And we all face the same problem - the coronavirus....Protecting yourself is protecting your family. Stay safe. Stay strong. I too believe we have a brighter future ahead. Thank you.”", "Chan does not mention handouts at any point during the video.", "Below is a screenshot comparison of the video in the misleading post (L) and the video on Chan’s Facebook page (R):", "Banknotes video", "A second reverse image search also found a longer version of the video in the misleading posts published here on the Instagram account of US boxer Floyd Mayweather.", "The video is captioned “Pounds and a few Euros”. It is dated May 27, 2017, more than two years before the COVID-19 pandemic.", "Below is a screenshot comparison of the video in the misleading posts (L) and Mayweather’s Instagram post (R):", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]