["A few hours after heavy rain fell on September 9, 2020, in Ota in Nigeria’s southwestern Ogun state, Facebook user Augustine Whyte was one of the first to post on the social network that it rained blood in the town.", "Whyte’s post, which includes two photos and a video showing a red substance flooding a major highway next to an overhead bridge, is captioned: “What a miracle!! Bloody rain at otta (sic).” Ota is home to Nigeria’s former president, Olusegun Obasanjo.", "More than 1,300 people have shared the post since it was published on September 9, 2020. Some of the comments express shock, while others are sceptical of the claim.", "AFP Fact Check found that the two images in Whyte’s post were reposted with similar captions by multiple social media accounts, including Islamic Media House -IMH, a Facebook page with more than 45,000 followers.", "AFP Fact Check has debunked a similar post claiming a river in Congo had turned red with blood.", "Although blood rain is a genuine weather phenomenon where a high concentration of red-hued particles -- often from the desert -- mix with clouds to give raindrops a reddish colour, neither the footage nor the images show that it rained blood in Ota.", "First, AFP Fact Check confirmed the scene was indeed recorded in Nigeria’s Ogun state. Using Google Maps Street View, we found a picture of the exact location in Ota.", "The overhead bridge, buildings, the shape of the road and other physical features in the video can be seen on the Google Maps Street View.", "A closer look at the footage reveals that the ruddy water was only flowing on the ground, while other objects such as umbrellas, bricks, car roofs, as well as the pavement, were left unmarked by the substance.", "In fact, the raindrops seen in the footage appear colourless.", "AFP Fact Check found a different Facebook post that shows an SUV covered with a similar reddish liquid.", "The post alleges that the incident was the “first time in Nigeria rain is seen falling from the sky in the form of blood”.", "However, when we ran a reverse image search on the picture of the vehicle, we traced it to an advertisement for a liquid car cleanser from May 2020.", "Contacted by AFP Fact Check, the Nigerian Meteorological Agency (NiMet) and Ogun state government said they had never heard of the incident.", "“We are unaware of this occurrence in the stated location,” said Fabiya Aminu, NiMet’s desk officer.", "Rotimi Oduniyi, the spokesman for the state’s ministry of environment, said that government stakeholders in the area would have called their attention to the event, as well as notifying the national emergency agency “if it was true”.", "Oduniyi was approached again three weeks later to confirm if the phenomenon was perhaps the result of a localised chemical spill. His reply has not yet been received.", "AFP Fact Check contacted two weather experts who dismissed the claim that it had rained blood.", "“That information is far from the truth,” said Adebowale Balogun, an associate professor of urban climate, biometeorology and climate change at the Federal University of Technology in Akure.", "“There must have been a chemical spill from an industry of close proximity. The fact that there was rain accounts for why the spill was washed out to the streets.”", "Oluleye Ayodeji, an associate professor and industrial pollution expert at the same institution, agreed. “This looks like a chemical spill,” he told AFP Fact Check in an emailed response.", "Ogun is a neighbouring state to Nigeria’s commercial hub Lagos and it is prominent in the west African country for its high concentration of industrial estates. Nigerian daily newspaper BusinessDay recently reported that in the past six years, investors have preferred Ogun to Lagos as a location for new plants.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]