["On May 19, Congress spokesperson Randeep Singh Surjewala tweeted an image of a woman riding a bicycle with an infant wrapped on her back and a sack tugged on to the cycle’s rear seat. Surjewala wrote in Hindi, “New India’s truth (translated from न्यू इंडिया का सच!).” This tweet was retweeted at least 190 times. Surjewala subsequently deleted the tweet without any clarification. Below is a screenshot of an archived link of the tweet that can be accessed here. Readers should note the time stamp on the archived tweet is not as per the Indian Standard Time (IST).", "Alt News performed a reverse image search on Bing, and found that the viral image was published on UK-based blog ‘cyclechic.co.uk‘. The image on the 2016 article was sourced to Pinterest which credited it to “Info News.” The caption on the image reads, “This picture of a mother and her baby was taken in Nepalgunj, Nepal where bicycle travel is the usual transportation.” However, the link to Info News is no longer functional. On May 19, Times of India published a fact-check report and found that the image is available on European Pressphoto Agency. As per the details on the stock photo agency, the image was clicked by Narendra Shrestha on June 29, 2012. The caption reads, “A Nepalese mother carrying a child on her back as she travels on a bicycle towards Nepalgunj city, some 573 kilometers from capital Kathmandu, Nepal, 29 June 2012.” Thus Congress spokesperson Randeep Singh Surjewala tweeted an 8-year-old image from Nepal and India and later took it down. This was in the backdrop of migrant workers, stranded across the country due to the lockdown, taking all possible measures to return to their native states.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]