["By Eugene Kiely", "Posted on July 20, 2018", "In recent tweets, President Donald Trump has made erroneous statements about U.S farmers, and soybean prices in particular, while complaining about trade barriers:", "The president has made negotiating better trade deals a high priority in his first term. In his attempt to gain leverage in negotiations, his administration has imposed tariffs, for example, on the importation of solar panels, washing machines, steel and aluminium, as chronicled by the Peterson Institute for International Economics.", "On July 6, the U.S. began imposing tariffs on $34 billion in Chinese imports. China retaliated with equal tariffs on $34 billion in U.S. goods, including on U.S. soybeans, wheat, corn, sorghum and beef.", "As we wrote in a previous article, soybeans were the top U.S. agricultural export in 2017 at $21.6 billion, according to the U.S. Department of Agriculture. Agricultural economic experts we spoke with for that story warned that a prolonged trade war would hurt U.S. farmers in general and soybean farmers in particular.", "In a July 20 tweet, the president said that “Farmers will WIN!” under his trade policies, which is his opinion. But he made false claims in supporting that position in two recent tweets:", "I am in Brussels, but always thinking about our farmers. Soy beans fell 50% from 2012 to my election. Farmers have done poorly for 15 years. Other countries’ trade barriers and tariffs have been destroying their businesses. I will open…", "— Donald J. Trump (@realDonaldTrump) July 11, 2018", "Farmers have been on a downward trend for 15 years. The price of soybeans has fallen 50% since 5 years before the Election. A big reason is bad (terrible) Trade Deals with other countries. They put on massive Tariffs and Barriers. Canada charges 275% on Dairy. Farmers will WIN!", "— Donald J. Trump (@realDonaldTrump) July 20, 2018", "It is simply not true that “Farmers have done poorly for 15 years.”", "U.S. farms have seen net farm income generally decline in the last five years. But they “experienced a golden period during 2011 through 2014 due to strong commodity prices and robust agricultural exports,” according to a February report by the nonpartisan Congressional Research Service.", "According to USDA data, net farm income in real inflation-adjusted dollars reached a record $133.6 billion in 2013. (That was due in large part to the 2012 drought, as we’ll explain.)", "Net farm income has been in decline since 2013, as the USDA chart below shows.", "It is also not true that the recent “downward trend,” as Trump called it, is due to trade.", "As Wallace E. Tyner, an agricultural economics professor at Purdue University, told us for a previous story: “The ag sector is seeing some hard times, but it is because of lower prices and not trade. Weather has been pretty good, production high, and prices therefore lower.” (See “Trump Distorts Facts on Agricultural Trade” for more information.)", "As for soybeans, Trump is generally correct that soybean prices are down from five years ago — but not as much as he says and not for the reason he claims.", "A July 16 USDA report shows that soybean prices received by U.S. farmers were $14.40 per bushel in the 2012/2013 marketing year, which is from September through August. The price in the 2017/2018 marketing year was $9.35 per bushel – a decline of $5.05 per bushel or 35 percent.", "Monthly USDA data show that the peak price for soybeans since 2009 came in August 2012, when it reached $16.20 per bushel. As of May 2018, the most recent month for which data are available, the price was $9.84 — a 39 percent decline from the peak.", "That’s not quite 50 percent, but it is a considerable drop. What caused the decline in prices? Trump says “a big reason is bad (terrible) Trade Deals with other countries.” That’s false.", "For Trump’s claims on soybeans, we again contacted Tyner, the Purdue agricultural economics professor. Tyner told us that the decline in prices for soybeans “was not due to trade policy.”", "“Remember that 2012 was a severe drought year, so the prices were high because of low production – not policy,” he said. “If you start from a high number, the change looks larger. Look at the non-drought years.”", "How bad was the 2012 drought?", "In November 2012, the Bureau of Labor Statistics issued a report on the impact of the 2012 drought on crops. BLS called it “the most severe drought the United States has seen since the 1950s.”", "But, the report said, “the severe drought that has affected much of the nation drove crop prices up.” U.S. soybeans had their “smallest harvest in 9 years,” the report said.", "As we noted earlier, the price of soybeans peaked in the 2012/2013 marketing year.", "An Aug. 30, 2013, report by the Congressional Research Service on U.S. farm income said the unexpected drought caused a “dramatic reversal of fortunes” for U.S. farmers.", "“The 2012/2013 growing season will be remembered for the dramatic reversal of fortunes where by early springtime prospects for record harvests and low commodity prices were transformed in a two-month period into an outlook of supply shortages and record-high commodity prices,” the report said.", "So, contrary to the president’s claim, “bad (terrible) Trade Deals with other countries” are not to blame for the drop in soybean prices from five years ago.", "The prices have, in fact, returned to those in non-drought years, as Tyner said and as the chart below shows.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]