["About this rating", "On 30 September 2016, the web site American News X published an article reporting that Donald Trump had stiffed the wedding caterer hired for his wedding to second wife Marla Maples in 1993:", "Today I did something I never did before — I ‘defriended’ someone who chastised me in a letter about how offended she was by “Trumped Up Cards,” and how she wanted me to know she was voting for Trump. This was not a fb friend, but someone who subscribes to my website newsletter (christinelavin.com). So I told her a true story I’ve known about Trump since 1994.", "An actor friend of mine worked for a caterer in 1993. It was a new caterer, and this caterer was thrilled to land the kind of job that can really boost a career — catering Donald Trump and Marla Maples wedding. At the time she wondered why he didn’t hire other caterers he’d used in the past, but just thanked her lucky stars he hired her.", "Everything went beautifully — the food was a hit, the waiters/waitresses all were totally professional. Everything was first rate.", "Donald Trump refused to pay the bill. He told the caterer, “I know you are new at this, and when you tell people you catered MY wedding, you will get more business than you could ever dream of. So I am doing you a favor. And when I do favors, I don’t pay. End of discussion.”", "This is not a story I recently heard — it’s one I heard 22 years ago. We know many stories like this now.", "The story quoted here is full of red flags. In addition to working in an unnecessary plug for her newsletter, the author relates what is essentially a 22-year-old friend-of-a-friend tale with no more substantiation beyond that (e.g., no receipts, no invoices, no contracts, no names or quotes from anyone involved) documenting that Donald Trump actually stiffed his wedding caterer.", "Donald Trump's wedding to Marla Maples on 21 December 1993 was a large, lavish, highly publicized event with a reported attendance of 1,000 guests, held at the Trump Plaza in New York. The exchange of vows was covered by major news publications such as the New York Times, the Chicago Tribune, and the Los Angeles Times, .   The catering bill for such a grand affair was possibly several times greater than what most people spend on their entire weddings.", "Supposedly, though, Donald Trump managed to skip out on his entire catering bill without there being any mention of it in the press, no public grumbling or complaints about it, no resultant lawsuits.  Instead, the caterer allegedly ate the entire cost of the affair because \"Donald Trump always wins.\"", "Certainly Donald Trump has been accused of stiffing numerous contractors and other professionals who performed services for him (and a lawsuit was filed against the Trump SoHo Hotel in March 2016 alleging that the company kept caterer tips), so this claim isn't completely outside the realm of possibility. But the story as told here is a single-source, decades-old FOAFtale with as yet nothing else to support it.", "Dullea, Georgia.   \"VOWS; It's a Wedding Blitz for Trump and Maples\"\r\n    The New York Times.   21 December 1993.", "Reilly, Steve.   \"Hundreds Allege Donald Trump Doesn’t Pay His Bills\"\r\n    USA Today.   9 June 2016.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]