["The claim first appeared as a purported quote by South Africa’s Minister of Basic Education, Angie Motshekga, in the headline of an article published on February 8, 2021, by Opera News App, an international news aggregator.", "But the content of the article contradicts the headline, noting that “the grade 12 results will be released on the 23rd of February 2021”.", "This detail was ignored by Facebook users who shared the headline as fact, including this post in which the author promotes currency trading as a career path for those who failed.", "“700 000 learners wrote their matric and only 120 000 passed,” reads the first sentence of the post. “Can I teach the remaining 580 000 who failed Forex?”", "However, the claim about the number of matric pupils who wrote and failed is false.", "Not only are the year’s results still days away from being announced, but there were also 1,058,699 candidates — and not 700,000 — who sat for the 2020 exams, which finished on December 15, 2020.", "A scan of Opera News where the false headline appeared shows that the news aggregator features a range of articles from various websites, including gossip blogs as well as credible online media. Some of the articles, however, are produced by authors using aliases or auto-generated names that AFP Fact Check was unable to verify.", "A search of the link using the tool Know Knews by Media Monitoring Africa warns that the website “may contain dodgy news”. AFP Fact Check also found Opera News listed under “fake news” on Infraplex, an information and telecommunications company based in South Africa.", "In a January 2021 interview with online publication Tech Cabal, the editorial manager of Opera News in Nigeria, Collins Udeme, said although people accused the platform of spreading misinformation, it was merely a content distributor and not a publisher.", "“At the end of every article, there’s a disclaimer that states who is responsible for the article. And if there are some concerns, affected persons can reach out to Opera News directly,” he said.", "The following was the disclaimer at the end of the article falsely quoting Motshekga on the 2020 matric exams: “Content created and supplied by MsNandu. Opera News is a free to use platform and the views and opinions expressed herein are solely those of the author and do not represent, reflect or express the views of Opera News. Any/all written content and images displayed are provided by the blogger/author, appear herein as submitted by the blogger/author and are unedited by Opera News … (sic)”", "Department of basic education spokesman, Elijah Mhlanga, told AFP Fact Check that the claims are false.", "“That’s complete fake news, in fact, that post came even before we handed over the data to Umalusi,” said Mhlanga.", "Umalusi monitors and reports on the quality of the qualifications and curricula used in schools.", "School exams in South Africa were delayed last year because of the Covid-19 pandemic; normally the exam period runs from the end of October to the end of November.", "In 2019, an estimated 788,000 pupils sat for the final-year exams and achieved an 81 percent pass rate.", "Mhlanga explained that the enrollment for final exams in 2020 was higher than the year before because the preliminary tests that usually take place over May and June were combined with the final exams.", "Preliminary exams are not compulsory, and so some schools chose not to write them and rather focused on learner support, he added.", "The 2020 matric results will be released on February 23, 2021. Private schools announced results a few days earlier, as they usually do in South Africa, on February 19, 2021.", "The Department welcomes the approval of the results of the class of 2020 by @UmalusiSA@ReginahMhaule @ElijahMhlanga @HubertMweli pic.twitter.com/GFPr4c5T3q", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]