["About this rating", "Texas Republican Jeb Hensarling is the current chair of the House Financial Services Committee, a legislative body that has investigative powers over an extremely broad range of matters:", "The House Financial Services Committee has jurisdiction over issues pertaining to the economy, the banking system, housing, insurance, and securities and exchanges. Additionally, the Committee also has jurisdiction over monetary policy, international finance, international monetary organizations, and efforts to combat terrorist financing.", "The Committee oversees the Nation’s economy through its oversight of the Federal Reserve Board and individual reserve banks, the Treasury, the production and distribution of currency, and the Nation’s capital markets.", "Agencies under oversight by the Committee include: the Federal Reserve, Treasury, the Federal Deposit Insurance Corporation, the Securities and Exchange Commission, the National Credit Union Administration, the Office of the Comptroller of the Currency, the Department of Housing and Urban Development, the Federal Housing Finance Agency, and the Export-Import Bank.", "Hensarling has declined to subpoena records related to the Trump administration and once dubbed the House Financial Services Committee \"impeachment central” over efforts by its highest ranking Democrat, Maxine Waters, to criticize the Trump administration when its members have testified before the committee:", "[Waters] has used her position [as ranking member] on the panel to slam Trump and his Cabinet. She was among the first Democrats to call for Trump’s ouster, saying just two weeks after his inauguration that \"my greatest desire is to lead him right into impeachment.\"", "She has taken advantage of her post as the committee's top Democrat to investigate Trump's ties to Russia, repeatedly highlighting them in Treasury Secretary Steven Mnuchin's appearances before the panel.", "A particularly acrimonious exchange in her Russia-Trump inquiry led to one of her most viral moments, in which she repeatedly cut off Mnuchin with the meme-worthy \"reclaiming my time.\"", "The power to subpoena rests solely with the chair of a congressional committee. If the Democrats took control of the House in the November 2018 mid-term elections, it is likely that Waters, the most senior Democrat on the committee, would become its chair. Although it is not mandated that Waters be given chairmanship of the committee, it would be a break with long-established precedent if she were not. Democrats have signaled that she has their support, even as she has become a more polarizing figure nationally:", "Representative Maxine Waters’ Democratic colleagues are sticking by her as the party’s top candidate to run the powerful Financial Services Committee despite the controversy over her urging supporters to publicly confront Trump administration officials on immigration.", "Waters, a 13-term California Democrat, is the senior Democrat on the committee and if the party wrests control of the U.S. House from Republicans in the November election, she’d be in line to become chair of the panel. While House Democratic leader Nancy Pelosi and some of her colleagues chided Waters for the remarks at a rally, a party leadership aide said most Democrats in the House still support her as the ranking member of the finance committee.", "As chair, Waters would be permitted to issue a subpoena on any matter relevant to the committee. The Supreme Court has affirmed a congressional committee’s ability to issue subpoenas so long as they are part of authorized investigations related to the committee's subject area and are undertaken for a “valid legislative purpose.”", "The question of Waters' subpoenaing President Trump’s “bank records” partly depends on how those records are defined. Regardless of definition, the committee has the general power to subpoena a private business's records (such as those of the Trump organization or the Trump campaign), financial institutions (such as Deutsche Bank, which holds a great deal of Donald Trump’s debt) and individuals. In addition, the committee may subpoena the IRS for anyone's tax records, and the IRS is obligated (under 26 CFR 301.7216-2) to produce them.", "With respect to the committee's requesting files from a sitting President, the Supreme Court held in United States v. Nixon that “the President cannot shield himself from producing evidence in a criminal prosecution based on the doctrine of executive privilege, although it is valid in other situations.” Executive privilege would certainly not apply to records antedating Trump’s time in office if a prosecution warranted the collection of those records, but it could conceivably be asserted for some records originating during his term of office.", "Based on past efforts, it seems that a Democrat-led committee would focus on compelling Deutsche Bank to turn over their records on President Trump. On 23 May 2017, Waters and four other committee members wrote to Deutsche Bank requesting that information, but Deutsche Bank responded a few weeks later that they could not comply with the order because of U.S. privacy laws:", "In a letter to five House Democrats, Germany’s largest bank said it was barred from sharing information about Trump’s finances due to U.S. privacy laws.", "“We hope that you will understand Deutsche Bank’s need to respect the boundaries that Congress and the courts have set in an effort to protect confidential information,” lawyers for the bank from Akin Gump Strauss Hauer & Feld wrote in the letter.", "The Democrats do not have the power to compel Deutsche Bank to comply. The Financial Services Committee has subpoena power, but Republican committee members, who make up the majority of the panel, would have to cooperate.", "A Waters-chaired committee (the most likely outcome if House control shifts parties) would have the power to subpoena those bank records, and if the past acts of the committee's members serve as a reliable guide, Waters would likely use her power for that purpose.", "U.S. House Financial Services Committee.   \"About.\"\r\n    Accessed 2 July 2017.", "Warmbrodt, Zachary.   \"Waters Scares Democrats with Call for All-Out War on Trump.\"\r\n    Politico.   25 June 2018.", "U.S. House Financial Services Committee.   \"Rules for the Committee on Financial Services (115).\"\r\n    February 2017.", "Schneider, Judy, and Michael L. Koempel.   \"House Committee Chairs: Considerations, Decisions, and Actions as One Congress Ends and a New Congress Begins.\"\r\n    Congressional Research Service.   2 February 2018.", "Wasson, Erik, and Elizabeth Dexheimer.   \"Democrats Stick by Maxine Waters for Finance Panel Despite Controversy.\"\r\n    Bloomberg.   26 June 2018.", "U.S. Supreme Court.   \"Wilkinson v. United States, 365 U.S. 399.\"\r\n    27 February 1961.", "Willis, Jay.   \"Robert Mueller’s Subpoena for Donald Trump’s Bank Records Is One More Step Over the President’s Red Line.\"\r\n    GQ.   5 December 2017.", "U.S. Code of Federal Regulations.   \"26 CFR 301.7216-2 - Permissible Disclosures or Uses Without Consent of the Taxpayer.\"\r\n    Accessed 2 July 2018.", "U.S. Supreme Court.   \"United States v. Nixon, 418 U.S. 683.\"\r\n    24 July 1974.", "Freifeld, Karen, and Patrick Rucker.   \"Exclusive: Deutsche Bank Says Privacy Laws Prevent Trump Financial Disclosures.\"\r\n    Reuters.   8 June 2017.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]