["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "You wouldn’t think McDonald’s Big Macs and Burger King Whoppers would spark a nationwide argument and fabricated memes, but this is the age of the internet internet.", "Critics recently came down on President Donald Trump when he served Clemson University’s national championship-winning football team an assortment of fast food from McDonald’s, Wendy’s, Burger King and Domino’s Pizza during their White House visit on Jan. 14.", "Since then, some players have defended the fast food spread as being a rare treat, but one picture-turned-meme of star freshman quarterback Trevor Lawrence took it a bit further.", "The photo of Lawrence was taken after the team’s win over Alabama on Jan. 7. Soon, it turned into a meme when text was overlaid across it with the words \"Clemson QB speaks out to defend America.\"", "A quote attributed to Lawrence follows: \"President Trump got all our favorite foods, it was the best meal we ever had. Then we go and see the coastal elite media trashing it for not being organic vegan. We’re football players not bloggers. This was a perfect blue collar party.\"", "We can’t determine where the meme originated from but it has been shared widely on social media.", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "No, the 19-year-old college quarterback did not say the party was trashed by \"the coastal elite media for not being organic vegan.\" Nor did he say it was \"a perfect blue collar party.\"", "The entire quote was fabricated.", "After the post started to gain traction, Lawrence came out and denounced the quote, tweeting, \"I never said this by the way … I don’t know where it came from. However the trip to the White House was awesome!\"", "I never said this by the way... I don’t know where it came from. However the trip to the White House was awesome! https://t.co/dhYzZpSNUD", "Lawrence’s tweet shared the fake quote from @CloydRivers, an account with 1.8 million followers that routinely shares misinformation. That tweet has since been removed from the platform.", "Ross Taylor, assistant athletic director for Clemson football communications, told the Associated Press that Lawrence was shown the false quote on Tuesday.", "\"Everything that is presented in the meme is fabricated,\" Taylor said.", "This quote is Pants on Fire!", "Facebook post, Jan. 15, 2019", "Vox, The controversy around Trump’s fast-food football feast, explained, Jan. 15, 2019", "Trevor Lawrence tweet, Jan. 15, 2019", "The Hill, Clemson quarterback dismisses fake quote about White House visit, Jan. 15, 2019", "Orlando Sentinel, Clemson quarterback Trevor Lawrence says White House fast-food meme is fake food news, Jan. 15, 2019", "Associated Press, NOT REAL NEWS: False quote attributed to Clemson QB, Jan. 15, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]