["By Angelo Fichera", "Posted on October 19, 2018", "Q: Were three pedophiles killed in one week in Macomb County, Michigan?", "A: No. The county sheriff’s office said that viral story is false.", "Equipped with grim details, a false story about a supposed “vigilante” who killed three pedophiles in the span of a week in Macomb County, Michigan, has gone viral.", "“Authorities are appealing for any information regarding the murders, which have claimed the lives of three men on the Michigan Sex Offender Registry for crimes involving offences against children,” the story claims.", "The story fails to name which agency or agencies are investigating the matter, but includes a photo of a car for the Macomb County Sheriff’s Office.", "That office says the story — which accrued more than 300,000 Facebook engagements over two weeks — is bogus.", "Calling the story “completely FAKE NEWS,” the sheriff’s office wrote on Facebook Oct. 1 that it had not “had any recent murders involving any registered sex offenders and our residents have no reason to be fearful of a killer on the loose.”", "The story appeared a day earlier on nbc9news.com under the byline “Annie Lessard.” That domain was registered last month by a company that shields the identity of website owners.", "The local NBC-affiliated station in the Macomb County area is WDIV Local 4.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on the social media network.", "“Macomb County Fears ‘Vigilante’ Serial Killer After Third Pedophile Murdered In 1 Week.” Nbc9news.com. 30 Sep 2018.", "Macomb County Sheriff’s Office. Facebook. 1 Oct 2018.", "“Nbc9news.com.” Whois.DomainTools.com. Accessed 15 Oct 2018.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]