["About this rating", "Introduced during the 2021-2022 New York State legislative session, Assembly Bill A416 would amend public health laws to allow for the removal of “cases, contacts and carriers of communicable diseases who are potentially dangerous to the public health.”", "A416 is not specific to COVID-19 and has not been passed into law by the state legislature. Such isolation centers have been defined by the Centers for Disease Control and Prevention as places designed for those who cannot isolate themselves safely at home and are not designated as “detention camps” as some social media users claimed.", "Requirements, locations, and other logistical information for such isolation centers are not outlined. Furthermore, precedence suggests that it is unlikely such a bill would pass.", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "In the first days of January 2021, the New York State Legislature introduced a bill that reportedly called for the establishment of COVID-19 “detention camps” in response to the novel coronavirus pandemic.", "Assembly Bill A416 reportedly allowed for the removal of “cases, contacts and carriers of communicable diseases who are potentially dangerous to the public health.” Its introduction circulated through conservative social media circles with many of the posters using fear-mongering language that might suggest a person or their children may be removed from their home “for whatever reason the state sees fit.”", "While it is true that A416 was introduced into the New York State Senate in January 2021, it is important to note that it had not passed into law but was instead referred to the New York State Senate Committee on Health to be read on Jan. 6, 2021. If the committee moves to advance the bill, it would then be put on the floor calendar and scheduled for a vote by both the state Senate and assembly before being sent to the governor’s desk for signing.", "And if precedence suggests passage, the future of the bill does not look promising.", "Three previous bills containing similar language have been introduced during each legislative session since 2015 (A6891, A680, and A99), none of which made it to the legislature for a vote.", "When it comes to the specificities of the law, A416 would only be enacted in the event that the governor declares a state of health emergency due to an epidemic of any communicable disease, which New York Gov. Andrew Cuomo established in March 2020.", "Under A416, the governor or his delegee may “order the removal and/or detention” of a person or group after they have determined by “clear and convincing evidence” that the health of others is or may be endangered by a confirmed or suspected case, contact, or carrier of a contagious disease. Such persons deemed to “pose an imminent and significant threat to the public health” can be detained in a medical facility or other appropriate facility designated by the governor or their cabinet.", "Under the proposed legislation, a person will not be detained after the health department determines that they are no longer contagious. However, there is no language that directly references a specific disease.", "The concept of a voluntary isolation facility isn’t unheard of. Guidelines published by the Centers for Disease Control and Prevention (CDC) in September 2020 outlined operational considerations for community isolation centers during the COVID-19 pandemic in areas where the disease may overwhelm health facilities and staff:", "“Isolation shelters, or community isolation centers (CICs), can provide people with mild to moderate symptoms, who are not at increased risk for severe disease, with a safe space to voluntarily isolate until they are no longer considered infectious,” wrote the CDC. “Such centers can reduce household transmission and reserve health facility resources for more seriously ill patients.”", "But there are subtle nuances differentiating CICs from the centers proposed in A416, the most obvious being the notion that the former is voluntary for those who may not be able to safely isolate themselves at home.", "At the time of this writing, A416 was considered active. However, it is not immediately apparent that it has been put on an agenda for the Health Committee to review during the 2021-2022 legislative session.", "Madison Dapcevich is a freelance contributor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]