["About this rating", "On 31 December 2016, the Empire News web site published an article reporting that outgoing President Barack Obama had ordered a life-sized bronze statue of himself to be permanently installed at the White House:", "President Obama has ordered a $200,000, life-sized, bronze statue of himself, with plans to install it in the entryway of the White House. The president says that his legacy “should not be diminished,” and that this is the only way he can “keep an eye” over Trump, as well as future presidents.", "“I have been president for only eight years, and in that time, I have done what no other presidents could do in all their time in total,” said Obama. “I have created a legacy that should not be diminished. I have created something that no future president will be able to do. In that regard, I have commissioned this statute, with plans to have it permanently erected in the entryway of the White House, so that all who enter can remember me fondly.”", "Although Empire News is a well-known purveyor of fake news (the site carries a disclaimer clearly stating that its content is fictional), this fabricated story was picked up and republished by several other online outlets. Both En-Volve.com and WashingtonFeed.com, among others, shared this fake news story along with a photograph purportedly showing the statue in the Oval Office:", "The statue seen above is real, but it was not placed or photographed inside the Oval Office. The statue was actually installed at an outdoor location in Puerto Rico in 2012.", "It appears that the hoaxsters combined a photograph of the statue taken by Flickr photographer Paul Sableman in 2013 with a photograph of a replica Oval Office built in Texas to create a faux image seemingly showing the statue inside the White House:", "Pocklington, Rebecca.   \"US White House Fan Builds £150,000 Replica of Oval Office in His Own Home.\"\r\n    The Mirror.   12 November 2013.", "Associated Press   \"Puerto Rico honors Obama, LBJ Visits with Statues.\"\r\n    20 February 2012.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]