["Allegations that Sen. Kamala Harris, the Democratic vice presidential nominee, violated electioneering laws at a campaign stop near a polling place in Ohio proliferated online this week.", "\"Kamala Harris broke the law in Ohio by campaigning to voters standing in line at the polls to vote,\" one user wrote on Facebook.", "Another user took to Instagram to share their thoughts, along with a screenshot of a post on Twitter. \"This is illegal. But no one will investigate her so it's whatever I guess,\" they wrote.", "Some conservative websites — like 100PercentFedUp.com — also accused the vice presidential candidate of illegal activity.", "\"This morning, Kamala Harris could be seen outside a polling location trying to campaign with her megaphone. It is very much illegal to electioneer within 100 feet of a polling station, even more so as Harris is on the ticket,\" a story on the site read.", "The users behind the posts, including 100PercentFedUp.com, have not responded to requests from USA TODAY for comment.", "On Oct. 24, Harris stopped by the first day of early voting in Ohio to thank voters waiting in long lines outside the Cuyahoga County Board of Elections.", "According to WKSU 89.7, Harris used a microphone and amplifier to speak from the other side of East 30th Street, a few hundred feet away from the entrance to the polling site.", "“Thank you for voting and voting early. Your vote is your voice, your voice is your vote. There is so much at stake. Don’t let anyone ever take your power. The power of your voice is so important. You are going to make the difference,\" Harris said to the crowd, per Cleveland.com. “You are going to make the decision about your future, about your family’s future,” she continued, speaking to voters lined up for blocks. “It is through the voice of your vote. And you have the power — the power is with the people. And you know that. That’s why you’re standing in this line today, and I just came to say thank you. Thank you, Cleveland.”", "That matches the transcript of the event, as recorded by the press pool reporter traveling with Harris.", "More:Fact check: Images show Melania Trump, not a body double", "Electioneering laws restrict political activities near polling places on election days. The specifics vary by state, according to a list published by the National Association of Secretaries of State.", "In Ohio, campaigning is prohibited within 100 feet of polling places — a zone marked by small flags. If the line of voters waiting to cast their ballots extends beyond the flags, campaigning remains prohibited within 10 feet of any elector.", "The law also states that \"during an election and the counting of the ballots, no person shall [...] solicit or in any manner attempt to influence any elector in casting the elector’s vote.\"", "Based on multiple accounts of the events, Harris did not mention any candidates who appear on the ballot — including former Vice President Joe Biden and herself — in her remarks.", "A report by WKSU 89.7 states that Harris remained \"outside the 100 foot neutral zone.\"", "And Sabrina Singh, a spokesperson for Harris, confirmed to PolitiFact that Harris \"stood behind the 100 foot boundary line beyond the neutral zone.\"", "Videos posted to Twitter by Harris and Seth A. Richardson, a political reporter for Cleveland.com, both show the vice presidential candidate on the opposite side of the street from voters, separated by lanes of traffic which clearly exceed 10 feet.", "A statement from the Cuyahoga County Board of Elections to USA TODAY estimated that the lanes are approximately 12 feet wide, and that local elections employees who were outside for the majority of the time Harris was there \"witnessed no violations of Ohio's electioneering laws.\"", "\"There are several officers on-site at the CCBOE Early Vote Center tasked mainly with managing traffic and voter flow,\" the statement read. \"They will step in to assist our staff with the enforcement of the neutral zone (100 ft from the entrance or 10ft from the voters in line when the line extends further than 100 feet) as necessary. No assistance was required during the Senator's visit.\"", "The statement also noted that Harris was surrounded by Secret Service for the entirety of her visit, and no voter or bystander was permitted to approach her.", "Based on our research, the claim that Sen. Kamala Harris broke electioneering laws in Ohio is FALSE. Her brief visit to the Cuyahoga County Board of Elections abided by laws requiring her to remain 100 feet away from the polling place and 10 feet away from any voters, per multiple accounts of the event and a local elections official.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more."]