["By Saranac Hale Spencer", "Posted on June 20, 2019", "A bogus story fueling theories that Hillary Clinton and Barack Obama will be arrested has been shared over 100,000 times on Facebook, but it started out as satire.", "A completely fabricated story promoting the unfounded claim that Hillary Clinton and Barack Obama are soon to be arrested has been shared over 100,000 times on Facebook and other social media sites, according to data from CrowdTangle.", "The story was first posted on May 21 on a website called TatersGonnaTate.com with the headline: “Panel of 16 Judges Agrees: Barr Has Enough to Indict Clinton and Obama.” That site is part of a network called America’s Last Line of Defense, which we’ve written about before. The ALLOD network says that its work is satire meant to provoke conservatives.", "It says on TatersGonnaTate.com’s “About Us” page: “‘Taters’ are the conservative fans of America’s Last Line of Defense. They are fragile, frightened, mostly older caucasian Americans. They believe nearly anything. While we go out of our way to educate them that not everything they agree with is true, they are still old, typically ignorant, and again — very afraid of everything. Our mission is to do our best to show them the light…”", "But the story has been copied and posted on websites that have no such disclaimer and present the claim as though it’s true.", "The link to the original story has also been shared as though it’s true by some popular conservative Facebook pages, including one that belongs to the Texas agriculture commissioner, Sid Miller. His page posted a link to the story on June 15 with this exclamation: “Then let’s get after it!” His post was shared 31,000 times. He did not return a call seeking comment.", "The story, though, is completely made up. Beyond the disclaimers from the original website, there are some red flags in the piece that suggest it’s false. For example, the story never says what specific court it’s referencing, and the picture it uses shows the New York State Court of Appeals, which has seven judges, not 16.", "It also quotes “Art Tubolls,” a fictitious character who often shows up in ALLOD stories. In this one, he is supposed to be the “Director of Information and Propaganda” for the Trump administration (clearly a spoof title), but he also has been used as Michael Jordan’s spokesman and the CEO of Comedy Central.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "“Panel of 16 Judges Agrees: Barr Has Enough to Indict Clinton and Obama.” TatersGonnaTate.com. 21 May 2019.", "Van Buren, Lori. “N.Y. state Court of Appeals still a liberal bastion.” TimesUnion.com. 19 Nov 2016.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]