["By Mitchell Aronoff", "Posted on October 3, 2019", "Rep. Ilhan Omar is not proposing a nationwide ban on “unhealthy and immoral” bacon. A self-described “satire” website published that made-up story, and it has since been shared by other websites that did not label the claim “satire.”", "Democratic Rep. Ilhan Omar of Minnesota — one of the first two Muslim women elected to Congress in 2018 — has been a popular target for misinformation. We’ve debunked several false claims about the congresswoman, mostly dealing with her religion.", "Another false claim circulating online says Omar “has proposed a nationwide ban on something … unheard of. Bacon.” All of the bills she has sponsored and cosponsored can be found on congress.gov, and none of them would ban bacon.", "The made-up story was originally published by DailyWorldUpdate.us, which says it is “a subsidiary of the ‘America’s Last Line of Defense’ network of parody, satire, and tomfoolery.” The website’s “About” page also has this disclaimer: “Everything on this website is fiction. It is not a lie and it is not fake news because it is not real. If you believe that it is real, you should have your head examined. Any similarities between this site’s pure fantasy and actual people, places, and events are purely coincidental and all images should be considered altered and satirical.”", "However, the story has been copied by other sites that do not have any such disclaimer, and the Facebook pages that have shared the story don’t either. Instead, those pages shared the story along with statements such as, “No thanks.” And readers of those pages have responded with anti-Islamic comments such as: “Throw her in a pig pen!” and “Would much rather have a nationwide ban on Muslims, particularly her!”", "The Quran states that it is “forbidden” to eat “the flesh of swine,” which is considered “impure,” as explained on the website IslamFaith.", "“God is protecting our health because the pig is an unclean animal. It is a scavenger that will eat almost anything it comes across,” the website says. “It even eats its own waste, as well as maggots and decaying animals or vegetables, thus consuming many kinds of toxins.”", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "“Ihlan Omar Proposed Nationwide Ban on ‘Unhealthy and Immoral’ Bacon.” DailyWorldUpdates.us. 9 Apr 2019.", "“About.” DailyWorldUpdates.us. Accessed 1 Oct 2019.", "“Ihlan Omar Proposed Nationwide Ban on ‘Unhealthy and Immoral’ Bacon.” ChicagoDaily.Pro. Accessed 1 Oct 2019.", "“Ihlan Omar Proposed Nationwide Ban on ‘Unhealthy and Immoral’ Bacon.” OfficialNewsToday.site. Accessed 1 Oct 2019", "“The Problem With Pig – Why Can’t Muslims Eat Pork?” IslamFaith.com. Undated, accessed 3 Oct 2019.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]