["About this rating", "Voting in the 2020 U.S. Election may be over, but the misinformation keeps on ticking. Never stop fact-checking. Follow our post-election coverage here.", "In the aftermath of Democratic candidate Joe Biden's projected victory in the 2020 U.S. presidential election, social media users, primarily those gratified by the defeat of incumbent President Donald Trump, shared a Venn diagram that indicated he was the first president in U.S. history to be impeached and lose the popular vote and lose his reelection bid.", "To illustrate the popularity of the graphic, in the days after major news organizations projected Biden as the winner on Nov. 7, 2020, the following screenshot shows instances of it on Facebook:", "The graphic purported to show three intersecting cohorts of American presidents: those who failed to be reelected as incumbents; those who won while losing the popular vote; and those who were \"impeached or resigned.\" According to the diagram, Trump is the only president to have fit all three of those descriptions. The Venn diagram was shared by several prominent journalists and activists:", "The diagram was accurate. In 2020, Trump did indeed become the first president in U.S. history to lose reelection as the incumbent, having also been impeached during his term, and after being elected in the first place despite losing the popular vote.", "The first component of the claim that needs evaluation is that Trump failed to be reelected, lost the popular vote, and was impeached. All three are true of the outgoing president.", "Failed reelection", "A quick note here — in 1888, incumbent President Grover Cleveland failed in his bid for reelection, but succeeded as a challenger in 1892, making him the only U.S. president so far to serve two nonconsecutive terms. That possibility remains open for Trump in future years, so we understand the graphic's use of the phrase \"one-term\" as describing incumbent presidents who ran for reelection but failed.", "That is true of Trump. Although 2020 election results have not yet been formally certified, and the electoral college does not cast its votes until December, Biden has an unassailable lead over Trump in a sufficient number of states to give him more than 270 electoral college votes. And, in accordance with the same conventions under which presidents have for decades been projected as winners (including Trump's victory in 2016), Biden has been projected as the winner, and his status as president-elect has been almost universally recognized by heads of state and governments throughout the world. The only departure from conventions this year is that, despite Biden's unassailable lead, the incumbent president has not yet publicly conceded defeat.", "Lost popular vote", "Trump lost the popular vote twice. According to official results (page five) published by the Federal Election Commission, in 2016 Trump received 62,984,828 votes, or 46.09 % of the total number of valid votes. Former Secretary of State Hillary Clinton received 65,853,514, or 48.18 % of the total. So Trump lost the popular vote then by 2,868,686 votes, or 2.09 %.", "The 2020 results have not yet been certified, but several authoritative sources have so far estimated that Biden has, and will ultimately achieve, a commanding lead in the popular vote. On Nov. 9, the Guardian reported that Biden had so far amassed 75.4 million votes to Trump's 70.9 million; CBS News gave Biden a popular vote lead of 75.6 million to 71.2 million; and the BBC reported that Biden had more than 75 million votes, while Trump had more than 71 million. Similar figures were reported by The Associated Press and Washington Post.", "As of Nov. 9, Biden was on course to receive the greatest number of votes of any U.S. presidential candidate in history, comfortably surpassing Barack Obama's previous record of 69.5 million votes in 2008 (a ticket that, of course, included Biden himself as running mate). Trump was on course to receive the second-highest total in history, and the highest by a losing candidate.", "Impeachment", "This is demonstrably true. On Dec. 18, 2019, the U.S. House of Representatives voted 230-197 to impeach Trump on a first article of impeachment (\"abuse of power\"), and voted 229-198 to impeach him on a second article (\"obstruction of Congress\"). On Feb. 5, 2020, the U.S. Senate found Trump not guilty on both articles, by votes of 52-48 and 53-47, respectively, and he thus remained in office.", "Failed reelection", "Fifteen American presidents sought reelection as the incumbent, but failed. Based primarily on records held by the American Presidency Project at the University of California-Santa Barbara, they were:", "Lost popular vote", "Most presidential candidates who lose the election also lose the popular vote. What the Venn diagram referred to was candidates who were elected despite losing the popular vote — of which there have been five:", "Impeachment", "Three sitting presidents have been impeached by the U.S. House of Representatives. None has been convicted by the U.S. Senate and removed from office. As we have previously examined in greater detail, the two impeached presidents before Trump were Andrew Johnson, in 1868, and Bill Clinton, in 1998.", "The following table provides a summary of our findings and underlines the accuracy of the core claim in the November 2020 \"Venn diagram\" meme — that Trump was the first president in American history to be elected while losing the popular vote, and then subsequently impeached before failing in his bid to be reelected as the incumbent.", "[Correction]: In February 1999, the U.S. Senate voted 55-45 to acquit then-President Bill Clinton on the charge of perjury. It did not vote 55-45 to convict him on that charge.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]