["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Republicans in Congress were not functioning independently of one another on their first workday after the Independence Day holiday.\n\nShortly after noon on July 5, House Speaker John Boehner’s \"tweeted\" a July 3 blog posting from the conservative Weekly Standard’s website, labeling it \"POTUS’ economists: ‘Stimulus’ Has Cost $278,000 per job.\"\n\nAround 4 p.m., the National Republican Congressional Committee followed suit with multiple press releases that used the same Weekly Standard blog item to target dozens of Democrats in Congress, including Ohio’s Betty Sutton. Its headline: \"New Report Shows Dems’ Failed Stimulus Cost $278,000 Per Job As Economy Got Worse.\" It went onto claim that Sutton’s \"government spending spree\" \"delivered little except skyrocketing debt owed to foreign countries like China.\"\n\nBy 4:55 p.m., the National Republican Senatorial Committee had recycled the Weekly Standard blog posting to attack Ohio Democratic Sen. Sherrod Brown. This time the claim was: \"President Obama’s own top economists estimate that the Obama-Brown stimulus debacle cost taxpayers an average $278,000 per job.\"\n\nPolitiFact Ohio thought the concerted GOP effort made it worthy of a look. Since Boehner kicked it off on Twitter, we’ll use his tweet.\n\nThe Weekly Standard blog item that spawned the statistic cites a July 1 report by the White House Council of Economic Advisers, which states the American Recovery and Reinvestment Act \"saved or created between 2.4 and 3.6 million jobs as of the first quarter of 2011.\"  It also tallies the sum of the stimulus bill’s outlays and tax cuts at $666 billion.\n\nThe $278,000 per job figure doesn’t appear anywhere in the White House report. To come up with that number, the publication divided the $666 billion stimulus total by the low-end 2.4 million job estimate to come up with a dollars per job statistic that it rounded off to $278,000.\n\nThe blog item contends this statistic \"provides further evidence that President Obama’s ‘stimulus’ did very little, if anything, to stimulate the economy and a whole lot to stimulate the debt,\" and insists \"the government could simply have cut a $100,000 check to everyone whose employment was allegedly made possible by the ‘stimulus’ and taxpayers would have come out $427 billion ahead.\"\n\nAfter Republicans began to circulate the blog item, White House spokesman Jay Carney said its conclusions were \"based on partial information and simply false analysis.\" White House spokeswoman Liz Oxhorn issued a statement that noted the Recovery Act bolstered infrastructure, education, and industries \"that are critical to America’s long-term success and an investment in the economic future of America’s working families.\"\n\nThe White House points out that Recovery Act dollars didn’t just fund salaries - as the blog item implies - it also funded numerous capital improvements and infrastructure projects.\n\nLumping all costs together and classifying it as salaries produces an inflated figure.\n\nFurthermore, the publication created its statistic with the report’s low end jobs estimate. Had it instead gone with the 3.6 million job figure at the top end of the range, it would have come up with a smaller $185,000 per job figure.\n\nRepublicans made a similar assertion in November 2009, using similar calculations to contend that the stimulus cost taxpayers more than $246,000 per job. Back then, they divided $160 billion in stimulus spending by 650,000 jobs that the White House estimated the measure had created or preserved. A \"fact check\" conducted at the time by the Associated Press called that math \"satisfyingly simple but highly misleading.\"\n\n\"Any cost-per-job figure pays not just for the worker, but for the material, supplies and that workers’ output - a portion of a road paved, patients treated in a health clinic, goods shipped form a factory floor, railroad tracks laid,\" the 2009 Associated Press item noted.\n\nThe Weekly Standard claimed that the stimulus actually \"has been working in reverse the last six months, causing the economy to shed jobs.\" It derives this conclusion from the fact that as of two quarters ago, the stimulus had added or saved just under 2.7 million jobs - or 288,000 more than it has now.\n\nMoody’s chief economist Mark Zandi says the Weekly Standard misinterpreted that data.\n\n\"It’s not that ARRA [the stimulus] is now costing the economy jobs, it is that the economy is now creating jobs without ARRA’s help,\" Zandi told TPMDC. \"This is exactly the objective of fiscal stimulus, namely to end recession and jump-start economic recovery.\"\n\nThe day after the White House responded to the GOP’s dissemination of the Weekly Standard blog item, its author penned a defense that reiterates his claims. He says he never said that $278,000 per job went to salaries, but \"rather that each job has cost taxpayers $278,000.\"  \n\nYet, his original item did say taxpayers would have come out $427 billion ahead if the government had simply \"cut a $100,000 check to everyone whose employment was allegedly made possible by the ‘stimulus?\"\n\nSo where does that leave Boehner’s tweet that said  \"POTUS’ economists: ‘Stimulus’ Has Cost $278,000 per job.\"", "On the Truth-O-Meter, we rate Boehner’s tweet (and the subsequent variations of his claim) as False.\n\nComment on this item.", "National Republican Congressional Committee, New Report Shows Dems' Failed Stimulus Cost $278,000 Per Job As Economy Got Worse, July 5, 2011\n\nNational Republican Senatorial Committee, \"White House Economists: Obama-Brown Stimulus Cost Taxpayers $278,000 Per Job,\" July 5, 2011\n\nThe Weekly Standard blog \"Obama’s Economists: ‘Stimulus’ has cost $278,000 per job, July 3, 2011\n\nCouncil of Economic Advisers, \"The Economic Impact of the American Recovery and Reinvestment Act of 2009, Seventh Quarterly Report,\" July 1, 2011\n\nJuly 5, 2011 Press Briefing by White House Press Secretary Jay Carney\n\nJuly 6, 2011 email from White House spokeswoman Liz Oxhorn.\n\nAssociated Press, \"Fact Check: GOP math suspect in stimulus debate,\" November 2, 2009\n\nTPMDC, Republicans Falsely Claim Obama Advisors Burying Data ‘Proving’ Stimulus is Hurting Economy, July 5, 2011\n\nThe Weekly Standard blog \"Despite White House Protests, Stimulus Still Cost Taxpayers $278,000 Per Job,\" July 6, 2011", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]