["Students stand outside a building to find an Internet signal for their phones in Havana, Cuba, on April 1. (AP Photo)", "There’s a good chance most Cubans won’t be able to read this article. And the reason why — lack of Internet access — is a point of a contention between President Barack Obama and Republican Sen. Marco Rubio.", "Obama on Wednesday, Dec. 17 announced sweeping changes to the United States’ decades-old isolation policy against Cuba, promising renewed diplomatic relations and an easing of regulations on commerce. Obama said the drastic shift in approach to the Communist-controlled island would help bolster the Cuban people, who he said have suffered from America’s cold shoulder.", "\"I believe in the free flow of information,\" Obama said. \"Unfortunately, our sanctions on Cuba have denied Cubans access to technology that has empowered individuals around the globe.\"", "Rubio, a Florida Republican and a Cuban American, chastised Obama’s comments in an animated rebuttal.", "\"The president said that the people of Cuba do not have access to advanced, 21st century modern technology for communications and telecommunications because of the U.S. embargo. That is false,\" Rubio said. \"The reason why they don't have access to 21st century telecommunications — like smart phones, like access to the Internet — is because it is illegal in Cuba.\"", "Obama’s statement wasn’t as full-throated as Rubio made it sound. And some of what Obama suggested is true, experts told us.", "That said, Rubio has the better part of the argument that Cuba’s restrictive policies loom large over the debate.", "Cuba’s restrictions", "Cuba has less access to the Internet than most countries in the world. It is the only country in the Western Hemisphere with an Internet access rating of \"not free\" by Freedom House, a human rights advocacy group.", "Citing the National Statistics Office in Cuba, Freedom House said about 23 percent of Cubans have access to the Internet. But those numbers, while very low, are likely inflated: Many of those people have access only to a tightly controlled Cuban intranet that includes email and government-approved sites. Outside experts, Freedom House said, estimate only about 5 percent of people have access to the full World Wide Web.", "The government of Cuba maintains almost complete control over telecommunications industries in the country, and it uses a mix of repressive policies and price gouging to keep Cubans offline. Regulations essentially prohibit private Internet use in homes and it is illegal to access the Internet outside government-controlled methods. On top of that, the cost of even a basic computer is more than twice the average Cuban’s annual salary.", "Cubans who log on to the Internet do so via public, government-run access points. There, patrons deal with some of the slowest speeds in the world. And rates set by the government make it difficult for the average worker on a $20 weekly salary to consistently log on. Checking email costs $1.50 an hour. Access to the national intranet is $0.60 per hour, and international websites are $4.50 per hour, Freedom House said.", "Bloggers and dissenters are quickly shut down and, in many cases, imprisoned. Alan Gross, the imprisoned American contractor released by Cuba this week, was arrested for building telecommunications infrastructure on the island.", "As for smartphones, most mobile phones can send messages, even internationally, but cannot access the Internet. GPS and satellite capabilities are prohibited. An iPhone, if procured, would be a pretty dumb phone in Cuba.", "Cuban officials have recently indicated a potential shift in policy that could open the Internet to personal and mobile usage, but it’s also possible it will be limited to Cuba’s intranet and email.", "Such promises have been made before. Cuba installed a 1,600 kilometer fiber-optic cable between the island and Venezuela in 2011 with financial help from China (a project completed despite the U.S. embargo, it should be noted). It was supposed to increase speeds and access for Cubans. Actual advances have been modest.", "And it’s not as though the United States is the only country capable of supplying Cuba with telecommunications technology in today’s global economy. The regime has prioritized preventing political dissent over technological advancement. There’s no guarantee that will change if U.S. policy does.", "This is why Rubio is right in saying that the U.S. embargo is far from the only factor affecting access. Sure, Cuba is poor and has bad infrastructure, but there are poorer countries with better Internet access, said Larry Press, an information systems professor at California State University Dominguez Hills who writes a blog on Internet access in Cuba. When infrastructure improved in Cuba, access largely did not.", "\"I think Rubio is closer to the truth than Obama,\" Press said. \"Both have a degree of truth, but the Cuban government's fear of the Internet was a bigger hindrance than the embargo.\"", "The embargo effect", "Rubio was not quite right, however, when he said that Obama’s comment was unequivocally false.", "Obama said that U.S. sanctions on Cuba \"have denied Cubans access to technology.\" This is true to a certain extent. Part of Cubans’ access problem has to do with the exorbitant cost of technology, relative to how poor the country is, and lifting those restrictions could help that problem.", "In 2009, Obama cracked the door open marginally for American telecommunications companies to operate in Cuba by allowing them to establish connectivity between Cuba and the United States, and letting satellite radio and television companies serve Cuban customers. Additionally, people could donate (but not sell) telecommunication devices like computers and phones to Cubans.", "The changes announced Dec. 17 further opened up the ability for U.S. companies to build telecommunications infrastructure in Cuba and it allows for the commercial sale of communication devices and software.", "Matt Borman, deputy assistant secretary of export administration, told PolitiFact that if American companies were able to compete with other foreign telecommunications suppliers in Cuba, there is an expectation that it would pressure the government to create more viable infrastructure. That could spur more Internet freedom. In a report published in 2010, the Brookings Institution made a similar argument.", "A of couple experts told us that Obama’s side carries weight because Castro has made an effort in recent years to ease some restrictions, such as lifting the ban on personal computers. (It may be hard to believe, but internet access in Cuba used to be even worse.) So the United States’ sanctions prevent Cubans from acquiring technology that is now legal, said Julia Sweig, an expert on Cuba and Latin America at the Council on Foreign Relations.", "Our ruling", "Rubio said that rather than the U.S. embargo, the reason why Cubans \"don't have access to 21st century telecommunications — like smart phones, like access to the Internet — is because it is illegal in Cuba.\"", "\"Illegal\" is probably the wrong word. There are some ways to legally access the Internet in Cuba, but not in one's home, or on mobile devices, and not by connecting to the full World Wide Web. Internet use is primarily restricted to government-run access points that are heavily monitored. The usage rates, set by the regime, are so expensive that it is cost prohibitive for most Cubans to log on. Political dissenters are barred from publishing online and are punished if they do. The end result is similar to full prohibition: Cuba has one of the lowest rates of Internet access in the world.", "The U.S. sanctions have played a role in limited availability of technology. However, Rubio is right that the Cuban government has nearly complete control over the Internet. That isn’t a result of sanctions on telecommunication business activity in Cuba. Even if the United States fully repeals its embargo, government control over Internet access could continue.", "We rate Rubio’s statement Mostly True.", "C-SPAN, Sen. Marco Rubio on U.S.-Cuba Policy Changes, Dec. 17, 2014", "Freedom House, \"Freedom on the Net 2014: Cuba,\" accessed Dec. 18, 2014", "Brookings, \"Bridging Cuba’s Communication Divide: How U.S. Policy Can Help,\" July 2010", "White House, \"Statement by the President on Cuba Policy Changes,\" Dec. 17, 2014", "White House, \"Charting a New Course on Cuba,\" Dec. 17, 2014", "White House, \"Reaching out to the Cuban People,\" April 13, 2009", "U.S. Treasury, \"What You Need to Know about U.S. Sanctions on Cuba,\" Jan. 24, 2012", "CIA World Factbook, Cuba, accessed Dec. 18, 2014", "The Internet in Cuba, blog posts by Larry Press, accessed Dec. 18, 2014", "Miami Herald, \"Cuba allows phone access to some email,\" March 8, 2014", "Reuters, \"Cuba’s uneasy Internet connection,\" April 8, 2014", "Berkman Center for Internet and Society, \"Rationing the Digital: The Politics and Policy of Internet Use in Cuba Today,\" July 2013", "Email interview, Larry Press, information systems professor at California State University Dominguez Hills, Dec. 18, 2014", "Email interview, Cristina Venegas, media studies professor at the University of California Santa Barbara, Dec. 18, 2014", "Media conference call, Julia Sweig, senior fellow at the Council on Foreign Relations, Dec. 18, 2014", "Phone interview, Matt Borman, deputy assistant secretary of export administration, Dec. 18, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]