["The photos were shared in this Facebook post on August 19, 2020.", "The post’s caption states: \"Wow! This is it! No more heavy traffic. / Expresway (sic) from Naga City Cebu to Danao City\".", "Naga and Danao are cities in the central Philippine province of Cebu. Authorities plan to build an expressway between the two cities.", "The same photos were also shared here, here and here on Facebook and here on Twitter, alongside a similar claim.", "The claim, however, is false.", "Kosovo highway", "A reverse image search on Google and subsequent keyword searches found three of the photos were published in June 2019 Facebook posts here and here. They were published by a page called “Explore Kosovo - with Bujar Gashi”.", "In response to the misleading posts, a spokesperson for the Explore Kosovo Facebook page told AFP the photos show Kosovo.", "“It’s in Kosovo, heading to Macedonia,” the spokesperson said in a Facebook message on August 25, 2020.", "The three photos published by the “Explore Kosovo - with Bujar Gashi” page all bear the watermark; “Bujar Gashi”.", "A similar set of photos showing the same highway were also published in this 2019 report by an Albanian-language media site based in Switzerland. The images are also credited to Bujar Gashi.", "The report’s headline translates to English as: “Photo news: \"Arbën Xhaferi\" Highway, tourist attraction of Kosovo”.", "The report translates to English, in part, as: “Well-known photographer, Bujar Gashi brings us rare images from the newest highway in Kosovo, 'Arbën Xhaferi'.", "“The Highway Bridge enables visitors to see the Kaçanik Gorge and the natural beauties of the surrounding areas.”", "Below is a set of screenshot comparisons, showing the photos in the misleading posts (L) and the “Explore Kosovo - with Bujar Gashi” posts (R):", "The location corresponds with satellite imagery on Google Maps of Arbën Xhaferi highway where it passes through the Kacanik Gorge.", "Japan highway", "A reverse image search on TinEye found the fourth photo in the album is a mirrored version of this public domain photo, uploaded to Wikimedia Commons in September 2012.", "The photo’s description states it shows the “Shin-Tomei Expressway” in Japan.", "The photo also corresponds to stock photos published here and here, both captioned with the same location. The mountain in the photo’s background can also be seen in this Google Street View of a portion of the Shin-Tomei Expressway.", "Below is a screenshot comparison of the fourth photo in the misleading post (L) and the Wikimedia Commons photo (R):", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]