["About this rating", "More hunting licenses, tags, permits, and stamps were sold in the U.S. in 2018 (about 37 million) than the number of total members in the world's 10 largest armies (about 25 million).", "However, a single hunter can own multiple hunting licenses; the total number of hunters in the United States in 2018 (about 15 million) is less than the total members in the world's 10 largest armies (about 25 million); and comparing the military might of recreational hunters and trained armies involves more than just counting active participants.", "In November 2019, we came across a meme that claimed more hunting licenses were sold in the United States \"last year\" (presumably 2018) than the number of soldiers in the world's 10 largest armies combined:", "Because this meme instructed us to \"think about it,\" we did, and the first thought we had was that this is an apples-to-oranges comparison.", "The meme appears to be insinuating that hunters in the U.S. could form some sort of militia that would rival the largest armies in the word. In terms of numbers, U.S. hunters may be able to stack up against the world's military units (more on that later), but owning a hunting license is not the same as being trained for combat in the military. Furthermore, this comparison doesn't take into account that world armies typically have access to more ammunition, equipment, planes, tanks, submarines, and military-grade weapons than your average hunter.", "While this meme may be comparing apples to oranges (or maybe a better analogy, shotguns to drones), let's take a look at the numbers.", "The Number of Total Military Members in the World's 10 Largest Armies? Approximately 25 Million", "According to The Military Balance for 2018 from the International Institute for Strategic Studies, China has the world's largest army in terms of active members, with a little over 2 million soldiers. The United States is third (1.3 million) and Egypt is 10th, with just under 500,000. The 10 largest armies in the world have about 10 million active duty members combined. This number jumps to over 25 million when reserve members are included, and close to 50 million if we add in paramilitary members.", "This meme does not specify the criteria it used to count members in the world's armies. For the purposes of this article, we'll use the number of total members (active and reserve) in the world's militaries, which amounts to approximately 25 million.", "The Number of Hunting Licenses Sold? Approximately 37 Million", "So how does that compare to the number of hunting licenses sold in the U.S.? According to the US Fish And Wildlife Service, 33,476,898 resident hunting licenses, tags, permits, and stamps were sold in 2018. Another 3.5 million licenses, tags, permits and stamps were sold to non-residents, totaling approximately 37 million hunting licenses sold.", "While 37 million hunting licenses is indeed more than 25 million military members, again, as we noted earlier, this is a misleading comparison. A single hunter, for example, may possess multiple hunting licenses.", "The Number of Hunters in the United States? Approximately 15 Million", "Hunting licenses are issued by the state. If a hunter travels from one state to another, that person must purchase (at least) two hunting licenses. The figure cited above also includes \"tags,\" which many states require for each \"big game\" animal harvested. A federal duck stamp is also required to hunt migratory birds.", "The U.S. Fish And Wildlife Service reported in 2018 that while there were approximately 37 million licenses, tags, permits and stamps sold, there were only approximately 15 million paid hunting-license holders.", "Outdoor Life Magazine reported in October 2019 that the number of hunters in the U.S. peaked in 1982 \"when nearly 17 million hunters purchased 28.3 million licenses\" but since then has been in a steady decline.", "\"If you watch the demographic shift of license purchases by age, what you find is that when people hit their late 60s and early 70s, regardless of how much you incentivize them, they stop hunting and fishing,\" says Matt Dunfee, director of special programs at the Wildlife Management Institute (WMI). He's been studying hunter recruitment and retention for the last decade. \"There's nothing we can do. They just get too old.\"", "[...]", "The baby boomer bubble is going to burst, but boomers aren’t entirely to blame for this mess. Hunters should have been recruiting enough new license buyers to, if not increase ranks, keep them stable. So what gives?", "Shifting demographics play a big part. Hunters have historically been white men; today, more than 90 percent of hunters are Caucasian, and more than 70 percent are male. But soon—by 2044, according to U.S. Census projections—Caucasians will make up less than half the U.S. population. Plus, the rural population is staying relatively stable, while urban populations are increasing.", "In sum, the number of hunters in the United States (about 15 million) is slightly above the number of active military members (about 10 million), and slightly below the total number of military members (about 25 million) in the world's 10 largest armies. So what does this tell us about the capabilities of hunters to form a militia in order to fight against government armies? Perhaps not much, but it's (apparently) something to think about.", "Krebs, Natalie.   \"Why We Suck at Recruiting New Hunters, Why It Matters, and How You Can Fix It.\"\r\n    Outdoor Life.   15 October 2019.", "Nye, Logan.   \"The Top 10 Militaries of the World.\"\r\n    Military.com.   4 August 2017.", "The International Institute for Strategic Studies.   \"The Military Balance 2018.\"\r\n    2018.", "U.S. Fish and Wildlife Service.   \"National Hunting License Data: Calculation Year 2018.\"\r\n    2018.", "U.S. Fish and Wildlife Service.   \"2016 National Survey of Fishing, Hunting, and Wildlife-Associated Recreation.\"\r\n    2016.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]