["About this rating", "During the Democratic presidential debates on June 27, 2019, U.S. senator Kamala Harris (D-Calif.) got into a heated discussion about race with fellow 2020 candidate and former vice president Joe Biden.", "Harris confronted Biden over remarks he had made about having \"civil\" working relationships with segregationist lawmakers James O. Eastland and Hermand Talmadge. \"It was hurtful,\" said Harris, who is the daughter of immigrants from Jamaica and India, \"to hear you talk about the reputations of two United States senators who built their reputations and careers on the segregation of race in this country.\"", "Harris continued by criticizing Biden for working with those lawmakers \"to oppose busing\" to desegregate schools. She then segued into a personal story about being a \"little girl in California who was part of the second class to integrate her public schools. And she was bused to school every day. And that little girl was me\":", "Those comments by Harris attracted the attention of junk news and conspiracy sites such as Gateway Pundit, which republished an\narticle of theirs from a nearly a year earlier asserting that Harris had \"lied\" about being among the early groups of students who integrated Berkeley schools.", "\"Kamala lied,\" Gateway Pundit declared. \"Actually the classrooms in Berkeley were already integrated in 1963 — before she was born. Here’s a photo from the 1963 Berkeley yearbook. And here’s a photo from the Berkeley 1964 yearbook — the year Kamala was born.\"", "Those photographs did document that black students comprised a significant proportion of a Berkeley public school's student body as early as 1963:", "But the yearbook images posted by Gateway Pundit were from Berkeley High School, not from the area's lower grade-level schools. And that was a key detail.", "Harris was born in 1964, and Berkeley Public Schools didn't fully integrate until 1968, meaning Harris was still a grade school-aged child when the district was in its early years of ending \"de facto segregation\" by using buses to transport children, according to contemporaneous news reports. Harris entered the Berkeley public school system in 1969, when she began taking a bus to Thousand Oaks Elementary School in an affluent, predominantly white area.", "It was misleading of Gateway Pundit to offer images of Berkeley High School's yearbooks in the early 1960s as evidence that Harris was allegedly lying about her role in education desegregation, because Berkeley High was (and is) the only public high school in the city, so it was integrated by necessity. But most of the district's local elementary schools were not integrated back then.", "\"[Berkeley High] was the only high school, that’s where all the kids in the city would go,\" district spokesman Charless Burress told the Associated Press. He confirmed that 14 of the district's elementary schools weren't integrated until the beginning of the 1968 school year. Thus if Harris entered the public school system in 1969, she would have indeed been part of the second class of students in a newly integrated district.", "According to data published by the school district, in 1963 \"Negro\" students comprised only 2.5% percent of the student body at Thousand Oaks Elementary School, while \"Caucasian\" students comprised 95.1% of the student body.  Due to the district's integration efforts, by 1969 those figures had shifted to 40.2% and 53.4%, respectively.", "Berkeley Public Schools.   \"50th Anniversary of Berkeley’s Pioneering Busing Plan for School Integration.\"\r\n    12 December 2017.", "Tolan, Casey.   \"How Berkeley’s Busing Program Changed Kamala Harris’ Life — And the Presidential Race.\"\r\n    The Mercury News.   28 June 2019.", "Seitz, Amanda, and Beatrice Dupuy.   \"NOT REAL NEWS: A Look at What Didn’t Happen This Week.\"\r\n    Associated Press.   28 June 2019.", "Zadrozny, Brandy et al.   \"Mueller Refers Sex Misconduct Scheme Targeting Him to FBI for Investigation.\"\r\n    NBC News.   30 October 2018.", "McCurdy, Jack.   \"Berkeley's School Integration Program Proceeds Smoothly.\"\r\n    Los Angeles Times.   2 September 1968.", "Dale, Daniel.   \"School District Confirms Kamala Harris Was Correct on Integration in Berkeley.\"\r\n    CNN.   28 June 2019.", "Hoft, Jim.   \"SHE LIED: Kamala Harris Says She Was in Second Integrated Class in Berkeley — But Yearbook Pictures Prove She’s Lying.\"\r\n    Gateway Pundit.   27 June 2019.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]