["About this rating", "In July 2015, the EPA proposed clarifications to existing laws governing emissions with respect to road-to-racecar modifications.", "The EPA is banning road-to-race car conversions.", "On 8 February 2016, the Specialty Equipment Market Association (SEMA, a vehicle modification trade association) issued a press release regarding proposed EPA regulations regarding the conversion of vehicles from on-road use to racing purposes:", "The regulation would impact all vehicle types, including the sports cars, sedans and hatch-backs commonly converted strictly for use at the track. While the Clean Air Act prohibits certain modifications to motor vehicles, it is clear that vehicles built or modified for racing, and not used on the streets, are not the “motor vehicles” that Congress intended to regulate.", "\"This proposed regulation represents overreaching by the agency, runs contrary to the law and defies decades of racing activity where EPA has acknowledged and allowed conversion of vehicles,\" said SEMA President and CEO Chris Kersting. \"Congress did not intend the original Clean Air Act to extend to vehicles modified for racing and has re-enforced that intent on more than one occasion.\" ... The EPA indicated that the regulation would prohibit conversion of vehicles into racecars and make the sale of certain emissions-related parts for use on converted vehicles illegal.", "The release caused concern among racing enthusiasts, specifically due to its assertion that the EPA sought to \"prohibit conversion of vehicles originally designed for on-road use into racecars.\" A 9 February 2016 Fox News article reported on SEMA's press release and vaguely clarified that the proposed EPA regulations in question pertained specifically to emissions standards:", "Recently proposed EPA automobile emissions rules could put the brakes on the popular pursuit of converting road cars into race cars for professional and amateur use, says a major automotive trade organization.", "According to SEMA, which represents the aftermarket parts and custom car industry, this passage means just what it says: Cars and trucks originally built and sold for street use would not be exempt from emissions rules if they are converted into competition vehicles.", "And the EPA agrees.", "An agency spokeswoman told Fox News that the proposal essentially restates what the EPA already considers to be the law.", "A Fansided article held that the \"EPA tried to pull a fast one on enthusiasts by sneaking in a proposed regulation that would ban you from building a racecar from a street car,\" maintaining a somewhat conflicting viewpoint:", "According to the Specialty Equipment Market Association on their latest press release, the Environmental Protection Agency snuck in a piece of legislation that would prohibit all street cars from turning into race cars. In addition, any accessory or modification that aids in this process would be banned. That means certain coilover kits, intake kits, exhaust systems and roll cages meant for \"off-road use only\" that would turn your vehicle into anything not meant for the streets would be included in this sweeping regulation.", "The EPA regulation reads, \"Certified motor vehicles and motor vehicle engines and their emission control devices must remain in their certified configuration even if they are used solely for competition or if they become nonroad vehicles or engines. 80 Fed. Reg. 40138, 40565 (July 13, 2015).\"", "It was difficult to ascertain whether the proposed regulations would prohibit all racing conversions or simply extend emissions standards to competition vehicles no longer used as road cars. The 629-page long document [PDF] was part of a larger proposal in which road car to race car conversions constituted a minute portion of the larger regulatory focus on vehicle emissions. A portion of page 391 of the document addressed the impetus to regulate non-road vehicles with respect to emissions:", "The existing prohibitions and exemptions in 40 CFR part 1068 related to competition engines and vehicles need to be amended to account for differing policies for nonroad and motor vehicle applications. In particular, we generally consider nonroad engines and vehicles to be \"used solely for competition\" based on usage characteristics. This allows EPA to set up an administrative process to approve competition exemptions, and to create an exemption from the tampering prohibition for products that are modified for competition purposes. There is no comparable allowance for motor vehicles.", "There is no prohibition against actual use of certified motor vehicles or motor vehicle engines for competition purposes; however, it is not permissible to remove a motor vehicle or motor vehicle engine from its certified configuration regardless of the purpose for doing so.", "On 9 February 2016, EPA spokeswoman Laura Allen released a statement in response to SEMA's release which maintained that the proposed regulation(s) clarified (but didn't alter) current laws pertaining to emissions standards and racecars:", "People may use EPA-certified motor vehicles for competition, but to protect public health from air pollution, the Clean Air Act has — since its inception — specifically prohibited tampering with or defeating the emission control systems on those vehicles. The proposed regulation that SEMA has commented on does not change this long-standing law, or approach.", "Instead, the proposed language in the Heavy-Duty Greenhouse Gas rulemaking simply clarifies the distinction between motor vehicles and nonroad vehicles such as dirt bikes and snowmobiles. Unlike motor vehicles — which include cars, light trucks, and highway motorcycles — nonroad vehicles may, under certain circumstances, be modified for use in competitive events in ways that would otherwise be prohibited by the Clean Air Act.", "EPA is now reviewing public comments on this proposal.", "Allen released an additional statement to Road & Track further clarifying the EPA's July 2015 proposals, of which that web site emphasized the portion reproduced below:", "This clarification does not affect EPA's enforcement authority. It is still illegal to tamper with or defeat the emission control systems of motor vehicles. In the course of selecting cases for enforcement, the EPA has and will continue to consider whether the tampered vehicle is used exclusively for competition. The EPA remains primarily concerned with cases where the tampered vehicle is used on public roads, and more specifically with aftermarket manufacturers who sell devices that defeat emission control systems on vehicles used on public roads.", "In short, the EPA maintained that no change to existing law was proposed in the July 2015 document which had prompted SEMA's February 2016 press release. The only difference, the agency said, was clarification of the scope of standing laws. In subsequent statements, the EPA reoterated that their concern lay largely with modified vehicles on public roads and the sale of aftermarket devices that inhibit emission control systems.", "SEMA's press release hyperbolically described the EPA's focus as expressly prohibiting all conversions from street cars to race cars.  The EPA later said their focus was \"more specifically [on] aftermarket manufacturers who sell devices that defeat emission control systems on vehicles used on public roads.\" While stricter enforcement of emissions standards on racecars might prove burdensome to racing enthusiasts, it wasn't the absolute crackdown it was made out to be. Finally, the regulations would not be retroactive, nor would they go into effect until 2018.", "On 11 February 2016, a SEMA representative e-mailed us a statement regarding the EPA-related controversy. SEMA maintained that the wording of the EPA's proposed changes made road to racecar conversions functionally illegal, irrespective of whether the EPA intended to enforce said proposed changes. Moreover, SEMA reiterated opposition to the EPA's assertion extant provisions of the Clean Air Act extended to racing vehicles:", "Although your article claims that it is “false” that the EPA is banning road-to-race car conversions, the language that the EPA is adding to the regulations (below) literally makes it illegal to make any changes to the “emission control devices” of a “certified motor vehicle” (i.e., any vehicle that was originally sold as complying with emissions standards for street use) even if the vehicle is being converted for racing and will never again be used on public roads. The EPA considers “emission control devices” to include the engine, the computer that runs the engine, the intake and the exhaust, so any changes to these components would be prohibited. The fact that the EPA says that they don’t plan on enforcing it does not change the fact that they are adding it to the regulations. SEMA also disagrees with the EPA’s position that this was already the law because the Clean Air Act, as written and amended by Congress, was never intended to extend to racing vehicles.", "“Certified motor vehicles and motor vehicle engines and their emission control devices must remain in their certified configuration even if they are used solely for competition or if they become nonroad vehicles or engines.” 80 Fed. Reg. 40138, 40565 (July 13, 2015).", "Additionally, SEMA’s comments to the EPA on this proposal can be found online at https://www.regulations.gov/#!documentDetail;D=EPA-HQ-OAR-2014-0827-1469\"", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]