["Democrats and Republicans have drawn the battle lines for Pinellas County’s open U.S. House seat, with candidates’ backgrounds serving as ammunition. While Democrats go after David Jolly’s history as a lobbyist in Washington, D.C., the GOP is attacking Alex Sink’s record on issues in Florida.", "One oft-repeated charge is that Sink is a \"tax and spender Florida can’t afford.\" In a TV commercial released on Jan. 22, 2014, the National Republican Congressional Committee charges that Sink supports Obamacare, then adds charges about her stance on taxes.", "\"Sink has supported higher taxes, too,\" the ad says. \"Higher property taxes. Higher sales taxes. More taxes on water and TV too.\"", "Sink, a former banking executive, only held one elected office -- Florida’s chief financial officer from 2007 to 2010 -- so we weren’t sure whether it was accurate that she supported higher taxes \"on water and TV.\" And since both are important to her prospective constituents, we decided to tune in focus on that claim in this item.", "An old problem", "The NRCC’s claim stems from Sink’s tenure on the Governor's Commission on Education, back in 1997. The bipartisan group of educators, business leaders and lawmakers was co-chaired by Democratic Lt. Gov. Buddy MacKay, a Democrat, and Jack Critchfield, a Republican and chairman of Florida Progress Corp.", "Sink, then president of the Florida Banking Group for NationsBank, was joined on the board by executives of such companies as Walt Disney Attractions, Eckerd Corp. and CSX Transportation.", "The group, appointed by Democratic Gov. Lawton Chiles in 1996, had no legislative power, but it did make recommendations about how to pay for school construction at a time when overcrowding was plaguing some districts. Faced with full schools and outdated facilities, one topic that drew the board’s attention was searching for ways to build more classroom space.", "One of the commission’s potential solutions was unveiled in February 1997: Expand a 2.5 percent utilities tax on the gross receipts of electricity, natural and manufactured gas and telecommunication services to include water, sewer, cable and solid waste utilities. The group proposed instituting the new tax on those utilities in 0.5 percent increments over five years, which would eventually cost the average household $24 per year, and would raise millions for school construction.", "Sink was in favor of instituting the entire tax all at once, rather than over the course of five years. Lawmakers opposed this, especially House Republicans, who in 1997 held a majority in that wing of the Legislature for the first time in 122 years.", "\"We ought to say we have a crisis, and this is what we really think should happen,\" Sink said. \"If the politics go the other way, so be it.\"", "The idea of instituting the tax all at once failed in a vote by the commissioners, 18-12. The group spent the rest of the year looking for other solutions, including a video lottery and a variety of local taxes.", "Ultimately, all was for naught, as the divided Legislature debated new taxes without coming to an agreement during the regular session. Chiles called a special session in the fall to deal with the school construction issue, with lawmakers eventually agreeing to use Florida lottery profits for $2.5 billion in bonds, plus $200 million from surplus revenues. That lottery money amounted to $180 million per year over 30 years. The deal was considered a victory by both Democrats and Republicans, since it built new schools without relying on new taxes.", "Our ruling", "The NRCC said Alex Sink supported \"more taxes on water and TV\" in the past.", "She did indeed support such taxes, though that happened during her tenure on an advisory panel 17 years ago. Sink didn’t have any control over the state’s tax structure, either then or in her future job as the state’s chief financial officer. The statement is accurate but needs clarification or additional information, so we rate it Mostly True.", "YouTube video, \"Alex Sink: Another Tax and Spender Florida Can't Afford,\" Jan. 22, 2014", "Tampa Bay Times, Education panel appointments called political, Sept. 17, 1996, accessed Jan. 23, 2014 via Nexis", "South Florida Sun-Sentinel, \"Panel To Diagnose State's Education,\" Oct. 18, 1996", "Tampa Bay Times, \"Commission: expand tax to build more schools,\" Feb. 28, 1997, accessed via Nexis, Jan. 23, 2014", "Orlando Sentinel, \"School Funding Fight May Force Extra Session,\" April 22, 1997", "Orlando Sentinel, \"School Solutions Call For Taxes, Video Lottery,\" Oct. 15, 1997", "Orlando Sentinel, \"Budget Pushes Out 1 Education Board,\" April 24, 1998", "Florida Times-Union, \"Legislature adjourns on time,\" May 3, 1997", "South Florida Sun-Sentinel, \"Special Session On Education Must Work Toward Viable Solution,\" Sept. 25, 1997", "South Florida Sun-Sentinel, \"Legislators Reach Agreement: $2 Billion For New Schools,\" Nov. 6, 1997", "New York Times, \"Florida to Spend $2.7 Billion to Build Schools,\" Nov. 9, 1997", "Tampa Bay Times, \"Webster's sorry performance,\" May 11, 1998, accessed Jan. 24, 2014 via Nexis", "Tampa Bay Times, Chiles gives public schools a C, Nov. 20, 1998, accessed Jan. 24, 2014 via Nexis", "Interview with Katie Prill, National Republican Congressional Committee spokeswoman, Jan. 22, 2014", "Interview with David Bergstein, Democratic Congressional Campaign Committee spokesman, Jan. 22-23, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]