["Rep. Diana DeGette, D-Colo., invoked a well-worn statistic to illustrate how women earn less than men during her speech at the Democratic National Convention.\n\n\"More and more in this economy, the women are the family breadwinners. We are managing our family budgets, struggling to pay healthcare bills and facing the challenge of saving for college,\" DeGette said during her Sept. 5, 2012, speech. \"We feel it in our paychecks when we receive only 77 cents for every dollar a man earns.\"\n\nWe’ve heard this statistic often, and not during just the convention. Lilly Ledbetter, the namesake of Obama’s first signed bill, used it in her speech the night before, and Obama used it -- inaccurately -- in a campaign ad this summer.\n\nThis statistic is factual when applied correctly. DeGette did a fine job of describing the figure, though 77 cents isn’t the definitive measure of the gender gap. (It happens to be the widest.)\n\nPoliticians get income data from the U.S. Census Bureau and the U.S. Bureau of Labor Statistics.\n\nThe Census Bureau, which tracks annual wages, found women who worked full-time, year-round in 2010 made 77 cents for every dollar men earned across the country. This comparison includes all male and female workers regardless of occupation.\n\nThe Bureau of Labor Statistics uses different measures to analyze the pay gap, including weekly wages. In 2010, women working full-time had median weekly earnings of $669, versus $824 for males, according to a BLS report  released in 2011. So women earned 81 cents of every dollar earned by men, which has been typical since 2004.\n\nWhat’s the difference? Unlike the measure of annual wages by the Census Bureau, the weekly wage analysis does not account for people who are self-employed. It does include people left out of the year-round wage measure, such as some teachers, construction workers and seasonal workers.\n\nAnother measure -- hourly rates -- shows a smaller degree of pay disparity. According to BLS data, women are paid 86 percent of the median hourly wages of men. This evaluation accounts for part-time (fewer than 35 hours) workers, which are more often women and are paid less than their salaried counterparts. Women paid by the hour made median hourly earnings of $11.83, compared to $13.76 for men.\n\nWe wondered which figure is best. Heidi Hartmann, president of the Institute for Women’s Policy Research, prefers the measure of annual wages, which do not exclude salaried workers as the hourly measure does.\n\n\"It’s the one that goes back the furthest in time,\" she said. \"It’s the one that is most traditional.\"\n\nBut some researchers, such as the Federal Reserve Bank of St. Louis, prefer working with hourly wages, arguing \"an incomplete picture\" is cast with weekly earnings because women work fewer hours than men, \"which would make a gap in weekly earnings between the two groups substantial even if their hourly wages are the same.\"\n\nHartmann’s think tank analyzed pay parity for the top 20 occupations for women in 2011 using median weekly earnings. The center found the pay gap varies depending on the field, though women lag in nearly every category. Consider nurses (96 cents to every dollar),  cashiers (90 cents), accountants (77 cents) and financial advisers (66 cents).\n\nSo how much of a role does discrimination play? Hartmann attributed anywhere from one-quarter to one-third of the gap to direct discrimination by the employer. The U.S. Department of Labor put it around 40 percent in a blog post on this topic.\n\nA woman’s ties to child care is also factored in, with studies saying this obligation restricts her career options and hours. Women also more often choose occupations with lower wages, obtain degrees that lead to lower-paying jobs than men, and take more time off from work for pregnancy and child care, according to a 2009 analysis by the nonpartisan CONSAD Research Corp. in Pittsburgh.\n\nMen and women historically enter certain fields more than others -- a phenomenon known as \"occupational segregation.\" Women more often choose to be receptionists, nurses and teachers, while men pursue paths as truck drivers, managers and computer software engineers, according to the Institute for Women’s Policy Research.\n\nOur ruling\n\nDeGette claimed women \"receive only 77 cents for every dollar a man earns.\" The measure comes from a valid source, though other comparisons indicate the gap is tighter. Also, some occupations have smaller gaps than others.\n\nWe rate the claim Mostly True.", "Library of Congress THOMAS, the Lilly Ledbetter Fair Pay Act of 2009 , accessed Jan. 29, 2009\n\nCSPAN, Rep. Diana DeGette remarks at Democratic National Convention,Sept. 5, 2012\n\nPolitiFact Obameter, \"Obama signs Ledbetter Act,\" Jan. 29, 2009\n\nPolitiFact, \"Barack Obama ad says women are paid \"77 cents on the dollar for doing the same work as men,\" June 21, 2012\n\nPolitiFact Virginia, \"Tim Kaine says Virginia women earn 79 cents to every $1 made by men,\" June 15, 2012\n\nInterview with Heidi Hartmann, president of the Institute for Women’s Policy Research, Sept. 5, 2012\n\nU.S. Census Bureau, Current Population Survey, 2010, accessed June 11, 2012\n\nU.S. Census Bureau, \"Income, Poverty, and Health Insurance Coverage in the United States: 2010,\" September 2011\n\nU.S. Bureau of Labor Statistics, \"Women in the Workforce: A Databook,\" December 2011\n\nU.S. Bureau of Labor Statistics, \"Highlights of women’s earnings in 2010,\" July 2011\n\nInstitute for Women's Policy Research, \"Obama is Right About His Wage Gap Statistics,\" June 13, 2012\n\nInstitute for Women’s Policy Research, \"The Gender Wage Gap by Occupation,\" April 12, 2012\n\nCONSAD Research Corp., \"An Analysis of Reasons for the Disparity in Wages Between Men and Women,\" Jan. 12, 2009.\n\nWashington Post’s The Fact Checker, \"The White House’s use of data on the gender wage gap,\" June 5, 2012\n\nFactCheck.org, \"Obama’s 77-cent exaggeration,\" June 22, 2012\n\nDepartment of Labor, \"Myth-busting the pay gap,\" June 7, 2012", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]