["About this rating", "In October 2020, microscopic robots that could \"effortlessly surf right up your butthole\" made headlines after engineers at Purdue University announced that they had developed a \"microrobot\" capable of delivering pharmaceutical drugs to vital organs by gaining entry through the rectum.", "As incredible as this might sound, the claim is true. However, there is an important caveat to note: The robots were not deployed in human subjects but rather in anesthetized mice and colons surgically removed from pigs, which have similar gastrointestinal systems to humans.", "Measuring the width of a human hair, the microrobot has the potential to one day be used in clinical and biomedical applications in hard-to-reach parts of the human body, particularly when it comes to intrusive and painful procedures, even if the point of entry is a bit unconventional.", "Each bot was developed using nontoxic metal and polymer and, because it is too small to carry a battery or computer, is outfitted with magnets that interact with a magnetic field outside to provide locomotion. Differences in the magnetic polarization between the microrobot and the external magnetic field create a tumbling end-over-end effect that works in the same way that opposing magnets push apart. These small, magnetic-controlled bots are capable of climbing inclines up to 60 degrees in fluid movements, as well as over “complex, unstructured terrain” like that seen in a colon.", "“Moving a robot around the colon is like using the people-walker at an airport to get to a terminal faster. Not only is the floor moving, but also the people around you,” said Luis Solorio, assistant professor at Purdue’s Weldon School of Biomedical Engineering, in a news release.", "“In the colon, you have all these fluids and materials that are following along the path, but the robot is moving in the opposite direction. It’s just not an easy voyage.”", "Once in the colon, the microrobot has the ability to release a pharmaceutical drug payload. To test this theory, the researchers coated each microrobot in a fluorescent-colored mock drug to see how quickly it would diffuse in a natural environment — about an hour. In future applications, the microrobots can be coated in drugs that could be administered directly to the organ being targeted, reducing potential adverse side effects from drugs as they pass through organs en route to their final destination in a noninvasive way.", "Mice under anesthesia were administered the tiny robots in a saline solution through the rectum, at which point researchers were able to test and track their movements in real time through an ultrasound. And if the bots are small enough for mouse guts, the researchers say that humans should also have no problem receiving them, but not without further research.", "“Moving up to large animals or humans may require dozens of robots, but that also means you can target multiple sites with multiple drug payloads,” said Craig Goergen, Purdue’s Leslie A. Geddes Associate Professor of Biomedical Engineering.", "https://www.youtube.com/watch?v=9OsYpJFWnN8&_ga=2.157804274.956222068.1603923283-241649219.1603923283", "Writing in the scientific journal Micromachines, the study authors added that the size and shape of the microrobots are constraining and limit their application. For starters, the devices are 2-dimensional and rigid, which means they lack locomotive abilities outside of tumbling forward. The magnetic field is also static, making it difficult to produce more complex scenarios that would give the ability to more precisely control the external magnetic field, allowing the robot to jump, crawl, swim, and even walk.", "Although the microrobot tests were conducted in the colon, its success suggests that it may be capable of real-time manipulation that can target other hard-to-reach systems in the body like the stomach, intestines, and even the human brain, concluded the researchers. Its small size not only presents the potential to access areas of the body that otherwise require more invasive measures, but its ability to be wirelessly controlled could reduce patient trauma and side effects and result in a higher rate of retaining administered drugs.", "Correction [Oct. 30, 2020]: A previous version of this article erroneously described the metal used in the robots as \"toxic.\" That has been corrected to \"nontoxic.\"", "Madison Dapcevich is a freelance contributor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]