["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Pro guns rally at the Rhode Island State House in 2014.", "House Speaker Nicholas Mattiello is not among Rhode Island lawmakers eager to further restrict gun ownership following a rash of gun-related mass killings, including a rampage in San Bernardino, Cal.", "\"Let’s start with the premise that Rhode Island already has one of the 10 strictest [gun laws] amongst all the states,\" the Cranston Democrat told The Journal. \"...An assault weapons ban? Tell me how that helps anybody.\"", "Yes, let’s start with that premise. In fact, let’s focus on it.", "Is Rhode Island among 10 U.S. states with the most stringent controls on guns?", "We called Mattiello’s spokesman and asked him to find out where the speaker’s information came from. Meanwhile, we looked around on our own.", "It didn’t take long to find something known as the \"Gun Law State Scorecard.\" Maintained by the Law Center to Prevent Gun Violence, the scorecard ranks Rhode Island No. 9 based on the strength of its gun laws.", "We found another ranking, also compiled in 2015, from the Brady Campaign to Prevent Gun Violence, another organization that supports stronger gun laws. The campaign is named, in part, after the late Jim Brady, a White House press secretary who was shot and disabled when a Texas man attempted to assassinate President Ronald Reagan in 1981.", "One of the Brady Campaign’s web sites, CrimAdvisor.com, is a spoof on TripAdvisor.", "\"Plan your perfect getaway,\" it says, on a web page that identifies the 10 most attractive states for getting a gun. Rhode Island is listed among the 10 least gun-friendly states with a ranking of No. 8.", "The law center, which was Mattiello’s primary source, was established in San Francisco after a 1993 shooting that killed eight and wounded six.", "The shooting, which took place at a law firm, led Bay area lawyers to create an organization that campaigned for a federal ban on assault weapons. Later, it focused on supporting state and local gun regulation in California.", "In 2015, the center worked on a variety of projects to support stronger gun laws across the country.", "And each year, the center analyzes state gun laws and grades each state on the \"strength\" of its regulations.", "Strength isn’t always the same thing as strictness,  but it’s fair to say there are more gun restrictions in states that get the best grades.", "In 2015, Rhode Island’s grade of B+ gave it a ranking of No. 9 on the scorecard, just behind Illinois and just ahead of Delaware.", "A spokesman for the law center, Garrett McDonough, told us that he wouldn’t have used the word \"strictest,\" but the center’s data does support Mattiello’s statement.", "\"Our position would be that that statement is accurate,\" he said.", "\"We don’t like to use the word strict because it makes it sound like it’s a prohibition or a restriction of people’s rights,\" he said.", "Other studies show that Rhode Island competes well in other statistics valued by supporters of gun control. One of them, the per capita rate for gun deaths, is low.", "Also, by a per capita measure, incidents of guns purchased in Rhode Island and then used in crimes out of state are low.  Rhode Island’s per capita rate in this category was the sixth lowest in the country, according to a Washington Post analysis of gun trace data provided by the  Bureau of Alcohol, Tobacco, Firearms and Explosives.", "Our ruling", "The Law Center to Prevent Gun Violence is an outspoken advocate for gun control laws. And its legal experts rate Rhode Island among states with the strongest gun-control laws.", "The statement is True.", "ProvidenceJournal.com, \"On tap for Rhode Island’s General Assembly in 2016: Tolls, gambling, gun control,\" accessed Jan. 4, 2016.", "GunLawScorecard, Law Center to Prevent Gun Violence, \"2015 Gun Law State Scorecard,\" accessed Jan. 4, 2016.", "Larry Berman, spokesman for House Speaker Nicholas Mattiello, D-Cranston, interview Jan. 4, 2016, and emails, Jan. 4 and Jan. 6, 2016.", "Garrett McDonough, spokesman, Law Center to Prevent Gun Violence, interview, Jan. 5, 2016.", "CrimAdvisor.com, Brady Campaign to Prevent Gun Violence, \"Plan Your Perfect Getaway,\" accessed Jan. 6, 2016.", "ProvidenceJournal.com, \"Gun deaths in R.I.,\" June 29, 2015, accessed Jan. 4, 2016.", "ProvidenceJournal.com, \"R.I. is on the low end for guns used in out-of-state crimes,\" Dec. 29, 2015, accessed Jan. 6, 2016.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]