["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Eliminating global food loss would save an estimated 250 cubic kilometers of water. (LEF)", "We know we Americans have big issues with our waistlines, but are our issues with wasted food just as large?", "A recent tweet from FoodMentum, an anti-food waste advocacy website, says we do.", "\"Europe and US households waste 15 times more food than a person in Africa,\" the Oct. 10, 2016, tweet said.", "A nice bit of statistical fodder for a fact-check, we thought.", "FoodMentum’s funder Maria Huszar told us she got the stat from a blog post on Foodtank, a food policy information clearinghouse. The article used slightly different words, but the gist was the same.", "\"A European or North American consumer wastes 15 times more food than a typical African consumer,\" it said.", "Huszar acknowledged she swapped consumer for household. She also lumped Canada in with the United States, but our main concern was to check the accuracy of the gap between the two leading industrialized economic regions and Africa.", "A quick note here on what’s meant by food waste. That term refers to food that gets thrown in the trash, either by retailers -- think supermarkets and restaurants -- or consumers. That’s separate from food loss, which happens at farms, in transport, and at food-processing plants. Those products fall by the wayside due to spoilage or blemishes or wasteful production methods.", "The U.N. Food and Agriculture Organization commissioned a benchmark study on both losses and waste in 2011. It concluded that the per-capita food waste by consumers in Europe and North-America is between 95 and 115 kilograms a year. In sub-Saharan Africa and south and southeast Asia, it’s between 6 and 11 kilograms a year.", "Those numbers might seem clear. but they actually leave plenty of room for uncertainty.", "You can play with the ratios and get results that vary from more than 15, less than 15 and pretty close to 15.", "But most important for the claim we’re vetting, this study doesn’t give a clear estimate of food waste for sub-Saharan Africa alone. It gives a range that includes much of Asia.", "Vaclav Smil, professor emeritus at the University of Manitoba, Canada, told us there’s good reason to keep the figures vague. Smil, who has written many books and articles on the intersection of food, policy, energy and the environment, said too much data is missing.", "\"All countries, except Japan, have only approximate, derived, assumed, secondary waste data,\" Smil said.", "While some work has been done in Europe and the United States, the U.S. Food and Agriculture Organization reported in 2013 that \"there are currently no published studies available related to the exact amount of food waste in developing countries.\"", "Smil said the difference between North America and Europe compared to sub-Saharan Africa could fall anywhere between five and more than 12. All we can say for sure, according to Smil, is that the gap is large.", "Researcher Brian Lipinski at the World Resources Institute in Washington echoed that point. Lipinski said the more important point is that overall food losses occur very differently.", "\"In the U.S. and Europe it's mostly on the consumer end,\" he said. \"While in places like Africa, it's much more on the production end due to factors like pests, lack of adequate storage, and lack of infrastructure.\"", "More money = more food waste", "So why is food waste so much bigger in wealthier countries? As the authors of the 2011 report put it, those \"people simply can afford to waste food.\" That waste takes place at many points. Supermarkets throw out fruits and vegetables that lose a bright fresh look. Restaurants serve portions that go beyond what most people can finish.", "As for what we do at home, a study in the United Kingdom found plenty of habits that make it more likely that food will end up in the trash. The list includes buying too much because we don’t know what we need and throwing out packaged food as soon as it goes past the printed expiration date, when it’s actually still fine to eat.", "Smil pointed to one telltale problem -- fewer people cook.", "\"People who do not cook regularly have very poor control of their fridge contents and do a poor job of avoiding preventable losses,\" he said. And he added that even when people do cook, especially single people, they \"engage in little reheating next day.\"", "By the way, Lipinski said his group doesn’t argue that if Americans and Europeans wasted less food it would help the nearly 800 million who don’t get enough around the world. It would save billions of gallons of water and reduce greenhouse gas emissions, but that would do nothing to improve harvests and storage in places like sub-Saharan Africa.", "The advocacy website FoodMentum said that Americans and Europeans waste 15 times as much food as the typical African. The number is on the high end of estimates and there are plenty of gaps in the data. But experts who study this say people in wealthier countries waste much more food than people in poorer ones.", "We rate the claim Mostly True.", "https://www.sharethefacts.co/share/b0e5b3b6-2e90-4d24-963f-1c3980479917", "Foodmentum, tweet, Oct. 10,, 2016", "Food and Agriculture Organization of the United Nations, Global food losses and food waste – Extent, causes and prevention, 2011", "Food and Agriculture Organization of the United Nations, Food wastage footprint, Sept. 11, 2013 video", "Resources, Conservation and Recycling, Spaghetti Soup: The Complex World of Food Waste Behaviours, October 2013", "European Parliament Research Service, Tackling food waste, Jan. 23, 2014", "European Commission, Preparatory study on food waste across EU 27, October 2010", "BBC, Food waste reduction could help feed world's starving, July 3, 2014", "World Resources Institute, Reducing food loss and waste, June 2013", "Food and Agriculture Organization of the United Nations,  Climate-smart agriculture sourcebook, 2013", "Foodtank, 10 Facts You Might Not Know About Food Waste, June 15, 2015", "Financial Times, The global waste dilemma: where does our food go?, Jan. 14, 2016", "CGIAR, Food waste: Big facts, accessed Oct. 26, 2016", "Email interview, Brian Lipinski, associate, World Resources Institute, Oct. 26, 2016", "Email interview, Vaclav Smil, professor emeritus, University of Manitoba, Canada, Oct. 25, 2016", "Email interview, Maria Huszar, founder, Foodmentum, Oct. 25, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]