["About this rating", "The Kremlin-backed English language news network RT pointed out what they viewed as a duplicitous double standard when it came to American interaction with pro-Russian politicians in an April 2018 post about a photograph showing former FBI director and current special counsel Robert Mueller meeting with former Ukrainian president (and noted Paul Manafort benefactor) Viktor Yanukovych, taken in 2013:", "Special Counsel Robert Mueller is prosecuting former Trump campaign manager Paul Manafort on charges tied to lobbying for the former government of Ukraine. Mueller however, has his own history of working with Kiev ... For all Mueller’s zealotry in digging into the Trump team’s alleged foreign dalliances, the special counsel has kept quiet his own history of dealing with Yanukovych while he was a client of Manafort.", "As director of the FBI, Mueller travelled  to Ukraine to meet with Yanukovych in June 2013. The two men spoke about counter-terrorism operations and strengthening the US-Ukraine relationship. It did not seem to bother Mueller that the Obama administration was critical of Yanukovych, accusing him of being pro-Russian.", "The pro-Trump Reddit group r/TheDonald, as well as several online personalities who include the hashtag #MAGA in their biographies, have similarly run with this photograph of evidence of suspect activity on Mueller's part:", "The photograph is real, but it does not represent any sort of activity that Robert Mueller sought to hide from the American public — indeed, the meeting took place as part of his official business as FBI director. Following the Boston Marathon bombing, carried out by two brothers of Chechen descent, the United States and Russia made overtures to collaborate on anti-terrorism initiatives, as reported in the 2017 compilation of security documents titled Russia’s Resurgence:", "In April 2013, in the wake of the explosions in Boston, allegedly carried out by two ethnic Chechen brothers who emigrated to the United States, Presidents Obama and Putin agreed in a phone conversation to step up counter-terrorism cooperation, and Secretary of State John Kerry and Russian Foreign Minister Sergey Lavrov met on the sidelines of the NATO-Russia Council meeting in Brussels on April 23, 2013, to discuss counter-terrorism cooperation. FBI Director Robert Mueller visited Moscow on May 7 to discuss cooperation on the Boston bombing. The two Presidents issued a statement pledging greater counter-terrorism cooperation during a summit meeting in June 2013. Such cooperation has faced various challenges, including new tensions in U.S.-Russia relations.", "In June 2013, amid several meetings between member states of the security-oriented intergovernmental Organization for Security and Cooperation in Europe (OSCE), FBI director Robert Mueller met with Victor Yanukovych, then the head of state for Ukraine (the country chairing the OSCE in 2013), as reported in a 5 June 2013 Facebook post from the Embassy of Ukraine in USA:", "While in Ukraine, U.S. FBI Director Robert Mueller met with Ukraine's President Viktor Yanukovych. “Ukraine counts on further cooperation with USA within the OSCE in order to enhance security in the countries of this organization,” the President noted ... The Head of State reminded that since the beginning of 2013, Ukraine had been presiding in the OSCE. “We determined priorities of our presidency in close cooperation with member-states of the OSCE. I am pleased to note that we have a constructive cooperation with Washington in this sphere,” the President emphasized ...", "In his turn, FBI Director Robert Mueller expressed gratitude to the President of Ukraine for the assistance provided after the explosions in Boston. “I would like to focus on the most important issue for us -- the issue of combating terrorism. I would like to say thank you for the assistance provided to us after the Boston Marathon,” he noted. FBI Director also informed that in the course of his meetings in Ukraine, he planned to discuss a number of issues of mutual interest.", "In sum, the photograph is factual, but the implication that it documents some form of impropriety relies on a context-free retelling of an FBI director's performing his duties as an FBI director.", "RT.   \"Mueller Met with Ex-ukraine President While Manafort Was Lobbying for Him.\"\r\n    7 April 2018.", "Lovelace, Jr. Douglass C. (ed).   Terrorism: Commentary on Security Documents vol. 146. Russia’s Resurgence.\r\n    Oxford University Press, 2017.   10624007   (p. 75).", "Woodruff, Betsy.   \"When Mueller Worked with Manafort’s Dictator Client.”\r\n    Daily Beast.   6 April 2018.", "Embassy of Ukraine in the USA (Facebook).   \"While in Ukraine, U.S. FBI Director Robert Mueller Met with Ukraine's President Viktor Yanukovych.\"\r\n    5 June 2013.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]