["About this rating", "A depiction of Jesus standing behind U.S. President Donald Trump was manipulated to make it look like convicted killer Charles Manson was behind the president.", "This image was not widely shared by Trump's supporters.", "On Aug. 24, 2020, a Twitter user posted an image of U.S. President Donald Trump being watched over by cult leader Charles Manson and claimed that the president's supporters were sharing it on Facebook under the false impression that it actually showed Jesus:", "The above-displayed tweet was shared more than 34,000 times and received more than 140,000 likes. As this claim circulated on social media, we started receiving queries asking if Trump supporters were truly sharing the image. One reader even asked if it had been shared by the RNC:", "Is the RNC really posting this image of Charles Manson and Donald Trump photoshopped together to appear as if Manson is Jesus endorsing Trump?", "While it's certainly possible that a handful of Trump supporters have shared this image by accident, we found no record of it being shared on the social media pages of the Republican National Convention, the White House, or the GOP. While we have not perused the accounts of every elected Republican lawmaker, we can say that we have not encountered any high-profile Republican accounts sharing the image in earnest, nor any postings by Trump's supporters that were widely shared on social media.", "The image of Manson and Trump appears to be a manipulated version of a painting that originally showed Trump and Jesus entitled \"You are not Alone\" that was uploaded to Fine Art America by Danny Hahlbohm on May 28, 2020. Here's a look at the original painting (left) and the manipulated version (right):", "A third version of this painting was also circulated on social media. This alternate version, however, also depicts Jesus standing behind Trump, not Manson. Hahlbohm confirmed to us in an email that he was the artist behind this alternate version, explaining that this was just an earlier version of his painting he had since revised.", "Here's a comparison of Hahlbohm's painting from Fine Art America (left) and the earlier version (right):", "To sum up: A painting of Jesus standing behind Trump was digitally altered to make it appear as if Trump were being watched over by cult leader Manson, not Jesus. While the Trump / Manson image went viral along with the claim that it was unknowingly being shared by Trump supporters, we could find no popular instances of Trump supporters sharing the Manson image in earnest.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]