["Sen. Tim Kaine says President Donald Trump was once offered all the money he wanted for Southern border security, and turned it down.", "His comments came during a Jan.9 interview on CNN, amid a federal government shutdown over disagreements on funding to expand a security wall on the Southern border. Trump is demanding $5.7 billion for project; congressional Democrats are drawing the line at $1.3 billion.", "Kaine said his fellow Democrats have tried in the past to compromise with Trump on border security, but to no avail.", "\"We took a deal to the president just last February, less than a year ago - $25 billion over 10 years in border security done the right way - and the president blew up the deal,\" Kaine said.", "We wondered whether Kaine’s statement is accurate.", "Miryam Lipper, the senator’s spokesperson, referred us to a short-lived bill the senator co-sponsored in February 2018. The Senate was intensely debating immigration. Trump had announced that on March 5, he would begin winding down the Deferred Action for Childhood Arrivals program - or DACA - that protects from deportation children who were brought to the U.S. as illegal immigrants. The Senate was seeking a broad compromise with Trump on immigration policies that would save DACA before the March 5 deadline.", "Trump backed a Republican bill that would have appropriated $25 billion for border security. The legislation honored four conditions the president set for continuing DACA:", "Provide money to build the wall;", "Establish a path to citizenship for DACA children, or \"dreamers;\"", "End the visa lottery program that promotes ethnic diversity of immigrants, and", "Severely limit family-based immigration - what Trump calls \"chain immigration.\"", "Ending the diversity visa lottery and restricting family-based immigration - which the Democrats call \"family reunification - were anathema to Democrats. Without bipartisan support, the bill couldn’t reach the 60 votes needed to end debate on it and to advance to a pass-or-fail roll call.", "So Democrats and a handful Republicans - on Feb. 14, 2018 - introduced a substitute bill that they hoped would muster enough bipartisan backing to pass the 60-vote cloture rule. The measure called for $25 billion in border spending over 10 years for wall construction and a host of other security measures. The bill, however, did not address Trump’s demands to end the lottery and narrow family-based immigration.", "On Feb. 15, White House Press Secretary Sarah Huckabee Sanders issued a statement threatening Trump would veto the substitute bill. Trump, in tweets, called the bill \"a total catastrophe,\" that would create \"mass amnesty for over 10 million illegal aliens, including criminals.\"", "The Washington Post and The New York Times reported that Trump also objected that the bill would allocate the $25 billion over 10 years, instead of all at once.", "Later that day, the bill failed. Although a bipartisan group of 54 senators voted for cloture - a majority - they came short of the 60 votes needed to advance. Minutes later, the Republican bill backed by Trump also died.", "Congress failed to reach the March 5 deadline to protect DACA, but the phase-out of the program has put on hold by several courts.", "Our ruling", "Kaine said, \"We took a deal to the president just last February, less than a year ago - $25 billion over 10 years in border security done the right way - and the president blew up the deal.\"", "He’s referring to a 2018 bill backed by Senate Democrats and a few Republicans that would have provided $25 billion over a decade to significantly expand the wall and fund other programs to improve Southern border security.", "Trump vehemently opposed the bill and threatened to veto it because it did not contain two immigration reforms he demanded: ending the visa lottery and deeply restricting family-based immigration.", "We quibble, however, with Kaine’s use of the term \"deal,\" which suggests everything was guaranteed for passage if the president went along. Republicans lawmakers never made that promise. It was really a proposal.", "So we rate Kaine's statement Mostly True.", "U.S. Sen. Tim Kaine, CNN interview, Jan. 9, 2019.", "Congressional Record, pages S1146-S1147, Feb. 15, 2018.", "Email from Miryam Lipper, spokeswoman for U.S. Sen. Tim Kaine, Jan. 11, 2019,", "Vox, \"9 questions about the Senate immigration debate you were too embarrassed to ask,\" Feb. 12, 2018.", "President Donald Trump, tweets, Feb. 15, 2018.", "White House, Statement from the Press Secretary regarding the Schumer, Rounds, Collins Amendment, Feb. 15, 2018,", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]