["The claim was published here on October 27, 2020. It has been shared 966 times.", "The post shows a screenshot of this YouTube video, titled “The Full Statement of Germany’s Foreign Minister Heiko Maas on October 26, 2020.”", "Heiko Maas has served as Germany’s Foreign Minister since 2018.", "The Thai-language text above the screenshot reads: “#Foreign Minister of Germany slapped the nation haters harshly.", "“The Thai King didn’t do anything illegal in German law, he must have the rights and freedom to travel to Germany and German authorities take care of him nicely.”", "The post’s Thai-language caption translates to English as: “When the embassy hit the mob in the middle of the intersection / The German Foreign Minister stated that the Thai king did not break any laws #Thisisabigslapintheface.", "“The German minister knows his duties. The Thai King did not come here to act powerful in any way.", "“He has always taken care of this [agenda] Who would know better than him?”", "On October 26, 2020 Thai pro-democracy protesters gathered at the main intersection in Bangkok before marching to the German embassy, in defiance of their monarch who they claim spends long periods of time in Germany, AFP reported here.", "On October 7, 2020, Maas said during the federal parliamentary session that the Thai king should not be conducting Thai politics from Germany, Reuters reported here.", "Other posts with a similar claim have been shared here, here, here and here on Facebook and here, here and here on Twitter.", "The claim, however, is misleading.", "During a press conference on October 26, Maas said German authorities were still investigating whether the Thai king had broken any laws during his time in Germany.", "The press conference was live-streamed by Periscope and shared in this tweet by the German Foreign Office on October 26, 2020.", "Press conference by Foreign Minister @HeikoMaas and Director General of the International Atomic Energy Agency Grossi https://t.co/qjPdSshUIu", "The 14-minute 32-second livestream video is titled: “Press conference by Foreign Minister @HeikoMaas and Director General of International Atomic Energy Agency Grossi.”", "The press conference, given in German, was dubbed in English.", "At the video’s 13-minute 10-second mark, a journalist is heard posing a question to Maas.", "The journalist’s comments translate to English as: “In Thailand, there are protests today again against the government, and demonstrators are demanding that the federal government looks into whether the Thai king had acted against the law here in Germany, I think that this review has been ongoing for several weeks and is the situation exacerbating since the German government was asked to cooperate?”", "Heiko Maas replied: “Yes, we follow the developments in Thailand closely, there are people taking to the streets for their rights and of course I have an eye on what the king of Thailand has been doing in Germany we are looking into that and if there are things that we feel have broken the law… this will have immediate consequences of course.”", "Deutsche Welle, a German public international broadcaster also reported here on October 26, 2020 that Maas had said German authorities would be monitoring the Thai king during his stay in Germany. It did not state that German officials had exonerated him.", "The article’s headline reads: “German Foreign Minister Heiko Maas: 'I am also watching what the Thai king gets up to in Germany.”", "Since the misleading claim circulated, Germany has said it does not believe Thailand’s king has breached its ban on conducting politics while staying there, Reuters reported here on October 29, 2020.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]