["About this rating", "A wide range of reputable sources over the years have shared a photograph of two women purportedly receiving a golf lesson from a robot trainer. The BBC, for instance, shared the image in a 2015 article about artificial intelligence:", "Mashable and CNN also used this image to illustrate articles about the history (and future) of robotics. Although this image has been featured by a number of credible sources, only a few scant sentences accompanied it in each instance:", "CNN: An early prototype robot was used to assist two women golfers with their swings in this 1925 picture.", "Mashable: A robotic trainer coaches golfers on their swings.", "BBC: Two golfers use a golf robot trainer to help with their golf swing in 1932.", "Outside of these single-sentence descriptions, we couldn't find any information about a robot golf instructor from the 1930s. Rather, it appears that this image was taken on the set of the 1930 film Love in the Rough.", "The confusion likely stemmed from a miscaptioned Getty Images photograph that was included in the gallery \"In focus: Looking for the perfect golf swing?\" That iteration was captioned: \"Two golfers use a golf robot trainer to help with their golf swing.\" However, Getty Images also included this photograph in the gallery \"Classic Entertainment: Bestsellers From Moviepix 1930s\" with a caption identifying one of the women in the photograph as actress Penny Singleton:", "American actress Penny Singleton (1908 - 2003) (known as Dorothy McNulty in the early part of her career) (right) and another actress take lessons on their golf swings from a mechanical instructor in a scene from the musical comedy 'Love in the Rough,' directed by Charles Reisner, 1930.", "The photograph does appear to show actress Penny Singleton and her co-star Dorothy Jordan, on the set of Love In The Rough:", "Other apparent stills from the movie show Singleton in the same outfit.", "We also found two other photographs (one of which was again miscaptioned by Getty as \"young couple plays golf\") of this \"robot golf instructor\" featuring the film's male star Robert Montgomery:", "We only found one image of this robot golf instructor from a different location. Again, however, this image appears to show Love in the Rough actress Penny Singleton:", "Footage of the mechanical golfing robot in action was included in a video titled \"Vintage Wack Inventions\" that was posted to YouTube by FilmArchivesNYC in February 2012. Again, however, it appears that this robot golfer was erroneously included in a montage of real-world (not cinematic) inventions. The clip can be seen at the 6:20 mark of the following video:", "One giveaway is the sound. Not only is the main golf instructor clearly audible, but so are all of the comments from the various participants. Although this would be typical for a movie scene, it's unlikely that a video of a golf lesson from the 1930s would be able to pick up such clear audio.", "We reached out to F.I.L.M. Archive for more information about this footage and the United States Golf Association for any details concerning robot golf instructors from the 1930s but have yet to hear back from either organization.", "The viral image was likely taken on the set of the 1930 movie Love in the Rough. Whether or not this robot actually provided golf lessons, however, has yet to be determined.", "Morse, Felicity.   \"Artificial Intelligence Dictionary: How to Speak AI.\"\r\n    BBC.   13 September 2015.", "Arbuckle, Alex.   \"1928-1981: Dawn of the Robots.\"\r\n    Mashable.   Retrieved 17 July 2017.", "CNN.   \"Will Robots Rule the World of Golf?\"\r\n    6 January 2012.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]