["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A pro-Republican super PAC with close ties to Mitch McConnell, R-Ky., launched an attack ad against U.S. Senate candidate Kelli Ward, R-Ariz., portraying her as a conspiracy theorist.", "The Arizona Senate race is picking up national attention after President Donald Trump criticized incumbent Sen. Jeff Flake as \"weak on crime & border!\" on Twitter. A pro-Trump super PAC is spending $20,000 on Ward, who has cribbed the president’s style in her campaign to \"make Arizona great again.\" The physician served two terms in the Arizona state Senate and lost a 2016 challenge for Sen. John McCain’s seat.", "The McConnell-aligned Senate Leadership Fund is stepping up for Flake with a 77-second video that knocked Ward as \"Chemtrail Kelli\" four times.", "\"Ward wasted your tax dollars for a town hall on chemtrail conspiracy theories,\" the attack ad posted Aug. 22, 2017, says. \"Sponsoring chemtrail legislation? ‘I’m open, I introduce legislation for constituents all the time.’ About another chemtrail town hall? ‘I’ll do it again. Of course I’ll do it again.’ Chemtrail Kelli’s got her head in the clouds with crazy ideas.\"", "We decided to take a closer look at the links the video made between Ward and chemtrails.", "The video is correct in saying that Ward hosted a town hall on the issue. But the ad ignores her record of saying she does not believe in the theory.", "In the conspiracy world, chemtrails are chemical or biological agents dispersed by aircrafts as part of a government plot to control the weather and human behavior. But scientists generally agree that the cloud-like formations that linger in an aircraft’s trail are basically condensation marks.", "In June 2014, Ward invited constituents of her state Senate district to a small, informational seminar on chemtrails by two Arizona Department of Environmental Quality staffers in Kingman, Ariz. Some audience members then provided testimony and asked questions of the staffers and Ward.", "\"The town hall was conducted in response to constituent concerns, and experts were brought in to directly refute those concerns,\" Ward’s spokeswoman Jennifer Lawrence said.", "The ad plucked quotes that made Ward seem like a conspiracy theorist herself. The full quote from her closing remarks at the town hall about being \"open\" to sponsoring legislation to investigate chemtrails is more nuanced.", "\"With this particular issue I think it’s going to be very difficult because, unless you get away from the chemtrail issue that you all are so passionate about, talking about our environmental quality I think can go further in terms of making sure that there aren’t any public health issues that are out there with our water, our soil, or our air,\" Ward said.", "Ward has repeatedly said she doesn’t subscribe to this belief.", "\"I don’t believe in the chemtrail theory,\" she told Politico in 2015.", "She explained in a 2016 radio interview that she considers it her duty as an elected official to respond to her constituents.", "The attack ad singled out a snippet of the interview of Ward. \"About another chemtrail town hall?\" the video asks. \"I’ll do it again. Of course I’ll do it again.\"", "Again, a later part of the interview talks about the need to listen to constituents.", "\"People say, well, would you do it again? Of course I'll do it again because that’s what you’re supposed to do when you’re elected,\" Ward said. \"You’re supposed to listen to the people and you’re supposed to get them the information that they need to feel confident that they live in a safe environment.\"", "A Senate Leadership Fund ad said Ward hosted a town hall on chemtrails and was willing to sponsor legislation on it.", "Calling Ward \"Chemtrail Kelli\" repeatedly and saying she has her \"head in the clouds with crazy ideas\" wrongly suggests she believes in the conspiracy theory.", "Ward did host a town hall on chemtrails, but she has not expressed belief in chemtrails. She has not held further town halls or sponsored any legislation on the topic.", "We rate this claim Mostly False.", "Senate Leadership Fund, \"ChemtrailKelli\" AZ, Aug. 22, 2017", "Youtube, Arizona Senator Kelli Ward Convenes \"Chemtrails\" hearing, June 26, 2014", "The Global Dispatch, \"Kelli Ward interview addresses controversies free speech,\" April 28, 2016", "FEC, Great America PAC Independent Expenditures, Aug. 23, 2017", "KelliWard.com, About Dr. Kelli Ward, Aug. 24, 2017", "Politico, Is the tea party afraid of John McCain?", "Donald Trump, Tweet, Aug. 23, 2017", "Kelly Ward, Tweet, April 15, 2015", "IOP Science, Quantifying expert consensus against the existence of a secret, large-scale atmospheric spraying program, Aug. 10, 2016", "Phone and email interview with Chris Pack, communications director at American Crossroads and Senate Leadership Fund, Aug. 24, 2017", "Email interview with Jennifer Lawrence, Kelli Ward campaign press secretary, Aug. 24, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]