["About this rating", "In June 2020, as protests against police violence and racial injustice continued across the U.S. following the killing of George Floyd, a Black man who died while in police custody in Minneapolis, a photograph started to circulate on social media. The picture supposedly showed a woman named Aracely Henriquez, along with the false claim that Floyd once \"brutally\" assaulted her in a robbery.", "This is not a picture of Henriquez. Before we explain, we should note the police encounter that resulted in Floyd's death in May 2020 began with a report about a counterfeit $20 bill passed at a store, not with an arrest warrant or an investigation into Floyd's alleged criminal history.", "Furthermore, the claims made in this meme are either exaggerated or outright fabricated. While Floyd was indeed arrested for his involvement in a home robbery in 2007 (we conducted a detailed analysis of Floyd's criminal record, including the robbery from 2007, in this article), no evidence suggests that Henriquez was pregnant, or that Floyd threatened to kill her baby. Henriquez was injured during the incident, though the police report says the injuries were inflicted by another man, not Floyd. But the above-displayed image does not illustrate the extent of her injuries because the picture isn't of her.", "This is actually a photograph of Andrea Sicignano, a student who was reportedly assaulted and raped in Madrid in 2018. Sicignano posted these images of herself to her Facebook page, along with a message detailing her attack. The Spanish news outlet El Pais reported:", "A 27-year-old student living in Madrid was attacked and raped by a man two weekends ago close to the bus station in the Aluche neighborhood in the south of the capital, according to sources from police headquarters.", "Andrea Sicignano, who has been living in Madrid for the past six months, described via a public post on her Facebook account what happened to her as she returned home from a night out with a friend.", "[...]", "\"It’s unclear exactly what happened next, but as soon as I started to realize I could be in danger, I tried to leave. But this man became forceful and violent towards me,\" she goes on.", "\"As I fought, he started to beat me. I was screaming and fighting with all of the power I could muster. I desperately tried to reach for my phone but he called out in Spanish, ‘I have your phone, you can't call anyone.’", "[...]", "\"I was sure he was going to kill me,\" she continues. “Eventually I closed my eyes. With the hope that he would stop beating me, I pretended to be dead. I prayed that when I opened my eyes he would be gone. I don’t know how much time passed before I finally opened my eyes, but when I did, he had disappeared.”", "Finally, she writes: “He raped me.”", "In short, the above-displayed meme truly features a photograph of a woman who was brutally assaulted. The woman depicted, however, is not Henriquez, and the assault described in the meme is in no way connected to Floyd. This meme also misstates, exaggerates, and fabricates details about Floyd's 2007 robbery arrest.", "Readers can get a more in-depth look at his criminal record here.", "Evans, Sophie.   \"Brave Student's Bloodied Pictures After Being 'Beaten and Raped by Stranger.'\"  \r\n  The Mirror.   30 December 2018.", "Hertel, Nora.   \"What We Know About George Floyd's Death and Alleged Counterfeit Money in Minneapolis.\"\r\n    USA Today.   3 June 2020.", "El Pais.   \"American Student Attacked and Raped in Madrid Neighborhood of Aluche.\"  \r\n  26 December 2018.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]