["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "An edited video of President Trump appearing disoriented on the White House lawn has been shared widely on social media with users falsely claiming that it shows him experiencing dementia.", "One description of the video, which was re-shared on Instagram, says, \"Trump is lost and disoriented here. His mind goes blank and he doesn’t remember what he’s supposed to do next. He’s deep into his degenerative neurological disease — Frontotemporal dementia — mindlessly lumbering and zigzagging in the grass toward the puddle.\"", "But the 12-second clip, which is from 2019, was deceptively edited to make it look like Trump is wandering aimlessly for no reason. He wasn’t.", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The clip is from a longer video that was captured on Aug. 7, 2019, when Trump spoke to reporters before departing on Marine One for Dayton, Ohio, and El Paso, Texas, to meet with the victims and first responders of two deadly shootings that had occurred at both locations.", "RELATED: Fact-checking misinformation after the El Paso, Dayton shootings", "The unedited version of the video provides more context, starting around the 11:40-mark, and shows the president walking away from reporters to wait for first lady Melania Trump.", "Trump stands by the puddle and points at it for a moment, apparently to warn Melania not to step in the water. The couple then walk together to board the helicopter.", "The clip was labeled as manipulated media on Twitter shortly after it surfaced.", "We rate it False.", "Instagram post, Sept. 7, 2020", "C-SPAN, President Trump White House Departure, Aug. 7, 2019", "Twitter, Video of President Trump is edited out of context, according to journalists, Sept. 7, 2020", "BBC, US 2020 Election: Trump targeted in misleading puddle video, Sept. 8, 2020", "Reuters, Fact check: Clip of Trump ’lost and disoriented’ has been selectively cropped, Sept. 8, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]