["About this rating", "A restaurant in Amsterdam is planning to allow people to dine out in personalized pods during the COVID-19 pandemic. A viral photograph shows a testing session for one of these pods.", "However, as of this writing, the pods are not yet publicly available as a dining option. This is one restaurant's proposed solution to the challenge of social distancing and it has not been approved by city officials.", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "In May 2020, a photograph started to circulate on social media along with the claim that restaurants in the Netherlands had solved the problem of dining out during the COVID-19 coronavirus disease pandemic by installing personal dining booths.", "Displayed above is a genuine photograph from a restaurant in the Netherlands. However, these photographs were often shared on social media with incomplete or untrue information.", "For starters, this photograph does not show a restaurant adhering to any new guidelines implemented by the Netherlands government. This photograph was taken at Mediamatic, an art gallery and restaurant in Amsterdam, as they tested out a proposed dining solution for when the restaurant was allowed to reopen.", "Mediamatic explained on its website that these \"quarantine greenhouses\" would allow for two people to dine together. The restaurant notes that these dining pods would only be recommended for people who were already living together and that this dining plan was not approved yet by the government. While Mediamatic is, as of this writing, taking reservations for when social distancing guidelines are expected to be relaxed, they note that these reservations may end up being canceled if the plan is not approved.", "Dutch News reported on Mediamatic's \"quarantine greenhouse\" dining plan in May 2020:", "In Amsterdam, art gallery and restaurant Mediamatic hopes to win approval to organise fine dining in small greenhouses overlooking the water. The package is already sold out up to the end of June – even though no-one knows if the soirees can go ahead.", "The popularity of the deal is a sign of the frustration many are beginning to feel as the Netherlands moves into May – with the prospect of several more weeks of being told to stay home ahead.", "The viral photograph is available via Mediamatic's website along with the following caption:", "Testing Serres Separees at Mediamatic ETEn - Safe water side dining in Amsterdam. Soon, we'll offer really nice plant-based dinner in our greenhouses on the Amsterdam water side of the Oosterdok. We are testing the setup now whilst waiting for permission to re-open our restaurant and art space. Of course, these chambres separees are recommended only for people that are already living together. Photo was taken at Mediamatic ETEN in Biotoop Dijkspark during our testing on April 28, 2020.", "To sum up: The Netherlands government did not implement new guidelines that would allow restaurants to reopen by installing personal dining pods. This viral photograph shows one restaurant's proposed solution to dining out during the COVID-19 pandemic. While Mediamatic is taking reservations for these quarantine greenhouses, this solution has not been approved by local officials.", "Schaart Eline.   \"The Netherlands Closes Schools, Bars.\"\r\n    Politico.   15 Mach 2020.", "Dutch News.   \"Greenhouses, a Ban on the Over-30s – Bars and Clubs Get Creative.\"\r\n    4 May 2020.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]