["About this rating", "As Austin public schools prepared to implement an overhauled sex-education curriculum for students third to eighth grade, an inflammatory and homophobic article by former Fox News commentator Todd Starnes circulated online, prompting some readers to ask Snopes whether it was accurate.", "\"Texas School District Mandates Teaching Kids How to Have Anal Sex,\" read the headline published by the Christian Broadcasting Network (CBN) on Oct. 29, 2019. Most of the story consists of quotes from angry attendees at the school board meeting the day before, during which the curriculum was approved unanimously. The new curriculum is expected to go into effect in May 2020.", "Although Austin Independent School District (Austin ISD) board did vote to update the sex-ed curriculum for third- to eighth-graders for the first time in 10 years, the Starnes article appeared designed to elicit maximum fear and outrage from readers. While liberally quoting from opponents of the curriculum update, it briefly describes supporters like this: \"Those speaking on behalf of the plan included a nine-year-old child, a fourth-grader, the parent of a transgender second-grader, a lady who identified by the pronoun 'they/them' and some gal wearing a t-shirt that read, 'I met God. They’re queer, y’all.'\"", "\"In spite of overwhelming opposition from parents and pastors, the district’s trustees voted early Tuesday morning to implement a pornographic sex education policy that includes instruction on anal sex and how to place a condom on an erect penis,\" Starnes reported.", "The article was short on facts. No, parents will not be \"mandated\" to send their children to \"pornographic\" instructional sessions. For starters, none of the sex-ed lessons at Austin schools are \"mandated,\" and parents can opt their children out of \"one, several, or all lessons,\" according to Michele Rusnak, health and physical education supervisor for Austin ISD.", "\"Opt out letters are provided to parents at the Parent Orientation meeting that happens in March or April, which is provided by the principal,\" Rusnak said in an email to Snopes. \"The campus also sends out the letter at least 3 weeks prior to instruction, which happens in May. Students opting out are provided SEL [social and emotional learning] type lessons in a different location.\"", "Rusnak added that the new curriculum does not teach students \"how to have anal sex,\" but instead \"refers to how anal sex is a way to transmit [sexually transmitted infections].\" Overviews of both the elementary-level and middle school-level curricula can be found on Austin ISD's website.", "The curricula are categorized into the categories of \"healthy relationships\"; \"personal safety\"; \"identity\"; \"anatomy and physiology\"; and \"puberty and adolescent development.\" When children reach the fifth grade, two additional categories are added: \"pregnancy and reproduction,\" and \"sexually transmitted diseases and HIV.\"", "The curricula state that the older students will learn, among many other topics, differing expressions of gender and how to communicate respectfully about that, along with \"medically accurate\" information and terminology about topics like puberty, reproduction, intercourse, and sexually transmitted diseases and prevention. The courses also teach children how to maintain personal boundaries and how the media can impact body image.", "Because the Starnes article falsely states that the sex-ed classes offered at Austin ISD are \"mandatory\" when parents can in fact opt their children out, and because it grossly misrepresents the course material, we are labeling this claim \"False.\"", "Swaby, Aliyya. \"Austin ISD Sex Ed Battle Could Be Preview of State-Level Debate.\"\r\n  The Texas Tribune. 29 October 2019.", "Ellefson, Lindsey. \"Fox News Host Todd Starnes Out after Suggesting Democrats Worship Pagan God Moloch (Exclusive).\"\r\n  The Wrap. 2 October 2019.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]