["The screenshot was shared on Facebook here on March 18, 2020. The post has been shared more than 1,200 times.", "Below is a screenshot of the misleading post:", "The Thai-language caption translates to English as: “The United Nations has raised… ☣#COVID19 Thailand to level 4 #Thailandhasntannounced #UNannounceditthemselves”.", "The post’s hashtags suggest that the United Nations (UN), which established the WHO as a UN specialised agency, that increased Thailand’s pandemic level during the coronavirus crisis.", "As of March 30, Thailand had 1,524 confirmed cases of COVID-19 and nine deaths, the Thai Ministry of Public Health reported here.", "Comments by some Facebook users on the misleading post indicated they believed Thailand's pandemic level had increased to a level higher than had been stated by the Thai government.", "Their comments translate to English as “Yesterday who said we were in phase 2”; “Are you ashamed?”; and “Leader will lead us to pray”.", "Below are screenshots of some of the users’ comments:", "The screenshot and claim were also shared on Facebook here, here, and here; and on Twitter here, here, here and here.", "The claim is false.", "The screenshot was taken from this WHO “Preparedness and Response Status for Countries, Territories, and Areas” report published on March 6, 2020.", "The WHO said the agency’s \"preparedness and response\" categories differ from a country's domestic pandemic classifications.", "“The WHO doesn’t announce the pandemic stage. That is categorised by Thailand’s Department of Disease Control, Ministry of health,” WHO spokeswoman Kanpirom Wiboonpanich told AFP by phone on March 24, 2020.", "Below is a comparison of the screenshot in the misleading posts (L) and the document from the WHO’s website (R) with similarities circled by AFP:", "The Thai Ministry of Public Health also said the government’s highest stage of pandemic phases is a phase 3. So far, however, only certain parts of Thailand have been classified as phase 2 due to COVID-19.", "“We are in pandemic phase 2 in some areas of Thailand,” Dr. Tanarak Plipat, the ministry’s Deputy Director-General of the Disease Control Department, told AFP by phone on March 26, 2020. “It’s not fair if we call the whole country phase 2, because there are some provinces that have not been detected positive for COVID-19 like Mae Hong Son,”", "Plipat added that the government’s “aim for classifying areas of Thailand into different pandemic stages is for us to know what actions we need to take in order to handle the situation.”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]