["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Confused about all charges of poor ethics that the major gubernatorial candidates are lobbing at each other?", "Republican Ken Cuccinelli wants to help you out.", "\"The truth? There’s only one candidate under investigation: Terry McAuliffe,\" the announcer says at the start of a Cuccinelli TV commercial that’s been airing since Aug. 22.", "We wondered whether that is indeed the truth.", "The ad comes on the heels of a Quinnipiac University poll that showed McAuliffe, a Democrat, had staked out a 48-42 percent lead over Cuccinelli. The survey showed Cuccinelli is being hurt by voter doubts about his trustworthiness, the likely result of a scandal that has touched him as well as Gov. Bob McDonnell.", "Cuccinelli accepted $18,000 in gifts from Jonnie Williams, the chief executive of Star Scientific Inc., a nutritional supplement company. Williams was the source for more than $145,000 in gifts and loans for McDonnell and his family, most of which went unreported. Cuccinelli, in April, amended four years of personal disclosure reports he had filed with the state to include $12,000 in gifts he said he forgot to report -- including about $5,000 from Williams.", "Examining Cuccinelli’s ad claim requires a determination whether either major party candidate is under formal investigation. So let’s start.", "Is McAuliffe under investigation?", "Cuccinelli says his claim is based on a recent media reports about GreenTech Automotive, an   electric car company that McAuliffe founded in 2009. McAuliffe quietly resigned as GreenTech’s chairman last December -- an action that wasn’t made public until April -- but continues to be a major stockholder in the struggling company.", "On Aug. 2, The Washington Post and The New York Times reported that GreenTech is being investigated by the Securities and Exchange Commission. The full scope of the probe has not been made public, but the newspapers said it focuses, at least in part, on GreenTech’s recruitment of foreign investors.", "GreenTech and a partner company, Gulf Coast Funds Management, sought to raise money for the electric car venture through a federal program, called EB-5, that gives permanent resident visas to foreigners who invest at least $500,000 in a U.S. startup company that creates jobs. The newspapers said the SEC was examining whether GreenTech and Gulf Coast illegally promised foreign investors risk-free returns.", "GreenTech and Gulf Coast officials have said they have received subpoenas and are cooperating with the investigation.", "But McAuliffe says the SEC has not contacted him and his only knowledge of the probe comes from newspaper articles. The Post reported on Aug. 22, \"there is no indication McAuliffe is personally under investigation.\"", "Cuccinelli’s campaign, in defending the ad claim, says the investigation targets a time when McAuliffe was GreenTech’s chairman. Anna Nix, a campaign spokeswoman, referred us to an article on the investigation by Breitbart.com. It quotes Douglas Park, a California business attorney, as saying that corporate board members can be held responsible for the actions of their companies and that \"a good plaintiffs’ securities lawyer is going to go after\" McAuliffe.", "Legal experts we spoke to said the facts are not clear cut.", "\"There have been plenty of government investigations of corporations that did not involve misconduct by a high level corporate official, and plenty that have focused on misconduct by CEOs or Boards of Directors,\" said John G. Douglass, University of RIchmond law professor, in an email. The only way to know, he said, is when prosecutors announce who is involved.", "We should note that there’s a second investigation swirling around GreenTech, although Cuccinelli’s campaign did not cite it in defense of its ad. The inspector general at the Department of Homeland Security is investigating whether U.S. Citizenship and Immigration Services Director Alejandro Mayorkas gave preferential treatment to GreenTech and some other firms seeking to establish EB-5 programs.", "Mayorkas, who has been nominated for deputy secretary of the Department of Homeland Security and is going through Senate confirmation hearings, has denied giving GreenTech special treatment.", "Records show McAuliffe and several of his business partners lobbied Mayorkas to speed consideration of EB-5 applications. But McAuliffe and officials from GreenTech and Gulf Coast Funds said they did not receive any favors and have not been contacted in the Mayorkas probe.", "So again, there is no evidence that McAuliffe is being personally investigated.", "Is Cuccinelli under investigation?", "Cuccinelli’s name has been tied to two probes this year. He initiated the first one on himself in April after amending his disclosure forms to include $12,000 in unreported gifts he received since lated 2009, when he was elected attorney general.  Amid criticism from Democrats, Cuccinelli appointed Richmond Commonwealth’s Attorney Michael Herring to investigate whether he had violated state disclosure laws.", "Herring ended the investigation on July 18 with a nine-page report saying he found \"no evidence\" that Cuccinelli violated any laws or intentionally failed to disclose gifts.\" Two days later, PolitiFact Virginia gave a Pants on Fire to McAuliffe’s claim that the probe concluded Cuccinelli \"should have been prosecuted\" but Virginia’s ethics laws are too weak.", "The second investigation, being conducted by Virginia’s inspector general, focuses on whether a lawyer in Cuccinelli’s attorney general’s office offered legal advice to two energy companies involved in a dispute over paying royalties for natural gas they extracted from private lands.  One of the companies, Consol Energy Inc., has contributed $111,000 to Cuccinelli’s campaign.", "The probe centers on emails Assistant Attorney General Sharon Pigeon sent to the lawyers for the energy companies. U.S. Magistrate Pamela Mead Sargent wrote in June that the emails \"shockingly\" show that Pigeon \"has been actively involved in assisting\" the companies.", "Cuccinelli has said that although Pigeon’s emails were \"overzealous,\" they ethically carried out his office’s responsibility of defending the constitutionality of a state law that’s at the center of the royalties dispute.", "For this Truth-O-Meter, here’s the important thing to remember: Inspector General Michael Morehart has said his investigation focuses on attorneys in Cuccinelli’s office -- not Cuccinelli himself. As noted by The Post, the inspector general is not empowered to initiate investigations of elected officials.", "We should finally note that there are no reports that a third gubernatorial candidate -- Robert Sarvis, a libertarian  -- is under investigation.", "Our ruling", "Cuccinelli said McAuliffe is the only gubernatorial candidate under formal investigation. He cites an SEC probe into the tactics GreenTech Automotive used to attracted foreign investors. McAuliffe was chairman of the electric car company until last December and remains one of its key stockholders. But there has been no indication that McAuliffe is a target of the SEC investigation.", "The burden of proof falls on Cuccinelli to prove his charge against McAuliffe, and he comes up empty. The good news for Cuccinelli is that we can also say that he is not the focus of any current investigations. The bad news is that we rate his ad claim False.", "YouTube, \"Facts\" (ad), Aug. 22, 2013.", "Email from Anna Nix, spokeswoman for Ken Cuccinelli, Aug. 27, 2013.", "Email from Josh Schwerin, spokesman for Terry McAuliffe, Aug. 26, 2013.", "The Washington Post, \"Car company with ties to McAuliffe is under SEC investigation,\" Aug. 2, 2013.", "The New York Times, \"Clouds spread to Democratic side of Virginia’s governor’s race,\" Aug. 2, 2013.", "Richmond Times-Dispatch, \"Report: SEC investigating car company McAuliffe founded,\" Aug. 3, 2013.", "Washington Post, \"New Cuccinelli ad touts that he ‘personally launched’ probe of Gov. McDonnell,\" Aug. 22, 2013.", "Washington Post, \"Cuccinelli, McAuliffe launch dueling ads,\" Aug. 22, 2013.", "Washington Post, \"McAuliffe’s business partners receive scrutiny through federal inquiry into GreenTech,\" Aug. 24, 2013.", "The Virginian-Pilot, \"Va. inspector general probes AG office actions,\" Aug. 13, 2013.", "Washington Post, \"Va. IG probing help given in mineral rights case,\" Aug. 13, 2013.", "The Roanoke Times, \"Cuccinelli was briefed on gas cases,\" June 15, 2013.", "The Virginian-Pilot, \"Involvement in oil and gas case was fight for state law and citizens,\" June 14, 2013.", "Richmond Times-Dispatch, \"Report says AG broke no law,\" July 19, 2013.", "Richmond Times-Dispatch, \"McDonnell being investigated over disclosure statements,\" May 22, 2013.", "YouTube, \"NBC 12 Decision Virginia McAuliffe on Greentech,\" Aug. 5, 2013.", "Sen. Charles Grassley, \"Grassley Raises Concerns about National Security, Immigration Program, Nominee,\" July 24, 2013.", "Scribd, \"Offering Memorandum for Gulf Coast Automotive Investment Fund A-I,\" loaded by Watchdog.org blogger, accessed Aug. 27, 2013.", "Quinnipiac University Polling Institute, Virginia poll, Aug. 21, 2013.", "Virginia Public Access Project, Cuccinelli campaign financial reports, accessed Aug. 30, 2013.", "The Washington Post, \"Homeland secretary deputy nominee says he didn’t give Terry McAuliffe special treatment,\" July 25, 2013.", "Michael Herring, \"Report from the Richmond Commonwealth’s Attorney Michael N. Herring,\" July 18, 2013.", "PolitiFact Virginia, \"McAuliffe says ethics investigation concluded `Cuccinelli should have been prosecuted,’\" July 20, 2013.", "Richmond Times-Dispatch, \"AG staffer’s actions in gas royalties case investigated,\" Aug. 14, 2013.", "Virginia Public Access Project, \"Consol Energy, Inc.\", accessed Aug. 30, 2013.", "TriCities.com, \"US judge shocked by Va. role in lawsuit,\" June 6, 2013.", "TricCities.com, \"Cuccinelli’s office labels emails `overzealous’ but ethical,\" June 12, 2013.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]