["Residents gather in the streets where a public bus was burned during clashes between Bolivarian National Guards and anti-government protesters in Urena, Venezuela, near the border with Colombia, Sunday, Feb. 24, 2019. (AP)", "U.S. Rep. Matt Gaetz, R-Fla., sparred with Fox News’ Jeanine Pirro about how to prevent guns from getting into the wrong hands.", "\"I’m here in Australia, congressman. They don’t have problems like this,\" Pirro said Aug. 10 following the mass shootings in El Paso and Dayton that killed 31 people. \"This is starting to be unfortunately a uniquely American situation. And I am a gun owner. I am a strong Second Amendment person, but some of the wrong people are getting their hands on guns.\"", "Gaetz replied: \"Nobody would suggest that in the United States we would want Australia’s solution. There they went and confiscated all the guns. You know who did what Australia did? Venezuela. And now their people can't fight back when they are having to fight their way out of a socialist dictator.\"", "But no one suggested taking away guns, Pirro responded, adding the Gaetz’s Venezuela comparison seemed \"a little off.\"", "So PolitiFact Florida wanted to look into it. The general point Gaetz was trying to make, his spokesman told us, was that he believes gun control failed in both Australia and Venezuela. He shared articles showing an Australian black market for guns, for example, as well as other news stories about Venezuela’s gun control laws leaving civilians and even police more vulnerable.", "But there are several factual inaccuracies with his specific claim about Australia and the comparison to Venezuela.", "• Australia didn’t enact a total gun ban; it banned certain guns, including semi-automatics after a mass shooting in 1996.", "• That’s different from what Venezuela’s government did in 2012 and 2013, when it took steps in an effort to stem the flow of guns.", "• In both countries, millions of guns remain in civilian hands. Gun deaths are a major problem in Venezuela.", "In 1996, a shooting in Tasmania left 35 dead. It was one of the most deadly civilian mass shootings in the world at the time. The conservative-led national government moved quickly to ban and destroy certain guns.", "Australia banned semi-automatic and self-loading rifles as well as shotguns. The government offered a one-year grace period during which it would buy back the firearms. After that, people possessing the weapons would be subject to strict penalties. The buyback program took in more than 640,000 prohibited weapons — roughly one-fifth of the country’s estimated guns.", "Today, Australians still legally own a high per-capita ratio of single-shot long guns, along with plenty of handguns, said Philip Alpers, founding director of Gunpolicy.org, a global project of the Sydney School of Public Health. But the number of legal and illegal guns dropped from about 3.2 million in 1996 to 2.5 million in 1997.", "Since then, it has climbed back up to almost the same number as before the ban, though the rate of gun ownership is smaller today.", "In the 1980s and early 1990s, Australia suffered 14 mass shootings, which claimed 117 lives, Alpers said. Following the gun law changes, there were no mass shootings for many years. In June 2019, four people were killed by a gunman who used a banned gun. In 2018, seven were killed in a mass family homicide-suicide.", "What Venezuela did several years ago was not the same as Australia.", "The gun situation was not the same, for starters. In Australia, the government responded to a mass shooting. Venezuela faced a widespread problem with rampant gun violence and homicides — and it still does.", "In 2012, Venezuela imposed measures to ban possession of a gun in public places and to halt private gun sales to citizens.", "In 2013, President Nicolas Maduro signed a disarmament bill that was intended to stem the flow of guns.", "The law created an automated system of registration for arms, parts, and ammunition under control of the armed forces. Individuals were allowed conditional possession, meaning that the state could take their gun.", "Rebecca Hanson, an expert on crime in Venezuela and now a professor at the University of Florida, said she wouldn’t call the 2013 law a \"gun ban,\" because civilians could still own guns as long as they registered them. Also, guns remained widely available on the black market and enforcement was lax.", "\"The law, in reality, did not affect people's ability to access guns in any effective or long-term way,\" she said.", "Since the majority of guns are purchased on the black market, regulating the legal market does little to reduce gun sales in Venezuela, she said. Many of these guns end up flowing from state security forces and the military into the black market.", "\"All of this is to say that even with the 2013 law, access to guns has increased,\" she said.", "Alejandro Velasco, New York University history professor of modern Latin America, told us that \"the gun ban had almost no practical impact on people’s ability to buy and keep (or use) weapons.\"", "There are no solid numbers to pinpoint the number of guns in civilian ownership in Venezuela. Gunpolicy.org estimates that there were about 5.9 million privately owned guns in civilian hands in Venezuela  as of 2017, though the consultant that came up with it said it could be a wide range.", "The opposition movement has billed itself as nonviolent for the most part, Velasco said. Several experts told us it’s not surprising that civilians don’t bring guns to protests where they face the armed government.", "\"Even if the disarmament law had dramatically reduced gun ownership, which is not at all clear, armed anti-government civilians would stand no chance against the tanks and fighter jets of the army,\" said Dorothy Kronick, a University of Pennsylvania political scientist.", "Experts were critical of Gaetz using the problems in Venezuela to make any commentary on gun laws in the United States.", "\"Linking the issue of arms control with the struggle for democracy in the Venezuelan context only contributes to distort a situation that is already very distorted,\" Keymer Avila, a professor of criminology at the Central University of Venezuela said, \"increasing violence in an environment that is already very violent, and undermines an institution that is already very precarious.\"", "Gaetz said in Australia \"they went and confiscated all the guns. You know who did what Australia did? Venezuela.\"", "Gaetz’s claim about Australia is wrong, and his comparison to Venezuela is flawed.", "After a mass shooting in 1996, Australia banned semi-automatic and self-loading rifles as well as shotguns and offered a one-year buyback. It did not ban all guns. The number of civilian-owned guns is now nearly the same as before the 1996 law, although the rate of ownership is less.", "In Venezuela, the government instituted measures to try to limit the flow of guns to civilians. But experts said most guns are sold on the black market and that guns remain rampant in Venezuela. The idea that private gun owners could successfully challenge a national military is also unlikely.", "We rate this statement Mostly False.", "Judge Jeanine Pirro on Fox News, Interview with Rep. Matt Gaetz, Aug. 11, 2019", "PBS, There’s a new global ranking of gun deaths. Here’s where the U.S. stands, Aug. 28, 2018", "Gunpolicy.org, Australia — Gun Facts, Figures and the Law", "Gunpolicy.org, Venezuela — Gun Facts, Figures and the Law", "Gunpolicy.org, Successful Public Policy: Lessons from Australia and New Zealand, May 2019", "Washington Office on Latin America’s Venezuela Blog, Gun Control Reform in Venezuela: Reactions and Criticisms, Aug. 8, 2013", "Washington Office on Latin America’s Venezuela Blog, Citizen Security Reform, part 5: Gun Control, Aug. 5, 2013", "Council on Foreign Relations, U.S. Gun Policy: Global Comparisons, Aug. 6, 2019", "Healthdata.org, Six countries in the Americas account for half of all firearm deaths, Aug. 28, 2018", "Truthorfiction, Are Venezuelans Being ‘Shot in the Streets’ After a 2012 Gun Ban? May 3, 2019", "Examiner, Venezuela police confiscate and destroy 2,000 guns, Aug.17,  2016", "New York Times, Armed Civilian Bands in Venezuela Prop Up Unpopular President April 22, 2017", "The New Daily, Spike in handgun crimes reveals nation’s secret problem, Nov. 10, 2015", "The Advertiser, Huge black market for illegal weapons, Dec. 20, 2011", "The National Review, Australia’s 1996 Gun Confiscation Didn’t Work – And it Wouldn’t Work in America, Oct. 2, 2015", "University of Melbourne, Melbourne Institute Working Paper Series Working Paper, 2008", "Fox News, Venezuelans regret gun ban, 'a declaration of war against an unarmed population' Dec. 14, 2018", "The Hill op-ed by David Kopel, In the wake of a gun ban, Venezuela sees rising homicide rate, April 19, 2018", "The Guardian, Murdered for their guns, Venezuela's police are now victims of crime, Nov. 4, 2015", "Reuters, Venezuela crushes 2,000 guns in public, plans registry of bullets, Aug. 17, 2016", "San Jose Mercury News, Venezuela experiment: Will a gun ban stop the murders? July 15, 2013", "AP, Venezuela bans sales of guns and ammunition; critics say most weapons already sold illegally; Venezuela prohibits sales of guns, ammunition, June 1, 2012", "CNN, Australia reels from worst rampage killing in decades for a country thought to have solved this issue, June 5, 2019", "BBC, Darwin shooting: Banned shotgun used in four killings, police say, June 5, 2019", "New York Times, Australian Police Identify Victims in Worst Mass Shooting Since 1996, May 11, 2018", "PolitiFact, Stephen King says since Australia cracked down on guns, homicides by gun dropped 60 percent, Jan. 31, 2013", "PolitiFact, NRA weakly claims that Clinton said gun confiscation is 'worth considering,' Oct. 17, 2016", "Interview, Alejandro Velasco, New York University history professor of modern Latin America, Aug. 14, 2019", "Interview, Dimitris Pantoulas, political analyst and consultant in Venezuela, Aug. 13, 2019", "Interview, Rebecca Hanson, University of Florida assistant professor for Latin American studies, Aug. 15, 2019", "Interview, Dorothy Kronick, University of Pennsylvania assistant professor of political science, Aug. 15, 2019", "Interview, Keymer Avila, researcher at the Institute of Criminal Sciences and Professor of Criminology in Pre and Postgraduate Studies at the Central University of Venezuela and a collaborator of the Observatory of the Criminal System and Human Rights of the University of Barcelona, Aug. 15, 2019", "Interview, Aaron Karp, a lecturer at Old Dominion University is a consultant to the Small Arms Survey, Aug. 14, 2019", "Interview, Philip Alpers, founding director of Gunpolicy.org and a professor at the Sydney School of Public Health, Aug. 13, 2019", "Statement from U.S. Rep. Matt Gaetz office, Aug. 14, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]