["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "As Florida kids enjoyed the last lazy days of summer, political players were squabbling about a series of hot education controversies.", "In a split vote, the Board of Education decided to soften school grades. The Southern Poverty Law Center filed a complaint challenging the state’s race-based education goals. Sen. Marco Rubio came out against federal Common Core standards -- putting him at odds with the state’s other potential Republican presidential contender, Jeb Bush. And Bush bashed conservative pundits’ claims about Common Core.", "Meanwhile, Education Commissioner Tony Bennett resigned following allegations that he took steps to prevent a charter school led by a prominent Republican donor from getting a \"C\" in Indiana, where he formerly held a similar job. Bennett’s resignation led to renewed arguing about Florida’s school grading system.", "But hey, nothing like back-to-school week for a fresh message about optimism. In an Aug. 19 letter in the Miami Herald, interim commissioner Pam Stewart wrote that though challenges remain, Florida’s teachers and parents have many reasons to be proud.", "\"National rankings show that Florida is moving in the right direction. High school graduation rates continue to increase at the fastest rate in the nation, with Florida leading the nation in the rate of Hispanic graduates,\" she stated.", "We assigned ourselves some homework about the state of our state’s graduation rates.", "Diplomas Count data", "For the national comparison, the Florida Department of Education pointed in part to Education Week’s Diplomas Count analysis of graduation rates based on standard diplomas. The most recent analysis covered 2000-10.", "It is true that Florida made major gains in the graduation rate. But that’s because Florida started at such an abysmally low rate: 49.9 percent in 2000, among the lowest in the country at the time. (And as of 2010, Florida remained slightly below the national average.)", "Florida’s graduation rate rose to 72.9 percent in 2010 -- a 23-percentage-point increase second only to Tennessee.", "Much of the increase in graduation rates was due to higher rates of graduation for Latinos and blacks.", "As for Hispanics, Florida had a 77.1 percent graduation rate -- the highest in the country but barely in front of Virginia at 77 percent and Maryland at 76.7 percent.", "Diplomas Count uses a formula that captures grade-to-grade promotions each year between ninth and 12th grades and graduation.", "Other ways to count graduation rates", "Diplomas Count, which uses federal data, is only one way to measure graduation rates and has been criticized by some education experts. Florida’s overall or Hispanic-only graduation rate can vary depending on the methodology and the years examined.", "The federal government pointed us to two other ways to measure graduation rates: a new cohort method, which examines how many students who enter ninth grade graduate four years later with a standard diploma, and the average freshman graduation rate, which is an estimate of the percentage of an entering freshman class graduating in four years.", "The cohort method showed for 2010-11 that Florida’s overall graduation rate was 71 percent -- lower than all but five states (Alaska, Georgia, Nevada, New Mexico and Oregon) and the District of Columbia. (Louisana’s rate equaled that of Florida’s.)", "Since the cohort method is new, for a historical perspective we turned to the average freshman graduation rate. That data shows Florida’s graduation rate increased by a handful of points between 2003 and 2010, but so did some other states. (Florida also has its own state reports, which show gains in recent years.)", "Robert Balfanz, an education expert at Johns Hopkins University, examined the data between 2006 and 2010 -- the years when rates began to move nationally -- and found Florida was the ninth fastest improving state.", "In the case of Hispanics, under both the cohort and average freshman graduation rate methods, several states had a higher rate than Florida.", "Balfanz pointed to Hispanic rates in a few large states to show that Florida has a high graduation rate but doesn’t hold a unique record. The average freshman graduation rate for 2010 showed a Hispanic graduation rate of 71.1 in Florida -- slightly less than California and less than Texas at 77.4 percent. The cohort data showed Florida just a smidge under California, but again less than Texas.", "\"Most researchers believe that the adjusted cohort method offers the promise of more accurate and more uniform rates,\" said Sterling Lloyd, of the entity that produces Diplomas Count.", "(A Harvard economist wrote extensively about the shortcomings of various methods of calculating graduation rates.)", "We wondered: Why would Florida Hispanics fare better than Hispanics elsewhere?", "\" ‘Hispanics’ is a meaningless category for educational purposes,\" said Richard Rothstein, an education research associate at the Economic Policy Institute. \"Florida’s ‘Hispanics’ are not comparable to ‘Hispanics’ in other states because Florida’s include a larger proportion of middle-class Cubans, and a smaller proportion of lower-class Mexicans. Without knowing anything else, you would expect middle-class Cubans to perform at a higher level than lower-class Mexicans, because of the literacy levels at home, if for no other reason.\"", "Economics Nobel prize winner James J. Heckman and Paul A. LaFontaine, authors of The American High School Graduation Rate: Trends and Levels, have argued that Diplomas Count is \"exceedingly inaccurate\" because of the \"assumption that the number of students enrolled in 9th grade is the same as the number of students entering high school. This assumption artificially lowers the estimates of current graduation rates, especially for minorities who are more likely to be retained (repeat ninth grade).\" They also argue that grade retention differs sharply across states and localities.", "Our ruling", "Florida’s interim education commissioner Pam Stewart said \"high school graduation rates continue to increase at the fastest rate in the nation, with Florida leading the nation in the rate of Hispanic graduates.\"", "That’s true -- under the Diplomas Count measurement for 2000-10. But Stewart omitted a couple of key points: Florida’s graduation rate was incredibly low and among the worst in the country in 2000 and even with the climb upward it remains below the national average.", "Also, Stewart is relying on the method of calculating graduation rates that puts Florida in the best light. Other methods do not show Florida as earning the top-increase spot and do not put Florida’s Hispanics at No. 1. We rate this claim Half True.", "Miami Herald letter to the editor by Florida Education Commissioner Pam Stewart, \"Giving students the opportunity to succeed,\" Aug. 19, 2013", "Miami Herald, \"Exam has changed how teachers teach,\" Dec. 17, 2006", "Tampa Bay Times, \"New graduation rates leave Florida stumped,\" February 1999", "Tampa Bay Times, \"Florida board of education votes 4-3 to pad school grades,\" July 16, 2013", "Tampa Bay Times The Buzz blog, \"Rubio comes out against Common Core putting him at odds with Jeb Bush,\" July 16, 2013", "Tampa Bay Times Gradebook blog, \"New Florida report on high school graduation rates shows Florida near cellar,\" Nov. 26, 2012", "Tampa Bay Times Gradebook blog, \"Florida graduation rate jumps to 74.5 percent, dropout rate steady,\" Nov. 30, 2012", "PolitiFact Texas, \"Rick Perry says Texas has third-highest high school graduation rates, a \"significant turnaround,\" Feb. 11, 2013", "Orlando Sentinel, \"SPLC files complaint with DOJ over Florida’s race-based education goals,\"  Aug. 2, 2013", "National Review, \"Toward a better education system,\" Aug. 19, 2013", "Education Week and the Editorial Projects in Education (EPE) Research Center press release, \"High school graduation rates approaching milestone, reaches highest point in 40 years,\" June 6, 2013", "Editorial Projects in Education (EPE) Research Center (Education Week), \"Florida Second Chances Turning dropouts into graduates,\" 2013", "Florida Department of Education, Florida’s federal high school graduation rates, 2011-12", "U.S. Department of Education, \"Regulatory co-hort graduation rate,\" 2010-11", "National Center for Education Statistics, Average freshman graduation rate, 2002/03-2009/10", "America’s Promise, \"Building a Grad Nation,\" February 2013", "Journal of Economic Literature article by Harvard professor Richard Murnane, \"U.S. High School graduation rates patterns and explanations,\" May 2013", "James J. Heckman and Paul A. LaFontaine, authors of The American High School Graduation Rate: Trends and Levels, 2007", "Interview, Sterling C. Lloyd, Senior Research Associate at Editorial Projects in Education (EPE) Research Center (Education Week), Aug. 19, 2013", "Interview, Richard Rothstein, education research associate at Economic Policy Institute, Aug. 20, 2013", "Interview, Lawrence Mishel, President, Economic Policy Institute, Aug. 20, 2013", "Interview, Cheryl Etters, Florida Department of Education spokeswoman, Aug. 20, 2013", "Interview, David Thomas, U.S. Department of Education spokesman, Aug. 20, 2013", "Interview, Robert Balfanz, an education expert at Johns Hopkins University and one of the authors of Building a Grad Nation, Aug. 20, 2013", "Interview, Richard Murnane, economist and Acting Dean and the Thompson Professor of Education and Society at the Harvard Graduate School of Education and a research associate at the National Bureau of Economic Research, Aug. 20, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]