["The 26-second video was published here on Facebook on November 17, 2020.", "The post’s Hindi-language caption translates to English as: “Ashok Gehlot-led Congress government has banned fire-crackers on Diwali. Then what, the Rajputs celebrated Diwali in their own ways. Hail Hinduism, hail Rajputana.”", "Ashok Gehlot is the chief minister of the western state of Rajasthan, where the Indian National Congress is the majority party.", "On November 2, 2020, the state government imposed a blanket ban on the sale and use of firecrackers during the Hindu festival of Diwali, which was celebrated on November 14 in 2020.", "“Rajput” is the name of a caste among Hindus in India.", "The video was also shared alongside an identical claim on Facebook here and here.", "The claim is false.", "A reverse image search on Google of keyframes extracted from the video in the misleading posts found an identical video published here on YouTube dated March 12, 2020.", "The video caption states that the clip shows people celebrating Jamra Beej, an ancient Hindu festival, in the Menar village of Rajasthan.", "Below is a screenshot comparison of the video in the misleading posts (L) and the YouTube video (R):", "Celebrations in Menar in March 2020 were also reported by other Indian media, including broadcasters News 18 and Zee News here and here, and the Bhaskar newspaper here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]