["The ad cuts to a shadowy close-up of a man and woman shaking hands, as if they'd just made a deal, superimposed over a stack of $100 bills.", "The narrator explains: \"She stands with the Washington gun lobby. They fund her campaigns.\"", "The 30-second spot attacks Republican U.S. Sen. Kelly Ayotte's record on gun control measures as she faces a tough re-election bid against New Hampshire Gov. Maggie Hassan, a Democrat.", "Sponsored by the political action committee for Americans for Responsible Solutions, the ad’s ominous tone and imagery leave the viewer with the impression that Ayotte doesn’t care what her constituents want because she’s in the pocket of well-heeled firearms lobbyists.", "It’s a line of attack used in the wake of the Orlando shootings and the Senate’s votes on gun control legislation. It has also employed by New Hampshire Democrats. \"Ayotte puts her gun lobby backers before the safety and security of New Hampshire,\" Ray Buckley, chairman of the state Democratic Party, said in a June 21 statement.", "PolitiFact New Hampshire wondered how much the \"gun lobby\" is really spending on Ayotte’s campaign. We’ve recently looked into Ayotte’s voting history on expanded background checks. Now, we’ll focus on the financial supporters of her campaign.", "Following the money", "A review of campaign finance records shows that Ayotte has accepted at least $7,450 in donations from the most prominent lobbying group, the National Rifle Association, over her career.", "Over the course of Ayotte’s career, according to the database, gun rights groups have given her campaign or leadership PAC a total of $68,595. This total includes donations from the NRA as well as other groups such as the National Shooting Sports Foundation. It also includes donations from individuals who have a pattern of making political contributions supporting gun rights, which most people wouldn’t associate with the \"Washington gun lobby.\"", "Americans for Responsible Solutions communications director Mark Prentice said the data in the OpenSecrets database makes it \"absolutely clear\" that gun rights groups fund her campaign.", "Beyond direct campaign contributions to Ayotte, those groups have spent another $12,500 in independent expenditures to support her, bringing the sum to more than $80,000.", "But it’s important to keep those numbers in context.", "The average U.S. Senate campaign costs more than $10 million, according to a study by MapLight.org, a nonpartisan group that studies money in politics.", "As she prepared for a contentious reelection battle, Ayotte reported having $6.9 million cash on hand in the last fundraising report March 31.", "In other words, the money she’s received -- directly or indirectly -- from gun lobbyists during her political career represents about 1 percent of the cash she has on hand right now. When compared against the $12.4 million she’s raised since she first became a candidate in the 2010 cycle, it’s 0.65 percent of her lifetime fundraising.", "And Ayotte’s $7,450 from the NRA pale in comparison to what the group gave to its top recipient in Congress, Republican Sen. John McCain of Arizona. McCain has received $37,150 in direct support and more than $7 million in independent expenditures for him and against his opponents, according to OpenSecrets records dating back to 1989.", "\"The ad is misleading because the contributions cited equal only about half a percent of the total amount raised by our campaign over her career,\" Ayotte’s campaign spokeswoman Liz Johnson said in an email statement.", "Meanwhile, the group that’s running the ad, Americans for Responsible Solutions, was founded by former Rep. Gabby Giffords, an Arizona Democrat and mass-shooting survivor. It has spent $834,278 in independent expenditures against Ayotte’s candidacy, according to OpenSecrets.", "That’s about 10 times the amount of money spent on Ayotte’s campaign by pro-gun groups.", "Ayotte’s gun-policy views", "The ad also claims Ayotte \"stands with the Washington gun lobby\" in return for the donations she’s received, but that hasn’t universally been the case.", "Ayotte received an \"A\" rating from the NRA in 2012, meaning she was viewed as a \"solidly pro-gun\" candidate.", "The NRA and associated groups have taken out ads supporting Ayotte in the past. \"Thank you for protecting the rights of gun owners, hunters and all who cherish the freedoms of our Second Amendment,\" one ad from from the National Shooting Sports Foundation said. Another ad came from an organization called the The New Hampshire Men and Women of the National Rifle Association.", "However, her voting record has not always adhered to the NRA’s stances.", "On June 20, for instance, Ayotte backed two bills blocking gun sales to suspected terrorists -- a switch from when she voted to kill a similar Democratic plan in December.", "A day later, she co-sponsored a bipartisan gun control bill with U.S. Sen. Susan Collins of Maine to strengthen existing background check laws, which the NRA opposed. Collins, one of the Senate’s most moderate Republicans, has a C+ rating from the NRA.", "Our ruling", "The gun control group Americans for Responsible Solutions said Ayotte \"stands with the Washington gun lobby. They fund her campaigns.\"", "Ayotte has indeed benefited from money from gun rights groups – $81,095 over her career, to be exact. But it’s worth adding some context -- that’s about one-half of one percent of the total money she’s raised, and a modest amount compared to other Senate Republicans.", "Meanwhile, it’s not entirely correct to say that Ayotte always \"stands with the Washington gun lobby.\" She has voted for legislation favored by the NRA, but has also bucked the NRA on at least one occasion.", "The statement is partially accurate but takes things out of context, so we rate it Half True.", "YouTube, \"Safety,\" Americans for Responsible Solutions PAC, published May 24, 2016, accessed June 23, 2016", "PolitiFact, Maggie Hassan says Kelly Ayotte voted against expanding gun background checks, twice, published June 21, 2016, accessed June 23, 2016", "Interview, Mark Prentice, communications director for Americans for Responsible Solutions, phone and email, June 23, 2016", "OpenSecrets.org, Issue Profiles / Gun Rights vs. Gun Control, accessed June 23, 2016", "MapLight.org, What’s the cost of a seat in Congress?, published March 10, 2013, accessed June 23, 2016", "OpenSecrets.org, Sen. Kelly Ayotte: Summary Data, accessed June 23, 2016", "WMUR, Poll shows support for background checks, less for ban, published Feb. 8, 2013, accessed June 23, 2016", "Public Policy Polling, Hassan/Ayotte Knotted; Sanders Strongest in General, published Dec. 7, 2015, accessed June 23, 2016", "Email interview, Liz Johnson, spokeswoman for Ayotte’s campaign, June 23, 2016", "The Hill, Senate Republicans may defy NRA on guns, published June 21, 2016, accessed June 23, 2016", "New York Times, How the N.R.A. Rates Lawmakers, published Dec. 19, 2012, accessed June 28, 2016", "OpenSecrets, Americans For Responsible Solutions Independent Expenditures, accessed June 28, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]