["On June 14, the demise of Bollywood actor Sushant Singh Rajput due to suicide shook the nation. He rose to stardom after 2013 hit ‘Kai Po Che!’ and since then he has starred in several movies including the biopic on former Indian cricket team captain MS Dhoni. People from all walks of life offered condolences on social media — fans, actors, journalists and politicians.", "In this backdrop, a screenshot that appears to Congress MP Rahul Gandhi’s tweet paying last respects to Rajput has gone viral on social media where Gandhi has apparently addressed the actor as a ‘cricketer’.", "As per the viral screenshot, Gandhi tweeted, “I am sorry to hear about the passing of #SushantSinghRajput. A young & talented Cricketer, gone too soon. My condolences to his family, friends & fans across the world.”", "Several users on Twitter and Facebook, believing the screenshot to be authentic, have attacked Gandhi and questioned his general knowledge.", "Twitter user @darshtiti (archive link) tweeted the viral image and wrote, “You all should train your Pappu in general knowledge.” Similarly, @BLDY_HYPOCRITES (archive link) posted the picture and said, “@RahulGandhi is ridiculous…. An individual who cnt get his info right & calls Sushant Singh Rajput a “Young & Talented Cricketer”.", "In order to authenticate the viral image, Alt News visited Gandhi’s Twitter profile and found the tweet where he had extended condolences to Rajput and his family. He wrote, “I am sorry to hear about the passing of #SushantSinghRajput. A young & talented actor, gone too soon. My condolences to his family, friends & fans across the world.”", "I am sorry to hear about the passing of #SushantSinghRajput. A young & talented actor, gone too soon. My condolences to his family, friends & fans across the world.", "— Rahul Gandhi (@RahulGandhi) June 14, 2020", "Alt News compared the screenshot with the tweet posted by Gandhi. Both the tweets are identical word for word, with the exception that the viral screenshot addressed Rajput as a cricketer, with a capital C, while Gandhi’s tweet addressed him an actor. Furthermore, the time stamp of both tweets is also the same.", "Thus the viral image is morphed. This was yet another attempt to portray Rahul Gandhi in poor light. Alt News has debunked multiple accounts of misinformation about Gandhi in the past including a morphed tweet where he is shown suggesting odd/ even method for reopening schools.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]