["On Fox News Sunday, Texas Gov. Rick Perry said fellow Republican presidential candidate Mitt Romney has changed positions on pivotal topics, including abortion rights.", "\"You go back through my record for 20-plus years, I have been a consistent conservative,\" Perry told Chris Wallace on Oct. 30, 2011. Perry said he has \"always been pro-life,\" while Romney has \"been on both sides\" of that issue.", "\"He’s been ... pro-abortion,\" Perry said.", "Perry has lobbed flip-flop charges at Romney, a former Massachusetts governor, since soon after entering the presidential race. During a Sept. 22 Republican presidential debate, Perry, in a halting verbal attack, hit that idea hard, saying that Romney previously had stood up for Roe v. Wade \"before he was against\" it. Perry was referring to the 1973 landmark Supreme Court ruling that struck down a Texas law prohibiting nearly all abortions and said states could not prohibit a woman from having an abortion before a fetus is viable, the time at which it can survive outside a woman's body.", "So, has Romney flip-flopped on abortion rights?", "For another fact-check, PolitiFact National looked into that question.", "Romney made several statements about abortion rights earlier in his political career. Here are two of his clearest statements about his position:", "•  In a debate during his unsuccessful 1994 challenge to U.S. Sen. Edward Kennedy, D-Mass., Romney said, \"I believe that abortion should be safe and legal in this country.\" He added: \"I believe that since Roe v. Wade has been the law for 20 years, it should be sustained and supported. And I sustain and support that law and support the right of a woman to make that choice.\"", "•  In his successful 2002 campaign for governor, Romney said during a debate, \"I will preserve and protect a woman's right to choose and am devoted and dedicated to honoring my word in that regard.\"", "Those comments — made in public forums eight years apart — struck us as solid evidence that Romney was then an abortion-rights supporter.", "What about his views today?", "The \"issues\" portion of his website doesn’t have a section on abortion, but Romney wrote an op-ed that was posted on the National Review’s website June 18, 2011, presenting his abortion views. It was written after he risked alienating anti-abortion activists by declining to sign a pledge offered by the Susan B. Anthony List, an anti-abortion group. The pledge includes a promise that if the signer becomes president, he will appoint \"pro-life\" candidates to head certain federal agencies such as the Justice Department and to advance legislation cutting off funding to Planned Parenthood clinics and other abortion providers.", "In the op-ed, Romney wrote: \"I am pro-life and believe that abortion should be limited to only instances of rape, incest, or to save the life of the mother. I support the reversal of Roe v. Wade, because it is bad law and bad medicine. Roe was a misguided ruling that was a result of a small group of activist federal judges legislating from the bench. I support the Hyde Amendment, which broadly bars the use of federal funds for abortions. And as president, I will support efforts to prohibit federal funding for any organization like Planned Parenthood.\"", "Romney goes on to say that if he is elected president, he will push for a law \"to protect unborn children who are capable of feeling pain from abortion\" and \"appoint judges who adhere to the Constitution and the laws as they are written, not as they want them to be written.\"", "Our ruling", "Romney’s views on abortion rights today are clearly different from what he expressed in 1994 and 2002. Most significantly, Romney earlier voiced support for the Roe decision; now, he says it should be reversed.", "We rate Perry’s claim that Romney flip-flopped on abortion rights True.", "Fox News Sunday, transcript, Oct. 30, 2011", "Fox News, transcript, Fox News-Google Republican presidential debate, Sept. 22, 2011", "PolitiFact National, \"Jon Huntsman accuses Mitt Romney of flip-flopping on abortion,\" Nov. 2, 2011", "Susan B. Anthony List, news release, \"Romney refusal to sign pro-life pledge leaves more questions than answers,\" June 18, 2011", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]