["An image has been shared hundreds of times in Facebook posts that claim it shows a journalist who was assaulted at a political event in Sri Lanka on August 24, 2019. The claim is false; the image actually shows a journalist who was assaulted while covering unrest on the outskirts of Colombo in 2009.", "The image was published on Facebook here on August 25, 2019, and has been shared hundreds of times since, alongside similar claims.", "The image includes a photograph of a man who is bleeding heavily from a head injury. Police and army officers can be seen in the background.", "Sinhala text across the image says: “Journalist who entered the Podujana Peramuna youth convention was assaulted upon showing his press ID card. This is all we ask: if this is how this type of leader, who is showcased in your media daily and promoted, behaves before coming into power, how will it be after he comes into power? Journalistic brothers, think wisely for a moment.”", "The post’s Sinhala caption translates to English as: “What happened to the journalist who came to the Youth Convention of the Pohottuwa… Got his head cracked open.”", "Below is a screenshot of the Facebook post:", "The Sinhala phrase “pohottuwa” means flower bud and is the logo of the Sri Lanka Podujana Peramuna (SLPP) -- a new political party led by former President Mahinda Rajapaksa.", "On the bottom left corner of the picture, there is also a headshot of Gotabaya Rajapaksa, SLPP’s presidential candidate. Here is his Twitter account.", "The Sri Lanka Podujana Peramuna held a convention on August 24, 2019, at the Nelum Pokuna theatre. Here is a live stream of the event, to which local media were not invited, according to local media reports.", "Posts with the same image and similar captions have been published elsewhere on Facebook, for example here and here.", "The claim is false. The man in the photograph in the misleading image is a journalist but the photo was actually taken on August 13, 2009.", "A Yandex reverse image search of the picture led to this article on a blog on Freedom of expression in Sri Lanka published on August 13, 2009, titled: “Police station attacked by people; journalist injured.\"", "According to the article, the individual in the image is a journalist who was injured in Angulana when police and residents clashed in the area.", "Angulana is a small coastal town on the outskirts of Colombo.", "Below is a screenshot of the article:", "A keyword search on Google led to this article published on August 16, 2009, titled “Angulana atrocity, youth pranks vs police brutality’.", "According to the article, unrest broke out on the night of August 12, 2009, when Angulana residents protested against local police over the deaths of two youths in police custody.", "Social media posts indicated that the man in the photograph worked at a local television channel. AFP contacted the channel, and found that that man in the image was Jaanaka Hettiarachchi, a video journalist attached to Derana, a leading media outlet in Sri Lanka.", "In a phone conversation with AFP on August 26, 2019, Hettiarachchi confirmed that he was the man in the photograph that has been used in the recent misleading posts.", "Hettiarachchi said he was in Angulana, accompanied by a camera assistant and a journalist, on August 13, 2009, to cover the unrest in the area.", "“When we arrived at the site, the Angulana Police station was surrounded by protestors and police officers were held under house arrest ... A few minutes later, a vehicle from a nearby police station arrived to extract the officers held under house arrest ... When the police vehicle exited with the officers trapped inside, the villagers attacked the vehicle with rocks and stones and I was hit by one,” Hettiarachchi said.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]