["About this rating", "CNNMoney reported that Ford had moved some manufacturing operations from Mexico to Avon Lake, Ohio, in August 2015.", "Ford's move antedated the election of Donald Trump by a full 15 months, and the two circumstances were entirely unrelated. A Ford spokesman affirmed the decision to move operations to Ohio occurred in 2011.", "On 14 November 2016, the web site Viral Liberty was among blogs claiming that the election of Donald Trump as President on 8 November 2016 had prompted the Ford Motor Company to move manufacturing operations from Mexico to Ohio:", "TRUMP WINS THE PRESIDENCY & FORD Shifts TRUCK PRODUCTION FROM MEXICO TO OHIO!", "Ford’s heavy duty pickup trucks which used to be built in Mexico started rolling off an assembly line in Ohio this week. That’s good news for the 1,000 Ford workers in Ohio, who might have otherwise been out of work.", "It’s also good publicity for Ford (F), which has been under fire for investing so much in Mexico. In April, the automaker said it would invest $2.5 billion in transmission plants in the Mexican states of Chihuahua and Guanajuato, creating about 3,800 jobs there.", "The item cited a near-identical article that had also appeared on social media on 14 November 2016:", "Since Donald Trump Won The Presidency ... Ford Shifts Truck Production From Mexico To Ohio", "Ford’s south-of-the-border strategy has drawn heavy criticism from groups such as the United Auto Workers union and Republican presidential candidate Donald Trump.", "The Avon Lake, Ohio, plant produced its first batch of Ford’s full-size F-650 and F-750 pick up trucks on [9 November 2016].", "That version included no links to substantiate the claim, but a quote revealed that the article had been lifted verbatim from a CNNMoney article  published well over a year earlier, on 13 August 2015:", "Ford's heavy duty pickup trucks which used to be built in Mexico started rolling off an assembly line in Ohio [in August 2015].", "That's good news for the 1,000 Ford workers in Ohio, who might have otherwise been out of work.", "It's also good publicity for Ford, which has been under fire for investing so much in Mexico. In April, the automaker said it would invest $2.5 billion in transmission plants in the Mexican states of Chihuahua and Guanajuato, creating about 3,800 jobs there.", "Ford's south-of-the-border strategy has drawn heavy criticism from groups such as the United Auto Workers union and Republican presidential candidate Donald Trump.", "The Avon Lake, Ohio, plant produced its first batch of Ford's full-size F-650 and F-750 pick up trucks on [12 August 2015].", "\"Our investment...reinforces our commitment to building vehicles in America,\" said Joe Hinrichs, Ford president, The Americas. \"Working with our partners in the UAW, we found a way to make the costs competitive enough to bring production of a whole new generation of work trucks to Ohio.\"", "Although it was true Ford moved some of their manufacturing operations from Mexico to Avon Lake, Ohio, that change occurred in August 2015 and had nothing to do with the 8 November 2016 election of Donald Trump. Trump did not win the Republican nomination until July 2016, nearly one year after CNNMoney reported Ford's investment in their Avon Lake facility. An October 2015 article by the same outlet and writer reported that Ford had decided on the Ohio move back in 2011.", "Ford did announce in January 2017 that they were entirely canceling plans for additional plants in Mexico and would be expanding their facilities in Michigan instead:", "Ford Motor announced that it would cancel plans for a $1.6 billion Mexico plant and launch a Michigan expansion in a move that may be viewed as a capitulation to Donald Trump.", "Ford CEO Mark Fields said the company would spend $700 million and add 700 jobs to \"transform and expand\" its Flat Rock, Mich. manufacturing plant to make autonomous and electric vehicles.", "To be sure, Ford acknowledged that it would still move production of the next-generation Focus sedan to Mexico, as previously announced. But it will be built at an existing plant in Hermosillo, Mexico, not at a new facility.", "Ford's expansion will convert 700 temporary jobs at the Michigan plant into permanent positions, adding to an existing hourly staff of about 3,600. Fields said the automaker will add about 200 jobs at its plant in Hermosillo, Mexico, to make the Focus but did not say how much it would invest.", "Isidore, Chris.   \"Ford Shifts Truck Production from Mexico to Ohio.\"\r\n    CNNMoney.   17 August 2015.", "Isidore, Chris and Noah Gray.   \"Donald Trump Is Wrong About Ford and Mexico.\"\r\n    CNNMoney.   26 October 2015.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]