["About this rating", "Much ado was made over the fact that U.S. Congresswoman Alexandria Ocasio-Cortez (AOC) appeared unfamiliar with in-sink garbage disposals in a video she posted to Instagram in May 2019. Web outlets such as Hotair, the Washington Times, and the Gateway Pundit published articles mocking the freshman congresswoman for her apparent lack of garbage-disposal knowledge, and dozens of social media users posted jokes about her on Twitter:", "This bout of online outrage led to some questions about the congresswoman, New York laws, and the prevalence of garbage-disposals in general. This article will address three of the most common queries that we've encountered: Is this video real? Were garbage disposals once banned in New York City? How common are garbage disposals in NYC?", "First up, the video.", "Rep. Ocasio-Cortez expressed shock over her new garbage disposal in a 6 May 2019 Instagram video.", "The video that stirred up this controversy was posted as a \"story\" to her Instagram page on 6 May 2019. Instagram stories are only available for 24 hours, so this clip no longer appears on her page. However, a number of social media users and websites managed to archive the footage:", "While the video of Rep. Ocasio-Cortez expressing shock over the existence of garbage disposals is genuine, viewers should be aware at least one parody version of this video is circulating on social media that features an Ocasio-Cortez lookalike expressing her disbelief over other household appliances.", "Were garbage disposals once banned in New York City?", "New York City lifted its nearly three-decade garbage disposal ban in 1997. The appliance is still illegal in commercial establishments.", "After her video went viral, Congresswoman Ocasio-Cortez took to Twitter to explain why she was so baffled by the existence of garbage disposals, noting that these household appliances had once been illegal in New York City:", "They were illegal in NYC for a long time and never really became a thing after the ban was lifted ?", "Other home things many NYers don’t have in their apartments: washer/dryer, dishwasher, central air.", "(Saving up for a portable dishwasher was one of the best things we did) https://t.co/YywnBFirL6", "— Alexandria Ocasio-Cortez (@AOC) May 8, 2019", "Garbage disposals were banned in most of New York City in the early 1970s as officials feared that the appliance would wreak havoc on the city's plumbing system, but the ban was finally lifted in 1997, giving homeowners the legal ability to install such appliances. A contemporaneous report from the Associated Press, however, noted that the cost of installing a new garbage disposal deterred many New Yorkers from retrofitting their sinks:", "Sun, Oct 12, 1997 – 11 · Star-Gazette (Elmira, New York) · Newspapers.com", "While garbage disposals are currently legal in NYC residential units, they are still illegal in commercial establishments. This is especially noteworthy, as some of AOC's critics used the congresswoman's previous experience as a bartender to claim that she was lying about her unfamiliarity with garbage disposals:", "The New York City Department of Environmental Protection (DEP) notes on its website that \"Currently, residential households are allowed to dispose of food waste using food waste disposers (FWDs), also known as garbage grinders. However, FWDs are not allowed to be installed or used in commercial establishments (i.e., restaurants) or institutional uses (i.e., hospitals, universities, etc.).\"", "How many homes in New York City have garbage disposals today?", "In 2008, NYC's Department of Environmental Protection estimated that only 1% of households had garbage disposals.", "As noted in the 1997 newspaper clipping shown above, New Yorkers weren't \"exactly lining up to have the noisy machines installed\" after the disposal ban was lifted. While this appliance has been legal in the city for more than two decades, residential garbage disposals apparently are still something of a rarity, as the real estate blog Brick Underground wrote in 2010:", "Garbage disposals have been legal in New York for more than a decade now, but our BrickTank experts confirm that many if not most New York City apartment buildings — particularly prewars — still don’t allow them.", "Unfortunately, the older pipes that serve many of the city’s vertical villages tend to have so much sludge and scaling in their waste lines that the additional ground-up waste produced by a garbage disposal can result in clots, back-ups, overflows and property damage, say property managers Thomas Usztoke and Michael Wolfe.", "A 2013 article published by the New York Times reported that realtors often advertised units as having garbage disposals because the appliance was still rare throughout the city:", "This little appliance of convenience has been widely available in much of the country since the middle of the last century, but residential garbage disposals were, in fact, illegal in New York City until 1997. And although the laws have changed, many apartment buildings, especially older ones, continue to ban them, fearing for the health of aging pipes ...", "Nancy Albertson, director of leasing at Glenwood, a company that builds new rental buildings, many of which have included garbage disposals in recent years, said that when many New Yorkers saw them, they had the same reaction: “Isn’t that illegal?”", "No, just rare.", "Michael J. Wolfe, president of Midboro Management, which manages mostly prewar co-op and condominium buildings, said that out of 95 buildings, maybe three of his prewar buildings and a few newly constructed projects allowed garbage disposals.", "The most concrete statistic that we could find regarding the number of garbage disposals in New York City came from a footnote published in a 2008 study on commercial food waste by the aforementioned NYC environmental protection department. The DEP estimated that only 1 percent of households in New York City had food waste disposers:", "The City Council voted to rescind the ban on residential FWDs and the Mayor signed the measure into law effective October 11, 1997. To date, it is estimated that less than 1 percent of households in New York City have installed FWDs.", "We reached out to that city department and to Emerson, one of the world's largest manufacturer of garbage disposals, for more information. We will update this article when more recent statistics are made available to us.", "Rogers, Teri.   \"Are Garbage Disposals Illegal in New York City?\"\r\n    Brick Underground.   1 June 2010.", "Harris, Elizabeth.   \"Besides the Gym and Great Views, Don’t Forget to Mention the Garbage Disposal.\"\r\n    The New York Times.   4 February 2013.", "Curl, Joseph.   \"There’s Just No End to the Stupid Things That Come Out of Ocasio-Cortez’s Mouth.\"\r\n    Gateway Pundit.   8 May 2019.", "Star Gazette.   \"NYC Lifts Longtime Ban on Garbage Disposals.\"\r\n    12 October 1997.", "New York Department of Environmental Protection.   \"Commercial Food Waste Disposal Study.\"\r\n    31 December 2008.", "New York Department of Environmental Protection.   \"Food Waste Disposers.\"\r\n    Retrieved 9 May 2019.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]