["By Lori Robertson", "Posted on September 24, 2020", "Continuing a yearslong trend, President Donald Trump made false and misleading comments about new auto plants in Michigan, and the industry at large — boasting in recent campaign rallies about accomplishments that aren’t true.", "The number of motor vehicle and parts manufacturing jobs in Michigan has gone down — not up — under Trump, even before the coronavirus pandemic caused economic shutdowns.", "In a rally in Fayetteville, North Carolina, on Sept. 19 and another in Vandalia, Ohio, on Sept. 21, Trump told a story about asking Japanese Prime Minister Shinzo Abe (who recently resigned) for Japanese car companies to build plants in the U.S., claiming, “Next day, it was a story, ‘Five car companies to open up in Michigan.'”", "Here’s the version Trump told at the Sept. 21 rally:", "Vandalia, Ohio, rally Sept. 21: You know how many car plants we’re bringing back to Michigan? Nobody’s ever seen it. For 40 years, they didn’t build a plant. And now they’re building them all over. And I tell countries, I told a great gentleman, he just retired, Prime Minister Abe of Japan. I said, “Shinzo, you got to build plants here, you can’t do this. You’re building your cars in Japan and sending them. We want our cars built here. We want cars built here.” He said, “Well, that’s not up to me, that’s up to the company.” “That’s all right, Shinzo, I know you can do it.” The next day they announced five plants, I mean, what can I tell you?", "The president is wrong on two counts: Japanese car companies didn’t announce five new plants in Michigan, and auto plants have indeed been built in the U.S. in the past 40 years.", "Trump also told a crowd in Freeland, Michigan, on Sept. 10 this story about the “five car companies … coming to Michigan,” and claimed that “you haven’t had a plant built in like 42 years.”", "If he meant to refer to only auto manufacturing plants built in Michigan, he’s wrong on that, too. Prior to 2017, when Trump took office, General Motors built a light vehicle assembly plant in Lansing Delta Township, completed in 2006. It’s “GM’s newest plant in the United States,” the company’s website says.", "That’s the most recent light vehicle assembly plant built in the state prior to 2017, when Trump took office, according to Kristin Dziczek, vice president of industry, labor & economics at the Center for Automotive Research.", "CAR is a Michigan-based research group that receives some of its funding from the federal government and tracks auto industry investments in North America.", "In Ohio, Dziczek said, the most recent light vehicle assembly plant was completed in 2005: a Fiat Chrysler Automobiles plant to build the Jeep Wrangler and Wrangler Unlimited in Toledo.", "Trump has made similar claims before, such as when he said in June 2019, naming several states, “They hadn’t built one [an auto plant] in decades and now they’re all over the place.” Two new plants had been announced in 2015 in South Carolina — by Volvo, which broke ground on the plant on Sept. 25, 2015, and by Mercedes-Benz, which broke ground in July 2016.", "As for new plants since Trump took office, CAR told us then that it knew of only two new assembly plants: a Toyota/Mazda joint venture plant in Alabama (announced in January 2018) and a Fiat Chrysler Automobiles plant in Michigan (announced in February 2019).", "We asked CAR about Trump’s recent claim regarding five new Japanese plants in Michigan. Dziczek told us there have been five new investments by Japanese automakers in Michigan, but only one of them is a manufacturing facility, which was announced on Jan. 30, 2017, just 10 days after Trump took office.", "And it’s not an auto assembly plant to build cars, as Trump’s comments suggest.", "Honda and General Motors announced the joint venture to produce hydrogen fuel cell systems in GM’s existing Brownstone, Michigan, battery pack manufacturing facility. The companies said in a press release they would invest a combined $85 million in the project, which would create nearly 100 jobs. Honda and GM had been working together to create fuel cell systems under a collaboration agreement they unveiled in July 2013.", "As for the other four investments in Michigan:", "We asked the Trump campaign for support for the president’s statements, but we haven’t received a response.", "Even if Trump meant to say new “investments” instead of “plants,” the Michigan investments during his time in office are less than what Japanese companies had invested in the three prior years in 2014 to 2016.", "Dziczek said there were 11 investments by Japanese companies in Michigan over that 2014-2016 time frame in expansions, new facilities and retooling of an existing facility. Those investments totaled $315.3 million and involved more than 2,529 jobs (with no information on jobs for three of the investments).", "During Trump’s tenure, there have been $174.2 million in investments involving 285 jobs (with no information on the investment or jobs for the vehicle charging stations or the autonomous vehicle testing facility).", "While Trump has made false boasts about auto plants in Michigan, the number of jobs in vehicles and parts manufacturing in the state has dropped under his watch. As of February, before the pandemic shutdowns began, motor vehicle and parts manufacturing jobs had fallen by 2,400 from January 2017, when Trump took office, according to the Bureau of Labor Statistics.", "As of August, those Michigan jobs stood at 155,800, down 18,400 from the month Trump was inaugurated.", "Nationwide, motor vehicles and parts manufacturing jobs have gone up under Trump, but the job growth was faster under the Obama administration. That’s looking at the pre-pandemic numbers. From January 2017 to February 2020, 49,300 auto manufacturing jobs were added, a 5.2% growth rate. During the same time period — 37 months — at the end of the Obama administration, motor vehicles and parts manufacturing jobs grew by 99,600, or 11.6%.", "The president also claimed that auto sales and manufacturing were setting records, but neither is at record levels.", "Trump, Sept. 21: Car manufacturing is record setting. You take a look at car sales are record setting.", "Data from the Bureau of Economic Analysis show that neither domestic production nor light weight vehicle sales are at record levels. The latest figures are for July and August, respectively.", "On a yearly basis, both production and sales have been lower under Trump’s presidency than they were in 2016, the year before he took office.", "In 2016, 3.9 million units were assembled in the U.S. That figure has dropped every year since and stood at 2.5 million units in 2019.", "As for sales, those too were higher in 2016 — 209.6 million units — than any year so far under Trump. Light vehicle sales were 203.4 million in 2019.", "Dziczek shared with us figures that include sales of medium duty vehicles. Those also showed 2016 with higher sales than any year since.", "It’s possible Trump was referring to the pace of recovery for manufacturing and sales, after both plummeted in March and April during economic shutdowns due to the coronavirus pandemic. Both measures have nearly recovered to February levels. But if that’s a record recovery, it was only possible after production fell by 99.2% from February to April and light vehicle sales dropped 47.8%.", "Eugene Kiely contributed to this article.", "Editor’s note: Swing State Watch is an occasional series about false and misleading political messages in key states that will help decide the 2020 presidential election.", "Editor’s Note: Please consider a donation to FactCheck.org. We do not accept advertising. We rely on grants and individual donations from people like you. Credit card donations may be made through our “Donate” page. If you prefer to give by check, send to: FactCheck.org, Annenberg Public Policy Center, 202 S. 36th St., Philadelphia, PA 19104.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here for more.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]