["Sen. Ted Cruz, R-Texas, speaks during a Senate Foreign Relations Committee hearing on Capitol Hill in Washington, Thursday, Sept. 24, 2020, on U.S. policy in a changing Middle East. (AP)", "• Sen. Ted Cruz did say this. But it was in 2015 and he was referring to the 2012 election that resulted in President Barack Obama’s reelection.", "• It is difficult to define and identify evangelical Christians.", "• We found no evidence to suggest 54 million evangelical Christians decided not to participate in the 2012 presidential election.", "Social media is flush with posts that aim to encourage voter turnout by Election Day, Nov. 3.", "But one such Facebook post features a portrait of Republican Sen. Ted Cruz and a quote that, in the context of 2020, is both misleading and factually problematic.", "The Oct. 1 Facebook post shows the Texas lawmaker in front of American and Texas flags, and quotes him as saying, \"In the last election, 54 million evangelical Christians stayed home. If Christians will simply show up and vote our values, we’ll turn this country around.\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Although the post is correct to attribute these words to Cruz, it leaves out important context: Cruz said this in 2015 and he was referring to the 2012 election, which resulted in President Barack Obama winning a second term.", "When Cruz was running for the 2016 Republican presidential nomination, he used this 54 million figure multiple times. In fact, Cruz made the exact statement seen in the post. It was during a taped interview with the Christian Broadcasting Network’s David Brody in July 2015.", "\"There are 90 million evangelical Christians in the United States — it’s about 30 percent of our population,\" Cruz said. \"In the last election 54 million evangelical Christians stayed home. If Christians will simply show up and vote our values, we’ll turn this country around.\"", "PolitiFact reached out to Cruz to see what evidence he had to support his claim, but he did not respond to our request for comment.", "In 2015, there was some pushback to the numbers in Cruz’s claim. News reports noted that it is difficult to define and identify \"evangelicals.\" The Cook Political Report took an in-depth look at Cruz’s suggestion that evangelicals disengaged in 2012 found \"no evidence of a ‘slump’\" in the evangelical turnout for Sen. Mitt Romney in 2012.", "\"In 2004, evangelical voters made up 23 percent of the electorate and George W. Bush carried that group with 78 percent,\" an archived version of the article reads. \"In 2012, evangelical voters made up an even larger share of the electorate — 26 percent — and Romney won this group with an equal 78 percent of the vote.\"", "Post-election research from the Pew Research Center found similar results: evangelicals supported Romney as much as they supported Republican candidates in prior elections.", "\"White evangelical Protestants voted as heavily for Romney as they did for the GOP candidates in 2008 and 2004, and they made up about the same share of the electorate as they did in the two previous elections,\" reads the Pew report.", "Jeanine Kraybill is an associate professor of political science at California State University, Bakersfield, who has extensively studied the intersection of politics and religion. Over the last several years, Kraybill said estimates have indicated there are between 90 million and 100 million evangelicals in the U.S.", "\"It is important to note that evangelical can be loosely defined. Some measures also do not take into account Black evangelicals and some consider ‘born again’ and evangelical two different things,\" Kraybill added.", "This makes it more difficult to evaluate a claim like Cruz’s.", "\"I think ... in some respects it is how he is defining evangelicals, but I cannot find a basis for this claim,\" she said.", "A viral image quotes Cruz as saying, \"In the last election, 54 million evangelical Christians stayed home. If Christians will simply show up and vote our values, we’ll turn this country around.\"", "Cruz said this in 2015, referring to the 2012 presidential election. As to its substance, there is no definitive evidence that 54 million evangelical Christians declined to vote in 2012.", "We rate this claim Half True.", "Facebook post, Oct. 1, 2020", "CBN News, \"Ted Cruz Tells Brody File: Time For Christians To Rise Up And Take America Back,\" July 21, 2015", "New York Magazine, \"Ted Cruz’s Imaginary Evangelical Army,\" Dec. 4, 2015", "The Dispatch Fact Check, \"The Truth About a Viral Ted Cruz Quote About Christian Voters,\" Aug. 5, 2020", "Email interview with Jeanine Kraybill, associate professor in the department of political science at California State University, Oct. 8, 2020", "Washington Post, \"Ted Cruz: there is a ‘war on faith,’\" Aug. 21, 2015", "Wall Street Journal, \"Can Evangelicals Swing 2016 for GOP, as Cruz Says?\" Nov. 30, 2015", "Pew Research Center, \"5 facts about U.S. evangelical Protestants,\" March 1, 2018", "The Cook Political Report, \"Cruz's Conservative Conundrum,\" Nov. 30, 2015", "The Atlantic, \"Defining 'Evangelical,'\" Dec. 7, 2015", "Pew Research Center, \"Election 2012 Post Mortem: White Evangelicals and Support for Romney,\" Dec. 7, 2012", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]