["The image was published here on a Facebook page with more than 4,300 followers on September 4, 2020. It has been shared more than 300 times.", "The text overlay above Johnson reads: “Genius work from the teachers in this school to spell out FUCK BORIS on the wall behind him.”", "The image was also shared hundreds of times on Facebook here, here, and here.", "However, this is not a genuine image; it has been manipulated to include the offensive slogan.", "A keyword search found that the image is a screenshot taken from a press opportunity by Johnson at a school in Leicestershire on August 26, 2020, where he spoke about face masks in schools.", "UK newspaper The Independent published a video of Johnson’s comments in this report published on the same day.", "The video shows that Johnson is speaking in front of a different backdrop, where the elements are assembled in a different order and do not spell any words.", "Below is a screenshot comparison between the video in The Independent’s report (L) and the misleading image (R):", "Johnson’s visit to the school was also reported on by other local news outlets, including Sky News here and The Daily Mail here. The video in both reports show that Johnson did not speak in front of a “Fuck Boris” backdrop.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]