["By Sydney Nixon", "Posted on October 5, 2020", "Viral Facebook posts misleadingly claim that Florida, Georgia, Idaho, South Dakota and Tennessee have become “mask free.” None has a statewide mask mandate — but individual cities and counties in each of those states do have orders requiring face coverings to mitigate the spread of COVID-19.", "As COVID-19 cases in the U.S. grew to more than 7.4 million — including President Donald Trump and First Lady Melania Trump — and surpassed 209,000 deaths, the Centers for Disease Control and Prevention continued to urge measures to stop the spread of the pandemic, such as frequent hand washing and social distancing. The CDC also recommends that people “wear masks in public settings and when around people who don’t live in [their] household, especially when other social distancing measures are difficult to maintain.”", "In early October, 33 states, as well as Washington, D.C. and Puerto Rico, had implemented orders requiring face coverings in public, according to information compiled by AARP.", "Wearing a face mask, however, has become a polarizing issue in the U.S., with some Americans viewing the masks as a limitation on personal freedom. Viral memes on Facebook now misleadingly claim that in some states there are no requirements at all for wearing face masks.", "“FLORIDA, GEORGIA, IDAHO, SOUTH DAKOTA & TENNESSEE ARE NOW MASK FREE!!!”, one post claims, and shows a photo of two women holding up their hands with the “V” for victory sign.", "None of those states has a statewide mandate requiring face coverings. But it is inaccurate to characterize them as mask-free. Individual cities and counties in each of the states has orders in place that mandate face coverings.", "In Florida, Miami-Dade County, Palm Beach County and Hillsborough County, which constitute about 21% of the state’s population, have mandates on face coverings.", "In early July, a public health emergency order requiring face coverings went into effect in Boise, the capital of Idaho. Jefferson and Fremont counties began requiring face masks in August.", "Mayor Keisha Lance Bottoms of Atlanta, the most populous city in Georgia, issued an executive order requiring face masks on July 8. Other cities in North Georgia began requiring face coverings in late August.", "Knox County, Shelby County, Memphis and Nashville, which account for nearly 40% of Tennessee’s population, have mandates on face coverings.", "On Sept. 10, Brookings City became the first county in South Dakota to require face coverings.", "In addition, the state health departments in Florida, Georgia, Idaho, South Dakota and Tennessee all recommend the use of face coverings in public settings.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "Aratani, Lauren. “How did face masks become a political issue in America?” The Guardian. 29 Jun 2020.", "Baker, Peter and Maggie Haberman. “Trump Tests Positive for the Coronavirus.” New York Times. 2 Oct 2020.", "Bottoms, Keisha Lance. Executive Order Number 2020-113. Office of the Mayor, City of Atlanta. 8 Jul 2020.", "City of Boise, Idaho. Public Health Emergency Order 20-10. 2 Jul 2020.", "Engen, Scott. “Brookings the first South Dakota city to implement mask mandate.” Valley News Live. 9 Sep 2020.", "Georgia Department of Public Health.", "Idaho Department of Health and Welfare.", "Johnson, Brittni. “More Idaho counties require face masks in public after spike in COVID-19 cases.” Idaho Statesman. 11 Aug 2020.", "Markowitz, Andy. “State-by-State Guide to Face Mask Requirements.” AARP. Accessed 1 Oct 2020.", "McLean, Lauren. “Mayor McLean to Sign Public Health Order Mandating Face Masks.” City of Boise, Idaho. 2 Jul 2020.", "Rivkees, Scott A. “Updated Measures to Ensure Protection of Public Health in Response to COVID-19.” Florida Department of Health. 20 Jun 2020.", "“City of Brookings Approves Mask Mandates.” Brookings City, South Dakota. 10 Sep 2020.", "“Considerations for Wearing Masks.” Centers for Disease Control and Prevention. 7 Aug 2020.", "COVID-19 Dashboard by the Center for Systems Science and Engineering. Johns Hopkins University. Accessed 1 Oct 2020.", "“Knox and Shelby join Nashville, Memphis in mask mandate.” Associated Press. 3 Jul 2020.", "Novel Coronavirus (COVID-19) Updates and Information. South Dakota Department of Health.", "“Statement from Miami-Dade County Mayor Carlos A. Gimenez on expansion of mandatory mask order.” Miami-Dade County, Office of the Mayor. 1 Jul 2020.", "“Stay Safe: Face Coverings & Masks.” Hillsborough County Florida.", "“What cities and counties are requiring face masks?” WSB-TV Atlanta. 25 Aug 2020.", "“Why should YOU wear a mask or face covering?” Tennessee Department of Health.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]