["“यही वो चार सिपाही है जिन्हों ने आज शौर्य गाथा लिखी भारत माता की जय (These are the four soldiers who wrote the gallantry story today Bharat Mata Ki Jay -translated)”, reads the caption attached to an image of four men in uniform shared by an individual user, Jasmin Makwana. In context of the air strike on February 26, the post suggests that these were the Indian pilots who conducted the strike in Balakot, Pakistan.", "The photograph has now gone viral on Facebook with similar captions.", "A set of pictures, where a group of air force pilots can be seen walking with their helmets on their side, is also being shared with a narrative that they had carried out the air strike in Pakistan. One Sunil Pandit posted two photographs on a Facebook group, एक कदम हिन्दु राष्ट्र की ओर, with the claim –“ये 12 भारत की मां के नायक हैं (These are the 12 heroes of our mother India -translated)”.", "Many other Facebook and Twitter users have shared the picture with an identical narrative.", "Upon reverse searching the above image on Google, the photograph appears to be a generic picture which has used by several websites in their articles and blogs. This image is found in a 2011 blog titled, “Pilot License Course Indira Gandhi Rashtriya Uran Akademi”. This was one of the earliest instances when the image appeared on the internet that we were able to trace.", "The image posted above was found in a blog dated August 7, 2015. “India’s Su-30MKI Flankers Sparred With Royal Air Force Typhoons”, reads the title of the blog. Suffice to say, the image is at least three years old and had existed on the internet before the air strike in Balakot, Pakistan.", "A third photograph circulating on social media was found in an October, 2015 blog post. Image 2, earlier debunked in this article, was also included in this post titled, “Joint exercise between the Indian Air Force and Royal Air Force “Exercise Indradhanush” 2015″.", "According to a report published in August 2015, Indian Air Force personnel on July 31 had conducted Indradhanush-IV, an Indo-UK bilateral air exercise in United Kingdom. However, we couldn’t conclusively establish that the images are related to the same exercise. Moreover, in a statement given to Boom, the Indian Air Force had categorically denied of having made public the details about the personnel involved in the mission.", "In conclusion, old images of Indian Air Force personnel were shared as of the pilots who carried the air strike in Pakistan.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]