["On Sept. 21, Steve Guest, rapid response director for the Republic National Committee, posted on Twitter an eight-second Trump campaign clip of a speech by Joe Biden with the comment, \"Joe Biden completely botches the Pledge of Allegiance.\"", "The clip was viewed more than 1.5 million times and generated comments regarding Biden's mental state.", "Some who shared the quick clip claimed Biden made a gaffe, or \"botched\" the pledge, including Dinesh D'Souza, The Federalist, PJ Media and Fox News' Sean Hannity.", "Other posts took a more hesitant approach with the claim, saying it \"appears\" Biden may have goofed. It was posted twice on Facebook by The Political Insider, a conservative news and media website, which initially said, \"This may be Joe Biden's most humiliating gaffe yet.\" It linked to an article by the publication that commented at length on the speech, though it does not note that Biden was trying to recite the entire pledge. On Sept. 24, it removed one of its Facebook posts and edited the other to remove the \"botched\" reference.", "More:Fact check: Antifa.com redirects to Joe Biden's website, but Biden campaign not involved", "The clip was taken from a 26-minute video speech by Biden in Manitowoc, Wisconsin, on Sept. 21, and addressed President Donald Trump's response to the coronavirus outbreak.", "In it, Biden quotes Trump as trying to minimize the number of deaths and to assess blame by saying that if the number of deaths of people from the blue states, run by Democratic governors, were taken out, the death count would show that Republican governors were doing quite well.", "Biden said that was false, and accurately noted that the deaths in red states alone would put the U.S. only behind Brazil worldwide in number of fatalities.", "More:Fact check: After deplaning in Tampa, Joe Biden waved to firefighters in a field", "The former vice president then discussed his view of the role of a president as the leader of the entire nation:", "\"Think about what he is saying — he is saying that if you live in states like Wisconsin, Michigan, Pennsylvania, states with Democratic governors, you are not his problem, he has no obligation to you, he is not responsible for you as president, your family or you well-being. I don't see the presidency that way. I don't pledge allegiance to red states of America, or blue states of America, I pledge allegiance to the United States of America, one nation, indivisible, under God. For real. I'm running as a proud Democrat, but I'm not going to govern as a Democratic president: I'm going to govern as president.\"", "More:Fact check: DNC didn't leave out 'under God' from the Pledge of Allegiance", "Fact checkers for CNN found that in context, it is clear that Biden was not trying to recite the entire 31-word Pledge of Allegiance.", "USA TODAY did not receive an immediate response for a comment from Guest or the Republican National Committee.", "Shauna Schatz, vice president for media at Intermarkets Inc., responded on behalf of The Political Insider.", "Schatz initially told USA TODAY that Rusty Weiss, the editor and author of the article linked to the Facebook post, wrote that Biden \"appears\" to botch the pledge. She called that the author's \"personal interpretation of the moment, based on review of clips and Biden’s track record.\"", "\"Your inquiry prompted some interesting and in-depth discussions, however. In the end, the team agrees that it’s worth mentioning that not everyone interprets this segment of Biden’s Wisconsin speech in the same way.\"", "\"Further, Rusty agrees with your contention that Biden was not attempting to recite the pledge in its entirety and that the clip in question is from a portion of his speech,\" she said. \"His writing supports that, 'Joe Biden delivered a version of the Pledge of Allegiance during his campaign speech in Wisconsin Monday that left many a viewer baffled.' The author then goes on to provide the speech context around the quote. Rusty’s interpretation of the event, given Biden’s speech history, including the recent Declaration of Independence incident, is reasonable.\"", "Since being contacted by USA TODAY, Political Insider added an editor's note to its story, noting everyone isn't seeing Biden's statement as a gaffe.", "Schatz, in an updated email, said Political Insider has also swapped out the Guest tweet on its Facebook page, because of Guest's caption, and added a video of the full speech for context.", "It is clear from a full viewing of Biden's speech that he was not attempting to recite the entire Pledge of Allegiance. The claim that he had botched it is unfounded. We rate that claim as FALSE.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more."]