["A 2:20-minute-long video reportedly showing former Iraqi president Saddam Hussein has recently gone viral on social media. Users are claiming that his body was exhumed “12 years” after his burial and it had not decayed. Saddam Hussein’s government was toppled by a US-led invasion in 2003 and he was hanged on December 30, 2006, for crimes against humanity.", "On August 30, 2020, a Facebook page posted the video, writing, “An Iraqi leader dug up Saddam Hussein’s tomb after 12 years to move the corpse only to find that his face looked completely fresh”. This video had garnered 1,800 views at the time of writing. (archive)", "इराकी सदर ने 12 साल बाद सद्दाम हुसैन की कब्र मुनतकिल करने के लिए खोदी तो चेहरा उसी तरह तरोताजा ही है", "Posted by Mullaji mobile center Kairana – SAMLI u.p on Sunday, 30 August 2020", "Another Facebook user posted the same video with this claim. (archive)", "इराकी सदर ने 12 साल बाद सद्दाम हुसैन की कब्र मुनतकिल करने के लिए खोदी तो चेहरा उसी तरह तरोताजा ही है", "Posted by Hafiz.Iftkhar.Alam on Saturday, 29 August 2020", "This video was also shared with a Gujarati message—ઇરાક ના સદરએ સદ્દામ હુસેનની કબર12 વર્ષ પછી બીજી જગ્યા એ મુંતકીલ કરવા માટે ખોલી તો આજ પણ તેમનો ચહેરો—promoting similar similar claims. It has been viewed more than 500 times at the time of writing. (archived)", "We also received a few requests to verify this clip on the Alt News official mobile application.", "The first thing that brings into question the authenticity of this video and users’ claims is the fact that they suggest the body was exhumed after 12 years. In reality, 14 years have passed since Saddam Hussein was buried. Therefore, this claim does not make sense mathematically.", "After doing a keyword search, we found a longer version of the video in question. The video had been posted on YouTube on January 6, 2007, seven days after Saddam Hussein’s execution. This clip shows Hussein’s last journey in which his body can be seen as it is being buried. In this 9-minute long video, scenes from the viral video appear at the 6:27 mark.", "When we compared the frames of the viral video and the 2007 video, it was clear that they were from the same source.", "This slideshow requires JavaScript.", "Similarly, a web search about Saddam Hussein’s funeral led us to a video on Associated Press archives dated July 23, 2015. In this video, a group of people can be seen burying him.", "It is important to note that Saddam Hussein was buried in al-Awja in the city of Tikrit, Iraq. Hussein belonged to the Sunni sect and his loyalists were worried that his body would be harmed by Shi’ite militias. The Iraqi leader was hanged in 2006 for the killing of 148 Shi’ite villagers. In 2014, his supporters moved his body from this tomb to an unknown location. To date, there is no information about the final resting place of his body.", "Therefore, the claims being made online about Saddam Hussein’s body looking the same as it did 12 years after his death are incorrect. These claims are being made based on a video of the leader’s last rites.", "Donate Now", "Kinjal Parmar holds a Bachelor of Science in Microbiology. However, her keen interest in journalism, drove her to pursue journalism from the Indian Institute of Mass Communication. At Alt News since 2019, she focuses on authentication of information which includes visual verification, media misreports, examining mis/disinformation across social media. She is the lead video producer at Alt News and manages social media accounts for the organization.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "Trigger Warning: Sexual Violence A distressing video of a girl forced to take her clothes…", "A clip featuring Pakistan men’s Cricket team captain Babar Azam is viral on social media…", "A 13-second clip featuring Bollywood actor Shah Rukh Khan is being shared on social media…", "Union minister of information and broadcasting Anurag Thakur on September 26 announced Waheeda Rehman as…"]