["This month, some individuals took to Facebook and Instagram to post screenshots of a document that claims to be an arrest warrant for President-elect Joe Biden.", "The warrant calls for Biden to be arrested and detained at Guantanamo Bay Detention Facility. It also claims he is \"wanted for questioning related to the death of John F. Kennedy Jr., treason, fraud, human trafficking, pedophilia and crimes against humanity.\"", "The users behind the posts on Facebook and Instagram have not responded to requests from USA TODAY for comment.", "More:Fact check: Joe Biden was never 'wanted' in Ukraine; prosecutors rejected a complaint", "The purported warrant carries no legal weight.", "The document first appeared on YouTube on Nov. 13 in a video titled \"ARREST WARRANT 2020-11-13.1 Joseph Biden, Jr.\"", "In the video, Cindy K. Currier claims she has a warrant to present and reads out the document.", "Arrest warrants must be issued by a \"competent authority upon a showing of probable cause,\" according to Cornell Law School's Legal Information Institute.", "The warrant for Biden claims to be from the \"Court of Ages,\" carries a seal that reads \"Heirs of Creation Court of Ages,\" and was signed by Currier. That court is fake.", "The website for the Court of Ages claims it was established in 2013 and \"works to restore personal and national integrity to the original Heirs and Guardians of Earth.\"", "\"The Court recognizes humanity as sole Heirs of Creation and brings action by Natural Law to defend their rights and protect their inheritance,\" it explains.", "But there's no such court, according to online searches by USA TODAY and Reuters.", "Currier has not responded to a request from USA TODAY for comment.", "In response to an inquiry from Reuters — which was also posted to YouTube — Currier claims that the \"Court of Ages is a Universal Court.\"", "\"The court decision in the 2014 trial Heirs of Creation v. U.S. Corporation was sent to the World Court. Orders/warrants were delivered to The Hague,\" she wrote. \"It is the responsibility of the World Court to take appropriate action in accordance with the law.\"", "USA TODAY and Reuters found no evidence of such a trial in 2014.", "Based on our research, the claim that there's a warrant for Joe Biden's arrest is FALSE. The document circulating online came from a fake court with no authority to issue warrants or other legal documents.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more."]