["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Sen. Rand Paul, R-Ky., speaks during a visit to New Hampshire on Sept. 12, 2014.", "During a recent interview with NPR, Sen. Rand Paul, R-Ky., took aim at the belief -- widely held among Democrats -- that Republican policies are encouraging greater income inequality.", "\"I think inequality can be a problem, and interestingly seems to be getting a little bit worse under this administration,\" Paul said. \"Income inequality is worse in towns run by Democrat mayors than in towns run by Republican mayors.\" (Here’s the full transcript.)", "A reader asked us to check whether Paul’s claim about cities under Democratic and Republican mayors is correct. So we did.", "We located a study by the Brookings Institution released earlier this year that ranked the top 10 and bottom 10 cities by income inequality -- and there does appear to be something to what Paul said.", "Of the study’s 10 most unequal cities, nine have Democratic mayors. They are Atlanta, San Francisco, Boston, Washington, New York, Oakland, Chicago, Los Angeles, and Baltimore. Of the 10 most unequal cities, only Miami has a Republican mayor.", "By contrast, seven of the 10 most equal cities have Republican mayors -- Oklahoma City; Omaha, Neb.; Fort Worth, Texas; Colorado Springs, Colo.; Mesa, Ariz.; Arlington, Texas; and Virginia Beach, Va. The other three either have a nonpartisan mayor (Raleigh, N.C., and Las Vegas) or a Democrat (Wichita, Kan.).", "So on the numbers, Paul has a point. The question is, does this discovery mean anything? Experts we spoke to urged taking the claim with a grain of salt -- if not a whole shaker. Here are a few reasons why.", "Mayors aren’t all-powerful players in the local economy.", "Where claims of this sort are made, PolitiFact tries to establish whether credit or blame is deserved. In this case, then, is it reasonable to attribute patterns of inequality exclusively, or even primarily, to a mayor?", "No -- many factors play into a city’s economic success. The mayor of Detroit doesn’t have much power over the international market for automobiles, and no mayor of New York can take all the credit for the economic juggernaut of Wall Street. While mayoral policies may have an effect on the margins, such factors as the state and national business cycle, broad demographic patterns and international business trends tend to have a much greater impact on economic inequality in cities.", "In addition, it’s worth remembering that \"cities attract people on the basis of many factors, of which the party of their political leaders is probably a minor one,\" said William Frey, a senior fellow in Brookings’ Metropolitan Policy Program.", "Inequality patterns in cities may be at least as much about population size and geographic patterns as they are about partisan leadership.", "Focusing on the partisan differences obscures a more fundamental difference between the most and least unequal cities. The more unequal cities tend to be very big, and the less unequal cities tend to be more modestly sized.", "The median population of the 10 most unequal cities on the Brookings list is about 630,000, compared to about 430,000 for the most equal cities. (If you used the mean, rather than the median, the average population of the 10 most unequal cities would be even higher -- almost 1.9 million residents per city.) So it’s not exactly apples-to-apples if you compare the attributes of New York, Los Angeles and Chicago on the one hand with those of Colorado Springs, Virginia Beach and Arlington on the other.", "All other things being equal, larger cities tend to have a wider distribution of incomes on both extremes, since they have more residents. That, almost by definition, means larger ratios between the top and the bottom. In the meantime, big cities tend to attract more wealthy people -- i.e., people who can choose to live anywhere they want -- because megacities are likelier to have world-class amenities.", "\"The real wealth ‘peaks’ tend to be in the big cities, so they have high tops as well as lower bottoms, while the income profiles of smaller localities are typically more ‘compressed,’ \" said Jamie Peck, a professor of geography at the University of British Columbia who has studied urban and political patterns in the United States.", "How old a city is can matter, too, said Jed Kolko, the chief economist and vice president of analytics at the real estate website Trulia. In older cities many middle-income residents have relocated to the suburbs, leaving behind higher levels of inequality. By contrast, newer cities -- such as Mesa (which is near Phoenix) or Arlington (which is near Dallas) -- often contain many suburban areas or are, in effect, suburbs themselves, Kolko said. Such cities tend to have more modest income ranges.", "Why does all this matter? It undercuts the notion that partisan leadership has much to do with why certain cities become relatively unequal and certain become relatively equal.", "Causation may actually run the opposite way.", "It’s always important to remember that correlation does not necessarily mean causation. In this context, it’s not necessarily that Republican leadership creates greater equality, as Paul’s comment presumes. Rather, it could be that greater equality prompts people to vote Republican. Or it could be unrelated.", "\"I think it runs more in the direction that inequality provides conditions for Democratic success, rather than Democrats causing inequality,\" said Michael McDonald, a University of Florida political scientist who specializes in electoral patterns and geography. And any explanation other than political leadership causing greater equality weakens Paul’s point.", "The pattern holds only if you look at cities, not metropolitan areas.", "If you look at Kolko’s research -- which studied inequality in broader metropolitan areas, rather than in cities per se -- Paul’s pattern falls apart.", "Of the 10 metropolitan areas with the most equality, only one has a Republican mayor -- Colorado Springs. The other nine either have a Democratic mayor, a nonpartisan one, or no mayor at all because they’re an unincorporated area. This list includes Lakeland-Winter Haven, Fla.; Allentown, Pa.; Salt Lake City; Bethesda-Rockville-Frederick, Md., Tacoma, Wash.; Las Vegas; Cape Coral-Fort Myers, Fla.; Raleigh; and Palm Bay-Melbourne-Titusville, Fla.", "What Paul’s office says", "Brian Darling, a spokesman for Paul, cautioned that the senator was not simply casting aspersions on Democratic mayors’ handling of their cities’ economies. \"What he was saying is that Democrats are not solving the problem,\" Darling said. \"It may be an unsolvable problem. Democrats love to talk about the issue and have been allowed to position themselves as the warriors for those harmed by income inequality, yet they are not a party of action\" on this issue.", "That’s a reasonable point, but we think a typical listener hearing Paul’s comment would have assumed that he was arguing that Republican policies have promoted greater equality in cities than Democratic policies have. And as we’ve found, that’s far from clearcut.", "Our ruling", "Paul said that \"income inequality is worse in towns run by Democrat mayors than in towns run by Republican mayors.\"", "He has a point that one credible study shows a fairly strong correlation between low inequality and a Republican mayor. But experts say it’s a stretch to draw conclusions from this. The claim inflates the actual powers of mayors to shape inequality in their cities and it ignores the role of population size and suburbanization in driving inequality. It also glosses over the fact that metropolitan areas, as opposed to cities, show no such relationship.", "The claim is partially accurate but leaves out important details, so we rate it Half True.", "Rand Paul, interview with NPR, Sept. 11, 2014", "Brookings Institution, \"All Cities Are Not Created Unequal,\" Feb. 20, 2014", "Trulia, \"America’s Most Unequal Metros,\" March 12, 2014", "Email interview with William Frey, senior fellow in Brookings’ Metropolitan Policy Program, Sept. 15, 2014", "Email interview with Jamie Peck, professor of geography at the University of British Columbia, Sept. 15, 2014", "Email interview with Michael McDonald, University of Florida political scientist, Sept. 15, 2014", "Email interview with Jed Kolko, chief economist and vice president of analytics at Trulia, Sept. 15, 2014", "Email interview with Brian Darling, spokesman for Rand Paul, Sept. 15, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]