["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "When President Donald Trump referred to land seizures and \"large scale killings\" of white farmers in South Africa, he set the stage for a classic Twitter storm.", "Kenya-born photographer Joseph Muhatia tweeted, \"The land in South Africa belongs to black people they are the native owner and not white people.\"", "To which conservative pundit Ann Coulter replied, \"Actually, the Dutch (Afrikaners) were there first.\"", "Actually, the Dutch (Afrikaners) we’re there first. https://t.co/2VXiZcpFMx", "Pause a second.", "Coulter claimed Dutch settlers who started showing up around 1650 were in South Africa before black people. We tweeted her to learn what she had in mind and didn’t hear back.", "The history of Southern Africa long before the Europeans (and yes, there is a long before) is a fascinating tale of competing kingdoms, shifting alliances, and territorial disputes. We spent some time with two volumes published by UNESCO in 1992. Wars among the people labeled black today played out before and after the Europeans arrived. As it turns out, the Dutch dropped down in a fairly peaceful area.", "The Dutch East India Company established a toehold in Cape Town on the southwestern tip of modern South Africa. There, they encountered a group called the Khoikhoi who used the land to graze their cattle.", "From the start, the Dutch treated the land as theirs.", "On May 10, 1656, the outpost’s commander Jan van Riebeeck described his dealings with a Khoikhoi leader.", "\"His claim to the ownership of the Cape lands could not be entertained by the Company, which had taken possession of them for its own purposes,\" van Riebeeck wrote in his diary (Hat tip to our colleagues at Africa Check).", "Cape Town’s original purpose was simply to resupply merchant ships headed to the East Indies, but over the decades, settlers turned to farming, which put them in conflict with the original inhabitants. By the end of the 1700s, a series of wars broke out with the Xhosa, a larger and more formidable foe than the Khoikhoi. Ultimately, under the British, the Xhosa were defeated in 1853.", "Clearly, the story of South Africa turns on the Dutch and the British taking land from the people who were there first.", "There is perhaps one possible thought Coulter had.", "When South Africa operated under a strict regime of racial categories – the apartheid period between 1948 and 1994 – it used both \"colored\" and \"black\" to classify different groups of people. The Khoikhoi, relatively few in number, were classified as colored. In that regard, Coulter might have seen Muhatia’s reference to blacks as broad.", "But that would play along with the discredited credo of apartheid in racist South Africa. As the authors of a 2000 study of historic migration in Africa noted, \"the biological reality of the race concept is bankrupt; the genetic and/or physical variations of hundreds of millions of people cannot be subsumed under a single term.\"", "That said, focusing on the Khoikhoi would be excessively narrow because it ignores the conflict with the Xhosa. Under apartheid, people in the Xhosa ethnic group were classified as natives, or black, and restricted to communities called bantustans. The anti-apartheid leader and later president of South Africa Nelson Mandela was a member of a Xhosa clan. (Ethnic classification continues today. Groups called \"coloured\" under the old regime are now counted as \"black\" for economic empowerment and labor relations purposes.)", "Beyond the western areas of South Africa where the Dutch influence was greatest, other groups predated the colonizers by over 1,000 years. One analysis from an international group of archeologists found that farming by Bantu-speaking groups reached South Africa about 2,000 years ago. So Coulter’s focus on the Dutch ignored what was going on in the rest of the region.", "Coulter said that Dutch settlers were in South Africa before black people. This is plainly wrong.", "Bantu-speaking groups farmed in the eastern regions of modern South Africa perhaps as much as a millennium before the Dutch arrived. In the west where the Dutch settled, other indigenous group lived on the land that the Dutch then claimed.", "This claim defies logic and history. We rate it Pants on Fire.", "Ann Coulter, tweet, Aug. 23, 2018", "Joseph Muhatia, tweet, Aug. 23, 2018", "Jan van Riebeeck, Diary - 1656, accessed Aug. 24, 2018", "UNESCO, Africa from the 16th to the 18th Century, 1992", "Encyclopedia Britannica, Cape Frontier Wars, accessed Aug. 24, 2018", "PLOS One, Modelling the Spread of Farming in the Bantu-Speaking Regions of Africa: An Archaeology-Based Phylogeography, Jan. 31, 2014", "History in Africa, A New Paradigm: The African Early Iron Age without Bantu Migrations, 2000", "South Africa History Online, The Dutch Settlement, Feb. 13, 2018", "South Africa History Online, Khoisan Identity, May 10, 2017", "Africa Check, 98% of South African Airways’ spending didn’t go to white-owned companies, June 26, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]