["By Jessica McDonald", "Posted on January 31, 2020", "Numerous social media posts falsely suggest that because Clorox and Lysol products list “Human Coronavirus” on their bottles, the new coronavirus driving the outbreak in China was already known. It wasn’t. There are many human coronaviruses, and these products were tested against a strain that causes the common cold.", "In the wake of the expanding outbreak of a new coronavirus from China, people on social media are pointing to disinfecting product labels to falsely suggest that the new virus is not new.", "“So Lysol knew about this new strand of Coronavirus??” asks one Facebook post, which is accompanied by a photo with an arrow pointing to “Human Coronavirus” listed on a bottle of disinfectant spray.", "Another Facebook post highlights the words “Human Coronavirus” on a container of Lysol disinfecting wipes, and says, “the label of the popular Lysol already show that the product Kill the Coronavirus, so that means that this Virus is nothing new.”", "Other posts make similar claims about Clorox products, with one using the hashtag, #SoStrongItCanKillVirusesOfTheFuture.", "These posts are among several instances in which the generic use of the term “coronavirus” has led to confusion, with people on social media erroneously conflating mentions of already known coronavirus strains with the new one.", "The word “coronavirus” is not specific, and can apply to any virus in the coronavirus family. The name derives from the crown-like look of the viruses under a microscope.", "It turns out that it’s likely these products would be effective against the new virus, which is known as 2019 novel coronavirus, or 2019-nCoV. But that’s not because either company had any previous knowledge of the virus.", "As we have written before, the outbreak began in Wuhan, a city in central China, with the first known cases identified in early December, many of them linked to a seafood market selling a wide selection of game meats and wild animals.", "The Chinese government informed the World Health Organization about the outbreak on Dec. 31, and within a week had ruled out other viruses, including other coronaviruses, and isolated the new virus. Researchers have preliminarily found that 2019-nCoV is about 80% similar to the severe acute respiratory syndrome, or SARS, virus, and is 96% similar to a bat virus.", "Scientists who have analyzed the viral sequences from infected patients in other countries, too, have found that the sequences are very similar to the first Chinese sequences, corroborating the idea that the virus only recently emerged, and is new to science.", "In terms of the disinfectants, testing is required for manufacturers to make claims about their products. Documents submitted to the Environmental Protection Agency show that Clorox and Lysol sprays and wipes are able to list “Human Coronavirus” on their labels because those products were tested against human coronavirus 229E.", "The 229E strain is a common human coronavirus, the Centers for Disease Control and Prevention explains, that usually causes “mild to moderate upper-respiratory tract illnesses, like the common cold.” It is not the same as the coronavirus responsible for the current outbreak that began in Wuhan. In fact, it’s in an entirely different genus of coronaviruses.", "Although the posts misinterpret the inclusion of “Human Coronavirus” on these labels, the idea that these products might be helpful against the new virus isn’t so off-base. While it’s impossible to know for sure, since none of the products have been tested against 2019-nCoV, the chances are high. For one, these products are considered to be effective against SARS — even if it’s not featured on the label — and the new virus is quite similar.", "Even more important, the EPA has a guidance policy that allows companies to claim their products are effective against certain emerging viral pathogens, as long as they can show the products work on other, harder-to-kill viruses. An EPA spokesperson told us in an email that this would not allow a company to put the claim on its label, but would allow companies to add it to technical literature sent to hospitals, as well as to websites, consumer information services and social media sites.", "“The goal of the policy is to allow for rapid response in the event of an emerging viral pathogen outbreak,” the spokesperson added, noting that the Wuhan coronavirus outbreak is the first time the criteria have been met to trigger the policy.", "The policy is based on a classification model of viruses, since different types of viruses are generally harder to kill than others. The easiest viruses to disinfect are the ones with a viral envelope, or membrane, that wraps around the virus. While it sounds protective, these membranes are made up of fatty lipid molecules that are easy to disrupt. As the EPA policy explains, “once the lipid envelope is damaged, the integrity of the virus is compromised, thereby neutralizing its infectivity.” Viruses without envelopes are harder to kill, and those that are small and nonenveloped are harder still.", "Fortunately, coronaviruses fall into the enveloped category. Because they do, as long as a product is effective against one nonenveloped virus, then it’s assumed that the product would work against 2019-nCoV, too.", "Clorox wipes, for example, work against rotavirus, a large, nonenveloped virus in the Reoviridae family, so the product qualifies as a 2019-nCoV-effective disinfectant.", "Users, however, should note that there are different contact times for different pathogens, and in the case of Clorox wipes, 4 minutes are needed for rotavirus — and therefore also for 2019-nCoV. Common cold coronaviruses, by contrast, require only 15 seconds of contact.", "Both Clorox and Lysol have set up FAQ pages about coronavirus, noting that they have tested products against viruses “similar” to 2019-nCoV, and some meet the requirements set out under the EPA policy, and therefore can be used by those concerned about 2019-nCoV.", "We reached out to Lysol’s parent company, Reckitt Benckiser, and Clorox but did not receive a reply.", "While the risk of 2019-nCoV is low for most Americans, keeping surfaces clean is one of the ways that the CDC recommends people can prevent infection. Other important methods are washing your hands with soap and water — or with a sanitizer if soap is unavailable — as well as avoiding contact with others who are sick.", "McDonald, Jessica. “Q&A on the Wuhan Coronavirus.” FactCheck.org. 30 Jan 2020.", "2019 Novel Coronavirus, Wuhan, China. CDC. Accessed 31 Jan 2020.", "Coronavirus. CDC. Accessed 31 Jan 2020.", "Zhou, Peng et. al. “Discovery of a novel coronavirus associated with the recent pneumonia outbreak in humans and its potential bat origin.” bioRxiv. 23 Jan 2020.", "Andersen, Kristian. “Clock and TMRCA based on 27 genomes.” Virological.org. 26 Jan 2020.", "Yeager, Curtis L. et. al. “Human aminopeptidase N is a receptor for human coronavirus 229E.” Nature. 357, 420–422(1992).", "“Coronavirus Cases Trigger EPA Rapid Response.” Press release. EPA. 29 Jan 2020.", "“Emerging Viral Pathogen Guidance for Antimicrobial Pesticides.” EPA. Accessed 31 Jan 2020.", "Pesticide Product and Label System. EPA. Registration numbers 5813-79, 777-99 and 777-114. Accessed 31 Jan 2020.", "“Coronavirus.” Lysol.com. Accessed 31 Jan 2020.", "“Help Prevent the Spread of the Human Novel Coronavirus (2019-nCoV).” Clorox.com. Accessed 31 Jan 2020.", "EPA spokesperson. Email sent to FactCheck.org. 31 Jan 2020.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]