["About this rating", "On 11 February 2015, a quote attributed to South Carolina state Senator Thomas (Tom) Corbin began to circulate on social media sites. According to the rumor, Corbin compared women to a \"lesser cut of meat\" during remarks made to a fellow state senator:", "The rumor originated on a small, local political blog called FITSNews.  The initial account appeared to contain the typical hallmarks of a hoax -- no date for the purported dinner was provided, and the source for the claim was unnamed \"multiple witnesses\":", "Corbin's comments — made at a legislative dinner held in downtown Columbia, S.C. — were reportedly directed at S.C. Senator Katrina Shealy, the only female member of the 46-person State Senate.", "According to multiple witnesses who attended the dinner — held at Cowboy Brazilian Steakhouse on Main Street (a few blocks from the S.C. State House) — Senate judiciary committee members were discussing the CDV issue, which has been a source of several previous headaches for the GOP.", "By way of explanation, lawmakers and legislative staffers have previously told FITS about statements made by Corbin — statements reflecting his belief that women do not belong in the S.C. General Assembly and should instead be \"at home baking cookies\" or \"barefoot and pregnant.\"", "At one point in the conversation — which quickly escalated into a confrontation — Shealy is said to have angrily asked Corbin where he \"got off\" attacking women.", "\"Well, you know God created man first,\" Corbin said, reportedly smirking at Shealy.  \"Then he took the rib out of man to make woman.  And you know, a rib is a lesser cut of meat.\"", "However, a few days later Senator Katrina Shealy posted to Facebook to Facebook to confirm and address the controversial claims, asserting that Corbin had made the remark in question but that he considered it in the nature of a \"joke\":", "My statement on \"Lesser Cut of Meat Story\":", "\"I have proven that women can effectively serve in the Legislature, and one of my colleagues has proven capable of talking like an idiot.\"", "I will agree that Senator Corbin may feel that this is an ongoing joke between the two of us, but he is well aware that I don't think it is funny. I have asked several times for him to discontinue these type of comments. I am the lone female in the South Carolina Senate and because of that very reason I do not want it to come across that I am weak or whining, so I have repeatedly tried to deal with him myself. In Senator Corbin's defense, maybe it is a joke to him; but, if you do something over and over again, you must really believe it. It is not a joke with me or with the thousands of other women and girls across this state and country who deserve respect. We are mothers, sisters and daughters. We are homemakers, school teachers, lawyers, judges, businesswomen and - yes, even State Senators who deserve every bit as much respect as any father, brother, son or any male who holds the same position as any female. Can I sit by; sweep this under the rug; and say, \"it's okay\"? Sure, I could do that; but not this time! Do not get me wrong; the majority of my colleagues treat me with the utmost respect and with no difference of any of my male counterparts, as it should be. I do not want or expect special treatment. All I ask for is to be treated equally and with respect!", "Corbin also commented on the controversy and claimed he and Shealy had joked with one another in a similar fashion in the past:", "\"We were all joking and laughing,\" said Corbin. \"We cut up together.\"", "Corbin said he can't recall her ever [asking him to stop joking before], adding that she's teased him about being overweight and bald.", "\"If it bothers her, I'll quit joking around with her,\" he said.", "Both agreed the exchange occurred after they disagreed on the gun provision of legislation aimed at curbing domestic violence. That provision seeks to prevent abusers from having easy access to guns. South Carolina has long ranked among the worst nationwide in violence against women, and most domestic violence deaths involve guns.", "Corbin and Shealy agreed on the content of the controversial exchange, but not on whether the remarks were part of ongoing mutual ribbing of a genial nature.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]