["Are these boxes more likely to be moving to Wisconsin or moving out of Wisconsin?", "Mary Burke’s 40-page jobs plan not only lays out what she would do as governor, it critiques the policies of Gov. Scott Walker, whom she hopes to defeat in the November 2014 election.", "\"Wisconsin needs government to work with business to train and educate tomorrow’s workers, to build the infrastructure and attract the capital necessary to grow business activity, and to make the investments in communities and quality-of-life that make businesses and workers alike want to call a place ‘home,’\" Burke wrote.", "\"We’re clearly not doing that now.\"", "The plan, released March 25, 2014, then cites three statistics, including this one:", "\"Wisconsin now ranks among the top 10 states for out-migration.\"", "We have had some rough winters.", "Are that many people leaving?", "A moving study", "In making the migration claim, the jobs report refers to the 2012 version of an annual study done by United Van Lines, the national moving company.", "Two problems here:", "-- The 2012 version isn’t the latest.", "-- United Van Lines tracks only household moves within the 48 contiguous states that are made by its customers.", "So, at best, the study is an indicator of state-to-state movement, and only by those who used one particular company. Yet Burke cites it as an authoritative document.", "In the mover's 2012 study, Wisconsin was among 10 states labeled \"high outbound\" -- meaning, 55 percent or more of the moves handled by United Van Lines in Wisconsin were for people leaving Wisconsin.", "But in the 2013 study, released nearly three months before Burke issued her jobs report, only nine states were labeled high outbound and Wisconsin was not one of them.", "Wisconsin was among 31 states labeled as \"balanced\" -- that is, the difference between the number of United Van Lines customers moving into and out of Wisconsin was negligible.", "So, Burke cites outdated data from a source that is not comprehensive.", "But outmigration is something that is tracked by the U.S. Census Bureau. Is it possible she’s still right?", "Census, tax data", "The Census Bureau counts state-to-state migration in two ways.", "Estimates based on census counts, tax returns and Medicare enrollment are cited by leading demographers such as William Frey of the Brookings Institution, a nonpartisan policy research group, and Robert Scardamalia, former chief demographer for the State of New York.", "The latest one-year figures -- for July 1, 2012 to July 1, 2013 -- show Wisconsin ranked 12th in terms of states that suffered a net loss of residents to other states:", "State", "State-to-state net domestic migration", "1. New York", "-104,470", "2. Illinois", "- 67,313", "3. California", "- 49,259", "4. New Jersey", "- 45,035", "5. Pennsylvania", "- 30,718", "6. Michigan", "- 28,539", "7. Ohio", "- 23,094", "8. Connecticut", "-17,224", "9. Kansas", "-12,557", "10. New Mexico", "-10,526", "11. Maryland", "- 8,525", "12. Wisconsin", "- 8,158", "(Expressed another way that accounts for differences in population among the states, Wisconsin ranks a little further from the top 10 -- 15th -- losing 1.4 people per 1,000 to state-to-state moves.)", "So, Burke’s top-10 claim is off, though not by much.", "Indeed, Wisconsin makes the top 10 if you consider a slightly longer period of time.", "Another set of the census- and tax return-based data covers April 1, 2010 to July 1, 2013 -- a period that includes the 10 months before Walker took office.", "For the longer period, Wisconsin ranked 10th, with a net loss of more than 28,000 people to other states.", "Survey data", "Another way the Census Bureau measures migration is through a survey in which residents are asked whether they lived in the same residence one year ago. Joseph Henchman of the Tax Foundation, which tracks out-migration, favors the survey data.", "The latest survey data indicate that Wisconsin actually posted positive net migration from 2011 to 2012. The estimate is 99,192 people moved into Wisconsin and 97,724 moved out, for a net gain of 1,468.", "However, like other surveys, this one has a margin of error. In this case, the margin of error means that Wisconsin could have actually posted a slightly larger net gain, or even a small net loss.", "Regardless, the survey figures don't support Burke’s claim.", "Our rating", "Burke said: \"Wisconsin now ranks among the top 10 states for out-migration.\"", "Her statement contains an element of truth. In one census estimate, Wisconsin ranked 10th in terms of a net loss of residents from state-to-state migration from roughly 2010 to 2013.", "But the latest one-year census estimate shows Wisconsin ranked 12th in raw numbers, 15th on a percentage basis.", "Also, a one-year measure based on a census survey indicates Wisconsin actually gained more residents than it lost through people moving from one state to another.", "Given that Burke’s claim emphasized where Wisconsin ranks now, it goes too far. We rate it Mostly False.", "Follow us on Twitter and Facebook.", "Mary Burke, jobs plan, March 25, 2014", "Email interview, Mary Burke campaign communications director Joe Zepecki, March 25, 2014", "Email interview, Scott Walker campaign spokeswoman Alleigh Marre, March 25, 2014", "United Van Lines, 2013 migration study, Jan. 2, 2014", "United Van Lines, 2012 migration study, Jan. 2, 2013", "PolitiFact National, \"Are Americans flocking to low-tax states,\" April 9, 2013", "PolitiFact Rhode Island, \"Ocean State Policy Research Institute says Rhode Island’s estate tax is the most significant reason people leave the state,\" Feb. 13, 2011", "U.S. Census Bureau, \"Geographical mobility: 2012 to 2013,\"  Jan. 16, 2014", "Wisconsin Demographic Services Center, \"Official final estimates, 2013,\" Oct. 10, 2013", "Tax Foundation, \"State to state migration data\"", "Interview and email interview, RLS Demographics president Robert Scardamalia, March 26 and 27, 2014", "Interview, University of Wisconsin-Madison Applied Population Laboratory demographer David Egan-Robertson, March 27, 2014", "Email interview, Tax Foundation legal and state projects Vice President Joseph D. Henchman, March 26, 2014", "Wisconsin Taxpayers Alliance, \"Moving To and From Wisconsin,\" January 2012", "Interview, Wisconsin Taxpayers Alliance research director Dale Knapp, March 27, 2014", "U.S. Census Bureau, population changes from April 1, 2010 to July 1, 2013, and from July 1, 2012 to July 1, 2013", "Email interview, Brookings Institution demographer and senior fellow William Frey, March 27, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]