["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Thousands of laws could put you in jail, such as this one from the famous Area 51 military installation in Nevada (via Flickr Creative Commons)", "Conventional wisdom would tell us that most normal folks will never have an interaction with police like the one Eric Garner had that ultimately led to his death. Yale Law School professor Stephen Carter warned that might not necessarily be the case.", "Citing the work of Rutgers University law scholar Douglas Husak, Carter wrote on Dec. 4 that \"70 percent of American adults have committed a crime that could lead to imprisonment.\" Carter noted that’s in part because there are 300,000 or more federal regulations that may be enforceable through criminal punishment.", "It's as though, Carter said, lawmakers tack on imprisonment to give a law heft. To paraphrase the old line, we are not just a nation of laws, we are a nation overrun by laws. Carter suggests reigning things in.", "The fact that 70 percent of people have committed a jailable offense is part of Carter's evidence. We wanted to know if other legal experts thought it was correct.", "They do.", "Before we get to their reasons, let’s be clear about what Carter and Husak are saying. By the way, Husak told us that Carter quoted him accurately.", "For Husak, the question wasn’t whether any court would be likely to put someone behind bars for a particular offense, but whether the law gives them the power to do so. Husak said one need look no further than the laws on prescription drugs. If a doctor gave you a prescription for the common painkiller vicodin and your spouse brings it to you as you lie in bed, \"your spouse is dispensing a controlled substance without a license,\" Husak said.", "Would that ever be enforced? Not likely. But Husak said that is how the law is written.", "If that were not enough to get to 70 percent of adults, Husak factored in illicit drug use. According to a 2012 survey by the Substance Abuse and Mental Health Services Administration, over half of the people in every age group born after 1950 said they had used an illicit drug at some time in their lives, primarily marijuana or prescription drugs. That alone comes to about 84 million people, or 37 percent of all people over 20.", "While some legal experts we reached said they didn’t know how you could come up with an exact number, just about all said it would be no trouble to keep adding more.", "Sonja Starr at the University of Michigan Law School said many people drink and drive.", "\"The Centers for Disease Control found 112 million self-reported incidences of drunk driving,\" Starr said, with the caveat that some drivers would report multiple offences. \"And that’s just in a single year.\"", "Starr said you could easily get to the 70 percent mark.", "By and large, Starr’s counterparts at other law schools agreed.", "Bennett Capers, professor of law, Brooklyn Law School", "\"This doesn't give me pause at all. There are thousands of criminal statutes on the books, criminalizing things that some of us do without thinking. This runs the gamut from the serious (in New Jersey, it is technically a crime to have sex without first receiving \"freely given affirmative permission to the specific act of sexual penetration\") to the routine (fudging tax returns) to the mundane (illegal downloads).\"", "David Gray, professor of law, University of Maryland School of Law", "\"70 percent seems low to me. Once you factor in illegal drug use, crimes of recklessness (which seldom are detected because no harm accrues), downloading, DUI, failures to report income, and the scores of relatively innocuous offenses that just happen to carry the possibility of jail time in some jurisdictions, I’d be surprised if the percentage wasn’t much higher than 70 percent over the course of most adults’ lifetimes.\"", "Jeffrey Fagan, professor of law and public health, Columbia Law School", "Fagan said he didn’t know the right percentage, but he could believe the 70 percent figure. \"I’ve violated imprisonable offenses while fishing,\" Fagan said.", "Robert Weisberg, professor of law, Stanford Law School", "\"The number is unknowable, but it strikes me as plausible.\"", "Laurie Levenson, professor of law at Loyola Law School Los Angeles", "\"It does seem to exaggerate the likely number of Americans who are at actual risk of prosecution and imprisonment,\" Levenson said. \"What we really need to pay attention to is the percent of Americans who commit crimes that are on the prosecutors' radar screens.\"", "Levenson’s point gets at a key ambiguity in Carter’s statement. Much depends on the interpretation of \"could lead to imprisonment.\" In his article, Carter made it clear he did not mean that imprisonment was in any way likely. His point was simply that too many laws carry too hefty a penalty and in theory, anyone could become ensnared.", "Our ruling", "Carter said that more than 70 percent of American adults have committed a crime that could lead to imprisonment. Based on a strictly technical reading of existing laws, the consensus among the legal experts we reached is that the number is reasonable. Way more than a majority of Americans have done something in their lives that runs afoul of some law that includes jail or prison time as a potential punishment.", "That said, experts acknowledged that the likelihood of arrest, prosecution or imprisonment is exceedingly low for many of Americans’ \"crimes.\"", "As such, we rate the claim Mostly True.", "Bloomberg News, Law Puts Us All in Same Danger as Eric Garner, Dec. 4, 2014", "Substance Abuse and Mental Health Services Administration, Results from the 2012 National Survey on Drug Use and Health: Summary of National Findings, September 2013", "Photo, Flicker Creative Commons", "Email interview, Douglas Husak, professor of philosophy, Rutgers University, Dec. 5, 2014", "Interview, Sonja Starr, professor of law, University of Michigan Law School, Dec. 5, 2014", "Email interview, David Gray, professor of law, University of Maryland School of Law, Dec. 5, 2014", "Email interview, Bennett Capers, professor of law, Brooklyn Law School, Dec. 5, 2014", "Email interview, Robert Weisberg, professor of law, Stanford Law School, Co-Director, Stanford Criminal Justice Center, Dec. 5, 2014", "Email interview, Laurie Levenson, professor of law, Loyola Law School Los Angeles, Dec. 5, 2014", "Email interview, Jeffrey Fagan, professor of law and public health, Columbia Law School, Dec. 5, 2014", "Email interview, Deborah Denno, professor of law, Fordham University School of Law, Dec. 5, 2014", "Email interview, Sara Sun Beale, professor of law, Duke University School of Law, Dec. 5, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]