["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Rep. Marsha Blackburn, R-Tenn., speaks during the final day of the Republican National Convention in Cleveland, Thursday, July 21, 2016. (AP Photo/J. Scott Applewhite)", "U.S. Rep. Marsha Blackburn, R-Tenn., opined in a Fox News post that sanctuary cities threaten public safety and that their policies are lawless. She also linked a decline in Phoenix’s murder rate to the city’s abandonment of a sanctuary policy.", "\"Sanctuary cities endanger their citizens,\" Blackburn wrote in a Nov. 9 opinion piece. \"When Phoenix dropped its sanctuary city policy in 2008, its murder rate fell 27 percent the following year, and other violent crime rates also fell.\"", "So-called sanctuary cities are jurisdictions that limit their cooperation with immigration authorities, and the extent of their limitations vary widely. President Donald Trump has promised to cut their federal funding, a move supported by Blackburn.", "We wanted to know if Blackburn was accurate in her claim that Phoenix’ murder rate dropped 27 percent after the city abandoned a sanctuary policy. We did find a decline in the murder rate, but the extent attributable to a policy change is questionable.", "There’s no widely accepted legal definition for \"sanctuary cities,\" but the term is generally applied to jurisdictions that claim that immigration enforcement is a federal responsibility, not a local one. They argue that reporting individuals to immigration officials can undermine communities’ trust in law enforcement officers.", "Phoenix officials pushed back on the premise that the city ever had sanctuary policies.", "\"The city has never been a ‘sanctuary city’. We consistently comply with federal and state immigration requirements,\" said Tammy Vo, spokeswoman for the City of Phoenix.", "Phoenix Police Department Spokesman Sgt. Jonathan Howard also told PolitiFact they’ve \"never had a policy that made us a sanctuary city.\"", "Blackburn did not return repeated requests for information for this fact check.", "But we found that some groups considered Phoenix a sanctuary city based on a police department policy up to 2008.", "Judicial Watch, a conservative group that litigates on public corruption and other issues, in May 2008 issued a statement saying the Phoenix police chief was making changes to a policy which the group said \"prohibited police officers from inquiring about the immigration status of individuals and from cooperating with federal immigration officials.\"", "The Center for Immigration Studies, which favors low immigration, in August 2010 also said that until 2008, \"Phoenix was considered by many to be a sanctuary for illegal aliens.\"", "A 2010 report from Police Executive Research Forum said a policy prohibiting Phoenix officers from contacting immigration officials was interpreted by some as providing a \"sanctuary city\" for undocumented immigrants. That policy came under scrutiny after a police officer was shot and killed in September 2007 by an immigrant in the country illegally, the report said.", "A revised policy implemented in May 2008 required officers to question everyone arrested about their citizenship; allowed officers to contact federal authorities (after supervisory approval) when they suspected an arrestee was in the country illegally; and required records of all contacts with ICE, the report said.", "While we did not hear back from Blackburn’s office, we found similarities between her claim and a June 2017 Fox News report, headlined, \"Crime drops in Phoenix after city drops sanctuary city status, former cops say.\"", "Fox News cited City-Data.com, saying its numbers showed that \"from 2008 to 2009 Phoenix's murder rate fell 27 percent.\"", "City-Data.com’s figures appear to stem from FBI Uniform Crime Reporting data on murder and nonnegligent manslaughter.", "But experts cautioned against assuming that a change in one policy is the sole cause of a murder rate decline.", "\"In terms of Phoenix (and other major metro areas around the country — both ‘sanctuary’ and ‘non-sanctuary’), crime rates, including homicide, actually began falling well before before 2008 and have generally continued to drop since,\" said Daniel E. Martínez, an assistant professor in the School of Sociology at the University of Arizona. \"The supposed relationship that Blackburn is citing is likely due to several other factors beyond these policies.\"", "Without a proper study analyzing Phoenix’s murder rates years before and after a policy and how it compares to similar cities, claims that one policy change drove down the murder rate are suspicious, said Charis E. Kubrin, a professor in the department of criminology, law and society at the University of California, Irvine.", "Other possible changes in Phoenix, such as better policing, and whether Phoenix’s murder rate decline was consistent with nationwide trends are also important to consider, experts said.", "\"When one event occurs before another, statisticians say that shows correlation but not necessarily causation. I would be very skeptical of the causation claim, even if it turns out that Phoenix had a sanctuary policy that it rescinded in 2008,\" said Huyen Pham, a law professor at Texas A&M University School of Law. \"You would need a much more rigorous study, including study of other factors that may have caused the drop.\"", "According to City-Data.com, cited by Fox News, the murder rate in Phoenix dropped 10 percent from 2006 to 2007, and about 24 percent from 2007 to 2008.", "It’s also worth noting that the policy change in Phoenix happened in May 2008, so there were a few months in that calendar year under the former policy. From 2009 to 2010, the Phoenix murder rate did not change; it increased about 4 percent from 2010 to 2011, according to City-Data.com’s figures.", "A review article by Martinez and two other colleagues notes they are only aware of four empirical studies systematically examining the relationship between limited cooperation policies and crime. \"None of the studies support the claim that 'sanctuaries' are more crime‐prone than non‐sanctuaries,\" their paper said.", "Blackburn wrote, \"When Phoenix dropped its sanctuary city policy in 2008, its murder rate fell 27 percent the following year.\"", "While the murder rate did decline, experts say the change is likely attributable to many factors, not just a single policy change. Phoenix officials claim the city has never been a \"sanctuary city,\" but some groups pegged the city as such based on a policy in place up to 2008.", "We rate Blackburn’s claim Half True.", "Fox News, Rep. Marsha Blackburn: To save lives and money, we must cut off federal funding for sanctuary cities, Nov. 9, 2017", "City-Data.com, Crime rate in Phoenix, Arizona (AZ): murders, rapes, robberies, assaults, burglaries, thefts, auto thefts, arson, law enforcement employees, police officers, crime map", "PolitiFact, Trump-O-Meter: Cancel all funding of sanctuary cities, last updated June 29, 2017", "Email and phone interview, Phoenix Police Department Spokesman Sgt. Jonathan Howard, Nov. 14-2016", "Email interview, Tammy Vo, spokeswoman for the city of Phoenix, Nov. 15-16, 2017", "Marketwired.com, Judicial Watch Statement Regarding Phoenix Police Department's Reversal of Illegal Alien Sanctuary Policy, May 28, 2008", "Center for Immigration Studies, From Sanctuary to Safer City, Aug. 31, 2010", "Police Executive Research Forum, Police and Immigration: How Chiefs Are Leading their Communities through the Challenges, 2010", "CBS News, Spade Donates To Slain Officer's Family, Oct. 9, 2007", "Tucson.com, Man who killed Phoenix officer had been deported, Sept. 19, 2007", "Fox News, Crime drops in Phoenix after city drops sanctuary city status, former cops say, June 30, 2017", "FBI Uniform Crime Reporting, 2008, 2009 data", "Email interview, Daniel E. Martínez, assistant professor in the School of Sociology at the University of Arizona, Nov. 15, 2017", "Phone interview, Charis Kubrin, professor in the department of criminology, law and society", "At the University of California, Irvine, Nov. 15 2017", "Wiley Online Library, Providing Sanctuary or Fostering Crime? A Review of the Research on \"Sanctuary Cities\" and Crime​, Nov. 7, 2017", "Email interview, Huyen Pham, law professor at Texas A&M University School of Law, Nov. 15, 2017", "Email interview, Cecilia Menjívar, Foundation Distinguished Professor, Co-Director, Center for Migration Research Department of Sociology at University of Kansas, Nov. 14, 2017", "Email interview, Bill Hing, professor of law at the University of San Francisco School of Law, Nov. 14, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]