["About this rating", "Acquaintances of the Super Bowl streaker reportedly placed several small wagers with online sporstbook Bovada that there would be a fan on the field during the game. Bovada voided these bets as they violated their terms of service.", "The Super Bowl streaker did not make a $50,000 wager and did not win $374,000.", "On Feb. 7, 2021, as the Tampa Bay Buccaneers and the Kansas City Chiefs faced off during Super Bowl LV, a man wearing a pink bathing suit \"streaked\" across the field in order to promote an adult website. Shortly afterward, a rumor started circulating that the 31-year-old, Yuri Andrade, had a second motive: To win $375,000 on a $50,000 prop bet he had placed before the game:", "There's little evidence to support this claim.", "This rumor appears to have originated with an Instagram post from Sideline Daily. The sports-centric social media account shared a picture of Andrade at a restaurant and wrote that the Super Bowl streaker had told him that he had placed a $50,000 prop bet that someone would streak during the game. In the fourth quarter, when the game thus far had been streak-less, Andrade took matters into his own hands:", "We have some doubts about this claim, to say the least.", "For starters, a streaker, by definition, is a person who runs naked through a public space. As seen in the meme above, Andrade was not naked when he ran across the football field. While social media posts and news articles might use \"streaker\" to describe Andrade, we doubt that a bookie backing a $50,000 bet would let this sort of technicality slide, especially when the gambler is attempting to game the system.", "Furthermore, it's unlikely that Andrade would have been able to gamble such a large sum of money on a prop bet (or novelty bet.) Pat Everson, a senior writer for the gambling website Covers, doubted someone would take a $50,000 bet on something like this:", "A lot of hullaballoo today about the #SuperBowl streaker purportedly making a $50K bet at +750 that there would be a streaker during the game.", "Per a global-market sportsbook spokesperson:", "\"No book in their right mind would take $50K limits on that. Nowhere close.\"", "Kelly Stewart, another reporter who covers the gambling beat under the handle @KellyInVegas, also noted that there was no chance someone would be allowed to make a $50,000 prop bet. Stewart said that it can be difficult to get a $200 prop bet, let alone one at $50,000:", "If Andrade couldn't place a $50,000 bet himself, what if he got hundreds of people to place smaller bets? Stewart threw cold water on that claim, too:", "Look at the anthem prop. Can bet couple hundo here and there. Gets bet up huge on Friday after the rehearsal. Books take it down. You actually think if there were 500 guys all betting $100 the streaker prop at the same time the book wouldn’t take it down. LOL", "On Feb. 10, 2021, Front Office Sports reported that there was a small grain of truth to this claim. While Andrade did not make a $50,000 prop bet and he did not win $375,000, some of his acquaintances did make a number of smaller wagers that with the online sportsbook Bovada.", "Bovada said that it was voiding all bets from people who had forehand knowledge of Andrade's stunt and that it was refunding bets to those who bet that there would not be a streaker during the game.", "A Bovada spokesperson told FOS:", "“Our players have always trusted us to ensure the integrity of all props offered in our sportsbook ... We will continue to make sure that any publicity stunts or ill-intended behavior cannot adversely affect the outcome of a player’s wager.”", "Updated [16 February 2021]: Changed status from Unproven to Mostly False. Included additional reporting from Front Office Sports.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]