["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "In a TV ad that rips Democrat Mary Burke for copying parts of her economic plan, a key ally of Gov. Scott Walker couldn’t resist an extra jab on jobs.", "In the spot sponsored by the Republican Governors Association, which began running Sept. 23, 2014, the narrator points to Wisconsin job losses during the Great Recession.", "\"The truth is Burke’s record is one of failure and job loss, with plagiarism to cover it up,\" the narrator says. \"Don’t go backwards with Mary Burke.\"", "As the words are spoken, this message fills the screen:", "\"Burke’s record: 130,000 fewer jobs.\"", "It’s a familiar figure to us -- and probably to most voters by now.", "On the campaign trail, Walker has repeatedly juxtaposed the 100,000-plus jobs added during his first term with the total job loss in the last term under his Democratic predecessor, Jim Doyle, who left office after 2010.", "Burke served as commerce secretary under Doyle for about three years.", "In an earlier factcheck of a Walker claim that Doyle’s policies in his last term \"saw the state lose more than 133,000 jobs,\" we found the number to be accurate -- Doyle’s second term saw a drop of 133,943 jobs.", "But the claim was far off on the blame game. As such, we rated the claim Mostly False.", "Economists agreed that Wisconsin’s economy was caught in the same economic crash that crippled the entire country. The recession was deeper and more severe than any single state’s policies, including those of Doyle. And, notably, Wisconsin actually fared somewhat better than the rest of the country.", "But there are even bigger problems with the RGA taking a figure for Doyle’s last term and applying it to Burke.", "Her time as head of Commerce spanned parts of both Doyle’s terms, and she only served for 10 months of the four-year term the RGA associates with the 130,000 job loss.", "Indeed, she wasn’t even around when the job losses started coming.", "Burke started in February 2005 and left in November 2007 -- shortly before the downturn. Nationally, the Great Recession began in December 2007, but Wisconsin didn’t see a decline in quarterly jobs figures until mid 2008.", "The state saw jobs turnaround in 2010, the last year Doyle was in office, and annual growth has continued under Walker.", "Burke’s time at Commerce", "So, what happened with jobs while Burke was at the helm of Commerce?", "Statistics show Wisconsin added between 43,500 and 59,100 private-sector positions during Burke’s time in state government, depending on which federal data source is analyzed.", "To be sure, a governor’s policies have limited impact on increases or decreases in jobs, given the many factors that drive a state’s economy. And, as we have noted previously, a Commerce secretary’s influence would be even smaller.", "But even if all that were set aside, and the RGA is right to attach all of Doyle’s second-term numbers to Burke, what about the other side of the coin? After all, she also served during Doyle’s first term. Shouldn’t those be included as well?", "The state gained 86,530 jobs in Doyle’s first term from 2003 through 2006, so when combined with the losses of the second term, the final score for Doyle’s eight years was a  loss of 47,000 jobs.", "Not good. But also not 130,000.", "Our rating", "The Republican Governors Association said Mary Burke’s record is one of \"130,000 fewer jobs.\"", "But that number corresponds to Doyle’s second term, not Burke’s time as head of Commerce -- a period that saw an increase. Even with the most charitable of possible interpretations, the number is wrong.", "We rate the claim False", "(Read our tipsheet on five things to watch for when you hear jobs claims)", "RGA Wisconsin \"Plagiarism\" ad, published on YouTube, Sept. 23, 2014", "Bureau of Labor Statistics for quarterly and monthly job creation statistics", "Walk-O-Meter, 250,000 new jobs promise", "PolitiFact Wisconsin, \"Gov. Scott Walker says the policies of Gov. Jim Doyle cost the state 133,000 jobs,\" Sept. 18, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]