["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "The Georgia Farm Bureau claims agriculture contributes $71 billion into the state economy every year", "The new year brings with it a new legislative session and updated annual figures on agriculture statistics such as the average yield of, say, peanut farms.", "Those two factors combine in the budget process, when state lawmakers make policy decisions based, in part, by who is affected by their decisions.", "An alert reader had that process in mind when asking PolitiFact Georgia to check an oft-repeated claim by the Georgia Farm Bureau and politicians: Agriculture is the Peach State’s top industry.", "How big? The headline on a Georgia Farm Bureau web page touts, \"Georgia Agriculture – The state’s $71 billion industry.\"", "A bullet point underneath is a bit more nuanced. \"Agriculture contributes more than $71.1 billion annually to Georgia's economy,\" it reads.", "The distinction matters, as we’ll get to in a minute.", "But before we get into semantics, we have to delve into some economics.", "We contacted the farm bureau, which directed us to the 2013 Ag Snapshot published by the Center for Agribusiness and Economic Development at the University of Georgia.", "The center conducts an annual survey which allows farmers to report acreage, yield, crop price and other details.", "The 2013 report – which looks at 82 commodities using 2011 data – concludes the direct economic value of agriculture is $13 billion.", "Two pages later, it concludes that direct value, combined with the values along the supply chain from fertilizer and seed to first-line processing plants, \"generated a total economic impact of $71.1 billion\" for Georgia.", "How?", "Center officials told us they add to the the $13 billion what the actual economic value (using federal data compiled by a private firm) of the businesses along the ag supply chain. In 2011, the tally was $44 billion.", "It then induces a multiplier, adding in what workers in all of those jobs spend on daily living, to arrive at the $71 billion figure.", "\"We are looking at the contribution of all the sectors related to agriculture,\" said center economist Sharon Kane. \"It’s so much more meaningful to report the overall impact.\"", "The IMPLAN Group LLC, the North Carolina firm that operates the input-output modeling system and provides the figures for ag-related sectors, did not return calls to confirm data.", "We also contacted the U.S. Department of Agriculture, to try to verify the agriculture numbers. It couldn’t, exactly.", "The agency’s Economic Research Service division can offer only somewhat comparable data in its Farm Income and Wealth Statistics tables.", "According to that division, Georgia’s net valued added by farms in 2011 was $2.9 billion.", "That’s a huge difference from between the $13 billion that farmers reported. Definitions account for part of the gap – Georgia counts timber, nurseries and agriculture tourism such as hunting licenses, while the federal agency does not.", "But even then, there is at least a $9 billion gap between state and federal figures.", "To make sense of that gap, and the calculations themselves, PolitiFact Georgia reached out to Bruce Seaman, an economist who studies economic impacts of projects and industries.", "Seaman, a professor of economics at Georgia State University, said the varying definitions of agriculture likely accounts for much of the massive gap in the figures.", "More concerning, he said, is the mixing of \"impact\" and \"contribution\" when throwing around the $71 billion figure.", "The Agribusiness report answers the question of how much activity is going on in agriculture and its related industries.", "That is the industry contribution, Seaman said. It is a snapshot of the industry, which shows agriculture makes up about 10 percent of the overall state economy.", "That’s very different than saying it has the same impact, or importance, he said.", "Consider:  In 1905, about a third of all jobs in the United States were in agriculture. But Seaman said that did not mean those jobs had a proportional impact on the overall economy, or the United States would have collapsed as jobs moved into manufacturing.", "\"It describes how much activity is linked to an industry,\" he said. \"But it does not mean that if the agriculture industry declined by half, the economy would suffer a $35 or $36 billion loss.\"", "So, looking at the big picture, is agriculture Georgia’s largest industry?", "Think of it as a pie (pecan, of course. Made in Georgia).", "Based on the state and federal data – and adding in sectors that are directly linked to growing cotton and raising broilers – the $71 billion figure might be a bit too high, but can be mostly verified.", "But that figure is simply agriculture’s slice of the pie that is Georgia’s economy.", "In this study, making ag’s slice smaller or larger doesn’t make the pie any bigger.", "Agriculture is the largest single component in the state economy. But it requires another type of study to know its actual economic impact.", "The Georgia Farm Bureau statement is accurate, but needs some additional context to fully understood.", "We rate the claim Mostly True.", "The Georgia Farm Bureau. About Georgia Agriculture page, accessed Dec. 30, 2014", "University of Georgia, Center for Agribusiness and Economic Development, 2013 Ag Snapshot", "U.S. Census Bureau, County Business Patterns, Georgia counties, 2012", "U.S Department of Agriculture, Economic Research Service, Farm and Wealth Statistics, Value Added table", "U.S. Department of Agriculture, National Agricultural Statistics Service, 2012 Agriculture Census, Georgia data", "Phone interview with Chris McGath, agricultural economist, Economic Research Service unit at USDA, Dec. 30, 201", "Phone interview, Kent Wolfe, director, Center for Agribusiness and Economic Development at University of Georgia, Jan. 5, 2015", "Phone  and email interviews, Sharon Kane, public service associate/economist, Center for Agribusiness and Economic Development at University of Georgia, Jan. 5 and Jan. 6, 2015", "Phone and email interviews, Bruce Seaman, professor of economics, Andrew Young School of Policy Studies of at Georgia State University, Jan. 5 and Jan. 6, 2015", "Email interview with Sue King, spokeswoman for the National Agriculture Statistical Services unit at the USDA, Dec. 29, 2014", "Email interview with Jennifer Whittaker, spokeswoman, Georgia Farm Bureau, Dec. 29, 2014", "Email and phone interview with Robert Bernstein, spokesman, U.S. Census Bureau, Dec. 29, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]