["About this rating", "The Clintons voluntarily returned or paid for some gifts due to a dispute over whether they had been given to the Clintons personally or to the U.S.", "The Clintons were not \"forced\" to return any gifts, they were not found to have \"stolen\" any items, and the aggregate value of the objects in question was much less than $200,000.", "In January 2001, former president Bill Clinton and former first lady Hillary Clinton disclosed that they had received $190,027 worth of gifts during 2000, the final year of their eight-year tenure in 1600 Pennsylvania Ave. According to the Washington Post, the Clintons took the booty with them when they moved out of the White House:", "Many of the gifts the Clintons are taking with them are from Hollywood figures, Democratic donors and a wide array of friends and associates, including his Georgetown University classmates.", "Most of the gifts are artworks, flatware, furniture, china and rugs for a couple who for nearly two decades have not had a home of their own but now suddenly have two large houses, one in Northwest Washington, the other in Chappaqua, N.Y.", "The rules governing the acceptance of gifts by the president and other federal employees divide such items into two categories: those received from foreign officials or governments (foreign official gifts), and those received from the American public (domestic gifts). The president is allowed to keep foreign official gifts if their worth is under a certain threshold; gifts whose worth is over the threshold belong to the people of the United States and must be purchased at fair market price from the General Services Administration. No such limitation applies to domestic gifts, although the law requires disclosure of each individual gift valued at more than a minimal amount ($260 as of the end of Clinton's term of office). The law also states that federal employees, including the president and first lady, may not solicit gifts.", "As was pointed out at the time, the rules for U.S. senators are different. Senators may not accept gifts valued at more than $50, and may not accept multiple gifts from individual donors totaling more than $100.  Hillary Clinton took office as New York senator on 3 January 2001, but because the gifts in question were reported as received while she was still first lady, the rule wasn't applied. At least one critic, Charles Lewis of the Center for Public Integrity, said that even so, the timing gave the appearance Sen. Clinton was \"enriching herself from public service.\"", "There was nothing illegal about the Clintons keeping personal gifts that had been given to them in the White House, but the $190,027 total price tag of their final year's haul elicited criticism, which the former first couple sought to stem by announcing they would voluntarily pay for a portion of those gifts, an amount totaling $86,000.", "Days later, the New York Times reported that the Clintons would return an additional $28,000 or more worth of gifts that donors complained had been earmarked for the White House permanent collection, not the Clintons' personal use. Ultimately, the total worth of gifts returned by the Clintons to the U.S. government amounted to nearly $50,000, the Times later reported.", "A statement from Clinton spokesman James E. Kennedy attempting to explain the flap proved less than enlightening:", "A statement issued tonight by James E. Kennedy for Mr. Clinton's office said that all the chairs, tables, rugs and other furnishings taken for their homes in Washington and Chappaqua, N.Y., had been registered as personal gifts by the White House gift office.", "\"Every item accepted by the Clintons was identified by the White House gift office as a gift to them,\" the statement said, adding that the administrative staff at the White House had \"reviewed each of the items against the official list of White House property to ensure every gift was properly handled; none of these items was on that list.\"", "The park service handles permanent donations, officials said. Personal gifts to the president and his family are recorded separately through the White House gift office.", "The statement offered no explanation for the apparent appearance of the gifts — which include sofas, a rug and a kitchen table with chairs — on both lists. Betty Monkman, the White House curator, did not respond to an interview request.", "All told, the Clintons paid back or returned approximately $136,000 worth of furniture, artwork, china and other household items they had kept upon leaving office, with $86,000 of that total consisting of personal gifts they would presumably have been allowed to retain but decided to pay for to avoid the appearance of impropriety. About $50,000 of the total comprised items they had removed but were later determined to belong to the government.", "To say the latter were \"stolen\" is to say more than we know — the removal of the questioned items could have been based a clerical mistake — but in any case an accurate accounting of those items' worth puts it at only a quarter of what has been alleged: $50,000, not $200,000.", "A House government reform subcommittee conducted a year-long investigation concluding in 2002 which found that many of the gifts received by the Clintons had been undervalued, some were never reported and some were listed as lost or missing. No allegations of illegality were made, but the subcommittee's report recommended that the existing, overly complex system for overseeing the receipt, valuation and disposition of presidential gifts be overhauled.", "Edsell, Thomas B.   \"Clintons Take Away $190,000 in Gifts.\"\r\n    Washington Post.   21 January 2001.", "Goldstein, David.  \"House Panel Reviewing Clintons' Gifts Sees System to Fix.\"\r\n  Philadelphia Inquirer.  13 February 2002.", "Hernandez, Raymond.   \"Clintons Accused of a Failure to Disclose Gifts' True Value.\"\r\n    The New York Times.   13 February 2002.", "Hulse, Carl and Joyce Wadler.   \"Clintons to Repay $86,000 to Gift Givers of Last Year.\"\r\n    The New York Times.   3 February 2001.", "Marquis, Christopher.   \"Clintons Will Return Any Gifts Found to Belong to the White House.\"\r\n    The New York Times.   5 February 2001.", "\"Problems with the Presidential Gift System.\"\r\n  U.S. House of Representatives.  28 October 2002.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]