["About this rating", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "In early May 2020, Facebook users began sharing a specimen of what is known as \"copypasta,\" which can generally be described as text that is copied then pasted and shared across internet platforms, on the topic of the COVID-19 coronavirus disease pandemic.", "The text block purported to be from a person claiming to have personal knowledge that Democratic lawmakers in Congress were \"giddy\" over the economic impacts of the pandemic. The message begans, \"Spoke with a friend of mine who works in DC.\"", "Here is an example of the message, with the Facebook user's name cropped out for privacy purposes:", "Some version of the text shared above included a note that it was copied and pasted from a person named Rick Wilson, although we were unable to locate a person by that name who posted the text.", "It bears mentioning that the U.S. House of Representatives, lead by House Speaker Nancy Pelosi, left the Capitol on March 27, 2020, and as of this writing have not returned, following the advice of an attending physician.", "The U.S. Senate, meanwhile, returned to the Capitol on May 4 after a five-week hiatus. And the copypasta, as shown in the screen shot above, has been circulating on Facebook at least as early as May 4.", "The copypasta has also appeared on Twitter and random websites, but never directly attributing the original source nor the \"friend\" that witnessed the alleged events and discussions.", "Given the lack of evidence provided and the fact that the text has been copied and pasted or shared by hundreds of people with no connection to it, this appears to be little more than a social media hoax. We therefore rate it \"False.\"", "Volz, Dustin. \"Lawmakers Leave Washington Without Renewing Expired Surveillance Powers.\"\r\n  The Wall Street Journal. 27 March 2020.", "Snell, Kelsey. \"House Cancels Plans To Return To Washington On May 4, While Senate Preps For Session.\"\r\n  NPR. 28 April 2020.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]