["“जिन्हें भारत मे मे डर लगता है वो #सानियां_मिर्जा को देखें और सोचें। (Those who feel fearful about living in India should see Sania Mirza and contemplate -translated)” is a text blurb posted by a Facebook page Tarek Fateh Fan club along with a side-by-side comparison of images featuring tennis player Sania Mirza. In this viral meme, the image on the left features Sania Mirza in modern clothing, while she is donning a hijab in the image on the right. The post suggests that while Mirza dresses freely in India, she has to don conservative clothing when in Pakistan, and therefore those people who claim that they are ‘fearful’ in India should contemplate. At the time of writing this article, it has been shared close to 7000 times.", "Bharatiya Yuva Shaktee, a Facebook page has also shared the image with the identical narrative. Few more individuals on Facebook and Twitter have shared the image.", "Alt News used Google reverse image and found that the photo of Mirza donning a hijab was clicked during her trip to Saudi Arabia and NOT Pakistan. An article published by Rediff on November 9, 2006 titled, “Spotted! Sania Mirza in a hijab”. According to the article, Sania Mirza was clicked during her visit to Mecca for Umrah, an Islamic pilgrimage.", "Mirza was seen cladding a hijab during the same pilgrimage in 2018. Alt News could not find any pictures of Mirza in a hijab during her visits to Pakistan. It must also be noted that she has been spotted in western clothing, similar to what she would wear in India, on several occasions in Pakistan.", "@ayeshaOmer23 with @MirzaSania on the #PSLT20 #HBLPSL These two more charming & lovely😘😘😘#KarachiKings #Karachi pic.twitter.com/mPga9bwQmm", "— Muala Jutt 🇵🇰 (@BeingAtharAli_) February 9, 2016", "Image of Sania Mirza donning a hijab during her visit to Saudi Arabia for Umrah was passed off on social media as that of Pakistan and was compared with a photograph of Sania Mirza dressed in a t-shirt and jeans during a launch event of Volini spray in India. This claim was earlier debunked by Times Fact Check. Several images of Mirza in Pakistan are available on the internet and none of them suggest that she is required to wear a hijab there. The narrative about Mirza forced to wear hijab in Pakistan is false and misleading.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "Amid the ongoing Israel-Palestine conflict, media outlet Times Now put out a report claiming that…", "A 45-second video clip is being shared widely on social media where a group of…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…"]