["About this rating", "Someone may have finally managed to beam up Scotty. In December 2020, a private astronaut said in an interview with The (London) Times that he smuggled the ashes of \"Star Trek\" actor James Doohan aboard the International Space Station. Richard Garriott, an adventurer, was going on a 12-day mission as a private astronaut aboard the space station in 2008 when he said Doohan’s family reached out to him with an unusual request.", "The late actor, known for his role as the chief engineer aboard the U.S.S. Enterprise in the hit television series, loved space and wanted to be laid to rest among the stars. His son, Chris Doohan, contacted Garriott when he was days away from launching. The effort was “completely clandestine,” according to Garriott, who had not received permission from the station to bring these ashes aboard. He said he printed and laminated three cards with a photograph of Doohan in front and with a sprinkling of ashes sealed inside, tucked them in his flight data file, and carried them onboard. The file had clearance to fly but the cards with the ashes did not.", "Doohan’s family and Garriott did not talk about it until 2020 because of concerns that it could cause trouble with Russian and U.S. space agencies. Garriott said, “The concern afterwards was that it could disrupt relations because I didn’t have permission [...] so in an abundance of caution I was asked to tell the family, ‘Let’s not make a big deal out of it publicly’.”", "Chris Doohan also confirmed this story: “Richard said, ‘We’ve got to keep this hush hush for a little while’ and here we are 12 years later. What he did was touching — it meant so much to me, so much to my family and it would have meant so much to my dad.”", "The three cards reportedly found their way into different places. One was framed on a wall in a Doohan family home. A second was floated into space by Garriott and likely burnt up in Earth’s atmosphere. The third was hidden under the cladding of the floor of the space station’s Columbus module. Garriott claimed that as far as he knew, no one had moved it or spotted it there. The Times article includes a video of Garriott purportedly taken inside the space station where he was holding up and tossing one of the cards. The card floated in the gravity-free area where Garriott was sitting before he grabbed it again.", "Chris Doohan shared the card that Garriott brought back from the station:", "The International Space Station has not verified this story, nor has Snopes been able to independently corroborate the information. We also reached out to the Russian space agency Roscosmos and the European Space Agency, and we will update this post if we get new information.", "Given that we know the version of this story from Garriott and Doohan’s son, have not confirmed with the space station, nor corroborated the story ourselves, we rate this claim as a “Unproven.”", "Nur Nasreen Ibrahim is a reporter with experience working in television, international news coverage, fact checking, and creative writing.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]