["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "If you're making peanut butter-and-jelly sandwiches for nursing home residents, how many times should you wash your hands?", "Conservative talk show host Jeff Wagner teased a few topics at the top of his show on May 8, 2013, then he posed a question and made a claim.", "\"How many times do you wash your hands while making the same peanut butter-and-jelly sandwich? Maybe once, right? Maybe?\" he asked on WTMJ-AM (620) in Milwaukee.", "\"Well, the State of Wisconsin thinks you should have to do it at least 28 times to make one peanut butter-and-jelly sandwich.\"", "We happened to be driving to a lunch appointment (for Ethiopian food, not PB&Js) when we heard Wagner’s claim, so it caught our attention.", "Wagner’s evidence", "The former federal prosecutor replied promptly to our request for evidence to back his statement. He even went to the trouble of posting on his blog both the request and his response (which included the requisite dig at PolitiFact).", "The evidence consisted of two things:", "-- A four-paragraph Associated Press news article, headlined \"Outagamie County sues over food code inspections,\" that was posted on JSOnline.com the day before Wagner made his claim.", "-- A copy of a federal court lawsuit Outagamie County filed against the state over state inspections of the county-owned nursing home.", "Wagner also noted in his email that he discussed the lawsuit later in his show. (By the way, both the Milwaukee Journal Sentinel, which produces PolitiFact Wisconsin, and WTMJ are owned by Journal Communications.)", "That means listeners who only heard Wagner’s tease might have thought the state was poking its nose into their kitchen. But he made it clear half an hour later that his claim had to do with the nursing home lawsuit.", "The lawsuit", "Outagamie County sued the state Department of Health Services in March 2013, objecting to code violations cited in 2011 and 2012 at Brewster Village, a county-owned nursing home.", "State inspectors enforce both state and federal regulations governing nursing homes. And some of the violations cited at Brewster Village involve federal codes for food preparation.", "After the state issued its violation notices in 2011, according to the lawsuit, workers at the nursing home conducted \"time studies.\" They wanted to see -- based on how they said the state interpreted federal food regulations -- how long it would take \"to provide for the number of hand washes, glove changes and other steps.\"", "The county concluded that in order to comply, nursing home staff would need to wash their hands 28 times to safely make peanut butter-and-jelly sandwiches -- rather than the nine times they normally do.", "Of course, in the context of a lawsuit, it’s in the county’s interest to claim the state-required number is as high as possible. Whether it’s nine times or 28 times, the impression for most will be the same: Really?", "Wash, wash, wash", "It’s important to remember we’re not talking about a person at home making a PB&J for their lunch, but multiple workers making sandwiches for medically fragile people in a 204-bed nursing home.", "Still, it seems like a whole lot of washing going on.", "State inspectors cited a number of instances at Brewster Village they said violated the federal food code. For example: workers adjusting knobs on a device that was soiled with a brown substance; pouring hot water into a pitcher without first washing hands; touching a drawer handle soiled with grease to remove a clean utensil from the drawer; and donning a pair of gloves and opening a drawer to get a clean utensil and, without hand washing, cutting open two bags of gravy mix.", "What does the state say about all this?", "State inspectors didn’t declare in their reports that nursing home staff needed to wash hands a particular number of times during food preparation.", "And the Department of Health Services wouldn’t comment to us on Outagamie County’s claim that, according to the state’s interpretation of federal rules, 28 hand washes are necessary during sandwich making.", "It seems likely, though, based on the violation notices the state issued, that the state believes the hand washing should have occurred more than nine times.", "Our rating", "Wagner said \"the State of Wisconsin thinks you should have to\" wash your hands \"at least 28 times to make one peanut butter and jelly sandwich.\"", "Wagner later made it clear he was referring to food preparation in a county-owned nursing home. But although the state indicated it wanted nursing home staff to wash their hands more than nine times, it didn’t specify a number.", "Wagner’s statement is partially accurate, but leaves out important details -- our definition of Half True.", "WTMJ-AM, Jeff Wagner show (claim at 2:20; segment at 17:20), May 8, 2013", "Email interview, Jeff Wagner, May 9, 2013", "Associated Press, \"Outagamie County sues over food code inspections,\" May 7, 2013", "U.S. District Court, Outagamie County lawsuit against the State of Wisconsin, March 29, 2013", "Email interview, Wisconsin Department of Health Services communications specialist Claire Smith, May 13 and 14, 2013", "Interview, Outagamie County Executive Tom Nelson spokesman Larry Abitz, May 14, 2013", "Interview, Outagamie County assistant corporation counsel Mark Schroeder, May 14, 2013", "Wisconsin Department of Health Services, inspection report of Brewster Village, July 11, 2011", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]