["The video has been viewed more than 200 times after it was posted on Facebook here on November 28, 2020. Translated to English, the Indonesian-language caption reads: “The Funeral of Diego Maradona in Argentina.”", "Tens of thousands of people in Buenos Aires bid farewell to Argentine football legend Diego Maradona, who died on November 25, 2020, at the age of 60, as reported here by AFP.", "The video has been viewed more than 750 times after it appeared with a similar claim here and here on Facebook, as well as here on Instagram.", "The claim, however, is false.", "A Google reverse image search using keyframes obtained from digital verification tool InVID-WeVerify found this similar video was posted on Twitter on October 20, 2019.", "La convocatoria política más numerosa desde la de Alfonsín en 1983. Ahora que van a decir los medios de prensa de los K que mienten en todos los actos de Macri? NADA ESTÁ PERDIDO. TODO ES POSIBLE SI CUIDAMOS CADA VOTO.. pic.twitter.com/eg38PLztop", "The Spanish-language tweet, translated to English, reads: “The largest political gathering since Alfonsin in 1983. Now what will the K’s media say about the lies in all Macri events? NOTHING IS LOST. EVERYTHING IS POSSIBLE IF WE TAKE CARE OF EVERY VOTE.”", "“Alfonsin” refers to late Argentine president Raul Alfonsin, who was elected to office in 1983 and was the first civilian leader after the country’s eight years of military rule.", "“K”  is a reference to former president Nestor Kirchner (2003-2007) and his successor and wife, Cristina Fernandez de Kirchner (2007-2015).", "“Macri” refers  to Mauricio Macri, who served as Argentine president from December 2015 to December 2019.", "Macri ran for re-election in 2019, and his campaign rally on October 19, 2019, attracted a massive crowd at the Obelisk monument in Buenos Aires, as reported here and here.", "Below is a screenshot comparison of the video in the misleading post (L) and the Twitter video (R):", "Macri’s campaign banner, which says “Si Se Puede” (Yes You Can), and giant screens can be seen at the 0:03 mark of the misleading video, which match the scene captured by this AFP photo of Macri’s campaign rally. The Obelisk monument is also visible in the misleading video.", "Below is a screenshot comparison of the video in the misleading post (L) and the AFP photo (R):", "Macri lost the re-election bid in late October 2019.", "AFP previously debunked a claim that the video shows a protest against the current Argentine president, Alberto Fernandez, in June 2020.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]