["About this rating", "A quote frequently attributed to Mark Twain gained greater prominence in 2016 as media publications debated the effect of \"fake news\" on the internet:", "It's easier to fool people than to convince them that they have been fooled.", "The quote shown here has been attributed to Mark Twain (or Samuel Clemens, if you prefer) by dozens of web sites, books, and memes, and was even available on a T-shirt sold by Amazon. However, none of these sources provided any information about where or when Twain allegedly said this. Was it written or spoken? Did it appear in a book or a newspaper article?", "A lack of source information for this particular quote is especially noteworthy, because Mark Twain's writing was very well-documented. Several volumes of quotes from the author of Huckleberry Finn have been compiled, yet we were unable to find this quote in any of them.", "Barbara Schmidt, who operates TwainQuotes.com, told us that she also had no evidence that Twain wrote or uttered this phrase. However, Schmidt directed us to a passage from the Autobiography of Mark Twain, Volume 2, in which he expressed a similar opinion about the power of a lie::", "The general idea of that quote (although not that wording) is one Mark Twain expressed in regard to lying -- in that is it hard to convince people they have been a victim of a lie.", "He did state:", "\"The glory which is built upon a lie soon becomes a most unpleasant incumbrance. ...  How easy it is to make people believe a lie, and how hard it is to undo that work again!\" - Autobiographical dictation, 2 December 1906. Published in Autobiography of Mark Twain, Volume 2 (University of California Press, 2013)", "The full quote, which can be viewed via The Mark Twain Project, reads as follows (emphasis ours):", "The truth is, I did not have to wait long to get tired of my triumphs. Not thirty days, I think. The glory which is built upon [a] lie soon becomes a most unpleasant incumbrance. No doubt for a while I enjoyed having my exploits told and retold and told again [in my presence] and wondered over and exclaimed about, but I quite distinctly remember that there presently came a time [when] the subject was wearisome [and odious] to me and I could not endure the disgusting discomfort of [it.] I am well aware that the world-glorified doer of a deed of great and real splendor has just my experience; I know that he deliciously enjoys hearing about it for three or four weeks, and that pretty soon after that he begins to dread the mention of it, and by and by wishes he had been with the damned before he ever thought of doing that deed; I remember how [General Sherman used to rage and swear [over] \"When we were marching through Georgia,\"] which was played at him and sung at him everywhere he went; still, I think I suffered a shade more than the legitimate hero does, he being privileged to soften his misery with the reflection that his glory was at any rate golden and reproachless in its origin, whereas I had no such privilege, there being no possible way to make mine respectable.", "How easy it is to make people believe a lie, and [how] hard it is to undo that work again! [Thirty-five years after those evil exploits of mine I visited my old mother, whom I had not seen for ten years]; and being moved by what seemed to me a rather noble and perhaps [page 303] heroic impulse, I thought I would humble myself and confess my ancient fault. It cost me a great effort to make up my mind; I dreaded the sorrow that would rise in her face, and the shame that would look out of her eyes; but after long and troubled reflection, the sacrifice seemed due and right, and I gathered my resolution together and made the confession.", "It is possible that someone else paraphrased Twain's words, and others conflated both the actual phrase and the paraphrase over time.  However, we have been unable to find evidence that Twain spoke or wrote this exact phrase.", "Twain, Mark.   Autobiography of Mark Twain: Volume 2.     The Mark Twain Project, 2013.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]