["About this rating", "In late November 2017, a meme circulated on Facebook with the claim that the Amish community, a relatively small and isolated group of Christians who live throughout the American Northeast and Midwest and abide by the lifestyle and technology of a bygone era, own 20 percent of the nation's \"puppy mills,\" a term used by animal advocates to refer to commercial dog breeding kennels:", "In Pennsylvania and Ohio, which have the highest Amish populations, the vast majority of known commercial breeding kennels are in Lancaster and Holmes counties respectively; both counties have the nation's oldest and largest Amish population concentrations. According to Pennsylvania state records, there are 119 known commercial breeding kennels in Lancaster — although many are listed as closing, or have already closed. In Ohio, 134 of the state's total 268 breeding facilities are in Holmes County. The states do not track the religious views of the breeders.", "Amish people make up a small percentage of Americans, with an estimated population of roughly 300,000. But, according to animal welfare groups, the Amish are prolific dog breeders, and in many of those operations, dogs are kept in poor conditions. In May 2017, the Pennsylvania Society for Prevention of Cruelty to Animals rescued 27 dogs from an illegal breeder in Lancaster County, SPCA spokeswoman Gillian Kocher told us. At least two, a yellow Labrador retriever and a bulldog, were in desperate need of immediate veterinary care. All the dogs were rehabilitated and adopted into permanent homes, she said, and the SPCA has pressed charges against the breeder.", "According to the Humane Society, unlicensed breeders can mean terrible conditions for dogs, including neglect, untreated health problems, and dogs forced to produce litter after litter of puppies. HSUS's yearly list of 100 \"horrible\" breeders includes accounts of everything from shivering, wounded dogs to a breeder still in operation even though she shot a dog in the head in 2008. According to HSUS, these breeders continue to operate despite receiving multiple warnings and citations from law enforcement.", "Because there are millions of unwanted pets in animal shelters, animal advocates generally encourage prospective pet owners to adopt from shelters and rescues instead of purchasing from breeders (but in cases where a breeder is preferred, HSUS also provides a checklist on how to find a responsible one). According to the American Society for the Prevention of Cruelty to Animals, 3.3 million dogs enter shelters every year, and of those, 670,000 are euthanized. These numbers have been in decline since 2011, owing to an increase in the number of pets adopted and lost animals successfully reunited with owners.", "Alfonsi, Sharyn, and Gerstien, Ted. \"Puppies 'Viewed as Livestock' in Amish Community, Says Rescue Advocate.\"\r\n  ABC News. 27 March 2009.", "DeCourcy Hinds, Michael. \"Amish at Heart of 'Puppy Mill' Debate.\"\r\n  The New York Times. 20 September 1993.", "ASPCA. \"A Closer Look at Puppy Mills.\"", "Humane Society of the United States. \"The Horrible Hundred 2017: Uncovering U.S. Puppy Mills.\"\r\n  9 May 2017.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]