["By Saranac Hale Spencer", "Posted on September 7, 2018", "Q: Was “VP Mike Pence Busted Stealing Campaign Funds To Pay His Mortgage”?", "A: He used campaign funds for personal expenses during his run for Congress in 1990, but the Federal Election Commission could not agree on whether he violated campaign finance laws.", "An old controversy from Vice President Mike Pence’s run for Congress in Indiana 28 years ago has resurfaced in a story on a partisan website that carries a misleading headline: “VP Mike Pence Busted Stealing Campaign Funds To Pay His Mortgage Like A Thief.”", "The story has been shared on social media pages with a combined following of more than 4 million, according to data from CrowdTangle.", "But Pence wasn’t “busted,” because he was never found to have violated campaign laws. Also, the incident unfolded nearly three decades ago, not while he was vice president.", "Regardless of how old it is, the issue was recently trotted out like it was new information by the misnamed bipartisanreport.com — a website that posts stories with a liberal slant. We’ve written about its misleading stories before.", "While it’s true that the Democratic Congressional Campaign Committee filed a complaint with the Federal Election Commission in 1990 about Pence and three other Republican candidates using campaign contributions for personal use, the commission could not agree on whether those candidates violated existing campaign finance laws.", "The six FEC commissioners — three Democrats and three Republicans — split along party lines when they voted on whether to adopt the recommendation of the commission’s general counsel (see page 67). The general counsel had recommended finding that the candidates had not violated the law (see page 56) because it allowed for “wide discretion” in how campaigns chose to spend money. The general counsel’s office cited earlier FEC opinions that allowed for campaigns to pay for candidates’ living expenses.", "In Pence’s case, he used campaign funds to pay his mortgage of nearly $1,000 per month, make payments on his wife’s car, pay golfing greens fees, and pay for parking tickets, according to the general counsel’s finding.", "Pence did not dispute that he had used campaign funds for personal expenses. He said at the time, “I’m not embarrassed that I need to make a living.”", "While the commissioners deadlocked on the outcome of that particular case, they did unanimously agree to consider amending the rules for candidates’ personal use of campaign funds. The FEC adopted new rules in 1995.", "The controversy had been revisited during the 2016 presidential election when the Washington Post published a story about Pence’s early political spending.", "The bipartisanreport.com story accurately cites the Post article, but its headline is misleading.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk false stories shared on the social media network.", "House-Dunphy, Carissa. “VP Mike Pence Busted Stealing Campaign Funds To Pay His Mortgage Like A Thief.” Bipartisanreport.com. 3 Sep 2018.", "Federal Election Commission. Matter Under Review 3107. Case closed 27 Nov 1990.", "Helderman, Rosalind, et al. “Mike Pence used campaign funds to pay his mortgage — and it cost him an election.” The Washington Post. 15 Jul 2016.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]