["By Saranac Hale Spencer", "Posted on December 11, 2019", "A Macedonian website is peddling a baseless Hillary Clinton conspiracy theory that has amassed tens of thousands of shares on Facebook. The story implies that Clinton was involved in the deaths of two Baltimore-area law enforcement officers, and makes the unfounded claim that they were scheduled to testify against her.", "Macedonian websites that published misinformation critical of Hillary Clinton in the run-up to the 2016 presidential election are still doing it in 2019 — and she’s not even among the Democrats running for president in 2020.", "A website called Best Daily News, which is registered to an owner in Macedonia, posted a story on Nov. 5 with a headline claiming: “FBI Agent, Who Exposed Hillary Clinton Cover-up, Found Dead.” According to data from CrowdTangle, it has had more than 38,000 interactions on Facebook.", "But the story is a mixture of imagined connections and pure bunk. It was copied from a website called Neon Nettle, which is known for publishing inflammatory content and misinformation. We’ve written about stories Neon Nettle has posted before.", "The story was first published in June 2018 and attempted to tie Clinton to the deaths of two Baltimore-area law enforcement officers — FBI Special Agent David Raynor, who died in March 2018, and Baltimore Police Detective Sean Suiter, who died in November 2017. The story wrongly identifies them both as FBI agents.", "We’ll start with the claims it makes about Raynor.", "The story says, without offering any evidence, that Raynor was going to reveal to a grand jury “the extent of Clinton and Obama malpractice and corruption in the ‘Operation Fast and Furious’ cover-up.”", "Operation Fast and Furious was a flawed attempt by the government to trace guns bought illegally on behalf of Mexican drug cartels by letting so-called “straw purchasers” buy guns and carry them across the Mexican border. The operation was run by the Phoenix office of the Bureau of Alcohol, Tobacco, Firearms and Explosives and the U.S. Attorney’s Office for the District of Arizona. Both are part of the U.S. Department of Justice. It ended after the December 2010 death of Brian Terry, a U.S. Border Patrol agent who was killed with a gun purchased under the program.", "The operation did involve a member of President Barack Obama’s cabinet — then-Attorney General Eric Holder was held in contempt of Congress for refusing to turn over documents about the program. The story claims that emails posted on WikiLeaks show that Clinton, who was secretary of state from January 2009 to February 2013, “was fully knowledgeable” about Operation Fast and Furious, but we found no such evidence in a search of the site. The Department of State, which deals with foreign policy, had no role in the operation.", "It then implies that Clinton was involved in Raynor’s death, saying: “Raynor’s tragic death comes just one day before he was due to testify before a US Federal Grand Jury. He was widely expected to testify that Hillary Clinton acted illegally to protect Obama administration crimes while covering up the Fast and Furious scandal.”", "But Raynor killed himself and his estranged wife in a murder-suicide outside of her home, and the only court appearance he had scheduled for the next day was for the couple’s pending divorce. They were both pronounced dead at the scene.", "As for Suiter, the story identifies him as an “18-year veteran of the FBI” and “one of the main witnesses” in an investigation of Operation Fast and Furious. The first of those claims is false and the second is baseless.", "Suiter was actually an 18-year veteran of the Baltimore Police Department, and he was reportedly scheduled to be a witness in a corruption case involving that department. The case alleged that officers assigned to a special task force aimed at getting guns off the street were actually bilking the department for overtime hours and stealing from people whom they had pulled over or detained. At least eight members of the task force have pleaded guilty or been convicted. It is completely unrelated to Operation Fast and Furious.", "The Baltimore police corruption case was filed in February 2017, when Rod Rosenstein was the U.S. Attorney for the District of Maryland. In a speech he gave the day Suiter died, Rosenstein mentioned both the Baltimore corruption case and Suiter:", "Rod Rosenstein, Nov. 16, 2017: As in any profession, there are some police officers who commit crimes. One of the last cases that I prosecuted as U.S. Attorney was against seven Baltimore police officers for abusing their power.  Cases like that are extremely important.", "But I know from personal experience that most police officers are honorable people who try to do the right thing.", "Every day, all across America, honest police officers put on the uniform and the badge. They are men and women of every race, religion and ethnicity. They say goodbye to their families and take they risk that they might never come home. Sometimes they do not.", "Yesterday afternoon in Baltimore, a homicide detective who worked closely with my office was shot in the head and passed away this afternoon. So today, we are praying for Sean Suiter’s family and the Baltimore Police Department. But prayer is not enough.", "Suiter died of a gunshot wound to the head while he was on duty. He was shot with his own gun, but the manner of his death — whether it was homicide or suicide — has been disputed.", "A report prepared by an independent review board commissioned by the Baltimore Police Department concluded that it was suicide, a finding that was upheld by the Maryland State Police. However, the Baltimore City state’s attorney has said that her office is still investigating the death, and Maryland’s Office of the Chief Medical Examiner found that it was a homicide.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "U.S. Department of Justice, Office of the Inspector General. “A Review of ATF’s Operation Fast and Furious and Related Matters.” Sep 2012.", "United States House of Representatives Committee on Oversight and Government Reform and United States Senate Committee on the Judiciary. “The Department of Justice’s Operation Fast and Furious: Accounts of ATF Agents.” 14 Jun 2011.", "Criminal Investigation Division Major Crimes Section: Murder Suicide – Crownsville. Press release. Anne Arundel County Police Department. 7 Mar 2018.", "Report to the Commissioner of the Police Department of Baltimore City Concerning an Independent Review of the November 15, 2017 Incident and its Aftermath. Independent Review Board. Baltimore Police Department. 27 Aug 2018.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]