["About this rating", "On March 3, 2021, conservative media outlet The Washington Times reported that U.S. Rep. Marjorie Taylor Greene said new metal detectors designed to keep lawmakers safe following the Jan. 6 Capitol insurrection were a form of voter suppression.", "First, some context: Capitol maintenance crews installed the machines to screen people entering House chambers after the deadly insurrection. Since then, most House members used the metal detectors regularly without questions, The Associated Press reported. But some Republicans initially sidestepped the devices or refused to be checked with wands after they set them off.", "\"Capitol Police have now placed desks and velvet ropes near the metal detectors to block anyone from walking around the machines,\" the AP reported on Jan. 22.", "Now, let us address the claim that Greene, a far-right conspiratorialist, compared the safety measure to nefarious schemes by partisan groups to prevent people from voting in U.S. elections.", "According to CSPAN's video recording of congressional proceedings on March 2, the representative indeed said the practice of standing in \"long lines to enter the chamber\" to use the metal detectors was \"real voter suppression\" in her opinion. She made the statement during a debate over legislation to change campaign-finance and voting laws on (read bill H.R. 1 here).", "Here's Greene's full quote, according to the video footage:", "I rise in opposition to H.R. 1. While we are talking about voter suppression and long lines, there is real voter suppression that happens right here in Congress. Many members of Congress have to stand in long lines to enter the chamber going through metal detectors, emptying our pockets, and being treated very disrespectfully. So that is real suppression, and it's a shame it happens right here on the House floor.", "Standing in line to vote is not voter suppression — it's just part of the voting process, just like people stand in line to buy groceries at the grocery store.", "Voters in a northwestern region of Georgia in November 2020 elected Greene to represent them, and she began her term in Washington, D.C., in January 2021.", "During her campaign and afterwards, she embraced the QAnon conspiracy theory and advocated on the frontlines of former President Donald Trump's misinformation campaign to try to convince voters that Joe Biden won the presidency using illegal methods. See our fact checks regarding that false claim here.", "Jessica Lee is Snopes' Senior Assignments Editor with expertise in investigative storytelling, media literacy advocacy and digital audience engagement.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]