["About this rating", "In 2006, an hoax web site wended its way through the Internet and into our e-mail that appeared to be an advertisement for a \"new\" breakthrough in at-home laser eye surgery:", "The key to the LASIK@Home system is the Scal-Pal™ Scanning Adjusting Laparascopic Personal Laser. This hand-operated combination femtosecond/excimer laser is made exclusively for LASIK@Home by Walton Group Manufacturing, the same company that makes the the LASIK equipment used by more clinics nationwide.", "The Scal-Pal™ is actually two lasers in one! First the Scal-Pal™ femtosecond laser cuts a small flap in the cornea of your eye. Then the excimer laser vaporizes a tiny section of the lens without damaging the surrounding tissue. The whole procedure takes only a few minutes and is virtually painless.*", "[...]", "*This statement has not been evaluated by the FDA.", "LASIK (Laser in Situ Keratomileusis) surgery is a technique for correcting certain types of refractive problems with the eye (e.g., myopia, hyperopia, and astigmatism) through the precise and controlled removal of corneal tissue by a special laser that reshapes the cornea. In the United States, only ophthalmologists (i.e., physicians who specialize in the medical and surgical care of the eyes) are allowed to perform LASIK surgery, and all such procedures must use lasers that have been approved by the Food and Drug Administration (FDA).", "Any vendor, therefore, offering LASIK devices for patients to use on themselves to perform at-home eye surgery would be both dangerous and acting illegally. Fortunately, the LASIK@Home web site referenced above is merely a hoax, not a serious attempt to market such devices. (Among the many clues to the site's invalidity are a lack of a phone number, a physical or mailing address, and a functioning mechanism for ordering the product supposedly being advertised).", "For reasons that remain inexplicable, the hoax web site made a brief resurgence in 2017, eleven years after its first publication. However, as sincere as the image of \"Dr. Amir Khadim, M.D., Ph.D\" might appear, this web site remains a hoax, and despite the tremendous strides that have been made in in technology and medicine since 2006, home eye surgery without training or oversight remains just as dangerous as it ever was.", "The mugs and t-shirts, however, appear to be both harmless and genuine.", "7  November 2017, 5:22 P.M.: Added 2017 iteration.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]