["By Vanessa Schipani", "Posted on April 10, 2018", "In recent interviews, Environmental Protection Agency Administrator Scott Pruitt made two false claims about his agency’s record on removing toxic sites from the Superfund National Priorities List:", "Pruitt did not specify if he was referring to calendar years or fiscal years, which run from Oct. 1 to Sept. 30. But either way, he’s wrong. The above numbers are for calendar years. As for fiscal years, the EPA has removed 30 or more sites from the list in fiscal years 1996, 1997 and 2001, and the agency deleted two sites last fiscal year.", "Pruitt made his claim in an interview on April 4 with the Washington Times (starts at about 13:30).", "Pruitt, April 4: We saw seven [Superfund] sites come off the list last year. We’re going to see approaching 30 this year. That’s never been done.", "He also made the claim in an interview that same day on Fox News, while defending hiring Albert Kelly, a former banker, to lead the agency’s Superfund Task Force (starts at about 15:30).", "Fox News anchor Ed Henry first pointed out that Kelly was banned from the banking industry by the Federal Deposit Insurance Corporation. Though Kelly didn’t plead guilty to any crimes, the FDIC did have “reason to believe [Kelly] violated a law or regulation,” according to a May 9, 2017, settlement between the two parties.", "Two weeks later the EPA announced Kelly would head the Superfund Task Force, which was created to “provide recommendations” to “streamline and improve the Superfund program.” The Superfund program manages the country’s most contaminated sites.", "Henry then asked Pruitt what experience Kelly has related to running environmental programs. “Look at the results that they’re achieving,” Pruitt responded. “That’s the experience.”", "Pruitt added, “We’ll have almost 30 sites off the list this year,” which has “almost never been done. Never been [done] in history.”", "During the interview, Pruitt also confirmed that he has “had accounts” with SpiritBank, an Oklahoma bank where Kelly had been president and chief executive officer. Pruitt was the Oklahoma attorney general prior to becoming EPA administrator.", "We reached out to Pruitt’s office for comment multiple times, but it has yet to respond. We don’t know how many sites will be deleted from the list this year. We also don’t know if Pruitt was talking about fiscal years or calendar years. Either way, even if near 30 sites are deleted from the National Priorities List, it would be no record.", "In fiscal year 1996 — which extended from Oct. 1, 1995, to Sept. 30, 1996 — 34 sites were deleted from the list. In fiscal years 1997 and 2001, 32 and 30 sites, respectively, were removed. By calendar year, 45 sites were removed from the list in 1996.", "In both interviews, Pruitt also touted that the EPA removed seven sites from the list “last year.” Again, it’s unclear here whether Pruitt meant last calendar year or last fiscal year. But either way, it’s wrong.", "In calendar year 2017, three sites were deleted from the list. In fiscal year 2017, the EPA deleted two sites, both after he took the helm at the EPA in February 2017.", "This would make it a below average year. Since 1983, when the list was created, the average number of sites deleted each fiscal year is about 11.3.", "The EPA has deleted seven sites total since Pruitt took office. This would include four sites in calendar year 2018 (or five in fiscal year 2018) — sites that would presumably be included in his tally of about 30 for “this year.”", "It’s also worth mentioning that Pruitt’s EPA can’t take full credit for the sites it has deleted. All of them were first listed more than a decade prior to 2017. During this time, previous administrations did the work to remediate them.", "In fact, all of the sites were “Ready for Reuse and Redevelopment” in or before 2016. “Once sites have been cleaned up, EPA works with communities through an array of tools, partnerships, and activities to help to return these sites to productive uses,” the EPA’s website says.", "Two regional EPA spokespeople told us that after a site reaches this stage in the cleanup process, the work that takes place entails monitoring contamination levels and compiling paperwork to delete the site from the National Priorities List. A site comes off the list when “all cleanup goals have been achieved” and any comments from the public are addressed, the EPA says.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]