["About this rating", "An \"All-Seeing Eye\" symbol is included  in Nike's 'Kyrie 4' line of sneakers.", "This symbol is not found on all Nike shoes, is not a nod to the Illuminati, and is not evidence that Nike has \"embraced satanism.\"\r\n\r\nhe designer of the shoe said that this is an \"all-seeing eye\" symbol and not a nod to the Illuminati.", "Many of the calls to boycott Nike in September 2018 centered on the idea that the apparel company was disrespecting the United States by featuring Colin Kaepernick, one of the most prominent football players to kneel in protest against police brutality and racial inequality during the performance of the national anthem before NFL games, in their latest ad campaign. By week two of this controversy, however, some social users media were seeking out inventive new reasons to avoid the swoosh.", "In mid-September 2018, an image purportedly showing an \"alarming\" Illuminati symbol on the pull-tab of a Nike sneaker started circulating on social media, along with the claim that the company had \"officially embraced satanism\":", "This is a genuine product sold by Nike. However, it is not evidence that the company has \"embraced satanism,\" and the designer of the shoe might push back on claims that this is an \"Illuminati\" symbol.", "This symbol is indeed an element of Nike's \"Kyrie 4,\" NBA player Kyrie Irving's Signature Sneaker line, and is featured on a number of product shots via the official Nike website:", "According to shoe designer Benjamin Nethongkome, the symbol featured on these shoes is an \"all-seeing eye,\" a symbol has been associated with a number of different groups throughout history. Also known as the Eye of Providence, this symbol has been used to represent God's omnipresence and is also often used in reference to the Illuminati, a secret society at the heart of several conspiracy theories.  It's also part of the design used on the reverse of the U.S. $1 bill:", "Nethongkome explained why he chose to utilize that symbol in a December 2017 interview with Bleacher Report published around the time that the \"Kyrie 4\" line was released:", "\"One last detail we added, which is a dope one, is right behind the leather pull tab: an all-seeing eye graphic,” Nethongkome says. “Not to represent the illuminati. The third eye is to challenge everyone to think beyond what they see. That'll be directly behind the pull tab on the tongue.”", "This philosophy seems to falls in line with Kyrie Irving's view of the world. The Celtic point guard has tinkered with conspiracy theories in the past and has stated on at least one occasion that \"the earth is flat.\" When pressed about these ideas, however, Irving always seems to segue into the argument that he just wants people to think for themselves:", "Irving went on Geno Auriemma’s Holding Court podcast to talk basketball, but of course, as always, the flat-Earth theory came up. And Irving, like he’d been doing up until that point, said he put the theory out there to prove a point. But he also continued to say that he hasn’t seen any real pictures of the Earth.", "Auriemma pressed Irving out about that, saying that we’ve seen shots of the Earth from space via NASA’s satellites, which is totally true. But Irving wouldn’t stop there. He wasn’t having it.", "“I’m saying, Coach, that you don’t even know if they’re real or not,” Irving said. “I just wanted to have that conversation. That’s it. I wanted to actually know or ask other individuals, Bro -- excuse me -- Coach and Sue, do you really think that this actually happened? I don’t know. I don’t know, either. I just want to know.”", "Irving, who is best known as an NBA player with the Boston Celtics, has made a few controversial statements over the years about his apparent belief in conspiracy theories, such as the idea that the earth is flat, not round.", "The symbol showcased on these Nike shoes is not evidence that the company has \"officially embraced satanism.\" Rather, these images show that the company has embraced an NBA star who expresses some odd (and false) ideas about the universe.", "Sykes, Michael.   \"A Definitive Account of Kyrie Irving’s Flat-Earth Theories.\"\r\n    NBC News.   1 November 2017.", "Darr, Brendan.   \"Kyrie Irving Reveals He Believes the Earth Is Flat, Believes in Other Conspiracy Theories.\"\r\n    NBC News.   17 February 2017.", "Choi, Oruny.   \"Meet Nike Footwear Designer Benjamin Nethongkome and the Kyrie 4.\"\r\n    Bleacher Report.   15 December 2017.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]