["About this rating", "On 19 June 2017 a Facebook user's warning about detergent pods clogging drains began to circulate, slowly racking up tens of thousands of shares:", "We have had a problem with our drain. Started with the upstairs kitchen sinks. My plunger cleared it for a few days, then back the water came. My daughter Tracy removed the pipes under the sinks and used a \"snake\" ... There was something there and she got it dislodged. In the end, Alan traced the blockage to the washing machine. We had to get a plumber. I am shocked with what he told us. After I write this I will post a photograph.", "He asked what I used for washing my clothes. I told him wash pods. He said to stop immediately. It affects your dishwashers too. He said he has had to clear loads of drains because of them. You will see in the photo how the gel has cemented so hard, he could not even drill it out. Just a warning folks.....", "Detergent pods have caused intermittent controversy for years, prompting safety warnings in 2012 and 2017. But the household product has remained popular despite its drawbacks.", "The warning wasn't the first of its kind either, although we were unable to find a significant number of similar posts. In 2014, a separate Facebook user wrote:", "Moreover, in May 2017 at least one consumer lodged a complaint about Tide's detergent pods failing to properly dissolve:", "Another complained on Gain's Facebook page:", "However, those users didn't mention clogged drains or broken household plumbing. Other users attempted to replicate the problem, but their experiments did not use the product in the recommended way:", "Accounts of detergent pods (of any description) clogging drains were few and far between on social media, making unclear whether the problem is widespread, very rare, a random event, or dependent on circumstance (such as the temperature of water or the amount clothing in the washer).", "We contacted both Tide and Gain to ask for further information. On 21 July 2017, we received a response from Tide about the rumors:", "Thanks for reaching out to us on this. We work closely with our appliance partners to make sure P&G’s liquid laundry pacs for both washing machines and dishwashers work effectively, leaving the washing machines and pluming intact. P&G’s liquid laundry pacs are designed to fully dissolve in water and waste water to flow through the drain to the sewage system. That being said, if anyone has any questions at all regarding our products, they can call the 1-800 number on the back of the package, and one of our Consumer Care experts would be happy to help.", "We also contacted the plumbing services company Roto-Rooter , whose employees are no stranger to plumbing oddities. Company representative Paul Abrams responded with information he obtained after sending an inquiry to all general managers and field training managers at Roto-Rooter locations, including \"50 of the largest metro areas\" nationally. Abrams said of the replies received in response to our specific inquiry, there was no indication regular drain obstruction occurred in any market due to the use of laundry pods (or dishwasher pods):", "The feedback I’ve received so far indicates that our plumbers and sewer and drain technicians have not found any evidence to support the claim that laundry pods or dishwasher pods are clogging household plumbing drains. A few managers suggested that the appliances themselves would probably be more susceptible to having filter screens clogged than the actual household plumbing drains. They don’t believe an undissolved pod or partially dissolved pod could get through the discharged pump of a washing machine or dishwasher.", "If the drain lines inside a home are in proper working order (undamaged pipes without tree root intrusion), we don’t believe detergent alone or the dissolvable membrane of the pods could or would clog drainpipes, which are usually 1.5 to 2 inches in diameter. Furthermore, detergent alone cannot clog residential sewer pipes, which are typically 4 to 6 inches in diameter. Over time, household grease, food waste and soap scum can build up, slowing and eventually clogging drainpipes. But these are usually 2-inch kitchen sink drains where grease is the primary catalyst. 2-inch shower drain lines often clog but hair is the primary cause those clogs. Laundry drains usually experience stoppages caused by gradual lint and soap buildup over an extended period of time. This has always been the case and we have not noticed more frequent laundry drain clogs since detergent pods were introduced several years ago. Main sewer clogs are most often caused by heavy influx of kitchen grease and tree root intrusion into the pipes, but not by detergents.", "Neither detergent pods' manufacturers nor Roto-Rooter's massive network of plumbing experts were familiar with an epidemic of pod-clogged drain lines irrespective of type (clothing or dishes). While individuals reported some problems with dissolution intermittently, evidence for a widespread design flaw was slim to nonexistent.", "Abrams, Paul.   \"Chilling Tales From The Porcelain Seat.\"\r\n     Roto-Rooter Blog.   25 June 2009.", "Popken, Ben.   \"Laundry Pods Can Be Fatal for Adults With Dementia.\"\r\n    NBC News.   16 June 2017.", "CDC Morbidity and Mortality Weekly Report (MMWR).   \"Health Hazards Associated with Laundry Detergent Pods — United States, May–June 2012.\"\r\n    19 October 2012.", "Consumer Reports.   \"The Problem With Laundry Detergent Pods.\"\r\n    16 July 2015.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]