["At Thursday's presidential debate, President Donald Trump and former Vice President Joe Biden spent about seven minutes sparring over immigration.", "The clash centered around court filings from earlier this week that revealed that the parents of 545 immigrant children separated at the border have not been found.", "Of their back-and-forth, one word stood out to users on social media: \"Good.\"", "\"If you heard Trump say 'GOOD' about the kids being separated from their parents, and you still plan to vote for him, you're inhuman,\" reads an image posted by Close the Camps on Facebook.", "Close the Camps later updated its post's caption to read, \"broadcasts of the debate show that Trump did not respond to Biden’s comment with the word 'good.' He actually said, “go ahead” to the debate moderator, Kristen Welker, who had indicated her intent to move on to the next debate topic.\"", "Numerous others — including former Republican Rep. Joe Walsh, Democratic Rep. Ilhan Omar, and author Roxane Gay — also commented on the exchange on Twitter.", "\"Did he just say it was 'good' for kids and their parents to not be united?\" Omar wrote.", "Gay wrote, \"Biden: 525 kids don’t know where they are going to be, we can’t find their parents. Trump: 'Good.' Wow.\"", "Gay told USA TODAY that she and millions of others at first heard \"good.\"", "\"Transcripts later showed the president said 'go ahead,'\" she wrote. \"The only problem here is that it is entirely plausible that Trump could have said good because he is a disgrace.\"", "Walsh told USA TODAY that he wasn't aware of the error, but \"if he said 'go ahead,' I stand corrected.\"", "Omar has not responded to a request for comment from USA TODAY.", "More:Fact Check: Joe Biden wants to eliminate new fracking permits, not all fracking", "The moment came as moderator Kristen Welker prompted the candidates to move on to the next section, per a transcript. The exchange can be viewed on YouTube, too.", "\"All right, let's move on,\" Welker said.", "Trump continued to speak, seemingly referring to the policy of catch and release, which he had just called \"a disaster\" that allowed immigrants with the \"lowest IQ\" to return to the United States.", "\"But we don’t have to worry about it because I terminated it,\" Trump said. \"So we don’t have to worry about it.\"", "\"All right, let’s move on to the next section,\" Welker repeated.", "At that point, Biden cut in.", "\"You have 525 kids not knowing where in God’s name they’re going to be and lost their parents,\" he said.", "Then, Trump looked to Welker.", "\"Go ahead,\" he said, as she launched into her next question.", "More:How Biden and Trump compared in the final presidential debate", "Fact checkers at Reuters also confirmed that the president said “go ahead” by analyzing the video in slow motion.", "Others who at first erred in their posts about the back-and-forth, including podcast host Ethan Klein, later corrected themselves.", "\"I made a post during the debate quoting Trump as saying 'good' in response to children being separated from their parents, but after listening to it again he clearly said 'go ahead' to the moderator. I erased the tweet, apologies for the error,\" he wrote on Twitter.", "Based on our research, the claim that Trump said immigrant children separated from their parents at the border is \"good\" is FALSE. In reality, as moderator Kristen Welker prompted the candidates to move onto the next section of the debate, Trump told her to \"go ahead.\"", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more."]