["By D'Angelo Gore", "Posted on November 17, 2017", "Nonpartisan congressional analysts estimate that 13 million fewer Americans would have health insurance by 2025 if the health care law’s individual mandate is repealed. But that doesn’t mean that all 13 million would be kicked off their insurance plans, as some Democrats claim.", "Many of them would voluntarily give up their health coverage. They would not have it taken away.", "Senate Republicans amended their version of a bill overhauling the U.S. tax code to include a provision that eliminates the Affordable Care Act’s penalties for most individuals who do not purchase health insurance.", "Democrats opposed to the plan are now distorting a report from the Congressional Budget Office and the Joint Committee on Taxation that says scrapping the mandate would reduce federal deficits by $338 billion over the next 10 years, but result in 4 million fewer people having insurance in 2019 and 13 million fewer having coverage from 2025 to 2027.", "Because fewer people would have insurance, the CBO and JCT estimate that the government would spend less on those who receive subsidized coverage through Medicaid and the insurance marketplaces established by the Obama-era health care law.", "In a Nov. 14 speech on the Senate floor, Democratic Minority Leader Chuck Schumer said, “President Trump’s absurd idea to repeal the individual mandate as a part of this bill would boot, according to CBO, 13 million people from the health insurance rolls and cause premiums to skyrocket.”", "In a tweet the next day, Sen. Richard Durbin, the second-ranking Democrat, wrote that “Republicans now want to pay for tax cuts for the wealthy by taking health care away from 13 million Americans.”", "Then, Sen. Elizabeth Warren piled on during a Nov. 16 interview on MSNBC’s “Morning Joe,” when she asked: “Who thinks you go forward on a health care plan that’s going to … knock 13 million people off health care?”", "But, again, they wouldn’t all be booted or knocked off the insurance rolls.", "In 2025, if the mandate was rescinded, an estimated 5 million fewer people would be enrolled in Medicaid; 5 million fewer people would get insurance through the nongroup or individual market; 3 million fewer people would get insurance through their employer; and as many as 500,000 fewer would no longer have some other form of health insurance.", "CBO and JCT say “those effects would occur mainly because healthier people would be less likely to obtain insurance and because, especially in the nongroup market, the resulting increases in premiums would cause more people to not purchase insurance.”", "The altered Senate bill would effectively nullify the individual mandate by removing the penalty payment. In their report, CBO and JCT say that would produce an outcome similar to an outright repeal of the insurance requirement.", "“If the individual mandate penalty was eliminated but the mandate itself was not repealed, the results would be very similar to those presented in this report,” the analysts say. “In CBO and JCT’s estimation, with no penalty at all, only a small number of people who enroll in insurance because of the mandate under current law would continue to do so solely because of a willingness to comply with the law.”", "Schumer’s office argued that the joint analysis actually supports the senator’s claim.", "“If premiums become unaffordable to the point that people forgo health insurance, we think it’s more than fair to say this is the same as kicking people off health care,” his office wrote in an email to FactCheck.org.", "Healthier people opting out would increase average premiums in the individual or nongroup market by 10 percent in most years, CBO and JCT say. That, in turn, would cause some others not to purchase coverage for financial reasons.", "Still, expected premium hikes wouldn’t force all 13 million out of the insurance market. The report doesn’t say how many would willingly give up insurance and how many would be priced out of the market.", "Rising premiums wouldn’t even necessarily account for all of the decline in the number of Americans who purchase their own insurance on the nongroup market. It also wouldn’t be a deciding factor for the estimated 5 million who would have otherwise enrolled in Medicaid.", "In some cases, higher premiums would be offset by higher government subsidies in the form of premium tax credits for those eligible to receive them. As of March 2017, 84 percent of people purchasing health insurance through federal and state marketplaces received premium tax credits, according to the Centers for Medicare and Medicaid Services.", "The fact is, the CBO and JCT say that many of the 13 million, perhaps most of them, wouldn’t keep or obtain coverage because they wouldn’t be penalized for not doing so. That’s not the same as saying 13 million people will be kicked off their plans.", "FactCheck.org Rating:", "Read More", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]