["About this rating", "Several videos showing people attempting the \"Sharpie Shock Challenge\" circulated on YouTube in April 2016. While these videos were accompanied by varying descriptions, the basics of the challenge was summed up by the \"10 Steps\" YouTube channel:", "Sharpie shock challenge - see how to make your phone \"shock\" you by using a sharpie and the flash of your phone camera. Be sure to Put the flash on your phone directly on the black sharpie square.", "These \"shocks\" people are receiving in these videos appear to be exaggerated. We are unaware of any specific scientific principle that could explain how a brief camera flash could heat up a Sharpie marking pen enough to induce a shock, or how Sharpie ink could facilitate conducting electricity. After viewing several \"Sharpie Shock Challenge\" videos, it's clear that some people are better actors than others, or else they're just more sensitive:", "So why would anyone go through with this challenge if they believed it would result in pain?  Some people are sensation seekers, a psychological term that describes the likelihood that someone will take risks (calculated or otherwise) in order to satisfy their curiosity.", "Psychology professor Marvin Zuckerman helped develop a personality assessment (the Zuckerman-Kuhlman Personality Inventory), an alternative to the widely-used \"Big Five\" personality tests, which uses \"sensation seeking\" as a personality trait, rather than \"openness to experience\":", "Zuckerman defined the Sensation Seeking (SS) personality trait as: ‘‘...the need for varied, novel, and complex sensations and experiences and the willingness to take physical and social risks for the sake of such experience’’ (1979; pp.10).This trait has been related with the proneness to high stimulating activities such as adventure sports, exotic meals, intake of drugs, sex, illegal activities, and so forth. These behaviours can also be attributed to extraverted and impulsive individuals.", "In fact, Eysenck (1990) included SS as a primary trait inherent to Extraversion. In this way, Zuckerman related SS with the optimal level of stimulation and arousal theory (Zuckerman, 1969), the same biological base postulated for Extraversion by Eysenck (1967).", "In other words, curiosity can be so strong in some individuals that it effectively overrides the natural human tendency to avoid pain in order to see what could happen.", "Our own tests of the \"Sharpie Shock Challenge\" had mixed results. One researcher experienced nothing that resembled a shock, but another reported that they felt a small \"pinch\" of heat when the camera flashed. This may be due to the fact that the color black absorbs heat more quickly than other colors:", "A black object absorbs all wavelengths of light and converts them into heat, so the object gets warm. A white object reflects all wavelengths of light, so the light is not converted into heat and the temperature of the object does not increase noticeably.", "When a strong flash of light is concentrated on a patch of black, as in the Sharpie Shock Challenge, it's fathomable that some people will experience a quick sensation of heat that may feel like a slight electric shock.", "Arnett, Jeffrey.       \"Sensation Seeking: A New Conceptualization and a New Scale.\"\r\n     Personality and Individual Differences, Vol. 16, No. 2.  1994.", "Zuckerman, Marvin et al.    \"A comparison of three structural models for personality: The Big Three, the Big Five, and the Alternative Five.\"\r\nJournal of Personality and Social Psychology, Vol 65(4).    October 1993.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]