["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "On Nov. 28, 2011, the Democratic National Committee released two videos designed to paint Republican presidential candidate and former Massachusetts Gov. Mitt Romney as a serial flip-flopper. The shorter, 30-second version gives a taste of the attack, specifically citing abortion and health care, and directs viewers to a website with a four-minute version that offers alleged flip-flops on a variety of other issues.", "For this item, we’ll check one of the claims from the four-minute version -- specifically, whether Romney has changed his position on signing a taxpayer protection pledge. We're looking at other aspects of the ad in separate items.", "Here’s the relevant portion from the DNC ad:", "Screen text: Will not sign pledge", "Audio of Candy Crowley: \"Republican Mitt Romney says he will not sign a no-new-taxes pledge.\"", "Screen text: Then he did", "Audio from Romney radio ad: \"I’m proud to be the only major candidate for president to sign the tax pledge.\"", "The first clip refers to an announcement during Romney’s 2002 gubernatorial campaign that he would not sign a pledge circulated by Citizens for Limited Taxation, a Massachusetts-based anti-tax group.", "Here’s how the Boston Globe covered the news:", "\"In a break with Acting Governor Jane Swift and her GOP predecessors, Republican gubernatorial candidate Mitt Romney is refusing to rule out tax increases and said yesterday he will not sign a ‘no new taxes’ pledge,\" the newspaper wrote. \"Romney said that while he opposes all tax increases in principle, he will not make such a pledge in writing.\"", "The article went on to quote Romney saying, \"I am not in favor of increasing taxes. … At this stage, I am inclined to make that position as clear as I can but not to enter into a written pledge of some kind, and that's true on this and other issues.\"", "The Globe cited another comment by Romney that had been reported by the Union-News of Springfield, Mass. \"I'm against tax increases,\" Romney told attendees of Western Massachusetts GOP meeting, according to the Union-News. \"But I'm not intending to, at this stage, sign a document which would prevent me from being able to look specifically at the revenue needs of the Commonwealth.\"", "Barbara Anderson, an official with Citizens for Limited Taxation, was unhappy with Romney's refusal to sign, which came after he’d met with her for half an hour. \"He's thinking like an independent businessman who doesn't sign pledges,\" she suggested to the Globe.", "Meanwhile, the Boston Herald quoted then Romney deputy campaign manager Eric Fehrnstrom saying, \"Mitt Romney doesn't have to sign a piece of paper to have a position on an issue. He's pledged to oppose any tax increase, he doesn't support them, his position on taxes is clear.\"", "In an interview with the Globe, Fehrnstrom was even more dismissive, calling the pledge \"government by gimmickry,\" the newspaper reported.", "Put it all together and you have a candidate who didn’t just decide against signing a pledge but who cast doubt on the propriety of such pledges in general.", "Now we’ll fast-forward a few years, when Romney, having finished a term as governor of Massachusetts, was running for president. On Dec. 31, 2006, Romney became the first major candidate for the 2008 election to sign a taxpayer protection pledge offered by Americans for Tax Reform, the anti-tax group headed by Grover Norquist.", "\"In signing the pledge, Gov. Romney firmly commits himself in writing to fiscal discipline and economic common sense,\" Norquist said in a news release. \"Mitt Romney has told taxpayers in no uncertain terms that he plans to look out for their interests.\"", "Romney hardly signed the Norquist pledge covertly. On Jan. 4, 2007, he issued a press release touting his action, and on Oct. 5, 2007, he released a radio ad spotlighting it. That’s where the DNC got the clip used in its ad.", "\"For years, conservative candidates for president signed their name on the dotted line pledging to oppose tax increases,\" Romney said in the ad. \"I'm Mitt Romney. I'm proud to be the only major candidate for president to sign the tax pledge. The others have not. I signed the tax pledge because I want everyone to know where I stand. We've got to get taxes down and grow our economy. I believe it's not fair that you have to pay taxes when you earn your money, when you save your money and when you die. That's why I'll kill the death tax once and for all and roll back tax rates across the board. And savings? When I'm president, for every middle class American, the new tax rate on your interest, dividends, and capital gains will be absolutely zero. I stood firm to roll back taxes as governor. I'll roll back taxes as president.\"", "In this case, then, Romney not only signed a written pledge but actively broadcast it to the electorate.", "It’s worth noting that the two pledges are not exactly the same. One addressed the state context and one the federal context.", "The Massachusetts text is a \"pledge to ... all the people of this state, that I will oppose and vote against any and all efforts to increase taxes.\"", "The Norquist pledge, to which Romney is still a signatory, requires the signer to \"oppose any and all efforts to increase the marginal income tax rates for individuals and/or businesses … and oppose any net reduction or elimination of deductions and credits, unless matched dollar for dollar by further reducing tax rates.\"", "Still, despite the differences in wording, we think the pledges are equivalent in their underlying requirements.", "Our ruling", "In 2002, Romney refused to make \"a pledge in writing\" on taxes. Four years later, he signed one and touted it as a selling point for his candidacy. In our book, that’s a clear flip-flop. We rate the DNC’s charge True.", "Democratic National Committee, \"Mitt v. Mitt\" (four-minute version), Nov. 28, 2011\n\nBoston Globe, \"Romney Won’t Sign a Pledge of No New Tax,\" March 28, 2002 (accessed via Lexis-Nexis)\n\nBoston Herald, \"Romney refuses to sign CLT's 'no new tax' pledge,\" March 28, 2002 (accessed via Lexis-Nexis)\n\nAssociated Press, \"Romney refuses to take ‘no new taxes’ pledge,\" March 27, 2002 (accessed via Lexis-Nexis)\n\nMitt Romney for President, \"Romney For President Launches New Radio Ad, ‘Tax Pledge’\" (press release), Oct. 5, 2007 (archived by the University of California, Santa Barbara)\n\nMitt Romney for President, \"Governor Mitt Romney Signs ‘Taxpayer Protection Pledge’\" (press release), Jan. 4, 2007 (archived by the University of California, Santa Barbara)\n\nAmericans for Tax Reform, \"Mitt Romney Signs Taxpayer Protection Pledge\" (press release), undated", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]