["About this rating", "In January 2020, readers asked us about viral Facebook posts that offered a particularly poignant perspective in the U.S. on the U.S.-ordered assassination of Major General Qassem Soleimani, head of Iran's elite clandestine Quds Force.", "On Jan. 3, the following message was posted to Facebook:", "For those people who want to apologize to Iran for the killing of Qassem Soleimani, I present you with Army Captain Brian S. Freeman.", "Brian was a loving husband, father, Olympic caliber athlete and Army Civil Affairs team leader who actually cared about people regardless of who they were, where they came from, what God they worshipped, or their politics. 13 years ago this month, Cpt. Brian Freeman and his team of Civil Affairs soldiers were in Karbala, Iraq at a meeting to help improve the lives of the people of that province. During that meeting, a team under the command of Gen. Qassem Soleimani, stormed in, killing a number of Americans, and capturing Brian and several members of his team.", "The captured CA team members were handcuffed, driven away from the meeting and later executed. Once found, in spite of our best efforts, several medics, including myself, unsuccessfully attempted to save Brian. Captain Freeman is but one of the lives lost due to the evil of Qassem Soleimani.", "Qassem Soleimani was an evil person whose end, regardless of the politics surrounding it is a good thing. With that, anyone apologizing to Iran for Soleimani's death is, I feel, pandering to an oppressive regime out of either ignorance, moral bankruptcy, or in a heartless attempt at self-promotion. Rest in Peace Brian.", "That message was promulgated even further when it was re-posted by another user.", "According to the U.S. Department of Defense, sufficient evidence and intelligence exists to conclude that the January 2007 attack in Karbala, Iraq, which killed five U.S. service members including Freeman, was one of several that was directed, planned, and funded by the Quds Force — an elite branch of Iran's Islamic Revolutionary Guard. Soleimani was head of that force until his death on Jan. 2, 2020. So the key claim made in the Facebook posts shared so widely in January — that Soleimani, as senior leader of the Quds Force, was responsible for the death of Freeman — reflects the official position and conclusion of the U.S. government.", "However, both the Iranian government and Soleimani himself have denied any Quds Force involvement in attacks perpetrated against U.S. forces in Iraq at that time of Freeman's death. We asked the Department of Defense (DOD) if it could provide evidence that would demonstrate the role of the Quds Force, and Soleimani in particular, in the planning or ordering of the attack, but we received no response.", "The claim that Soleimani was, at least in part, responsible for the death of Freeman and four others in the January 2007 attack appears quite plausible. However, evidence that would definitively demonstrate that responsibility is not publicly available, and as a result, we are issuing a rating of \"Unproven.\" If we obtain such evidence, we will update this fact check accordingly.", "Freeman was assigned to the 412th Civil Affairs Battalion and was attending meetings at the Provincial Joint Coordination Center in Karbala, on Jan. 20, 2007. Around 5 p.m. local time that day, insurgents wearing U.S.-style military uniforms attacked the compound. Here's how DOD described the attack, a week later:", "At about 5 p.m. that day, a convoy consisting of at least five sport utility vehicles entered the Karbala compound and about 12 armed militants attacked the American troops with rifle fire and hand grenades, officials said. One soldier was killed and three others wounded by a hand grenade thrown into the center's main office. Other explosions within the compound destroyed three Humvees.", "The attackers withdrew with four captured U.S. soldiers and drove out of the Karbala province into the neighboring Babil province. Iraqi police began trailing the assailants after they drew suspicion at a checkpoint.", "Three soldiers were found dead and one fatally wounded, along with five abandoned vehicles, near the town of Mahawil. Two were found handcuffed together in the back of one of the vehicles. The other two were found nearby on the ground. One soldier was found alive but died en route to a nearby hospital. All suffered from gunshot wounds. Also recovered at the site were U.S. Army-type combat uniforms, boots, radios and a non-U.S. made rifle, officials said.", "The five U.S. service members listed as killed in the attack were:", "Due to the relative sophistication of the attack, U.S. military officials quickly suspected Iranian involvement in its planning. By July 2007, DOD had come to the conclusion that the Karbala attack was indeed one of several carried out against U.S. and Coalition forces in Iraq, which had been planned and directed by Iran, specifically by \"senior leadership\" of the Quds Force. At that time, Soleimani was the head of the Quds Force. Here's how the Department of Defense described that Iranian involvement in a July 2007 statement:", "While al Qaeda in Iraq remains the main enemy in the country, coalition and Iraqi forces are increasingly targeting groups whose training, funding and supplies come from Iran, a spokesman for Multinational Force Iraq said today.", "Army Brig. Gen. Kevin Bergner also said Iran is funding Hezbollah operatives in Iraq. Hezbollah is a Shiia extremist group based in Lebanon. The terror group has seats in the Lebanese parliament and operates as a shadow government for Shiia areas of that country. Iran trains, supplies and funds that group.", "Actions against these Iraqi groups have allowed coalition intelligence officials to piece together the Iranian connection to terrorism in Iraq. Bergner said that Iran’s Quds Force, a special branch of Iran’s Revolutionary Guards, is training, funding and arming the Iraqi groups.", "... The groups operate throughout Iraq. They planned and executed a string of bombings, kidnappings, sectarian murders and more against Iraqi citizens, Iraqi forces and coalition personnel. They receive arms -- including explosively formed penetrators, the most deadly form of improvised explosive device -- and funding from Iran. They also have received planning, help and orders from Iran, Bergner said.", "Of greatest relevance to this fact check, U.S. Army Brig. Gen. Kevin Bergner said two men prominently involved in the series of attacks, including the Karbala attack — Ali Musa Daqduq and Qayis Khazali — had themselves not only acknowledged the role of the Quds Force in planning and funding the Karbala attack, but said Iran's assistance was essential to its execution.", "One group leader was Azhar Dulaymi, whom coalition forces killed May 19. Bergner said the terrorist led the Jan. 20 attack on the Provincial Joint Coordination Center in Karbala that killed five U.S. soldiers. Dulaymi worked closely with Ali Musa Daqduq and Qayis Khazali, two men with direct links to Iran. Coalition forces captured Daqduq on March 20. “He is Lebanese-born and has served for the past 24 years in Lebanese Hezbollah,” Bergner said. “He was in Iraq working as a surrogate for Iranian Revolutionary Guards Corps Quds Force operatives involved with special groups.”", "Daqduq, a member of Hezbollah in Lebanon since 1983, served as a bodyguard for Hezbollah leader Sayyad Hassan Nazrullah. He also led Hezbollah operations in large areas of Lebanon, Bergner said.", "“In 2005, he was directed by senior Lebanese Hezbollah leadership to go to Iran and work with the Quds Force to train Iraqi extremists,” the general said. “In May 2006, he traveled to Tehran with Yussef Hashim, a fellow Lebanese Hezbollah and head of their operations in Iraq. There they met with the commander and deputy commander of the Iranian Quds Force special external operations.”", "Daqduq was ordered to Iraq to report on the training and operations of the Iraqi special groups. “In the year prior to his capture, Ali Musa Daqduq made four trips to Iraq,” Bergner said. “He monitored and reported on the training and arming of special groups in mortars and rockets, manufacturing and employment of improvised explosive devices, and kidnapping operations. Most significantly, he was tasked to organize the special groups in ways that mirrored how Hezbollah was organized in Lebanon.”", "Daqduq also helped the Quds Force in training Iraqis inside Iran. “Quds Force, along with Hezbollah instructors train approximately 20 to 60 Iraqis at a time, sending them back to Iraq organized into these special groups,” he said. “They are being taught how to use (explosively formed penetrators), mortars, rockets, as well as intelligence, sniper and kidnapping operations.” The Quds Force also supplies the groups with weapons and a funding stream of between $750,000 to $3 million a month. “Without this support, these special groups would be hard-pressed to conduct their operations in Iraq,” Bergner said.", "...Khazali was captured with Daqduq. He was in charge of these groups throughout Iraq since June 2006. He is an Iraqi who worked to develop the Iraqi groups into a network similar to Hezbollah.", "“It is important to point out that both Ali Musa Daqduq and Qayis Khazali state that senior leadership within the Quds Force knew of and supported planning for the eventual Karbala attack that killed five coalition soldiers,” Bergner said. “Ali Musa Daqduq contends the Iraqi special groups could not have conducted this complex operation without the support and direction of the Quds Force.\"", "“Ali Musa Daqduq and Qayis Khazali both confirm that Qayis Khazali authorized the operation and Azhar al Dulaymi, who we killed in an operation earlier this year, executed the operation.” All of this is counter to pledges Iran has made to the Iraqi government to respect territorial boundaries and work to ease violence inside Iraq, Bergner said. [Emphasis is added].", "So the official position of the U.S. government has been that the Karbala attack which killed Freeman and four other service members was one of several attacks on U.S. and Coalition forces in Iraq which were planned, coordinated, funded or directed by the Quds Force, and that two terrorists captured months later had themselves said \"senior leadership\" of the Quds Force (which can reasonably be understood to mean Soleimani) \"knew of and supported planning\" for the Karbala attack.", "This would certainly appear to lend credibility to the claim, in widely shared Facebook posts, that the forces that killed Freeman were commanded by Soleimani, though it seems more likely they were trained and commanded by others, as part of a broader strategy overseen and directed by Soleimani, on behalf of the Iranian government.", "However, definitive proof of Quds Force and Soleimani involvement in the Karbala attack is not publicly available. We asked DOD to provide any evidence, potentially including correspondence or statements made by participants such as Daqduq or Khazali, that would corroborate and support the official U.S. position on responsibility for the Karbala attack. Unfortunately, we did not receive a response.", "Furthermore, both the Iranian government and Soleimani himself denied being responsible for attacks on U.S. forces in Iraq. After Bergner's July 2007 briefing, an Iranian Foreign Ministry spokesperson rejected allegations of Iranian involvement, in general, non-specific terms, saying: \"American leaders have gotten into the habit of issuing ridiculous and false statements without providing evidence, with political and psychological aims.” The country's defense minister, Mohammad Najar, also reportedly denied Iranian \"military interference\" in Iraq.", "In 2007, shortly after the Karbala attack, then-U.S. Ambassador to Iraq Zalmay Khalilzad sent a diplomatic cable in which he recounted a meeting with Iraqi President Jalal Talabani. According to Khalilzad, Talabani had met with Soleimani in Syria, and the Quds Force leader had assured the president he was not directing attacks on American troops in Iraq, reportedly saying: \"I swear on the grave of Khomeini I haven't authorized a bullet against the U.S.\"", "Those denials should be viewed with an appropriate degree of skepticism, but they must be noted. The Iranian denials, combined with the absence of publicly available evidence that definitively demonstrates Iranian, Quds Force, or Soleimani responsibility for the Jan. 20, 2007, attack that killed Freeman and four other Americans in Karbala, means we are, for now, issuing a rating of \"Unproven.\"", "American Forces Press Service.  \"Karbala Attackers Used U.S. Army-Styled Uniforms to Gain Access.\"\r\n  U.S. Department of Defense.  26 January 2007.", "CNN.  \"Iran Involvement Suspected in Karbala Compound Attack.\"\r\n  31 January 2007.", "Garamone, Jim.  \"Iran Arming, Training, Directing Terror Groups in Iraq, U.S. Official Says.\"\r\n  American Forces Press Service, U.S. Department of Defense.  2 July 2007.", "NBC News/The Associated Press.  \"U.S. Accuses Iran of Role in Deadly Attack in Iraq.\"\r\n  2 July 2007.", "Gordon, Michael R.  \"U.S. Ties Iran to Deadly Iraq Attack.\"\r\n  The New York Times.  2 July 2007.", "Gordon, Michael R. and Bernard E. Trainor.  \"The Endgame: The Inside Story of the Struggle for Iraq, From George W. Bush to Barack Obama.\"\r\n  Knopf Doubleday Publishing Group.  25 September 2012.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]