["The Facebook post was published here on April 8 by a page with more than 14,000 followers.", "The caption states: “#convert to Islam from Japan. Islam is the highest and nothing is higher than it. Islam is the Religion of Peace and Love.”", "Below is a screenshot of the post:", "A reverse image search on Google found that the image actually shows Professor Jackie Y. Ying.", "This article published by online magazine Asian Scientist on January 19, 2017, shows the same photo of Professor Ying.", "Below is a screenshot of the article:", "The article states Professor Ying is “executive director of the Institute of Bioengineering and Nanotechnology (IBN)”.", "The IBN is based in Singapore. This is its address listed on the Singaporean government website.", "According to this online press release published by the Singapore government’s Agency for Science, Technology and Research on December 24, 2015, Professor Ying was “born in Taiwan, raised in Singapore and New York.”", "In this report published by Singapore based news site Asia One on April 9, 2013, it states Professor Ying converted to Islam in her “early 30s”.", "This report published by Singapore based newspaper The Straits Times on December 13, 2017, also states Professor Ying “converted to Islam in her 30s”.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]