["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "White House counsel Pat Cipollone arrives on Capitol Hill on Jan. 21, 2020, the first full day of President Donald Trump's impeachment trial. (AP)", "On the first full day of President Donald Trump’s Senate impeachment trial, White House Counsel Pat Cipollone claimed that House Democrats had run roughshod over the president’s procedural rights by denying Republicans access to key parts of the investigation.", "Cipollone had several complaints, but one stood out to us as clearly wrong.", "\"Not even (House Intelligence Chairman Adam) Schiff’s Republican colleagues were allowed into the SCIF\" during the House impeachment investigation, Cipollone said on the Senate floor Jan. 21. (A \"SCIF,\" which stands for \"sensitive compartmented information facility,\" is a secure government facility where classified intelligence can be discussed without eavesdropping.)", "Cipollone’s assertion echoed one made by, and on behalf of, a group of Republicans who staged a sit-in at the House Intelligence committee, to protest what they argued were unfair ground rules for the Republican minority during the House impeachment inquiry.", "On Oct. 23, more than 40 Republican lawmakers disrupted witness testimony by storming the SCIF where depositions were under way, chanting, \"Let us in!\"", "At the time of the sit-in, Republicans could argue that that the impeachment hearings had only taken place behind closed doors and without transcripts being formally released. (Those transcripts were later released to the public, minus redactions for national-security reasons.)", "But what about access to the depositions at the Intelligence Committee? Were all Republicans banned? No.", "In the recent impeachment, House Speaker Nancy Pelosi, D-Calif., instructed three House committees — Oversight, Intelligence and Foreign Affairs — to carry out an investigation that the House Judiciary Committee eventually used to draft articles of impeachment. All three committees and all of their members had access to depositions in the SCIF.", "There are nine Republicans on the House Intelligence Committee, 17 on the House Oversight Committee, and 21 on the House Foreign Affairs Committee.", "All 47 of those Republicans have been able to participate and ask questions in the interviews and depositions held to this point, Ashley Etienne, Pelosi’s communications director, told PolitiFact last October. Independent experts told us the same thing.", "Some Republican House members, such as Florida Rep. Matt Gaetz, who organized the Oct. 23 protest, were kept out of the hearings not because of their party affiliation, but because they did not sit not on the relevant committees. (Democrats who weren’t on the committees were kept out as well.) Some, such as Rep. Ted Yoho of Florida, chose not to attend despite being able to do so.", "The proof is also in the transcripts that were publicly released: Republican lawmakers and staff asked questions of witnesses, with the witness responding under oath.", "One analysis by Philip Bump of the Washington Post found that Republican lawmakers made extensive use of their questioning powers in the deposition of Lt. Col. Alexander Vindman, a member of the National Security Council. He did this by tallying up the number of lines devoted to each party’s remarks in the transcript that was eventually released.", "\"About 44% of the transcript is made up of questions or answers from Democratic members or staff,\" Bump wrote. \"About 41% is from the Republicans. The remaining 15% was discussion and objections.\"", "Neither the White House nor Trump’s 2020 re-election campaign replied to our query asking for evidence that backed Cipollone’s claim.", "Cipollone said, \"Not even Schiff’s Republican colleagues were allowed into the SCIF\" during the House impeachment investigation.", "Not only were they allowed in, but there’s voluminous evidence in the deposition transcripts that they asked questions extensively and received answers under oath.", "We rate the statement False.", "C-SPAN, Senate impeachment coverage, Jan. 21, 2020", "Aaron Rupar, tweet, Jan. 21, 2020", "PolitiFact, \"Limbaugh wrongly claims Republicans are being shut out of impeachment hearings,\" Oct. 30, 2019", "Axios, \"House Republicans storm closed impeachment hearing in protest,\" Oct. 23, 2019", "Washington Post, \"Here’s how little Republicans were allowed to participate in the closed-door depositions,\" Nov. 12, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]