["The photo  was published here in a Facebook post on December 8, 2020.", "The post’s caption reads: “Canadian Prime Minister Justin Trudeau sat on a sit-in with Indians against the anti-farmer black law in Canada. #BharatBandh #RepresentationalImage.”", "The photo was shared as Indian farmers protest against new agriculture laws. Here is an AFP report on the issue.", "“#BharatBandh” refers to the protesting farmers' call for a country-wide strike on November 8, 2020 as reported here by The New Indian Express.", "The photo was also shared here, here, here and here on Facebook and here, here, here and here on Twitter, alongside identical claims in English and Hindi.", "The claim is false.", "A Google reverse image search found the same photo was published here in a report by Hindustan Times on November 24, 2015 alongside more photos of Trudeau with members of the Sikh community.", "“In a first-of-its-kind event, Canadian Prime Minister Justin Trudeau visited a Hindu temple and a gurdwara in Ottawa to celebrate Diwali with the Indo-Canadian community, which turned out in huge numbers to greet him,” says the report, which credits the photo to Reuters news agency.", "The report says Trudeau visited two venues on the same day - a Hindu temple and a gurdwara. But another photo in the same report, which shows Trudeau in similar surroundings as in the above photo, was taken at the Gurdwara Sahib Ottawa Sikh Society, according to its caption. This indicates the photo in question is likely showing him at the gurdwara, instead of the Hindu temple.", "“Canadian Prime Minister Justin Trudeau kneels as he arrives at the Gurdwara Sahib Ottawa Sikh Society in Ottawa, Canada,” reads the photo caption credited to Reuters.", "Diwali, also known as the festival of light and prosperity celebrated by Hindus, Sikhs and Buddhists around the world, was celebrated on November 11 in 2015.", "A further search by keywords found the photo was published here on the website of Ottawa-based Canading photographer and video producer Patrick Doyle. It states the photo was taken at the Gurdwara Sahib Ottawa Sikh Society in Ottawa, Canada.", "“Canadian Prime Minister Justin Trudeau listens to speeches at the Gurdwara Sahib Ottawa Sikh Society in Ottawa, Canada, November 11, 2015. Photo by Patrick Doyle,” reads the photo's caption.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]