["Since the beginning of his campaign, Biden’s foot has been no stranger to his mouth. The self-described “gaffe machine” is under fire again as Republican leaders promote a recent quote as a confession of wide-scale voter fraud.", "“We have put together, I think, the most extensive and inclusive voter fraud organization in the history of American politics,” Biden said in a clip posted to Instagram Oct. 24.", "“At least he’s telling the truth about something,” an Instagram user captioned the post.", "RNC Research quickly jumped on Biden’s mistake, sharing the clip on Twitter that afternoon. White House press secretary Kayleigh McEnany, Eric Trump and the president tweeted about the short clip the same day.", "“What a terrible thing for Biden to say!,” Trump added. “Rigged Election?”", "Trump also shared the 24-second clip on his YouTube channel, where it’s been viewed 500,000 times.", "The Instagram user that posted the clip has not responded to USA TODAY's request for comment.", "Fact check:Satire article misrepresents Biden's abortion stance", "Biden made the statement while on the liberal podcast \"Pod Save America.\" The Oct. 24 podcast, video recording and transcript show Biden was discussing countering voter suppression rather than encouraging voter fraud.", "When podcast host Dan Pfeiffer asked, “What’s your message to the folks who have not yet voted or do not yet have a plan to vote?” Biden responded:", "“Republicans are doing everything they can to make it harder for people to vote. Particularly people of color to vote. So go to iwillvote.com. Secondly, we’re in a situation where we have put together, and you guys did it for President Obama’s administration before this, we have put together, I think, the most extensive and inclusive voter fraud organization in the history of American politics. What the president is trying to do is discourage people from voting by implying that their vote won’t be counted. It can’t be counted. We’re going to challenge it and all these things.’", "I Will Vote is a voter information website where Americans can check their registration status, register to vote and learn about voting laws in every state. The site is run and paid for by the Democratic National Committee.", "He then encouraged voters to help their friends, family and neighbors cast their ballots.", "Fact check:Ballot positions are done by a random draw in each county in Arkansas", "“And make the case to your friends, make your case to your friends that they can’t complain if they don’t vote,” he said. “And because I think the American people are going to show up, Dan, in such large numbers, there’s going to be no way to avoid the outcome.\"", "The Biden’s campaign confirmed in a statement sent to multiple media outlets that he was describing his campaign's efforts to fight voter suppression and counter Trump’s false accusations of widespread voter fraud.", "“The President of the United States has already demonstrated he’s willing to lie and manipulate our country’s democratic process to help himself politically, which is why we have assembled the most robust and sophisticated team in presidential campaign history to confront voter suppression and fight voter fraud however it may present itself,” wrote Biden’s national press secretary T.J. Ducklo.", "In October, USA TODAY, Columbia Journalism Investigations and PBS’s “Frontline” used the conservative Heritage Foundation’s Election Fraud Database to investigate widespread voter fraud via mail-in voting. The investigation found claims that mail-in voter fraud could turn a major election were unfounded.", "Biden’s campaign did not respond to USA TODAY’s request for comment.", "Fact check:Viral video claiming to show 'shredded mail-in ballots' is of printing waste", "Snopes’ investigation of Biden's statement found the term “voter fraud organization” was his confusing shorthand for the campaign’s election protection program against false allegations of voter fraud.", "Fox News reported on Biden’s controversial statement and concluded it was likely that he misspoke. Fox concluded Biden was likely referring to his election protection program, which he’s discussed in many past interviews.", "More:Fact check: If he loses election, Biden said he wants to teach, but where is uncertain", "“Biden has a history of misstatements, including saying he was running for the Senate in mid-October and claiming 200 million Americans have died of coronavirus in mid-September,” wrote Fox.", "“You should ask Joe Biden if he stands by the words he uttered, not us for sharing them,” the RNC’s rapid response director Steve Guest later told CNN about the clip. “It's not the RNC's responsibility to clarify for the Biden campaign their candidate’s repeated blunders.\"", "Joe Biden did say he had created a \"voter fraud organization,\" however, the full interview shows the claim was a misstatement. Biden was referring to his campaign and the Democratic Party's election protection efforts to combat voter suppression. We rate this claim MISSING CONTEXT because our research shows the claim is not as it seems.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more."]