["About this rating", "On 27 July 2018, as part of a broader story about foreign espionage in Silicon Valley, Politico reported that a member of California senator Dianne Feinstein’s staff had been recruited by Chinese intelligence five years earlier and that this staffer “reported back to China about local politics.” The article cited “former intelligence officials” in noting that:", "Former intelligence officials told me that Chinese intelligence once recruited a staff member at a California office of U.S. Senator Dianne Feinstein, and the source reported back to China about local politics. (A spokesperson for Feinstein said the office doesn’t comment on personnel matters or investigations, but noted that no Feinstein staffer in California has ever had a security clearance.)", "The revelation was significant in part because Feinstein was chair of the powerful Senate Select Committee on Intelligence at the time. According to the San Francisco Chronicle, the staff member in question served as Feinstein’s driver and gofer in her Bay Area office and was a liaison to the local Asian-American community:", "Besides driving her around when she was in California, the staffer also served as gofer in her San Francisco office and as a liaison to the Asian American community, even attending Chinese Consulate functions for the senator.", "According to our source, the intrigue started years earlier when the staffer took a trip to Asia to visit relatives and was befriended by someone who continued to stay in touch with him on subsequent visits.", "That someone was connected with the People’s Republic of China’s Ministry of State Security.", "“He didn’t even know what was happening -- that he was being recruited,” says our source. “He just thought it was some friend.”", "On 6 August 2018, Feinstein issued a statement on the matter, saying that several years earlier she had been informed by the FBI about the possible recruitment efforts targeting one of her staff and had removed the individual when she learned the details:", "Five years ago the FBI informed me it had concerns that an administrative member of my California staff was potentially being sought out by the Chinese government to provide information. He was not a mole or a spy, but someone who a foreign intelligence service thought it could recruit.", "The FBI reviewed the matter, shared its concerns with me and the employee immediately left my office. He never had access to classified or sensitive information or legislative matters. The FBI never informed me of any compromise of national security information.", "Some partisan news outlets such as Fox News, as well as President Trump himself, gave the controversy oxygen by suggesting that the “mainstream” media’s lack of interest in the story exposed a partisan double standard in terms of how foreign meddling in political affairs is handled both by the media and by law enforcement.", "That argument holds that instead of providing Feinstein with a “defensive briefing” about the matter, the FBI should have opened an investigation into Feinstein, comparable to a current investigation involving President Trump and his campaign’s potential contacts with Russian operatives:", "This [story] has renewed questions among President Trump's allies about the bureau's approach in 2016 to suspicions regarding his campaign aides' potential Russian ties. In one case, the FBI briefed Feinstein; in the other, the bureau proceeded to use an informant and surveillance warrants to get information on Trump campaign figures.", "It is difficult to address the merits of this kind of argument based on what is publicly known about the case. The FBI has not commented on it, and according to Feinstein, no risk of the staff member in question's transferring sensitive material ever existed, as no one on the senator's California staff possessed security clearances necessary to have access to that kind of information in the first place.", "While the reporting on this topic vaguely suggested that the staff member “reported back to China about local politics,” it is uncertain whether this staff member ever provided the Chinese anything of value, or even whether efforts to recruit this individual were even successful:", "The FBI apparently concluded the driver hadn’t revealed anything of substance.", "“They interviewed him, and Dianne forced him to retire, and that was the end of it,” says our source.", "Dorfman, Zach.   \"How Silicon Valley Became a Den of Spies.\"\r\n    Politico.   27 July 2018.", "Matier, Phil and Andy Ross.   \"Feinstein Had a Chinese Spy Connection She Didn’t Know About — Her Driver.\"\r\n    San Francisco Chronicle.   1 August 2018.", "Hasson, Pater.   \"All Signs Point to One Man as Chinese Spy in Feinstein’s Staff, And He Wasn’t a Driver ...\"\r\n    The Daily Caller.   6 August 2018.", "Singman, Brooke.   \"FBI's Handling of Alleged Feinstein Spy Spurs Claims of Double Standard with Trump Campaign.\"\r\n    The Daily Caller.   7 August 2018.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]