["About this rating", "On 12 November 2016, the Tribunist web site reported that Medal of Honor recipient Dakota Meyer (who is also the son-in-law of former Alaska governor Sarah Palin) had been invited to the Marine Corps' 241st birthday celebration at the U.S. Embassy in Kabul, Afghanistan, but his invitation was revoked by the Obama administration (or, at least, by a U.S. ambassador) at the last minute for political reasons:", "As arrangements were being finalized, however, the Medal of Honor recipient was told that he would not be able to come. Why? Because Meyer has been an outspoken critic of the Obama administration.", "Ambassador P. Michael McKinley ordered his chief of mission to “look into” the Medal of Honor recipient and, based on the report he was given about Meyer’s political views, decided he would not allow Meyer to attend the ball inside the embassy.", "Meyer told us in a phone interview that “I was told he doesn’t like my position and comments on the administration, but those views are my right. Blocking access to the American embassy is his right as the ambassador.”", "Meyer, who was awarded the Medal of Honor for saving the lives of dozens of ambushed U.S. and Afghan soldiers in Kunar Province in 2009, was honorably discharged from the Marines in 2010. He co-wrote a book about his combat experiences, Into the Fire: A Firsthand Account of the Most Extraordinary Battle in the Afghan War, in 2012, and currently travels doing speaking engagements.", "Through a spokesperson, Meyer told snopes.com that the Tribunist account is accurate, though he would not reveal who told him that the decision against his attendance was based on political considerations to prevent retaliation against them.", "An official at the U.S. State Dept. gave us a different explanation, however, stating  that the decision was taken for safety reasons. Embassy security officers felt that such a high-profile visitor would have put everyone in attendance at higher risk of attack (and, in fact, the Embassy was shut down a few days later after a suicide bomb attack on Bagram Airfield). The same official told snopes.com that the U.S. Mission in Kabul has the highest respect for Sgt. Meyer and would welcome a visit from him in the future under better security conditions.", "Heil, Emily.   \"Bristol Palin and Husband Dakota Meyer Shop Around Downtown D.C.\"\r\nThe Washington Post.   3 November 2016.", "Solis, Steph.   \"U.S. Embassy in Afghanistan Closed After Suicide Bombing on Military Base.\"\r\nUSA Today.   13 November 2016.", "Congressional Medal of Honor Society.   \"Meyer, Dakota.\"\r\n2017.", "Tribunist.   \"Obama Administration Tells Medal of Honor Recipient He Cannot Attend Marine Corps Ball.\"\r\n12 November 2016.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]