["By Brooks Jackson", "Posted on February 2, 2017 | Updated on February 2, 2017", "House Minority Leader Nancy Pelosi said in a nationally televised town meeting on Jan. 31: “No, we [Democrats] don’t get much support from Wall Street.” That’s not so.", "Democratic House and Senate candidates pulled down nearly $47 million from bankers, stockbrokers, hedge fund officials, venture capitalists and private equity firms in the last election alone, according to tallies by the Center for Responsive Politics.", "To be sure, Republican congressional candidates got more — $62 million. But Democrats still received 43 percent of the Wall Street money going to congressional candidates.", "Pelosi’s denial of reality came in response to a comment made at the CNN town hall event. Questioner William Marsh, a steel-company executive, suggested that blue-collar, Midwestern “Reagan Democrats” had abandoned the party because they believe it no longer represents their values.", "William Marsh, Jan. 31: A lot of these workers feel that the core interest groups of the party do not represent their values. For example, the abortion rights activists, the environmental activists, Wall Street, Wall Street lawyers.", "Pelosi: Wall Street?", "Marsh: Yes, a lot of Wall Street supports the Democrat Party now and not the Republican Party.", "Pelosi: They don’t support me. …No, we don’t get much support from Wall Street.", "To check Pelosi’s claim, we turned to the Center for Responsive Politics, which tracks campaign money and categorizes it by industry. We selected totals for commercial bankers and for securities and investment firms (which include hedge funds, private equity firms and venture-capital firms) as falling under the general heading of “Wall Street.” The donations can come from individuals, political action committees, or both.", "From PACs and individuals giving $200 or more", "Perhaps Pelosi doesn’t consider $47 million to be “much,” but it’s more than the $44 million that Democratic congressional candidates received during the same period from labor union PACs and officials.", "And it doesn’t stop there. The Democratic Congressional Campaign Committee — a party organization devoted to electing and re-electing Democrats to the House — received $4,799,059 from securities and investment firms and their employees in the last election. And the Democratic Senatorial Campaign Committee got $6,676,941 from the securities and investment industry, making it the fourth largest industry source for the DSCC, according to the Center for Responsive Politics’ tallies.", "As for Pelosi’s claim that Wall Street donors “don’t support me,” those in the securities and investment industry actually have contributed more than $1 million to her re-election campaigns since 1989, the third highest total from any industry group, according to the Center for Responsive Politics.", "And it’s still coming in. Her 2016 re-election campaign received $83,280 from securities and investment firm PACs and employees, and $20,930 from commercial bankers, for a total of more than $104,000.", "In addition, Pelosi’s personal PAC — “PAC to the Future” — took in $44,500 from securities and investment sources, and $13,500 from commercial bankers.", "Those totals are small fractions of the $4.2 million she raised for her 2016 re-election, and the $1.1 million raised by her PAC for the 2016 campaign.  But they are “support” nonetheless.", "Update, Feb. 2: After this story was posted, Drew Hammill, a Pelosi spokesman, contacted us to say, “Leader Pelosi spearheaded the passage of historic Dodd-Frank reforms that put the needs on Main Street ahead of Wall Street. There’s only one party that’s working hand in hand with corporate lobbyists to undo these critical reforms and that’s the Republican Party.”", "FactCheck.org Rating:", "Read More", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]