["By Corey Berman", "Posted on February 8, 2019", "A false claim circulating online states that Rep. Alexandria Ocasio-Cortez — in exchange for a border wall — “demands welfare” for immigrants living in the U.S. illegally. That story originated on a self-described satire site before spreading elsewhere online without any disclaimer.", "Following the longest government shutdown in American history, a bipartisan House-Senate panel is working to secure an agreement before another funding lapse is triggered on Feb. 15.", "Meanwhile, a false story circulating online claims that Rep. Alexandria Ocasio-Cortez has offered President Donald Trump a deal: “$2.7 billion for his wall if he grants amnesty to 1,000,000 impoverished undocumented immigrants and gives them access to food stamps and other benefits.”", "This story originated on America’s Last Line of Defense, a self-proclaimed satirical website, but it has since spread to other platforms. America’s Last Line of Defense is listed in our misinformation directory precisely because of how frequently its stories have misled readers in the past. In this case, the story has been reposted by Top Topic without a satire label, and shared on Facebook by a Tiffany Trump fan page, whose followers may not recognize that the story was intended as a joke.", "Regardless of its intent, the Last Line of Defense story perpetuates the false narrative that immigrants living in the U.S. illegally receive food stamps and other benefits. As we noted in a recent article, U.S. law already prohibits such immigrants from receiving most federal benefits. There are some exceptions, such as emergency medical care; short-term, non-cash emergency disaster relief; limited housing or community development assistance to those who were already receiving it in 1996; public health assistance for communicable diseases; and programs such as soup kitchens.", "The story also contains a number of falsehoods about the congresswoman. Ocasio-Cortez is not on the conference committee tasked with reaching a deal, and she was born in the Bronx, New York, not “illegally brought … across the border [by her parents] when she was a baby,” as the story states.", "We have been debunking false claims about immigrants living in the country illegally for years. And, since her election, Ocasio-Cortez has been the subject of online misinformation. Stories such as this one contribute to the misinformation about both.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on the social media network.", "“About Us.” America’s Last Line of Defense. Accessed 7 Feb 2019.", "“Federal Funding Gaps: A Brief Overview.” Congressional Research Service. Updated 4 Feb 2019.", "Mattingly, Phil. “These members of Congress are seeking a deal on border security and Trump’s wall.” CNN. 28 Jan 2019.", "Schallhorn, Kaitlyn. “Who is Alexandria Ocasio-Cortez? 5 things to know about the New York congresswoman.” Fox News. 8 Jan 2019.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]