["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A black and white photograph shows a crowd of people in the white hooded robes of the Ku Klux Klan, arms raised in the direction of a woman standing on a platform and gesticulating. In the foreground is a sign that is cropped but appears to read: \"Women Knights of the Ku Klux Klan Silver Lake, New Jersey, welcomes Margaret Sanger.\"", "Below the image, which has been shared widely on Facebook, is this caption: \"The woman in this photograph is Margaret Sanger, founder of Planned Parenthood, meeting with the Ku Klux Klan in 1926, Silver Lake, New Jersey. A strong advocate of eugenics, Sanger preached mass extinction of ‘inferior races’ by ‘mass abortions.’\"", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Sanger, who founded the organization that became Planned Parenthood, has been the subject of many claims we’ve found untrue: that she believed black people \"should be eliminated,\" that she called some immigrants \"human weeds,\" and that she was \"an active participants in the Ku Klux Klan,\"", "But Sanger did support eugenics and did once speak to a female group associated with the KKK, though this photo doesn’t show that.", "In her 1938 autobiography, she wrote that she was willing to talk to virtually anyone as she advocated for birth control across the United States: \"Always to me any aroused group was a good group, and therefore I accepted an invitation to talk to the women’s branch of the Ku Klux Klan at Silver Lake, New Jersey, one of the weirdest experiences I had in lecturing.\"", "The Women of the Ku Klux Klan was not the KKK itself but a parallel organization that supported the goals of the men’s group. Attending the meeting in New Jersey involved a complicated process that included driving to a secret location, according to her autobiography.", "We didn’t find any photos showing Sanger at that meeting.", "And there’s no evidence that the KKK image shared in the Facebook post had anything to do with Sanger. It was taken during a Ku Klux Klan ritual in Georgia on Jan. 1, 1930, according to Getty Images. In the Facebook post, the photo has been altered to make it look like Sanger is in the frame along with a sign welcoming her to the meeting. However, the original photo shows a white cross where this doctored image makes it look like Sanger is standing. There is no sign referencing Sanger in the original photo either.", "Gizmodo reported in 2015 that the altered image was created in 2006 as part of a contest from an anti-Sanger blog. \"The blog contest, unsurprisingly, was pretty specific,\" Gizmodo says in the story. \"Since there are no photos of Sanger addressing the KKK, people were supposed to create art commemorating the event.\"", "We rate this image False.", "Facebook post, May 15, 2020", "PolitiFact, Did Margaret Sanger believe African-Americans ‘should be eliminated’? Oct. 5, 2015", "PolitiFact, NH Rep. Bill O’Brien says Margaret Sanger was active participant in KKK, March 18, 2015", "PolitiFact, Margaret Sanger, alleged white supremicist?, Aug. 18, 2017", "PolitiFact, No, Margaret Sanger never said ‘Slave, Latin and Hebrew immigrants are human weeds,’ Jan. 25, 2019", "Metro, Haunting photos show KKK’s brutal past in wake of Charlottesville violence, Aug. 15, 2017", "Getty Images, Ku Klux Klan ritual in Georgia in USA during the thirties, Jan. 1, 1930", "Gizmodo, Margaret Sanger once spoke to the KKK but this photo of the speech is very fake, Dec. 1, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]