["The image was shared here on Facebook on August 13, 2020.", "It features photos of two face shields; the first has been marked with a red tick and the second one is annotated with a red cross.", "The post reads, in part: “The Department of Health has provided the following technical specifications' for face shield products: Clear plastic or acetate material / Provides good visibility / Fog resistant / Adjustable band to attach firmly around the head / Fit snuggly [sic] against forehead / Full face coverage / Made of robust material that can be easily cleaned and disinfected, disposable or reusable\".", "On August 12, 2020, the Philippine government announced that employers should provide face shields to all employees returning to work from August 15, as part of the country’s continued efforts to curb the surge of COVID-19 infections.", "The image also circulated here, here and here on Facebook and here and here on Twitter with a similar claim. It was also shared more than 18,000 times after being published in this Facebook post by the local newspaper Iloilo Metropolitan Times.", "The claim, however, is misleading.", "In response to the misleading posts, the Philippine Department of Health said it had not issued any images specifying appropriate face shields for protection against COVID-19.", "In a Facebook statement on August 15, 2020, a spokesperson said: \"The DOH has not released any advisory identifying face shields that cannot be used by the public. Any face shield that covers the entire face, as pictured, can be used.”", "The statement includes the same image of the two face shields seen in the misleading posts, marked with a large red cross.", "The official guidance on face shields, issued by the Philippine Department of Health on face shields on August 10, 2020, also does not include the image included in the misleading posts.", "Below is a screenshot of part of the release:", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]