["About this rating", "According to the Bureau of Labor Statistics, the sum of jobs lost in March and April 2020 was about 22 million, and the sum of jobs added back to the workforce in May, June, July, August, and September was roughly half that amount.", "It was false to tie Trump policies to the job growth after the early days of the COVID-19 pandemic. Rather, jobs were added because businesses were able to bring back employees who were previously furloughed  or end temporary shutdowns.", "Voting in the 2020 U.S. Election may be over, but the misinformation keeps on ticking. Never stop fact-checking. Follow our post-election coverage here.", "Facing Democratic rival U.S. Sen. Kamala Harris for a debate in October 2020, Vice President Mike Pence attempted to give credit to his boss, President Donald Trump, for developing policies that rebounded the economy after unprecedented losses due to the COVID-19 pandemic.", "In particular, Pence said the U.S. workforce added millions of jobs since the early days of the outbreak because of Trump's fiscal and regulatory policies. He said:", "We're going through a pandemic that lost 22 million jobs at the height, we've already added back 11.6 million jobs, because we had a president who cut taxes, rolled back regulation and unleashed American energy, fought for free and fair trade. [...] We literally have spared no expense to help the American people and the American worker through this.", "In other words, he claimed the Trump administration spearheaded a variety of initiatives that added 11.6 million jobs in summer and fall 2020, regaining nearly half the roughly 22 million jobs lost at the start of the pandemic. The comment echoed multiple statements by Trump in which he, too, attempted to praise the administration's successful balance of public health and economic interests.", "\"Our strategy to kill the China virus has focused on protecting those at greatest risk while allowing younger and healthy Americans to safety return to work and safely return to school,\" he said in August. \"We added 1.8 million new jobs in July, exceeding predictions for the third month in a row, and adding a total of over 9.3 million jobs since May.\"", "To determine the legitimacy of such assertions, we referred to the Bureau of Labor Statistics’ (BLS) \"seasonally adjusted nonfarm payroll,\" which is the standard measurement for determining how U.S. wage and salary jobs change over time. The payroll data are compiled monthly via a survey of about 145,000 businesses and government agencies across the country, excluding people who are self-employed, or work for farms or private households.", "When a news story stated that, for instance, the economy added \"661,000 new workers,\" that number was typically a reference to the month-to-month change in nonfarm payrolls — 661,000 more jobs were added in September compared to August 2020.", "We obtained monthly nonfarm payroll data, which showed:", "According to our analysis of the month-by-month statistics, the economy tallied almost 1.4 million less jobs in March compared to February. Then, the recession deepened, and April recorded 20.8 million less jobs than the month prior — the steepest decline since the Great Depression.", "While Pence did not provide an explanation for his labor statistics at the debate, we assumed he was referencing the sum of job losses in March and April, showing employers cut about 22 million jobs during those two months, per the BLS data.", "Then, after that, the country started a slow, steady recovery. The data show the following increases in job totals, all approximations, on a month-by-month basis:", "(We should note here: The monthly employment figures for August and September 2020 were both preliminary and subject to revision, as of this writing.)", "Looking at the data, yes, about 11.4 millions jobs were added to the U.S. economy between May and September — and the Trump administration's comments about the economy showing significant job growth since the early weeks of the pandemic were true at face value.", "However, that upward trend had little to do with the White House and everything to do with how businesses on a grand scale adapted to new rules on social distancing to curb the spread of the deadly virus. In March, for instance, California issued the first statewide \"stay at home order\" and New York City closed all non-essential businesses — both decisions that contributed to April's historic job loss.", "Then, over the weeks, employers developed plans for operating under public health officials' recommendations to curb the spread of COVID-19 and, as a result, were able to bring back workers who had been furloughed or reopen after a temporary shut down. Those trends significantly impacted job growth in the U.S. — not Trump.", "Additionally, a Paycheck Protection Program (PPP) loan — which was developed by Congress, not the White House, via the March Coronavirus Aid, Relief, and Economic Security (CARES) Act — helped some small businesses bring back lost positions or keep workers who would otherwise have been laid off. That stimulus package’s direct payments to Americans who earned 75,000 annually or less (or families that made up to $150,000 annually) may have also driven spending in the summer months and, consequently, kept some employers afloat after initial shock to their profits earlier in the year.", "All of that said, no evidence showed that the Trump administration enacted policies — whether related to taxes or trade — that \"added back\" the jobs but rather economic trends shifted from the early days of the outbreak, during mass furloughs and business closures.", "Here's the bottom line: Presidential administrations often exaggerate their influence on the economy — especially when employment is showing somewhat positive signs — no matter if they're leading the country during a crisis like the COVID-19 outbreak or comparatively normal times. As Neil Irwin wrote for The New York Times in January 2017, just days before Trump’s inauguration:", "The reality is that presidents have far less control over the economy than you might imagine. Presidential economic records are highly dependent on the dumb luck of where the nation is in the economic cycle. And the White House has no control over the demographic and technological forces that influence the economy.", "Additionally, the White House had little influence on how businesses quickly adapted recommendations by public health officials to safely operate during the pandemic.", "For those reasons, we rate this claim a \"Mixture\" of truth and falsehoods. It was true that the country added back about half of the jobs lost during the early months of the pandemic, though it was a false misinterpretation of economic conditions to tie that job growth to Trump policies — or that he \"cut taxes, rolled back regulation and unleashed American energy, fought for free and fair trade,\" like Pence alleged, and that those moves directly added jobs.", "Here's video footage of Pence making the claim on the vice presidential debate stage, courtesy of C-SPAN:", "https://www.c-span.org/video/?c4913299/user-clip-vp-pence-jobs-claim", "Factba.se.   \"Press Conference: Donald Trump Holds A Coronavirus Pandemic Briefing In Bedminster - August 7, 2020.\"\r\n   Accessed 9 October 2020.", "U.S. Bureau of Labor Statistics.   \"BLS Data Viewer.\"\r\n   9 October 2020.", "Reuters staff.   \"Timeline: How the Global Coronavirus Pandemic Unfolded.\"\r\n   Accessed 12 October 2020.", "Jessica Lee is Snopes' Senior Assignments Editor with expertise in investigative storytelling, media literacy advocacy and digital audience engagement.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]