["About this rating", "On 19 July 2017, the Finnish news web site Yle reported that a group of Finnish researchers had developed a vaccine for Type 1 diabetes, and that human trials were set to begin in 2018:", "A vaccine for type 1 diabetes developed by Finnish researchers will be tested on mainly Finnish human subjects in late 2018, researchers announced on Tuesday. The scientists first found that the prototype works effectively and safely on mice, and now say that the vaccine could be in mainstream use within eight years if the coming rounds of tests prove successful.", "One skeptical reader asked us to check out the story.", "Yle is Finland's public broadcasting corporation (akin to NPR or the BBC). T he names of the lead researchers and their universities are real, the announcement of vaccine trials is real, and the story is true.", "On 18 July 2017, the University of Tampere in Finland announced that Professor of Virology Heikki Hyöty and his team of researchers had identified a particular strand of enteroviruses (viruses transmitted through the intestines) linked to Type 1 diabetes, and developed a vaccine against them.", "“Already now it is known that the vaccine is effective and safe on mice,\" Hyöty said. \"The developing process has now taken a significant leap forward as the next phase is to study the vaccine in humans.”", "The university's statement continued:", "In the first clinical phase, the vaccine will be studied in a small group of adults to ensure the safety of the vaccine. In the second phase, the vaccine will be studied in children and the aim is to investigate both the safety of the vaccine and its effectiveness against enteroviruses. In the third phase, the aim is to investigate whether the vaccine could be used to prevent the onset of Type 1 Diabetes. However, it can take about eight years in order to certainly know whether the vaccine prevents Type 1 Diabetes.", "Hyöty added that the vaccine would not cure existing cases of Type 1 diabetes, but that if it is successful, it would protect from other infections caused by enteroviruses including the common cold and meningitis.", "Another pioneer in this research, Professor Mikael Knip from the University of Helsinki, told Yle that the vaccine could have massive financial and public health benefits:", "It is estimated that the additional cost of care for one child with diabetes over their lifetime is about a million euros. This vaccine could prevent at least half of new cases, which amounts to some 250 million euros in annual savings.", "The American biopharmaceutical company Provention Bio, which is based in Lebanon, New Jersey, is funding the continuation of Hyöty and Knip's research, after reportedly receiving $28.4 million in financing, which it will disburse between the Type 1 diabetes vaccine trials and a second project.", "University of Tampere.  \"A Preventive Vaccine for Type 1 Diabetes to be Studied in Humans for the First Time.\"\r\n  Uta.fi.  18 July 2017.", "Provention Bio, Inc.  \"Provention Bio, Inc. Secures $28.4 Million Founding Financing to Fund Development Targeting the Interception and Prevention Immune-Mediated Disease.\"\r\n  PR Newswire.  26 June 2017.", "Faulkner, Sarah.  \"Provention Bio Evaluates Vaccine to Prevent Onset of T1D.\"\r\n  Drug Delivery Business News.  18 July 2017.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]