["About this rating", "On 7 February 2017, World News Daily Report published a story pushing the claim that a seven-year-old California girl received breast implants after hectoring her mother for two years.", "According to the story, Dana Manson obliged her daughter Juliet after being advised by \"renowned psychiatrist\" Eduardo Ramirez that the procedure would boost her self-esteem:", "They left for China on December 22, and the surgery was performed two days later. According to the clinic, the operation took less than two hours and went exactly as planned.", "The young girl now has a 30C cup, and her mother says she’s “extremely happy about her about her new breasts”.", "As in other faux reports, the story \"cites\" a legitimate news source (in this case, NBC News) without providing a link to back up its allegation. Besides a digitally manipulated picture depicting a young girl's head on a woman's body, the story also included photos of \"Ramirez\" and \"Dana Manson.\" But online searches for the latter images point back to similarly dubious sites.", "WNDR does have a disclaimer that says it is not \"responsible for any incorrect or inaccurate information\" associated with the site, but adding:", "WNDR assumes however all responsibility for the satirical nature of its articles and for the fictional nature of their content. All characters appearing in the articles in this website – even those based on real people – are entirely fictional and any resemblance between them and any persons, living, dead, or undead is purely a miracle.", "Other versions of this story have circulated describing \"Juliet\" as an 8-year-old girl.", "The American Academy of Pediatrics has stated that, while there is no specific law concerning a minimum age for cosmetic surgery, patients under the age of 18 must receive parental consent before undergoing any procedure.", "Arturo Garcia is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]