["The black-and-white image was posted on January 15 by a Facebook page with more than 11,000 followers. It is a close-up shot that appears to show a topless Gandhi face-to-face with an attractive woman in profile, who is also smiling.", "There are typed words above and below the photograph saying “Me with my gf”, short for girlfriend, and “Mahatma gandhi”.", "The doctored image has been shared repeatedly since at least 2015, for example here and here, and has been posted in multiple languages, including Spanish and Indonesian.", "A reverse image search found the photograph had been doctored. The original picture, widely used in online reports including by the BBC and the New York Times, shows Gandhi -- in exactly the same position -- laughing with Nehru at a meeting in Bombay, now known as Mumbai.", "The picture was taken by Max Desfor, an American Pulitzer Prize-winning photographer who worked for the Associated Press.", "Here is the image in the news agency's online image database.", "The picture's caption says: “A bespectacled Mohandas Gandhi, the Mahatma, who eventually led India to its independence, laughs with the man who was to be the nation's first prime minister, Jawaharlal Nehru, at the All-India Congress committee meeting in Bombay, India, on July 6, 1946.\"", "A comparison of the misleading Facebook post and the original AP image shows that the part of the photograph containing Gandhi’s face has been edited together with a closely cropped picture of a smiling woman.", "In the original image, there is a uniform dark background behind the top of Nehru and Gandhi’s heads. But in the doctored version, the background behind the woman appears lighter than that behind Gandhi, and a dividing line can be seen between the two shades.", "Part of Nehru’s white sleeve is also visible next to the woman’s neck in the doctored image.", "Some of the comments on Meme_bazi’s post say the image is disrespectful, but the owner of the page has replied to them saying the picture shows India’s “real history”.", "Desfor won the Pulitzer Prize for photography in 1951 for his photographic coverage of the Korean war, the prize's website says. He died in February 2018 aged 104, according to the AP.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]