["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "House Intelligence Committee Chairman Adam Schiff, D-Calif., talks to the media after a hearing with testimony from top U.S. diplomat in Ukraine William Taylor and career Foreign Service officer George Kent, in Washington on Nov. 13, 2019. (AP)", "Republicans have criticized the impeachment inquiry into President Donald Trump’s actions on Ukraine as an overextension of Democrats’ power in Congress. On Facebook, some users take issue with another part of impeachment: the price tag.", "One post published Nov. 11 by a conservative Facebook page, which has more than 500,000 followers, claims the inquiry has cost American taxpayers tens of millions of dollars.", "\"Democrats spent $40,000,000 of YOUR tax dollars trying to impeach Trump,\" the post reads. \"But not one cent was spent to benefit citizens!\"", "The post, which has been shared more than 4,800 times and copied by a slew of users and pages, was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "(Screenshot from Facebook)", "The House will decide whether to impeach Trump over actions surrounding a July phone call in which he asked the Ukrainian president to investigate Joe Biden’s son’s appointment to an energy board over the next few weeks. But as for the impeachment inquiry’s price tag, there is no evidence that it has cost $40 million.", "That $40 million figure most likely comes from an incomplete and inaccurate reporting of the cost of the investigation led by Special Counsel Robert Mueller. The impeachment inquiry centers around actions by Trump that occurred after Mueller’s investigation was completed.", "This isn’t the first time we’ve heard the claim that a public investigation cost $40 million.", "After Mueller concluded his special counsel investigation on Russian interference in the 2016 presidential election, Rudy Giuliani, Trump’s personal lawyer, claimed during a Fox News interview that it cost \"about $40 million.\"", "Expenditure filings from May 2017 to 2019 put the cost closer to $32 million. The investigation was paid for through a permanent, indefinite appropriation for independent counsels.", "RELATED: Here’s what we know about the cost of the Mueller investigation", "Mueller’s office said indirect expenses — such as personnel from the FBI or other agencies — aren’t really a use of additional tax dollars, since the personnel and resources would have been devoted to other cases if there had been no special counsel investigation.", "Two notes: First, the cost of the investigation doesn’t account for forfeitures made by people ensnared in the probe. The financial penalties leveled against Paul Manafort, former Trump campaign chairman, stand out among nearly three-dozen indictments stemming from the probe.", "As part of a plea agreement, Manafort forfeited to the government his real estate property in New York, funds in three bank accounts, and his life insurance policy. Court documents do not specify the estimated value of each asset. (Some news outlets reported that the combined value of the real estate properties could be an estimated $22 million.)", "Second, none of Mueller’s findings have been — to date — part of the impeachment inquiry. The inquiry has solely focused on Trump’s dealings with Ukraine in the time period after Mueller’s investigation had concluded.", "Tax policy experts told us they aren’t sure how much the impeachment inquiry has cost since Speaker Nancy Pelosi announced it Sept. 24.", "\"I can’t think of anyone who’s tried to calculate this cost,\" said Matt Gardner, a senior fellow at the Institute on Taxation and Economic Policy, in an email.", "We asked the House Intelligence Committee, which is leading the investigation, for an estimate of how much it has spent on the impeachment inquiry. We did not hear back.", "One potential way to determine the approximate cost of the impeachment inquiry would be to add up the salaries of staffers on the relevant committees.", "According to LegiStorm, a congressional research website, salary expenditures for staffers on the Intelligence Committee totaled $2.4 million as of June. In 2018, salaries surpassed $5 million.", "If you factor in staff salaries for the Judiciary Committee, which will weigh in on the Intelligence Committee’s investigation in the House, the total comes to around $5.7 million as of June. But that number still doesn’t tell us a lot about the cost of the inquiry.", "RELATED: Fact-checking Trump, Ukraine impeachment hearings, day 1", "Steve Ellis, vice president of the nonprofit Taxpayers for Common Sense, said there isn’t much congressional spending.", "\"All the members and staff would have been paid regardless. There are costs of transcription of the hearings, but that’s about all I can think of,\" he said in an email. \"For the executive branch there are the costs of having witnesses travel from overseas in the case of Ambassadors (Gordon) Sondland and (William) Taylor (if that is the case). And there are costs for additional attorneys at the White House to work on impeachment.\"", "Politico reported that more than a dozen Trump administration officials have hired attorneys that typically earn between $1,000 and $1,500 per hour. But they were paid for by the Republican National Committee, officials themselves or through a legal defense fund — not with taxpayer money.", "As for the witnesses that will appear in upcoming impeachment hearings, it’s unclear what their travel expenses will be. But there’s no reason to think they’d cost tens of millions of dollars.", "Past impeachments could shed some light on the potential cost. But there’s not a lot to go off of.", "A 1998 report to Congress estimated that the cost of former special counsel Kenneth Starr’s investigation of former President Bill Clinton had \"just shy of $30 million.\" The investigation, which centered on Clinton’s affair with White House intern Monica Lewinsky, resulted in his impeachment in the House.", "RELATED: Johnson, Nixon, Clinton, Trump: 9 questions about impeachment", "Later media reports placed the cost somewhere between $47 million and $50 million. Robert Ray, who succeeded Starr as head of the Office of the Independent Counsel, told the Associated Press in 2002 that about $12.5 million was spent on the perjury and obstruction probe of Clinton and his relationship with Lewinsky.", "But the Starr investigation lasted several years and looked into multiple aspects of the Clinton presidency, such as the Whitewater scandal. And it was independent of Congress, making it more similar to Mueller’s probe of Russian interference in 2016 (which was slightly less expensive, when adjusting for inflation) than the Intelligence Committee’s investigation of Trump’s call with Ukraine.", "A Facebook post claimed, \"Democrats spent $40,000,000 of YOUR tax dollars trying to impeach Trump.\"", "That number echoes an exaggerated estimate of the cost of the Mueller investigation on Russian interference in the 2016 election. That did not go through the impeachment process. We haven’t seen any estimates of the cost of the impeachment inquiry so far. Salaries for staffers on the committees involved, as well as expenses associated specifically with Clinton’s impeachment charges, suggest that the cost of the Trump inquiry is far less than $40 million. They would be earning salaries regardless.", "The Facebook post is inaccurate. We rate it False.", "Associated Press, \"GAO: Clinton Probes Cost $70 Million,\" March 29, 2002", "Bureau of Labor Statistics, CPI Inflation Calculator, accessed Nov. 15, 2019", "CBS News, \"Staggering Cost Of Starr Probe,\" April 1, 2000", "CNN, \"Starr Investigation Costs Just Shy of $30 Million,\" April 1, 1998", "The Daily Mail, \"From lawyers fees to travel expenses - how much does it REALLY cost to impeach a U.S. president?\" Oct. 10, 2019", "Emailed comments from Chris Edwards, director of tax policy studies at the Cato Institute, Nov. 13, 2019", "Emailed comments from Matt Gardner, senior fellow at the Institute on Taxation and Economic Policy, Nov. 13, 2019", "Email interview with Steve Ellis, vice president of the nonprofit Taxpayers for Common Sense, Nov. 13, 2019", "Facebook post, Nov. 11, 2019", "House.gov, \"The Impeachment of President Andrew Johnson,\" accessed Nov. 13, 2019", "LegiStorm, House Permanent Select Committee on Intelligence - Staff Salaries, accessed Nov. 13, 2019", "LegiStorm, House Judiciary Committee - Staff Salaries, accessed Nov. 13, 2019", "The New York Times, \"Nancy Pelosi Announces Formal Impeachment Inquiry of Trump,\" Sept. 24, 2019", "The New York Times, \"National News Briefs; Clinton Inquiry Cost $47 Million, U.S. Says,\" Oct. 2, 1999", "Politico, \"‘One real mess’: Trump aides face the prospect of giant legal bills,\" Oct. 30, 2019", "PolitiFact, \"Here’s what we know about the cost of the Mueller investigation,\" March 26, 2019", "PolitiFact, \"How much is the Mueller investigation costing? (updated),\" Dec. 14, 2018", "PolitiFact, \"The impeachment inquiry: What to expect from public hearings and beyond,\" Nov. 11, 2019", "Twitter Advanced Search, accessed Nov. 13, 2019", "U.S. Department of Justice, Special Counsel’s Office Statements of Expenditures, accessed Nov. 13, 2019", "The Washington Post, \"Watch House Republicans criticize Democrats for the impeachment inquiry vote that they demanded,\" Oct. 31, 2019", "YouTube, Fox News, Rudy Giuliani reacts to Mueller report finding no collusion, published March 25, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]