["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Rep. Alexandria Ocasio-Cortez, D-N.Y., sprints up the steps of the House of Representatives as she rushes to a vote, at the Capitol in Washington, Wednesday, March 3, 2021. (AP)", "Rep. Alexandria Ocasio-Cortez's latest financial disclosure form showed assets of between $2,003 and $31,000.", "Her liabilities were listed at between $15,001 and $50,000, indicating that she may have a negative net worth.", "Rep. Alexandria Ocasio-Cortez has been paid $174,000 per year as a member of Congress since joining the House of Representatives in January 2019.", "A text image widely shared on Facebook claims that the New York Democrat now has a net worth of more than $1 million.", "The image states: \"2 years ago AOC was broke when elected. this yrs financials show she is now worth over 1 million net worth. How does that happen.\"", "With his post, one Facebook user added: \"On a $174K a year salary. Inconceivable.\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The post is way, way off.", "Net worth is the value of a person’s assets — such as cash, home, stocks, bonds and other property — minus any debts owed.", "Members of Congress are required to file financial disclosure reports listing their assets, liabilities and income sources outside of their congressional salary. Ranges, rather than specific amounts, must be disclosed.", "Ocasio-Cortez has filed two financial disclosure reports with the House. Both show little or no net worth.", "Ocasio-Cortez’s first financial disclosure report, filed May 15, 2019, covered Jan. 1, 2017, through Dec. 31, 2018. It showed assets totaling between $3,003 and $45,000. Specifically, between $1,001 and $15,000 in each of three accounts — a checking account, a brokerage account and a 401(k) plan.", "For liabilities, the report showed student loan debt of between $15,001 and $50,000.", "In other words, it’s possible her liabilities exceeded her assets.", "The report also showed salary and wages from her campaign and a restaurant totaling $25,463 in 2018.", "Ocasio-Cortez filed her second report on Sept. 12, 2020, which covered 2019. It listed the same three accounts for assets, but totaling less — between $2,003 and $31,000 — with her student debt remaining between $15,001 and $50,000.", "A couple of footnotes:", "Congress determines its own rate of pay, subject to restraints in the Constitution. Members in both the House and the Senate last received a raise in January 2009, of 2.9%, to $174,000.", "The only exceptions are the speaker of the House ($223,500) and the president pro tempore of the Senate and the majority and minority leaders in the House and Senate ($193,400).", "Ocasio-Cortez’s assets total no more than $31,000, according to her latest financial disclosure report. Based on the way personal finances are reported, they might be exceeded by her liabilities, which are reported to be as high as $50,000.", "An image shared on Facebook claiming she has a net worth of more than $1 million is false and ridiculous — Pants on Fire!", "Facebook post, March 8, 2021", "USA Today, \"Fact check: Rep. Alexandria Ocasio-Cortez's net worth is not close to $1 million,\" March 10, 2021", "House of Representatives, Rep. Alexandria Ocasio-Cortez financial disclosure report, May 15, 2019", "House of Representatives, Rep. Alexandria Ocasio-Cortez financial disclosure report, Sept. 12, 2020", "Center for Responsive Politics, \"Poorest new members, 116th Congress,\" accessed March 10, 2021", "Email, Alex Baumgart, individual contributions researcher, Center for Responsive Politics, March 10, 2021", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]