["In the wake of formally launching his re-election bid, Gov. Scott Walker is rolling out a new jobs statistic to combat criticism over the pace of Wisconsin’s employment recovery.", "\"You don’t hear this from a lot of the other media outlets out there, and you certainly don’t read about it in most of the newspapers in the state,\" Walker told conservative talker Jay Weber on Milwaukee’s WISN-AM (1130) April 16, 2014.  \"In 2013 we had the largest, the best, private sector job growth we’ve had in this state since the 1990s.\"", "Now, it’s been well documented that Wisconsin’s private-sector job growth has trailed the national average and Walker is lagging on his promise of adding 250,000 private sector jobs in his first term.", "Despite all that, did Wisconsin job growth in 2013 outpace gains in every year for nearly the last decade and a half?", "Digging into the numbers", "When we asked Walker’s office to provide backup, his spokeswoman Jocelyn Webster pointed to monthly jobs estimates based on government surveys of a small sample of employers.", "Those numbers showed that 2013’s private job-growth of 39,700 is the highest since 1999’s 55,700.", "To be sure, those numbers are far less reliable than the job-count data reported in the U.S. Quarterly Census of Employment and Wages, which tallies job creation from a census of 96 percent of the nation’s employers.", "Notably, over the last three years Walker has criticized the monthly numbers as unreliable, arguing for using the quarterly figures. Here, he does the opposite.", "But the latest figures from the more-reliable quarterly census run only through September 2013, so we think it’s fair game for the governor to use them, though as we shall see they are subject to change.", "The year-end 2013 figures are expected out in June.", "Researchers we spoke to said the percentage of growth is a better measure because economies grow over time.", "By that measure, the 1.66 percent growth in 2013 also was the best since 1999’s 2.37 percent.", "The numbers didn’t surprise Laura Dresser, who tracks Wisconsin’s employment picture as labor economist and associate director of the Center on Wisconsin Strategy, a nonprofit think tank.", "Two national recessions bookended the 2000s, Dresser noted, with the one early in the decade spawning the phrase \"jobless recovery.\"", "Three years (2001 and 2008-09 in the Great Recession) saw big job losses in Wisconsin’s private market. And the state’s job total still hasn’t rebounded to 2007 pre-recession highs.", "Digging a little deeper", "There are multiple ways to slice jobs data. So hang with us, there’s a bit of technical job-count speak ahead.", "Walker’s figures are based on seasonally adjusted data for December each year. Under this counting method, actual changes in job growth are adjusted to account for cyclical economic factors such as weather, vacation periods and holidays.", "But some researchers prefer to use unadjusted figures, saying the seasonal adjustments are not necessary when comparing year-over-year changes. (The most important thing is to use one or the other method consistently.)", "The counts can vary significantly. In fact, the unadjusted figures for 2013 show 15,000 fewer jobs created in 2012 than the seasonally adjusted figures.", "At this point, using unadjusted figures, the 2013 result (24,400 jobs added) trails five years, namely, 2004, 2005, 2010, 2011 and 2012 which ranged from 28,100 to 39,000 jobs added.", "\"If he is talking about actual counts of jobs, this is the number you want to use,\" Dale Knapp, research director at the Wisconsin Taxpayers Alliance, told us.", "Others are fine with the seasonally adjusted data that backs up Walker’s claim.", "It’s frequently used in year-over-year comparisons published by the U.S. Bureau of Labor Statistics, the official scorekeeper on job growth. Seasonally adjusted figures have several advantages and are more familiar to the general public than other types of data, BLS economists told us.", "The Wisconsin Department of Revenue uses it as well. Dresser, of the Center on Wisconsin Strategy, uses the seasonally adjusted data for annual comparisons, but said the unadjusted data is defensible as well.", "PolitiFact Wisconsin tracks Walker’s progress on his 250,000 jobs promise in part using seasonally adjusted figures. Our \"Walk-O-Meter\" includes a footnote that explains we combine the more reliable quarterly census data with the latest monthly survey data to come up with the \"best available\" up-to-date figures for the current month.", "In the end, Walker’s claim may have a limited shelf life.", "That’s because the monthly survey numbers have not gone through final revisions for the fourth quarter of 2013. Those revisions are made based on what happens with the more accurate quarterly-census data, so it is still a bit of a moving target.", "Based on past changes, the revision -- expected this summer -- could be large.", "\"To know how many jobs were added in 2013, we just have to wait for the (quarterly census) data,\" said Knapp.", "Our rating", "Walker said that \"in 2013 we had the largest, the best, private sector job growth we’ve had in this state since the 1990s.\"", "The claim is accurate based on the best available data source and using a common method of comparison.", "But it needs some clarification because the number is not final, so the ranking is subject to change.", "We rate it Mostly True.", "Jay Weber show, transcript excerpt from podcast of April 16 appearance by Gov. Scott Walker, accessed April 16, 2014", "Interview with Laura Dresser, associated director, Center on Wisconsin Strategy (COWS), April 17, 2014", "Interview with Dale Knapp, research director, Wisconsin Taxpayers Alliance, April 17, 2014", "Interview with Jocelyn Webster, communications director, Office of Gov. Scott Walker, April 17, 2014", "Interviews with U.S. Bureau of Labor Statistics’ economists Ryan Arbuckle, Megan Barker and Larry Akinyooye, April 17, 2014", "Milwaukee Journal Sentinel, \"Wisconsin adds 28,351 private-sector jobs over 12 months,\" March 19, 2014", "PolitiFact Wisconsin, Truth-O-Meter, \"Gov. Scott Walker says is worst in U.S. history,\" December 11, 2013", "Wisconsin Department of Revenue, \"Wisconsin Economic Outlook, Winter 2014\"", "Center on Wisconsin Strategy, \"The State of Working Wisconsin: Update 2013,\" Sept. 1, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]