["By D'Angelo Gore", "Posted on May 12, 2020", "The United States has one of the highest rates of COVID-19 deaths per capita in the world. However, President Donald Trump made the false claim that “Germany and the United States are the two best in deaths per 100,000 people.”", "As of May 11, the U.S. had 24.66 deaths per 100,000 people — more than two times higher than Germany (9.24 deaths per 100,000), and the 11th highest rate out of the more than 140 countries tracked by Johns Hopkins University.", "Trump made his remarks about the per-capita death rates during a May 11 press briefing at the White House.", "Trump, May 11: I think one of the things we’re most proud of is — this just came out — deaths per 100,000 people, death — so deaths per 100,000 people: Germany and the United States are at the lowest rung of that ladder. Meaning, low is a positive, not a negative. Germany and the United States are the two best in deaths per 100,000 people, which, frankly, to me, that’s perhaps the most important number there is.", "Of the more than 140 countries for which data is available, the U.S. figure for deaths per 100,000 people as of May 11 was the 11th highest and Germany’s was the 18th highest. Neither is anywhere near the “lowest rung of that ladder.”", "We asked the White House if the president’s claim was based on other data, but we have not received a response.", "It’s possible Trump meant to refer to a different statistic on the Johns Hopkins University website: the observed case-fatality ratio (COVID-19 deaths divided by confirmed cases) among the 10 countries the university said have been “most affected” by the global coronavirus outbreak. By that limited measure, Germany (4.4%) had the lowest case-fatality ratio and the U.S. (6.0%) had the second lowest among the 10 countries.", "But that’s not what Trump said.", "Instead, the president gave the false impression that the U.S. — which has had more than 1.3 million confirmed cases of COVID-19 and about 80,000 deaths — has one of the lowest per-capita death rates of any nation.", "Editor’s Note: FactCheck.org does not accept advertising. We rely on grants and individual donations from people like you. Please consider a donation. Credit card donations may be made through our “Donate” page. If you prefer to give by check, send to: FactCheck.org, Annenberg Public Policy Center, 202 S. 36th St., Philadelphia, PA 19104.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]