["About this rating", "A 2010 Harvard study found that women who drank gained less weight than non-drinkers.", "The 2010 Harvard study found that women who drank wine still gained weight (even if less so than non-drinkers),  and no research in 2015 proved that wine \"makes you skinny\" or aids weight loss.", "On 17 February 2016 the web site Total Sorority Move published an article which claimed drinking wine before bed \"officially makes you skinny,\" maintaining:", "Whether you’re casually sipping a cabernet blend while laying in bed and reading a book or chugging Franzia until you knock yourself out, there’s no denying that we love our evening glass (or bottle, or box) of wine. Now you can shut down all the haters with pure science facts, because a bunch of really smart people at Washington State University and Harvard have decided that yes, drinking wine actually makes you skinny.", "*starts drinking now* https://t.co/e0KxIkkRrP", "— Total Sorority Move (@totalsratmove) February 17, 2016", "We looked for a link back to the findings of \"really smart people\" at Washington State University and Harvard. But the article's only citation was an 11 February 2016 item on the blog of wine purveyor Last Bottle.  That post was littered with anecdotal evidence, rather than data:", "A quick look at the Last Bottle crew confirms just how integral wine is to sculpting a killer beach body, but since we don’t have any recent photos you’ll just have to trust us. And besides, other people have reported similar effects.", "An article in the Daily Mail profiled four women who claim that drinking wine helps keep their weight down and curb bad eating habits. One of them was Linda Monk, a 47-year-old woman who says she lost six pounds in three weeks. She credits using wine as a “bedtime snack” to satiate cravings for “sweets, biscuits, and chocolate”.", "The post referenced a May 2015 Daily Mail article which made the same claims, citing evidence such as a 47-year-old woman named Linda who \"lost 6lb over the past three weeks and is convinced she has her nightly tipple to thank.\" Additional anecdotal evidence came via a woman named Samantha, who explained how wine apparently helped her lose weight:", "An average day’s food is scrambled eggs for breakfast, chicken salad for lunch and chilli con carne without rice for dinner, accompanied by a good quality glass of red wine.", "‘My weight had been creeping up to 10st 6lb, but I now weight 10st and I’m edging towards a size ten.", "Finally, the article claimed that a \"13-year Harvard University study of 20,000 women found that those who drank half a bottle of wine a day had a 70 per cent reduced risk of obesity compared to non-drinkers,\" but didn't actually link to any specific study.", "We searched for the study in question. Most citations linked back to the Daily Mail assertion, with no information at all about the purported studies.  A worrying number of articles contained wording to the effect of \"according to the Daily Mail\" without any additional verification any such study existed.", "Given the number of mentions in 2015 (and into 2016), readers wouldn't be at fault for believing recent research indicated that drinking wine equaled weight loss, according to Harvard. We finally located a Reuters article about such a study from March 2010, a full five years prior to the Daily Mail's item. Titled \"Wine may help women keep weight in check,\" its claims were a bit less sensationalized:", "The new study, published in the latest issue of Archives of Internal Medicine, is the first to examine ties between alcohol consumption by a normal-weight individual and the risk of becoming overweight or obese.", "The women were all at least 39 years old when the study began. About 38 percent said they did not drink alcohol; 33 percent said they drank less than 5 grams daily (a standard drink has about 10 grams of alcohol); 20 percent drank 5 to less than 15 grams daily; 6 percent drank 15 to less than 30 grams daily; and 3 percent downed 30 grams of alcohol or more daily (about 2 to 3 drinks per day or more).", "Over an average of about 13 years, the women generally gained weight. However, the teetotalers gained the most weight, with weight gain decreasing with increasing amount of alcohol consumed ... Put another way, Wang said an initially trim woman who did not drink alcohol had about a 43 percent chance of becoming overweight or obese over 13 years. Her risk fell to 33 percent if she drank 15 to 30 grams of alcohol a day.", "Reuters' coverage of the research specifically stated all the women in study gained weight, not that they lost any. The women who drank alcohol appeared to gain less in the aggregate, but that did not prove that wine encouraged weight loss.", "The study in question was published in the Archives of Internal Medicine on 8 March 2010.  Of note is that the study made absolutely no distinction between varieties of alcohol in the course of research — wine wasn't singled out as a specific factor, nor was it differentiated from beer and spirits. Its conclusion stated:", "Compared with nondrinkers, initially normal-weight women who consumed a light to moderate amount of alcohol gained less weight and had a lower risk of becoming overweight and/or obese during 12.9 years of follow-up.", "Comments appended to the research identified an large number of conflicting findings and confounding factors, making an absolute conclusion difficult to identify:", "Previous cross-sectional studies of alcohol intake and body weight have shown positive or null associations in men and inverse or nullassociations in women. Prospective studies that focused on weight change have been equally inconsistent across populations.In the Framingham Heart Study, men and women who increased their alcohol consumption during 20 years of follow-up experienced weight gains larger than the average. In the Nurses Health Study I, an inverse association between alcohol intake and 8-year weight gain was found among 31,940 nonsmoking women. A similar association was noted in the Nurses Health Study II: light to moderate alcohol intake of 30 g/d or less was inversely associated with weight gain and the odds of gaining 5 kg or more in 8 years. In the National Health and Nutrition Examination Survey I Epidemiologic Follow-up Study of 7230 participants, women but not men who consumed alcohol gained less weight over 10 years than those who did not.", "Articles in 2016 inexplicably picked up a nearly year-old May 2015 Daily Mail article, which focused on the anecdotal claims of four British women — who appeared to be actively dieting in addition to losing weight by drinking wine.", "In passing, that article mentioned (but didn't link to) research out of Harvard which apparently proved that wine caused weight loss. From that point, several news outlets referenced the Daily Mail as a source of that claim, but none appeared to actually have read the actual study.", "As it turns out, the research cited was published five years earlier, and in no way indicated that wine helped with weight loss. The study in question examined all alcohol consumption, and found drinkers gained weight, but possibly at a slower rate than non-drinkers.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]