["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "With the general election over, the nation’s political attention has shifted to Georgia, where runoff elections for two U.S. Senate seats take place on Jan. 5. Democrats need to win both for Sen. Charles Schumer to take over as Senate majority leader.", "Sen. Rick Scott, incoming chairman of the National Republican Senatorial Committee, a campaign committee focused on electing Republicans to the Senate, told Fox News his view on what would happen if the GOP lost and Schumer ascended to the leadership post.", "We’re going to make sure @SenSchumer doesn’t get his wish to be Majority Leader. He said he wants to take Georgia so Democrats can change America. Thankfully, Georgia doesn’t want the radical change that Schumer, Warnock and Ossoff have in mind. pic.twitter.com/16SarGdbLg", "\"He wants to eliminate private health care insurance. He wants to ruin the Medicare program by putting everybody on the Medicare system. He wants the Green New Deal, which is going to cost close to $100 trillion and kill our economy, socialism, reduce funding for the police,\" Scott said.", "In campaigns, using hyperbole to depict rivals is a common practice. We wanted to know whether the Florida senator described Schumer’s positions correctly.", "Scott said Schumer, the senior senator from New York, \"wants to eliminate private health care insurance\" and put everyone on the Medicare system.", "Schumer is not a co-sponsor of the \"Medicare for All\" bill sponsored by Sen. Bernie Sanders, I-Vt. In August, during his speech at the Democratic National Convention, Schumer said Democrats would make \"health care affordable for all,\" but he did not elaborate.", "In an interview with Vox in March 2019, Schumer was asked if Medicare for All would pass if Democrats controlled Congress and the White House. He replied: \"I can say this. Some strong health care bill would pass.\" Asked about implementing a single-payer system, Schumer said he couldn’t predict if that would pass or not, and that views in his conference on the topic are mixed. Senate Democrats are interested in universal coverage, not just access, he said. Without endorsing Medicare for All, Schumer praised its supporters. \"And the energy for Medicare for All that’s out in the streets, it’s great. It pushes everything over that we need to move over,\" he said.", "In April 2019, the Associated Press reported that Schumer \"stopped short of throwing his weight behind Sen. Bernie Sanders’ ‘Medicare for All’ plan.\"", "Thomas P. Miller, co-author of \"Why Obamacare’s Wrong for America,\" and a resident fellow at the conservative American Enterprise Institute, said that in 2009, during debate around the Affordable Care Act, Schumer proposed a kind of public option, but one that didn’t appeal to his colleagues further to the left. The model proposed by Schumer at the time was self-sustaining, not requiring government subsidy.", "We also asked Miller about the broader context of Scott’s remarks, such as the likelihood that the Senate would pass a Medicare for All kind of system if Democrats were in charge. Miller said that would depend on the vote margins - big wins for Democrats could lead them to make greater changes to the health care system - but that he doubts Democrats would abandon private insurance altogether.", "We reached out to Scott’s Senate spokesperson and the NRSC, both of which did not respond to calls and email messages.", "Schumer’s spokesperson also declined to comment for this fact-check.", "When Senate Republicans brought the Green New Deal to the floor -- not because any GOP member supported it, but to force an uncomfortable vote for vulnerable Democratic incumbents -- Schumer took to the Senate floor to condemn the move. He also condemned Senate Republicans for not putting forth meaningful legislation to combat climate change. But Schumer did not endorse the Green New Deal, as proposed by Sen. Edward Markey, D-Mass.", "When a procedural vote on the Republicans’ Green New Deal plan came up, Schumer voted present, as did many of his Democratic colleagues.", "The Green New Deal, as proposed by Markey, is a resolution calling on Congress to create legislation that would achieve net-zero greenhouse gas emissions, investments in infrastructure, job creation, clean air and water and healthy food, among other things. Without other legislation, it would not have the force of law if passed. The resolution has been referred to committee in the Senate.", "While Schumer has not co-sponsored the Green New Deal, he has co-sponsored the \"Thrive Agenda,\" a resolution that calls for combating climate change while investing in minority communities and creating jobs. It has been supported by the Green New Deal Network, a coalition of organizations such as the Sunrise Movement, which has been a foremost proponent of the Green New Deal.", "Scott also said that Schumer wants to \"reduce funding for the police.\"", "Schumer has endorsed a criminal justice reform bill, the \"Justice in Policing Act.\" The bill encourages policing reforms and withholds federal funds if local departments do not make changes, but also provides funding for training. The Congressional Research Service, which produces objective analyses of legislation for members of Congress, found that the receipt of certain federal funds would be conditional on whether state and local agencies prohibited the use of no-knock warrants in certain drug cases, as well as banned choke-holds, and changed use of force standards so the use of deadly force is only used as a last resort to prevent imminent death or serious bodily injury. The legislation also limits transfer of certain military-grade equipment, primarily weapons and vehicles used in combat, to state and local departments.", "In June, Schumer opposed a resolution from Sen. Tom Cotton, R-Ark., opposing efforts to defund the police. In itself, this opposition was not a vote to reduce funding for police.", "Schumer has not said exactly what kind of policies he would pursue if he becomes majority leader, and he has said repeatedly that \"everything is on the table.\"", "Scott said that Schumer was in favor of Medicare for All, the Green New Deal, and reducing funding for police.", "Schumer is not on record supporting Medicare for All, though he has said that a strong health care bill would pass if Democrats take control of the Senate.", "He is not a co-sponsor of the Green New Deal, though he does support legislation to combat climate change supported by a coalition of progressive organizations, known as the Green New Deal Network.", "Schumer supports legislation to make the receipt of federal funds by local and state governments conditional on adopting certain reforms. It would not reduce police funding automatically.", "We rate Scott’s statement False.", "Twitter,  @ScottforFlorida, 2:40 p.m., Nov. 16, 2020. Accessed Nov. 17, 2020.", "Congress.gov, Co-sponsors, S. 1129 - Medicare for All Act 2019 - 116th Congress (2019-2020). Accessed Nov. 24, 2020.", "Vox, article, \"Senate Minority Leader Chuck Schumer on the filibuster, 2020, and Medicare-for-all,\" March 21, 2019. Accessed Nov. 24, 2020.", "Associated Press, article, \"Top Senate Dem stops short of embracing ‘Medicare for All,’\" April 11, 2019. Accessed Nov. 24, 2020.", "Phone interview, Thomas P. Miller, resident fellow, American Enterprise Institute, Nov. 24, 2020.", "Email interview, Dan Diller, policy director, The Lugar Center, Nov. 24, 2020.", "Email interview, Grant Reeher, Ph.D., professor, political science, Syracuse University, Nov. 24, 2020.", "The New York Times, article, \"Schumer Offers Middle Ground on Health Care,\" May 5, 2009. Accessed Nov. 24, 2020.", "NYC-DSA Ecosocialists, \"Tell Chuck Schumer: We Need a Green New Deal Now.\" Accessed Nov. 24, 2020.", "Roll Call, article, \"Senate Democrats dodge vote on Green New Deal resolution,\" March 26, 2019. Accessed Nov. 24, 2020.", "C-SPAN, video, \"U.S. Senate; Senator Schumer on Green New Deal,\" March 25, 2019. Accessed Nov. 24, 2020.", "Politico, article, \"Cotton and Schumer clash over police reform,\" June 10, 2020. Accessed Nov. 25, 2020.", "The Washington Post, \"Sen. Schumer could be the second-biggest winner in the election — or relegated to perennial political bridesmaid,\" Oct. 31, 2020. Accessed Nov. 30, 2020.", "Senate Democrats, press release, \"Schumer Floor Remarks On The Introduction Of The Justice In Policing Act And Demanding Senator McConnell Put Policing Reform And Coronavirus Relief Legislation On The Senate Floor Before July 4,\" June 8, 2020. Accessed Nov. 30, 2020.", "Rev.com, transcript, Chuck Schumer 2020 DNC speech, Aug. 18, 2020. Accessed Dec. 1, 2020.", "PolitiFact, \"7 questions about the Green New Deal,\" Feb. 12, 2019. Accessed Dec. 1, 2020.", "Congressional Research Service, Legal Sidebar, \"Congress and Police Reform: Current Law and Recent Proposals,\" June 25, 2020. Accessed Nov. 30, 2020.", "Politico, \"Chuck Schumer isn’t an ‘angry centrist’ anymore,\" Aug. 24, 2020. Accessed Nov. 30, 2020.", "The Buffalo News, \"Schumer, other Dems, push for police reform,\" June 9, 2020. Accessed Nov. 30, 2020.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]