["About this rating", "A number of cities and organizations have staged relatively quiet firework displays.", "These firework shows are not entirely silent, and they typically don't include the large aerial explosions found in traditional shows nor make use of some new form of 'quiet' decorative explosives.", "As the 4th of July approached in 2018, some social media users were surprised to learn about the existence of \"silent fireworks\" when they came across an article published by the web site \"DogTime\" a few years prior about a town in Italy which had supposedly switched to these seemingly noiseless pyrotechnic displays:", "One town in Italy is taking a big step to reduce the fear of fireworks in their non-human population. The local government of Collecchio made a law that fireworks in their town must be silent. It's a way of reducing the stress that the loud noises cause to animals–not just pets, but wildlife, as well. There's a company called Setti Fireworks that makes these silent explosives and can customize them for each event.", "The phrase \"silent fireworks,\" however, is a bit misleading.", "Many readers seemed to come away with the impression that these \"silent fireworks\" would appear just as big and bright as traditional fireworks, but without the loud explosive booms normally associated with them. That's not the case, however: No matter how advanced pyrotechnicians may be at developing fireworks, they haven't quite yet figured out a way to remove noise from these large explosions.", "In fact, these \"silent firework\" displays (which are probably better described as \"reduced noise\" displays) don't typically include the big aerial explosions found in traditional fireworks shows. Rather than employing some new form of pyrotechnology that dampens the noise of traditional fireworks, such \"quiet\" displays mostly make selective use of existing non-loud forms of fireworks:", "Quiet fireworks are not a new invention. In fact, they are used routinely in classic firework shows as visual effects to accompany the loud bangs. Think of the \"comet tail,\" which shoots into the sky with a trail of sparkles before quietly fizzling out. Or the \"flying fish,\" which features tiny tadpole embers scattering away from a silent burst.", "What is new is the emergence of a genre of low-key, quiet fireworks displays for audiences that want the fanfare of fireworks without the auditory disturbance.", "[But] quiet fireworks can be more colorful.", "The colors in a firework are packed in pellets called \"stars.\" When certain chemical compounds are heated, they emit signature colors to get rid of their excess energy. For instance, barium compounds emit green, red comes from strontium and blues are made with copper.", "As such, these types of displays are generally more appropriate for smaller crowds rather than for large, city-wide celebrations:", "From a strictly visual standpoint, there are pros and cons to a quiet fireworks show. Because they do not include big aerial explosions, quiet shows cannot entertain a large audience, said John A. Conkling, a professor emeritus of chemistry at Washington College in Maryland. As a result, traditionally big shows — like those on the Fourth of July — would need to be divided into smaller viewings.", "Although many readers may have only recently learned about the concept of \"silent fireworks,\" most of them have probably already seen forms of these relatively noiseless displays, such as roman candles and sparklers.", "Here's a video of the \"flying fish\" firework referenced above:", "Thus, reports about \"silent fireworks\" are less about the development of new noiseless products and more about how some towns are focusing on putting on quieter displays. These shows range from nearly silent displays featuring large sparklers, fountains, and roman candles, to aerial shows that employ most everything other than the massively loud aerial \"skyrocket\" shells.", "Paul Singh, the director of Epic Fireworks in England, said that his quiet firework displays are typically softer than the accompanying music and are well below the 120 decibel limit placed on fireworks sold in the UK:", "For people, loud fireworks can lead to hearing loss. The World Health Organization lists 120 decibels as the pain threshold for sound, including sharp sounds such as thunderclaps. Fireworks are louder than that.", "\"They're typically above 150 decibels, and can even reach up to 170 decibels or more,\" said Nathan Williams, an audiologist at Boys Town National Research Hospital in Nebraska.", "Quiet fireworks are not completely silent, but they are nowhere near the 120-decibel cap placed on consumer fireworks in Britain, said Paul Singh, director of Epic Fireworks in England.", "The fireworks he uses in quiet shows are softer than the music he plays to accompany the visuals, Mr. Singh said. His company has done quiet firework shows for school groups, senior citizen homes and venues near easily spooked animals like horses.", "A 2012 video from Gala Fireworks shows just how quiet (or loud) these \"silent firework\" displays can be. This footage was taken during a wedding at Browsholme Hall in England, and the company explained that they used \"low-noise\" fireworks because the venue was surrounded by farm land and they didn't want to scare the livestock:", "Although companies may bill these displays as \"silent\" or \"quiet,\" the fireworks can still generate a good bit of noise. In fact, when the Birmingham Botanical Gardens advertised a quieter fireworks show in 2015, a number of parents still complained that the \"silent\" explosions were far too loud:", "Helen Panayi posted on Facebook: \"Very disappointing that the advertised 'silent fireworks' weren't actually silent, in fact they were very loud. Lots of upset children and angry parents.\"", "Katie Harrison wrote on the same site: \"Very disappointed that the advertised 'silent' fireworks were far from silent. My frightened two-year-old (who I never would have taken to a normal display) did not appreciate them.\"", "So, the term \"silent fireworks\" does not refer to a new form of firework that produces huge explosions with little or no noise, but rather to shows that selectively utilize existing forms of relatively quiet fireworks.", "Mike, Clark.   \"Town in Italy Switches to Silent Fireworks to Reduce Anxiety in Animals.\"     DogTime.   1 June 2016.", "Rawlinson, Kevin.   \"'Silent Fireworks' Display Was Too Noisy, Say Parents.\"     The Guardian.   8 November 2015.", "BBC.   \"Fireworks Curfew to Take Effect.\"     6 August 2004.", "Yin, Steph.   \"'Quiet Fireworks' Promise Relief for Children and Animals.\"     The New York Times.   30 June 2016.", "Update [July 7, 2022]: Updated headline format.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]