["The deterrent effect of execution on murders has long been debated, but Thompson suggests the matter has been resolved. Not so. Here is the full assertion from Thompson's broadcast on ABC radio June 27:", "\"...study after study has shown that the death penalty deters murders. Some studies show really dramatic effects, with each execution of a murderer deterring as many as 18 or more murders. That's according to Emory University professors, who found as well that delaying execution also leads to further murders. Most studies have concluded that some number of murders between three and 18 are prevented for every application of capital punishment.\"", "A dozen research papers in the last six years support Thompson's assertion that capital punishment prevents murders, according to the Associated Press. Three studies get the most attention: a 2006 report by two economists and statistical papers in 2003 and 2006 from the Emory researchers.", "The Law & Order star accurately quotes the Emory study, but his generalizations about \"most studies\" ignore significant contrary research.", "A handful of studies directly challenge pro-deterrence findings by highlighting various missteps in methodology. \"These studies fail to reach the demanding standards of social science to make such strong claims, standards such as replication and basic comparisons with other scenarios,\" said Jeffery Fagan of the Columbia Law School during testimony before a New York legislative panel.", "Most notable is a paper by two National Bureau of Economic Research fellows who concluded \"that execution policy drives little of the year-to-year variation in homicide rates. As to whether executions rise or lower the homicide rate, we remain profoundly uncertain.\"", "Associated Press. June 10, 2007\"Does Capital Punishment Have a Deterrent Effect? New Evidence from Postmoratorium Panel Data,\" By Hashem Dezhbakhsh, Paul H. Rubin and Joanna M. Shepherd. Published in American Law and Economics Review (2003).\"Getting Off Death Row: Commuting Sentences and the Deterrent Effect of the Capital Punishment\" by H. Nancy Mocan and R. Kaj Gittins. 2006. \"Deterrence and the Death Penalty: A Critical Review of New Evidence\" by Jeffery Fagan, Columbia Law School. \"Uses and Abuses of Empirical Evidence in the Death Penalty Debate\" by John Donohue and Justin Wolfers. January 2006. Death Penalty Information Center.", "\"Does Capital Punishment Have a Deterrent Effect? New Evidence from Postmoratorium Panel Data,\" By Hashem Dezhbakhsh, Paul H. Rubin and Joanna M. Shepherd. Published in American Law and Economics Review (2003).\"Getting Off Death Row: Commuting Sentences and the Deterrent Effect of the Capital Punishment\" by H. Nancy Mocan and R. Kaj Gittins. 2006. \"Deterrence and the Death Penalty: A Critical Review of New Evidence\" by Jeffery Fagan, Columbia Law School. \"Uses and Abuses of Empirical Evidence in the Death Penalty Debate\" by John Donohue and Justin Wolfers. January 2006. Death Penalty Information Center.", "\"Does Capital Punishment Have a Deterrent Effect? New Evidence from Postmoratorium Panel Data,\" By Hashem Dezhbakhsh, Paul H. Rubin and Joanna M. Shepherd. Published in American Law and Economics Review (2003).\"Getting Off Death Row: Commuting Sentences and the Deterrent Effect of the Capital Punishment\" by H. Nancy Mocan and R. Kaj Gittins. 2006. \"Deterrence and the Death Penalty: A Critical Review of New Evidence\" by Jeffery Fagan, Columbia Law School. \"Uses and Abuses of Empirical Evidence in the Death Penalty Debate\" by John Donohue and Justin Wolfers. January 2006. Death Penalty Information Center.", "\"Getting Off Death Row: Commuting Sentences and the Deterrent Effect of the Capital Punishment\" by H. Nancy Mocan and R. Kaj Gittins. 2006. \"Deterrence and the Death Penalty: A Critical Review of New Evidence\" by Jeffery Fagan, Columbia Law School. \"Uses and Abuses of Empirical Evidence in the Death Penalty Debate\" by John Donohue and Justin Wolfers. January 2006. Death Penalty Information Center.", "\"Deterrence and the Death Penalty: A Critical Review of New Evidence\" by Jeffery Fagan, Columbia Law School. \"Uses and Abuses of Empirical Evidence in the Death Penalty Debate\" by John Donohue and Justin Wolfers. January 2006. Death Penalty Information Center.", "\"Uses and Abuses of Empirical Evidence in the Death Penalty Debate\" by John Donohue and Justin Wolfers. January 2006. Death Penalty Information Center.", "Death Penalty Information Center.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]