["From last year's raging fires in Australia and California to this month's deadly snow storms in Texas, the world is grappling with the effects of climate change.", "The Texas storms led some, including Gov. Greg Abbott, to inaccurately attempt to blame green energy for the state's massive energy failure, which left thousands without power or water in freezing temperatures.", "In the wake of the storms, critics of green energy took to social media. One Facebook post  recirculates a meme that went viral in March 2019, following comments made by then President Trump. It claims windmills will never create as much energy as was invested in building them.", "The image reads, \"A two-megawatt windmill contains 260 tons of steel requiring 170 tons of coking coal and 300 tons of iron ore, all mined, transported and produced by hydrocarbons. A windmill could spin until it falls apart and never generate as much energy as was invested in building it.\"", "The quote is falsely attributed to Canadian author and professor Thomas Homer-Dixon.", "USA TODAY reached out to the Facebook user who shared the post for comment.", "More:Fact check: Frozen wind turbines don't deserve all the blame for Texas blackouts", "The quote in question is not from Homer-Dixon.", "Instead, it is a partial quote, selectively chosen from the book \"Carbon Shift: How Peak Oil and the Climate Crisis Will Change Canada (and Our Lives),\" written by David Hughes and co-edited by Homer-Dixon.", "Homer-Dixon addressed the inaccurate quote in this 2018 blog post.", "\"A poster widely circulated on the Web highlights text that was purportedly written by me saying that wind power inevitably suffers an energetic deficit,\" the post reads. \"The poster is fraudulent. I didn’t write the text, the text itself is selectively quoted, and the argument it makes, taken in isolation, is meaningless.\"", "The quote in the Facebook post is incomplete, making it misleading. The full text reads:", "\"A two-megawatt windmill contains 260 tonnes of steel requiring 170 tonnes of coking coal and 300 tonnes of iron ore, all mined, transported and produced by hydrocarbons. At a good wind site, the energy payback day could be in three years or less; in a poor location, energy payback may be never. That is, a windmill could spin until it falls apart and never generate as much energy as was invested in building it.”", "While the content of the Facebook post is somewhat authentic, the image leaves out critical information and context that changes the meaning of the writing.", "In his response to the inaccurate meme, Homer-Dixon wrote, \"So, 1) I didn’t write the text, 2) the text itself is selectively quoted, and 3) the argument it makes, taken in isolation, is meaningless. Three strikes.\"", "The claims in the post have been rated FALSE. The Facebook post misattributes the quote to Thomas Homer-Dixon, when it was actually written by David Hughes. Additionally, the quote is deceptively selected and misrepresents the actual content of the writing.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook."]