["Several Facebook and Twitter users shared a 58-second video of a man sprinkling water on wheat bags. Messages shared along with the video suggested that farmers across Punjab and Haryana are soaking the grains in water to rot them and sell them off to breweries and distilleries. The message added that these wheat bags are lying in FCI godowns where the farmers sold them for Minimum Support Price (MSP).", "FCI storage yards with wheat bought at MSP. This is the scene across Punjab and Haryana. Water is sprinkled on wheat bags to let the grain rot and is thrown out as waste. It is then sold to distilleries and breweries by the 5 Star farmers and their agents who are agitating on the Delhi border. There is huge money involved upto 6000-7000 crores per year. This types of scam is going on since last 45 years and the main reason of “Kishan Andolan” of only two states people.", "We must forward this message as much as possible to expose their nefarious design. 👇👇👇👇", "Posted by Nagesh Bhat on Sunday, 7 February 2021", "Twitter user @NimbuMassala wrote, “1st they soak wheat to increase weight. They claim MSP for this useless produce. This rots in FCI godowns. This rotten grain is bought at throwaway process by distilleries run often by the Star Farmers protesting against. #FarmLaws Double Gains.” (Archive link)", "#FarmersProtests decoded 1st they soak wheat to increase weight ⬇️ They claim MSP for this useless produce ⬇️ This rots in FCI godowns ⬇️ This rotten grain is bought at throwaway process by distilleries run often by the Star Farmers protesting against #FarmLaws 🔄 Double Gains pic.twitter.com/2Md25TnOcf", "— 𝓐𝓷𝓼𝓱𝓾𝓵 𝓑𝓱𝓪𝓻𝓽𝓲𝔂𝓪 🇮🇳🇮🇳 (@NimbuMassala) January 17, 2021", "Several Facebook users have shared the video relating it to the ongoing farmers’ protests", "Alt news received several fact-check requests on Whatsapp (+917600011160) to verify the video.", "We used InVid to break down the viral video into several frames. A subsequent reverse image search led us to a two-year-old YouTube video uploaded by Focus Haryana. The local media outlet did a report about the viral video two years ago. According to the report uploaded on April 28, 2018, “The incident took place in Fatehabad district of Haryana where grain traders were caught soaking wheat bags to increase their weight.” Fatehabad market committee secretary Sanjiv Sachdeva has been quoted in the report stating, “We reached the spot as soon as we heard and conducted an investigation. We found that labourers of the farm 124-B were indeed sprinkling water on wheat bags.” A notice was also issued to the accused farm owner.", "Punjab Kesari Haryana too reported on the incident. It said that the accused trader was the state executive member of the National Lokdal Party, Kuljeet Kuladia.", "Dainik Bhaskar and News18 carried similar stories. However, Dainik Bhaskar’s report states that Kuljeet Kuladia refuted the accusations and said that the man soaking the wheat bags was not from his farm.", "ABP News had fact-checked the video two years ago.", "This slideshow requires JavaScript.", "None of the reports states that the farmers themselves soaked the grain bags. An old video of traders increasing the weight of grain bags to make profits was shared to discredit farmers.", "Donate Now", "A journalist and a dilettante person who always strives to learn new skills and meeting new people. Either sketching or working.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]