["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Eric Fehrnstrom of the Mitt Romney presidential campaign said that job growth in Massachusetts increased over Romney's four-year tenure as governor.", "Both presidential campaigns are using job statistics to attack each other. President Barack Obama and his allies have spent months criticizing Mitt Romney’s job-creation record as governor of Massachusetts. Now, Romney and his surrogates are arguing that job creation in Massachusetts actually improved on Romney’s watch.\n\nSo who’s right?\n\nWe’ll start by looking at a claim that senior Romney adviser Eric Fehrnstrom made on ABC’s This Week with George Stephanopoulos on June 3, 2012.\n\n\"If you throw D.C. into the mix,\" Fehrnstrom said, \"we were 51 out of 51 (in job creation). By the time Mitt Romney left four years later, we were in the middle of the pack. We were 30th in the nation in terms of job growth. That's the trend line that you want to see.\"\n\nWe are separately checking a competing claim made by top Obama adviser David Axelrod on CBS’ Face the Nation. Axelrod said Massachusetts ranked 47th in job creation during Romney’s tenure as governor.\n\nFor this fact-check, we'll follow our usual approach of looking at the claim in two parts: first, are the numbers correct, and second, how much is the change because of Romney's policies?\n\nFirst, we confirmed the Romney camp’s methodology, which relied on state-level statistics from the Bureau of Labor Statistics, the federal government’s official source of employment data. The Romney campaign used figures for non-farm jobs, seasonally adjusted, as tracked by the government’s payroll survey. And because the Massachusetts governor takes office in early January, the campaign used the data for December of each year as a baseline.\n\nAccording to a spokesman, the Romney campaign calculated the yearly percentage increase or decrease in job growth for each of Romney’s four years in office. So from December 2002 to December 2003, the job growth in Massachusetts was 51st highest nationally out of 50 states plus the District of Columbia -- in other words, dead last. The following year, it was 46th, then 40th, then in Romney’s final year in office -- December 2005 to December 2006 -- it was 30th in the nation.\n\nLooking at the statistics in this way advances the Romney camp’s argument that, while Massachusetts’ overall job growth under Romney was among the lowest of any state, the trendline over time puts his tenure in a more favorable light. A state that was a doormat in job growth at the beginning of his tenure rose into the broad middle of the rankings by the end of it.\n\nWe did our own math and found the exact same results as the Romney camp. So we agree that the numbers back up Fehrnstrom’s general argument that job growth rates in the state improved over the course of Romney’s governorship relative to other states.\n\nBut does Romney deserve credit for the job growth? This is an issue we've addressed often at PolitiFact with governors from many states. Economists have consistently told us that policies of a governor have a relatively small impact on a state's economy.\n\nMichael Widmer, president of the Massachusetts Taxpayers Foundation, an independent group that analyzes fiscal trends in the state, warned us when we first looked at Axelrod’s 47th-in-the-nation claim in June 2011 not to put to much stock in any governor's influence over their state's rate of job growth. The ability for governors to manage the state economy is vastly overrated, Widmer said. States are tied to larger economic forces, he added, and governors often claim too much credit when things are going well and no blame when things are going poorly.\n\n\"Presidents, governors, and mayors can have an impact on job creation during their terms in office,\" said Gary Burtless, an economist with the Brookings Institution. \"Almost always, however, the impact is small in relation to the effects of events and trends over which elected officials have little control, especially in their first few years on the job. A recession that is underway or begins soon after a president or governor takes office is in no way the fault of the new officeholder. The flip side is that chief executives cannot claim much credit for a strong economic recovery that begins shortly before or after they take the oath of office. The conditions that made the recovery possible were already present when their term in office began. The executive’s policies may have speeded or slowed the recovery around the margins, but the conditions that caused the recovery to begin were already present before the oath of office was administered.\"\n\n(As we’ve noted before, Burtless contributed $750 to Obama’s campaign in 2011. However, in 2008 he provided advice on aspects of labor policy to the presidential campaign of Sen. John McCain, R-Ariz., and he has worked as a government economist and served on federal advisory panels under presidents of both parties.)\n\nOur rating\n\nThe Romney camp’s year-by-year numbers are correct: Job growth was sluggish early in Romney’s gubernatorial term, and then less so by the time he was ready to leave office. However, Romney -- like the Obama campaign before it -- is exaggerating Romney’s influence on the state job market. Governors simply don't have that much impact.\n\nOn balance, we rate the statement Half True.", "Eric Fehrnstrom, interview on ABC’s This Week with George Stephanopoulos, June 3, 2012", "PolitiFact, \"Dems say under Gov. Mitt Romney, Massachusetts ranked 47th out of 50 states in job creation,\" June 22, 2011", "Bureau of Labor Statistics, main index page for \"Employment, Hours, and Earnings - State and Metro Area (Current Employment Statistics - CES),\" accessed June 5, 2012", "Interview with Gary Burtless, senior fellow at the Brookings Institution, Feb. 28, 2012", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]