["About this rating", "Pandemics of some type were extant during all four of the years referenced in the meme.", "However, the meme cherry-picks a small amount of data and isn't particularly useful in any predictive sense.", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "A common phenomenon that occurs during crises (e.g., natural disasters, political upheaval, terrorist attacks) is attempts by people to assert a sense of certainty and control over events by finding patterns in them, thereby suggesting that whatever is occurring — however chaotic or frightening it may be — is nonetheless natural, predictable, or manageable. So it was with the following meme, which was circulated during the COVID-19 coronavirus disease pandemic in April 2020:", "Although this meme couldn't fairly be classified as \"false\" (since pandemics of some type were indeed extant during all four of the years it references), it isn't particularly useful in any informative or predictive sense.", "It's an example of the common technique of creating the impression of a regular pattern by cherry-picking a small amount of (not necessarily relevant) data, while completely ignoring a much larger body of related data that doesn't fit the desired pattern. Specifically:", "Nonetheless, for those who want to know how \"true\" the meme is, we offer the following summary of what its entries refer to:", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]