["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "• Biden said during a televised town hall meeting that his proposed policies would pay farmers to put land in land banks and to plant certain carbon-absorbing crops. U.S. government programs already exist that pay farmers not to plant crops on their land, or to plant certain crops, including the Conservation Reserve Program and the Conservation Stewardship Program.", "• Biden vowed to “dramatically expand and fortify” the existing Conservation Stewardship Program to include payments based on environmentally friendly practices such as carbon sequestration. He specified during the town hall meeting that his policies would pay farmers “for planting certain crops that in fact absorb carbon from the air.”", "• The programs are voluntary.", "Facebook users are calling out Joe Biden’s plans for American farmers. Posts like this one say Biden wants farmers to put their land into government-owned land banks and would tell them what sustainable plants they can grow.", "\"Biden wants American farmers to put their farmland into Gvt ‘land banks.’ Gvt would then tell farmers what ‘sustainable’ plants they could grow. Are you ok with this,\" says one text post.", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The claim appears to be based on an answer Biden gave during a Sept. 17 CNN presidential town hall meeting. During the televised event, Julie Masser Ballay, a Pennsylvania farmer and Republican, asked Biden how he plans to decrease the regulatory burden for farmers. Ballay referenced the threat of increased regulation of farms, particularly through the proposed Green New Deal.", "Biden answered: \"Number one, we should provide for your ability to make a lot more money, as farmers, by dealing with you being able to put land in land banks, and you get paid to do that to provide for more open space and provide for the ability of you to be able to be in a position that we are going to pay you for planting certain crops that in fact absorb carbon from the air,\" according to a transcript of the event.", "Agricultural programs similar to land banks already exist in the United States. For example, the Conservation Reserve Program administered by the Farm Service Agency of the U.S. Department of Agriculture pays farmers a yearly rental fee if they agree to \"remove environmentally sensitive land from agricultural production and plant species that will improve environmental health and quality,\" according to the Farm Service Agency.", "Similarly, the Conservation Stewardship Program that Biden vowed to expand already includes a grasslands conservation initiative that pays farmers to turn cropland into grass or pasture.", "Biden’s remark that \"we will pay you for planting certain crops that in fact absorb carbon from the air\" is likely a reference to his proposal to expand the Conservation Stewardship program to pay farmers for \"practices to protect the environment, including carbon sequestrestration,\" according to his answer to the Presidential Candidate Questionnaire from the American Farm Bureau.", "Certain crops, including \"cover crops,\" are important to carbon sequestration, according to Sustainable Agriculture Research and Education, part of USDA.", "We contacted Biden’s campaign for comment but did not receive a reply.", "The programs are voluntary, not mandatory. So to the extent a hypothetical Biden administration is telling farmers what plants to grow, it’s only because the farmers agreed to do so in the first place.", "The Facebook post says Biden \"wants American farmers to put their farmland into Gvt ‘land banks.’ Gvt would then tell farmers what ‘sustainable’ plants they could grow.\"", "The claim is partially accurate. Biden does support land banks for farmers — and similar programs already exist — and paying farmers for growing certain crops. But practices such as paying farmers not to plant crops or to plant certain crops are voluntary programs, and farmers must apply to participate.", "We rate this statement Half True.", "American Farm Bureau, Presidential Candidate Questionnaire, 2020, accessed Oct. 4, 2020", "CNN, \"Transcript, CNN Presidential Town Hall with Joe Biden,\" aired Sept. 17, 2020", "Facebook post, accessed Oct. 4, 2020", "Farm Service Agency, United States Department of Agriculture, \"Conservation Reserve Program,\" accessed Oct. 4, 2020", "Farm Service Agency, United States Department of Agriculture, \"Conservation Reserve Program Fact Sheet,\" December 2019", "National Resources Conservation Service, \"Conservation Stewardship Program,\" accessed Oct. 4, 2020", "Sustainable Agriculture Research and Education, \"Cover Crops and Carbon Sequestration,\"accessed Oct. 4, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]