["A 45-second video of an employee at a restaurant packing food has been shared with the claim that a Muslim man is spitting on the food before delivering it to customers. On March 21, Mahesh Vikram Hegde, founder of fake news platform Postcard News tweeted the viral video and wrote, “What’s the use of Janata Curfew when we have deadly sadists like this man? Arrest this lunatic immediately.” This was retweeted over 2,000 times (archive link). Hegde’s call for arrest suggested this is a recent incident from India. Alt News has found Hegde promoting misinformation on numerous occasions in the past.", "After looking at this, I’m scared to eat at hotels!", "Watch the video where a hotel staff spits at food items, before serving it to customers!", "What’s the use of Janata Curfew when we have deadly sadists like this man?", "Arrest this lunatic immediately pic.twitter.com/3Q2m14ujeE", "— Mahesh Vikram Hegde (@mvmeet) March 21, 2020", "The video has been shared after a congregation held in mid-March by Tablighi Jamaat was identified as a source of several positive coronavirus cases across the country.", "Roop Darak, Telangana State spokesperson at BJP’s youth wing Bharatiya Janta Yuva Morcha, tweeted the viral video and called for a boycott of “such shops”. This was retweeted over 1,000 times (archive link). BJP supporter Sonam Mahajan also tweeted the viral video and justified an incident where a man had refused delivery from a Zomato executive who was a Muslim man. Her tweet was retweeted over 1,200 times. (archive link)", "Several Facebook users have a shared the viral video along with a Hindi text, “Refrain from eating things from the market and notice the lowliness of those who wear a cap (खाने पीने की बाजारी चीजो से परहेज करें और टोपी वाली बीमारी की नीचता देखे)”", "Alt News has received several requests to fact-check the viral video on WhatsApp (+91 76000 11160) and on our official Android application.", "Alt News broke the video into multiple keyframes and performed a reverse image search of one of the frames on Google. We found that the video was uploaded by a YouTube channel on April 27, 2019.", "After rummaging through various reverse image search results on Google and Yandex, we discovered that the video has been circulating recently in several countries in light of the coronavirus pandemic.", "A March 22, 2020, report in Gulf News said, “Abu Dhabi Public Prosecution has confirmed that a viral online video of a worker blowing into a plastic bag containing food was not shot in the UAE.” The report also stated that the video of a man blowing into a food bag was traced to an “Asian country”.", "A March 19, 2020, article by Complain Singapore reported that a complaint was filed with the Singapore Food Agency (SFA) based on the clip. Several people believed that the incident happened in a restaurant in Singapore. Complain Singapore published a statement by SFA: “We note that the video is not new as it was posted on social media last year.” SFA debunked social media claims that the stall’s name is “Best Muslim Food Stall” located at Block 724 Clementi West Street 2. The agency stated, “Our investigations found that there is no such food shop at the said location. Our officers also inspected eating houses and food establishments in the vicinity but did not find any stall with the same or similar names.”", "Both the reports from UAE and Singapore claim that the man blew into the food packet. There is no mention of intentional spitting.", "In fact, the video was also viral in Malaysia last year, A May 1, 2019 report by Feed Me, a Malaysia-based lifestyle website, said, “The location of the mamak (open-air food restaurant) remains a mystery despite the post has gone massively viral, gathering over 11,000 shares since it posted on April 26.”", "While Alt News could not establish exact details about the video, it has been circulating in other countries at least since April last year and was picked up recently after the coronavirus crisis. The origin of video doesn’t seem to be India because it began circulating here especially after CRPO Northern Railway claimed that people from Tablighi Jamaat were unruly at quarantine centres and spat on medical workers.", "Amidst the deluge of misinformation related to coronavirus since past few days, there has been an increase in misinformation along communal lines which targets the Muslim community. Alt News recently fact-checked a viral video of people practising a ritual in Sufism which was falsely shared as intentional sneezing inside Delhi’s Nizamuddin mosque to spread the coronavirus infection. Prior to this, we debunked a video of Bohra Muslims practising the ritual of licking utensils to not waste leftover food which was also shared with the same claim. A video of an undertrial in Mumbai was falsely shared as Nizamuddin Markaz attendee spitting at cops.", "Note: The number of positive cases of the novel coronavirus in India exceeds 5,000 and more than 150 deaths have so far been reported. The government has imposed a complete restriction on movement apart from essential services to tackle the pandemic. Globally, more than 14 lakh confirmed cases and over 80,000 deaths have been reported. There is a sense of panic among citizens, causing them to fall for a variety of online misinformation – misleading images and videos rousing fear or medical misinformation promoting pseudoscience and invalid treatments. While your intentions may be pure, misinformation, spread especially during a pandemic, can take lives. We request our readers to practice caution and not forward unverified messages on WhatsApp and other social media platforms.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "A purported video of a Muslim man beating a temple priest with a bat is…", "A picture depicting the Pakistani flag apparently bigger in size and apparently placed higher than…", "Amid the ongoing war between Israel and Hamas, a video of a fleet of cars…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "A clip featuring Pakistan men’s Cricket team captain Babar Azam is viral on social media…"]