["The claim was shared here on Facebook on January 21, 2021.", "“A special statement from prison,” the Korean-language text reads.", "“I am Lee Jae-yong. First of all, I apologise to the South Korean people who support Samsung. I have no excuse for failing to behave properly owing to my negligence.”", "“I am thinking of leaving this country. I will serve all the sentence I received. I will not beg for pardon.”", "“We will relocate the company headquarters overseas. We will follow due process for this matter.”", "“20.1.2021 from prison, Lee Jae-yong.”", "Lee was sentenced to two and a half years in prison on January 18, 2021, after he was found guilty of bribery and embezzlement in connection with the scandal that brought down South Korea's former president Park Geun-hye.", "Lee “actively provided bribes and implicitly asked the president to use her power to help his smooth succession” at the head of the sprawling conglomerate, the Seoul Central District Court said in its verdict.", "He has effectively been at the head of the entire Samsung group for several years after his father was left bedridden by a heart attack, finally dying in October.", "The letter was also shared on Facebook here, here and here and on Korean platform Naver blog here alongside similar claims that it shows a genuine message from Lee.", "However, the claim is false.", "Contacted by AFP on January 21, 2021, Samsung Electronics said the letter is “fake”.", "In his first message from prison, Lee pledged to “continue supporting the compliance committee’s activities and also asked the committee members to keep up the good work in their jobs,” Samsung said.", "Samsung’s compliance committee oversees the firm’s transparency in its corporate dealings, as reported here by AFP on May 6, 2020.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]