["About this rating", "It's not uncommon for scammers to post headlines and images on social media that tease compelling news stories (such as celebrity deaths, horrible accidents, or earth-shaking political developments) in order to lure users into clicking through on them. Those users don't end up viewing information or video about the promised stories, however, but instead are often led to sites that promote scam offers (such as sweepstakes surveys) or distribute computer viruses and other malware.", "Since at least as far back as early 2017, warnings have been circulated via WhatsApp, text messaging, and social media sites that opening a photograph supposedly showing Donald Trump suffering from a stroke will unleash a virus that will wipe the data from your cellphone or computer:", "Urgent!!! Dear brothers & sisters, if you have received Pictures of Donald Trump suffering from a  stroke, please do not open it but  delete it immediately because it will destroy all info in your computer & handphone. Please pass this to all your friends & groups.", "Urgent notice\nBrothers and sisters in the group:\nJust received the picture if you received the “Trump Suffering from Stroke”, please do not open it and delete it immediately. Now it has been confirmed that this is a relatively young Filipino Internet youth. Attacking Chinese computers and mobile phones will cause the computer to lose all information. Please send it to each group and inform each other.", "President Trump has not suffered a stroke, of course, and such messages are nearly identical to an earlier fake virus warnings that cautioned users not to click on a picture of \"two police officers arresting Donald Trump.\" Like that previous variant, The \"Trump suffering from a stroke\" messages do not reference any real virus or malware threat and should be ignored as hoaxes.", "(NOTE: The picture displayed above was taken from a fake news story circulated in August 2016.)", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]