["“I’m dead right on this. The coronavirus is the common cold, folks,” Limbaugh said of the novel coronavirus on his show on February 24, 2020. Limbaugh was decrying the virus “being weaponized as yet another element to bring down Donald Trump.”", "A similar theory took hold on social media in the days following Limbaugh’s remark, though without any explicit connection to the radio host. Some Facebook users began to share a photo of an old medical textbook citing the common cold as a possible condition caused by coronaviruses.", "Coronaviruses are a large family of viruses, some of which can cause the common cold.", "However, as the US Centers for Disease Control and Prevention (CDC) states on its website: “The virus causing coronavirus disease 2019 (COVID-19), is not the same as the coronaviruses that commonly circulate among humans and cause mild illness, like the common cold.”", "Like the SARS-Cov, a coronavirus discovered in 2003 that killed 774 people, the novel coronavirus is a more serious strain that has infected more than 90,000 people worldwide, killing more than 3,000.", "The novel coronavirus, also named COVID-19 or SARS-Cov-2, was discovered in the central Chinese city of Wuhan in December 2019, and is more closely related to bat coronaviruses.", "“These viruses are all far more deadly than the established human coronaviruses, particularly in elderly individuals,” Justin Lessler, professor of epidemiology at John Hopkins University’s School of Public Health, told AFP by email, in reference to SARS-CoV and COVID-19.", "The Virginia Department of Health lists four types of common human coronaviruses that cause mild to moderate respiratory infections such as the common cold: 229E, NL63, OC43, and HKU1. The CDC lists the same four viruses on its own web page.", "According to a World Health Organization (WHO) report on COVID-19, symptoms of the newly discovered virus “can range from no symptoms... to severe pneumonia or death,” but in a majority of cases included fever and dry cough, to which the CDC adds shortness of breath.", "Symptoms of the common cold include sore throat, runny nose, coughing, sneezing, headaches, and body aches. Common colds, the CDC notes, are caused by many different respiratory viruses, “but rhinoviruses are the most common.”", "Rhinoviruses are responsible for more than half of cold-like illnesses, according to a review of this virus family from the American Society for Microbiology.", "The photo used in Facebook posts to equate the novel coronavirus with the common cold appears to be from the 1989 American Medical Association Encyclopedia.", "The textbook is correct, but refers to common human coronaviruses, and not the strain responsible for the current deadly worldwide outbreak.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]