["By Lori Robertson and Eugene Kiely", "Posted on August 11, 2016 | Updated on August 12, 2016", "Donald Trump claims that President Barack Obama and former Secretary of State Hillary Clinton “founded ISIS.” But the origin of the Islamic State terrorist group dates back to the Bush administration.", "Trump points to the withdrawal of troops from Iraq in 2011, under Obama, as “the founding of ISIS,” but experts say the expansion of the Islamic State after that point can’t be pinned on the troop withdrawal alone — if at all. And there’s the fact that President George W. Bush had signed the agreement and set the date for that withdrawal.", "“It’s a massively complex problem,” Clint Watts, the Robert A. Fox fellow in the Foreign Policy Research Institute’s Program on the Middle East, told us. It “goes beyond one single policy decision about keeping or moving troops.”", "Furthermore, Trump himself supported withdrawing troops from Iraq as early as 2007, telling CNN in a March 16, 2007, interview that the U.S. should “declare victory and leave, because I’ll tell you, this country is just going to get further bogged down. … [T]his is a total catastrophe and you might as well get out now, because you just are wasting time.”", "But now, in the midst of a campaign to be president, Trump says the withdrawal, without leaving behind a small force, created ISIS. His comments at a rally in Fort Lauderdale, Florida, came after he has been linking Clinton to ISIS for weeks.", "Trump, Aug. 10: We shouldn’t have ever, ever, ever got into Iraq. I said it from the beginning. I said it from the beginning. … I said you’re going to destabilize the Middle East and we did. And then, an even easier decision, we should have never gotten out the way we got out. … We had a president who decided he’d announce a date and he was going to get out by that date. The problem is the enemy, which really turned out to be ISIS, the enemy was sitting back and actually didn’t believe that this could be happening. … That they would actually say when they were getting out. So they sat back and they sat back …  but instead of allowing some small forces behind to maybe, just maybe, keep it under control, and we pulled it out eventually. …", "And then we decimated one of the powers and we unleashed fury all over the Middle East. It was a terrible mistake. And then Obama came in and normally you want to clean up, he made a bigger mess out of it. … And then you had Hillary with Libya. So sad.", "In fact, in many respects you know they honor President Obama. ISIS is honoring President Obama. He is the founder of ISIS. He’s the founder of ISIS. He’s the founder. He founded ISIS. And I would say the co-founder would be crooked Hillary Clinton, co-founder.", "Trump reiterated his “founder of ISIS” comments in interviews on Aug. 11. When conservative radio host Hugh Hewitt asked him, “You meant that [Obama] created the vacuum, he lost the peace,” Trump responded: “No, I meant he’s the founder of ISIS. I do. He was the most valuable player. I give him the most valuable player award. I give her, too, by the way, Hillary Clinton.” Trump added that “the way he got out of Iraq … was the founding of ISIS, O.K.?”", "Let’s start with a quick fact-check of Trump’s position on the Iraq War: There is no evidence that Trump opposed the war in Iraq before it started on March 19, 2003, despite his frequent claims to the contrary. In fact, Trump expressed mild support in September 2002 for invading Iraq in an interview with radio host Howard Stern. The Trump campaign, in a footnoted speech, has pointed to an interview in January 2003 with Fox News’ Neil Cavuto, but, as we’ve explained before, Trump took no position in that interview, saying only that President Bush should make a decision: “Either you attack or you don’t attack,” he said.", "That March 2003 invasion of Iraq — supported at the time by Clinton, who was in the U.S. Senate, and opposed by Obama, who was a state senator — marked the beginning of the rise of a terrorist group that has adopted several names over the years, most recently the Islamic State.", "We’ll note that some of Trump’s comments can be taken as opinion — the “most valuable player” comment, for instance. But his claims that Obama and specifically the troop withdrawal “founded” ISIS don’t measure up to the well-documented history of this terrorist group.", "If anyone can be called the “founder of ISIS,” it’s Abu Musab al-Zarqawi, a Jordanian who formed al Qaeda in Iraq, the group that became ISIS, after the U.S. invasion of Iraq in 2003.", "A June 27 report by the Congressional Research Service provides a timeline of “The Roots of the Islamic State,” which begins in October 2002, when Zarqawi assassinated USAID official Laurence Foley in Jordan and then relocated to Iraq. By October 2004, Zarqawi’s group was known as al Qaeda in Iraq. He took advantage of sectarian strife in Iraq — Sunni opposition to U.S. forces and the ruling Shia party — to build his organization.", "“The Islamic State has its origins in the U.S. invasion of Iraq,” Princeton University professor Bernard Haykel, who heads the university’s Institute for Transregional Study of the Contemporary Middle East, North Africa and Central Asia, told us in an interview. “It is tied to a man named Abu Musab al-Zarqawi who was killed in an American attack in 2006. I don’t see that Obama has anything to do with it – at all. He wasn’t even on the scene when the founders of ISIS set it up.”", "In June 2006, Zarqawi was killed in a U.S. airstrike, but Egyptian Abu Ayub al-Masri took over the organization, calling it the Islamic State of Iraq a few months later.", "In an analysis, “From Paper State to Caliphate,” for the Brookings Institution’s Center for Middle East Policy, Cole Bunzel writes that the significance of the group’s name change to the Islamic State of Iraq “was much greater than was appreciated at the time. It signaled the start of an ambitious political project: the founding of a state in Iraq– a proto-caliphate — that would ultimately expand across the region, proclaim itself the fullfledged caliphate, and go on to conquer the rest of the world.”", "In 2010, Masri, and another top Islamic State official, were killed in a joint Iraqi-U.S. raid. When U.S. troops withdrew from Iraq at the end of 2011, the CRS report explains, the Islamic State of Iraq “was weakened, but not eliminated.”", "CRS, “The Islamic State and U.S. Policy,” June 27: The Islamic State’s direct ideological and organizational roots lie in the forces built and led by the late Abu Musab al Zarqawi in Iraq from 2002 through 2006. … Zarqawi took advantage of Sunni animosity toward U.S. forces and feelings of disenfranchisement at the hands of Iraq’s Shia and Kurds to advance a uniquely sectarian agenda that differed from Al Qaeda’s in important ways. … Following Zarqawi’s death at the hands of U.S. forces in June 2006, AQ-I leaders repackaged the group as a coalition called the Islamic State of Iraq (ISI). ISI lost its two top leaders in 2010 and was weakened, but not eliminated, by the time of the U.S. withdrawal in 2011. The precise nature of ISI’s relationship to Al Qaeda leaders from 2006 onward is unclear.", "Watts, with the Foreign Policy Research Institute, said that 2006 was when the “big governance model” of what we now see as the Islamic State was formed. There was “some divergence from the al Qaeda brand name” and disagreements between the two groups at this point.  When the U.S. troops withdrew, the terrorist group had gone underground, with members in prisons or detention camps, Watts said. In 2011 and 2012, the group was “lightly functioning,” but still in existence.", "By 2013, the terrorist group was again launching attacks in Iraq and had spread to Syria, taking advantage of that country’s internal strike. Syria’s civil war started in March 2011.", "Critics and experts have pointed to several actions during the Bush and Obama administrations that could have contributed to the rise of ISIS:", "Obama and Clinton were not in lockstep over how the U.S. should handle the situation in Syria: Both Clinton and former Secretary of Defense Leon Panetta have said the administration should have armed rebels fighting in Syria sooner. During the 2012 presidential campaign, Watts noted, the debate was over a no-fly zone in Syria. Neither Obama nor the Republican candidate, Mitt Romney, advocated a deeper military involvement in Syria.", "It is, of course, unknown how any number of different decisions would have affected the creation or growth of the Islamic State, or a similar terrorist group.", "Since Trump has pinpointed “the way [Obama] got out of Iraq” as “the founding of ISIS,” we’ll take a closer look at that action.", "As we have explained before, Republicans and Democrats differ on which president should be blamed for the withdrawal of all combat troops at the end of 2011. Trump says that “[w]e had a president who decided he’d announce the date” of withdrawal — but that president was Bush.", "Bush signed the agreement, known as the Status of Forces Agreement, on Dec. 14, 2008. It said: “All the United States Forces shall withdraw from all Iraqi territory no later than December 31, 2011.” Condoleezza Rice later wrote that Bush wanted an agreement for a residual force to remain, but Maliki objected.", "Obama, however, had three years to renegotiate the deal, which his administration tried to do, seeking to leave an American troop force of 5,000 to 10,000. But Maliki objected again, and negotiations broke down in October 2011 over the issue of whether U.S. troops would be shielded from criminal prosecution by Iraqi authorities. Obama’s then defense secretary, Panetta, later wrote in his 2014 book that Obama didn’t press hard enough for a deal, although some experts say it would not have mattered because Iraq was more closely aligned at the time with Iran.", "Maliki “wanted the Americans out of there — and the Iranians wanted the same thing,” Haykel said. “I don’t think there was a deal to be had — not one in which the Americans would have had immunity.”", "Clinton, Obama’s secretary of state at the time, publicly supported the president. In a 2014 interview, she blamed the Iraqi government for the failure to reach an agreement to protect American troops. The Washington Post‘s Joby Warrick, author of the Pulitzer Prize-winning book “Black Flags: The Rise of ISIS,” said in an interview with the Post‘s Fact Checker that “[w]ithin the administration, Clinton was one of the loudest forces for keeping a residual force in Iraq.”", "So, both presidents played a role in the withdrawal of troops from Iraq. ISIS did experience a resurgence after that withdrawal, but Watts doesn’t see the withdrawal as a major factor. “ISIS didn’t grow because of the troop withdrawal, they grew because there was a Syrian civil war that created a vacuum to the west,” he told us. If the U.S. had left troops in Iraq, the “best outcome” would be to still have an ISIS in Syria.", "And how did Trump feel about withdrawing from Iraq at the time? He said several times that the troops should be withdrawn, and quickly. BuzzFeed unearthed several quotes from Trump, including a March 16, 2007, interview Trump gave with CNN’s Wolf Blitzer.", "Trump, March 16, 2007, on CNN: You know how they get out? They get out. That’s how they get out. Declare victory and leave, because I’ll tell you, this country is just going to get further bogged down. They’re in a civil war over there, Wolf. There’s nothing that we’re going to be able to do with a civil war. They are in a major civil war. …", "And it’s going to go to Iran, and it’s going to go to other countries. They are in the midst of a major civil war. And there’s nothing — by the way, we’re keeping the lid on a little bit but date we leave anyway it’s all going to blow up. … So, I mean, this is a total catastrophe and you might as well get out now, because you just are wasting time.", "Trump doesn’t appear to be advocating a residual force in those comments, but he’s unclear. Regardless, the withdrawal of troops, no matter when or how it happened, wasn’t the “founding of ISIS.” Nor was President Obama the “founder.” The terrorist group’s history predates Obama’s presidency.", "Update, Aug. 12: After repeating his claim multiple times on Aug. 11 — in interviews in which he was pressed on what he meant by the “founded ISIS” comment — Trump tweeted on Aug. 12 that his claim was “sarcasm.”", "https://www.sharethefacts.co/share/dfbd9aff-74f2-411b-9226-7d5c75adf83b", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]