["The 45-second video was published here on Facebook on February 14, 2019. It has been viewed more than 84,000 times and shared more than 1,700 times.", "The post's Indonesian-language caption translates to English as: “A Man In England Who Hates Islam Broke Mosque Windows, But Allah Directly Punished Him. Watch The Video Until the End.”", "The Indonesian-language text superimposed in the video is the same as the caption.", "Below is the screenshot of the misleading post:", "The same video has been shared on Facebook since 2017 here, here and here, where it has been viewed more than 40,000 times.", "The claim is false; the video has previously circulated in reports about a man who broke windows of a shop in Lubliniec, Poland, in September 2017.", "A Google reverse image followed by a keyword search found this 52-second high-definition video published on YouTube on September 23, 2017, by video agency ViralHog. The title reads: “After Multiple Incidents Vandal Receives Karmic Retribution || ViralHog”.", "The video's caption reads: “Occurred on September 21, 2017 / Lubliniec, Slask, Poland.", "“Info from Licensor: \"The man in the video has broken the window of our shop twice. The first time was 2 weeks ago on September 9, 2017 and this week on Thursday he did it again. Another person called the police and after when the man decided to escape and a car hit him on the street. An ambulance transported him to the hospital with some minor injuries.\"", "There is a time stamp in the top right-hand corner of the video, which indicates the vandalism occurred on September 21, 2017, at about 2:01 pm local time.", "Lubliniec is a town in southern Poland.", "Below is a screenshot comparison of the video in the misleading post (L) and the ViralHog video (R):", "Polish media Fakt24 and Wirtualna Polska published a report about the incident on September 25, 2017, here and here, saying it happened on September 21, 2017, and the vandal was a 27-year-old man from Lubliniec.", "The location of the vandalism corresponds with this road in Lubliniec on Google Street View.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]