["The image was shared in this post on Twitter on August 2, 2020.", "It reads: \"Sad news. 193 pilot whales were mercilessly slaughtered in the Faroe Islands yesterday.", "\"This is the third hunt of the year cruelly killing a total of 498 pilot whales and white-sided dolphins.", "\"Help us #StopTheHunt by signing our petition here: https://change.org/p/stop-the-hunt-of-dolphins-and-small-whales.\"", "The photo was also published here on Facebook alongside three other photos in a Thai-language post on August 3, 2020. The post has been shared more than 200 times.", "The post’s Thai-language caption translates to English as: “#Moneypickcoconutsandyouaresoseriousbutwhenhundredsofwhalesarekilledyousaynothing", "“The first 193 whales have been mercilessly killed in the Faroe Islands last Friday (July 30). This is the third whale hunting of the year in which whales and white dolphins have been killed in this area in total 498 of them.", "“Grindadràp claimed that they did this for food but according to the data, Faroe Islands is not going through any famine. This tradition still remains although Denmark, which is the owner of the Faroe Islands and a member of the European Union, has implemented the law about animal protections and demanded other countries to follow them. #wedontdeservethisplanet”.", "The post includes a link to this article published by Info, a Faroe Island media site, on July 30, 2020. The article states that \"close to 200\" whales were killed by whalers in the Faroe Islands on July 30.", "Grindadràp is the harvesting and slaughter of long-finned pilot whales in the Faroe Islands. According to the International Organization for Animal Protection, up to 1,000 pilot whales are killed annually with the hunt primarily taking place in July and August.", "The post circulated in Thailand after People for Ethical Treatment of Animals (PETA) published a report in July 2020 condemning the forced use of monkeys during coconut harvests in Thailand.", "The same photos were also shared alongside a similar claim in Thai on Facebook here and here.", "The photos, however, have been shared in a misleading context. The first photo and the fourth photo, which are identical, have circulated in media reports about whaling in the Faroe Islands since 2018. The second and third photos have circulated in reports about separate whaling incidents in 2020.", "First photo", "A reverse Google image search found the first photo was published on the BBC Turkish’s website here on August 16, 2018.", "The Turkish-language headline translates to English as: “Whaling: the sea turns into a bloodbath in the Faroe Islands”.", "The photo also appeared in this report by Workpoint TV, a digital TV channel based in Thailand, on August 17, 2018.", "Below is a screenshot comparison of the first photo in the misleading post (L) and the 2018 photo published on Workpoint TV (R):", "Second and third photo", "Further reverse Google image searches found the second and third photos were published in reports about whale hunting in the Faroe Islands in July 2020.", "The second photo was published in this tweet by UK-based pressure group Blue Planet Society on July 31, 2020. The tweet reads: “Confirmed total of 193 pilot whales killed in the Faroe Islands on 30/07/2020.”", "Below is a screenshot comparison of the second photo in the misleading post (L) and the 2020 photo published on Twitter (R):", "The third photo was published here by Info, the Faroe Island media site, on July 30, 2020. The report’s Faroese-language headline translates to English as: “150 to 200 whales have laid their bones”.", "Below is a screenshot comparison of the third photo in the misleading post (L) and the Info’s 2020 photo (R):", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]