["About this rating", "\"Smart gals know what it takes to be confident around a masher,\" reads a vintage-looking magazine as making the social media rounds since mid-2017.", "What does it take to be confident, according to this print advertisement? A .38 caliber Colt Cobra snub-nose revolver — \"for that strange, depraved creep who won't leave you alone.\"", "Here's an example of the ad via Twitter:", "“For that strange depraved creep who won’t leave you alone” #advertisement pic.twitter.com/tnnTT5HFCH", "— PANTHERA ? (@Panthera156) March 28, 2018", "The copy goes on with its pitch as follows:", "Some lunkheads just won't go away. You change your schedule, you wear a hat, you even try the old false beard gag, but no, he's still there — breathing through his mouth, leering at your bosom with those droopy, lifeless fish eyes. Face it girls, there are times when subterfuge isn't enough — you may need to take fast action, FAST!", "That's why a girl couldn't find a finer new friend than the Colt Cobra .38 Snub Nose. You'll enjoy the modern styling as you draw it from your purse. You'll sense the velvet smoothness of the action as you cock the hammer. You'll appreciate the crispness of the trigger pull, designed with your long nails in mind, as you fire again and again.", "Although the overall appearance of the ad is convincing at first glance, the closer one looks the more preposterous its content reveals itself to be. The image is a parody of 1950s advertising, but a number of inconsistencies and anachronisms stand out.", "The magazine named in the lower righthand corner, for example — \"Ladies Life & Household,\" it's supposedly called — never existed (or if it did, every trace of it has been expunged from modern records).", "The handgun's finish is described as \"Colt's beautiful pacifier blue\" — an obvious satirical reference to 1950s gender role stereotypes (if Colt ever manufactured a \"pacifier blue\" firearm, no examples of it exist to be found today).", "The pistol shown in the illustration, allegedly a Colt Cobra .38 (the same kind of revolver Jack Ruby used to kill JFK assassin Lee Harvey Oswald in 1963), appears to be a different model altogether. The image matches up fairly closely to one we found in a mid-1970s ad for a Colt Detective Special (third series, introduced in 1973):", "And what about that leering creep? The face of the \"mouth-breathing lunkhead\" with \"droopy, lifeless fish eyes\" who serves as the villain of the tableau shows unmistakable signs of digital tampering. It isn't just the eyes that droop:", "From all of the above it makes sense to suppose that there was an existing scanned image, most likely of another vintage ad, that served as a template for the Colt Cobra parody. A reverse-image search provided instant confirmation that that is the case — the Colt Cobra ad is a reworking of a full-page advertisement for Gleem Toothpaste that appeared on page 110 of Life magazine on 11 February 1957:", "Image credit: SenseiAlan / Flickr", "Trask, Mike.   \"From Jack Ruby to Las Vegas: A Gun's Trajectory.\"\r\n    Las Vegas Sun.   11 March 2008.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]