["The two-minute, 15-second video was shared in this Facebook post on May 14, 2019, where it has been viewed around 1,900 times.", "The caption of the Facebook post states; “Gurdwara sahib in china”. A gurudwara, or a gurdwara, is a Sikh place of worship; here is a dictionary defintion.", "The words “Gurudwara Sahib in China” are overlaid on the video in green text.", "Below is a screenshot of the misleading post:", "A similar video showing the same structures, but without the green text overlay, has been shared elsewhere online alongside the same claim, for example here on Facebook and here on YouTube, where it has been viewed 11,000 times.", "This Twitter post, dated June 6, 2019, combines the same claim with a shorter 45-second version of the video, which has the green text and other animations overlaid on it.", "Other posts claim the video shows a Hindu temple, for example this one and this one – which has been viewed around 26 million times since it was published to Facebook on April 5, 2018.", "Both claims are false; the video does not show a temple or place of worship for Hindus or Sikhs. The video actually shows Buddhist and Taoist temples on different mountains in China.", "AFP conducted multiple reverse image searches and keyword searches for keyframes in the video.", "From the beginning of the clip to the 13 seconds mark, the video shows the Temple of the Buddha and Maitreya Temple on Mount Fanjing in China’s southwestern Guizhou province, located here on Google Maps.", "Mount Fanjing, or Fanjingshan, is a part of the Wuling mountain range in southwestern China’s Guizhou province and was named as a UNESCO World Heritage Site in 2018. It is considered a sacred site and is home to a number of Buddhist temples.", "The two temples that can be seen in the video are separated by a narrow gorge that visitors can cross via a short bridge.", "Below is a comparison of two screenshots from the first 13 seconds of the video (top) and a photo of the two temples on Mount Fanjing taken by Visual China Group, a China-based photo and media agency, and published in this CGTN article (bottom):", "From the 29 seconds mark to the 41 seconds mark, the video shows Old Goldentop on Mount Fanjingshan and the aerial view of the mountain in Guizhou provinceof China. It is part of the Fanjingshan Buddhist Culture Park.", "Below is a comparison of two screenshots from the misleading video (top) and this Google user image tagged at the location on Google Maps (bottom).", "From the 57 mark to the one minute 24 second mark, the video shows a glass footpath and Qianlong Temple in northwest China’s Shaanxi province, located here on Google Maps. The temple is located on the Shaohua Mountain, sacred among Taoists.", "Below is a comparison of a screenshot from the video (top) and a picture taken by Xinhua news agency in 2017, published here by the Global Times (bottom):", "From the one minute 25 seconds mark to the one minute 33 seconds mark, the video shows Xianglu Temple located in northeast of Jiaxian County, Yulin City in north Shaanxi Province of China. It is a Buddhist temple overlooking the Yellow River. Here is a page about the temple published by Chinese tour company China Highlights on April 18, 2011.", "Below is a screenshot comparison of the video (L) and an image taken by photographer Shara K Johnson (R) posted here:", "From the one minute 33 second mark to the one minute 39 seconds mark, the video shows the same temple from a different angle.", "Below is a screenshot of the video (L) and this photo of the Xianglu temple published by photo agency Alamy (R):", "From the one minute 40 second mark to the one minute 54 seconds mark, the video shows Sanxianshan scenic spot in Penglai, east China's Shandong Province. The site incorporates both Taoist features, including the Eight Immortals Crossing the Sea and Buddhist temples.", "Below is a screenshot comparison of the video (L) and a photo of Sanxianshan scenic spot published here by financial news site Xinhua Finance Agency on August 23, 2016 (R), with corresponding features circled in red:", "From the one minute 55 seconds mark until the end, the video shows the Bailong Elevator in Zhangjiajie in Hunan province of China; here it is on Google Maps.", "Standing at 326 metres (1,070 ft), it is also known as the “Hundred Dragons Elevator” and holds the Guinness World Record for the tallest outdoor elevator. It is not a religious site.", "Below is a comparison of two screenshots from the misleading video and the pictures of the elevator taken by China news published in this article by The Indian Express.", "AFP could not identify the glass walkway seen from the 42 second mark to the 56 second mark in the video. It did does not show a religious building.", "AFP could also not identify the building which appears from the 14 seconds mark to the 28 seconds mark in the video.", "However a keyword search found the only publicly registered Sikh temple in mainland China is this small one in a private residence in Shanghai. There is also this temple listed in the Special Administrative Region (SAR) of Hong Kong. Neither are located on mountains.", "Keyword searches failed to find any prominent Hindu temples in mainland China. Smaller Hindu temples are listed here, here and here in Hong Kong. None of them are situated on mountains.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]