["“Telangana election: SHOCKING Congress manifesto vows ‘Muslim-only schools, govt contracts’ – DETAILS” screamed the title of a news report published by Times Now on November 27, 2018. According to the report, the Congress party has promised seven ‘Muslim-only’ schemes to woo the minority community voter base ahead of the Telangana assembly elections. The report further stated, “The schemes are – free electricity to mosques and churches, special opportunities in government contracts for the Muslim youth, Rs 20 lakh aid to poor Muslim students, residential schools for Muslims, hospitals for minorities, special Urdu DSC (District Selection Committee) for minorities, and punishment to firms for hiring on the basis of religion.”", ".@Paul_Oommen takes us through the 7 ‘Muslim only’ schemes pledged by Congress in its Telangana manifesto #CongForMuslims pic.twitter.com/YWWxDuLF4H", "— TIMES NOW (@TimesNow) November 26, 2018", "Managing Editor of Times Now, Navika Kumar also did a show on the Congress’ manisfesto where she said, “Hospitals will be build for Muslims, schools will be build for Muslims. (translated)”", "It is a well-poised method by Congress, says Political Analyst @varnishant #CongForMuslimsTape pic.twitter.com/eNGepmHLim", "— TIMES NOW (@TimesNow) November 27, 2018", "Republic TV too reported on the same narrative that the manifesto of the Congress party has promised seven benefits exclusively for Muslims and other minority sections in Telangana. The headline of the report read, “Congress On Appeasement Overdrive In Telangana: ‘Muslim Only’ Schools & Hospitals, Free Power For Mosques Promised”.", "Republic TV editor-in-chief Arnab Goswami also reiterated the claim reported in the article by the channel.", "#MuslimOnlyCongress | If a community is socially and economically backward in the state, we can talk about their empowerment: Shakti Singh Yadav-Spokesperson, RJD pic.twitter.com/gXXcOUqQ2F", "— Republic (@republic) November 27, 2018", "Claim 1: Free power supply to mosques and churches", "Under the, ‘Religious sector’, it states that free power will be supplied to the temples, mosques and churches in the state. The reports published by the stated media organizations do not mention free power supply for temples and instead focused on the reference to mosques and churches.", "Claim 2: Honorarium to Imams only", "Talking about the honorarium, Republic TV anchor Arnab Goswami in his debate said, “Masjid ke jo Imam hain unko Rs. 6000 jyada milenge. Mandir ke priest ko nahi milega (Imam of mosque will be given extra Rs. 6000. Priest of temple won’t -translated)”", "The manifesto says, “Pujaris working in 643 temples will be given salaries on par with State Government staff. Pujaris and staff will also get accident insurance and health cards.”", "Moreover, it also states, “Honorarium will be given to Pastors and Fathers on par with Pujarais of Temple and Imams/Maozan of mosques.”", "Goswami’s claim was based on point stated under the minorities section which says, “All Imams and Maouzans of mosques will be given a monthly honorarium of Rs.6,000.”", "Claim 3: Scholarship for Muslims", "Republic TV and Times Now in their news reports, as well as Arnab Goswami in his debate have referred to the promise of Rs 20 lakh aid which will be given to the poor ‘Muslim’ (minority) student for ‘overseas education’. The coverage sought to represent this as a ‘Muslim only’ scheme whereas the manifesto states otherwise, with provisions for minorities, SC, ST, EBC and OBC students as well.", "Claim 4: Special consideration in Government contracts for Muslims", "Republic TV’s news report states, “the minority youth will be given special consideration in the government contracts.” However, the report has glossed over the promises made to the youth who participated in the Telangana movement, as also the pledge for 5 percent reservation in government contracts for SC, ST and other disadvantaged communities.", "Claim 5: ‘Muslim hospitals’", "In his debate, Goswami also claimed that Congress has promised ‘Muslim hospitals’ in Telangana and the report published by the news channel stated, “Hospitals exclusively for Muslims will be established”. The manifesto says, “Government Hospitals will be established in minority concentrated areas.” Nowhere, it says these hospitals are only for Muslims as claimed by several news media outlets. The news reports are inconsiderate of the several other schemes which refer to hospitals pledged to be constructed in each Mandal and assembly segment.", "Claim 6: Residential schools for Muslims", "The manifesto states, “Special Residential Schools will be established for girls belonging to minority community” but there are a slew of residential schools promised to other groups in the manifesto which have been overlooked, including provisions for visually challenged people and tribal communities.", "Claim 7: Action against religious discrimination", "According to the manifesto, “All kinds of discrimination on religious grounds in giving jobs in both public and private sectors will be stopped.” This provision of the manifesto has been painted as Muslim appeasement by Republic TV and Times Now, despite the fact that the language of the provision in the manifesto does not refer only to Muslims. “Strict action will be taken against those who refuse jobs in private sector to anyone on the basis of his/her religion”, the sentence itself mention no religion in specific but this was equated as Islam/Muslims because it was mentioned under the minorities section. Times Now reporter, Paul Oommen on air misconstrued the point by saying, “They will have to give employment on the basis of religion.”", "Claim 8: ₹5 lakh will be given to Muslims alone for construction of houses", "In the debate, Arnab Goswami said, “Ghar banane ke liye Hinduon ko, Sikhon ko ghar banane ke liye loan bhi nahin milega. Yeh sirf Musalmano ko milega (Hindus and Sikhs won’t even get loans for building homes, only Muslims will -translated)”.", "The manifesto states, “Eligible minorities will be given Rs. 5 lakh financial assistance for construction of own house.” Moreover, it also stated,  “For SC, ST families, Rs. 6 Lakh will be given for the construction of their own house.” The party has also pledged assistance of Rs 5 lakh to eligible people for construction of house on their own land. There are 22 lakh individuals eligible to get a housing unit as per the Intensive Household survey.", "Zee News also reported with the identical narrative depicting the manifesto as Muslim community-centric (at 2:32).", "#DNA: Non Stop News, November 27, 2018 pic.twitter.com/84NSg5cIAn", "— Zee News (@ZeeNews) November 27, 2018", "Moreover, the claims have also been echoed on social media. Bharat Positive, a Facebook page with a huge follower base has sourced the claims from Times Now.", "Rishi Bagree, who is followed by Prime Minister Narendra Modi on Twitter had also tweeted a video of the Times Now debate with an identical narrative.", "Congress manifesto is awesome in Telengana", "Free electricity for mosques Govt contract for Muslim youth Hospitals only for Muslims 20 lakh aid for Muslim youth Exclusive Muslim IT corridor Muslims To Get Soft Loans @ 4%", "Still Congress is secular party & BJP is a Communal party pic.twitter.com/vhQB5D6OZP", "— Rishi Bagree 🇮🇳 (@rishibagree) November 27, 2018", "BJP MP Shobha Karandlaje from Karanataka also tweeted an image presenting the identical seven points reported by Times Now.", "Telangana CONgress Unit in it’s election Manifesto promises several sops to voters on religious basis… Their pseudo commitment to secularism is completely exposed!!", "Divide and rule & communal politics hits it’s all time low !!#TelanganawithModi pic.twitter.com/BfKZBKe3d9", "— Shobha Karandlaje (@ShobhaBJP) November 27, 2018", "Telangana votes on December 7. With barely a few days left, the kind of reporting presented by Times Now and Republic TV has the potential to significantly shape public opinion in the run-up to voting day, apart from furthering inter-faith prejudice.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]