["This post was published on Facebook on March 13, 2020. It has been shared 351 times.", "The post features an image of the Israeli flag alongside an Urdu caption which translates to English as: “In all countries of the world there is presence of coronavirus and strategies are being devised to prevent it, but only in Israel, neither there is any patient of coronavirus, nor any activity is being seen to safeguard from it. So it will not be wrong to say that this virus is created by Israel and its cure is also with Israel. What is your opinion?”", "Below is a screenshot of the misleading Facebook post:", "COVID-19 was declared a pandemic by the WHO on March 12, 2020. It emerged in the central Chinese city of Wuhan in late 2019. It has since spread worldwide and as of March 16, the number of cases and deaths outside China has overtaken total cases in China, according to this WHO report.", "A similar claim was also shared in this Facebook post, and on Twitter here and here.", "The claim is false.", "According to reports by Israeli newspapers The Times of Israel and The Jerusalem Post published on March 16, 2020, Israel's Ministry of Health has 298 confirmed COVID-19 cases in the country.", "The first paragraph of The Times of Israel report reads: “The Health Ministry on Monday night said the number of COVID-19 cases in Israel has climbed to 298, as data shared by the authorities showed that one-quarter of those infected by the coronavirus showed no symptoms.”", "The Jerusalem Post article says the government has implemented additional measures to prevent further spread.", "It reads, in part: “The government imposed increasingly severe limits on both the public and private sector on Monday evening, as the number of confirmed cases of the novel coronavirus climbed to 298.", "“The public sector will operate according to an emergency framework, Prime Minister Benjamin Netanyahu said at a press conference, with all government and local authority workers placed on paid leave until the end of the Passover holiday, except for those deemed critical for continued operations. Private sector firms exceeding 10 employees will be required to reduce staff present in the workplace by 70%.”", "This dashboard on the WHO website, which provides daily updates on global COVID-19 numbers by country, also states 250 cases have been recorded in Israel as of March 16, 2020.", "Below is a screenshot of the map, with Israel’s figures highlighted yellow by AFP:", "The WHO has said there is currently no medicine that can prevent or treat COVID-19.", "The Q&A section of its website reads, in part: “To date, there is no vaccine and no specific antiviral medicine to prevent or treat COVID-2019… Possible vaccines and some specific drug treatments are under investigation. They are being tested through clinical trials. WHO is coordinating efforts to develop vaccines and medicines to prevent and treat COVID-19.”", "Below is a screenshot of the relevant section on the WHO website:", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]