["About this rating", "A number of disturbing visuals emerged after the arrest of accused pipe-bomber Cesar Sayoc, including photographic evidence of his attendance at pro-Trump rallies and images of the windows of his confiscated white van covered with stickers glorifying Trump and expressing animus toward Democrats and the media.", "Among them were depictions of Hillary Clinton and Barack Obama (both of whom were targeted by the bomber) in the crosshairs of a gun, and stickers saying \"Dishonest Media\" and \"CNN Sucks\" (CNN was also a target of the mailings).", "Conspiracy theorists were quick to cast doubt on the authenticity of the stickers as part of an effort to portray the mail bombings as a \"false flag\" attack perpetrated by \"left-wingers.\" Some asserted, without evidence, that the decal-covered white van was \"staged\" to promote a false narrative.", "Others compared photographs of the rear windows of the van from different sources and raised questions about the disparities they saw:", "I’m interested to hear an explanation as to how the stickers on the back of the van changed in the matter of an hour or so? pic.twitter.com/MUI0nFxHxz", "— Dave Holten (@Pscc8082) October 27, 2018", "The Van the mass media is showing miraculously changed stickers? pic.twitter.com/0eGvyEhUqz", "— basboon (@basboon007) October 27, 2018", "Anons on 8ch digging on the magically changing stickers in the back windows of Cesar Sayoc's van #qanon #magabomber #cesarsayoc #fakebombs #falseflag #redwave pic.twitter.com/rfPz6ev8yT", "— 3am ? (@3amart) October 26, 2018", "The underlying assumption in all these posts seemed to be that some of the stickers were replaced with different ones between the time FBI agents were photographed confiscating the van and when it was hauled away on a flatbed truck to an FBI facility.", "One hiccup in that scenario is the fact that the van was covered with a blue tarp before it was moved  — a tarp that is nowhere visible in the alleged \"after\" photo:", "Hauled away from the scene of the arrest of Cesar A. Sayoc Jr, a white van may provide insight into his political leanings. https://t.co/lOtsnLeWAJ", "— NYT National News (@NYTNational) October 26, 2018", "As the image below illustrates, the tarp was partially blown off by the wind during transport and reattached by FBI agents. The van was still secured to the transport vehicle. The sticker arrangements on the rear windows looked the same as they did in images captured when the van was being confiscated:", "FBI agents covering MAGAbomber Sayoc van after the tarp fell off as it was transported from Plantation on Friday pic.twitter.com/qXPxL7PYMU", "— Darlington Micah (@DarlingtonMicah) October 27, 2018", "In point of fact, the supposed \"after\" photo (below right) could not have been taken after the van was confiscated, because it clearly shows the vehicle on a roadway, sans tarp, moving under its own power:", "Although the sticker displays are clearly different in the two images, the explanation is not that they \"miraculously\" changed after the van was confiscated, but rather that the photograph on the right was taken at some point before Sayoc was found and arrested. He had rearranged the stickers himself in the interim.", "There was plenty of time to do so. The photograph on the right was taken by Twitter user \"Mo\" (@thereal_mo01) in April 2018. He shared it on 26 October, the day Sayoc was arrested:", "@CBSMiami I have some pictures of this van I saw him at a stoplight one day and thought is was very strange. pic.twitter.com/VWUwznJK8k", "— Mo (@thereal_mo01) October 26, 2018", "\"Mo\" wasn't the only Tampa resident who had noticed Sayoc's rolling propaganda machine prior to the pipe-bomb incidents and photographed it for posterity. David Cypkin snapped these pictures in December 2017 (as recorded in the images' metadata) and shared them on 26 October 2018:", "I took photos of this van in December on a morning walk with my dog. I was always unsettled that it was parked directly across from Sarah's Tent, a kosher market. It often had the back door ajar and/or window cracked open as if it was occupied. pic.twitter.com/QXsscOiWHv", "— David Cypkin (@DavidCypkin) October 26, 2018", "Confusion about the photographs was no doubt exacerbated by mainstream news outlets who used some of the older images in their reporting about Sayoc's arrest, but the notion that they revealed nefarious doings on anyone's part doesn't bear up under scrutiny.", "Bump, Philip.   \"The Mail-Bomb Suspect's Van, Annotated.\" \r\n    The Washington Post.   26 October 2018.", "Mikkelson, David.   \"Was Cesar Sayoc's Van 'Staged' as Part of a 'False Flag' Operation?\" \r\n    Snopes.   31 October 2018.", "Molloy, Tim.   \"Here Are Some Photos of Cesar Sayoc's Van.\" \r\n    The Wrap.   26 October 2018.", "Zapotosky, Matt et al.   \"Who Is Cesar Sayoc? What We Know About the Suspected Mail Bomber Arrested in Florida.\" \r\n    The Washington Post.   26 October 2018.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]