["An image of two lorries transporting coffins has been shared thousands of times in multiple Facebook posts which claim it shows preparations for Sri Lanka’s second wave of coronavirus cases in November 2020. The claim is misleading; the photo has been circulating online since at least March 2020.", "The photo was published in this Facebook post on October 26, 2020. It has been shared more than 5000 times.", "The Sinhala-language caption translates to English as:", "“Can you see how the preparations are being made? Be careful…”", "Sri Lanka’s coronavirus infections total rose close to 4,500 in October after an outbreak at a factory near the capital Colombo that makes masks for the US market, AFP reported here.", "The island nation’s death toll stands at the current death toll stands at 46 as of November 12, 2020.", "The majority of new cases were reported in the country’s western province.", "The same image was shared on Facebook here with a similar claim.", "The claim is misleading; the image has circulated online since at least March 2020.", "A reverse image search on Google found this Facebook post published on March 25, 2020.", "The Sinhala-language caption translates to English as: “Several lorries that were brought to some funeral parlours in Moratuwa this morning”", "Moratuwa is a coastal suburb of Colombo.", "A similar claim regarding the origin and context of the photo was published in this post.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]