["Multiple Facebook users have shared an image that they claim shows Democratic presidential nominee Joe Biden holding a young girl and biting her on the cheek.", "\"You’re still going to vote for him?\" text on one version of the photo asks. \"Ladies and gentlemen. Your democratic presidential candidate!!!\" another post says.", "But the man in this picture isn’t Biden.", "The image was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The photo is legitimate, but it was taken from a video of Mexican President Andrés Manuel López Obrador that he tweeted from his verified Twitter account on March 14.", "The clip shows López Obrador greeting a crowd and, at one point, holding, kissing and lightly biting the young girl’s cheek. The frame can be viewed around 25 seconds into the video.", "A la salida del hotel de Ometepec, saludé y atendí peticiones de la gente. Vamos a Xochistlahuaca. pic.twitter.com/oNrRGriI1T", "At the time, López Obrador was criticized for continuing to hold large rallies and meet with crowds, where he shook hands, exchanged hugs and kissed cheeks as the coronavirus started to ramp up in Mexico.", "Social media users shared a photo that they claim shows Joe Biden kissing and biting a young girl’s cheek.", "The photo is authentic, but it shows Mexico’s president, not Biden.", "We rate this False.", "Facebook post, Aug. 2, 2020", "Facebook post, Aug. 18, 2020", "Facebook post, April 9, 2020", "TinEye, Reverse image search, Aug. 21, 2020", "Twitter, Andres Manuel tweet, March 14, 2020", "Reuters, False claim: Image shows Joe Biden kissing young girl, April 21, 2020", "Associated Press,Photo does not show Biden kissing a girl’s cheek, April 30, 2020", "Associated Press, Mexico’s AMLO says he’ll end public events when time’s right, March 16, 2020", "AFP, Photo shows Mexico’s president, not Joe Biden, kissing child, April 13, 2020", "Check Your Fact ,FACT CHECK: DOES THIS PICTURE SHOW JOE BIDEN BITING A CHILD ON THE CHEEK?, April 30, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]