["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Illuminated by fading sunlight and aided by the beams of truck headlamps, Fredrick Brower, left, helps cut up a bowhead whale caught by Inupiaq subsistence hunters in Barrow, Alaska, on Oct. 7, 2014.", "In mid October, long-serving Rep. Don Young, R-Alaska, provoked a firestorm with a series of comments about suicide. It’s a significant issue in his home state: In recent years, Alaska has experienced suicide at roughly twice the national rate.", "The controversy began when Young spoke to more than 100 students and staff at Wasilla High School on Oct. 21, 2014, just days after a student at the school had committed suicide.", "Young, according to news reports, told an audience that suicide shows a lack of support from friends and family -- a claim that inspired an immediate negative response from some in the audience.", "\"A friend of the victim shouted to Young that a disease, depression, was at the root of suicide,\" the Alaska Dispatch News reported. \"Young bristled at the interruption and responded to the student with profanity.\"", "Later that day, Young’s office released a statement saying the congressman should \"have taken a much more sensitive approach.\" But Young doubled down in an event the next day, appearing before 100 people at a senior center.", "According a recording excerpted in the Dispatch News, Young told the group, \"When people had to work and had to provide and had to keep warm by putting participation in cutting wood and catching the fish and killing the animals, we didn’t have the suicide problem.\" Suicide, he added, comes from federal government largesse \"saying you are not worth anything but you are going to get something for nothing.\"", "We wondered: Is there proof that suicide in Alaska has been linked to receiving government payments?", "Before digging any deeper, we should note that Young’s office has since apologized for his comment.", "In a statement to PolitiFact on Oct. 23, Young’s office said he \"discussed what he believes are leading causes of youth suicide in our state, including the impact of drugs and alcohol, depression, a feeling of worthlessness, and a lack of support systems. Congressman Young did not mean to upset anyone with his well-intentioned message, and in light of the tragic events affecting the Wasilla High School community, he should have taken a much more sensitive approach. … Issues like suicide and domestic violence cannot be discussed in isolation or generalities. Each and every case is different, and should be addressed in that manner.\"", "Then, a day later, in a speech to the Alaska Federation of Natives Convention, Young \"shared his sincere and honest apology\" and said the suicide of a nephew \"may have caused me to mangle some of my statements.\"", "Still, since suicide is a significant problem in Alaska, we thought the substance of his original comment was worth a closer look.", "Explaining suicide in Alaska", "According to the state Department of Health and Social Services, the age-adjusted rate for suicide in Alaska between 2003 and 2010 was almost twice the national average. In 2010, suicide ranked as the sixth-leading cause of death in Alaska and the leading cause of death among persons aged 15–24 years.", "The main reason for Alaska’s high rate is the unusually high frequency of suicide among Alaska Natives -- that is, indigenous Alaskans. The suicide rate for rural Alaska Natives is three to four times higher than it is for Anglos, said Matthew D. Berman, an economist at the University of Alaska-Anchorage who has studied the issue.", "In a paper published earlier this year, Berman reported suicide data for Alaska Natives going back to 1950 (see chart below). The rate was basically flat from 1950 to the mid 1960s, then rose rapidly from the mid 1960s to the mid 1970s before falling again. The rate peaked in the late 1980s and has fallen slowly but consistently since then.", "One problem with the connection Young pointed to is that the creation of the state’s biggest source of \"largesse\" -- the annual dividends paid to all Alaska residents from the proceeds of natural-resource extraction -- doesn’t track with the ups and downs of Alaska Native suicide rates.", "The Alaska Permanent Fund, as the resource-extraction fund is known, began paying dividends to residents in 1982, usually between several hundred dollars and $2,000 in a given year. Yet the growth in Alaska Native suicide predated those dividends, and the suicide trend since creation of the fund has generally been downward.", "\"This is a classic case of offering a simple answer to a really complicated problem,\" Berman said. \"When I have visited rural Alaska, I see people hauling firewood, fishing, and hunting for food. The rural cash economy depends heavily on government, but state spending plays a bigger role than federal these days, and most of the income comes from employment.\"", "Moreover, researchers have found evidence that factors other than money tend to influence the rate of suicide in Alaska Native communities.", "Suicide tends to be lower among Alaska Natives who live in traditional ways, and among those who live in the larger, Anglo-dominant culture. Those who are are most susceptible to suicide are those who are firmly rooted in neither society, and perhaps transitioning between them.", "James Allen, a professor of psychology at the University of Minnesota, has found that older Alaska Natives, who tend to have a stronger connection to cultural traditions, are at lower risk of suicide. This tracks with data from other polar indigenous populations, such as the Sami people of Norway. Sami people who participate in the traditional pursuit of reindeer herding tend to have lower rates of suicide, according to Siv Kvernmo, a researcher at the University of Tromso.", "As for the second group with lower suicide rates -- Alaska Natives who have relocated from rural villages to urban centers -- Berman reports that suicide rates in small, rural communities are more than twice as high as those among urban Native residents. Indeed, he writes, that the post-1980s decline in suicide rates may stem from more Alaska Natives moving to urban areas. (Today, about 10 percent of the state’s population lives in small, rural, predominantly Alaska Native communities.)", "In other words, Berman writes, the data suggests that \"opportunities in the modern economy (higher median incomes) and a strong traditional presence (linguistically isolated households) offer some protection against young male suicide.\"", "\"Research suggests that it was local communities' loss of control over their communities and land that is more relevant to the rise in suicide, not welfare,\" Berman told PolitiFact.", "In other words, Alaska Native suicide is a much more complex subject than Young was letting on.", "Our ruling", "Young said that suicide comes from federal government largesse \"saying you are not worth anything but you are going to get something for nothing.\" Data suggests high suicide rates among Alaska Natives stem more from cultural changes, including the transition from rural, traditional practices to urban life. We rate the claim False.", "Alaska Dispatch News, \"Young rattles Wasilla High students with 'hurtful' remark about suicide,\" Oct. 21, 2014", "Alaska Dispatch News, \"Young stands behind Wasilla High School comments, adds government to suicide blame list,\" Oct. 22, 2014", "Alaska Dispatch News, \"Cultural ties may help prevent suicide, experts say,\" Aug. 20, 2014", "Office of Rep. Don Young, statement to PolitiFact, Oct. 23, 2014", "Office of Rep. Don Young, \"Congressman Young Expresses Sincere Apology for Pain Caused by Statements on Suicide,\" Oct. 24, 2014", "Matthew Berman, \"Suicide Among Young Alaska Native Men: Community Risk Factors and Alcohol Control\" (American Journal of Public Health), June 2014", "Alaska Department of Health and Social Services, \"Risk Factors for Suicide at the Community Level—Alaska, 2003–2011,\" Nov. 5, 2013", "Alaska Permanent Fund Corp., annual dividend payments, accessed Oct. 27, 2014", "Email interview with Matthew D. Berman, economist at the University of Alaska-Anchorage, Oct. 23, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]