["A video clip posted here on Facebook and shared more than 330 times shows uniformed men and women dancing, marching and chanting in the streets, singing in Chichewa “Let’s go and vote”.", "The video was posted to Facebook by online news site Nyasa Times an hour after a judgement nullifying the 2019 elections was handed down at 7.30 pm,  with a caption that read: “Malawi fresh elections ordered and celebrated.”", "Similar versions of the post here and here were shared numerous times in the days that followed while the video was also circulating on WhatsApp the next morning.", "The claim fails for two reasons: the video was already online almost nine months ago and the dancing troops purportedly celebrating the court ruling are not soldiers but police.", "Adding to the weight of evidence against the claim is the fact that the judgement went on well into the night, according to AFP’s Malawi correspondent, who attended proceedings until the end  -- yet the video is clearly shot in broad daylight before the ruling could have been concluded.", "Retired army brigadier and Malawi security expert, Marcel Chirwa, told AFP the people in the footage were members of the police force.", "“I know that these are Malawi police judging from the uniforms. You can see as well that the vehicles they are using were bought second-hand from South African police,” said Chirwa.", "Police spokesman James Kadadzera further confirmed the officers belong to a section known as the Police Mobile Force (PMF).", "The video was recorded outside a PMF base in the capital city Lilongwe, on the corner of Kamuzu Procession Road and Lubani Road.", "The smaller circle in the map above shows the location of the PMF base. Inside the larger circle are two rectangular structures known as the Kalaria Building, named after the businessman who owns them.", "Although the footage is very grainy, there are similarities to prove it is the Kalaria Building visible in the background of the video:", "Crucially, the video appears in multiple Facebook posts on May 20, 2019, a day before the election. The post was copied and pasted from this article from the same day.", "Malawi opposition supporters celebrated overnight after the constitutional court set aside the 2019 election results, finding there were widespread irregularities,  as reported by AFP.", "AFP TV captured some of those celebrations the next day, as seen below.", "The court ordered a fresh election within 150 days -- as well as an investigation into the conduct of the electoral commission.", "However, the Malawi Electoral Commission (MEC) said organising an election would require more time -- at least 261 days -- suggesting October 28 for the new polls.", "Malawi's President Peter Mutharika filed an appeal on February 7, accusing the court of bias against him, documents showed.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]