["By Eugene Kiely", "Posted on January 21, 2020", "Democratic Rep. Jerry Nadler went too far when he claimed that President Donald Trump “worked with the Russians to try to rig the 2016 election.” The special counsel investigation found there were “multiple contacts … between Trump Campaign officials and individuals with ties to the Russian government,” but it “did not establish … coordination” between the two.", "Nadler, the chairman of the House Judiciary Committee, made his remarks on CBS’ “Face the Nation” while discussing the Senate impeachment trial. Margaret Brennan, the host, asked Nadler about the White House legal team’s response to the articles of impeachment.", "The impeachment trial deals with a different set of allegations against Trump, stemming from the president’s attempts to pressure Ukrainian President Volodymyr Zelensky to investigate former Vice President Joe Biden and his son, Hunter, and to look into CrowdStrike, a cybersecurity firm the Democratic National Committee hired after its server was hacked during the 2016 election.", "Nadler, Jan. 19: The GAO, the General Accountability Office, just came out this week and pointed out that withholding money from– from Ukraine that Congress had appropriated is against the law. But we didn’t need them to tell us that. And the reason he did that was in order to extort a foreign government to — to — to smear his political opponents for his personal benefits and to help try to rig the 2020 election as he worked with the Russians to try to rig the 2016 election. Same pattern.", "Special counsel Robert Mueller’s investigation “did not establish that the Campaign coordinated or conspired with the Russian government in its election-interference activities,” according to a redacted report released on April 18, 2019.", "Nadler’s spokseman, Daniel Schwarz, told us in an email that Mueller’s report found evidence that the Trump campaign attempted to “solicit help from the Russians.”", "“Mueller did not criminally charge, but he did not in fact find that there was no attempt to collect information or solicit help from the Russians,” Schwarz said. “In fact, that is exactly what was found.”", "That’s true, but that’s not what Nadler said.", "As the Mueller report says, there were “multiple contacts … between Trump Campaign officials and individuals with ties to the Russian government.” For instance, Donald Trump Jr. received an email on June 3, 2016, promising information from the Russian government that would damage Democratic presidential nominee Hillary Clinton and her campaign. The email was sent by music publicist Rob Goldstone at the direction of Russian pop star Emin Agalarov and on behalf of Agalarov’s father, Aras, a Russian real estate developer.", "“Emin just called and asked me to contact you with something very interesting,” Goldstone wrote to Trump’s eldest son. “The Crown prosecutor of Russia met with his father Aras this morning and in their meeting offered to provide the Trump campaign with some official documents and information that would incriminate Hillary and her dealings with Russia and would be very useful to your father. This is obviously very high level and sensitive information but is part of Russia and its government’s support for Mr. Trump — helped along by Aras and Emin.”", "Trump Jr. responded, “[I]f it’s what you say I love it especially later in the summer.” Six days later, he attended a meeting arranged by Goldstone with Natalia Veselnitskaya, who the Mueller report said “had previously worked for the Russian government and maintained a relationship with that government throughout this period of time.” Trump campaign chairman Paul Manafort and senior adviser Jared Kushner also attended the June 9, 2016, meeting. But the investigation found it lasted just 20 minutes, and there is no proof that anything came of it.", "“[T]he Campaign anticipated receiving information from Russia that could assist candidate Trump’s electoral prospects, but the Russian lawyer’s presentation did not provide such information,” the Mueller report said.", "It’s also true, as the Mueller report says, that the Trump campaign took political advantage of emails and other documents stolen by the Russian government hackers and released by WikiLeaks that were damaging to Clinton’s campaign. In the final weeks of his campaign, Trump repeatedly read from the documents released by WikiLeaks and, as we wrote, often distorted the facts.", "As they would later disclose, Trump Jr. made direct contact with WikiLeaks’ Twitter account and Trump confidant Roger Stone exchanged Twitter messages with Guccifer 2.0, which the Mueller report describes as one of two “online personas” used by Russian military intelligence to release hacked emails to media outlets and WikiLeaks.", "According to the Mueller report, “The release of the documents was designed and timed to interfere with the 2016 U.S. presidential election and undermine the Clinton Campaign.”", "Trump himself at a July 27, 2016, press conference invited Russia to find tens of thousands of Clinton’s personal emails that had been deleted. “Russia, if you’re listening, I hope you’re able to find the 30,000 emails that are missing,” Trump said. Within five hours of that statement, Russian intelligence officers “targeted for the first time Clinton’s personal office,” the Mueller report said.", "But, again, the investigation did not establish that Trump or anyone affiliated with his campaign was involved in the hacking or coordinated the release of the hacked materials with the Russian government.", "“The Office investigated several other events that have been publicly reported to involve potential Russia-related contacts,” the Mueller report said. “For example, the investigation established that interactions between Russian Ambassador [Sergey] Kislyak and Trump Campaign officials both at the candidate’s April 2016 foreign policy speech in Washington, D.C., and during the week of the Republican National Convention were brief, public, and non-substantive. And the investigation did not establish that one Campaign official’s efforts to dilute a portion of the Republican Party platform on providing assistance to Ukraine were undertaken at the behest of candidate Trump or Russia. The investigation also did not establish that a meeting between Kislyak and [Trump campaign surrogate and Sen. Jeff] Sessions in September 2016 at Sessions’s Senate office included any more than a passing mention of the presidential campaign.”", "(We covered examples of contacts between the Trump campaign and Russian operatives in our April 18, 2019, story “What the Mueller Report Says About Russian Contacts.”)", "Nadler’s spokesman has a point that the Trump campaign made the “attempt to collect information or solicit help from the Russians.” That’s clear from the Mueller report, which says just because “the investigation did not establish particular facts does not mean there was no evidence of those facts.”", "But, in the end, the special counsel’s office summarized its findings on the coordination this way: “In sum, the investigation established multiple links between Trump Campaign officials and individuals tied to the Russian government. Those links included Russia offers of assistance to the Campaign. In some instances, the Campaign was receptive to the offer, while in other instances the Campaign officials shied away. Ultimately, the investigation did not establish that the Campaign coordinated or conspired with the Russian government in its election-interference activities.”", "That said, Nadler went too far when he stated as fact that Trump “worked with the Russians to try to rig the 2016 election.”", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]