["About this rating", "A 2014 paper in Pediatrics noted that a small number of children (six) exhibited an allergic reaction to methylisothiazolinone, and patients with that allergy should avoid products containing the preservative.", "The paper did not say that \"no one\" should use baby wipes under \"any circumstance.\"", "On 25 October 2016, HealthEternally.com published an article that asserted baby wipes posed an extreme risk to delicate skin, thanks to a preservative called methylisothiazolinone. The page advised parents to switch to \"DIY wipes\":", "Baby wipes are a necessity for parents, as they come in handy when you need a quick cleaner-upper. They're convenient to take on the go - not only for diaper messes, but also for sticky hands, faces, and even toys. Up to this point, we always assumed they were completely safe to use, until now ... According to NBC News, a study has surfaced that confirms baby wipes are not safe to use on your children due to one key ingredient. The results of the tests conducted were worrisome, as children ended up having a reaction that left them with itchy, scaly, and red-rashed looking skin.", "Methylisothiazolinone has been found in many of the popular brands such as Johnson & Johnson, Cottonelle, and Huggies to name a few. Now that this chemical is becoming a health and safety concern for children, they are reconsidering adding this ingredient to their products. Their goal now it to try and replace this harmful chemical with a more natural alternative.", "The article appeared to be based on a study published in the medical journal Pediatrics,  but bore little resemblance to the toxic baby wipes warning. That article (\"Six Children with Allergic Contact Dermatitis to Methylisothiazolinone in Wet Wipes\") dealt with allergies and sensitivities, and did not recommend discontinuing wet wipes across the board:", "Wet wipes are increasingly marketed in personal care products for all ages, and MI exposure and sensitization will likely increase. Dermatitis of the perianal, buttock, facial, and hand areas with a history of wet wipe use should raise suspicion of ACD to MI and prompt appropriate patch testing. Rapid resolution occurs after the allergen exposure is eliminated. All isothiozolinones should be avoided in personal care and household products for these patients.", "The Pediatrics piece at no point advised parents to \"never clean\" children with baby wipes \"no matter what,\" nor was methylisothiazolinone pinpointed as a risk to anyone not allergic to the preservative.", "That study was published in 2014, and it appears that makers of baby wipes quickly responded to the findings despite the small number of children affected. For example, in response to a concerned parent on Facebook, Huggies stated in October 2016:", "Hi Ashley - Nothing is more important than the health and safety of the families who use our products. We evaluated alternative preservative options perfect for babies with allergic sensitivity to MI preservatives and we're pleased to say that all of our baby wipes transitioned to our MI-free formula in 2014.", "A \"Frequently Asked Questions\" page on the web site of Pampers (another major manufacturer of baby wipes) similarly affirmed:", "Q: Do Pampers Baby wipes or diapers contain the ingredients methylisothiazolinone or methylchloroisothiazolinone (also known as Neolone, Kathon, MI, MCI)?", "A: N72.95.151.27o. Pampers Baby Wipes and diapers do not contain methylisothiazolinone or methylchloroisothiazolinone.", "It is also worth noting that the ingredient served as a preservative, inhibiting the growth of dangerous molds and bacteria in baby wipes. The advice to make or use \"DIY wipes\" potentially caused a greater risk to anyone using wet wipes, as there was no way to control for the introduction of unsanitary contaminants, and even commercially produced preservative-free personal care products were known to be susceptible to contamination.", "Carroll, Linda.   \"Baby Wipes Causing Itchy, Scaly Rashes in Some Babies.\"\r\n    NBC News.   13 January 2014.", "Chang, Mary Wu and Radhika Nakrani.   \"Six Children with Allergic Contact Dermatitis to Methylisothiazolinone in Wet Wipes (Baby Wipes).\"\r\n    Pediatrics.   February 2014.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]