["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "During a Republican debate in Dearborn, Mich., on Oct. 9, 2007, Fred Thompson was asked to explain his previous comments about whether Saddam Hussein had weapons of mass destruction. He replied that Saddam had used them against the Kurds and had nuclear reactors in the early 1980s. Thompson added, \"The Iraq Study Group reported that (Saddam) had designs on reviving his nuclear program, which he had started once upon a time.\"", "The Iraq Study Group was a bipartisan panel created by Congress to recommend a better U.S. strategy in Iraq. The panel was headed by former Secretary of State James A. Baker III and Lee Hamilton, a former member of Congress who chaired the House Foreign Affairs Committee.", "In December 2006, the group released its report,\n\nThe Way Forward: A New Approach,\n\nwhich recommended a new U.S. strategy. The 142-page report focused on the future of Iraq and did not address whether Saddam wanted to restart a nuclear program. So we find Thompson's claim to be False.", "It's possible that Thompson was referring to the Iraq Survey Group, a CIA panel that was formed to investigate whether there were weapons of mass destruction or the intent to produce WMDs in Saddam Hussein's Iraq. The report found that Saddam did not produce or possess any weapons of mass destruction for more than a decade before the U.S.-led invasion, but that he \"aspired to develop a nuclear capability — in an incremental fashion, irrespective of international pressure and the resulting economic risks.\"", "Iraq Study Group", "Iraq Survey Group,\n\nFinal Report,\n\nSept. 30, 2004", "Iraq Survey Group\n\non Nuclear Weapons Program", "Iraq Survey Group\n\non Hussein's intent", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]