["Screenshots of the story were posted to Facebook here and here on March 10, 2021, and have been shared hundreds of times.", "“UJ student Phindile hacked the system & gave herself distinctions,” reads the first line of the screenshot, adding in the next that she had also helped 200 other students graduate.", "“UJ” refers to the University of Johannesburg, one of South Africa’s largest higher education institutions.", "The article explains that the student, named only as Phindile, purportedly accessed the “IT panels” on the university’s website and modified her results to reflect two distinctions on modules she had previously failed.", "She did this, according to the article, because her bursary “ditched” her and her parents were unable to afford the fees.", "“What a lady,” reads the caption on one of the Facebook posts which shared the claim, while the other described it as “leadership”.", "We traced the article to its earliest version and found that it was first published on March 5, 2020, by Ihlaya News, a South African parody website that has been the source of several viral stories fact-checked by AFP. The Afrikaans word “Ihlaya” translates into English as “joke”, while the Afrikaans tagline means “news parody you like”.", "The fabricated story went viral about one year ago, prompting the university to tweet a statement dismissing it as “misinformation being peddled as legitimate news”.", "#UJ has noted a report peddling misinformation disguised as legitimate news. The report, which was published on a news satire/parody site, is FALSE! Sadly, many readers have been misled to believe that it is real news. It is FAKE news! #phindile", "The story has resurfaced during deadly protests at the university and other institutions, in which demonstrators have called for students with outstanding debt to be allowed to register for the 2021 academic year.", "Multiple posts and blog website Opera News recently shared the satirical story without carrying any disclaimers, allowing users to believe it was genuine news.", "AFP Fact Check previously debunked an article that appeared on Opera News claiming very few of South Africa's Grade 12 students had passed their final exams in 2020.", "You can read more AFP fact checks that originated on the site here and here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]