["About this rating", "Voting in the 2020 U.S. Election may be over, but the misinformation keeps on ticking. Never stop fact-checking. Follow our post-election coverage here.", "One of the many conspiracy theories surrounding the 2020 U.S. presidential election circulated on social media after Election Day was a video purporting to show an elections worker in Delaware County, Pennsylvania, actually marking ballots rather than counting completed ballots:", "However, this video, taken from a livestream of the ballot counting facility, showed nothing untoward taking place. Rather, it was manipulated and presented without context to make it seem as if it captured something nefarious (and illegal) were occurring.", "As The Philadelphia Inquirer reported, what the video depicted was a ballot counter transcribing damaged ballots so that they could be fed into the scanning machinery and recorded properly:", "The [ballot] counter depicted in the video snippet was being observed by poll watchers from both political parties, according to county spokeswoman Adrienne Marofsky, who added that those watchers aren’t shown in-frame because of the way the video has been manipulated.", "In the video, the female ballot counter is transcribing ballots that had been damaged, and were unable to be fed into the counting machines, she said. A small number of the ballots the county received were in that condition, and had to have their information copied onto a blank ballot so the vote could be counted properly.", "County officials, in a statement, said that the manufacturer of the machine scanning ballots, Hart, directs ballot counters to follow this procedure for damaged ballots.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]