["About this rating", "In August 2020, Taco Bell announced future plans to open \"Taco Bell Go Mobile\" locations that would focus on smaller restaurants, two drive-thru lanes, a \"smart kitchen\" that's synchronized with the Taco Bell mobile app, curbside pick-up, and bellhops for tablet ordering.", "However, the plans had already been in the works for three or four years, and were not specifically created because of the COVID-19 pandemic. Further, a headline from nearly four months after the plans were made public claimed that Taco Bell had \"just\" made the announcement.", "Whether the changes would be considered \"major,\" or \"unreal.\"", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "On Dec. 7, 2020, the SheFinds.com website published a new story about Taco Bell during the COVID-19 pandemic that read \"Taco Bell Just Announced MAJOR Changes To Its Restaurants For COVID--It's Unreal!\"", "SheFinds.com", "This was similar to a previous story about McDonald's, also published by SheFinds.com. We reported on that article, as well as another misleading piece that claimed Wendy's purportedly made a \"heartbreaking\" announcement.", "As for the Taco Bell story, it purported to detail \"major\" and \"unreal\" upcoming changes:", "Taco Bell Just Announced MAJOR Changes To Its Restaurants For COVID–It’s Unreal!", "Taco Bell is joining restaurants like Chipotle, McDonald's and Burger King in completely overhauling their dining experience for COVID!", "The company announced in August that it would be launching a \"Taco Bell Go Mobile\" restaurant concept in Q1 of 2021. The new format has been in the works for a few years, but was accelerated due to the pandemic, according to a rep.", "\"I think the COVID environment has just accelerated those customer insights and needs,\" president and global chief operating officer Mike Grams told Nation’s Restaurant News at the time of the release. \"It's really clear what the consumer wants from us.\"", "This was mostly true. However, it was slightly misleading for the headline to claim that Taco Bell \"just\" made the announcement. The news story was published nearly four months after the company announced its \"Taco Bell Go Mobile\" plans.", "While \"major\" and \"unreal\" were subjective terms, it was also somewhat misleading for the headline to claim that the changes were \"for COVID.\" According to an interview with Nation's Restaurant News, the \"Taco Bell Go Mobile\" experience had already been in the works for three or four years. The story included this interview, but the sensational headline perhaps read as if Taco Bell devised the plans because of the COVID-19 pandemic.", "\"Taco Bell Go Mobile\" concept art. (Courtesy: Taco Bell)", "In August 2020, it was announced on the Taco Bell website that its \"Go Mobile\" restaurant would first open in Q1 of 2021. Each of the new locations would feature smaller restaurant buildings, two drive-thru lanes, a \"smart kitchen\" that's \"integrated with the Taco Bell app,\" curbside pick-up, and bellhops with tablets for ordering.", "\"Taco Bell Go Mobile\" concept art. (Courtesy: Taco Bell)", "The \"dual drive-thru\" experience was described in the news release: \"The new concepts will have two drive-thru lanes including a new priority pick-up lane with rapid service for customers who order via the Taco Bell app. This new lane will supplement the existing, traditional lane.\"", "Previously covered under the Taco Bell name were fact checks about \"Grade D but edible\" meat, TikTok videos that purportedly showed how its refried beans are prepared, and the disappearance of menu items like the Mexican Pizza.", "Jordan Liles is a Senior Reporter who has been with Snopes since 2016.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]