["A video of a sniper supposedly shooting at terrorist targets is being shared with the claim that US forces eliminated Islamic terrorists from a two-kilometre distance. “अमेरिकन सैनिको ने 2 किलोमीटर की दूरी से उड़ाए इस्लामिक जिहादियो के सर मज़ेदार वीडियो देखें (Watch this fun video where American soldiers shot at the head of Islamic Jihadis from a two-kilometre distance -translated)”, reads the message posted along with the video tweeted by one Arvind Tank.", "अमेरिकन सैनिको ने 2 किलोमीटर की दूरी से उड़ाए इस्लामिक जिहादियो के सर मज़ेदार वीडियो देखें 🚩🚩🚩👇👇 pic.twitter.com/3kkDpYlxAT", "— अरविन्द टाँक 💯% फ़ॉलोबेक़ (@tankarvind) November 1, 2019", "Many other people on Facebook and Twitter shared the video. Posting the same message, Facebook user Pramila Tamrakar shared another version of the same clip.", "अमेरिकन सैनिको ने 2 किलोमीटर की दूरी से उड़ाए इस्लामिक जिहादियो के सर मज़ेदार वीडियो देखें 🚩🚩🚩👇👇👇", "Posted by Pramila Tamrakar on Friday, 1 November 2019", "The video is circulating on Twitter with identical claim at least since July 2018.", "अमेरिकन सैनिको ने 2 किलोमीटर की दूरी से उड़ाए इस्लामिक जिहादियो के सर मज़ेदार वीडियो pic.twitter.com/fsYSJ0oMeE", "— Dr Yudhyavir Singh (@yudhyavir) July 3, 2018", "A cursory look at the video suggested that it could be from a video game. At 29 seconds in the viral video, one can spot the instructions that pop-up in the sniper’s view that read, “Hunt and Kill camped enemies”.", "Furthermore, at 66 seconds in the video, we get one more confirmation that the video pertains to a game as the pop-message refers to keyboard key (W, S) to zoom in and out.", "With a keyword search on YouTube, Alt News was able to find a longer version of the same gameplay footage. It pertains to a walkthrough of “Mission 7 – Friends from Afar” of the game ‘Medal of Honor’ released in 2010. It’s owned by Electronic Arts (EA), a global leader in digital interactive entertainment.", "In conclusion, a video of gameplay footage from ‘Medal of Honor’ was shared on social media by several netizens with the narrative that it depicts an operation undertaken by American soldiers where Islamic terrorists were brutally killed from afar.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]