["By Saranac Hale Spencer", "Posted on October 12, 2017", "Q: Did President Donald Trump revoke the National Football League’s status as a nonprofit organization?", "A: No. The NFL’s league office voluntarily gave up that status in 2015.", "Is this true?", "PRESIDENT TRUMP SIGNS EXECUTIVE ORDER STRIPPING NFL OF ‘NON-PROFIT’ STATUS", "President Donald Trump did not strip the National Football League of its nonprofit designation. The NFL’s league office actually gave up its tax-exempt status in 2015, according to filings made with the Internal Revenue Service.", "“As you know, the effects of the tax exempt status of the league office have been mischaracterized repeatedly in recent years,” said Roger Goodell, the NFL commissioner, in a memo announcing the change to team owners. “The fact is that the business of the NFL has never been tax exempt. Every dollar of income generated through television rights fees, licensing agreements, sponsorships, ticket sales, and other means is earned by the 32 clubs and is taxable there.”", "Rumors about the NFL have proliferated online since Sept. 23, when Trump called on team owners to fire any player who “disrespects our flag” by protesting racial injustice on the field during the national anthem. That weekend, more than 200 players demonstrated by kneeling, sitting or raising a fist during the national anthem.", "One of the latest rumors is that Trump countered by taking away the NFL’s status as a nonprofit organization. That claim was made in a story that has been published by more than half a dozen websites. Facebook users and our readers flagged it as potentially fabricated news.", "The story appears to have originated on freedumjunkshun.com, a site that publishes “satirical fiction.” It says that Trump signed an executive order on Oct. 8 that “‘temporarily’ revoked their 401(c)(3) status ‘until it is clear that players and team owners respect their country.’”", "But the president never signed such an order on Oct. 8 or any other day. (Don’t let the photo of Trump in the fake news story fool you. The image of Trump actually dates to January, when Trump signed an order to reduce federal regulations.)", "What’s more, 401(c)(3) is not a tax-exempt classification. There is a 501(c)(3) designation, but it is only for charitable organizations.", "The NFL’s league office — which is a separate legal entity from each of the NFL’s teams — had been classified as a 501(c)(6) organization until it dropped the designation in 2015. The classification affords tax exemptions to chambers of commerce, real-estate boards and professional football leagues, among others. Professional football leagues were added to that list of organizations in 1966, the IRS says, to allow the National and American Football Leagues to merge without violating antitrust laws.", "The league, in its 2015 IRS filing, described itself as a “trade association promoting interests of its 32 member clubs.” And as Goodell said in his memo, those teams, which account for most of the NFL’s revenue, are taxable entities.", "The league office now pays income taxes, but it’s not because of Trump.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to help identify and label viral fake news stories flagged by readers on the social media network.", "National Football League. IRS Form 990, 2015. Accessed 11 Oct 2017.", "Hale Spencer, Saranac. “Tackling Fake Football Stories.” FactCheck.org. 29 Sep 2017.", "Washington Post. “Trump’s full speech in support of Luther Strange in Alabama.” YouTube video. 26 Sep 2017.", "Stapleton, Arnie. “More than 200 NFL players sit or kneel during national anthem.” Chicago Tribune. 24 Sep 2017.", "“BREAKING: President Trump Signs Executive Order Stripping NFL Of ‘Non-Profit’ Status.” FreedumJunkshun.com. Accessed 11 Oct 2017.", "Executive Orders. WhiteHouse.gov. Accessed 11 Oct 2017.", "Exempt Organizations Business Master File Extracts. IRS.gov. Accessed 11 Oct 2017.", "Goodell, Roger. Memo to NFL teams owners. 28 Apr 2015.", "Frequently Asked Questions. NFLfoundation.org. Accessed 12 Oct 2017.", "Rascoe, Ayesha and Becker, Amanda. “Trump order targeting business rules leaves key regulations untouched.” Reuters. 30 Jan 2017.", "FactCheck.org Rating:", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]