["About this rating", "In February 2021, during U.S. Senate hearings on the confirmation of Merrick Garland as President Joe Biden's nominee for attorney general, a widely shared tweet purported to capture a startlingly frank exchange between Garland and Republican Sen. Tom Cotton of Arkansas.", "The tweet, posted by @Roshan_Rinaldi on Feb. 22, contained a link to a PBS live video of the hearing, along with the following text:", "Tom Cotton: \"Can you make a commitment on resources?\"\nGarland: \"I don't make commitments unless I know the facts first.\"\nCotton: \"When we confirmed Bill Barr, he was able to make a commitment on resources. Why can't you do that now?\"\nGarland: \"Because I'm not a liar\"", "The tweet, which has since been deleted, was widely shared on Twitter and its text contents tweeted out by several users in separate tweets. It was also shared on the popular left-wing forum Democratic Underground. On Facebook, users enthusiastically shared screenshots of it in the hours and days that followed. The following screenshot demonstrates the popularity of the post on Facebook in February 2021:", "In reality, Garland never called former Attorney General Bill Barr \"a liar.\" Nor did he describe him in a way that could fairly be summarized in that way. The tweet paraphrased a real line of questioning from Cotton but grossly misrepresented both the wording and tone of Garland's response.", "@Roshan_Rinaldi's tweet was particularly misleading because it not only misrepresented Garland's utterances in response to Cotton's questioning, but also used quotation marks, thereby presenting the exchange between Cotton and Garland as a direct quotation, which it certainly was not.", "During a confirmation hearing on Feb. 22, Garland, a U.S. Circuit Court judge on the U.S. Court of Appeals for the District of Columbia, faced questioning from Republican senators about the future of Special Counsel John Durham's investigation. In 2019, then-President Donald Trump asked Durham to investigate whether federal investigators engaged in wrongdoing or criminality during the early stages of investigations into possible collusion between the Trump campaign and Russian government actors during the 2016 presidential election. In 2020, Trump gave Durham the title and powers of a special counsel.", "In particular, Sen. Chuck Grassley of Iowa, and later Cotton, asked Garland whether he would commit to providing Durham the resources he required in order to complete his investigation. Garland demurred, and both Grassley and Cotton pointed out (accurately) that Barr, during his confirmation hearings in January 2019, was willing to make such a commitment to continuing and resourcing the work of Special Counsel Robert Mueller, who had been leading an investigation into possible collusion between Russia and Trump's 2016 campaign.", "In order to provide the full and proper account of what Garland actually said about Barr (or rather, did not say), the following are excerpted transcripts and videos of his exchanges with Grassley and then Cotton:", "Grassley: I'm going to go to the Durham investigation. At Barr's hearing, he stated the following [with] regard to Mueller's investigation: \"It's virtually [read: vitally] important that the special counsel be allowed to complete his investigation.\" Also, at that same hearing, Sen. Feinstein asked: \"Will you commit to providing Mr. Mueller with the resources, funds and time needed to complete his investigation?\" Attorney General Barr answered Sen. Feinstein with a one-word \"Yes.\" With respect to Special Counsel Durham's investigation, I expect that he will be allowed to complete his investigation. If confirmed, will you commit to providing Special Counsel Durham with the staff, resources, funds and time needed to thoroughly complete the investigation?", "Garland: Senator, I don't have any information about the investigation, as I sit here today. And another one of the very first things I'm going to have to do is speak with Mr. Durham, figure out how his investigation is going. I understand that he has been permitted to remain in his position, and sitting here today, I have no reason to think that that was not the correct decision.", "Grassley: Okay. And I suppose that would be an answer that [means] he would only be removed for cause, then? Would that be your position?", "Garland: Well, Senator, I really do have to have an opportunity to talk with him. I have not had that opportunity. As I said, I don't have any reason, from what I know now, which is really very little, to make any determination on that ground. But I don't have any reason to think that he should not remain in place.", "Later, Cotton followed up on Grassley's line of questioning, and the following exchange took place:", "Cotton: I want to return to Sen. Grassley's questions about the Durham investigation. Sen. Grassley asked you if you would commit, specifically, to ensure that John Durham had the staff, the resources and the time that he needed to complete that investigation. You said you didn't have the info yet, that you needed to speak to him, but you had no reason to think that him staying on was not the correct decision —", "Garland: That's correct, Sir, yes.", "Cotton: Why can't you commit, specifically, to saying that he will have the time, staff and resources he needs to complete his investigation?", "Garland: Well, again, it's because I'm sitting here and I don't have any information about what he needs, in his resources and the allocation of resources. But my — everything I know, sitting here, suggests that he should of course have those resources.", "Cotton: Judge, two years ago Bill Barr made that exact commitment about the Mueller special counsel [investigation]. He did not have that information, he had not consulted with the department. He was in the same posture you are. He simply said \"Yes.\" Why can't you say \"Yes\" today, the way Bill Barr did two years ago?", "Garland: Again, my view about every investigation and every decision I make is I have to know the facts before I can make those kind of decisions. I don't know what went into his consideration, but for myself, I have to be there and learn what's going on, before I can make a decision. But as I said, I have no reason to doubt that the decision to keep him in place, and to continue his investigation, was in any way wrong.", "Cotton: Was it wrong for Bill Barr to make that commitment two years ago?", "Garland: Again, as I said, Senator, I'm not going to be making judgements about my predecessors. I don't think there's any purpose in that for myself. I want you to judge me on my own record and what I do going forward.", "Cotton: Was it wrong for Democratic senators on this committee to repeatedly demand that Bill Barr make that commitment two years ago?", "Garland: I think my answer would be the same.", "As the videos and transcripts show, far from calling Barr \"a liar\" or saying words to that effect, Garland actually repeatedly refused openings to criticize Barr in any way. The wording presented in the viral tweet was inaccurate, and the underlying claim that Garland attacked Barr's honesty was a gross misrepresentation of what he actually said.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]