["About this rating", "A viral photograph supposedly showing a zeppelin airship flying above the Great Sphinx of Giza in Egypt is frequently circulated on social media:", "We have not been able to locate the original source of this image, but the story relayed in this tweet does reference an actual event that we could corroborate via news stories and genuine photographs.", "The image shown above likely depicts the LZ 127 Graf Zeppelin, an airship built in Germany in 1928. That dirigible's most famous flight occurred in 1929, when it circumnavigated the globe in 21 days, and this representation probably depicts a flight from a few years later when the airship traveled across the Middle East in April 1931.", "Karl Henry von Wiegand, a journalist who was aboard the Graf Zeppelin during its flight over Egypt, described the journey in an article published by the San Francisco Examiner in June 1931. In addition to documenting the airship's journey, von Wiegand's article is of note because it argued that airships were \"steadily convincing a hard-headed and skeptical world of the practicability and safety of dirigibles as an outstanding factor in long-distance air transportation.\" While this sentiment may have been true at the time, airship travel was all but grounded a few years later after the infamous Hindenberg disaster of 1937.", "We've transcribed a few relevant portions of that 1931 news article below:", "Sun, Jul 12, 1931 – 41 · The San Francisco Examiner (San Francisco, California) · Newspapers.com", "The appalling disaster to the British R-101 -- which I claim was avoidable and in the main due to three things: national pride, certain details of design and construction and inexperience in handling such ships -- has been used to renew, even intensify, skepticism and opposition to airships. Nevertheless, the Graf Zeppelin, in all probability the last of hydrogen-filled airships, has just demonstrated again the commercial practicability of dirigibles. With sixty-six persons on board, including twenty-five passengers and a quantity of mail, we flew from Friedrichshafen to Alexandria, Egypt in thirty hours and forty-five minutes.", "Southward into the teeth of a stiff wind we turned and flew over the Nile delta, probably the richest soil in teh world. Below us soon the Nile, like a ribbon, with scores of picturesque lateen-sailed feluccas. Sailing boats, donkeys, camels, motor-cars, railway trains, slow plodding natives - every mode of transportation was represented there.", "\"The Pyramids in sight!\" came a shout from the bridge. A rush to the windows. In the distance, silhouette-like against the sun, loomed the world's most ancient monuments. We circled them and the Sphinx and twice over the city of Cairo with the domes and needle-like minarets of the many mosques.", "The image popularized on social media might be a symbolic representation created by manipulating pictures after the fact rather than an actual photograph of the event, but even if so it's a reasonably accurate depiction. We located a number of real photographs showing the Graf Zeppelin over the pyramids in Egypt, along with one additional image of the airship specifically journeying over the Great Spinx of Giza.", "The following photograph, available via the Library of Congress and attributed to the Keystone View Company, shows three men watching the Graf Zeppelin as it approached the pyramids:", "Title: The Graf Zeppelin's rendezvous with the eternal desert and the more than 4,000 year old pyramids of Gizeh, Egypt", "Summary: Three men sitting on a hill near one of the great pyramids with desert in background and the Graf Zeppelin in the sky.", "The Giza Project at Harvard University has collected several additional photographs of the airship above the pyramids in Egypt, and a photograph showing an airship flying over the Sphinx of Giza is available via Getty Images:", "The German airship Zeppelin flies over the Sphinx and Giza pyramids, Egypt, from L'Illustrazione Italiana, year LVIII, n 19, May 10, 1931.", "Henry von Wiegand, Karl.   \"Zep Proving Worth of Dirigibles.\"\r\n    The San Francisco Examiner.   12 July 1931.", "Airships.net.   \"Graf Zeppelin History.\"\r\n    Retrieved 28 March 2019.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]