["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Mike Braun, Republican candidate for U.S. Senate in Indiana, speaks during a debate against Libertarian Lucy Brenton and Democratic Sen. Joe Donnelly on Oct. 8, 2018, in Westville, Ind.", "Incumbent Sen. Joe Donnelly painted himself as a guardian of health insurance and Republican opponent Mike Braun as its main threat during their first debate.", "\"I was the final vote to save health care,\" Donnelly said of his opposition to the so-called skinny repeal of the Affordable Care Act. \"At (Braun’s) company, the deductible on his health care if $10,000, which is completely unaffordable. He has every time tried to take away pre-existing conditions coverage and supports the lawsuit today that would do that.\"", "Braun did not respond to the attack in the debate, but in his rebuttal he said he \"took on health care\" and \"held premiums for 10 years while covering pre-existing conditions.\"", "We rated Mostly True an earlier claim from Donnelly that Braun supported ending coverage for pre-existing conditions. But when it comes to his business, Meyer Distributing, does Braun charge $10,000 deductibles?", "Meyer Distributing is an auto parts distribution company. According to Braun’s campaign, the company had 452 employees in Indiana as of April. The majority make between $10 and $17 an hour.", "The employee benefits enrollment guide from 2018 confirms family deductibles are $10,000, and $5,000 for individuals. The health plan is valid from March 1, 2018, to Feb. 28, 2019. We were unable to find any other health plans offered, and the Braun campaign did not respond to multiple requests for comment.", "Meyer offers a high-deductible health plan. That means that health care costs are absorbed by the employee until they reach that set limit (of $5,000 or $10,000). Doctor’s office visits, prescriptions and emergency room visits are not covered until then.", "Preventive care costs, on the other hand, are fully covered regardless of whether the deductible has been met. Those include annual preventive physicals and tests, routine prenatal care, immunizations, and screening services.", "The individual deductible roughly doubles national averages, according to a survey conducted by the Kaiser Family Foundation published on Oct. 3. The 2018 average for individuals was $2,349 and $4,676 for families. Meyer’s plan is still within the limits set by the Affordable Care Act, which caps out-of-pocket costs at $7,350 for an individual plan and $14,700 for a family.", "Karen Pollitz, a senior fellow at the Kaiser Family Foundation, said that on average, employers that offer such plans contribute more than $1,000 to employees’ health savings accounts. We found no indication in the guide whether Meyer contributes or not.", "Premiums at Meyer, however, were lower than the national average. That’s the money employees pay for health care coverage with each paycheck, if enrolled.", "Workers pay $34.30 biweekly in premiums for individuals, or $198.44 for the employee, spouse and children, which translates to $891.80 and $5,159.44 a year, respectively.", "The national average worker contribution to the premium is $1,074 for individuals and $4,631 for families.", "Braun said he has held premiums steady for 10 years. Individual premiums are lower at Meyer than the national average dating back to 2010. Average premiums have been increasing each year, so keeping premiums steady for 10 years would be unusual, according to Pollitz.", "\"Firms have been moderating premium increases by shifting more costs to workers in the form of deductibles,\" Pollitz said. \"That’s a good deal for the worker as long as they don’t get sick, hurt or pregnant.\"", "Donnelly said, \"At (Braun’s) company, the deductible on his health care is $10,000.\"", "The high-deductible health plan Braun offered full-time employees in 2018 had deductibles of $5,000 for individuals and $10,000 for families.", "We rate this statement Mostly True.", "C-SPAN, Indiana Senate Debate, Oct. 8, 2018", "Kaiser Family Foundation, 2018 Employer Health Benefits Survey, Oct. 3, 2018", "CNN, Health care takes center stage in midterms fight -- and Republicans are on the defensive, Sept. 26, 2018", "Politico, 'It was not real insurance', Oct. 5, 2018", "Email interview with Kate Oehl, campaign spokeswoman for Donnelly, Oct. 9, 2018", "Phone interview with Karen Pollitz, Kaiser Family Foundation senior fellow, Oct. 10, 2018", "Meyer 2018 employee benefits enrollment guide", "Healthcare.gov, Out of pocket maximum", "Healthcare.gov, Affordable coverage", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]