["About this rating", "On 21 April 2017, the web site HelloChristian published an report that claimed that a group of lions had fortuitously interrupted Islamic militants in the process of stoning Christian missionaries to death.", "Superficially, the claim looked like a typical fake news item, due to its subversion of a long-held belief that early Christians were \"thrown to the lions\" as capital punishment in early Rome. However, research suggests the trope is not an accurate reflection of history:", "The Romans were horrible, bloodthirsty people in many ways. But the treatment of Christians by the Roman imperial state was more complex than we might at first think. Persecution of Christians was carried out on the local level, and usually initiated by provincial mobs.", "Death – particularly by lions – was not an inevitable punishment, and not restricted to Christians. Universal edicts of persecution were only issued on specific occasions in the third and early fourth centuries A.D. They were a result of the emperors trying to reinforce traditional Roman religion in increasingly unsettled times.", "Nevertheless, HelloChristian reported:", "It is a remarkable story of God's intervening hand to save his people. Pastor Paul Ciniraj, director of Bibles for a Mideast, says that he and other Christians were rescued from the clutches of death by a group of three lions. Ciniraj and his group were under attack from Islamic militants when the giant cats attacked and scared the murderous group away.", "That outlet cited the web site WND, which in turn referenced a 17 April 2017 blog post published by Bibles4Mideast.com. The claim originated on that date and web site in a post titled \"Stoned by terrorists, protected by a lion!\":", "Last Sunday (April 16 [2017], Easter Sunday), we were in the midst of our worship service with Pastor Ayyoob leading. Suddenly, a group of militants reached the house, armed with steel bars and other weapons. We had no idea what to do ... Militants had found the house by noticing the people attempting to visit me secretly and coming for prayers.", "Losing all hope, we thought for sure this was our last day. The children with us started crying. We all joined hand in hands and repeatedly praised and thanked our risen Lord Jesus Christ. We also continually claimed the blood of Jesus Christ as our victory. The pregnant woman suffered pain, but joined in our praises to the Lord.", "O Lord Jesus! Praise His Holy Name. Completely unexpectedly, a lion ran from the forest, leapt towards the militants, and seized one by the neck. When other combatants tried to attack the lion, two other lions bounded towards them. The terrified militants fled the site, and the lions left us completely alone. Equally astonishing, records show no lions are supposed to live in that forest.", "A linked article referenced Bangladesh, presumably the site of the attacks. There is little dispute that lion numbers are on a steady decline. The vast majority of lions exist in Sub-Saharan Africa, with a minute proportion confined to a small area of India:", "We typically associate lions with Africa and with good reason. Of the roughly 20,000 lions left in the wild, almost all are found in Africa. With one notable exception: the Asiatic lions of the Gir forest.", "Up until the 17th century, Asiatic lions were found as far west as Palestine and throughout Arabia, Persia and Northern India. The spread of firearms and indiscriminate hunting led to their extinction in most of these areas. By the end of the 1800s only a small population remained in Junagadh province on India’s west coast.", "With such a small amount of detail, the claim that lions \"saved\" a group of Christian missionaries from stoning is difficult to verify. The writer of the original source material demurred when directly asked where the April 2017 incident took place, hinting that it happened in Bangladesh (where a zoo reportedly threw a wedding party for two lions in 2016, complete with a \"meat cake,\" in order to try to get them to mate). We found no evidence that any of it took place.", "Goode, Erica.   \"Lion Population In Africa Likely To Fall by Half, Study Finds.\"\r\n    New York Times.   27 October 2015.", "Malik, Shushma and Caillan Davenport.   \"Mythbusting Ancient Rome – Throwing Christians To The Lions.\"\r\n    The University of Queensland The University Of Queensland School of Historical and Philosophical Inquiry.   22 November 2016.", "Maule, Will.   \"A Group Of LIONS Save Christians From Execution By Islamic Militants, Says Pastor.\"\r\n    HelloChristian.   21 April 2017.", "Unruh, Bob.   \"Miracle? This Time, The Lions Save The Christians.\"\r\n    WND.   18 April 2017.", "PBS Nature.   \"India’s Wandering Lions Asiatic Lion Fact Sheet.\"\r\n    14 April 2016.", "Bibles4Mideast.com.   \"Stoned By Terrorists, Protected By A Lion!\"\r\n    17 April 2017.", "BosNewsLife.   \"Bangladesh Christian Couple Attacked Over Baptism.\"\r\n    31 March 2015.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]