["About this rating", "Despite their aloof demeanor, pet cats may be more socially bonded to their humans than the furry felines are given credit for.", "In October 2020, social media users on Twitter and TikTok shared images and videos of their cats sitting on a spare laptop in their attempt at “mirroring” their owner. The imagery created a buzz amongst cat lovers, who claimed that their kitties also sit on their laptops so that they can be closer to their owners.", "“So, I read on the internet that cats get on your laptop because they’re mirroring you, and so if you get them their own laptop they’ll leave you alone — and look at this businessman!”", "Snopes spoke with Kristyn Vitale, an expert in animal behavior and cognition at the Oregon State University Human-Animal Interaction Lab, who said that research cannot definitively say why cats are sitting on their owner’s laptop in an attempt to mimic their behavior. Even so, mirroring does seem to be within the cognitive abilities of cats, according to a study published in the journal Animal Cognition. So, while mirroring is a possibility, there is not enough evidence to prove that a cat is sitting on your laptop to be just like you.", "But the motivation to sit on a laptop may be different among cats.", "“Some cats may sit on the laptop to be closer to their owner, while other cats may sit on the laptop because it is warm or for some other reason,” said Vitale. “Every cat is an individual, so we cannot assume that all cats engage in this behavior for the same reason.”", "That being said, Vitale added that it does make sense that a cat would sit on a laptop as a “way to spend time near their owner and seek attention — basically, stop looking at that computer and pay attention to me!”", "Despite their antisocial stereotypes, cats have been shown to be highly social animals, many of which prefer human social interaction. Vitale has spent much of her research dedicated to understanding if cats can form social bonds with their humans (yes, they can) and how those bonds are created. Cats are facultatively social, which means that they are flexible in their living situation and can both live solitarily or socially, depending on their environment and life experiences. A 2019 study conducted by Vitale and colleagues that was published in the scientific journal Current Biology found that domestic cats respond to their owners -- just like dogs, cats also form bonds with their humans", "Other research has found that many cats even prefer social interaction. In one study, Vitale looked at the preference of cats for different types of rewards. Each feline was given a choice between several types of social interactions like food, toys, and scents. At least half of the cat subjects preferred interacting with humans over the other rewards, indicating that social interaction is an important component of a cat’s life.", "“If a cat is not getting enough social interaction, they may engage in attention-seeking behavior, such as meowing at the person or approaching the person and spending time near to them,” explained Vitale. “If a person is working on their laptop all day, it makes sense a cat would approach the area where the human spends time as a way to solicit attention from their owner.”", "In addition to sitting on laptops, cats exhibit other behaviors that help them express their love for their owner. These include “allogrooming,” which is licking their owner, and allorubbing, which is rubbing up against their owner — both of which are meant to build deeper bonds with their humans.", "Fugazza, Claudia, et al.   \"Did We Find a Copycat? Do As I Do in a Domestic Cat (Felis catus).\"\r\n    Animal Cognition.   18 Sept. 2020.", "Vitale, Kristyn, Behnke, Alexandra, Udell, Monique.   \"Attachment Bonds Between Domestic Cats and Humans.\"\r\n    Current Biology.   23 Sept. 2019.", "Vitale, Kristyn, Udell, Monique.   \"The Quality of Being Sociable: The Influence of Human Attentional State, Population, and Human Familiarity on Domestic Cat Sociability.”\r\n    Behavioral Processes.   January 2019.", "Vitale, Kristyn, Mehrkam, Lindsay, Udell, Monique.   \"Social Interaction, Food, Scent or Toys? A Forma Assessment of Domestic Pet and Shelter Cats (Felis silvestris catus) Preferences.\"\r\n    Behavioral Processes.   August 2017.", "Madison Dapcevich is a freelance contributor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]