["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A Walmart employee scans items in North Bergen, N.J. on November 9, 2017. (Associated Press)", "Walmart pledged $100 million to create a racial equity center that “will support philanthropic initiatives” on the nation’s financial, healthcare, education and criminal justice systems.” The money isn’t pledged to Black Lives Matter.", "Social media is rife with claims that major corporations are promising to give Black Lives Matter colossal sums.", "Recently, we rated as False a post on Facebook that Bank of America had pledged $1 billion to Black Lives Matter.", "The bank announced it would donate $1 billion over four years to communities of color and minority-owned businesses affected by COVID-19, but no money directly to the Black Lives Matter organization.", "Now comes a Facebook post with this claim:", "\"Wal mart has just pledged $100 million to Black Lives Matter. Are YOU still shopping there?\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Similar to the Bank of America case, this post is wrong.", "Walmart in June announced that it and the Walmart Foundation are pledging $100 million to create a racial equity center.", "The center \"will support philanthropic initiatives that align with four key areas: the nation’s financial, healthcare, education, and criminal justice systems.\"", "No decisions have yet been made on which organizations will receive funds from the center, a Walmart spokeswoman told PolitiFact.", "Walmart is among a number of corporations, foundations and others have made multimillion-dollar donations for racial justice, according to the Chronicle of Philanthropy.", "Two Black critics of the Walmart initiative have said Walmart should instead spend money on its employees, for things such as wages, paid leave and health care.", "We rate the claim False.", "Facebook, post (archived here), July 24, 2020", "Walmart, CEO Doug McMillon’s remarks, June 5, 2020", "Email, Walmart spokeswoman Tricia Moriarty, July 28, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]