["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "An activist from Ohio was indicted for wire fraud and money laundering. He is accused of using a Facebook page called “Black Lives Matter of Greater Atlanta” to defraud donors.", "Black Lives Matter was not charged.", "The Black Lives Matter Global Network Foundation said in September that it is not affiliated with the activist, and it told PolitiFact that hasn’t changed. A local news report from 2016 said he had “parted ways” with the Black Lives Matter of Atlanta movement before launching his organization.", "Social media users are wrongly claiming that an official Black Lives Matter organization was charged with committing wire fraud, laundering money and misusing donation money.", "The reality is different: a lone Ohio activist was indicted on similar charges after he allegedly created a Facebook page that he passed off as a Black Lives Matter charity.", "The facts haven’t stopped the spread of misleading claims about what happened.", "\"Black Lives Matter of Atlanta Charged with Wire Fraud, Money Laundering and Allegedly Using almost 500k in Donations For Personal Use,\" said conservative commentator Chuck Callesto, a former Republican congressional candidate, in one such tweet posted March 16.", "Screenshots of Callesto’s tweet were shared on Facebook, along with other posts that repeated versions of the same claim. They were flagged as part of the platform’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The posts give the misleading impression that the wire fraud and money laundering charges were filed against an official chapter of the Black Lives Matter movement formed in 2013 after the fatal shooting of Trayvon Martin, a Black teenager, in Florida.", "But Black Lives Matter was not charged.", "The charges are actually against a 32-year-old activist named Sir Maejor Page, or Tyree Conyers-Page, according to the Justice Department. Page is accused of using a Facebook page called \"Black Lives Matter of Greater Atlanta,\" an illegitimate nonprofit, to defraud donors on the platform who thought they were supporting a legitimate social justice organization.", "Page created the Facebook account and registered \"Black Lives Matter of Greater Atlanta\" as a nonprofit organization in 2016, and he continued soliciting donations through Facebook after the group’s tax-exempt status was revoked for failure to submit required IRS forms for three years, according to the indictment against him.", "Prosecutors say Page misled Facebook users into believing their donations would be used to back protests in support of George Floyd and the Black Lives Matter movement. He received donations from more than 100 people through the Facebook page. He put thousands of dollars toward personal items, entertainment, hotel rooms and a house, the indictment says.", "The Black Lives Matter Global Network Foundation, a charity created as an outgrowth of the Black Lives Matter movement, said in September that it was not affiliated with Page and that it rejected \"the extreme misleading behaviors of people who utilize our name for their own personal wealth and gain.\"", "\"Our stance remains that Mr. Page is not affiliated with Black Lives Matter Global Network Foundation, nor is he an activist for the movement,\" the foundation told PolitiFact.", "Fox 5 Atlanta, a local TV station, reported in 2016 that Page had \"parted ways\" with the Black Lives Matter movement in Atlanta before starting his Facebook page.", "A Twitter account for \"Black Lives Matter Atlanta\" posted two tweets that same year saying Page’s group was \"not a real chapter\" and \"not aligned w/ principles of BLM.\" The Black Lives Matter Global Network Foundation confirmed that the Twitter account is legitimate.", "Using Facebook, PolitiFact messaged Callesto, who created the tweet that appeared on Facebook as a screenshot. After we reached out, he acknowledged that his tweet \"could mislead\" and posted a follow-up tweet in a thread under the original.", "\"This tweet is missing CONTEXT,\" Callesto wrote in the March 18 update. \"It should read..  ‘Black Lives Matter of GREATER Atlanta’ Charged with Wire Fraud, Money Laundering... ‘Black Lives Matter of GREATER Atlanta’ refers to a(n) illegitimate nonprofit organization.\"", "Callesto cited a Toledo Blade article about Page’s indictment. He said he had copied the original claim from a headline on a news site. But PolitiFact searched Google and the Nexis news database and did not find a headline that matched the language in his tweet.", "Conservative activist Jack Posobiec tweeted a similar claim while sharing a Daily Caller story about Page’s indictment. Posobiec wrote, misleadingly, \"Black Lives Matter of Atlanta Charged with Money Laundering, Wire Fraud, Allegedly Used $450,000 in Donations for Personal use.\"", "A tweet reposted to Facebook said, \"Black Lives Matter of Atlanta Charged with Wire Fraud, Money Laundering and Allegedly Using almost 500k in Donations For Personal Use.\"", "That’s misleading. Black Lives Matter was not charged. The charges are against one person accused of misusing donations to what the Justice Department says was an illegitimate nonprofit posing as a Black Lives Matter charity.", "The Black Lives Matter Global Network Foundation said in a September statement that it was not affiliated with that person. A local news report from 2016 said he had \"parted ways\" with the Black Lives Matter of Atlanta movement.", "We rate this tweet False.", "Facebook post, March 17, 2021", "Facebook post, (archived), March 17, 2021", "Chuck Callesto on Twitter, (archived), March 18, 2021", "The Associated Press, \"Activist pleads not guilty to spending donations for own use,\" March 17, 2021", "Chuck Callesto on Twitter (archived), March 16, 2021", "Jack Posobiec on Twitter (archived), March 16, 2021", "The Daily Caller, \"Black Lives Matter Page Owner Allegedly Used $450,000 In Donations For Personal Use, FBI Says,\" March 15, 2021", "Toledo Blade, \"Black Lives Matter activist indicted by federal grand jury,\" March 12, 2021", "U.S. Justice Department, \"Toledo man charged with using ‘Black Lives Matter of Greater Atlanta’ Facebook page to defraud donors,\" March 12, 2021", "Black Lives Matter, \"Statement by Black Lives Matter Global Network Foundation in Response to Atlanta Activist, Sir Maejor Page,\" Sept. 28, 2020", "Black Lives Matter Atlanta on Twitter, Sept. 1, 2016", "Black Lives Matter Atlanta on Twitter, Sept. 1, 2016", "Fox 5 Atlanta, \"Vocal police protester busted repeatedly on fake cop charges,\" Aug. 12, 2016", "Facebook Messenger exchange with Chuck Callesto, conservative commentator and former Republican congressional candidate, March 18, 2021", "Statement from the Black lives Matter Global Network Foundation, March 19, 2021", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]