["About this rating", "In July 2020, an picture supposedly showing U.S. President Donald Trump kissing Jeffrey Epstein — the convicted sex offender and financier who authorities say took his own life while awaiting trial last year — on the forehead in the back of a car was circulated on social media:", "This is not a genuine photograph of Trump and Epstein.", "While one might mistake this image for genuine at a passing glance, a brief inspection reveals several visual oddities.", "For instance, Epstein's head appears far too big for this body. There also appears to be a lock of hair next to Epstein's cheek, with no discernible origins. These visual oddities make a bit more sense when you realize that the above-displayed image was created from a photograph of Trump and his daughter, Ivanka.", "The original photograph shows Trump with his daughter, who was 13 at the time. The photograph is available via Getty Images with the following caption:", "Close-Up Of Donald Trump. Etats-Unis, 15 mars 1990, dans sa limousine, le milliardaire américain de l'immobilier Donald TRUMP embrasse sa fille, Ivanka TRUMP (13 ans) qu'il a eue avec sa précédente épouse, Ivana. (Photo by Yann Gamblin/Paris Match via Getty Images)", "Close-Up Of Donald Trump. United States, March 15, 1990, in his limousine, the American real estate billionaire Donald TRUMP kisses his daughter, Ivanka TRUMP (13 years old) whom he had with his previous wife, Ivana. (Photo by Yann Gamblin / Paris Match via Getty Images)", "It should be noted that while this caption lists the date of this photograph as 1990, it was uploaded to Getty in 1995. The caption notes that Ivanka Trump was 13 at the time the photo was taken, and since Ivanka Trump was born in 1981, it's likely that this image was actually taken in 1995, not 1990.", "Here's a comparison of the doctored image (left) and a cropped version of the original photograph (right). The full photograph can be viewed here.", "While this image of Trump and Epstein is certainly fake, these two have been photographed together on numerous occasions. You can see genuine photographs of Trump, Epstein, and Ghislaine Maxwell, the British socialite who was arrested in July 2020 in connection with Epstein's crimes, here.", "BBC.   \"Jeffrey Epstein: The Financier Charged with Sex Trafficking.\"\r\n    16 November 2019.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]