["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "In this Jan. 3, 2019, file photo, Jerome Corsi, left, speaks during a news conference as his lawyer Larry Klayman stands behind him outside the federal courthouse in Washington. (AP)", "Jerome Corsi, a conservative author and conspiracy theorist, wrote on his blog that Dr. Anthony Fauci’s name appears on four patents for a protein linked to the novel coronavirus.", "Three of the patents Corsi cited are active. They deal with a potential treatment for HIV and are owned by the Department of Health and Human Services.", "There is no credible evidence that COVID-19 is related to HIV or was created in a lab. The coronavirus’ genetic makeup precludes the possibility that it was man-made.", "A conservative author who previously promoted the Obama birth certificate conspiracy is now publishing false claims about Dr. Anthony Fauci’s connection to the coronavirus pandemic.", "An April 28 article published on Jerome Corsi’s blog alleges that Fauci, director of the National Institute of Allergy and Infectious Diseases, owns some intellectual property tied to the novel coronavirus. It also floats the debunked idea that the virus was \"laboratory-created, possibly as a bioweapon.\"", "\"Why does Dr. Anthony Fauci’s name appear on 4 U.S. patents for a key glycoprotein that appears to have been inserted into a SARS virus chassis to create the current COVID-19 epidemic?\" Corsi wrote.", "The article was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "(Screenshot from Corsi Nation)", "Corsi is a conservative author and conspiracy theorist. He has made baseless allegations about former President Barack Obama’s birth certificate and spread misinformation related to QAnon, a broad right-wing conspiracy theory. As a friend of Roger Stone, a former campaign adviser to President Donald Trump, Corsi was part of former special counsel Robert Mueller’s investigation into 2016 election meddling.", "Since the pandemic began, we’ve fact-checked several false claims about Fauci’s connection to the coronavirus. Corsi’s article is similar to a claim made in \"Plandemic,\" a viral documentary that makes a slew of wrong allegations about Fauci, vaccines and COVID-19. So we wanted to look into this article, too.", "Corsi uses a discredited research article to draw an unwarranted connection between a patent family for a potential HIV treatment and the novel coronavirus. His article feeds into the debunked conspiracy theory that the virus was created in a lab.", "Corsi lists four patents in his article. They all have to do with a potential HIV treatment patented by the U.S. Department of Health and Human Services.", "The patents, three of which are active, all deal with a potential method for preventing HIV infection. That method includes \"a therapeutically effective amount of an agent that interferes with the interaction of gpl20 and α4 integrin ... thereby treating the HIV infection.\"", "In plain English: the potential treatment aims to impede a chemical interaction between HIV and human cells that can lead to transmission of the virus. It was based on a 2008 study conducted by NIAID scientists.", "Fauci is listed as an inventor on the patents alongside a few other authors of the 2008 study. But the assignee — the entity that owns the patents — is HHS.", "We reached out to the NIAID for more context, but we haven’t heard back.", "Corsi is using a withdrawn article and a debunked conspiracy theory to link the HHS patents to the coronavirus pandemic.", "In his article, Corsi mentions a Jan. 31 piece published by a group of Indian scientists on bioRxiv, a repository of preprint research papers. The article — which was not peer-reviewed and was later withdrawn — found a connection between a protein present in HIV and the novel coronavirus.", "The authors wrote that \"amino acid residues\" in the coronavirus were similar to gpl20, the HIV protein that NIAID scientists studied in 2008. The protein is mentioned in the HHS patents.", "But the authors withdrew their findings after other scientists criticized them as circumstantial and adding fuel to an unfounded conspiracy theory that the novel coronavirus was created in a lab.", "RELATED: What we know about the source of the coronavirus pandemic", "Researchers have concluded that the genetic structure of the novel coronavirus rules out the possibility of laboratory manipulation.", "A Nature article published March 17 says the genetic makeup of the coronavirus, documented by researchers from several public health organizations, does not indicate it was altered. Instead, scientists have two plausible explanations for the origin of the virus: natural selection in an animal host, or natural selection in humans after the virus jumped from animals.", "\"Our analyses clearly show that SARS-CoV-2 is not a laboratory construct or a purposefully manipulated virus,\" the article reads.", "We contacted Corsi by email but haven’t gotten a response.", "Corsi’s article claims that Fauci’s name appears on four patents for a protein that was used to create the novel coronavirus. That’s wrong.", "Three of the patents that Corsi identified are active and owned by the Department of Health and Human Services. But they are unrelated to the coronavirus pandemic. They deal with a potential treatment for HIV that NIAID researchers studied in 2008. Fauci is listed as an author on that study and as one of the inventors on the patents.", "There is no credible evidence that COVID-19 is related to HIV or was created in a lab. The coronavirus’ genetic makeup precludes the possibility that it was man-made. And Fauci is helping lead the U.S. response to the pandemic.", "The article is inaccurate. We rate it False.", "bioRxiv, \"Uncanny similarity of unique inserts in the 2019-nCoV spike protein to HIV-1 gp120 and Gag,\" Jan. 31, 2020", "CNN, \"Corsi willing to 'affirm' that information about him in Stone indictment is accurate,\" Jan. 27, 2019", "Corsi Nation, \"Why Does Fauci Hold Patents on a Key HIV Component Used to Create COVID-19,\" April 28, 2020", "Health Feedback, \"No, ‘HIV insertions’ were not identified in the 2019 coronavirus, contrary to claims based on questionable bioinformatics study\"", "Medical Xpress, \"Anti-integrin therapy effect on intestinal immune system in HIV-infected patients,\" Oct. 3, 2018", "Nature Immunology, \"NIAID Scientists Identify New Cellular Receptor for HIV,\" Feb. 10, 2008", "Nature Medicine, \"The proximal origin of SARS-CoV-2,\" March 17, 2020", "PolitiFact, \"Fact-checking ‘Plandemic’: A documentary full of false conspiracy theories about the coronavirus,\" May 7, 2020", "PolitiFact, \"Health misinformation site promotes conspiracy about coronavirus,\" Feb. 10, 2020", "PolitiFact, \"QAnon and Donald Trump rallies: What's that about?\" Aug. 3, 2018", "Stat, \"Quick retraction of a faulty coronavirus paper was a good moment for science,\" Feb. 3, 2020", "United States Patent and Trademark Office, U.S. Patent 9,193,790, Nov. 24, 2015", "United States Patent and Trademark Office, U.S. Patent 9,441,041, Sept. 13, 2016", "United States Patent and Trademark Office, U.S. Patent 9,896,509, Feb. 20, 2018", "Vox, \"Jerome Corsi, the conspiracy theorist now entangled in the Mueller investigation, explained,\" Nov. 28, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]