["About this rating", "For several years, social media users have shared tweets and memes claiming that funds from the sale of Girl Scout Cookies are distributed to Planned Parenthood, often posting such items with hashtags such as \"#cookiecott\" to promote the rumor:", "How did we end up with a crooked eyed snake salesman Leader, selling nothing but snake oil to Americans?", "— Tiffiny Bond (@RedHatGeek) April 8, 2015", "@KazmierskiR don't even get me started on Girl Scout cookies where portion goes to PP don't buy cookies write a check to the troop", "— QThePatriots+++ (@patriotswanted) December 23, 2015", "An opinion piece dated March 22, 2018 on LifeNews.com encouraged readers to \"say no\" to Girl Scout cookies over \"ties\" to Planned Parenthood (although it did not repeat the claim that proceeds of cookie sales go to fund that organization).", "The claim that Girl Scout Cookie sales fund Planned Parenthood became popular in mid-2015 and early 2016, likely due in part to a series of questionable viral videos targeting the latter organization circulated in the summer of 2015.  However, the rumor had previously spread widely in 2012, after Fox News reprinted a (since-deleted) opinion piece from LifeSiteNews that stated (in part):", "When our sweet little neighbor in her brown camp uniform came knocking on our door this year, we had to say no. I told her mother that I didn’t want to hurt Katie’s feelings, but I couldn’t support the Girl Scout cookie sale anymore because I’d learned too much about the organizers’ agenda, primarily their support for abortion and partnership with Planned Parenthood ...", "Several years ago. a quarter of the Girl Scout councils nationwide admitted to partnering with Planned Parenthood, the nation’s abortion giant. When questioned about the affiliation on NBC’s “Today Show,” Girl Scout CEO Kathy Cloninger had no compunction in confirming it.", "In fact, what then-Girl Scout CEO Kathy Cloninger said on NBC's Today show back in 2012 was that Planned Parenthood was one of several organizations (including church communities and YMCAs) that the Girl Scouts worked with \"to bring information-based sex education programs to girls.  Cloninger did not state (or imply) that any financial support relationship existed between the two organizations.", "We contacted the Girl Scouts of the USA (GSUSA) to determine whether any portion of the rumor was true. They responded to say that no proceeds have ever been donated from the sale of Girl Scout Cookies to Planned Parenthood.", "The Girl Scout Cookies section of the Girl Scouts website's FAQ declares that all revenue raised from cookie sales goes to the local Girl Scout councils and troops, not outside organizations:", "Q: Does any part of Girl Scout Cookie Program revenue support organizations other than the local Girl Scout council?", "A: One hundred percent of the net proceeds from Girl Scout Cookie sales is retained by the originating council and troop to power amazing experiences for girls and influential girl-led community projects. Girl Scout troops set goals for how to spend their proceeds on program-related activities, such as paying their own way to a community event or museum or funding other program outings. Girl Scout troops may also choose to use proceeds to purchase materials for a Take Action or service project to benefit the community.", "The Social Issues portion of the FAQ also states that GSUSA \"does not have a relationship or partnership with Planned Parenthood\":", "A 12 March 2015 New York Times compendium piece addressed the rumor and found it lacking:", "In recent years, conservative groups have challenged the organization — even held “cookiecotts” — over critics’ claims that it supports abortion. One Indiana lawmaker in 2012 went so far as to say the Girl Scouts were “quickly becoming a tactical arm of Planned Parenthood.”", "The Girl Scouts of the U.S.A. does have a legislative agenda. Reducing bullying and increasing girls’ involvement in science, technology, engineering and math are among issues on its website.", "Not on the list: abortion, or any social issues.", "Anna Maria Chávez, the chief executive of the national group, responded to critics last year, denying any relationship with Planned Parenthood.", "“A box of Girl Scout cookies is not a political statement,” she said.", "As Girl Scouts of the United States of America is a 501(c)(3) nonprofit organization, their financial statements are by law made freely available to the public, along with their annual report.", "Hassan, Adeel.   \"Your Thursday Briefing.\"\r\n    The New York Times.   12 March 2015.", "Ruse, Cathy Cleaver.   \"Say No to Girl Scout Cookies.\"\r\n    LifeSiteNews.   17 January 2012.", "Harrington, Elizabeth.   \"Pelosi: Girl Scouts' Relationship with Planned Parenthood ‘Very Valuable.’\"\r\n    CNSNews.com    1 February 2012.", "Updated with information about a more recent example of the claim.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]