["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A university degree doesn’t come cheap, and politicians are well aware that voters of all stripes wish college was more affordable.", "In a guest column last month in the Portland Tribune, Oregon’s junior U.S. senator wrote of his desire to make college more affordable to help grow the economy. In the piece, Democrat Jeff Merkley also cited the debt burden shouldered by the state’s university graduates.", "\"In Oregon today, the average debt upon college graduation is more than $24,000, with many students in debt $50,000 to $100,000,\" he wrote.", "At least $24,000 on average? That’s not chump change. For that money, students could splurge on a new car, plunk down a sizeable down payment on a first home or fly off on a very grand tour of Europe. In fact, $24,000 is almost half of the median annual household income in Oregon, according to the latest U.S. Census figures. We decided to focus our fact check on that statistic.", "Jamal Raad, Merkley’s spokesman, wrote in an e-mail to PolitiFact Oregon that the $24,000 figure comes from a June 2013 fact sheet from the Center for American Progress, a left-leaning D.C. think tank. The average debt per borrower in Oregon is $24,370, according to the report. That figure includes both public and private universities, said David Bergeron, the center’s vice president for post-secondary education policy.", "The figure originated from the Federal Reserve Bank of New York’s Household Debt and Credit Report, which provides a quarterly snapshot of trends in borrowing, including student loans.", "The statistic comes from a sample of consumer credit data and accounts for federally backed and private loans students borrowed, said Matthew Ward, a spokesman for the bank.", "The average amount borrowed by Oregon students is a bit less than the $24,810 U.S. average, according to the report. It also noted that 17.1 percent of Oregon consumers -- defined as those with a credit record -- carry student debt.", "The report listed \"average debt per borrower,\" not average debt per college graduate. In other words, many students incur student debt even if they drop out and never graduate. Some students incur no debt.", "Graduates from Oregon colleges in 2011 incurred an average debt of $25,497, according to The Institute for College Affordability & Success, a nonprofit that tracks student debt.", "The figures are for public and private schools and are based on voluntary reports submitted to college guidance company Peterson’s, which administers a financial aid database.", "The numbers are only as reliable as the universities are able to track and report. And college financial aid officers aren’t always aware of private loans that can add up.", "The institute’s numbers indicate that debt amounts can vary widely for private colleges, some of which offer more generous financial aid packages than public universities. For example, Reed College graduates in 2011 left with an average debt of $20,840; Lewis & Clark College $22,956; Willamette University $25,932; and Linfield College $29,754.", "We’ll note here that student debt figures are generally calculated out of the pool of graduates who leave school with debt — about 63 percent of Oregon students, the institute said. In other words, about 37 percent of students in Oregon graduate debt free.", "This matters because officials made similar statements about average debt per graduate in Ohio and Virginia, resulting in Half True rulings from sister PolitiFact organizations. They neglected to account for students who graduate without debt.", "Merkley, unlike the other politicians, did not talk about the \"average student\" but the \"average debt.\" We’ll come back to this point later.", "Finally, we checked with the Oregon University System. The average debt of graduates in the class of 2011 across all seven state schools was $23,839, according to the OUS 2012 Fact Book. The figures are for federal loans borrowed by students at each institution. About 59 percent of graduates left with debt.", "Merkley said that the average debt upon college graduation in Oregon is more than $24,000.", "The studies we found came up with three figures that largely back him up.", "The studies calculated student debt in different ways, making apples-to-apples comparisons impossible even though they’re all within range of one another. The studies also fail to account entirely for private loans students take out directly, which would likely increase the average student indebtedness amounts.", "Still, the reports back up Merkley’s statement.", "The only point left to quibble over is clarifying that 37 percent of students graduate from university in Oregon without any debt. That is additional information that could help readers understand that the $24,000 figure is among those who leave college in debt.", "Unlike officials in other states, Merkley did not write about the \"average kid\" or student incurring a certain amount of debt. He wrote about \"average debt\" upon graduation.  That makes his statement accurate, but it needs additional information and context.", "We rate the statement Mostly True.", "Sen. Jeff Merkley, \"Yellow balloons tell tale of student debt,\" guest column, Portland Tribune, July 11, 2013", "Emails from and interview with Jamal Raad, Merkley spokesman, July 23, Aug. 6-7, 2013", "Center for American Progress, \"How Oregon Will Be Affected if Stafford Loan Interest Rates Double,\" fact sheet, June 2013", "U.S. Census figures for Oregon, 2007-2011", "Federal Reserve Bank of New York’s Household Debt and Credit Report, Dec. 31, 2012", "The Institute for College Access & Success, The Project on Student Debt, 2011 Oregon figures", "Oregon University System, 2012 Fact Book, 2011 figures", "Interview with David Bergeron, vice president for post secondary education policy at Center for American Progress, Aug. 2, 2013", "Interview with Matthew Reed, program director, Aug. 2, 2013", "Interview and e-mail with Di Saunders, Oregon University System spokeswoman, Aug. 1 and 5, 2013", "E-mail from Matthew Ward, Federal Reserve Bank of New York, Aug. 5, 2013", "PolitiFact Ohio, \"Sherrod Brown says Ohio students graduate from college with an average tuition debt of $27,000 ,\"May 7, 2012", "PolitiFact Virginia, \"McDonnell says Virginia college graduates facing average $25,000 debt,\" Dec. 24, 2012", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]