["About this rating", "Invasive and exotic animals have long been common subjects of scarelore, and messages alerting readers to the supposed threat posed by some new or previously unheard-of species often spread like wildfire across message boards, social networks and email inboxes.", "These posts typically take the form of a \"public service announcement\" and are shared in good faith, and without hesitation, by people who sincerely wish to alert their friends and loved ones to an unfamiliar threat. For these reasons, the \"dangerous animal alert\" is also a frequent source of misinformation, deliberate scare-mongering, or even downright trolling.", "On 21 August 2018, one Facebook post went viral after it warned of a \"new deadly spider\" breed which was purportedly spreading across the United States and had killed five people in one week.", "Presenting several close-up photographs of a scary-looking spider, the post proclaimed:\nNEW DEADLY SPIDER SPREADS ACROSS USA\nTHE SPIDER FROM HELL. FIVE PEOPLE HAVE DIED THIS WEEK DUE TO THE BITE OF THIS DEADLY SPIDER .THIS SPIDER WAS FIRST SEEN IN SOUTH CAROLINA IN JULY SINCE THEN IT HAS CAUSED DEATHS IN WEST VIRGINIA ,TENNESSEE AND MISSISSIPPI. ONE BITE FROM THIS SPIDER IS DEADLY. US GOVERNMENT WORKING ON A ANTI VENOM AT THIS TIME PLEASE MAKE YOUR FAMILY AND FRIENDS AWARE\nThe spider shown in the photographs is Dysdera crocata, known variously as the woodlouse spider, sow-bug killer, woodlouse hunter spider, pill bug hunter, and Stiletto spider.\nThis spider is not new to the United States (although it is native to the Mediterranean region), and its bites are not fatal to humans, according to multiple reliable sources including a 2006 study in the scientific journal Toxicon, which concluded that \"Bites by the woodlouse spider, Dysdera crocata, are virtually innocuous. The main symptom is minor pain, typically lasting less than 1 h, probably due mostly to mechanical puncture of the skin.\"\nPennsylvania State University's College of Agriculture Sciences describes the species as follows:\nDysdera crocata is a hunting spider found from New England to Georgia and west to California. It is also a commonly encountered spider in England, northern Europe, and Australia. The woodlouse hunter preys on pill bugs or sow bugs ... D. crocata bites have been implicated in causing a localized, intensely itching erythema 4 to 5 millimeters in diameter. The bites apparently do not result in any systemic neurotoxicity or cytotoxicity.\n\"Araneae (Spiders of Europe)\" is a database of spiders hosted by the Museum of Natural History in Bern, Switzerland. It too describes woodlouse bites as itchy but relatively harmless to humans: \"This species can bite humans. The bite may be moderately painful and has a median duration of 40 minutes, in one third of cases pain is described as severe. There may also be moderate local itchiness and redness.\"\nFurthermore, neither this nor any other \"new deadly spider\" species killed five people in several southern states during the summer of 2018. We could find no corroboration whatsoever for this claim, despite our consulting several federal and state-level authorities. The Facebook post is therefore also false in claiming that the U.S. government is \"working on an anti-venom.\"\nThe author of the post, Gary Neaderhiser, appears to have something of a penchant for fake, scare-mongering Facebook posts, such as the one he published on 21 August 2018, which bore the heading \"HEADLESS MANNEQUIN STABS MAN IN MALL WITH KNIFE.\"", "Presenting several close-up photographs of a scary-looking spider, the post proclaimed:", "NEW DEADLY SPIDER SPREADS ACROSS USA", "THE SPIDER FROM HELL. FIVE PEOPLE HAVE DIED THIS WEEK DUE TO THE BITE OF THIS DEADLY SPIDER .THIS SPIDER WAS FIRST SEEN IN SOUTH CAROLINA IN JULY SINCE THEN IT HAS CAUSED DEATHS IN WEST VIRGINIA ,TENNESSEE AND MISSISSIPPI. ONE BITE FROM THIS SPIDER IS DEADLY. US GOVERNMENT WORKING ON A ANTI VENOM AT THIS TIME PLEASE MAKE YOUR FAMILY AND FRIENDS AWARE", "The spider shown in the photographs is Dysdera crocata, known variously as the woodlouse spider, sow-bug killer, woodlouse hunter spider, pill bug hunter, and Stiletto spider.", "This spider is not new to the United States (although it is native to the Mediterranean region), and its bites are not fatal to humans, according to multiple reliable sources including a 2006 study in the scientific journal Toxicon, which concluded that \"Bites by the woodlouse spider, Dysdera crocata, are virtually innocuous. The main symptom is minor pain, typically lasting less than 1 h, probably due mostly to mechanical puncture of the skin.\"", "Pennsylvania State University's College of Agriculture Sciences describes the species as follows:", "Dysdera crocata is a hunting spider found from New England to Georgia and west to California. It is also a commonly encountered spider in England, northern Europe, and Australia. The woodlouse hunter preys on pill bugs or sow bugs ... D. crocata bites have been implicated in causing a localized, intensely itching erythema 4 to 5 millimeters in diameter. The bites apparently do not result in any systemic neurotoxicity or cytotoxicity.", "\"Araneae (Spiders of Europe)\" is a database of spiders hosted by the Museum of Natural History in Bern, Switzerland. It too describes woodlouse bites as itchy but relatively harmless to humans: \"This species can bite humans. The bite may be moderately painful and has a median duration of 40 minutes, in one third of cases pain is described as severe. There may also be moderate local itchiness and redness.\"", "Furthermore, neither this nor any other \"new deadly spider\" species killed five people in several southern states during the summer of 2018. We could find no corroboration whatsoever for this claim, despite our consulting several federal and state-level authorities. The Facebook post is therefore also false in claiming that the U.S. government is \"working on an anti-venom.\"", "The author of the post, Gary Neaderhiser, appears to have something of a penchant for fake, scare-mongering Facebook posts, such as the one he published on 21 August 2018, which bore the heading \"HEADLESS MANNEQUIN STABS MAN IN MALL WITH KNIFE.\"", "Vetter, Richard S. and Geoffrey K. Isbister.   \"Verified Bites by the Woodlouse Spider, Dysdera Crocata.\"\r\n    Toxicon, Vol. 47, Issue 7.   1 June 2006.", "Jacobs, Steve.   \"Woodlouse Hunter Spider.\"\r\n    College of Agricultural Sciences, Pennsylvania State University.   2015.", "Nentwig, Wolfgang et al.   \"Dysdera Crocata.\"\r\n    Araneae -- Spiders of Europe, Natural History Museum (Switzerland.)   6 March 2018.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]