["Two videos of a ship have gone viral on social media with the claim that a transportation service from Bhavnagar to Bharuch has been started by Prime Minister Modi. As per the claim, the 350 km road distance will only be 32 km by sea, and the journey will take 30 minutes. The claim adds that the ship can carry 50 trucks, 60 buses, 200 cars, 350 motorcycles and 600 people.", "The viral text associated with the video reads, “भावनगर से भरूच रोड की दूरी है 350 किलोमीटर, और समुद्री रास्ते से इसकी दूरी है 32 किलोमीटर, और इसी समुद्री रास्ते से प्रधानमंत्री ने जहाज द्वारा एक सर्विस चालू की है इस जहाज की क्षमता एक बार मे 50 ट्रक, 60 बसे, 200 कारे, 350 मोटरसाइकिल, 600 लोगो को, और समय सिर्फ आधे घंटे में”. This has been posted by several Twitter and Facebook users.", "Twitter user @RenukaJain6 posted a one-minute video of a ship sailing through a narrow channel. It gained over 2.4 lakh views and 6,700 retweets.", "भावनगर से भरूच रोड की दूरी है 350 किलोमीटर , और समुद्री रास्ते से इसकी दूरी है 32 किलोमीटर, और इसी समुद्री रास्ते से प्रधानमंत्री ने जहाज द्वारा एक सर्विस चालू की है इस जहाज की क्षमता एक बार मे 50 ट्रक, 60 बसे, 200 कारे, 350 मोटरसाइकिल, 600 लोगो को, और समय सिर्फ आधे घंटे में pic.twitter.com/MRtKPjETZZ", "— #RenukaJain (@RenukaJain6) September 28, 2020", "Alt News performed a Google reverse image search using InVid and found multiple articles that published the viral video including New York Post and The Sun in 2019. As per the reports, the cruise ship is MS Braemar, owned by the Norway-based Fred Olsen Cruise Lines. The viral video shows the ship sailing around the Greek Islands en route to Italy. New York Post reported, “In order to circumvent the 430-mile voyage around the peninsula — and for the sheer thrill — the vessel decided to traverse the frighteningly tight Corinth Canal.”", "Twitter user @Singh51173240 had tweeted a 40-second video that shows trucks unloading from a ship.", "भावनगर से भरूच रोड की दूरी 350 किलोमीटर और समुद्री रास्ते से इसकी दूरी है 32 किलोमीटर इसी समुद्री रास्ते से प्रधानमंत्री ने जहाज सर्विस चालू की है इस जहाज की क्षमता एक बार मे 50 ट्रक, 60 बसे, 200 कारे, 350 मोटरसाइकिल, 600 लोगो को,मात्र आधे घंटे में पर करवाना। इसे कहते है विकास pic.twitter.com/LfeUqw0Nbm", "— सिंह-#३ह (@Singh51173240) January 30, 2022", "The same video was also viral in 2020.", "🛣️ भावनगर से भरूच रोड की दूरी 350 किलोमीटर, जबकि समुद्री रास्ते से इसकी दूरी है 32 किलोमीटर इसी समुद्री रास्ते से @narendramodi ने जहाज से सर्विस चालू की है इस जहाज की क्षमता एक बार मे 50 ट्रक, 60 बसे, 200 कारे, 350 मोटरसाइकिल, 600 लोगो को, और समय सिर्फ आधे घंटे में, 🛳️🚍🙏 pic.twitter.com/yeBHOgSitS", "— श्री हेमन्तसिंह मोजावत हल्दीघाटी (@MojawatHemant) September 20, 2020", "Alt News performed a reverse image search on Google using InVid and found that this video was widely shared with a similar viral text in 2018 as well.", "Next, we performed a keyword search on Twitter and found that the “state of the art” ferry service was initiated between Bharuch’s cargo port Dahej and Bhavnagar’s cargo port Ghogha by the Gujarat government on October 22, 2017, just two months before the state assembly elections.", "Ghogha-Dahej Ferry Service will boost connectivity and infrastructure in Gujarat. pic.twitter.com/Hed5BoaT9V", "— Narendra Modi (@narendramodi) October 21, 2017", "Unlike the social media claim, the video uploaded by PM Modi states that the ferry would take one hour to cover the distance of 31 km, and can carry up to 70-80 trucks, 100 light motor vehicles, and 500 passengers.", "This slideshow requires JavaScript.", "Google Map location of Ghogha Dahej Ro-Ro Ferry Service has multiple pictures of the ferry uploaded by users. Here, we found an image of a ferry that is identical to the viral image.", "Just over a year after the ferry was launched, The Times of India reported in 2018 that the travel by sea would not benefit people from cities other than Bhavnagar because it neither saves them time nor money. In 2019, The Print reported that ferry service was suspended. “The ferry service operator, Indigo Seaways Private Limited, in the Gulf of Khambhat has decided to sell the vessel, Island Jade, that Modi rode during the inauguration of the service in 2017 ahead of the Gujarat assembly elections,” per the report.", "In February 2020, The Indian Express reported that dredging led the ferry to break down four times within a period of 12 months and it has been suspended since late 2019. The report also stated that Gujarat Maritime Board (GMB) officials forewarned that it is likely that there could be “a situation in the future where ferry operation comes to a standstill due to GMB being unable to maintain the required draft in the channel.”", "As of today, DG Sea Connect, the official website for booking ferry tickets, states that the services are suspended due to unsafe navigation depth of water.", "Two videos with an identical claim went viral on social media. The claim stated that the video shows a ferry ride between two Gujarat-based cities. One of the videos showed a cruise ship in Greece while the other indeed showed a video of a ferry that used to operate between Gujarat cities Bhavnagar and Bharuch. This project was launched in 2017 by PM Modi prior to state elections. The service remains suspended since late 2019.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]