["The one-minute video was published here on Facebook on February 3, 2020. It has been viewed more than 250 times.", "Below is a screenshot of the misleading post:", "The logo of Chinese state media CCTV can be seen in the top-right corner of the video.", "The post’s caption reads: “China PM who told we’ll translate the Quran as our own realised that the only one way to protect from the korona virus is doing ‘sajtha’ to Allah and went to mosque to pray, Masha llah.”", "“Sajtha”, also romanized sajda, is an Arabic word meaning prostration to God, a posture often adopted during prayer.", "“Mashallah” is also an Arabic word meaning “God willing”, most commonly used to express joy.", "“Korona virus”, or novel coronavirus, is an epidemic that has killed at least 630 people and infected some 30,000 others in China since its emergence at a wildlife market in the central Chinese city of Wuhan in late 2019, according to this AFP report dated February 7, 2020.", "The current Chinese prime minister is Li Keqiang. Here is his biography at the Chinese government’s website.", "The video has been viewed more than 17,000 times after it was  shared here, here, here on Facebook; here and here on Twitter; here and here on YouTube, alongside similar claims.", "However, the claims are false; this video shows Chinese President Xi Jinping’s visit to a mosque in northwest China in July 2016.", "A reverse image search of keyframes extracted from the video found this footage, published on the official YouTube channel of Chinese news agency CCTV, on July 20, 2016.", "The video title states: “Chinese President visits big mosque in northwest China.”", "The video description reads, in part: “Chinese President Xi Jinping paid a special visit to the Xincheng Mosque in Yinchuan City Tuesday morning, during his current fact-finding tour of the Ningxia Hui Autonomous Region in northwest China.”", "Below are screenshot comparisons of the misleading Facebook video (L) and the CCTV video (R):", "President Xi’s visit to the mosque in July 2016 was also reported by local and international media here and here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]