["The claim was published here on Facebook on July 7, 2020. It has been shared 2,000 times.", "The lengthy Thai-language post translates to English, in part, as: “The scariest war has arrived in China, and that is 'the plague' as predicted.", "“Once plague has become an epidemic, the Wuhan virus is nothing compared to it because currently there are no treatments in the world that can cure plague in humans.", "“Today marks the 300th anniversary of when the plague hit China that spread and killed people in three different parts around the world.", "“Suddenly this plague has disappeared without a trace, and today it is back.”", "A similar claim has also been shared here, here, here and here on Facebook.", "The claims are misleading.", "'Severe epidemic' claim", "Plague is caused by bacteria found in small mammals and their fleas. It is transmitted between animals and humans by the bite of infected fleas, direct contact with infected tissues and inhalation of infected respiratory droplets, according to the WHO.", "On July 7, the WHO said several new cases of bubonic plague -- reported in China's northern Inner Mongolia region and in Khovd province in neighbouring Mongolia -- were “being well managed”.", "As reported in this AFP article, WHO spokesperson Margaret Harris said: “We are looking at the case numbers in China. It's being well managed. At the moment, we are not considering it high-risk but we're watching it, monitoring it carefully.”", "‘No cure’ claim", "The post claims: “Currently there are no treatments in the world that can cure plague in humans.”", "The claim is false; international health bodies including the WHO and the US Centers for Disease Control and Prevention (CDC) say the plague can be treated with antibiotics.", "In an email on July 14, Kanpirom Wiboonpanich, the executive associate of Thailand’s WHO, directed AFP to the WHO's website.", "The Q&A section of the WHO’s advice for plague reads, in part: “Antibiotics and supportive therapy are effective against plague if patients are diagnosed in time.”", "The CDC also says plague can be successfully treated using antibiotics.", "On its website, it reads in part: “Plague can be successfully treated with antibiotics. Once a patient is diagnosed with suspected plague they should be hospitalized and, in the case of pneumonic plague, medically isolated.”", "Unrelated photos", "The images in the misleading post do not support the claim.", "The first photo shows streets submerged by water in Yangshuo County in southern China after flooding. The image was published in this AFP report on June 11, 2020.", "The second photo shows a mobile screenshot of this BBC Thai article about the bubonic plague published on July 6, 2020. The photo is a file image from the US Centers For Disease Control of bubonic plague bacteria under a microscope, captured in January 2003.", "The third photo is a stock image of a plague patient published by Alamy, a UK-based photo agency. The photo is dated January 1, 1993.", "AFP Philippines previously debunked a similar claim about bubonic plague in China here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]