["About this rating", "The federal Bureau of Land Management put leases on154,212 acres up for auction in December 2018.", "Leases to only 139,079 of those acres were sold off, and it is unclear how much of the leased property will actually be subjected to fracking.", "Despite protests from environmental groups, the federal Bureau of Land Management (BLM) put leases for oil and gas development on more than 150,000 acres of federally owned land up for auction on 11 December 2018.", "The bureau confirmed on its website that it had offered leases on 154,212 acres -- and sold leases on 139,079 acres -- to oil and gas companies, raising almost $3,040,371:", "The BLM's policy is to promote oil and gas development if it meets the guidelines and regulations set forth by the National Environmental Policy Act of 1969 and other subsequent laws and policies passed by the U.S. Congress. The BLM's energy program includes an all-of-the-above approach that includes oil and gas, coal, strategic minerals and renewable sources, all of which can be developed on public lands.", "The auction was protested by groups leery of the effects of opening the land, located in Utah, up to exploration by business interests. On 11 December 2018 a coalition of activists mounted a protest at the state Capitol in Salt Lake City, and one of the participating groups, the Sierra Club, said in a statement that:", "Despite increasing concerns about climate change and damage to wildlife habitats, about 90 percent of federal public lands in the West are available for oil and gas leasing. Federal oil and gas leasing commits millions of acres of public land to fossil fuel industrialization that pollutes the air and water, destroys habitat for sensitive and endangered wildlife and threatens public health.", "Another activist, Brooke Larsen, criticized the BLM in an op-ed for the Salt Lake City Tribune, saying that the agency's decision to move forward with land auctions to energy companies flew in the face of both national and international findings warning nations to begin weaning themselves from fossil fuels or risk worsening the effects of climate change.", "\"Projected megadrought for the Southwest has already hit Utah, as 2018 was the state's driest year on record,\" she wrote. \"Foreseeing this crisis in late winter, Gov. Gary Herbert responded by asking faith leaders to pray for snow. We need more than prayers. We need to keep fossil fuels in the ground.\"", "It is unclear how much of the land auctioned off by the bureau would be subjected to fracking, but the auctions have been accompanied by a rollback under President Donald Trump's administration of a requirement that gas and oil companies reveal what fracking chemicals they use on federal lands. At least some business owners who have picked up land in federal auctions have disclosed that they charge companies to perform fracking operations on their property.", "Bureau of Land Management.   \"BLM-Utah December Quarterly Oil and Gas Lease Sale Nets Nearly $3,040,371.00.\"\r\n    Accessed 18 December 2018.", "Weaver, Jennifer.    \"Utahns Protest Oil, Gas Lease Auction Near National Parks.\"\r\n    KUTV-TV.  11 December 2018.", "Larsen, Brooke.  \"Commentary: BLM is Auctioning Off Our Future.\"\r\n    Salt Lake City Tribune.  9 December 2018.", "Lipton, Eric and Hiroko Tabuchi.    \"Driven by Trump Policy Changes, Fracking Booms on Public Lands.\"\r\n    The New York Times.    27 October 2018.", "Arturo Garcia is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]