["About this rating", "Certain terrorist attacks on the 22nd day of a month may have been commemorations of previous attacks on the 22nd day of the same month in previous years.", "The 22nd day of the month is statistically no more prone to attacks than any other day -- and even when terrorists do pick specific dates for \"anniversary\" attacks, what matters is the full date - a particular day in a particular month - and not just a particular day in any month.", "By our nature, humans look for patterns to help us understand and explain seemingly random and chaotic events and phenomena. Consider, for example, the old superstition that \"deaths come in threes.\" Faced with horrific and seemingly incomprehensible events like the slaughter of children in a suicide bombing at a pop concert, the impulse to find patterns becomes even stronger.", "On 23 May 2017, a number of memes pointing out that a handful of high-profile terrorist attacks had taken place on the 22nd day of certain months gained popularity on social media. The latest of these was the suicide bomb attack in Manchester, England, on 22 May 2017.", "This tweet accurately states that:", "On 23 May 2017, the Daily Mail joined the chorus, publishing an article whose lengthy headline begins \"Another jihadist attack on the 22nd.\" The article, like many tweets and Facebook posts in the days following the Manchester bombing, outlines some significant recent attacks on the 22nd day of various months.", "The story claimed that \"Security agencies are understood to be examining the possibility that the date – the 22nd of the month - is significant,\" before adding, \"Initial indications suggest there is no link.\"", "The next day, the Men'sXP web site also published an article pointing to a \"dark and scary theory\" about the timing of terrorist attacks:", "For some reason, the number 22 holds a lot of significance and seems to have a rather sinister link to the events of previous attacks...", "Others accurately pointed out that the Utoya massacre, in which Anders Behring Breivik killed 77 people in a bomb attack and shooting rampage in and near Oslo, Norway, took place on 22 July 2011, and that a suicide bomb attack on a Christian church killed more than 120 people in Peshawar, Pakistan on 22 September 2013.", "Is there a pattern here? Sure - all these events took place on the 22nd day of a month. But there are patterns everywhere, if you look for them.", "For example, here's a selective list of prominent transport disasters and crashes that took place on the 23rd day of the month:", "This is just a small selection of similar events that have taken place on the same day of different months, in different years. Some even took place on the same day of the same month (the final three in our list), and two took place on the same day of the same month in the same year.", "Spooky, right? Not really. All this list illustrates is that patterns can be found almost anywhere, if you go looking for them. Whether a pattern has any greater meaning, or a common factor that is anything more than coincidental, is the real question.", "Choice vs Coincidence", "Plane crashes are not like terrorist attacks, however. They are (generally) accidental, and therefore the date on which they occur is not chosen in advance. Are terrorists choosing their attacks for the 22nd day of various months, because it's the 22nd day of the month? Not exactly.", "We know that some terrorist attacks are timed for specific dates because they mark the anniversary of another attack or significant event.", "For example, Timothy McVeigh planned the Oklahoma City bombing for 19 April 1995 because it marked the second anniversary of the violent end of the FBI's siege at the Branch Davidian compound in Waco, Texas - which McVeigh had witnessed firsthand.", "And in December 2015, Mohammed Rehman and Sana Ahmed Khan were convicted of planning a thwarted bomb attack in London on 7 July that year, specifically to mark the 10th anniversary of the 7 July 2005 \"7/7\" attacks, which killed 52 people.", "We don't often get such clear confirmation of \"anniversary\" plots, though.", "German police suggested Ali David Sonboly's 22 July 2016 shooting rampage in Munich may have been inspired by Anders Behring Breivik's Utoya massacre, exactly five years earlier. The country's Interior Minister said investigators had discovered that the 18-year-old had been researching Breivik's attacks.", "However, Sonboly killed himself after the attack and so did not face police questioning or a trial, during which the reasoning behind the date might have emerged more definitively.", "Similarly, Khalid Masood was shot dead by police after killing four people at Westminster in London on 22 March 2017, a year to the day after three terrorist bombings in Brussels.", "Julian King, the European Union's Security Commissioner, told a European Parliament committee: \"I don't think it was a complete accident that this attack took place on the first anniversary of the Brussels attacks...\"", "It is also possible that Salman Abedi, the suspected Manchester Arena attacker, timed the bombing to mark the fourth anniversary of the death of British soldier Lee Rigby, who was brutally murdered in an Islamic extremist attack in London on 22 May 2013.", "But Abedi was killed in the suicide bombing on 22 May 2017, and so far, such a motive for the date of the attack hasn't been established, and may not have been present at all.", "Conclusion", "There are three essential points to bear in mind if you see a meme highlighting terrorist attacks that took place on the 22nd of the month:", "It's true that terrorists do sometimes choose the date of their attack to commemorate an event that's important to them -- often a previous attack. So as time passes, it could become more likely that certain dates might see an exponential growth in the number of incidents planned or carried out.", "Of course, police and security agencies around the world are also very aware of these dates, and so the increased prevention and enforcement that comes on dates like 7 July and 11 September may mean such plots are more likely to be thwarted before being executed.", "But where a date has significance, it is the full date that matters - not the day of the month. There is no symbolic significance, mystical power, or terrorist conspiracy surrounding the number 22.", "Brown, Larisa.  \"Another Jihadist Attack on the 22nd: Manchester Blast Comes Exactly Four Years After Lee Rigby Was Murdered and Two Months to the Date Since the Westminster Attack.\"\r\n    The Daily Mail.   23 May 2017.", "Tamblyn, Penelope.   \"The Next Terror Attack Might Just Happen on July 22nd 2017 According to a Dark & Scary Theory.\"\r\n    MensXP.   24 May 2017.", "McBride, Jessica.   \"Coincidence? These Terrorist Attacks Occurred on the 22nd.\"\r\n    Heavy.com.   24 May 2017.", "Bowcott, Owen.  \" Couple Found Guilty of 7/7 Anniversary London Bomb Plot.\"\r\n    The Guardian.   29 December 2015.", "Fisher, Max.   \"Terrorist or Disturbed Loner? Munich Attack Reveals Shifting Labels.\"\r\n    The New York Times.   24 July 2016.", "BBC News.   \"Munich Gunman 'Obsessed with Mass Shootings.'\"\r\n    24 July 2016.", "Dodd, Vikram.   \"Lee Rigby Murder: Michael Adebolajo Gets Whole-life Jail Term.\"\r\n    The Guardian.   26 February 2014.", "BBC News.   \"Nice Attack: What We Know About the Bastille Day Killings.\"\r\n    19 August 2016.", "Evans, Martin and Chiara Palazzo.   \"Everything We Know So Far About the Stockholm Terror Attack.\"\r\n    The Daily Telegraph.   9 April 2017.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]