["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "With no quick end to the recent federal government shutdown in sight, a Facebook post harking back to a 2013 shutdown under President Barack Obama has been shared over 71,000 times.", "The Dec. 22 post from Trump-backer Kristy Greczkowski said, \"Oct 2013, Obama shut down the government for 16 days to force Obamacare. A friendly reminder America. Secure our borders.\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "We thought we’d compare the two fiscal impasses.", "In September 2013, two issues were in play, the Affordable Care Act and raising the debt ceiling –– the legal amount the government is allowed to borrow.", "The Affordable Care Act, passed in 2010, was due to begin in earnest in 2014. The individual mandate requiring people to have insurance would come into force. Coverage would start for Americans who signed up through government insurance marketplaces (although the meltdown of the  federal Healthcare.gov website was about to throw that step into chaos).", "Republicans, primarily in the House, aimed to defund Obamacare. None of the 12 regular appropriation bills to pay for government operations had been passed. A group of 80 House Republicans signed a letter to House Speaker John Boehner saying this was the time to eliminate any dollars that would allow Obamacare to move forward.", "Before the shutdown, Rep. Paul Ryan, R-Wis., warned that a shutdown would be a bad idea and in any event wouldn’t block most of Obamacare from moving forward.", "We rated that claim Mostly True. Most key parts of the law – the insurance marketplace, the premium subsidies, and the taxes and regulations – would continue unimpeded.", "But if Obamacare was one rallying cry, the debt ceiling turned out to be just as important. The government was closing in on the legal limit of $16.699 trillion in debt. Without the flexibility to borrow more, Washington faced the prospect of not being able to pay back Treasury notes as they came due. Republicans wanted broader spending cuts in exchange for raising the debt limit.", "At the time, Republicans controlled the House, and Democrats held the Senate. Obama had said he would veto any bill that defunded Obamacare. His veto threat and the Democratic-controlled Senate doomed any measure that undermined the fledgling health care program.", "The House passed several bills that eliminated Obamacare funding, and the Senate kept stripping out those provisions.", "The government shutdown began on Oct. 1. On Oct. 15, the rating agency Fitch said the U.S. government’s credit worthiness would be reviewed. A downgrade would have dramatically increased borrowing costs.", "On Oct. 16, Senate Democrats and Republicans came to terms, agreeing to raise the debt ceiling and keep government open through mid December. Obamacare funding was untouched.", "The latest shutdown stems from President Trump’s desire for $5 billion to build a wall along the border with Mexico. The Republican-controlled Senate declined to make that part of its funding plan because it couldn't get the needed 60 votes to eventually pass the spending plan. The House passed a measure with money for the wall.", "The wall appears to be the only significant element that separates the sides.", "A Facebook post said that Obama shut down the government in 2013 to force Obamacare. There are a couple of key differences between then and today.", "First, leading Republicans, including Ryan, noted that Obamacare largely would move forward even if some elements were defunded. In that sense, Obama was not fighting to \"force\" Obamacare, because he didn’t need to.", "Second, in 2013, two issues, Obamacare and the debt ceiling, were on the table. In 2018, funding for the wall stands alone. In 2013, a compromise on the debt ceiling cleared the way to reopen the government.", "There is also a legal difference. In 2013, Obamacare was already law. Funding for the wall is not.", "The situation in 2013 was more complicated than today. Obama, like Trump, aimed to protect a favored policy. But he also wanted to raise the debt limit, an issue of at least equal importance. We rate this claim Half True.", "Kristy Greczkowski, Facebook post, Dec. 22, 2018", "Congressional Research Service, Shutdown of the Federal Government: Causes, Processes, and Effects, Dec. 10, 2018", "Congressional Research Service, The Debt Limit: History and Recent Increases, Nov. 2, 2015", "Reuters, Obama says he will not negotiate with Congress on debt ceiling, Sept. 16, 2013", "Reuters, Fitch Places United States' 'AAA' on Rating Watch Negative, Oct. 15, 2013", "NPR, How We Got Here: A Shutdown Timeline, Oct. 17, 2013", "PolitiFact, Paul Ryan says government shutdown wouldn't sideline Obamacare, Aug. 8, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]