["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Police and protesters converge during a demonstration on Sept. 23, 2020, in Louisville, Ky. (AP)", "A video shows protesters taking shields, signs and other supplies from the back of a U-Haul truck in Louisville, Ky. Some of the signs bear a symbol associated with antifa activists and the truck’s driver has done anti-fascist organizing in the past.", "An eyewitness said he didn’t see any weapons in the truck. We could find no evidence that antifa activists passed out weapons at the protests.", "The claim that the U-Haul is linked to an organization funded by George Soros appears to have originated on forums known for spreading disinformation. There is no connection between the billionaire philanthropist and the truck.", "In the video, protesters wearing backpacks rush to the back of a U-Haul truck. They reach in and grab pre-made canvas signs bearing slogans like \"abolish the police\" and \"abolition now.\"", "\"They got shields!\" someone yells.", "The clip is one of several that circulated on social media following the Sept. 23 news that two Louisville, Ky., police officers involved in the fatal shooting of Breonna Taylor would not face charges in connection with her death. Taylor, a 26-year-old Black woman, was shot six times in her home as police tried to issue a warrant in March.", "Protesters took to the streets almost immediately after the grand jury announced its decision not to charge the officers with Taylor’s death.", "Two officers were shot and wounded in the ensuing violent demonstrations, and 127 people were arrested. Which leads us back to the video, which was filmed Sept. 23 near downtown Louisville.", "Some onlookers claimed the clip showed activists linked to a billionaire philanthropist.", "\"The #ANTIFA UHAUL seen distributing shields, weapons & black bloc is registered to Holly Zoller of the Louisville KY Bail Project which is a George Soros funded initiative,\" a Sept. 23 Facebook post says.", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "(Screenshot from Facebook)", "Similar versions of the post have been shared thousands of times, and \"U-Haul\" trended on Twitter the morning of Sept. 24. Fox News hosts amplified the claim on Twitter, TV and online, as did conservative outlets like the Gateway Pundit and National File. House Minority Leader Kevin McCarthy cited the footage in an interview with Fox News, during which he claimed protests against police brutality are \"planned, orchestrated events.\"", "We wanted to take a closer look at the footage.", "Several videos of the same event show protesters taking signs from the back of a U-Haul, some of which bear a symbol associated with antifa, a broad coalition of left-wing activists. Zoller, who rented the truck, has done anti-fascist organizing in the past. But there is no evidence that the truck distributed weapons, or that the truck was connected to Soros.", "The truck depicted in the viral social media video distributed protest supplies like shields, signs and face masks. Some of the signs bore logos associated with antifa. There is no evidence that the truck contained weapons.", "Storyful, a social media intelligence agency, analyzed the video and reported Sept. 23 that it shows protesters unloading shields from a storage truck. That analysis is consistent with reports from journalists on the ground in Louisville.", "\"A parked U-Haul was waiting for the crowd up the street,\" tweeted Shelby Talcott, a reporter for the Daily Caller, from Louisville on Sept. 23. \"It contains supplies such as signs, shields, water etc. I’m not sure how people knew what it contained.\"", "In the footage, one sign taken from the U-Haul shows three arrows pointing down. That’s the symbol of the Iron Front, a German paramilitary organization that formed in the 1930s to oppose extremists on the left and the right, such as the Nazi Party and the Communist Party of Germany.", "Interestingly, the Communist Party of Germany is the source of the term \"antifa.\" It adopted the phrase \"Antifaschistische Aktion\" — \"anti-fascist action,\" in English — in 1932 as the Nazis were gaining power. So, historically speaking, the Iron Front would have opposed anti-fascist groups and vice versa.", "But today, American antifa activists have been known to brandish shields, flags and other paraphernalia emblazoned with the Iron Front symbol at protests across the country. Another angle of the protest in Louisville shows the banner head-on, alongside another sign bearing the anarchy symbol.", "Does that mean the U-Haul was driven by antifa organizers, or that it handed out weapons? Not necessarily.", "\"I haven’t seen any evidence for that specifically,\" said Brendan Gutenschwager, who shot the footage analyzed by Storyful, when asked about the claims in the Facebook post. \"Mostly just the wooden boards and signs handed out of there, some masks as well.\"", "RELATED: What is antifa, and why is it all over my timeline?", "Since the death of George Floyd in Minneapolis police custody in May, we’ve fact-checked several claims about alleged antifa involvement in protests against police brutality. Time and again, we have found no evidence to support the notion that a loose coalition of activists is orchestrating violence.", "\"We look at antifa as more of an ideology or a movement than an organization,\" FBI Director Christopher Wray said during a House committee hearing Sept. 17.", "We reached out to the Louisville Metro Police Department and the FBI’s Louisville field office for more information. LMPD didn’t get back to us and the FBI declined to comment.", "For years, Soros has been falsely accused of funding and directing protests. This time is no different.", "The Facebook post cites \"research by @inteldotwav,\" a 15-month-old Twitter account that posts about \"protests, riots, and chaos.\" It tweeted Sept. 23 that the U-Haul was rented by someone named Holly Zoller.", "Zoller is a bail disruptor for the Bail Project’s branch in Louisville whose bio says she \"has organized around anti-fascist movements\" in the past. The Bail Project is a national nonprofit organization that pays people’s bail \"to prevent incarceration and combat racial and economic disparities in the bail system.\"", "Several social media posts and the National File story pointed to the fact that some of the Bail Project’s employees were previously Soros Justice Fellows as evidence that the organization is tied to the billionaire philanthropist.", "We asked Storyful whether it had seen any evidence that Soros, whose Open Society Foundations fund many liberal advocacy groups — including those that are part of the Black Lives Matter movement — are connected to the U-Haul. It hadn’t.", "The connection between Zoller and the U-Haul may have started on 4chan, where a user claimed to be able to look up rental information in the company's records. Similar claims spread on Twitter and Discord.", "RELATED: No, George Soros is not a Nazi who funds antifa", "4chan and Discord are fringe internet platforms where anonymous users are known to create and spread false information. One user, @inteldotwav, claimed to have evidence in the form of  a phone call that a group on Discord purportedly had with Zoller, during which she said she drove the U-Haul truck and dropped off supplies at the protest.", "We could not confirm the date of that call, nor whether the person on it was actually Zoller. But the Bail Project confirmed that Zoller rented the U-Haul truck depicted in the footage.", "\"Holly rented the truck in her personal capacity, during her time off, and did not use funds from The Bail Project,\" said Camilo Ramirez, director of communications for the Bail Project. \"I watched the video and saw painted signs and water, but of course some people are exploiting the clip to create misinformation and attack our organization.\"", "Open Society Foundations does not fund the Bail Project.", "The nonprofit’s most recent tax filing shows that it received nearly $25 million in contributions and grants during the fiscal year ending June 2018. None of that money came from the Open Society Foundations, according to the philanthropy’s most recent tax filing and a list of its awarded grants.", "\"The Open Society Foundations supports the First Amendment right of every American to petition their government for redress of grievances through peaceful protest,\" said Laura Silber, the philanthropy’s chief communications officer. \"We abhor violence of any kind. We do not now nor have we ever funded ‘antifa.’\"", "A Facebook post says an antifa-operated U-Haul truck distributed \"shields, weapons & black bloc\" to protesters in Louisville and is linked to \"a George Soros-funded initiative.\"", "A video shows protesters taking shields, signs and other supplies from the back of a U-Haul truck. Some of the signs bear a symbol associated with antifa activists. An eyewitness said he didn’t see any evidence that the truck contained weapons", "The claim that the U-Haul truck is linked to an organization funded by Soros appears to have originated on forums known for spreading online disinformation. There is no connection between the billionaire philanthropist and the truck.", "The post contains an element of truth but stretches the facts to make an unproven connection to Soros. We rate it Mostly False.", "UPDATE (Sept. 25, 2020): This fact-check has been updated to include a statement from the Bail Project and more information about Zoller.", "Account Analysis, accessed Sept. 24, 2020", "Bail Project, Inc., Full text of \"Full Filing\" for fiscal year ending June 2018", "Bustle, \"This Is What The Antifa Flag Symbols Mean,\" Aug. 15, 2017", "C-SPAN, \"House Homeland Security Hearing on National Security Threats,\" Sept. 17, 2020", "Daily Mail, \"'Shields, we got shields!' Video emerges of 'riot supplies' being unloaded from U-Haul truck in Louisville hours before two cops are shot during violent protests,\" Sept. 24, 2020", "David E. Barclay and Eric D. Weitz, \"Between Reform and Revolution: German Socialism and Communism from 1840 to 1990\"", "Email from Laura Silber, chief communications officer for the Open Society Foundations, Sept. 24, 2020", "Email from Camilo Ramirez, director of communications for the Bail Project, Sept. 24, 2020", "Messages from Storyful, Sept. 24, 2020", "Facebook post, Sept. 23, 2020", "Facebook video, Sept. 23, 2020", "Facebook post, Sept. 24, 2020", "First Draft, \"5 Lessons for Reporting in an Age of Disinformation,\" Dec. 27, 2018", "The Gateway Pundit, \"U-Haul Seen Distributing Shields, Potential Weapons to Louisville Rioters Rented to Holly Zoller of Soros-Connected Louisville Bail Project,\" Sept. 23, 2020", "The Hill, \"McCarthy claims protests in Louisville, other cities are 'planned, orchestrated events,’\" Sept. 24, 2020", "Mediaite, \"Fox News Wants to Know Who is Funding This Protester’s $30 U-Haul Rental,\" Sept. 24, 2020", "Message from Brendan Gutenschwager, Sept. 24, 2020", "National File, \"REPORT: Soros-Linked Bail Project Employee Rented U-Haul That Handed Out Shields to Potential Rioters,\" Sept. 23, 2020", "The New York Times, \"Fired Officer Is Indicted in Breonna Taylor Case; Protesters Wanted Stronger Charges,\" Sept. 23, 2020", "The New York Times, \"Breonna Taylor Live Updates: Suspect Charged in Shooting of 2 Officers at Louisville Protests,\" Sept. 24, 2020", "Open Society Foundations, Awarded Grants, accessed Sept. 24, 2020", "Open Society Foundations, Soros Justice Fellowships, accessed Sept. 24, 2020", "Open Society Foundations, United States, accessed Sept. 24, 2020", "Open Society Institute, Full text of \"Full Filing\" for fiscal year ending Dec. 2018", "PolitiFact, \"Ask PolitiFact: What is antifa, and why is it all over my timeline?\" July 2, 2020", "PolitiFact, \"Fact-checking theories about bricks and Black Lives Matter protests,\" June 3, 2020", "PolitiFact, \"Florida congressional candidate blames antifa for violence without evidence,\" June 26, 2020", "PolitiFact, \"No, George Soros and his foundations do not pay people to protest,\" June 1, 2020", "PolitiFact, \"Pants on Fire claim that George Soros money went to Women's March protesters,\" Jan. 25, 2017", "PolitiFact, \"Sen. Amanda Chase spread hoax of deadly antifa riot headed to Chesterfield,\" June 15, 2020", "PolitiFact, \"Suspended Twitter account fans misinformation about antifa, George Floyd protests,\" June 1, 2020", "Sean Hannity, \"CAUGHT RED HANDED: Woman who rented the U-Haul full of weapons in Louisville may have ties to Soros,\" Sept. 24, 2020", "Storyful Newswire, \"Protesters Unload Shields From Storage Truck as Louisville Braces for Riots,\" Sept. 23, 2020", "Tweet, Sept. 23, 2020", "Tweet from Laura Ingraham, Sept. 23, 2020", "Tweet from Sean Hannity, Sept. 24, 2020", "Tweeted video, Sept. 23, 2020", "Tweeted video, Sept. 23, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]