["About this rating", "In February 2017 multiple web outlets covered anti-abortion group Live Action's claims that the Planned Parenthood organization enforces \"abortion quotas\" and distributes awards to staff members for achieving what amounts to abortion-related \"sales goals.\"", "The claims originated with a 7 February 2017 video clip published by Live Action, depicting an interview between the organization's Lila Rose and a woman identified as former Planned Parenthood worker Sue Thayer:", "In the clip, Rose asked Thayer to reiterate claims she had ostensibly made in the past about \"abortion quotas\" before inquiring about \"reports\" that Planned Parenthood employees were rewarded with \"pizza parties\" or paid time off for reaching or exceeding those quotas. A second woman identified as a former Planned Parenthood employee named Marianne Anderson appeared briefly at the end of the segment.", "Thayer's relationship to Planned Parenthood was not discussed in the video beyond a description of her as a former employee. But a Catholic World Report article reported that Thayer maintained anti-abortion views for the entirety of her 17-year employment with the Planned Parenthood organization:", "Sue Thayer worked for a Planned Parenthood clinic in Storm Lake, Iowa for 17 years. She began in 1991 as a family planning assistant, and soon became a manager. She joined Planned Parenthood because she was interested in women’s health care, the pay was good, and it was close to her home.", "Thayer was opposed to abortion, but since it was not performed at her particular clinic, she agreed to work there. However, she had to train at a Des Moines clinic watching a full day of abortions being performed. She said, “It made me want all the more to prevent unplanned pregnancies [through the distribution of contraceptives] ... At nine weeks, the baby is fully formed. He has tiny fingernails and facial features. He’s a human being.”", "According to Planned Parenthood, Thayer unsuccessfully \"led [an] effort\" to prosecute the organization in Iowa in 2011, alleging Medicaid fraud with respect to the dispensing of birth control pills:", "Thayer led a failed effort in 2011 claiming Medicaid fraud at the Iowa affiliate related to birth control pills. In 2011, Thayer filed a lawsuit against Planned Parenthood’s Iowa affiliate “under both federal and Iowa False Claims Acts, alleging that Planned Parenthood knowingly committed Medicaid fraud from 2002 to 2009 by seeking improper and even illegal reimbursements from Iowa Medicaid Enterprise and the Iowa Family Planning Network.” The allegations included that Planned Parenthood submitted “repeated false, fraudulent, and/or ineligible [Medicaid] claims for reimbursements.” Thayer claimed that the affiliate “scammed American taxpayers by filing nearly 500,000 fraudulent Medicaid claims over 10 years, netting the organization an illicit $28 million.” A district court judge dismissed the lawsuit in 2012. In August 2014, U.S. Court of Appeals for the 8th Circuit reinstated Thayer’s “lawsuit against Planned Parenthood of the Heartland.” Later in 2014, the Appeals Court dismissed the case, “finding that [Thayer] failed ‘to provide a single specific example of a particular fraudulent claim Planned Parenthood submitted to the government, let alone any representative examples.’”", "Although John Jarvey, chief federal judge for southern Iowa, dismissed Thayer's whole case in 2012, a federal appeals court in 2014 upheld only a portion of his dismissal and sent the rest of the case back to district court, where Jarvey issued a new ruling rejecting some of her claims while allowing others to proceed:", "For example, the judge dismissed her claim that Planned Parenthood fraudulently billed Medicaid for services for which the agency also received private donations, and for medications for which there was no \"valid patient-practitioner relationship.\" But the judge declined to dismiss Thayer’s claim that Planned Parenthood defrauded Medicaid by billing for birth-control pills that were dispensed before a physician or nurse practitioner had written specific prescriptions for them. He also declined to dismiss Thayer’s claim that Planned Parenthood illegally billed Medicaid for abortion-related services, such as blood tests and office visits for women who had their pregnancies terminated. Federal law bans Medicaid payment for most abortions.", "Like Thayer, Anderson accepted a position at Planned Parenthood despite her reservations about the clinic's operations:", "From early 2010 through July 2012, Anderson was a nurse who, among other duties, dispersed sedatives intravenously to clients at the Planned Parenthood abortion facility in Indianapolis. That center is the state's largest provider of abortions.", "When she started working there, Anderson said she was \"on the fence about abortion.\"", "On 8 February 2017, Lila Rose shared a related item via Facebook (reproduced above) showing an award certificate given to a Colorado Planned Parenthood branch commending Aurora for \"exceeding abortion visits\" in early 2013 over the same period in 2012. The certificate suggests abortion visits are one metric used by Planned Parenthood to gauge clinics' efficacy in dispensing care, but what other metrics Planned Parenthood uses are unknown, and the photograph doesn't document any tangible reward given out beyond the certificate itself.", "Planned Parenthood's archived response to the photograph when it first circulated in July 2014 was to say:", "First, and plainly, Planned Parenthood does not have \"quotas\" for any of our services.", "..., no, we don’t have quotas. And, yes, we absolutely do celebrate our progress in ensuring that more people have access to the full range of reproductive health care, including abortion. And we always will.", "We contacted Planned Parenthood about the claims, and a spokesperson reiterated that Planned Parenthood maintains no \"quotas\" for abortions or any of the other services they provide. Another longtime employee of Planned Parenthood whom we spoke had never heard of abortion quotas throughout the duration of her tenure with the organization.", "UPDATE: 18 February 2017 -- Added notice that, contrary to Planned Parenthood's statement, Sue Thayer's lawsuit against the organization has not been completely dismissed.)", "Berg, Miriam.   \"Setting the Record Straight: Planned Parenthood Expanding Access to Care.\"\r\nPlanned Parenthood Blog.   3 July 2014.", "Graves, Jim.   \"Abortion Insiders Turn Their Backs on the Industry.\"\r\nThe Catholic World Report.   18 January 2013.", "Hoefer, Natalie.   \"Former Planned Parenthood Nurse Calls Abortion Clinic 'Evil, Sad Place.'\"\r\nCatholic News Service.   19 February 2014.", "Leys, Tony.   \"Ex-Planned Parenthood Manager's Lawsuit Moves\r\nAhead.\"\r\nThe Des Moines Register.   22 June 2016.", "Planned Parenthood.   \"GOP Anti-Abortion Political Circus Heads to Judiciary Hearing Today.\"\r\n21 October 2015.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]