["A blog post being shared on Facebook has a headline that contradicts reality in the killing of George Floyd, who died after a Minneapolis police officer pressed his knee into Floyd’s neck on May 25.", "\"Coroner saying George Floyd died of drug overdose, not police brutality,\" the Aug. 27 post says.", "As evidence, it cites comments from Andrew Baker, the chief medical examiner in Hennepin County, who performed an autopsy on Floyd. But Baker didn’t say that Floyd died of a drug overdose.", "The medical examiner’s office ruled that the manner of Floyd’s death was homicide.", "The cause of death, according to the medical examiner, was \"cardiopulmonary arrest complicating law enforcement subdual, restraint, and neck compression.\" The report goes on to say that Floyd \"experienced a cardiopulmonary arrest while being restrained\" by law enforcement officers.", "What that means: Floyd’s heart stopped as Chauvin restrained him.", "This blog post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Here’s what else you should know.", "The county medical examiner noted significant conditions related to Floyd’s death. Arteriosclerotic and hypertensive heart disease, fentanyl intoxication, and recent methamphetamine use.", "Derek Chauvin, the officer who pressed his knee into Floyd’s neck, was fired from the Minneapolis Police Department and he’s been charged with third-degree murder and second-degree manslauter in Floyd’s death.", "Documents filed in that case include handwritten notes from a law enforcement interview with Baker, the medical examiner, a local NBC News affiliate reported on Aug. 26.", "Baker said that Floyd’s toxicology report showed he had a \"fatal level of fentanyl under normal circumstances\" and that \"if he were found dead at home alone and no other apparent causes, this could be acceptable to call an OD.\"", "Baker also said: \"I am not saying this killed him.\"", "Chauvin’s lawyer is asking the judge to drop the charges in the case against the ex-police officer, arguing that Floyd died from a drug overdose and not because Chauvin put his knee on Floyd’s neck.", "But the results of the two autopsies in this case don’t support that.", "One, requested by Floyd’s family, and conducted by two doctors also found that Floyd’s death was a homicide, though it concluded that they thought he died of asphyxia — or suffocation — not cardiopulmonary arrest as the county medical examiner concluded.", "We rate this blog post False.", "Blog post, Aug. 27, 2020", "Hennepin County Medical Examiner’s Office, Press release report: George Perry Floyd, June 1, 2020", "Hennepin County Medical Examiner’s Office, Autopsy report, May 26, 2020", "KARE 11, New court docs say George Floyd had ‘fatal level’ of fentanyl in his system, Aug. 26, 2020", "ABC, Officer charged in George Floyd’s death argues overdose killed him, not knee on neck, Aug. 30, 2020", "The Star Tribune, Hennepin medical examiner classifies George Floyd’s death as ‘homicide,’ June 2, 2020", "The Associated Press, Medical examiner: Floyd’s heart stopped while restrained, June 1, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]