["The photos were shared in this Facebook post published on April 8, 2020. The post has been shared almost 140,000 times.", "The post includes four sets of photo collages. It purports to highlight the comparisons of four locations in the Philippines before and after Duterte’s presidential election victory in May 2016.", "The post's caption states: “Our president is a good leader..”", "The same photos were also shared on Facebook here, and on Twitter here and here alongside a similar claim.", "The photos have been shared in a misleading context.", "The first photo juxtaposition is overlaid with text that reads: “Manila Bay”, referring to a harbour off Manila, the capital of the Philippines.", "The “Before Duterte” photo shows a garbage-filled bay while the “During Duterte” one features a scenic sunset viewed from a clean beach.", "A combined reverse image and keyword searches on Google found both photos were taken during the Duterte administration.", "The purported “Before Duterte” photo was published in this December 2019 report by Philippine newspaper The Philippine Star and described as showing the aftermath of Typhoon Ompong at Manila Bay.", "The typhoon hit the country in September 2018, during Duterte’s presidency.", "Below is a screenshot comparison showing the miscaptioned image (L) and the Philippine Star photo (R):", "The “During Duterte” photo appears in this 2019 report by Philippine news network GMA News about cleanup operations at Manila Bay.", "The second photo collage is described as showing the Pasig River, which runs through the Manila metropolitan areas.", "The photos, however, do not show the Pasig River; instead, they show Estero de Binondo, a creek near Manila’s Chinatown.", "Below is a screenshot comparison of the miscaptioned photos (L and C) and their corresponding location on Google Street View (R):", "The third set of photos compares old Philippine National Railways (PNR) trains, purportedly in operation before Duterte’s presidency, with new trains that were in operation during his administration.", "But the old trains seen in the “Before Duterte” photos remain in operation to date.", "A closer inspection found the train in the top left-hand corner bears the number 919, while the one in the top right is numbered 5001.", "Both are “still operational,” Joseline Geronimo, PNR operations manager, told AFP in a text message on June 4, 2020.", "The “During Duterte” photo previously appeared in this 2019 Jakarta Post report about the delivery of new PNR trains from an Indonesian manufacturer.", "The fourth photo comparison is overlaid with text that states: “Boracay”, which is an island known for its beaches and resorts in central Philippines.", "The purported “Before Duterte” photo of an algae-laced beach was in fact taken while Duterte was in office. The second photo showing a pristine beach has actually circulated in online posts before Duterte was elected president.", "A reverse image search on Google found the first photo published in this report by Philippine media ABS-CBN, which states it was taken on March 22, 2018, during Duterte’s presidency.", "Another reverse image search using TinEye found the “During Duterte” appears uncredited in several web pages before Duterte’s election victory in 2016, for example in 2014 here and in 2015 here.", "Below are two sets of screenshot comparison between the photos in the misleading posts (L) and their corresponding photos traced through reverse image searches (R):", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]