["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Rescuers work at the scene of an Ethiopian Airlines flight crash south of Addis Ababa, Ethiopia. (AP Photo/Mulugeta Ayene)", "Update: President Donald Trump announced March 13 that the United States was grounding Boeing's 737 Max 8 and Max 9 aircraft. Boeing lists three major American airlines that currently use the 737 Max — American (24 planes), Southwest (34 planes) and United (14 planes). The FAA said it made the decision after seeing \"new evidence gathered at the site and analyzed today.\" The United States was the last holdout as other national air safety agencies from China to the European Union moved to ground the plane.", "The crash of an Ethiopian Airlines Boeing 737-Max 8 led several lawmakers to call for the immediate grounding of that plane in the United States. Ethiopian Air Flight 302 disappeared from air controllers’ screens about six minutes after takeoff from Addis Ababa on a flight to Nairobi, Kenya. All 157 passengers died.", "Democratic presidential candidate Elizabeth Warren was among those calling for immediate action.", "\"The United Kingdom, China, Australia, South Korea, Indonesia, Malaysia and others have already grounded the 737 Max,\" Warren said in a March 12 news release. \"The world has now witnessed the second tragic crash of one of these planes in less than six months. The FAA should follow their lead, reverse their decision, and immediately ground this plane in the United States until its safety can be assured. While we do not know the causes of these crashes, serious questions have been raised about whether these planes were pressed into service without additional pilot training in order to save money. The FAA itself has indicated that software updates are likely coming. Any necessary changes must be made before, not after, more flights occur and more lives are potentially endangered.\"", "Warren’s point about the FAA and software bears out.", "On March 11, the Federal Aviation Administration posted an airworthiness notification. While it emphasized that the investigation has just begun, it said it was keeping an eye on \"Boeing’s completion of the flight control system enhancements.\"", "The FAA listed three software elements where it expected changes in what is called the Maneuvering Characteristics Augmentation System. That system activates automatically, mainly during takeoff, when the plane is rising rapidly. (It was built to compensate for larger changes in the aircraft that made it more fuel efficient, but also affected how it handled when its nose is pointed up at a sharp angle.) There is speculation that the automated system contributed to the crash.", "More than keeping an eye on Boeing’s progress, the statement said \"the FAA anticipates mandating these design changes by (airworthiness directive) no later than April 2019.\"", "An airworthiness directive is a big deal. It’s a legally enforceable rule \"to correct an unsafe condition.\"", "\"When the FAA wrote that, it was telling Boeing to make those changes as soon as possible,\" Embry-Riddle Aeronautical University aviation safety professor William Waldock told us.", "Boeing complied. It announced March 11 that it was deploying software changes to the entire 737 Max fleet \"in the coming weeks.\" The changes were underway after the first 737 Max crash in Indonesia in October 2018. Among other things, they will reduce the automated adjustments in the plane’s stabilizers (the moving parts on the tail of the airplane).", "But Waldock underscored that until investigators sift through the data in the Ethiopian Air plane’s black boxes and voice recorders, they won’t know the actual cause of the disaster. It's possible that the software in question was not responsible.", "Warren said the FAA had \"indicated that software changes\" were coming to the Boeing 737 Max 8 fleet. The FAA’s airworthiness notice not only indicated that such changes were on their way, it telegraphed that those modifications would be mandatory by the end of April.", "We rate this statement True.", "Elizabeth Warren, press release, March 12, 2019", "Federal Aviation Administration, Continued Airworthiness Notification to the International Community, March 11, 2019", "Boeing, Boeing Statement on 737 MAX Software Enhancement, March 11, 2019", "The Air Current, What is the Boeing 737 MAX Maneuvering Characteristics Augmentation System?, Nov. 13, 2018", "New York Times, s Europe and Others Ground Boeing 737 Max 8s, U.S. Holds Back, March 12, 2019", "Email interview, William Waldock, professor of aviation safety, Embry-Riddle Aeronautical University, March 12, 2019", "Email interview, Saolini Sharma, spokeswoman, Warren for President, March 12, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]