["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Gov. Rick Perry has talked up his decision to dispatch up to 1,000 National Guard members to the Texas-Mexico border by suggesting people crossing the border are wreaking havoc.", "In a July 23, 2014, interview by Sean Hannity of Fox News, Perry brought up a state tally of non-citizens booked into Texas county jails who, according to the Texas Department of Public Safety, have racked up thousands of criminal charges. The day of the Hannity interview, we rated as Pants on Fire Perry's claim that \"illegal aliens\" had committed over 3,000 homicides in six years; the posted information didn’t support that.", "Beyond crimes, Hannity said to Perry, the more important aspect of actions along the border \"is Yemen, Pakistan, Afghanistan and Syria. They’re catching people from these countries crossing our border.", "\"That concerns me,\" Hannity said. \"That’s a national security issue. Reaction?\"", "\"As we shared with you,\" Perry replied, \"the comptroller of public accounts, Susan Combs, who has a ranch out in far West Texas; on her ranch last week, there were three Ukraine individuals that were apprehended on that ranch. So we’re seeing, obviously, individuals from countries that have strong terrorist ties being apprehended as well as individuals who are committing crimes against the citizens of our state.\"", "Perry’s mention of arrestees from Ukraine, where a Malaysia Airlines passenger plane was shot down near the Ukraine-Russia border on July 17, 2014, and his reference to countries with strong terrorist ties made us wonder.", "We looked into the described arrests before checking the Eastern European country’s terrorist ties.", "Three men from Ukraine", "Chris Bryan, a Combs spokesman, said by phone that according to Combs, several individuals from Ukraine were apprehended on a neighbor’s ranch after likely walking across her ranch. Both spreads are in remote Brewster County, which borders Mexico.", "A June 15, 2014, Facebook post by that county’s sheriff’s office states early that Sunday, Sheriff Ronny Dodson fielded a call from a rancher saying three men, posing as lost hikers and tourists, had walked up to his house and asked to use his phone. According to the post, the men ran off after the rancher offered to call the sheriff.", "The chase was on, according to the post, with two men landing in custody after a \"lengthy search\" and the third man getting pinned in a box canyon. \"It appears that all three individuals had entered into Mexico and crossed the border to gain illegal entry into the United States,\" the office said, adding the men were being held on several state charges.", "A June 16, 2014, news story posted online by Odessa’s CBS 7 quoted Dodson as saying the men were trying to reach a friend staying in Alpine who was supposed to ferry them to Seattle, Wash. \"The officers were not able to apprehend the man who was their getaway,\" the story said.", "The sheriff’s office June 16, 2014, offense report on the arrests, which we obtained via an open-records’ request, said Homeland Security was contacted after it was discovered the men, ranging in age from 26 to 35, were in the country illegally from Ukraine. By phone, Dodson told us one of the men spoke English well and told him the trio hailed from Ukraine. They remain in the county jail, he said, though Brewster County doesn’t plan to press state charges.", "So, Perry was correct that three Ukrainians were arrested on a West Texas ranch, though he had the wrong ranch and his time frame was slightly off.", "Fresh charges, past convictions", "Next, Daryl Fields, a San Antonio-based spokesman for the U.S. Attorney’s office that has jurisdiction over the area, emailed us federal complaints and indictments indicating two of the men were previously deported Ukraine nationals newly indicted for re-entering the country without legal permission: Vadim Odorozhenko and Igor Yaroslavovuch Kotsiuba.", "According to the complaints, each man also had previously been convicted of crimes in the U.S.", "Odorozhenko \"is an aggravated felon by virtue of his convictions for kidnapping, unlawful use of a weapon, and assault in the second degree and assault in the third degree,\" the complaint against him states. Our search using the LexisNexis database yielded indications Odorzhenko drew his convictions and served prison time in Oregon. By telephone, Jessica Freeburn of the Oregon Department of Corrections told us Odorozhenko was in a state prison from mid-August 2005 to Nov. 4, 2011. She said he was then paroled but records indicate he was picked up by immigration officers on Oct. 16, 2012. Separately by email, an ICE spokeswoman, El Paso-based Leticia Zamarripa, citing an \"ongoing investigation,\" declined to say whether he was later deported.", "According to the complaint against Kotsiuba, he \"is an aggravated felon by virtue of his convictions for the distribution of narcotics, assault and burglary.\" A LexisNexis search turned up nothing about him.", "A complaint charging Oleskii Storozhuk, the third alleged border-crosser, with entering the U.S. without legal permission was dropped, Fields said, but he \"remains in custody as a material witness.\" Fields said by phone a fourth man, Igor Davidyuk, was charged with alien smuggling after his arrest in Washington state subsequent to the Texas arrests.", "Ukraine has terrorist ties?", "Ukraine gained its independence in 1991 after which the U.S. established diplomatic relations, according to the State Department. Of late, it’s been roiled by conflict with Russian separatists who want their Russian-speaking provinces to become part of Russia. But Ukraine isn’t among nations the U. S. considers state sponsors of terrorism nor was it listed among countries described by the government in 2013 as terrorist safe havens.", "Texas experts agreed Ukraine lacks terrorist ties.", "By email, Sergiy Kudelia, a Baylor University political scientist, said: \"Generally speaking, there are no organizations or groups operating in Ukraine today that are recognized by the U.S. government (or the European Union) as terrorist organizations.\" After we pointed out a July 21, 2014, news report quoting Ukrainian President Petro Poroshenko as saying he considers the Russian separatists to be terrorists, Kudelia said neither the U.S. or E.U. has embraced that characterization.", "By phone, Texas Tech University political scientist Frank Thames said he doesn’t think Russian separatists \"are particularly interested in sending people to the United States through the southern border. I wouldn’t make that link.\"", "Our ruling", "Perry said three Ukrainians recently captured on a West Texas ranch are among \"individuals from countries that have strong terrorist ties being apprehended\" near the border with Mexico.", "This shakes out as half right. Three men from Ukraine were captured on a West Texas ranch in June 2014 (though Perry had the wrong ranch and his date was off a bit) after allegedly crossing the Rio Grande into Texas.", "However, Ukraine isn’t considered a country with terrorist ties. And while two of the men had prior U.S. criminal records, none has or had been charged with terrorism or related crimes. In contrast, Perry cited their arrests in the context of national security and terrorism.", "We rate this statement as Half True.", "HALF TRUE – The statement is partially accurate but leaves out important details or takes things out of context.", "UPDATE, 3:24 P.M. July 31, 2014: This story was amended to indicate one man was imprisoned in Oregon, not Washington, and to provide additional related detail. These changes didn't affect our rating.", "Telephone interview, Chris Bryan, agency spokesperson, Texas Comptroller of Public Accounts, Austin, July 24, 2014", "Post on Facebook page of Brewster County Sheriff's Office, June 14, 2014 (accessed July 24, 2014)", "News story, \"Three Ukrainian Men Arrested in Brewster County,\" CBS7, Odessa, posted online June 16, 2014 (accessed July 24, 2014)", "Document, \"Offense Report,\" Maverick County Sheriff, June 16, 2014 (received via email from Maverick County Sheriff’s Department July 28, 2014)", "Telephone interview, Ronny Dodson, sheriff, Brewster County, July 25, 2014", "Documents, complaint against Vadim Odorozhenko; complaint against Igor Yaroslavovuch Kotsiuba; complaint against Oleskii Storozhuk (later withdrawn), filed June 17, 2014 before B. Dwight Goains, U.S. Magistrate Judge, Pecos, Texas (obtained from PACER database or provided by email from Daryl Fields, public affairs officer, U.S. Attorney’s Office, San Antonio, July 25, 2014)", "Telephone interview, Jessica Freeburn, administrative support, Oregon Department of Corrections, Salem, July 31, 2014", "Email, Leticia Zamarripa, public affairs officer, Immigration and Customs Enforcement, July 27, 2014", "Telephone interview, Frank C. Thames, associate professor of political science, Texas Tech University, Lubbock, July 28, 2014", "Emails, Sergiy Kudelia, assistant professor of Political Science, Baylor University, July 28, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]