["About this rating", "Most Disney fans have come across rumors about \"disgruntled\" animators supposedly slipping risqué images into some of the studio's classic films. While some of these rumors are based on real events (such as a topless woman briefly visible in VHS copies of The Rescuers), many of these claims are based on nothing more than fleeting and difficult-to-discern imagery or modern digital manipulations.", "In February 2019, we received a question on the Snopes Tips Facebook group about an image that supposedly showed \"not safe for work\" (NSFW) content in the background of a scene from the 1994 Disney animated classic The Lion King. The scene depicts the character of Zazu (a hornbill) flying past sand dunes, and according to some accounts, Disney animators sneakily placed nipples atop two of the dunes to make them resemble human breasts:", "Although this image has been included in a number of listicles such as adult moments you totally missed as a kid, WTF moments in Disney movies, and R-rated Disney Easter eggs, the image is not a genuine still frame taken from the The Lion King. The nipples on these sand dunes are actually a digital alteration made by an outsider.", "This R-rated Disney \"Easter egg\" was created in 2013 for a photoplasty contest hosted by the Cracked website. These \"photoplasty\" contests involve users submitting digitally manipulated images, and here's how the humor website introduced the contest that produced the \"nipple\" sand dunes image (emphasis ours):", "As you probably know by now, there were hidden priest boners and adult words sky written into the Disney movies we grew up on. But we couldn't have caught them all. We asked you to use the magic of image manipulation to create the dirty secrets we could have missed.", "Cracked.com user \"RandomHabit\" employed a still from the musical number \"I Just Can't Wait to Be King\" to create his altered version of a Lion King scene.  We created a GIF of the scene in question to show that none of the sand dunes was adorned with nipples in the original film:", "These innocuous sand dunes can also be glimpsed in a sing-a-long version of \"I Just Can't Wait to Be King\" from the official Disney YouTube channel, at the 50-second mark of the following video:", "Here's a side-by-side comparison of the manipulated image (left) and the original:", "This was not the first fake Disney Easter egg to circulate on social media. We've previously debunked rumors about a silhouette of a sex act in the background of Toy Story 3, a crude drawing in Monsters Inc., and Mickey Mouse's employing an unusual method to make swiss cheese.", "Throwbacks.com.   \"12 \"Adult\" Moments in Classic Disney Movies You Totally Missed as a Kid.\"\r\n    29 January 2018.", "Cracked.   \"17 R-Rated Easter Eggs You Never Noticed in Disney Movies.\"\r\n    25 January 2013.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]