["About this rating", "U.S. President Donald Trump had directed federal agencies to deploy officers in cities including Portland, Oregon, in summer 2020, and at least some of those agents used unmarked vehicles during the security initiative.", "The use of the word \"kidnapping\" alleges that federal agents had committed a crime; however, no court or judge had said that was the case as of this writing. In at least one case, federal officials said they put someone in an unmarked van for questioning because they believed that person had committed a crime.", "While one person said he was detained without officers identifying themselves — and another viral video was interpreted by viewers as a case of the same thing — we have no verifiable evidence to prove or disprove whether agents in those cases explained for what federal agency they worked during the arrests.", "Conner O’Shea told journalists he started running when he saw mysterious, armed people wearing camouflage body armor jump out of an unmarked van as he was walking home from a protest in downtown Portland, Oregon, on July 15, 2020.", "But his friend, Mark Pettibone, 29, was unable to escape the group of people in military fatigues that was later identified as a team of federal law enforcement agents operating under a plan by U.S. President Donald Trump to quell demonstrations against police brutality and racism in cities nationwide.", "According to Pettibone's account of the incident — which was later publicized widely in news outlets ranging from The New York Times to Fox News — the officers tossed him into the van and took him to a federal courthouse. There, he said, they held him in a cell for about 90 minutes without explaining for what crimes he was suspected, nor identifying themselves as law enforcement personnel.", "His alleged experience, as well as reports of viral videos purportedly depicting similar actions on behalf of federal agents in Portland (which we explain below), outraged critics of the Trump administration in July 2020 — including Oregon and Portland officials who said the federal officers and their militarized tactics were not welcome in Portland and violated the rights of citizens.", "Meanwhile, numerous Snopes readers requested an investigation into the legitimacy of such reports. One person wrote: \"Did Trump send cops to Portland and they are kidnapping people in the streets?\"", "Below is everything we know about federal officers' presence in the West Coast city and any evidence regarding the above-mentioned claim. This investigation was completed just as Trump prepared to deploy federal agents working under similar protocols to Chicago and possibly other Democrat-run cities.", "We should say at the onset: Neither the U.S. Department of Justice (DOJ) nor the Department of Homeland Security (DHS) — both of which are overseeing the federal administration's law enforcement strategy in Portland — responded to our inquiries for comment on findings of this report.", "Yes. On June 26, 2020, Trump issued an executive order that directed federal agencies to deploy law enforcement personnel in U.S. cities where people were protesting for the removal of statues and monuments that they believed wrongly celebrated racism in America's history. The push to rid the country of such symbols followed the killing of George Floyd — a Black man who died after a white Minneapolis police officer knelt on his neck for almost nine minutes — one month earlier.", "Although the president's order did not name specific cities for the heightened surveillance, federal agents arrived in metros, including Portland, soon after the president's directive took effect. Then, on July 1, DHS Acting Secretary Chad Wolf — whom Trump appointed to the position in fall 2019 — seemingly codified the president's wishes by launching a new initiative that authorized \"Rapid Deployment Teams\" of federal officers in cities across the country.", "The exact makeup of such teams in Portland was not made clear by the federal government, which added a challenge for our examination into the claim — while one federal agency could have been using unmarked vehicles, another may not have, for instance.", "The DHS oversees numerous law enforcement agencies, including Customs & Border Protection (CBP), Immigration & Customs Enforcement (ICE), and the Federal Protective Service — which aims to protect government buildings. At least one government document said that agency was leading the federal government's response to protests in Portland, and DHS Acting Deputy Secretary Kenneth Cuccinelli told the Washington Post tactical units from ICE and CBP were indeed involved. Other news reports said agents from a group known as BORTAC, the CBP equivalent of a SWAT team that normally investigates drug smuggling crimes, were also deployed.", "Additionally, federal officers in Portland belonged to the DOJ's U.S. Marshals Service, which includes a \"Special Operations Group\" that uses tactical gear and equipment during \"high-risk and sensitive law enforcement situations, national emergencies, civil disorder and natural disasters,\" according to a DOJ fact sheet.", "Also unclear was the scope of the teams' presence in the West Coast city. Portland Mayor Ted Wheeler at one point said he believed the groups of federal officers consisted of \"dozens, if not hundreds\" of officers, and Cuccinelli later told journalists the number \"was somewhere in between\" the \"dozens\" or \"hundreds.\"", "Pettibone's account, of which Oregon Public Broadcasting said it had video evidence to corroborate, was the most widely shared case of the alleged practice in news stories in July 2020.", "He told reporters he had been exercising his First Amendment guarantee of free speech to protest at the time of his arrest and was released from custody without any documentation of or explanation for the encounter. \"They didn't say who they were with,\" Pettibone told a Canadian radio station. \"There were rumors going around among the protesters that this was happening, and no one really understood who they were.\"", "Per our analysis of news coverage, social media posts, and court documents, no one else identified themselves publicly as someone who had undergone the same treatment by federal agents during the Portland protests.", "However, video footage that's been viewed more than 12.6 million times since its posting on July 15, and appeared to be unrelated to Pettibone's experience depicted a similar story: Two agents in camouflaged gear and masks with a generic \"POLICE\" badges across their chests escorted an unidentified man wearing black to an unmarked van. A narrator is heard yelling to the officers, \"Who are you? What are you doing? ...You just violated their rights.\"", "It was unclear what became of that person in the viral video, and the claim that the officers had not identified themselves to them seemed to be based solely on the crowd's interactions with the agents. The person who claimed to have recorded the video later tweeted:", "The person [who was detained] has reached out after seeing the video and are accounted for. The van was later driving around the protest area/officers jumping out and chasing ppl There was talk that a second person was taken. The vans were seen entering the federal building parking.", "That video was shared by journalists and politicians, including Sen. Jeff Merkley, D-Ore., who tweeted: \"Authoritarian governments, not democratic republics, send unmarked authorities after protesters.\"", "While other footage online showed similar-looking officers with guns and generic \"police\" tags patrolling downtown Portland in unmarked vehicles, we found no other widely shared, recorded evidence of agents detaining people and putting them in unmarked vehicles during the demonstrations. That means Pettibone's story and the viral video described above appeared to be the most significant pieces of evidence of the alleged practices on behalf of Trump's administration, though people online speculated the practice was more widespread.", "Next, we considered court and government documents for any proof to determine the validity of the allegations.", "Aiming to stop what she and other critics described as the unlawful detainment of American citizens, Oregon Attorney General Ellen Rosenblum filed a federal lawsuit on July 17, and in the complaint obtained by Snopes, the attorney general said the state had reason to believe Pettibone was not the only person detained by or released from \"anonymous agents\" without any explanation during the protests. The document, however, did not detail nor describe additional cases. It read:", "On information and belief, federal law enforcement officers [...] have been using unmarked vehicles to drive around downtown Portland, detain protesters, and place them into the officers’ unmarked vehicles, removing them from public without either arresting them or stating the basis for an arrest, since at least Tuesday, July 14.", "[...] Pettibone alleges that he was put into a cell and read his Miranda rights, but was not told why he was arrested, nor was he provided with a lawyer. He alleges that he was released without any paperwork, citation, or record of his arrest. [...] Unidentified federal officers [...] have likewise detained other citizens off the Portland streets, without warning or explanation, without a warrant, and without providing any way to determine who is directing this action.", "In the complaint, Rosenblum described the alleged tactics by federal officers as \"kidnapping\" and said the people who had been detained in this way could have reasonably assumed that they were victims of a crime. The actions on behalf of the federal officers, the complaint alleged, were a violation of citizens' First, Fourth, and Fifth amendment rights, among other civil liberties.", "On the same day the lawsuit was filed, U.S. Attorney Billy J. Williams, the DOJ's chief law enforcement official in the state, released a statement in which he called for an inspector general investigation into DHS agents' practices in Portland \"based on news accounts circulating that allege federal law enforcement detained two protestors without probable cause.\" It was not made clear if those protesters included Pettibone and/or the person in the viral video, or if they were separate cases.", "First, let's unpack the claim that the officers did not clearly present themselves, nor show any sign for what federal agency they stand, during the controversial detainments.", "Citing news reports, Rosenblum's complaint alleges the officers who detained Pettibone were CBP agents, though he said they did not identify themselves as such during the encounter. That agency also took responsibility for the apprehension of \"the person in the video\" — suggesting that its officers were the ones seen in the viral footage, even though it did not explicitly make clear to what video, exactly, it was referring. In a statement released July 17, the CBP said:", "CBP agents had information indicating the person in the video was suspected of assaults against federal agents or destruction of federal property. Once CBP agents approached the suspect, a large and violent mob moved towards their location. For everyone’s safety, CBP agents quickly moved the suspect to a safer location for further questioning. The CBP agents identified themselves and were wearing CBP insignia during the encounter. The names of the agents were not displayed due to recent doxing incidents against law enforcement personnel who serve and protect our country.", "Put another way, the CBP disputed assertions that its officers were operating only as unidentified agents and said a person who was detained and seen in a video was suspected of assaulting federal officers or causing property damage. Also, unlike what onlookers claimed, the agency said its officers identified themselves as CBP agents during that incident. Their names, however, were removed from their uniforms to protect their privacy and prevent people from harassing them personally, per the CBP.", "Cuccinelli later told CNN about the incident in question: \"[Officers] identified themselves to the subject they picked up — they did not identify themselves to the crowd.\"", "CBP head Mark Morgan, pushed back on all assertions that agents were not clearly presenting themselves in Portland, as well. In a series of tweets, he said news stories alleging that his agents had no signs of identification or were \"operating in secret\" were false and that officers wore the below-displayed patches to let civilians know who they were.", "He tweeted on July 17:", "Our personnel are clearly marked as federal LEOs & have unique identifiers. You will not see names on their uniforms b/c these same violent criminals use this information to target them & their families, putting both at risk. As Acting Commissioner, I will not let that happen!", "Cuccinelli also told journalists that his officers' uniforms included numbers that can be traced to them in case someone wants to file a complaint against their conduct.", "Badges and name identifiers aside, officers' outfits in Portland and other cities during 2020 protests were criticized among people who believe the camouflage — a design that was adopted by the Army for use in Afghanistan in 2010 and used by the Air Force — too closely resembled military troops, when instead the officers were supposed to serve as civilian law enforcement.", "David Lapan, a former Marine officer who served as DHS spokesman under Trump in 2017, told the Washington Post that officers' use of military garb could confuse how people view the missions of the federal agencies. “The purpose of camouflage is to blend in and not be visible,” he told the news outlet. “As a law enforcement officer, you shouldn’t be blending in. That defeats the purpose.”", "Next, let's lay out federal leaders' response to the assertion that officers were using unmarked vehicles to detain protesters.", "On July 18, 2020, Cuccinelli told NPR journalists that officers in Portland had indeed used unmarked vehicles to pick up people — a practice that he said helps maintain agents' safety. He said the vehicles allow officers to get away from crowds and move detainees to a \"safe location for questioning.\" Cuccinelli said:", "The one instance I'm familiar with, they were, believed they had identified someone who had assaulted officers or ... the federal building there, the courthouse. Upon questioning, they determined they did not have the right person and that person was released. ... And that's standard law enforcement procedure, and it's going to continue as long as the violence continues.", "Cuccinelli has not said how many times federal agents have made similar detainments using unmarked vans, nor under what circumstances officers are authorized to use the vehicles under department policy.", "Asked again about the practice on CNN a few days later, he again defended agency's practices. \"Unmarked police vehicles are so common it's barely worth discussion,\" he said. \"I mean, literally every police department in America has them and uses them; We are no exception.\"", "Under Oregon law, for instance, the state department of transportation can issue registrations for \"undercover vehicles\" to government or law-enforcement agencies if they make such requests.", "In other words, reports that agents under the direction of DHS had used unmarked vehicles during Portland protests were substantiated, though we found no evidence of DOJ marshals also driving the vans in the city.", "To recap, it's accurate to state Trump was responsible for the deployment of federal officers in Portland, and those agents were involved in at least two documented cases in which people were detained via unmarked vehicles (Pettibone's experience and the viral video). However, we could not prove — nor disprove — whether the officers in those cases had detained the suspects without telling the suspects what federal agency they represented. One federal unit, the CBP, pushed back against allegations that its officers were not clearly presenting themselves.", "Despite those complexities, the reports of federal officers detaining people in Portland without explanation spurred outrage from officials in Oregon, as well as the country's leading Democrats. They claimed the militarized tactics were part of an effort by Trump to gain popularity points among his conservative fan base before the 2020 presidential election.", "In a July 18 statement, for instance, U.S. House Speaker Nancy Pelosi and Rep. Earl Blumenauer, D-Ore., perpetuated the rhetoric of the president's harshest critics, saying federal officers were \"kidnapping\" protesters with the \"goal of inflaming tensions for their own gain.\" Referring to the alleged actions of federal officers, several other Democratic members of Congress added in statement a few days later:", "These alarming actions beg a number of serious questions. Was it the intent of the Trump Administration to make it seem as though the U.S. military is being deployed to control a U.S. city? Are they completely ignorant about the optics of the situation?", "We’ve been down this road before. The Trump Administration continues to weaponize federal law enforcement for its own agenda. ... We need to continue to find ways to rein in the Trump Administration’s growing militarization and misuse of federal law enforcement against the American people.", "Meanwhile, the Trump administration and its supporters defended the federal government's response to what they called \"violent anarchists\" in Portland who they believed would help \"destroy our Country as we know it,\" as the president said in a tweet.", "Using tear gas and firing less-than-lethal rounds into crowds of people, the agents' clashes with protesters escalated in mid-July, after an officer with the U.S. Marshals Service threw an impact munition at a 26-year-old man, fracturing his skull and sending him to the hospital. (That incident was also captured on video.)", "Total, federal authorities had made about two dozen arrests in Oregon's largest city as of this writing, not including short-term detainments of people like Pettibone. Oregon Public Broadcasting reported that the detainments were occurring not only near federal property but in other areas of the city, as well, and it was not made clear that all of the people being arrested had committed crimes. The DHS documented its officers' actions in Portland in its own words here, and at one point Wolf said on Twitter:", "Let's get this right. 'Protesters' imply they were peacefully exercising their 1st amendment rights. Instead, DHS officers were assaulted with lasers and frozen water bottles form violent criminals attempting to tear down federal property. 2 officers were injured. Facts matter.", "Which leads us to our final point: the accuracy of the word \"kidnapping\" to describe those detainments is up for a judge to decide; Rosenblum alleges the crime in her complaint. Per U.S. federal law, kidnapping is any instance in which a person or group \"unlawfully seizes, confines, inveigles, decoys, kidnaps, abducts, or carries away and holds for ransom or reward or otherwise any person, except in the case of a minor by the parent thereof,\" and takes the victim to a new location. The federal government is likely to argue officers only arrested people who were suspected of committing crimes and had reason to detain them.", "In sum, we rate this claim a \"Mixture\" of truth, falsehood and unproven information — yes, the president ordered federal officers to Portland during protests in summer 2020, and at least some of those agents used unmarked vehicles, though no verifiable evidence showed they \"kidnapped\" people under the legal definition of the term, nor that they did not identify themselves as law enforcement during the apprehensions.", "U.S. Code.  \"Chapter 55 — Kidnapping.\"\r\n    Accessed 21 July 2020.", "Holland, Steve and Lambert, Lisa.   “Trump To Send Federal Forces To More ‘Democrat’ Cities.”\r\n    Reuters.   20 July 2020.", "Lynch, Sarah N and Doina Chiacu.   “Trump, Portland Mayor Clash Over Causes Of Escalating Unrest.”\r\n    Reuters.    19 July 2020.", "BBC News.   “Portland Protests: All You Need To Know About Trump’s Crackdown.”\r\n    20 July 2020.", "Selsky, Andrew and Gillian Flaccus.   “Oregon Sues Feds Over Portland Protests As Unrest Continues.”\r\n    The Associated Press.   19 July 2020.", "The Associated Press.   “House Leaders ‘Alarmed’ Federal Officers Policing Protests.”\r\n    19 July 2020.", "Flaccus, Gillian.   “Federal Agents, Local Streets: A ‘Red Flag’ In Oregon”.\r\n    The Associated Press.   21 July 2020.", "Forgey, Quint.   “Trump Law Enforcement Officials Brush Off Pleas To Butt Out of Portland.”\r\n    Politico.   20 July 2020.", "Selsky, Andrew.   “Navy Vet Beaten By Federal Agents: ‘They Came Out To Fight.’”\r\n    The Associated Press.   20 July 2020.", "Selsky, Andrew and Gillian Flaccus.   “Mayor Of Portland To Trump: Get Your Troops Out Of The City.”\r\n    The Associated Press.   18 July 2020.", "Flaccus, Gillian.   “Far-Right And Antifa Groups Both Claim Victory At Portland.”\n   The Associated Press.   18 July 2020.", "Lang, Marissa J., et. al.   “Federal Officials Dismiss Portland Leaders’ Calls To Leave City As Clashes With Protesters Continue.”\n   The Washington Post.   19 July 2020.", "The Associated Press.   “Federal Agents Asked To Leave As Portland Protests Continue.”\n   20 July 2020.", "NPR.   “Federal Officers Could Expand Beyond Portland; Trump Searches For Campaign Strategy.”\n   20 July 2020.", "The Associated Press.   “Federal Officers Use Gas To Clear Protesters In Portland.”\n   17 July 2020.", "Johnson, Jake.   “Secret Federal Police Deployed By Trump Snatch Protesters Off Portland Streets.”\n   Truthout.   17 July 2020.", "Weber, Peter.   “Unidentified Federal Agents In Camp And Rented Minivans Are Grabbing People Off Portland’s Streets.”\n   The Week.   17 July 2020.", "Heer, Jeet.   “Trump Unleashes His Secret Police In Portland.”\n   The Nation.   17 July 2020.", "Klippenstein, Ken.   “The Border Patrol Was Responsible For An Arrest In Portland.”\n   The Nation.   17 July 2020.", "Levin son, Jonathan and Wilson, Conrad.    “Federal Law Enforcement Use Unmarked Vehicles To Grab Protesters Off Portland Streets.”\n   Oregon Public Broadcasting.   16 July 2020.", "NPR.   “Federal Officers Use Unmarked Vehicles to Grab People In Portland, DHS Confirms.”\n   17 July 2020.", "McEvoy, Jemima.   “Trump-Ordered Federal Agents Are Reportedly Pulling Protesters Into Unmarked Vehicles, Drawing Outrage.”\n   Forbes.   17 July 2020.", "Shepherd, Katie and Berman, Mark.   “‘It Was Like Being Preyed Upon’: Portland Protesters Say Federal Officers In Unmarked Vans Are Detaining Them.”\n   The Washington Post.   17 July 2020.", "Homeland Security.   “Acting Secretary Wolf Condemns The Rampant Long-Lasting Violence In Portland.”\n   16 July 2020.", "Wong, Peter.   “Merkley: Federal Presence At Protests Making ‘Situation Worse.’”\n   Portland Tribune.   16 July 2020.", "Edwards, David.   “Columbus ‘Paramilitary’ Police With Assault Weapons Jump Out Of Unmarked Vans To Abduct Protester.”\n   RAWSTORY.   25 June 2020.", "Schwartz, Rafi.   “In Portland, Federal Agents Are Reportedly Tossing Protesters In Unmarked Vans.”\n   Mic.    17 July 2020.", "White House.   “Remarks By President Trump In A Roundtable With Stakeholders Positively Impacted By Law Enforcement.”\n   13 July 2020.", "Chad F. Wolf.   “Homeland Security.”\r\n   21 July 2020.", "Nguyen, Ryan.   “Police Shoot Portland Protester In Head With Impact Weapon, Causing Severe Injuries.”\n   The Oregonian.   12 July 2020.", "Elfrink, Tim.   “Federal Officers Severely Wounded A Portland Protester. Local Leaders Blame Trump.”\n   The Washington Post.   13 July 2020.", "Olmos, Sergio, et. al.   “Federal Agents Unleash Militarized Crackdown on Portland.”\n   The New York Times.   17 July 2020.", "Jessica Lee is Snopes' Senior Assignments Editor with expertise in investigative storytelling, media literacy advocacy and digital audience engagement.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]