["About this rating", "U.S. Immigration and Customs Enforcement confirmed to Snopes that $86.9 million would be spent over a period of six months to house migrant families who cross the U.S.-Mexico border into the United States. Migrant families were similarly housed in U.S. hotels under the Obama and Trump administrations.", "On March 22, 2021, readers inquired about a claim involving the housing of immigrants who cross the U.S.-Mexico border. One reader asked: \"Is it true that Biden is spending 86 million dollars for hotels for illegal immigrants?\" Another framed the question this way: \"Biden is spending $86 million on hotel rooms for migrants as his administration struggles to handle the surge of families and kids trying to come to the US?\"", "We reached out to the U.S. Department of Homeland Security to receive independent confirmation on the claims.", "They confirmed that the news was true and provided a statement from U.S. Immigration and Customs Enforcement (ICE) Acting Director Tae D. Johnson:", "U.S. Immigration and Customs Enforcement (ICE) has signed a short-term contract with the non-profit division of Endeavors to provide temporary shelter and processing services for families who have not been expelled and are therefore placed in immigration proceedings for their removal from the United States.", "The $86.9 million contract provides 1,239 beds and other necessary services. The families will receive a comprehensive health assessment that includes COVID-19 testing.", "Our border is not open. The majority of individuals continue to be expelled under the Centers for Disease Control's public health authority.", "ICE also provided a more detailed description regarding the procedures for housed families:", "ICE will apply its Family Residential Standards as its quality of care model for all of those housed at a family residential center or contracted shelter, with modifications to educational services at both and limited recreational facilities at the hotels. Families will be provided clothing, meals/snacks, access to medical care, legal counsel, unlimited phone access, and individual rooms for appropriate physical distancing.", "All families will receive a comprehensive health assessment to include COVID-19 testing. ICE will continue to coordinate with non-governmental organizations to provide families with temporary shelter upon their release, as well as food, water, clothing, and transportation services to help mitigate strains placed on resources in the local community.", "The news about the Biden administration's $86 million contract to house migrant families was first reported by Axios on March 20.", "The story said the contract covered a period of six months, and the hotels would be \"near border areas, including in Arizona and Texas.\" The article also mentioned rising numbers of individuals crossing the border into the United States.", "In Aug. 2020, The New York Times reported that migrant families were also housed in U.S. hotels during former President Donald Trump's administration:", "The federal Immigration and Customs Enforcement agency has detained at least 860 migrants at a Quality Suites in San Diego; Hampton Inns in Phoenix and in McAllen and El Paso, Texas; a Comfort Suites Hotel in Miami; a Best Western in Los Angeles; and an Econo Lodge in Seattle.", "In the 2020 fiscal year, at least 900 people have been held by ICE in hotels, which are not subject to the same health and safety guidelines as federal detention centers.", "Before Trump, former President Barack Obama's administration also housed migrants in \"converted hotels.\"", "Endeavors, the nonprofit organization handling the management of the $86 million contract under Biden, is based in San Antonio, Texas. The website for Endeavors described the services offered to migrants in need:", "Seeking protection from the persecution and deteriorating social and economic conditions in their home countries, increasing amounts of migrant children and families have traveled to the United States hoping to make better lives for themselves.", "Through our Migrant Services programs, we provide direct care, migrant wellness support, case management, home study and post-release services, staffing, and holistic programming for unaccompanied migrant children and families. Endeavors has served migrants since 2012.", "In sum, it was true that the Biden administration spent $86 million on hotels and other services that would be used for migrant families. The money was expected to fund services for six months.", "Jordan Liles is a Senior Reporter who has been with Snopes since 2016.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]