["The image was published here on Facebook on August 27, 2020. It has been shared more than 600 times.", "The post’s traditional Chinese-language caption translates to English as: “It all started with the ‘anti-extradition bill protest’, but ended with ‘protester automatically turning themselves in’... Huh? So if there’s no extradition bill, where should this trial be held?”", "The post refers to China’s arrest of a dozen people fleeing Hong Kong on a boat bound for Taiwan, including Hong Kong pro-democracy activist Andy Li, as reported here by AFP on August 28, 2020.", "Comments from some Facebook users on the misleading post suggested they believed the image shows the arrests.", "One commenter wrote: “Never seen pro-democratic people in Hong Kong obeying to law enforcement”.", "Another Facebook user commented: “Actually they want to tell Hongkongers not to oppose and just simply turn themselves in”.", "The photo was shared alongside a similar claim here, here, here, here, here, here, here, here on Facebook, the image was also used as a thumbnail of a video here on YouTube.", "The claim, however, is misleading.", "A reverse image search on Google found an identical image published in this August 1, 2020 report by a Chinese state media organisation Xin Kuai Bao.", "It is headlined: “Guangdong Coast police carrying out law enforcement inspections and seized 11 motorboats”.", "The article reads in part: “At around 5am, a group of suspicious ships were found near the Hong Kong waters. After the targets were locked, law enforcement officers accelerated their approach and boarded for inspection Other nearby ships began to flee after spotting the maritime police law enforcement officers. Some even rammed the maritime police law enforcement motorboats.", "“The maritime police law enforcement officers resolutely adopted methods such as oblique interception; launching shock bombs; and forcibly jumping to control the suspected ship. In the end, a total of 11 illegally modified high-horsepower speed boats were seized and 26 suspects who were suspected of driving the ship without a license were taken away.”", "Below is a screenshot comparison of the photo in the misleading post (L) and the photo in the Xin Kuai Bao report (R):", "The arrests were also reported by other Chinese news organisations on August 1, 2020, including CCTV here, and YCWB here.", "The misleading post was also debunked on August 28, 2020 by Hong Kong-based fact-check page Kauyim on Facebook here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]