["The claim was posted by a New Zealand-based Facebook user here on February 16, 2021.", "The post contains a screenshot showing a tweet published in January 2021 by a UK-based Twitter user here.", "The post's caption reads: “The Government have blocked Office of National Statistics [sic] from issuing data on how many people have died after receiving vaccination and how many have had side effects following vaccination. Think it’s about the virus? think again…”", "The “Office of National Statistics” is a reference to the Office for National Statistics (ONS), the UK government’s official statistical institute.", "The image of the tweet was also shared hundreds of times on Facebook here, here, here and here alongside a similar claim.", "The claim, however, is missing context.", "The UK's Medicines and Healthcare products Regulatory Agency -- not the ONS -- is responsible for publishing data on adverse reactions to Covid-19 vaccinations, the UK’s Department of Health and Social Care (DHSC) told AFP.", "“The ONS wouldn’t publish that data because it’s published by the regulator the MHRA,” a spokesperson told AFP by email on February 23.", "They added that the claim made in the tweet is “completely inaccurate”.", "The MHRA, which regulates medicine and medical devices in the UK, publishes publicly available reports here on adverse reactions to Covid-19 vaccinations.", "The reports use data collected by the Yellow Card System, which allows patients who receive vaccines and doctors who administer them to report suspected side effects.", "As of February 24, 2021, the MHRA’s latest report, which analyzes tens of thousands of Yellow Cards submitted from December 9, 2020 to February 7, 2021, notes there have been over 300 deaths that occurred following Covid-19 vaccinations.", "The report also added, however, “review of individual reports and patterns of reporting does not suggest the vaccine played a role in the death[s]” and stated the deaths consisted “mostly in the elderly”.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]