["“Meet this active CPM cadre Vallabh Das from Trivandrum. He’s not even recruited in Kerala Police, still this goon was in Police uniform trying to attack innocent #Ayyappa devotees at #Shabarimalai protest during the past five days..😡 @rsprasad” A photograph of a person in a police uniform is being circulated on social media, with the claim that the person is a CPI(M) party member masquerading as a cop, who had assaulted devotees of lord Ayappa who had gathered during the Sabarimala protests that had rocked the state ever since the Supreme Court verdict allowing women entry into the temple.", "The above tweet on October 24 by a social media user Sanjib Ghosh has been retweeted close to 2000 times. According to these tweets, the person in the picture is Vallabh Das, a CPM worker. Some users raised suspicion over the person’s hairstyle, claiming that police personnel cannot have this type of hairdo.", "The above tweet by J.Nandakumar, an RSS leader was retweeted almost 2700 times. Numerous Twitter users have tweeted this photograph along with identical text.", "The person seen in the photograph claimed to be a CPM worker dressed as a policeman, is indeed a policeman and not a political worker. This has been confirmed by the Kerala police via a Facebook post clarifying that the person in question is a policeman with the KAP fifth battalion stationed at Sabarimala. Kerala police has appealed to social media users to beware of fake propaganda.", "പോലീസ് ഉദ്യോഗസ്ഥർക്കെതിരെ വ്യാജപ്രചരണം ഞങ്ങൾക്ക് പറയാനുള്ളത് :", "ശബരിമല വിഷയവുമായി ബന്ധപ്പെട്ട് ഡ്യൂട്ടിയിലുണ്ടായിരുന്ന…", "Posted by Kerala Police on Thursday, October 25, 2018", "Posted below are some photographs of the police personnel, who has been identified as Aashiq.", "Sabarimala has become a flashpoint ever since the Supreme Court verdict directing the temple authorities to allow women entry into the temple. The issue has taken a political turn, particularly on social media, with the Kerala government and the police being targeted through the use of old and/or unrelated images and false claims.", "Donate Now", "Arjun Sidharth is a writer with Alt News. He has previously worked in the television news industry, where he managed news bulletins and breaking news scenarios, apart from scripting numerous prime time television stories. He has also been actively involved with various freelance projects. Sidharth has studied economics, political science, international relations and journalism. He has a keen interest in books, movies, music, sports, politics, foreign policy, history and economics. His hobbies include reading, watching movies and indoor gaming.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]