["About this rating", "It's something of an election year tradition for dark conspiracy theories to circulate during the waning months of the U.S. presidential campaign, with rumor-mongers warning of an imminent military takeover by the power-hungry incumbent (regardless of which party that incumbent represents). In August 2016, after a round of the usual false rumors about the President surreptitiously granting himself  \"unprecedented powers\" via executive order, etc., a JPEG image popped up on social media purporting to be a scan of a U.S. Army memorandum announcing that training and preparation for martial law would begin on 8 September 2016 at Fort Carson, Colorado.", "Albeit riddled with misspellings and grammatical errors — not to mention the nonsensical claim that \"the Bill for the Executive Order Enacting Martial Law has been put into effect\" — the document instantly went viral and was shared on conspiracy web sites such as Red Flag News, and via YouTube in videos like this one:", "However, given that examples of unclassified U.S. Army memorandums are plentiful online, the document would have been very easy to fake — and, in fact, it was faked. When we queried officials at Fort Carson about the memo on 22 August 2016, we received the following response:", "The Facebook posting showing what appears to be an official 4th Infantry Division memo stating that Fort Carson is starting martial law training is a complete fabrication.  There is no training being conducted on Fort Carson concerning any type of martial law preparation. The Posse Comitatus Act forbids military involvement in domestic law enforcement without congressional approval.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]