["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A 1937 cartoon from the Waterbury (Conn.) Republican mocks President Franklin Roosevelt's court-packing plan.", "In the Rose Garden on June 4, 2013, President Barack Obama named three nominees to the U.S. Court of Appeals for the D.C. Circuit, a pivotal moment in a long-simmering partisan fight over the nation’s second-most influential court.", "That prompted Republican lawmakers to sharpen their rhetoric, accusing Obama of trying to \"pack\" the court -- a phrase that invokes the 1937 proposal by President Franklin D. Roosevelt to increase the size of the Supreme Court by as many as five justices.", "It’s no small charge: FDR’s scheme was seen, then and now, as a naked power grab. By proposing to sidestep a court that had blocked much of his New Deal agenda, Roosevelt alienated many Americans, and the plan ended up in history’s dustbin.", "Court packing \"had always had a bad name, but Roosevelt’s proposal was such a fiasco that no subsequent president has even seen it as an option open to them,\" said Jeff Shesol, author of Supreme Power: Franklin Roosevelt vs. The Supreme Court and a speechwriter for President Bill Clinton.", "Several senators, including Minority Leader Mitch McConnell and Mike Lee, R-Utah, have recently made the \"packing\" charge.", "In a May 16 hearing, the ranking Republican on the Senate Judiciary Committee, Chuck Grassley of Iowa, used a variation of the word \"pack\" no fewer than six times. He repeated the charge in a news release on the eve of Obama’s announcement: \"It’s hard to imagine the rationale for nominating three judges at once for this court given the many vacant emergency seats across the country, unless your goal is to pack the court to advance a certain policy agenda.\"", "Superficially, Obama’s actions don’t seem to mirror FDR’s, since Obama is seeking to fill existing vacancies, rather than creating new seats he can fill. But do the Republicans have a point?", "What’s the definition of \"court packing\"?", "Most historians and legal scholars offer similar definitions of \"court packing.\"", "Burt Solomon, author of FDR v. The Constitution: The Court-Packing Fight and the Triumph of Democracy, called it an effort to \"expand the size of the court\" to stack it with supporters. Kermit Roosevelt, a University of Pennsylvania law professor, agreed, saying it \"indicates a departure from the ordinary process.\" (Roosevelt is the great-great-grandson of President Theodore Roosevelt and a distant relative of FDR.)", "And Carl Tobias, a University of Richmond law professor, called it a \"manipulation of court membership to achieve certain substantive results in cases the court will decide.\"", "Historical examples of court packing", "The highest-profile examples have come at the Supreme Court level.", "The Constitution doesn’t specify the number of Supreme Court seats. Starting at six in 1789, it briefly fell to five in 1801 before returning to six in 1802. It rose to seven in 1807 and nine in 1837. It rose to 10 in 1863, then shrunk to seven in 1866 before stabilizing at nine in 1869.", "These changes weren’t necessarily nefarious. Initially, the nation was growing geographically, which required more justices, and the increase in 1863 can be explained by the Civil War, which left the court with several justices from states in rebellion.", "We found three pretty clear historical examples in which one branch of government sought to change the makeup of the courts for political reasons.", "• The \"midnight judges.\" In 1801, following a contentious election, the lame-duck Federalist administration of President John Adams sought to stymie the incoming Democratic-Republicans of President Thomas Jefferson by adding six new federal circuits with 16 judges, all appointed by Adams. The last-minute appointees came to be known as \"midnight judges.\" The Jeffersonians sought to abolish the new courts, and in 1803, the Supreme Court upheld their right to do so in Stuart vs. Laird.", "• The post-Civil War era. After President Abraham Lincoln’s assassination, a southerner, Andrew Johnson, was elevated to president. After clashing with the Republicans who controlled Congress, they shrunk the Supreme Court from 10 seats to seven, effectively denying Johnson any appointments. After Johnson was succeeded by victorious Union Gen. Ulysses S. Grant, Congress restored the Supreme Court to nine justices. It has not varied since.", "• The third example, as we’ve noted, is Roosevelt’s doomed 1937 proposal.", "The Republicans’ arguments", "A spokeswoman for Grassley argued that, \"just as FDR did, Obama is trying to influence the courts because neither president liked being overturned. The president and Senate Democrats have made that clear in their comments.\"", "Republican lawmakers make two main arguments.", "• The court is under-worked, so Obama is trying to fill unneeded seats with Democrats. \"It is evident that the D.C. Circuit is the least busy court\" in the nation, Grassley said at the May 16 hearing. \"In fact, it ranks last or almost last in nearly every category that measures the workload of the courts.\"", "In fact, Grassley has introduced the Court Efficiency Act of 2013, which would, among other things, reduce the number of D.C. Circuit judges from 11 to eight.", "Grassley’s proposal is \"understandable,\" said Ilya Shapiro, a legal scholar at the libertarian Cato Institute. \"The court isn’t overworked, the openings are there because of filibusters of Bush nominees, and Obama’s had five years to nominate people and hasn’t,\" he said. \"There are lots of overworked courts out there to which these three slots could go, but he wouldn’t be making it if Obama weren’t making his political play.\"", "• Senate Democrats are threatening a structural change that would affect judicial nominations. In the Senate, a single lawmaker can hold up Senate business unless supporters can muster a 60-vote majority. Over the years, due to actions by senators from both parties, such blocking tactics have become increasingly common.", "Frustrated by this trend, recent Senate majorities from both parties have considered invoking the \"nuclear option\" -- a procedural move that would allow a minority blockage to be overcome with just 51 votes.", "In 2005, a bipartisan group of 14 senators successfully headed off a Republican attempt to invoke the nuclear option by pledging not to support judicial filibusters. Now, the tables have turned: Senate Majority Leader Harry Reid, D-Nev. has threatened the nuclear option to combat Republican opposition to Obama’s nominees.", "The Democrats’ arguments", "Democrats challenge both arguments. In his Rose Garden announcement, Obama cited an April report by the Judicial Conference of the United States, a nonpartisan body headed by Chief Justice John Roberts, which told Congress that the circuit should remain at 11 judges. Court observers add that caseload counts don’t account for the complexity of the circuit’s cases.", "Meanwhile, Democrats say they have been driven to consider the nuclear option by strenuous GOP obstructionism. Obama said on June 4 that his judicial nominees \"have waited three times longer to receive confirmation votes than those of my Republican predecessor\" and added that he had to withdraw the nomination of Caitlin Halligan for a D.C. Circuit vacancy earlier this year after waiting fruitlessly for confirmation since September 2010.", "\"I recognize that neither party has a perfect track record here,\" Obama said. But calling the present deadlock \"unprecedented,\" he added, \"For the good of the American people, it has to stop.\"", "Who has the better of the arguments?", "Our experts agreed that Obama is trying to put his imprint on the court -- but they said he’s doing so within the bounds of his constitutional duty to fill court vacancies. Ironically, the experts said, Grassley’s bill comes closer to the kind of structural meddling typical of court packing than does Obama’s approach, even if Grassley’s bill would result in a shrinkage.", "The experts agreed with Grassley that judicial resources could be better allocated, but they added that this question is better addressed by a more politically insulated entity such as the Judicial Conference of the United States.", "Arguing for efficiency wasn’t enough to shield FDR from backlash, Shesol said. \"Everybody knew the game,\" Shesol said. \"The fact that he was dishonest about it was what really hurt him.\"", "The nuclear option would be a structural change, but one focused more narrowly on one branch’s procedures. This keeps the argument from being a slam dunk -- and it hasn’t happened yet", "\"If the Democrats eliminate the filibuster, I would call that hardball,\" Roosevelt said. \"But it’s a change to the Senate rules, so it’s not an attack on the integrity and independence of the judiciary in the way that court-packing is. It’s also something that the other side can benefit from later, which neither packing nor shrinking really is.\"", "Our ruling", "The claim that Obama is \"packing\" the D.C. Circuit Court largely runs counter to American legal and political history.", "Genuine court packing has involved one branch of government proposing to change the structure of the courts, either expanding or decreasing the number of judges. That's not what Obama's doing.  We rate the claim False.", "Chuck Grassley, \"Grassley Reacts to News Reports that Say President Obama will Nominate Three for DC Circuit,\" June 3, 2013", "Chuck Grassley, remarks at a hearing of the Senate Judiciary Committee, May 16, 2013", "Mitch McConnell, Senate floor speech, May 22, 2013", "White House, remarks by the president on nominations to the U.S. Court of Appeals for the District of Columbia Circuit, June 4, 2013", "Text of the Court Efficiency Act of 2013", "Judicial Conference of the United States, letter to Senate Judiciary Chairman Patrick Leahy, April 5, 2013", "U.S. Supreme Court, Stuart vs. Laird (1803)", "U.S. Supreme Court, FAQ page, accessed June 4, 2013", "Abraham Lincoln Online, \"Abraham Lincoln's Supreme Court,\" accessed June 4, 2013", "NPR, \"Senators Tussle Over Proposal To 'Unpack' Key D.C. Court,\" May 29, 2013", "NPR, \"Sen. Reid Threatens Nuclear Option To Confirm Nominees,\" May 28, 2013", "The Hill, \"McConnell: Dems are trying to ‘stack the court’ with D.C. Circuit nominee,\" May 22, 2013", "Washington Post, \"Obama to name two female lawyers and an African American federal judge to U.S. appeals court in District of Columbia,\" June 4, 2013", "Huffington Post, \"Republicans Charge Obama With Court-Packing For Trying To Fill Empty Seats,\" May 28, 2013", "PBS, \"The American Experience: FDR,\" accessed June 4, 2013", "CNSNews.com, \"Schumer On Judicial Appointees: We Will Change the Rules to ‘Fill up The DC Circuit,'\" March 20, 2013", "Interview with Jeff Shesol, author of Supreme Power: Franklin Roosevelt vs. The Supreme Court, June 4, 2013", "Email interview with Burt Solomon, author of FDR v. The Constitution: The Court-Packing Fight and the Triumph of Democracy, June 4, 2013", "Email interview with Ilya Shapiro, senior fellow in constitutional studies at the Cato Institute, June 3, 2013", "Email interview with Stephen B. Presser, professor of legal history at Northwestern University School of Law, June 3, 2013", "Email interview with Kermit Roosevelt, law professor at the University of Pennsylvania, June 3, 2013", "Email interview with Carl Tobias, law professor at the University of Richmond, June 3, 2013", "Interview with Barbara A. Perry, senior fellow at the University of Virginia’s Miller Center, June 3, 2013", "Interview with Paul Finkelman, law professor at Albany Law School, June 3, 2013", "Email interview with Beth Levine, spokeswoman for Chuck Grassley, June 4, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]