["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A photo of a young girl dressed in Ku Klux Klan attire purported to be Sarah Huckabee Sanders is making the rounds on Facebook. Don’t believe it.", "The photo was posted on the Facebook page Wake Up America and has over 2,700 shares. Red text on the photo purports it is Huckabee Sanders in Little Rock, Ark., on Halloween 1993. But it’s not. A reader asked us to look into the post to verify its accuracy.", "The photo shows a child who appears to be younger than Huckabee Sanders; she would have been 11. The person in the photo also does not resemble known childhood photos of Huckabee Sanders.", "More importantly, this photo already has been discredited on Snopes after it appeared on the satirical site FreeWoodPost.com in August 2012.", "A sloppily photoshopped Chick-fil-A sign had then been layered over the picture.", "That image accompanied a fake news story that purported Dan Cathy, the company’s president, had called for a racist controversy to stir up sales. The post followed news that counter-protests to Cathy’s opposition to gay marriage had caused a record spike in sales.", "\"Let’s milk this for all its worth,\" the fake news story credited Cathy as saying. \"Let’s wait until this gay thing dies down a little, then I will release another statement that says that we don’t like blacks either.\"", "Cathy confirmed to Snopes the marketing ploy was fake.", "We found versions of this same image appearing as far back as 2008, including on a Russian blog dezinfo.net. The Russian blog says the photos are part of a story of a woman who has been sewing KKK uniforms \"for many years.\"", "That appears to track back to a Mother Jones photo essay of \"Ms. Ruth,\" who reportedly \"sews hoods and robes for Klan members seven days a week, blessing each one when it’s done.\"", "The photo essay, by New York photojournalist Anthony Karen, includes a photo of the same child. We took a screengrab below.", "The Facebook page manager told us they didn't know the image was fake.", "An image circulating on Facebook purports to show White House Press Secretary Sarah Huckabee Sanders dressed in a Klu Klux Klan robe.", "A Facebook caption to the newly surfaced image said, \"The problem is not whether this photo is real or not -- it's that no one would be surprised in the slightest if it IS real.\"", "It’s definitely not. We rate it Pants on Fire!", "Facebook, Wake Up America, Oct. 22, 2017", "Snopes, Chick-fil-A President Dan Cathy Said 'We Don't Like the Blacks Either'?, Nov. 9, 2013", "Free Wood Post, Chick-fil-A President Dan Cathy – \"We Don’t Like The Blacks Either, Aug. 11, 2012", "OBU.edu, Mike Huckabee Biography, accessed Oct. 23, 2017", "Tweet, Julius Irvington, Jan. 13, 2015", "Mother Jones, Aryan Outfitters, April 2008", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]