["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "The indictments of 13 Russians detailing how they used Facebook and Twitter to undercut Hillary Clinton and promote President Donald Trump spurred a flurry of tweets from Trump over the weekend.", "\"I never said Russia did not meddle in the election,\" Trump wrote Feb. 18. \"I said ‘it may be Russia, or China or another country or group, or it may be a 400 pound genius sitting in bed and playing with his computer.’ The Russian ‘hoax’ was that the Trump campaign colluded with Russia - it never did!\"", "I never said Russia did not meddle in the election, I said “it may be Russia, or China or another country or group, or it may be a 400 pound genius sitting in bed and playing with his computer.” The Russian “hoax” was that the Trump campaign colluded with Russia - it never did!", "Trump might want to focus on collusion, but his blanket denial that he ever questioned Russian meddling runs up against his own words.", "Early on, Trump treated any mention of Russian interference as an attack on the legitimacy of his victory.", "In a May 2017 interview with NBC’s Lester Holt, Trump said \"this Russia thing with Trump and Russia is a made-up story.\" Trump continued in that interview to say, \"It's an excuse by the Democrats for having lost an election that they should've won.\"", "That statement earned him PolitiFact’s 2017 Lie of the Year.", "In September 2017, when reports of Russian-backed Facebook ads came out, Trump tweeted, \"The Russia hoax continues, now it's ads on Facebook. What about the totally biased and dishonest Media coverage in favor of Crooked Hillary?\"", "The Russia hoax continues, now it's ads on Facebook. What about the totally biased and dishonest Media coverage in favor of Crooked Hillary?", "When the Washington Post reported in December 2016 that the CIA had concluded that the Russians wanted to boost Trump’s chances, Trump rejected it.", "\"We had a massive landslide victory, as you know, in the Electoral College,\" he said on Fox News Sunday on Dec. 11, 2016. \"I guess the final numbers are now at 306. She’s down to a very low number. No, I don’t believe that at all.\"", "In a December 2016 interview with Time, Trump said two things: He didn’t think Russia meddled, and that it might have.", "\"I don’t believe they interfered,\" Trump said. \"That became a laughing point, not a talking point, a laughing point. Any time I do something, they say ‘oh, Russia interfered.’\"", "But a moment later he said, \"I believe that it could have been Russia and it could have been any one of many other people. Sources or even individuals.\"", "During an overseas trip to Asia in November 2017, Trump spoke of his meeting with Russian President Vladimir Putin. A reporter asked how Trump brought up the issue of Russian meddling in the U.S. election.", "\"Every time he sees me, he says, ‘I didn't do that,’ \" Trump said. \"And I really believe that when he tells me that, he means it.\"", "Asked again if he believed Putin, Trump called several top U.S. intelligence officials \"political hacks,\" and argued that other matters were more important.", "\"You have President Putin very strongly, vehemently says he had nothing to do with that,\" Trump said. \"Now, you’re not going to get into an argument. You’re going to start talking about Syria and the Ukraine.\"", "So there are any number of occasions when Trump has denied Russian meddling across the board. But at other moments, he has acknowledged that it is possible.", "In the same interview with NBC’s Holt where he called the Russian thing \"a made-up story,\" Trump also suggested that Russia might try to shape U.S. elections.", "\"If Russia or anybody else is trying to interfere with our elections, I think it’s a horrible thing and I want to get to the bottom of it,\" Trump said. \"And I want to make sure it will never, ever happen.\"", "At a January 2017 news conference, he said he thought Russia did hack into the DNC, but he blurred the picture.", "\"As far as hacking, I think it was Russia,\" he said. \"But I think we also get hacked by other countries and other people.\"", "Pressed on his apparent acceptance of the intelligence agencies’ findings, Trump backpedaled.", "\"All right, but you know what, it could have been others also,\" Trump said.", "Trump said that he \"never said that Russia did not meddle in the election.\"", "In reality, he called the matter a \"made-up story,\" and a \"hoax.\" He has said that he believes Russian President Putin’s denial of any Russian involvement. He told Time, \"I don’t believe they (Russia) interfered.\"", "Even when he has acknowledged the possibility that the Russians interfered, he has added that it could have been other countries or even individuals.", "Trump’s denial doesn’t match what he has actually said.", "We rate this claim Pants on Fire!", "Donald Trump, tweet, Feb. 18, 2018", "PolitiFact, 2017 Lie of the Year: Russian election interference is a 'made-up story', Dec. 12, 2017", "NBC News, Watch Lester Holt's Extended Interview With President Trump, May 11, 2017", "The White House, Remarks by President Trump in Press Gaggle Aboard Air Force One en route Hanoi, Vietnam, Nov. 11, 2017", "Time, Donald Trump on Russia, Advice from Barack Obama and How He Will Lead, Dec. 7, 2016", "Fox News, Fox News Sunday, Dec. 11, 2016", "AP, Trump roars on Twitter about Russia probe, Feb. 18, 2018", "Washington Post, Fact-checking Trump’s error-filled tweetstorm about the Russia investigation, Feb. 18, 2018", "New York Times, Trump Falsely Claims, ‘I Never Said Russia Did Not Meddle’, Feb. 18, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]