["The three images were published here in a Facebook post on January 6, 2020.", "The post’s traditional Chinese-language caption translates to English as: “Posting a hundred more times since this was previously deleted. Evil police officer pushed an elderly person down the stairs”.", "Below is a screenshot of the misleading Faceboook post:", "In January 2020, Hong Kong entered its eighth month of pro-democracy protests, which were triggered in June 2019 by a now-scrapped bill that would have allowed extraditions of Hong Kong suspects to mainland China.", "On January 5, 2020, anti-parallel trading protesters threw petrol bombs at a police station in the district of Sheung Shui, near Hong Kong’s border with mainland China.", "The demonstration against the bulk-buying of consumer goods in Hong Kong and their resale at a profit across the border was held as anti-mainland sentiment heightened in Hong Kong, as reported here by AFP on the same day.", "The same images were published in Facebook posts here, here, here and here with a similar claim.", "The photos have been shared in a misleading context; livestream footage of the same incident does not show the police officer physically pushing the elderly man down the stairs.", "A keyword search on Facebook found this live video filmed by Hong Kong newspaper Apple Daily during the Sheung Shui protest on January 5, 2020.", "The elderly man can be seen stepping down the stairs while an officer holding pepper spray walks behind him at the two-hour, 17-minute and 25-second mark of the video, which has been embedded below:", "The Apple Daily clock in the top right-hand corner of the screen at this point shows 15:53.", "Below is a screenshot of the scene at the two-hour, 17-minute and 30-second mark of the Apple Daily video:", "Below is a comparison of the photos in the misleading posts (L) and a screenshot of a corresponding scene from the Apple Daily video (R):", "The Apple Daily footage shows that as the man reaches the ground floor, the police officer puts down his pepper spray and moves back upstairs with several other officers.", "Below is a screenshot taken at the two-hour, 17-minute and 41-second mark of the Apple Daily footage:", "At this point, the Cantonese-speaking Apple Daily reporter’s comments can be translated to English as: “[I] have seen police officers holding pepper spray, at this moment it’s not clear what is happening.”", "Another video of the same protest was streamed live by Hong Kong news site hk01 here.", "At the two-hour, 13-minute and 17-second mark, the video shows the same elderly man standing and speaking to people on the street.", "Below is a screenshot taken at the video’s two-hour, 13-minute and 17-second mark:", "At the two-hour, 13-minute and 20-second mark, the hk01 reporter’s comments in Cantonese translate to English as: “Grandpa Chan is now standing near the footbridge opposite Landmark North.\"", "Landmark North is a shopping centre in Sheung Shui.", "The elderly man can then be seen speaking to people, many donning press vests, around him in Cantonese before the camera pans away.", "From the two-hour, 15-minute and 10-second mark, his comments translate to English as: “Everyone calm down. We are scared of nothing.", "“I have been sprayed more than once. I’ve had bigger \"pepper spray meals\"! Not just today!", "\"The indiscriminate arrests and oppression of citizens by police were not means to maintain order. Why couldn't I stand there for the bus? Why were they so aggressive? Explain to me, why tried to pepper spray me? How could they treat me like that? Everybody, make sure you have that on camera.", "\"We did not argue. It was them (police) being unreasonable and rude. I was only waiting for the bus, and was made to leave regardless. Is that what police should do? Were they here to maintain order, by driving people away and pepper spraying them?", "\"That was not my first time being pepper sprayed! Everyone is acutely aware of how police have made indiscriminate arrests, used reckless violence and intimidated people. Why aimed pepper spray at me when I was leaving already? Everyone saw it.", "\"Threats don't work. Let us all take a step for Hong Kong, for the younger generation. We won't tolerate police violence.\"", "Hong Kong media outlet Hong Kong Free Press identified Grandpa Chan as activist Chan Ki-kau in this article published on September 25, 2019.", "The incident pictured in the photos happened near Lung Wan Street in Hong Kong’s Sheung Shui neighbourhood, as seen on Google Street View here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]