["About this rating", "On 8 June 2017, \"prank\" web site React365.com published a story falsely reporting an infant's death during a police shootout:", "There was a shootout today involving 2 suspects with felonious assault warrants. During the gunfire, apparently the cops bullet penetrated a 3-yr old infant playing outside. The cop has been put on administrative leave with no pay pending the investigation.", "The story, which is little more than a paragraph without many details and an image, is completely false. The only thing that is authentic in this story is the image, which was taken from footage of a real shooting — the death of 35-year-old Antonio Zambrano-Montes at the hands of police in Pasco, Washington in February 2015.", "Richmond police confirmed that no such shooting took place.", "On its front page, React365 invites users to \"prank\" their friends by entering titles and text for their \"stories\", while also allowing them to either upload their own pictures or search Google for an image to use in their posts. The site also advises users to \"make sure [pictures] are free of [sic] use\". A note at the top of the page states:", "The authors of posts of bullying or that advocate acts of terrorism or violate public order are subject to prosecution.", "The site also contains a disclaimer:", "This website is an entertainment website, news are created by users. These are humourous news, fantasy, fictional, that should not be seriously taken or as a source of information.", "We contacted React365 for comment regarding the use of the picture of the shooting.", "Zambrano-Montes was shot and killed by three officers after allegedly throwing rocks at them. His death spurred both local protests and criticism of police in the United States by Mexican president Enrique Peña Nieto. Prosecutors in Franklin County announced in September 2015 that they would not seek charges against the officers.", "Hurtado, Jaqueline and Martinez, Michael. \"Migrant Laborer's Death in Hail of Police Bullets Roils Family, Leaves Questions.\" CNN. 1 March 2015.", "Johnson, Tim. \"Mexico Denounces Police Killing of Unarmed Migrant Worker in Washington State.\" McClatchy DC Bureau. 13 February 2015.", "Helsel, Phil. \"No Charges for Pasco Police Officers Who Killed Antonio Zambrano-Montes, Man Who Threw Rocks.\" NBC News. 9 September 2015.", "Updated with police confirmation that the shooting mentioned in the story did not take place.", "Arturo Garcia is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]