["About this rating", "Nearly three-quarters of people interviewed in a non-peer-reviewed study conducted by the CDC said that they had worn a mask or cloth face covering while in public in the weeks leading up to their COVID-19 diagnosis. The report concluded that although people were wearing masks, that does not mean they were wearing them properly, and that \"masks cannot be effectively worn while eating and drinking, whereas shopping and numerous other indoor activities do not preclude mask use.\"", "The CDC report did not suggest that masks and face coverings are ineffective at preventing the spread of COVID-19.", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "Even as the COVID-19 pandemic touched nearly every corner of the planet, wearing a mask remained a highly politicized topic in the lead-up to the 2020 U.S. election. During an Oct. 15, 2020, town hall broadcast by NBC, U.S. President Donald Trump pushed inaccurate information that questioned the efficacy of wearing masks, despite leading health authorities' recommendations.", "When asked about his wavering responses to the idea of wearing a mask, Trump responded:", "“But as far as the mask is concerned, I’m good with masks. I’m okay with masks. I tell people, wear a mask. But just the other day, they came out with a statement that 85% of the people that wear masks catch it.” The president's response is also recorded at around the 6-minute mark in the video below:", "Trump did not name the source of the \"statement\" he referenced, but his comments appeared to misrepresent a study conducted by the Centers for Disease Control and Prevention (CDC). There are two instances in which \"85%\" was mentioned in the CDC report, but neither reference solely suggested that 85% of people diagnosed with COVID-19 had worn a mask. Rather, the two 85% figures related to two different survey responses that contributed to the overall findings of the study. It was not accurate to make such a generalized statement as the president did. However, he was not the first to amplify this misinformation.", "In the days leading up to the town hall, publications like the conservative online magazine The Federalist and the conservative-leaning California Globe ran articles that misinterpreted the study, claiming that an “overwhelming majority” of individuals who contracted COVID-19 had worn a mask, suggesting that perhaps wearing a mask made a person more likely to contract the virus.", "This claim is false.", "The research in question was conducted by the CDC and published in the U.S. COVID-19 mortality report on Sept. 11, 2020. While this is not a peer-reviewed study published in a scientific journal, the agency shared the information to provide insight into how SARS-CoV-2, the virus that causes COVID-19, may be transmitted both within communities and between close contacts.", "It is true that nearly three-quarters of study participants reported that they had worn a mask or cloth face covering while in public in the two weeks preceding their COVID-19 diagnosis. However, the findings do not suggest that masks and face coverings are ineffective at preventing the spread of COVID-19. Rather, the report argued that although people said that they had worn a mask, that does not necessarily mean they wore it properly. And even if they wore their mask appropriately and followed recommendations, such measures may be insufficient in certain settings.", "“Exposures and activities where mask use and social distancing are difficult to maintain, including going to places that offer on-site eating or drinking, might be important risk factors for acquiring COVID-19,” wrote the agency. “As communities reopen, efforts to reduce possible exposures at locations that offer on-site eating and drinking options should be considered to protect customers, employees, and communities.”", "To characterize how community and close-contact exposures contribute to the spread of COVID-19, both of which were determined to be driving factors of the pandemic in October 2020, researchers interviewed more than 300 adults from 11 U.S. health care facilities. More than 150 “case-patients” — adults that had been exposed to the coronavirus, tested positive, and were experiencing symptoms — were compared against 160 outpatients from the same facilities who tested negative for the virus but experienced symptoms.", "Study participants were contacted within about three weeks of their initial testing. They were asked about their mask-wearing habits and possible community activities that might have exposed them, such as in-home gatherings, going to the salon or gym, using public transportation, and going to a restaurant. For each activity, participants were asked to quantify how well they adhered to coronavirus mitigation recommendations, like wearing a mask and practicing social distancing, using “none” to “almost all.”", "About three-quarters of study participants from both groups (71% of case-patients and 74% of control participants) reported having always worn a mask or cloth face covering when in public, but people who tested positive were more likely to have been in close contact with a person who also tested positive — and nearly twice as likely to have dined at a restaurant.", "In short: the CDC study was testing what activities made a person more likely to contract SARS-CoV-2 and how mask-wearing and social distancing measures might influence infection rates. Having close contact with a person diagnosed with COVID-19 or going to locations that offer onsite dining was associated with a higher likelihood of being diagnosed with the disease.", "“In this investigation, participants with and without COVID-19 reported generally similar community exposures, with the exception of going to locations with on-site eating and drinking options,” wrote the health agency. “Adults with confirmed COVID-19 (case-patients) were approximately twice as likely as were control participants to have reported dining at a restaurant in the 14 days before becoming ill.”", "The study is not without limitations. First of all, the sample size is relatively small. Secondly, study participants self-reported their mask use, which could present an opportunity for false memories or poor recall. Participants were also aware of their infection and agreed to take part in the study, which could have influenced their responses.", "Even so, the study suggests that increased infection rates among those who had dined at restaurants may be linked to air circulation. The direction, ventilation, and intensity of airflow may influence virus transmission even if social distancing measures are followed. People taking their masks off to eat and drink in closed-circulation spaces may also make them more susceptible to infection.", "The findings held implications for public health, particularly as many U.S. states were partially open or allowed dine-in eating in October 2020.", "“Eating and drinking on-site at locations that offer such options might be important risk factors associated with SARS-CoV-2 infection. Efforts to reduce possible exposures where mask use and social distancing are difficult to maintain, such as when eating and drinking, should be considered to protect customers, employees, and communities,” wrote the CDC.", "As of mid-October, the CDC continued to recommend that a person wear a mask whenever in public or around people who do not live in the same household. A full list of recommendations can be found here.", "Fisher, Kiva A. et al.   \"Community and Close Contact Exposures Associated with COVID-19 Among Symptomatic Adults ≥ 18 Years in 11 Outpatient Health Care Facilities — United States, July 2020.\"\r\n    CDC Morbidity and Mortality Weekly Report.   11 September 2020", "Grimes, Katie.   \"New CDC Study Finds Majority of Those Infected with COVID-19 ‘Always’ Wore Masks.\"\r\n    California Globe.   13 October 2020.", "Davidson, Jordan.   \"CDC Study Finds Overwhelming Majority of People Getting Coronavirus Wore Masks.\"\r\n    The Federalist.   12 October 2020.", "Rev.   \"Donald Trump NBC Town Hall Transcript October 15.\"\r\n    15 October 2020.", "Dale, Daniel.   \"Fact Check: Trump Falsely Claims That 85% of People Who Wear Masks Get Coronavirus.\"\r\n    CNN.   15 October 2020", "Madison Dapcevich is a freelance contributor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]