["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "How is Peyton Manning in the cold? We decided to take a closer look.", "It’s pretty much impossible to avoid talk about Denver Broncos quarterback Peyton Manning and his career in cold weather.", "So we won’t even try.", "Blame the two-week gap between the conference championships and the Super Bowl. Blame ESPN for its non-stop coverage of the big game. Blame whoever decided a Super Bowl in New York (er, New Jersey — sorry, Sen. Booker) was a good idea. Blame the sports media that has exhausted nearly every angle of analysis before Sunday.", "Whatever the reason, Manning’s performance in frigid temps is one of the most talked about story angles heading into the first outdoor Super Bowl in a northern city. You can find a few examples here, here, here and here. People have come down on both sides of the debate.", "But is it true? We went deep into the future Hall of Famer’s numbers to find out.", "Small samples", "The biggest problem we found in drawing broad conclusions about Manning’s statistics in cold weather games is that the sample size is relatively small.", "Even for a quarterback who has dropped back to pass 9,300 times in his career including the playoffs, Manning has only played a small fraction of his 262 games in the cold.", "Much of that is because Manning spent the first 14 seasons of his career with the Indianapolis Colts, who played in the RCA Dome and later Lucas Oil Stadium, which are domed stadiums.", "It’s also due to Manning’s prowess. In leading perennial Super Bowl contenders to the playoffs, Manning’s Colts were often a top-seeded team. That means they got to play at home, instead of outdoors at a time when temperatures drop. Ten of Manning’s playoff games during his time in Indianapolis were at home in a controlled environment, while seven were on the road.", "And then there’s the comparison problem. What if all quarterbacks just play worse when it’s cold out? In those temperatures, the oblong ball is harder to throw and catch, the wind becomes a factor and you would expect teams to run the ball more. Not exactly conditions that make for prolific passing performances.", "Despite all of this, in the true spirit of sports punditry, let’s weigh in anyway, shall we?", "Manning in the cold", "Pro-Football Reference keeps a game log for NFL players. Included in each entry is the weather that day.", "Using that information, we broke down all of Manning’s performances, noting the temperature for each game and his stats. We won’t rely too heavily on his win-loss record, but rather his individual effort.", "There is a notable difference just comparing Manning’s passing numbers outdoor (136 games) versus indoor (126 games). The below numbers include playoff appearances and tally completions, attempts, yards, touchdowns and interceptions per game.", "So, inside, Manning completes a few more passes per attempt, throws slightly more touchdowns, slightly fewer interceptions and his quarterback or passer ratings (which factors in completion percentage, passing yards, touchdowns and interception to create a metric that compares quarterbacks) is much higher. The average QB rating for all NFL QBs in 2013 was 84.1 and a perfect score is 158.3, though anything over 90 is considered very good.", "So basically he’s amazing indoors and a little less amazing outside.", "Let’s breakdown the outdoor games even further by weather. Manning has played 97 games where its 50 degrees or warmer, and 39 games where it’s colder (as you can see, the sample sizes are getting smaller).", "There’s greater parity here. Completion percentage is relatively close regardless of the temperature, but the yards are down a bit when in games under 50 degrees, as are touchdowns. Also, interceptions are up when the temperature drops, and Manning’s QB rating dips below 90. Still a very good quarterback, but not his elite self.", "But what if it gets even colder, like it will be in East Rutherford, N.J., on Sunday. The high for the day is currently forecast in the mid 40s, but kickoff isn’t until 6:30 p.m. and temperatures will be lower then.", "So let’s assume it’s 40 degrees or less during the game. Manning has 26 games in that environment. It’s worth noting that all but four of them were on the road (hostile environment) and five of them were in the playoffs (good competition). What does it look like per game?", "Manning’s numbers continue to fall with the temperatures. And his record during that stretch is 12-14.", "But maybe Manning has improved. The early knock on the former University of Tennessee star was he choked in big games, and he now owns a Super Bowl ring that says otherwise. Perhaps he is better of late in the cold.", "With a sample size this small you can cherry pick dates that prove or disapprove that point. For example, since joining the Broncos, Manning is just 3-3 in games where it’s 40 degrees or colder out, but his numbers are stellar.", "Total\nattempts", "Total yards", "But if you pick a different range of games and temperatures, you’ll get an entirely different result. For example, Sports Illustrated (citing ESPN numbers) notes that, \"Manning’s teams have lost seven of the 10 regular-season and postseason games in which the temperature was 32 degrees or colder. He has thrown 12 interceptions in those games to 11 touchdowns, his completion percentage is 59.4 in those games (career percentage: 65.4), and his 214.1 yards per game total is quite a bit below his career average of 269.5.\"", "We can say Manning has been great as a Bronco in cold weather. Or we can say Manning has a recent history of not performing when it’s below freezing. And in both cases, we’d be right. That’s what happens when sample sizes are small.", "Manning vs. the league", "Analysis of Manning’s cold weather performance also often fails to include how other quarterbacks perform when temperatures drop.", "While league stats in cold weather aren’t readily available, we can try to piece it together ourselves, thanks to Yahoo!, which provides career regular season splits at various temperatures.", "We took the career passer ratings of the 34 quarterbacks in the league last year with significant playing time and compared it to their career numbers when the temperature is between 21 and 40 degrees, as it should be for Sunday’s Super Bowl.", "But many of those 34 quarterbacks have played just a game or two in those temperatures. That’s not nearly enough to draw a conclusion. So we also broke out the quarterbacks with 10 or more regular season games in cold weather — there are 12 of them — and compared their quarterback ratings. (This rating is an imperfect metric, but it does factor in completion percentage, yards, touchdowns and interceptions and is widely used.)", "Games \nin cold", "*Qualifying QBs averaged 14 pass attempts per teams’ games played, per ESPN", "Manning only has 10 games in the cold, compared to Tom Brady of the New England Patriots, who has played in 44. Ben Roethlisberger of the Pittsburgh Steelers has played in 36 cold weather games, twice as many as the next closest quarterback.", "Both Brady and Roethlisberger had very small dropoffs in their performance in cold weather versus their career numbers. Perhaps that’s a sign that with more games played, statistics will trend toward their career averages. Or maybe Brady and Big Ben, who both play in the Northeast, are familiar with the cold weather and it doesn’t affect them as much.", "Across the league, there is a significant drop off in quarterback rating when it gets cold out. The rating of the 12 players we focused on in 21-40 degree temperatures is more than 8 points lower than those players’ combined career quarterback rating. (We determined this by plugging all the combined career and cold weather stats of the quarterbacks into this handy calculator, which computed the complex passer rating formula for us. If you’re looking for an average drop off between the 12 players, it’s about -0.53 points, but that doesn’t factor in the number of games played in these conditions.)", "So there is reason to believe quarterbacks tend to play worse in the cold.", "Manning is not as good in his 10 regular season games played when the temperature is between 21 and 40. Among quarterbacks with 10 or more games in the cold, it’s one of the larger drop offs. Only his brother, New York Giants quarterback Eli Manning and Carson Palmer of the Arizona Cardinals, saw greater discrepancies in their performances.", "But Manning’s rating of 92.6 is still the third highest of the 14. Only Brady and Green Bay Packers quarterback Aaron Rodgers are better. All three are considered elite players and future Hall of Famers.", "For the record, Seattle Seahawks quarterback Russell Wilson has a quarterback rating of 93.6 in two games in cold weather.", "Our ruling", "For the purpose of this analysis, we’re fact-checking some of the many tweets we saw this week about Manning and his struggles in the cold weather.", "So is Peyton Manning worse in the cold?", "Overall trends say yes, though the sample size is small. Manning’s numbers go down the colder it gets. But we also found that’s typical throughout the league. And since joining the Denver Broncos, Manning has been quite fantastic in conditions close to what we’ll see in the Super Bowl. And even at his worst, he’s still Peyton Manning.", "Claims that Manning struggles in cold weather are accurate, but require additional explanation. As such, we rate this claim Mostly True.", "Sports Illustrated, \"Peyton Manning denies any problems in cold-weather games,\" Dec. 6, 2013", "ESPN, \"Peyton Manning: Same QB in cold,\" Dec. 5, 2013", "Dallas Morning News, \"Cowlishaw: Thanks to 'Tuck Rule' game, this won't be the last cold-weather Super Bowl,\" Jan. 28, 2014", "WKBN, \"Big chill from Broncos teammates about Peyton Manning's struggles in cold weather,\" Jan. 29, 2014", "Grantland, \"Anatomy of a classic,\" Nov. 25, 2013", "ESPN, NFL Player Passing Statistics - 2013, accessed Jan. 29, 2014", "Pro-Football Reference, Peyton Manning game log, accessed Jan. 28-29", "The Original Quarterback Rating Calculator, accessed Jan. 28-29", "Yahoo! Sports Player Pages for the following quarterbacks: Tom Brady, Ben Roethlisberger, Eli Manning, Aaron Rodgers, Jay Cutler, Joe Flacco, Carson Palmer, Philip Rivers, Matt Cassel, Jason Campbell, Ryan Fitzpatrick, Peyton Manning, Alex Smith, Andy Dalton, Drew Brees, Tony Romo, Kellen Clemens, Andrew Luck, Matthew Stafford, Brandon Weeden, Ryan Tannehill, Colin Kaepernick, Russell Wilson, Chad Henne, Josh McCown, Robert Griffin III, Geno Smith, Sam Bradford, Cam Newton, Matt Schaub, Nick Foles, Matt Ryan, Terrelle Pryor, Mike Glennon, Case Keenum, Christian Ponder, EJ Manuell; accessed Jan. 28-29, 2014", "Weather Channel, Forecast for East Rutherford, N.J., accessed Jan. 29, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]