["About this rating", "A video shows several students signing a petition to ban the song \"White Christmas\" from the radio.", "The petition was started by a group of college students.", "On 21 December 2015, MRCTV uploaded a video of reporter Dan Joseph attempting to get students at George Mason University to sign a fake petition to get the song \"White Christmas\" banned from the radio:", "Last week, I presented some college students with a petition urging radio stations to stop playing the holiday classic \"White Christmas\" because the song only focuses on \"White\" Christmases. This clearly makes it racially insensitive, since it completely ignores Christmases of other colors.", "Students were all too willing to check their privilege and take a stand against Bing Crosby's racially charged micro-aggression. Just watch.", "The video was picked up by several conservative outlets and was published with titles such as: \"Liberals Demand Song ‘White Christmas’ Be Banned… BECAUSE RACIST!\"", "While it's true that Joseph got some college students to sign his fake petition, this was not a very accurate way to measure college students' interest in banning \"White Christmas.\" For one, this petition was started by someone with a stated agenda, and not by a group of college students. Second, Joseph had to convince several of the students to sign, prodding them with remarks such as \"You've got to check your privilege, man!\" and \"stop white supremacy in the holiday season.\" Lastly, Joseph claimed that he got 18 signatures in about an hour, which is hardly representative of George Mason University's student body.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]