["About this rating", "Montreal's city council has voted in favor of a ban on new ownership of pit bulls and strict regulations on existing pit bulls.", "The law does not require that all pit bulls be euthanized.", "On 27 September 2016, The Dodo animal welfare site published an article reporting that the city Montreal had outlawed pit bulls and thereby condemned countless pets to euthanization.  As the article noted, though, the legislation didn't require that all pit bulls in the city be put down; euthanization was an outcome that might occur in cases of disadvantaged pit bull owners' not being able to afford complying with the new regulations:", "City councillors in Montreal just signed a death warrant for thousands of dogs in the Canadian city.", "At a council meeting, legislators voted in 37 to 23 favor of breed-specific legislation, effectively outlawing any dog that resembles a pit bull — unless owners meet a strict set of conditions.", "Under the law, people who own dogs deemed pit bulls have until March to undergo a criminal background check and pay $150 for a special permit. Their dog will have to be sterilized, vaccinated and microchipped — as well as muzzled and on a 4-foot leash at all times in public.", "\"There are a lot of low-income and homeless people in Montreal who simply won't be able to afford all of the criteria they need in order to get the special permit,\" Devine told The Dodo. \"Those dogs will have to be seized and have to be euthanized.\"", "Unlike similar viral rumors, the Montreal pit bull ban claim was not an unfunny joke, as the CBC confirmed:", "Nearly three months after a brutal dog attack that claimed the life of a Montreal woman, the city has passed its contentious pit bull ban.", "City council voted in favour of changes to its animal control bylaw that include a ban on new ownership of pit bull and pit bull-type dogs. The final vote was 37-23 in favour of the ban.", "The new bylaw will apply to all 19 boroughs and will define pit bulls as:", "Staffordshire bull terriers.\nAmerican pit bull terriers.\nAmerican Staffordshire terriers.\nAny mix with these breeds.\nAny dog that presents characteristics of one of those breeds.", "Those who now own a dog of those breeds and already live in Montreal will have to acquire a special permit in order to keep their pet by Dec. 31, 2016.", "The article added that a minor amendment allowed for a number of licensed pit bulls to avoid euthanization in the event of their owners' deaths, and noted further provisions for \"dangerous dogs\":", "The bylaw also creates two categories of dogs of all breeds: at-risk and dangerous. At-risk dogs are those that exhibit aggressive behaviour, such as biting someone. Dangerous dogs are those that have killed someone or are deemed dangerous by an expert.", "\"No matter what, if your dog is dangerous, we will be able to act accordingly,\" Coderre said.", "An amendment to the bylaw made Tuesday morning aimed to address concerns that a pit bull would be automatically euthanized when its owner dies. The changes allow the pit bull's licence to be transferred to another person who was living at the same address, a direct family member or a spouse.", "The city's move sparked a variety of reactions, including a letter from Quebec's Order of Veterinarians to members assuring them no one could be compelled to euthanize a healthy animal:", "Quebec's Order of Veterinarians has told members, as a bylaw banning new pit bulls in Montreal looms, that they have the right to refuse to euthanize healthy dogs, even if owners are found to have violated municipal rules.", "In a letter to its members, the order said veterinarians must weigh issues of animal welfare and public health in making their decisions, but ultimately, \"no municipal regulation or provincial legislation can obligate a veterinarian to carry out any veterinary act.\"", "The city council referenced the 11 June 2016 mauling death of a Montreal woman as the impetus for the ban, although police said as of late September 2016 that DNA tests to affirm the involved dog's breed were still pending:", "The city had originally intended to update its legislation concerning dangerous dogs by 2018, but plans were accelerated following the mauling death of 55-year-old Christiane Vadnais.", "​The dog that attacked her was initially identified as a pit bull, but police now say they are still waiting for DNA test results", "The ban on pit bulls is set to go into effect 3 October 2016, and owners are required to meet licensing requirements by 31 December 2016.", "Cotroneo, Christian.   \"Montreal Just Delivered a Death Sentence to Thousands of Dogs.\"\r\n    The Dodo.   27 September 2016.", "CBC News.   \"Family of Montreal Woman Mauled by Dog Wants Quebec-Wide Pit Bull Ban.\"\r\n    11 June 2016.", "CBC News.   \"Montreal Passes Controversial Pit Bull Ban.\"\r\n    27 September 2016.", "CBC News.   \"Montreal SCPA to Take Legal Action Against New Bylaw Targeting Pit Bulls.\"\r\n    28 September 2016.", "CBC News.   \"Quebec Order of Veterinarians Says Vets Have Right to Refuse to Euthanize Pit Bulls.\"\r\n    26 September 2016.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]