["About this rating", "In early February 2021, some midwives in England and Wales were given guidance from their hospitals on ways to offer more support to transgender and nonbinary parents, including incorporating new gender-inclusive language using terms such as “chestfeeding” and “birthing parents.”", "The move made headlines and sparked controversy on social media between those who applauded the “groundbreaking work\" and others who suggested that it was a waste of resources and risked “confusion and undermining.”", "It is true that on Feb. 10, 2021, maternity services at Brighton and Sussex University Hospitals (BSUH) announced it would expand language used to support midwives that provide care for trans and nonbinary people who give birth.", "The National Health Service (NHS) in England and Wales, which oversees the two hospitals, said that the vast majority of those who turn to midwifery are women and as such, are already comfortable with language that was already in place. To be clear, the NHS said that such language — like referencing “pregnant women” and “breastfeed” — will not change for those who identify as such.", "Furthermore, the work does not impact other maternity services and staff are not being asked to stop using language related specifically to women.", "Adding terms like “chestfeeding” and “birthing parent” was not intended to take away from women-oriented language already in use. Rather, the move was meant to be additional support that offers more inclusion for trans and nonbinary individuals. Another example of gender-inclusive language is the phrase “pregnant women and people.”", "“Adding to the language we use is something people who use our services have been asking for, for some time,” said BSUH Chief Nurse Carolyn Morrice in a statement. “Our aim will always be to treat everyone who uses our services as an individual, providing care that is personal to them, that meets their needs and uses language they are comfortable with.”", "It was not clear whether maternity care providers at these hospitals would be required to use the new terms in conversation with affected patients or whether the change would also be reflected in written materials or medical records.", "It’s not the first time such an initiative has been introduced. The breastfeeding advocacy and support group La Leche League released a joint statement in 2018 on behalf of its Canadian and American chapters that defined the term “chestfeeding” and the rationale for its use:", "Chestfeeding is a term used by many transmasculine and non-binary parents to describe how they feed and nurture their children from their bodies. Some prefer the term nursing instead, while others prefer breastfeeding.", "[…]", "The science behind the use of the term chestfeeding is not focused on human anatomy; it is the science of health communication, which requires using terms that are familiar and accepted by those being helped. Language is always evolving, in the breastfeeding and lactation world as elsewhere. Many of the terms used 20 or 30 years ago would be unfamiliar to parents today, and La Leche League must continue to adapt and evolve as language in the lactation area does as well.", "The international nonprofit also offered a tip sheet offering ways to support transgender and nonbinary parents, found here.", "Madison Dapcevich is a freelance contributor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]