["The images were published in this Facebook post on July 17, 2019. The post has been shared more than 61,000 times.", "The post's Indonesian-language caption translates to English as: “Thank you for helping Palestine, may your good deeds and prayer accepted by God.”", "The text superimposed on the image translates to English as: “Hamza Dalj of Algeria is one of the most feared hackers in the world, now he gets death penalty after hacking into 217 banks in Israel to give donations to Palestinians.”", "Below is a screenshot of the misleading post:", "Hamza bin Dalaj, also known as Hamza Bendelladj, is an Algerian computer hacker.", "According to this FBI press statement in 2013, Bendelladj was indicted by a federal grand jury in the US city of Atlanta, in Georgia, with 23 counts of indictments including conspiring to commit computer, wire and bank frauds.", "Similar photos and claims have been shared on Facebook since 2016, including here and here.", "Photos of the same man, with similar claims in English, have also appeared on Facebook here and here, where they have been shared more than 10,000 times; in Spanish here and here; and in Tagalog here.", "The claims are false. The photos have previously circulated in media reports about the public hanging of Majid Kavousifar, or Majid Kavoosifar, an Iranian man who was convicted of assassinating a judge in Iran.", "A reverse image search on Google and a subsequent keyword search found Associated Press photos of Majid Kavousifar published on August 2, 2007.", "The first and second photos have the same caption: “Majid Kavoosifar, convicted of assassinating Judge Hasan Moqaddas, waves to the crowd prior to his hanging in public, on the second anniversary of the assassination, in Tehran, Iran, Thursday, Aug.2, 2007. Moqaddas was shot dead in his car after leaving his central Tehran office.”", "Below is a screenshot of the first AP photo:", "Below is a screenshot of the second AP photo:", "AFP published this report on the execution and also a photo of Kavousifar here, both dated August 2, 2007.", "The AFP report reads in part: \"Two men convicted of murdering a top Iranian judge in 2005 were hanged in public in central Tehran on Thursday, the first such public executions in the Iranian capital in five years.", "“The men were executed for the murder of Hassan Moghaddas, a hardline deputy prosecutor and head of the ‘guidance’ court in Tehran, who was shot dead by two men as he getting into his car in August 2005.", "\"Majid Kavousifar and Hossein Kavousifar, from the same family, were standing bareheaded on stools with the nooses around their necks from a crane mounted on the back of a truck.”", "Below is a screenshot of the AFP photo of Majid Kavousifar:", "Bendelladj, the Algerian hacker, was wanted by the FBI for hacking into American banks and stealing millions of dollars to fund his lavish lifestyle, and was arrested by Thai police in Bangkok, according to this AFP report on January 7, 2013.", "Here is an AFP photo of Bendelladj after he was arrested by Thai police.", "Below is a screenshot of the AFP photo of Bendelladj:", "According to the US Justice Department’s statement here, Bendelhadj was extradited to the US on May 2, 2013, following his arrest in Thailand on January 5, 2013; he was later sentenced to 15 years in prison in April 2016 for his role “in developing and distributing the prolific malware known as SpyEye, which caused hundreds of millions of dollars in losses to the financial world around the world”.", "EDIT: This post was updated on October 29, 2019, to remove the reference to a Malaysian-language post.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]