["About this rating", "On Nov. 8, 2019, U.S. President Donald Trump traveled to the Georgia World Congress Center in downtown Atlanta to take part in a \"Black Voices for Trump\" rally, at which the president launched an outreach initiative dedicated to \"recruiting and activating Black Americans in support of President Trump,\" as reported by (among others) CBS News:", "President Trump launched his campaign initiative Black Voices for Trump in Georgia, as he tries to make the case that his support among African-Americans is strong, despite low approval ratings.", "In his address, the president claimed African-Americans are coming back to the Republican Party in \"record numbers,\" although the president gave no basis for that claim. Only 8% of black voters picked Mr. Trump in 2016, and his support among black voters was just 10% in a recent Quinnipiac poll.", "Mr. Trump made the case that Democrats are only interested in African-Americans for their votes every four years, saying they \"don't fight\" for the African-American community. Mr. Trump insisted he won't take those votes for granted.", "\"They don't care. But we do,\" the president said.", "Some photographs purportedly captured at that event that showed both blacks and non-blacks wearing shirts bearing the identifier \"Blacks for Trump\" prompted readers to query us about the authenticity of those pictures, particularly one photograph featuring an older white couple:", "\"Blacks for Trump\" T-shirt wearers are filling up the GWCC ahead of @realDonaldTrump Blacks Voices for Trump initiative. @FOX5Atlanta pic.twitter.com/HP1vR7bXWf", "— Aungelique Proctor (@aungeliquefox5) November 8, 2019", "The latter photograph, and others like it, were indeed authentic, as described in a New Yorker article about the event (which included a different picture of the same couple):", "Before noon on Friday, as he was leaving the Atlanta Regional Commission’s “State of the Region” breakfast at the Georgia World Congress Center, in downtown Atlanta, Bem Joiner, a local entrepreneur, saw an elderly white couple “walking so jovial towards us,” as he later put it to me, in a direct message. The grinning couple wore matching white T-shirts with black lettering that read “blacks for trump.” Joiner, who is black, said, “my homegirl took the pic” of the couple, which Joiner later posted on Instagram, “cause I was too in awe of the situation.” In the caption, Joiner referred to the scene as being something out of “The Twilight Zone.”", "In fact, the couple was in the building for the inaugural Black Voices for Trump rally, which was going to begin a few hours later, in a nearby room.", "Some viewers apparently found such pictures somewhat incongruous, but in general we readily accept that people often support causes that don't directly affect them: men take part in League of Women Voters functions; healthy people participate in campaigns to raise awareness of breast cancer; citizens hold rallies in support of immigrants, etc. In that same vein, non-blacks might well demonstrate support for a political party or candidate who they felt would undertake greater efforts to assist black citizens.", "Bethea, Charles.   \"Donald Trump Makes an Awkward Pitch to Black Voters in Atlanta.\"\r\n    The New Yorker.   10 November 2019.", "Watson, Kathryn.   \"Trump Claims Black Voters Are Coming Back to the Republican Party in 'Record Numbers.'\"\r\n    CBS News.   8 November 2019.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]