["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A Tony Thurmond campaign ad falsely suggests U.S. Secretary of Education Betsy DeVos supports Marshall Tuck.", "An attack ad in the race to be California’s next schools chief strongly suggests candidate Marshall Tuck is \"backed\" by U.S. Secretary of Education Betsy DeVos, a polarizing Trump administration appointee.", "Tuck is a Democrat and former education executive. He’s running for State Superintendent of Public Instruction against State Asm. Tony Thurmond, also a Democrat, whose campaign produced the ad. The incumbent, Tom Torlakson, will be termed out in January after serving two four-year terms.", "Here’s what the ad claims, as a photo of President Trump standing next to DeVos appears on the screen and then zooms in on DeVos.", "\"Tuck is backed by Donald Trump’s education advisor and financed by the same billionaires behind Betsy DeVos.\"", "Ad by Tony Thurmond campaign", "Both Tuck and DeVos support charter schools. Meanwhile, Thurmond is a strong advocate for public schools.", "Tuck has said he supports nonprofit charter schools in areas with few quality public school alternatives, though he wants to implement some changes. According to his website, he wants to make for-profit charter schools illegal, require greater school transparency and open charter schools to all students.", "But we wanted to know whether DeVos really supports Tuck in the race, as the ad suggests.", "Our research", "DeVos’ office did not respond to our requests for comment.", "We asked Thurmond’s campaign about the claim. Instead of providing evidence that DeVos supports Tuck, they said he’s backed by Bill Evers.", "Evers is a research fellow at the Hoover Institution who specializes in education policy. He was also \"head of the ‘agency action team’ for the U.S. Department of Education in the Trump transition from early September 2016 through January 2017,\" according to his biography.", "In June, Evers posted a pro-Tuck campaign ad on Facebook and supported Tuck four years ago in his run for the same office. He’s not, however, on the long list of supporters on Tuck’s website. A spokesman for Tuck's campaign said Evers probably supports Tuck but hasn't made any financial contributions.", "Tuck's website includes a news article by the Independent Voter Network website that refers to Evers as a supporter of Tuck.", "Evers did not respond to a request for comment.", "Perhaps more importantly, the ad never mentions Evers’ name or shows his photo. Its primary focus is on DeVos.", "A spokesman for the Tuck campaign called the claim \"a false and misleading attack by Tony Thurmond.\" He pointed to examples of Tuck criticizing DeVos.", "\"I’d rate Betsy DeVos extremely low. I think she is not qualified really for that job,\" Tuck said in a video posted in March by the news website gvwire.com.", "\"I’ve been very clear: My agenda is strongly against the Trump/DeVos agenda,\" he added at a campaign forum in May.", "Our ruling", "State Asm. Tony Thurmond, a candidate for California schools chief, left the strong impression in a recent ad that his opponent, Marshall Tuck, \"is backed\" by U.S. Secretary of Education Betsy DeVos.", "The ad zooms in on a photo of DeVos as it says Tuck \"is backed by Donald Trump’s education advisor.\"", "But Tuck has criticized DeVos and the Thurmond campaign offered no evidence she supports Tuck. They did say that Bill Evers, who advised Trump on education during his transition, supports Tuck. But he’s not mentioned by name or shown in the ad, and Tuck doesn’t list him as a supporter on his website.", "In the end, we agreed the ad is misleading. It gives the impression DeVos supports Tuck. But there’s zero evidence to back that up.", "We rate the claim False.", "FALSE – The statement is not accurate.", "Click here for more on the six PolitiFact ratings and how we select facts to check.", "Related fact checks:", "FALSE: Attack ad’s claim Tony Thurmond was ‘reprimanded’ by Obama", "FALSE: Attack ad’s claim Tony Thurmond was ‘sued by the ACLU’", "Tony Thurmond for Superintendent of Public Instruction 2018, campaign ad Contrast, Oct. 11, 2018", "Dustin Lawrence, campaign spokesman, Marshall Tuck for State Superintendent, phone and email interview Oct. 12, 2018", "David Beltran, campaign spokesman, Tony Thurmond for Superintendent of Public Instruction 2018, email exchange, Oct. 17, 2018", "EdSource.org, Candidates for California state superintendent of schools clash over attack ads, Oct. 22, 2018", "MarshallTuck.com, A Public Education System That Works For All Kids, Accessed Nov. 1, 2018", "Hoover.org, Williamson M. Evers biography, Accessed Nov. 1, 2018", "Gvwire.com, Tuck Makes His Case for State Superintendent, March 13, 2018", "Youtube.com, EdSource California State Superintendent of Public Instruction Candidate Forum, May 23, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]