["“If CM Mamata Banerjee can recite an Islamic prayer at a West Bengal government event, why does she have a problem being greeted with Jai Shree Ram?” tweeted BJP Bengal on January 24.", "If CM Mamata Banerjee can recite an Islamic prayer at a West Bengal government event, why does she have a problem being greeted with Jai Shree Ram?", "Appeasement?", "She disgraced Bengal and insulted Netaji’s legacy by her conduct at the event to commemorate Netaji’s anniversary. pic.twitter.com/OpQ7MR60m2", "— BJP Bengal (@BJP4Bengal) January 24, 2021", "The party had uploaded a 12-second clip of Banerjee where she can be heard saying in Bengali, “We pray to Allah that he keeps everyone well,” followed by the Islamic verse, “La illaha illallah, Mohammed ur Rasul Allah.”", "BJP’s allegation was reported at face value by Times Now.", "#NewsAlert | ‘If CM Mamata Banerjee can recite an Islamic prayer at a West Bengal government event, why does she have a problem being greeted with Jai Shree Ram?’, asks @BJP4Bengal.", "Tamal Saha with details. pic.twitter.com/PrUyp5ZUOb", "— TIMES NOW (@TimesNow) January 24, 2021", "A similarly perfunctory broadcast was also aired by Zee News Ghanta.", "‘সরকারি মঞ্চে ইসলামিক প্রার্থনা’, মাটি উত্‍সবে Mamata এর ভাষণ পোস্ট BJP এর", "‘সরকারি মঞ্চে ইসলামিক প্রার্থনা’, মাটি উত্‍সবে Mamata এর ভাষণ পোস্ট BJP এর, জয় শ্রী রাম বিতর্কে পাল্টা অভিযোগ", "#MamataBanerjee #JaiSriRam #BJPBengal", "Posted by Zee 24 Ghanta on Sunday, 24 January 2021", "The same was amplified by BJP leaders Priti Gandhi, Manoj Kotak and Akshay Singh. Shefali Vaidya also shared the video.", "Wow, so @MamataOfficial can recite the Qalma in full public! No wonder she thinks it is a personal insult when Hindus chant #JaiShriRam! pic.twitter.com/rRpvOSSK2C", "— Shefali Vaidya. (@ShefVaidya) January 24, 2021", "While Mamata Banerjee did chant Islamic verses, the video tweeted by BJP Bengal was clipped out of a much longer broadcast where the West Bengal CM can also be heard reciting Hindu and Sikh prayers. Banerjee’s original speech was uploaded by AITC in January 2018 where the CM was inaugurating the Mati Utsav to mark the growth of the agricultural sector in the state.", "At 21:28 minutes, she prays to Hindu deity Durga to bring prosperity in everybody’s lives and goes on to chant, “Sarva Mangala Mangalye Shive Sarvartha Sadhike Sharanye Tryambake Gauri Narayani Namostute…” This is followed by Islamic prayers (22:00 minutes) that could be heard in the clipped video. At 21:15 minutes, she says, “May God bless all,” which is followed by the Sikh chants of “Wahe Guru Ji Da Khalsa, Wahe Guru Di Fateh.” In the end, she can says, “Saare jahan se acha Hindustan humara.”", "BJP Bengal, therefore, tweeted a clipped video of Mamata Banerjee to portray her as a ‘Muslim sympathiser’. The party had earlier used a photograph from the 2014 California wildfires to show political vandalism by the TMC after BJP minority leader Nur Islam Gazi’s house was burned down.", "“Time for #JehadiMamta to move to Saudi Arabia or Pakistan,” tweeted Madhu Kishwar on May 19, 2019 while posting the same video. Kishwar has been found circulating misinformation several times in the past, including manufacturing a page in DMK manifesto to show the party favouring Muslims over Hindus. Kishwar was also pulled by the J&K police in 2018 for sharing fake news.", "Time for #JehadiMamta to move to Saudi Arabia or Pakistan. pic.twitter.com/JqIXejlanr", "— MadhuPurnima Kishwar (@madhukishwar) May 19, 2019", "The video was also circulating on Facebook.", "Jehadi Mamata time to shift to Saudi or Pakistan 🤔", "Posted by Sheel Johri on Sunday, 19 May 2019", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]