["The video was published here on Twitter on September 24, 2020. It has been viewed more than 230,000 times.", "It shows a wheeled machine playing a loud sound as it spins.", "The caption says: “The Chinese army uses this super loud speaker to play music at the Indian military camp in Ladakh! A large number of Indian soldiers’ eardrums were injured and vomiting”.", "Thousands of Chinese and Indian troops have been involved in a face-off since May 2020 in India’s Ladakh region, along the 3,500-kilometre frontier, which has never been properly demarcated.", "Both countries announced a \"positive consensus\" had been reached in June, but tensions continue to flare between the two nuclear-armed neighbours, according to this AFP report.", "Identical videos were also published on Facebook here, here and here, on Twitter here, here, here and here, on YouTube here and here, and on Reddit here, alongside similar claims.", "However, the claim is misleading.", "A reverse image search on Google found the same video published here on YouTube with the title “LIONKING Defender Siren” on March 30, 2016.", "The description under the video reads: “The largest air-raid siren in the world. Produced by Taizhou LionKing Signal Co.,Ltd.”", "According to Collins Dictionary, air-raid sirens are typically used as a warning to an emergency population when there is danger approaching.", "Taizhou LionKing Signal Co.,Ltd. is a China-based “safety protection products” manufacturer, specialising in “various Hand operated, Industrial Motor Sirens [and] Large Electromechanical Sirens”.", "The same air-raid siren seen in the video in the misleading post can be seen here on the company website.", "The product description reads, in part: “The defender's air defense alarm...has a wide range of applications and can be used for life-saving occasions or cable installation and wiring of power systems or anti-terrorism occasions or capture of drones.”", "The misleading post was also debunked here by an Indian fact-checking organisation NewsMeter on September 29, 2020.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]