["Demonstrators gather to protest the death of George Floyd on June 2, 2020, near the White House in Washington. (AP)", "A TikTok video cites data from the Washington Post showing that more white Americans are shot and killed by police than Black Americans.", "The numbers check out, but they lack important context — Black Americans are killed at a much higher rate than white Americans.", "Nestled among dances on the video-sharing app TikTok are videos about Black Lives Matter demonstrations and police violence. Sometimes the posts don’t tell the full story.", "In a May 29 video, one user plays a song called \"America\" as he points to a database on Statista, an online portal for statistics. The numbers show that between 2017 and 2020, more white Americans were shot and killed by police than Black Americans.", "\"Race isn’t the issue!\" the TikToker wrote in the caption. \"Police are not racist! Left wing news just make it seem that way. They need our support not hate.\"", "(Screenshot from TikTok)", "While the numbers cited in the TikTok video check out, they lack context about how Black Americans are disproportionately killed by police.", "The numbers published by Statista come from the Washington Post’s database of police shootings around the country. It shows that, since 2015, nearly twice as many white people have been shot and killed by police than Black people.", "However, the data comes with a big caveat: Black Americans are killed at a higher rate than white Americans.", "\"They account for less than 13 percent of the U.S. population, but are killed by police at more than twice the rate of white Americans,\" the Post reported. \"Hispanic Americans are also killed by police at a disproportionate rate.\"", "Since May 25, more than 350 American cities have seen demonstrations over the death of George Floyd, a Black man who died in Minneapolis police custody after a white officer kneeled on his neck. Floyd was the latest in a long line of Black men who have died in police custody.", "Some federal agencies, such as the FBI and the Centers for Disease Control and Prevention, keep track of fatal shootings by police. But those officials acknowledge that their data is incomplete, in part because it relies on voluntary reporting from police departments.", "\"Since 2015, The Post has documented more than twice as many fatal shootings by police as recorded (by these agencies) on average annually,\" the newspaper reported.", "The TikTok video is partially accurate but leaves out important details or takes things out of context. We rate it Half True.", "Al Jazeera, \"Mapping US cities where George Floyd protests have erupted,\" June 2, 2020", "PolitiFact, \"The death of George Floyd: What you need to know,\" May 29, 2020", "Rolling Stone, \"On TikTok, COVID-19 Conspiracy Theories Flourish Amid Viral Dances,\" May 13, 2020", "Statista, \"Number of people shot to death by the police in the United States from 2017 to 2020, by race,\" March 31, 2020", "TikTok video, May 29, 2020", "The Washington Post, \"Fatal Force,\" accessed June 3, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]