["Twitter — which for years faced criticism for ignoring harmful behavior from prominent accounts — recently began placing misinformation labels on tweets, including some from President Donald Trump, and flagging others for violating its standards against glorifying violence.", "Social media users claim that Democratic vice-presidential nominee Kamala Harris' press secretary plays a role in the platform's rules.", "\"Kamela (SIC) Harris' press secretary is the chief of communications at Twitter. Let that sink in,\" reads a Facebook post that has been shared over 640 times since it was posted Oct. 16.", "The user behind the post has not returned USA TODAY's request for comment.", "The claim was also posted to Instagram, where one user wrote, \"If you don't know, now you know. And then consider everything that happened yesterday on Twitter...curious isn't it?\"", "In a message to USA TODAY, the Instagram user pointed to an article from Fox News titled, \"Former Kamala Harris press secretary is top Twitter communications official, announced removal of Trump clip.\"", "Fact check: Kamala Harris never called churches 'propaganda centers'", "Harris' current campaign press secretary is Sabrina Singh, a former senior adviser and communications director for Harris' California Senate office, CNN reported.", "Singh has been the press secretary of two Democratic presidential hopefuls: New Jersey Sen. Cory Booker and businessman and former New York mayor Michael Bloomberg.", "She has also previously served as deputy communications director for the Democratic National Committee, and in 2016 she was the regional communications director for Hillary Clinton's presidential campaign, according to The American Bazaar.", "Singh is an alumna of the University of Southern California and began her career as the Democratic Congressional Campaign Committee press assistant and then became communications director for Rep. Jan Schakowsky, D-Ill., The Print reported.", "More: Why tech giants limited spread of NY Post story on Biden (and why Twitter is backtracking)", "Nick Pacilio was Harris' previous press secretary and served in that role from 2011-14, while Harris was the attorney general of California, according to Pacilio's Linkedin page.", "In 2014, Pacilio became the senior communications manager for Twitter. However, his position does not enforce the site's rules. A Twitter employee refuted the claim in response to an article from the National Review shared by Ari Fleischer, former White House press secretary and Fox News contributor.", "\"Ari, he's a spokesperson. The article is 100% incorrect,\" tweeted Brandon Borrman, Twitter's head of communications, on Aug. 12. \"He has nothing to do with enforcement. You're RTing completely fabricated information.\"", "Fact check: Fake Trump tweet says Supreme Court should decide every election", "The claim that Harris' press secretary is the senior communications manager of Twitter is FALSE, based on our research. There is no evidence that her current press secretary, Sabrina Singh, was ever employed by Twitter. Harris' former press secretary now works at Twitter; he became an employee there after working for Harris.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more."]