["Prime Minister Narendra Modi arrived in Leh, the capital of the union territory of Ladakh, in the morning of July 3 to interact with the army, air force and the Indo-Tibetan border police. After addressing troops in Nimu base, PM Modi visited a military hospital treating soldiers injured in violent clashes with China in Galwan Valley. Photographs of the Prime Minister’s visit to the hospital ward has sparked a controversy on Twitter. Several members of the Congress party have claimed that a conference hall was converted into a ward for theatrics and photo-op. National media panellist of Congress, Abhishek Dutt, tweeted in Hindi, “How does this look like a hospital – no drip, a photographer in place of a doctor, no medicines with the beds, no water.”", "Congress members Srivatsa and Salman Nizami made similar tweets.", "This slideshow requires JavaScript.", "Other users whose tweets drew hundreds of retweets and likes were – Ishaan Sethi, Rofl Republic, Doctor Roshan R and Abhishek Baxi.", "During his two-day visit to Eastern Ladakh, Army Chief General MM Naravane had visited soldiers in the same ward as PM Modi on June 23.", "General MM Naravane #COAS interacting with our gallant soldiers at Military Hospital, Leh during his two day visit to Eastern #Ladakh. pic.twitter.com/pG22J7kIs4", "— ADG PI – INDIAN ARMY (@adgpi) June 23, 2020", "A video of General Naravane’s visit is posted below.", "Visuals clues which suggest that the ward is the same have been highlighted.", "1. Blue arrow – same curtains", "2. Red box – same photo frame", "3. Green box – wall hook on the left of the photo frame", "Another framed picture of a helicopter can also be seen in images from both visits.", "Other photographs of the visits by PM Modi (top) and General MM Naravane (bottom) show further similarities. These have been marked below.", "1. Blue arrow – door", "2. Green arrow – piping", "3. Red arrow – power board", "4. Yellow arrow – photo frame", "A door is seen on a different side of the ward and the colour of the beds also match — PM Modi’s visit (left), General MM Naravane’s visit (right).", "The projector/ stage area visible in pictures of Prime Minister Modi can be spotted in a video of General Naravane’s visit in June. Screenshots of the same have been attached below.", "Photographs of identical interiors of the ward in June prove that it was not set up for PM Modi’s recent visit.", "In a press release on July 4, the Indian army clarified, “The said facility is part of the Crisis Expansion capacity of 100 beds and is very much part of the General Hospital complex. The COVID-19 protocol had necessitated some wards of the General Hospital to be converted into isolation facilities. Hence, this hall which otherwise was normally used as a Training Audio Video Hall was converted into a ward ever since the hospital was also designated as COVID treatment hospital. The injured braves have been kept there since their arrival from Galwan to ensure quarantine from COVID areas. The Chief of Army Staff General M M Naravane and the Army Commander have also visited the injured braves in the same location.”", "Responding to the claim that the patients seen in the photographs are not “real” because they don’t seem injured and are sitting in an upright position, Major Navdeep Singh wrote, “The soldiers are not there for major physical injuries but for recuperation cum debriefing, a standard process.”", "Those soldiers are not there for major physical injuries but for recuperation cum debriefing, a standard process. They have to be kept away from other patients hence a temporary ward might’ve been created in the hospital seminar room or other large area.https://t.co/zXvNtU7HwS pic.twitter.com/gj7h2j6GlQ", "— Navdeep Singh (@SinghNavdeep) July 4, 2020", "Several members of the Congress party and critics of Prime Minister Modi shared photographs of his visit to soldiers recuperating in a hospital ward in Leh. These were accompanied with false claims suggesting that the ward was ‘set-up’ for the cameras.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]