["By Saranac Hale Spencer", "Posted on October 5, 2017", "Stories claiming that the Las Vegas shooter was linked to antifa, a loosely organized group of anti-fascist activists, are proliferating online. But his purported links to antifa are either false, fabricated or unsubstantiated.", "Authorities have identified Stephen Craig Paddock, 64, of Mesquite, Nevada, as the shooter who opened fire on a crowd of more than 22,000 from his 32nd-floor hotel room at the Mandalay Bay Resort and Casino on Oct. 1, killing 59 people and injuring more than 500.", "Police have not yet found a motive for the massacre, but they have said that Paddock acted alone.", "“We believe Paddock is solely responsible for this heinous act,” Las Vegas Metropolitan Police Department Assistant Sheriff Todd Fasulo said at a press conference on Oct. 2.", "A site called neon-nettle.com posted a story on Oct. 2 with the headline: “Las Vegas Shooting Exposed as Antifa-led False Flag Attack.” That site based Paddock’s links to antifa on a pair of fabricated tweets attributed to President Donald Trump. (As we have written before, it is easy to make up a fake tweet using free software programs available on the internet.)", "The neon-nettle.com story claimed that Trump’s first tweet was posted at 6:52 a.m. on Oct. 2 and said: “My heart and prayers got [sic] out to the victim’s families of the Las Vegas massacre. The FBI tells me that Stephen Paddock was a known Antifa…”", "The second tweet purportedly went out at 6:59 a.m. and said: “…member! It’s time for people to get off their knees and take this country back from the real terrorists!”", "The story said that the tweets were later deleted, but an Internet Archive screen shot of Trump’s Twitter page just minutes after they would have been posted shows no evidence of them.", "No major news outlets have written about those tweets, but a similar story ran on ProudTrumpers.com and SundayPost.org, which is registered to an owner in Australia. Both websites show images of the bogus tweets.", "The popular conservative website called infowars.com also claims that Paddock was connected to antifa, saying an unnamed source told the website that the FBI found antifa literature in Paddock’s hotel room. But the FBI has made no such announcement.", "Infowars.com also says that Paddock didn’t kill himself, but, rather, was killed by an “FBI hostage rescue team.” But law enforcement agencies say that’s not true.", "The Las Vegas Metropolitan Police Department, which is the lead agency in the investigation, said in a statement that its own special weapons and tactics, or SWAT, team, not the FBI, went into Paddock’s hotel room, where he was already dead. Clark County Sheriff Joe Lombardo also told reporters that Paddock killed himself before police entered the room.", "In addition to unsubstantiated claims of antifa literature being found in Paddock’s hotel room, the website YourNewsWire.com claimed Paddock “was an Antifa member” based in part on a Facebook post from an account claiming to be the Melbourne, Australia, branch of antifa. We could not authenticate that Facebook account, and another group claims it is fake.", "The disputed Facebook post — which has been circulating online and has been covered as news by the Daily Mail in the U.K. — said: “One of our comrades from our Las Vegas branch has made these fascist Trump supporting dogs pay.” The post has since been deleted from the group’s page, but the Internet Archive captured a picture of the page that contains the post.", "We sent a message to the group on Oct. 2 inquiring about the post, but we haven’t received a response.", "However, there is a reason to question that Facebook page’s authenticity.", "We discovered another Facebook account — Melbourne Antifascist Info — which has more than three times as many followers, is connected to other like-minded groups online, and has been more active for a longer time than the other group claiming to be Melbourne Antifa. Both pages have the exact same description of themselves in the “About” section.", "We traded Facebook messages with a moderator of Melbourne Antifascist Info who said that the other account is an imposter. The moderator, who declined to be identified, disavowed the controversial Facebook post, saying it was “something they said to be shocking and stir up trouble.”", "This isn’t the first time that a deleted post from the other Facebook page has been quoted in a news article — in June, the Sydney Morning Herald cited a deleted post from that page in a story about conservative commentator Andrew Bolt fighting off two men who threw glitter at him on the street.", "That story quoted the Melbourne Antifa page as saying: “‘some of our family in solidarity were attacked by Andrew Bolt while they were protesting today’ and said Bolt should be jailed for his ‘violent, horrendous language.'”", "In a public post after that news story ran, Melbourne Antifascist Info said: “MELBOURNE ANTIFA IS FAKE. It is run as a honeypot to catch leftists and skew the media image of antifascism from an alt-right perspective. They’re trolls, and you’ve been got.”", "The number of fake social media accounts made to look like antifa groups has been growing recently, according to stories published by ThinkProgress.org and BuzzFeed.", "“The accounts are being set up as a way to mock Antifa, and to discredit it by tweeting out hoaxes and offensive comments,” according to the BuzzFeed article.", "FactCheck.org Rating:", "Read More", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]