["About this rating", "A judge in Floyd County, Georgia revoked Ramad Chatman's probation, and jailed him, on the basis that he committed armed robbery — a charge of which he was acquitted by a jury.", "Chatman was not jailed for the same crime of which he was acquitted.", "Critics and observers of the American criminal justice system have long pointed to disparities and discrimination as one of its most significant and deeply-embedded problems. These disparities are perhaps most visible at the sentencing stage, where black individuals in particular are statistically proven to receive higher sentences — and for the same or similar crimes — than their white counterparts.", "In that vein, in April 2018 the \"Counter Current News\" Facebook page described the case of Ramad Chatman, in a widely-shared video. A voiceover narrates:", "A black man in Georgia will be jailed until 2022 even though he was found not guilty. Ramad Chatman was on probation for breaking into an apartment and stealing a television, back in 2012. He paid his fines, did community service and never broke the terms of his probation.", "Then, in 2014, a store clerk was robbed at gunpoint. The security footage was too grainy to see who the robber was, but he was black. A year later, the clerk was scrolling through Facebook when she saw a picture of Chatman. She testified in court: \"It triggered something in me, and it just made me freak out.\"", "Over a year later, Chatman heard he was a suspect in the store robbery. Knowing he had nothing to do with it, he went to the police station. They arrested him. In the trial, the store clerk kept changing her testimony, and a jury decided that Ramad was not guilty. The judge didn't care. The judge decided to sentence Chatman to 10 years in prison, backdated to 2012. If there's any justice, hopefully there's a lawyer working on his appeal right now.", "Chatman's case is a relatively complicated one, and the video gets most of the basic details right. However, it leaves out a crucial detail: The charge on which Chatman was acquitted was not the same charge for which he was given a jail sentence, although the two cases were linked.", "In July 2012, 20-year-old Ramad Ahshad Chatman and three other men were charged with breaking into an apartment and stealing a television. Chatman pleaded guilty, and Floyd County Superior Court judge John Niedrach agreed to deal with Chatman under Georgia's First Time Offenders Act and gave him five years' probation. This meant that, because Chatman had not previously been convicted of a felony, he would avoid jail time and ultimately have the charges against him dismissed if he honored the terms of his probation.", "In July 2014, a clerk at the Lucky Lotto store on Shorter Avenue in Rome, Georgia was robbed at gunpoint by a black man. Later that year, the store clerk saw Chatman's photograph on Facebook and, convinced he was the man who robbed her, reported it to the police. The clerk positively identified Chatman as the man who had robbed her at gunpoint.", "In November 2015, Chatman became aware that he was a suspect in the Lucky Lotto robbery, and reported in person to police in Rome, according to the Atlanta, Georgia NBC affiliate WXIA-TV. He was arrested and charged with armed robbery.", "In February 2016, Judge Niedrach held a hearing on whether Chatman had violated the terms of his probation on the 2012 theft. After hearing testimony from the Lucky Lotto store clerk, Niedrach ruled that Chatman had probably committed the Lucky Lotto armed robbery and thereby violated the terms of his probation. Niedrach revoked Chatman's first-offender probation, which triggered an automatic conviction on the 2012 theft charges.", "Niedrach sentenced Chatman to a ten-year prison sentence for the 2012 theft. Because Chatman had already spent four years on probation, Niedrach suspended this portion of the sentence, effectively meaning Chatman would spend six years in prison with his release provisionally scheduled for 2022.", "A jury acquitted Chatman of armed robbery in the Lucky Lotto case in May 2016. According to the Rome News-Tribune, Chatman's attorneys filed an emergency motion for Niedrach to reconsider his revocation of Chatman's probation, since the judge's ruling on the probation was based on his conclusion that Chatman probably committed the Lucky Lotto armed robbery and a jury had just acquitted Chatman of that charge. However, Niedrach did not agree to reconsider his decision, because the jury trial — although it came to a different conclusion about Chatman's guilt — did not bring forth any new evidence.", "Judge Niedrach appears to have acted according to the relevant Georgia law, which states that a judge may revoke an individual's probation either if that individual admits to violating one of the terms of their probation, or if in the judge's opinion \"the evidence produced at the revocation hearing establishes by a preponderance of the evidence the violation or violations alleged.\"", "The judge indicated in Floyd County Superior Court documents that there was \"proof by a preponderance of evidence\" that Chatman had committed the armed robbery and that he had been in possession of a gun. This violated two conditions of his probation: that Chatman would not \"violate the criminal laws of any governmental unit;\" or \"receive, possess or transport any firearm or other offensive weapon.\"", "In other words, in 2016 Niedrach came to the conclusion that, on balance, the evidence mostly pointed towards Chatman committing a crime and being in possession of a firearm in 2014, and that was enough to revoke his probation and trigger his conviction and imprisonment on the 2012 charge. Chatman was not jailed for the same charge on which he was acquitted, something that the Counter Current News video does not clarify, misleadingly claiming he was jailed \"even though he was found not guilty.\"", "Similarly, when the video's narrator says Chatman \"never broke the terms of his probation,\" this denies viewers the full facts. Although a jury acquitted Chatman of the 2014 armed robbery, Judge Niedrach, in accordance with the procedures set out in Georgia law, found that Chatman had indeed broken two of the terms of his probation.", "As of May 2018, Chatman remains incarcerated at Rogers state prison in Reidsville, Georgia. His provisional release date is 6 July 2022.", "Georgia Code.  \"Title 42, Chapter 8, Article 3, Section 60 -- Probation Prior to Adjudication of Guilt; Violation of Probation; Review of Criminal Record by Judge.\"\r\n  Georgia General Assembly/Justia.  Accessed 7 May 2018.", "Lindstrom, Rebecca; Wolfe, Julie.  \"Serving 10 years Despite 'Not Guilty' Verdict.\"\r\n  WXIA-TV.  19 May 2017.", "Jackman, Tom.  \"Man Acquitted of Armed Robbery Gets 10-Year Sentence? Here's Why.\" \r\n  Washington Post.  31 May 2017.", "Doss, Blake.  \"Man Still Serving Time for Violating Probation by Being Arrested for Robbery of Which he Was Acquitted.\"\r\n  Rome News Tribune.  15 August 2016.", "Georgia Code.  \"Title 42, Chapter 8, Article 2, Section 34.1 -- Revocation of Probated or Suspended Sentence; Alternative Sentencing; Burden of Proof; Length of Probation Supervision.\"\r\n  Georgia General Assembly/Justia.  Accessed 7 May 2018.", "Niedrach, Judge John.  \"Order of Adjudication of Guilt and Imposition of Sentence -- The State vs. Ramad Ahshad Chatman.\"\r\n  Floyd County Superior Court.  24 February 2016.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]