["About this rating", "U.S. President Donald Trump tweeted on May 31, 2020, that the United States would be designating \"ANTIFA\" as a \"Terrorist Organization.\"", "Trump's tweet appeared in response to growing protests after the killing of George Floyd, a black man who died after a Minneapolis police officer kneeled on his neck on May 25:", "Trump and several top officials, including U.S. Attorney General William Barr, have been blaming, without evidence, antifa and other groups they call \"agitators\" for the protests that have taken over cities across the United States. Barr also said in a statement that \"The violence instigated and carried out by Antifa and other similar groups in connection with the rioting is domestic terrorism and will be treated accordingly.\"", "But the United States currently does not have a process for designating domestic groups as terrorist organizations, which makes Trump's ability to enforce such a designation highly unlikely.", "Antifa, short for anti-fascist, is an amorphous movement of people who are opposed to fascism. They do not comprise an organized group, do not have a visible leadership, and acknowledge that they are secretive, so it is impossible to know how many people even count themselves as members. Anti-fascists lean strongly toward the left of the political spectrum, and many of them refer to themselves as socialists, anarchists, communists, or anti-capitalists. The positions of various antifa groups can also be difficult to define, but many of them support oppressed community members and protest against amassing of wealth by corporations.", "Some antifa movements date their origins to the battle against European fascism in the 1920s and '30s. The BBC cited Mark Bray, the author of \"Antifa: The Anti-Fascist Handbook,\" as an authority in noting that \"[Bray] says the modern American Antifa movement began in the 1980s with a group called Anti-Racist Action. Its members confronted neo-Nazi skinheads at punk gigs in the American Midwest and elsewhere. By the early 2000s the Antifa movement was mostly dormant -- until the rise of Donald Trump and the alt-right.\"", "Antifa groups are not monolithic and employ a range of tactics. Many condemn the use of violence, but according to BBC News, some groups engage in aggressive confrontations, especially with far-right groups on the streets. Extreme factions have carried pepper spray, bricks, knives, and chains with them.", "Trump claimed members of the movement were responsible for acts of vandalism during the May and June 2020 protests against police brutality in the U.S., but in at least one case a white supremacist group was found to have posed as antifa on Twitter. Groups associated with both right and left, not just antifa, are being accused of inciting violence and looting during the protests. In most cases it is difficult to ascertain that antifa is solely responsible for the lawless activities occurring at some protests, and the culprits are still being investigated, as Keith Ellison, Minnesota's attorney general, observed on NBC's \"Meet the Press\":", "\"The truth is, nobody really knows ...There’s been a lot of videotape taken by demonstrators of people who are very suspicious, who really did start breaking windows ... There have been other photographs of cars with no license plates. Very suspicious behavior.”", "It would all have to be investigated, he said.", "Without any official structure to the group, or much evidence linking antifa to specific acts of violence, it would be difficult to prove that that body of activists is behind anything, Faiza Patel, director of the Brennan Center for Justice's Liberty and National Security program, said: \"As far as we know, antifa doesn’t have bank accounts or assets or infrastructure ... Also there haven’t been any deaths attributed to anti-fascist violence, and one of the hallmarks of foreign terrorist organizations — a designation the U.S. government does make — is the acknowledgement of attacks that involve many fatalities.\"", "Trump's ability to designate anti-fascists as a terrorist group is also highly suspect given that only foreign groups can be labeled as \"terrorist\" organizations under U.S. law, and \"domestic terrorism\" is not currently a federal crime in the U.S., according to the New York Times:", "A federal law defines terrorism as crimes of violence that are intended to intimidate or coerce a civilian population or government policy. But it distinguishes between “international” terrorism, which must have a foreign or transnational nexus, and “domestic” terrorism, which occurs primarily on American soil.", "“Acts of terrorism transcending national boundaries” is a federal crime, giving the F.B.I. and federal prosecutors jurisdiction to take the lead. There is no equivalent crime of domestic terrorism, so law enforcement officials deal with such offenses using other laws that do not have “terrorism” in their labels, such as the state-level crime of murder.", "A 2017 report by the Congressional Research Service (CRS) on domestic terrorism similarly stated that:", "The federal government does not generate an official and public list of domestic terrorist organizations or individuals. The development of such a list may be precluded by civil liberties concerns (i.e., inclusion in a publicly available list may impinge on a group’s exercise of free speech or its other constitutionally protected activities). However, a lack of official lists or processes to designate groups or individuals as domestic terrorists makes it difficult to assess domestic terrorism trends and evaluate federal efforts to counter such threats. In 2011, an unnamed [Department of Homeland Security] official cited in a news report stated that “unlike international terrorism, there are no designated domestic terrorist groups. Subsequently, all the legal actions of an identified extremist group leading up to an act of violence are constitutionally protected and not reported on by DHS.”", "The CRS report also noted that although the U.S. does not officially designate domestic terror organizations, it does record individual terrorists and threats in its Terrorist Screening Database:", "While the government does not provide an official and public list of domestic terrorist organizations, it does include domestic terrorists (along with international terrorists) in its Terrorist Screening Database, commonly known as the “Terrorist Watchlist” ...", "While not naming specific groups, DOJ and the FBI have openly delineated domestic terrorist threats. DOJ has identified domestic terrorism threats to include criminal activity by animal rights extremists, ecoterrorists, anarchists, antigovernment extremists such as ‘sovereign citizens’ and unauthorized militias, black separatists, white supremacists, and abortion extremists.", "In an interview with Snopes, Patel said that a number of different crimes can be designated as acts of terrorism:", "There is no single crime of either domestic or international terrorism. But both types of terrorism can be prosecuted under a number of statutes which constitute crimes of terrorism. The crime of hijacking an airplane, for example, is an act of terrorism. In fact, the government has available 51 different criminal statutes which can be applied domestic terrorism. It does not – and should not – have the ability to designate a domestic organization. This would allow the government to target political activity as terrorism, which is exactly what the White House and the Justice Department are trying to do by threatening to go after protestors under the guise of targeting Antifa.", "The State Department makes a list of designated \"Foreign Terrorist Organizations\" (FTO) available on their website. According to the Government Accountability Office (GAO), enforcing the terrorist designation for FTOs involves blocking assets, prosecuting individuals, and imposing immigration restrictions on FTOs, their members, and their supporters.", "Patel added that the Secretary of State can designate foreign terrorist groups, but this triggers a range of consequences: \"most important of which is the ability to prosecute anyone who provides the group with material support, no matter how minimal. In addition property and assets of persons linked to terrorism can be blocked, but only under a law that requires a connection to a mainly foreign threat.\"", "Thus, as a large, decentralized entity with no infrastructure or assets that we know of, designating and targeting antifa as a domestic terrorist organization could, according to some experts, create a dangerous scenario, as Patel told us:", "If persons who identified as 'Antifa' suspected of committing crimes that violate any of the federal crimes of terrorism or other criminal they could of course be properly investigated and prosecuted. The FBI has more than ample authority to investigate individuals they suspect of being ​engaged in criminal activity. ​The problem is the FBI's rules are so loose they can also investigate people who are not suspected of criminal activity, so these powers are easily abused. The FBI has a long history of investigating environmentalists and anti-war activists and recently fabricated a new terrorist threat of “black identity extremists” and it would be altogether surprising if they didn’t spy on the protestors.", "The paucity of evidence directly connecting antifa to acts violence during protests, combined with the structureless nature of the group and the fact that the U.S. currently has no legal process for designating domestic terrorist organizations, leads us to rate this claim as \"False.\"", "Al Jazeera.   \"Trump Says US Will Designate Antifa 'Terrorist Organisation.'\"\r\n    31 May 2020.", "BBC Radio 4.   \"Seven Things You Need to Know About Antifa.\"\r\n    26 October 2017.", "Bogel-Burroughs, Nicholas and Sandra E. Garcia.   \"What Is Antifa, The Movement Trump Wants to Declare a Terror Group?\"\r\n    The New York Times.   2 June 2020.", "Congressional Research Service.   \"Domestic Terrorism: An Overview.\"\r\n    21 August 2017.", "Hoffman, Jason, and Evan Perez.   \"Trump Tweets Antifa Will Be Labeled a Terrorist Organization But Experts Believe That's Unconstitutional.\"\r\n    CNN.   31 May 2020.", "MacFarquhar, Neil.   \"Many Claim Extremists Are Sparking Protest Violence. But Which Extremists?\"\r\n    The New York Times.   31 May 2020.", "Robertson, Lori.   \"Trump Can’t Designate Antifa — Or Any Movement — Domestic Terrorist Organization.\"\r\n    FactCheck.org.   1 June 2020.", "Savage, Charlie.   \"What Could a Domestic Terrorism Law Do?\"\r\n  &nbsp ;The New York Times.   7 August 2019.", "The United States Department of Justice.   \"Attorney General William P. Barr's Statement on Riots and Domestic Terrorism.\"\r\n    31 May 2020.", "United States Government Accountability Office.   \"COMBATING TERRORISM: Foreign Terrorist Organization Designation Process and U.S. Agency Enforcement Actions.\"\r\n    June 2015.", "U.S. Department of State.   \"Foreign Terrorist Organizations.\"\r\n    Accessed 02 June 2020.", "Nur Nasreen Ibrahim is a reporter with experience working in television, international news coverage, fact checking, and creative writing.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]