["About this rating", "An April 2018, a Fox News appearance by Rep. Debbie Dingell of Michigan led to another round of stories from right-wing blogs promoting the fear of widespread gun confiscations.", "Dingell, a Democrat, was interviewed by the right-wing network about her work co-chairing a working group alongside Republican Fred Upton concerning mass shooting attacks at schools. The network preceded her interview by reporting that police in Seattle were \"seizing guns.\" In fact, there has been one reported instance of an involuntary gun seizure in Washington state through the use of an extreme risk protection order (ERPO for short) since the law was approved by voters in November 2016.", "During her appearance, Dingell said that she intended to introduce a federal version of the \"red flag\" laws that allow for use of ERPOs by law enforcement which are currently in effect in Washington and four other states, which contain guidelines through which individuals or police officers can petition courts to issue ERPOs if they believe that a gun owner may be a danger to themselves or others.", "Many of the blogs accusing Dingell of preparing to act out against gun owners cite the same Washington Post story — mislabeled as an original report by the Salt Lake City Tribune, rather than a republication — saying, \"In Indiana, law enforcement can confiscate weapons without a judge's order. The gun owner must ask the court to get the weapons returned.\"", "This, too, is inaccurate; the law states that in the case of a firearm seizure without a warrant, police must submit \"a written statement under oath or affirmation\" to the circuit or superior court with jurisdiction over the gun owner explaining their reasoning for doing so:", "If the court finds that probable cause exists to believe that the individual is dangerous, the court shall order the law enforcement agency having custody of the firearm to retain the firearm. If the court finds that there is no probable cause to believe that the individual is dangerous, the court shall order the law enforcement agency having custody of the firearm to return the firearm to the individual.", "On 9 May 2018, Dingell and Upton joined two other lawmakers, Republican Rep. Susan Brooks of Indiana and Democratic Rep. Ted Deutch of Florida, in introducing H.R. 5717, which would provide grants to states that adopt their own version of \"red flag\" laws.", "\"In the weeks since the horrific shooting in Parkland, Florida, I have met with law enforcement, prosecutors, mental health experts, the ACLU, students, teachers, parents, and other stakeholders to find common ground,\" Dingell said in a statement:", "One of the biggest takeaways from these conversations is that we need to provide family members and law enforcement the tools needed when they know someone is a threat to themselves or others.", "According to a statement sent to us by her office, the bill requires officers who seize a firearm without a warrant to file documentation regarding the seizure to the appropriate court within 48 hours. The court would also hold a hearing on the issue within 21 days of the seizure to determine whether the firearm owner is dangerous.", "Dingell is listed as a co-sponsor on the bill. In July 2017 she introduced a separate gun-related bill, H.R. 3207, which would make it illegal to \"knowingly sell or dispose of a firearm to a person who has been convicted of a misdemeanor crime of stalking.\" It would also expand misdemeanor domestic violence crimes \"to include the use or attempted use of physical force, or the threatened use of a deadly weapon, by a current or former intimate partner.\"", "Dingell sent us a statement saying that the new bill is based on Indiana's \"red flag\" law, which won support from both Republican Gov. Mitch Daniels and the GOP-controlled state legislature.", "\"This is commonsense legislation that would give law enforcement a tool to ensure individuals deemed a threat to themselves or their community get help, protecting their due process while keeping them safe and their families and communities safe,\" she said.", "Fox News. \"Rep. Debbie Dingell on Finding Common Ground on Guns.\"\r\n    2 April 2018.", "Congresswoman Debbie Dingell. \"Detroit News: Upton, Dingell Lead Panel on School Shootings.\"\r\n    13 March 2018.", "Richardson, Lauren. \"Rep. Debbie Dingell To Introduce National Gun Confiscation Legislation.\"\r\n    Truth Uncensored. 3 April 2018.", "Hawkins, Awr. \"Rep. Debbie Dingell To Introduce National Gun Confiscation Legislation.\"\r\n    Breitbart. 2 April 2018.", "Walsh, Martin. \"Dem Rep. Debbie Dingell To Introduce Gun Confiscation Legislation.\"\r\n    Conservative Daily Post. 3 April 2018.", "Bernstein, Lenny. \"Five States Allow Guns to be Seized Before Someone Can Commit Violence.\"\r\n    The Washington Post. 16 February 2017.", "Congresswoman Debbie Dingell.. \"Dingell, Brooks, Upton, Deutch Hold Press Conference to Introduce Jake Laird Act.\"\r\n    9 May 2018.", "Update [14 May 2018]: Updated with information on H.R. 5717 provided by Rep. Debbie Dingell's office.", "Update [16 May 2018]: Updated with statement from Rep. Debbie Dingell.", "Arturo Garcia is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]