["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "As the House and Senate were finishing the details of a joint version of the Republican-backed tax bill, Rep. Carlos Curbelo, R-Fla., was defending the House’s version as friendlier to Americans of modest means.", "In an appearance on Miami’s WPLG-TV on Dec. 10, Curbelo was asked about the pattern of Americans being projected to gain from the GOP tax bills in the first few years after it’s passed, but then paying more in taxes closer to 10 years after passage.", "Curbelo responded to the question by touting the advantages of the House-passed version compared with the Senate-passed version.", "\"The House bill does have a lot more permanent relief for middle income and even lower income families long term, permanently,\" Curbelo replied. \"The Senate bill, their budget rules are different so they had to put these gimmicks in the bill, frankly. We, in conference, are insisting on the House provisions to make the middle-class relief permanent.\"", "We wondered whether Curbelo was correct that he House bill has \"a lot more permanent relief for middle-income and even lower-income families\" than the Senate bill does.", "Curbelo is correct that in the House’s version of the tax bill, several key provisions -- its replacement of seven existing tax brackets with four, the raising of the standard deduction, and an expanded child tax credit -- are permanent. All of these provisions in the Senate bill expire after 2025.", "There’s only one significant provision in the House bill that would expire -- a family tax credit worth $300 credit for the taxpayer, spouse, and non-child dependents. That provision sunsets in 2022 under the House bill. (A similar, $500 credit in the Senate bill would expire in 2025.)", "The pattern of eventual tax increases in the Senate bill is stronger than from the House bill, the nonpartisan Joint Committee on Taxation found. By 2027, every income group below $100,000 would see an increase, on average.", "So Curbelo has a point that several key House provisions are written to be permanent, unlike the equivalent provisions of the Senate bill.", "It’s important to note, however, that sunsetting provisions aren’t the only cause of later tax increases. Other factors the following provisions of the House bill (and also the Senate bill):", "• The amount of the child credit is not indexed for inflation. By contrast, the provision it effectively replaces -- the personal exemption -- is indexed for inflation.", "• The rate brackets would grow more slowly from year to year because they would be adjusted by a less generous measure of inflation.", "• The earned income tax credit -- a refundable credit for low-income Americans who are employed -- would also increase more slowly because of the same change to the inflation measurement.", "Curbelo said the House tax bill has \"a lot more permanent relief for middle-income and even lower-income families.\"", "That’s generally the case: Only one provision of the House bill that’s likely to be claimed by Americans of modest incomes, a family tax credit, would expire within the first decade, whereas many key provisions in the Senate bill would sunset early.", "However, it’s worth noting that the expiration of provisions is not the only reason that taxpayers are projected to pay more closer to 10 years after the bill’s passage. Another one, unmentioned by Curbelo, is changed treatment of inflation adjustments in the House bill.", "We rate the statement Mostly True.", "Carlos Curbelo, appearance on Miami’s WPLG-TV, Dec. 10, 2017", "Congress.gov, summary of H.R. 1 (House version of the tax bill), accessed Dec. 13, 2017", "Joint Committee on Taxation, \"Distributional effects of the Tax Cuts and Jobs Act, as ordered reported by the Senate Committee on Finance on November 16, 2017\"", "Joint Committee on Taxation, \"Distributional Effects Of H.R.1, The \"Tax Cuts And Jobs Act,\" As Ordered Reported By The Committee On Ways And Means On November 9, 2017\"", "New York Times, \"House vs. Senate: The Tax Changes Up for Debate and How Different Taxpayers Would Fare,\" Dec. 13, 2017", "Email interview with Amir El-Sibaie, analyst at the Tax Foundation, Dec. 13, 2017", "Email interview with Len Burman, co-founder of the Urban Institute-Brookings Institution Tax Policy Center, Dec. 13, 2017", "Email interview with Joanna Rodriguez, spokeswoman for Carlos Curbelo, Dec. 13, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]