["About this rating", "The Food and Drug Administration has halted most of its food inspections due to the partial federal government shut down.", "The agency has recalled some inspectors back to work with no pay, and has restarted some crucial inspections.", "In early-to-mid January 2019, several major news outlets reported that the U.S. Food and Drug Administration (FDA) had halted inspections of various foods as a result of an ongoing partial shutdown of the federal government.", "Although it's true that the FDA halted many inspections on 9 January 2019, the agency also resumed the most high-risk ones on 15 January 2019, when FDA Commissioner Scott Gottlieb announced that furloughed food inspectors would be recalled to carry on their work without pay. We reached out to the FDA's press office but received only an automated response stating that employees were on furlough.", "Gottlieb, however, took to his Twitter account in an effort to keep the public updated and informed:", "We re-starting high risk food inspections as early as tomorrow. We'll also do compounding inspections this week. And we started sampling high risk imported produce in the northeast region today. We'll expand our footprint as the week progresses. Our teams are working.", "— Scott Gottlieb, M.D. (@SGottliebFDA) January 14, 2019", "This work is being done by an inspectorate that's largely going unpaid. These men and women are the tip of the spear in our consumer protection mission. They're the very front line. And they're on the job. The entire nation owes them gratitude. I'm inspired by their dedication.", "— Scott Gottlieb, M.D. (@SGottliebFDA) January 14, 2019", "Sarah Sorscher, deputy director of regulatory affairs at the consumer advocacy organization Center for Science in the Public Interest, told us that due to the shutdown the FDA has been forced to halt roughly two-thirds of routine inspections. \"The number of facilities that get inspected every year is pretty large, and the number of missed inspections [so far] is pretty small in relation,\" she told us by phone. \"The risk that someone would pick up food from a facility that missed an inspection is pretty small, but gets higher the longer the shutdown goes on.\"", "Gottlieb had initially announced that the FDA would suspend routine inspection of foods including, \"routine food safety inspections of seafood, fruits, vegetables and many other foods at high risk of contamination because of the federal government’s shutdown.\" But the agency reversed course, recalling inspectors to resume inspections of the highest-risk food processing facilities.", "Routine inspections are unannounced visits at sites like food processing facilities and dairy farms where inspectors look for \" bugs, rodents, mishandled food, improper preparation and other hazards.\"", "\"We are concerned there may be a limit beyond which these workers can no longer support their own families and continue to do unpaid work,\"  Sorscher told us. \"In the longer term, we’re in a labor shortage and a lot of these jobs are difficult to do and difficult to find people who will do them who are also qualified. There may be long-term impacts if the shut down goes on much longer.\"", "According to Gottlieb, 31 percent of the agency's work load comes from high-risk food inspections. Gottlieb said the FDA typically conducts about 160 inspections per week. High-risk foods include, according to Gottlieb:", "[M]odified atmosphere packaged products; acidified and low acid canned foods; seafood; custard filled bakery products; dairy products including soft, semi-soft, soft ripened cheese and cheese products, unpasteurized juices; sprouts ready-to-eat; fresh fruits and vegetables and processed fruits and vegetables; spices; shell eggs; sandwiches; prepared salads; infant formula; and medical foods.", "A partial federal government shutdown started 22 December 2018 after President Donald Trump demanded a $5.7 billion appropriation for border wall construction be included in the federal budget, something Democrats refused to agree to. The impasse resulted in the longest government shutdown in U.S. history.", "Workers at the U.S. Department of Agriculture, which oversees meat and poultry, have all continued to perform inspections without pay.", "\"People are lining up at the food bank to get food and are expected to be doing inspections to keep our food safe,\" Sorscher said. \"That’s a tough situation to put these workers in.\"", "Kaplan, Sheila.  \"Government Shutdown Curtails F.D.A. Food Inspections.\"\r\n   The New York Times.   9 January 2019.", "Kaplan, Sheila.   \"F.D.A. Says It Will Resume Inspections of Some High-Risk Foods.\"\r\n    The New York Times.   14 January 2019.", "Hirschfeld Davis, Julie and Sheryl Gay Stolberg.  \"Trump Summons Thousands Back to Work Without Pay as Shutdown Drags On.\"\r\n    The New York Times.   15 January 2019.", "Carney, Jordan.   \"McConnell Blocks House Bills to Reopen Government.\"\r\n    The Hill.   10 January 2019.", "Updated to add information and comment from Sarah Sorscher, deputy director of regulatory affairs for the Center for Science in the Public Interest.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]