["On October 8, a family of three – Bandhu Prakash Pal, his pregnant wife and an 8-year-old child – was murdered in West Bengal’s Murshidabad. The BJP claimed that Pal was an RSS worker. This was refuted both by the police and the victims’ family. A week later, the police arrested one Utpal Behara and cited financial dispute as the motive behind the murder. In the backdrop of the triple murder, a screenshot of an article by Daily Hunt titled, ‘पश्चिम बंगाल मे BJP ने ही कराई थी अपने कार्यकर्ता की हत्या, बजरंग दल के 11 कार्यकर्ता गिरफ्तार (BJP had killed its own member in West Bengal, 11 Bajrang Dal workers arrested)’ – was circulating on social media.", "This article was viral on Twitter. It had also been shared on Facebook.", "This report by Daily Hunt was published on June 4, 2018, and is still available online. However, the news is false. According to a March 2018 report by NDTV, two people were killed in violence that erupted during Ram Navami celebration in West Bengal. Two months hence, several media outlets – Rajasthan Patrika, Times of India, Deccan Chronicle – reported that the 11 members of Bajrang Dal were arrested.", "A June 5, 2018 report by Newslaundry said that news agency ANI was the first to publish a report which was later picked up by varied media outlets. However, ANI later took down the copy where it claimed that 11 Bajrang Dal workers were arrested for the murder of two BJP workers. Speaking to Newslaundry, ANI informed that the story was pulled down owing to an “error in assessment”. “We were told that the editorial team mixed up two stories. The arrest of the Bajrang Dal activists was in connection with Ram Navami violence in the state and not the gruesome murders of Bharatiya Janata Party workers,” reported Newslaundry.", "In June this years, the official Twitter and Facebook handles of BJP Madhya Pradesh had shared the same erroneous report carried by Daily Hunt after a BJP worker was killed in West Bengal in violence that erupted during the 2019 Lok Sabha elections. Alt News had debunked the misinformation here.", "A misreport by ANI which was carried by Daily Hunt continues to misinform on social media as the latter is yet to take down the false report.", "Donate Now", "Kinjal Parmar holds a Bachelor of Science in Microbiology. However, her keen interest in journalism, drove her to pursue journalism from the Indian Institute of Mass Communication. At Alt News since 2019, she focuses on authentication of information which includes visual verification, media misreports, examining mis/disinformation across social media. She is the lead video producer at Alt News and manages social media accounts for the organization.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]