["Ahead of the upcoming by-elections that will decide the fate of 27 Vidhan Sabha seats in Madhya Pradesh, a video featuring current Chief Minister Shivraj Singh Chouhan has been doing the rounds on social media. On September 15, Krishna Mohan Sharma, former secretary of the National Students’ Union of India (NSUI) Rajasthan, tweeted the video with the caption, “Shivraj Singh Chouhan is being welcomed with sandals and shoes, he should understand how the public feels now.” In the video, the CM is seen addressing a gathering. In the middle of his speech, people in the audience begin shouting slogans and a slipper is thrown towards the stage. Security personnel standing around the BJP leader surround him to shield him from the attack. The video received 61,000 views at the time of writing.", "चप्पल जुते से स्वागत होना सुरु हो गया है मामा जी को अब समझ जाना चाहिए। pic.twitter.com/z4eE2B4dfK", "— Krishna Mohan Sharma (@KrishnaMohanSha) September 15, 2020", "It is also being shared on Facebook with this claim.", "None of the people in the video can be seen wearing masks which suggests it is not a recent event. When we did a keyword search, we discovered that the video is actually from 2018. This incident found mention in several media reports from September 3, 2018. Some of the prominent media outlets that ran the story were Navbharat Times, One India, The Times of India, NDTV, ABP News, and The Hindu.", "According to a report by Patrika from September 4, 2018, a crowd of people pelted stones at the minister’s chariot during a public rally. This was followed by slippers being thrown at him. Responding to this, Chouhan issued a statement where he dubbed the entire incident a conspiracy by the Congress. Superintendent of Police Tarun Nayak told the outlet that three people had been arrested in this case.", "To sum it up, this viral video of a slipper being thrown at Chief Minister Shivraj Singh Chauhan is actually from 2018, and not a recent incident.", "Donate Now", "Priyanka Jha specialises in monitoring and researching mis/disinformation at Alt News. She also manages the Alt News Hindi portal.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]