["Images of a crying photographer juxtaposed with a picture of Dhoni from the July 10 cricket world cup semi-finals against New Zealand is circulating on social media. One Prabhat Sharma tweeted this collage with the message – “Picture speaks louder than words!”. The tweet has been retweeted more than 1,000 times.", "Picture speaks louder than words! 💔#ThankYouMSD #Dhoni pic.twitter.com/6pRPAFpmB5", "— Prabhat Sharma 🇮🇳 (@Prabhat28432285) July 11, 2019", "The collage is being shared with variants of the message like “Heartbreak photography..Photo lene vala bhi rone laga or photo dene vala bhi rone laga..(“Translation: the one taking the picture is also crying the one whose picture is being taken is also crying”) ..i love my all players..”)", "Heartbreak photography..😭😭😭😭 Photo lene vala bhi rone laga or photo dene vala bhi rone laga..#DhoniForever #Dhoni @msdhoni @saumikpatel1 @imVkohli @ImRo45 @hardikpandya7 @imjadeja #INDvsNZ #heartbeat #CWC19 i love my all players😭😭❤❤❤❤.. pic.twitter.com/bE726Iwn99", "— UMaNG PaTel⚪ (@Umangpatel023) July 11, 2019", "Another user Nagraj Kulkundi tweeted the same collage with the message – “This picture speaks for itself.. a thousand words.” The collage was also shared on a Facebook group Cricket Life, drawing over 500 shares.", "Most heart breaking picture 💔", "Posted by Cricket Life on Wednesday, 10 July 2019", "A reverse image search on Google threw up various articles and social media posts which said that the picture is from January this year when an Iraqi photographer was in tears after his country lost against Qatar in round 16 of the Asian Cup.", "Passionate. Emotional moment for an Iraqi photographer during the Round of 16 clash against 🇶🇦 ! #AsianCup2019 pic.twitter.com/KZoXsp1N4U", "— #AsianCup2023 (@afcasiancup) January 24, 2019", "Sport360 Arabiya had also tweeted the photographer’s pictures on January 25.", "مصور عراقي يبكي أثناء تأدية عمله وهو يشاهد خروج منتخب بلاده من كأس آسيا. 💔 pic.twitter.com/rRoCDOifYF", "— Sport360 Arabiya (@Sport360Arabiya) January 24, 2019", "A report by Fox Sports identified the photographer as Mohammed Al Assasawi.", "In conclusion, pictures of an Iraqi photographer crying when his country lost in the Asian Cup in January 2019 was widely circulated on social media as the photographer crying when Dhoni was run out in the ICC world cup semi-finals between India and New Zealand on July 10, 2019.", "Donate Now", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]