["“You can get coronavirus from getting the flu vaccine. It’s right here in the package insert for the flu vaccine under side effects,” claimed an Instagram post from late September 2020 that is no longer available.", "The post included a screenshot of the private Instagram account @silent.saint, which AFP confirmed has since removed the post. Another screenshot of the post was also reshared on Instagram here.", "While the posts claim that the chart is from a vaccine “package insert,” a keyword search reveals that the chart comes from this 2012 study, conducted years before the novel coronavirus pandemic, which has killed more than 1,057,000 people worldwide.", "The study did not find flu shots give people coronavirus. Rather, it found that in a small group of children who received trivalent inactivated influenza vaccine there was “a statistically significant” increased risk of respiratory virus infection, including coronavirus -- a family of viruses that cause illness ranging from the common cold to more severe diseases.", "However, Brian Ward, professor in the McGill University Department of Medicine, called the study “very weak,” pointing to the small sample size of 115 children.", "The US Centers for Disease Control and Prevention discusses this study on a web page addressing misconceptions about the flu shot saying: “No other studies have found this effect. It’s not clear why this finding was detected in the one study, but the majority of evidence suggests that this is not a common or regular occurrence and that flu vaccination does not, in fact, make people more susceptible to other respiratory infections.”", "Sarah Gilbert, professor of vaccinology at the University of Oxford’s Nuffield Department of Medicine, also said in an email that based on this study alone, “no one should make decisions to avoid flu vaccinations.”", "AFP fact check previously investigated false claims made using this study here.", "Danuta Skowronski, the principal investigator at the BCCDC agreed. Her team published a study in May 2020 that looked at thousands of people over multiple flu seasons in Canada.", "Skowronski said an important contrast with the 2012 study was that the Canadian research relied on a more strict definition of flu symptoms.", "She told AFP by phone, “We saw no association in children nor in adults between the receipt of influenza vaccine and coronavirus risk.”", "Similarly, a 2013 study conducted in the US state of Wisconsin over six flu seasons and including more than 3,000 patients found: “Influenza vaccination was not associated with detection of noninfluenza respiratory viruses.”", "Although the BCCDC research did not specifically assess risk of the novel coronavirus, Lucie Marisa Bucci, Senior Manager of Immunize Canada said in an email: “According to Canada’s National Advisory Committee on Immunization (NACI), there is no current evidence to support the claim that the influenza vaccine increases the risk of Covid-19 infection.”", "Public health officials across Canada strongly encourage the flu vaccine to prevent serious illness and ensure the health care system is not overburdened during the ongoing pandemic.", "The flu shot is a regular target of disinformation. AFP Fact Check has also debunked the false claim that the influenza vaccine contains coronaviruses and the false claim that receiving a flu shot will make you test positive for Covid-19.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]