["This Facebook post which includes the video has been viewed 3.4 million times and shared more than 264,500 times since it was first posted on May 27, 2016.", "The post’s Urdu-language caption translates as: “This is not France, not the US, not Russia but a Pakistani air base. Share this video and scare the hell out of the enemy.”", "Below is a screenshot of the misleading Facebook post:", "The video has also been shared by other Facebook accounts with the same claim that it shows a Pakistani air base, including here and here.", "These two posts were also originally shared in 2016. The videos in the two posts have since received more than 460,000 views between them.", "In March 2019, the Urdu News post was re-shared days after India claimed it had bombed a militant camp and killed a large number of insurgents in disputed Kashmir on February 26, 2019. Pakistan said February 27 that it had shot down an Indian jet.", "Here is an AFP story on the situation.", "The misleading Facebook video was actually filmed at the Kunsan air base in South Korea.", "A reverse image search of keyframes of the clips using the InVID video verification tool found that the footage was originally uploaded to a verified YouTube channel with more than 1.6 million subscribers called ‘AiirSourceMilitary’ on April 19, 2013.", "The video is entitled ‘Massive USAF F-16 Elephant Walk At Kunsan Air Base South Korea’.", "Below is a comparison of screenshots of the video from the misleading Facebook post and the video on the AiirSourceMilitary channel. The formation and style of the jets, as well as the terrain in the videos, is entirely consistent:", "The 2013 video on the AiirSourceMilitary YouTube channel, which shows a wider frame for the clip than the misleading Facebook video, contains a watermark for Aiirsource.com.", "The YouTube channel’s ‘About’ section contains an official email contact associated with Aiirsource.com.", "The Aiirsource.com website describes itself as a news site which covers the US army, navy, marine corps, air force and coast guard.", "The jet fighter video on the AiirSourceMilitary YouTube channel is available to view in high definition (1080p), indicating Aiirsource.com received the video file from an original source.", "Below is a screenshot of the YouTube video with the watermark and high definition setting circled in red:", "The channel credits SSgt Michael Schocker, 8th Fighter Wing Public Affairs as the source.", "SSgt Michael Schocker has captured other videos of Kunsan Air Base distributed by the US military’s media centre, the Defense Visual Information Distribution Service (DVIDs), since at least 2012.", "The DVIDs website includes his video from May 2012 and another video he filmed in September 2012.", "On his Facebook profile, Schocker lists himself as a former broadcaster at Kunsan Air Base. On February 6, 2019, he shared photos of his retirement ceremony.", "Satellite images of Kunsan Air Base on Google Maps correspond with the scene of the runway in the video of the fighter jets.", "The style of the fighter jets in the video is also entirely consistent with a video of F-16 Fighting Falcon aircrafts at Kunsan Air Base on the US military’s official website.", "Below is a screenshot from the video:", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]