["The photo has been shared more than 37,000 times after it was published in this Facebook post on March 27, 2019.", "Below is a screenshot of the misleading post:", "The Hindi-language text above the image translates to English as: \"Arrested in Australia for wearing a burqa. But salute this daughter who has shown courage in front of disbelievers of Islam (police). Got arrested but saved the honour of Islam. Salute to your greatness, Islamic sister. If you do not share, then you would be doing injustice.\"", "The burqa is an Islamic outer garment worn by women which covers the body and the face, according to this explainer published by Australian public broadcaster SBS.", "The same claim has also been shared thousands of times alongside the same photo on social media, such as here on Facebook, here on Twitter and here on Instagram.", "The claim is false; the photo is actually an AFP image showing a woman arrested in Spain for her alleged involvement in Islamic State (IS) recruitment.", "The photograph was published here on the AFP Forum on September 5, 2015.", "The caption of the picture says: “Spanish police arrest an 18-year-old Moroccan woman suspected of recruiting other women via the Internet to the jihadist group Islamic State (IS), in Gandia on September 5, 2015. She was the latest in a series of suspected IS sympathisers detained in Spain since last year over security fears. AFP PHOTO/ JOSE JORDAN”.", "Gandia is a city located on the east coast of Spain.", "Below is a screenshot of the AFP image:", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]