["By Robert Farley", "Posted on December 14, 2017", "Arguing for a merit-based immigration system, President Donald Trump offered a muddled, inaccurate and unsubstantiated critique of a program that annually provides visas by lottery to qualified and screened applicants from countries with low immigration rates.", "Trump said that other countries are gaming the Diversity Immigrant Visa Program to “take their worst” and “put them in the bin” so that when the lottery occurs, “they have the real worst in their hands. … And we end up getting them.”", "There’s no evidence for that.", "The Diversity Immigrant Visa Program, or DV program, uses a computer lottery system to randomly issue up to 50,000 immigrant visas each year to applicants from countries with low rates of immigration to the United States. Millions of applicants apply annually for the diversity visas.", "Trump has thrown his support behind the RAISE Act, a bill that seeks to halve legal immigration into the U.S. by reducing the number who gain entry based on family ties, capping the yearly number of refugees admitted and emphasizing a “merit-based” immigration system. It also would do away with the Diversity Immigrant Visa Program.", "Trump’s most recent critique of the DV program came during a rally in Pensacola, Florida, on Dec. 8.", "Trump, Dec. 8: How about the lottery system, folks? Do you see that? That’s the guy in New York City, the lottery system, where they put names in a bin. You know, you think these countries are legit when they do their lottery system. So what they do, I would say, but more than just saying, they take their worst and they put them in the bin. And then when they pick the lottery, they have the real worst in their hands, oh, here they go. And we end up getting them. No more lottery system. We are going to end that. We have already started the process. We want people coming into our country who love our people, support our economy, and embrace our values. It’s time to get our priorities straight.", "Trump’s reference to “the guy in New York City” is to Sayfullo Habibullaevic Saipov, an Uzbekistan-born immigrant charged with killing eight people in New York City on Oct. 31. Trump rightly notes that Saipov came to the U.S. legally in 2010 through the diversity visa program, as was confirmed by the Department of Homeland Security.", "But his appraisal of the program unravels after that.", "Let’s start with the claim that the DV program is bringing “the real worst” from other countries.", "There were nearly 9.4 million qualified entries in the lottery in 2015, and the DV program ended up bringing 47,934 new legal permanent residents to the U.S. — about 4.6 percent of all of those who obtained lawful permanent resident status through various immigration programs that year.", "In order to be eligible for the lottery, applicants must demonstrate that they have a high school education or its equivalent or “two years of work experience within the past five years in an occupation that requires at least two years of training or experience to perform.”", "But that’s not all. If one is selected through the lottery, he or she still has to go through a background security vetting process.", "“It is a complicated and lengthy process,” explained Stephen W. Yale-Loehr, who teaches immigration law at Cornell Law School. “Among other things, the consular officer must make sure the individual is not ‘inadmissible.’ This means that the person has not committed a crime, doesn’t have a serious health problem, isn’t a terrorist, hasn’t committed fraud, and hasn’t overstayed in the U.S. before.”", "There are more than a dozen grounds of inadmissibility, including, as Yale-Loehr said, health issues, criminal activity, national security concerns and the “likelihood of becoming a public charge,” meaning “a person who is primarily dependent on the government for subsistence.”", "“National security is our top priority when adjudicating visa applications,” a State Department official told us via email. “Every prospective traveler to the United States undergoes extensive security screening. No visa can be issued unless all concerns raised by the screening are fully resolved.", "“Applicants are continuously screened, both at the time of their visa application and afterwards, to ensure they remain eligible to travel to the United States,” the official said. “This screening draws on information from the full range of U.S. government agencies, including thorough biographic and biometric screening against U.S. law enforcement and counterterrorism databases. Biometric screening includes checks based on fingerprints and/or facial recognition software.”", "The screening process also includes an interview by consular officers with a line of questioning “tailored to the circumstances of each applicant,” the State Department official said.", "In a press briefing on Dec. 12, Francis Cissna, the director of U.S. Citizenship and Immigration Services, contended “the criteria [for the DV program] are very low.” As a result, he said, “either you have no education at all and very little skills, or you have a minimum of education and no skills at all.”", "But that’s not borne out by the statistics.", "According to a 2011 report from the Congressional Research Service, a higher percentage of immigrants who entered the U.S. through the DV program had managerial and professional occupations than green card holders overall. Specifically, the report states, 24 percent of diversity immigrants reported managerial and professional occupations in 2009, compared with 10 percent among all green card holders that year. Diversity immigrants also had a lower unemployment rate (3 percent) than all green card holders (8 percent) that year.", "More recent data from the Department of Homeland Security’s 2015 Yearbook of Immigration Statistics show 32 percent of those who came through the DV program in 2015 were employed in management, professional and related occupations; another 36 percent were students or children. That’s a lower percentage in management, professional and related occupations than among immigrants who came to the U.S. via employment-based preferences (41 percent). But it’s far higher than the percentage among those who came via family-sponsored preferences (12 percent) or among those who were granted green cards because they were immediate relatives of U.S. citizens (9 percent). That year, 497 of the 47,934 DV immigrants were listed as unemployed, or about 1 percent. That’s far lower than the percentage of unemployed people among all green card recipients (5.1 percent).", "It is unclear, exactly, how Trump is suggesting other countries “take their worst and they put them in the bin” so that after the lottery, “we [the U.S.] end up getting them.” The White House press office did not respond to our email seeking clarification.", "But there is no evidence to support Trump’s claim of any sort of organized effort by foreign governments to steer their “real worst” to the U.S.", "“The diversity lottery is a true lottery,” Yale-Loehr told us via email. “There is no way a foreign government can game the lottery to offload the worst of their citizenry.”", "Cissna noted that in 2003, the State Department’s Office of the Inspector General warned about problems with fraud in the program and cautioned that the DV program “contains significant risks to national security from hostile intelligence officers, criminals, and terrorists attempting to use the program for entry into the United States as permanent residents.”", "A 2007 Government Accountability Office report warned that the DV program was “particularly vulnerable to manipulation” and fraud risk, even though researchers had found “no documented evidence of DV immigrants from state sponsors of terrorism committing terrorist acts.” The authors note that the State Department, then under President George W. Bush, “was disappointed with the report’s findings and did not agree with the recommendations” and rejected them.", "A 2011 Congressional Research Service report similarly said that “[c]ritics of the diversity lottery warn that it is vulnerable to fraud and misuse and is potentially an avenue for terrorists, citing the difficulties of performing background checks in many of the countries eligible for the diversity lottery. Supporters respond that background checks for criminal and national security matters are performed on all prospective immigrants seeking to come to the United States, including those winning diversity visas.”", "At the start of his remarks on Dec. 12, Cissna noted that there was also a DV connection related to Akayed Ullah, who is alleged to have set off a pipe bomb in a bungled suicide attack at a bus terminal in New York on Dec. 11. Ullah came to the U.S. based on a family connection to an uncle who originally came to the U.S. through the DV program. But Ullah is not an example of a terrorist who sneaked into the country through any immigration program. According to the criminal complaint filed against Ullah, he came to the U.S. in 2011 and his radicalization began about three years later, in at least 2014.", "The State Department warns about the possibility of fraudulent emails sent to lottery applicants that purport to be from the U.S. government “in an attempt to extract payment from DV applicants.”", "“So even if a government tried to game the lottery, it should be caught,” Yale-Loehr said. “If people are caught committing fraud, they can’t immigrate. I have never heard of a foreign government trying to game the diversity lottery system. … The bottom line: President Trump’s statements about how the diversity visa program works are false. ”", "The DV program has been in Trump’s crosshairs for months, but he renewed calls for its elimination in the wake of Saipov’s attack in New York City. At the time, Trump criticized Sen. Chuck Schumer for helping to create the DV program. As we wrote, Schumer was instrumental in helping to create the program back in 1990 — which was initially intended in large part to benefit Irish immigrants. Schumer, the Democratic leader in the Senate, also was part of the bipartisan Gang of Eight in 2013 that sponsored an immigration overhaul that would have done away with the DV program.", "The demographics of those who benefit from the DV program have changed dramatically since its inception. In 2015, DV program visas were offered to residents of 182 different countries, with the largest contingent coming from the African countries of Cameroon, Egypt, Ethiopia, Liberia and the Democratic Republic of Congo, as well as from Nepal and Iran. Excluded are those from countries with high rates of immigration to the U.S. In 2015, that included 19 countries, such as Mexico, India, the Philippines, China, Canada and the United Kingdom.", "The program may not enjoy the political support it once did, and Trump is, of course, entitled to his opinion about the need to pivot to a more merit-based immigration system. But we find no basis for his warning that countries are gaming the lottery system and sending “the real worst” of their citizens to the U.S.", "FactCheck.org Rating:", "Read More", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]