["The screenshot of the tweet, which bears the date September 4, 2019, attributes the following words to Trump: “This barbaric attacks by South African is very disappointing, its time we put South Africa under strong economic sanctions, first it was the minority White people now its African. Either Cyril get his people in line or we pull out all our investments and they learn.”", "Various websites reported that Trump was threatening sanctions, based on the supposed tweet.", "One such article by the website Sahara News, which we’ve archived here, has been shared more than 650 times on Facebook, according to data from social media analysis tool CrowdTangle.", "Similar articles can be found on the Zambian website Tumfweko and Nigerian site My State News.", "Comments on Facebook posts sharing the articles suggested that that some readers believed that the tweet was really posted by Trump.", "However, a couple of factors immediately suggested that the tweet was not real.", "Firstly, while Trump often uses colourful language in his tweets, this would make for an unusually ungrammatical post from @realDonaldTrump.", "Secondly, you would expect widespread media coverage of such a threat of sanctions by the US president. International media have been closely following the unrest in South Africa, which left at least 12 people dead -- you can read the latest report from AFP here.", "The last time Trump tweeted about South Africa in August 2018, addressing what he called government \"land and farm seizures”, his remarks garnered worldwide media coverage -- as most of his tweets do.", "However, no major media outlet had picked up the supposed sanctions threat.", "We scanned Trump’s Twitter account on September 4 and saw that he’d tweeted extensively about China, Hurricane Dorian and even a thread on the “8 FACTS that #FakeNewsCNN will ignore in tonight’s ‘Climate Forum’” -- but nothing about South Africa.", "To be sure the tweet wasn’t deleted, AFP Fact Check used the Trump Twitter Archive, a tool that allows you to trace back tweets made by the US president -- even posts that have been deleted. We found no tweets on September 4, 2019 about economic sanctions against South Africa.", "A search of tweets about South Africa also confirms that Trump has not tweeted about the country since August 2018.", "It’s likely that an online generator was used to produce the post -- this AFP fact-check about fabricated Trump tweets on Canada, and this post about false posts from Zimbabwe, show how such websites can be used to spread misinformation.", "As reported by AFP, South African President Cyril Ramaphosa has sent high-ranking emissaries on a mission to reassure other African countries after foreigners were attacked and their stores ransacked during this month’s violence.", "The mission, led by former minister Jeff Radeba, left South Africa on Saturday and will visit Nigeria, Niger, Ghana, Senegal, Tanzania, DR Congo and Zambia.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]