["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Andrew Napolitano’s contrarian view of the Civil War is that it did not need to be fought. In their Daily Show debate, host Jon Stewart rejected that conclusion in the strongest terms.", "\"If there is ever any use of federal power that is justified, would it not be to end the most horrific, abhorrent practice in the history of mankind?\" Stewart asked.", "\"After it had tried everything else,\" Napolitano replied. \"Like abolishing the Fugitive Slave Act, which Lincoln enforced and his judges enforced and his federal marshals enforced until the Civil War was over and Lincoln was nearly dead.\"", "We are fact-checking several claims from the Civil War debate between Napolitano, a libertarian pundit and former judge, and Stewart. Here we’re looking at Napolitano’s claim that Lincoln enforced something called the Fugitive Slave Act until the Civil War was over.", "The Fugitive Slave Act of 1850 made it easier for slave owners to use the federal government to get back the people who had escaped bondage. If a person found refuge in a free state, the act expanded the number of federal officials who could order their rendition back into slavery. The act also simplified the legal steps required by the owner to prove his claim and required the state to bear any costs involved.", "The law was part of a package of changes designed to ease tensions over slavery known as the Compromise of 1850.", "It’s clear that federal officials enforced the Fugitive Slave Act before the war, but Napolitano said it continued during the war and that enforcement took place under Lincoln himself.", "That specific claim is oversimplified. (Napolitano did not respond to our request for comment.)", "The picture is a bit complicated because federal policy changed over time as Congress and Lincoln navigated through the challenges of undermining the Confederacy, keeping peace within Union border states and ending slavery.", "By the time Lincoln took office in March 1861, seven states had seceded but war had not yet broken out. That came a month later. Lincoln’s first inaugural address offered the slave states, a group that included states still within the Union, full enforcement of the Fugitive Slave Act. Lincoln said that so long as the law was on the books, he would follow it. In a further effort to stave off war, he said \"there will be no invasion, no using of force against or among the people anywhere.\"", "It would be difficult to overstate the importance Lincoln placed on the rule of law. In many of his writings, he expresses a keen tension between his personal values and the laws of Congress and the Constitution.", "When the war started, two policies emerged, one for the South and one for the North. By August 1861, Congress had passed the First Confiscation Act, which authorized Union forces to seize any slaves used by Confederate forces. Military commanders in the field, however, had different policies. Even though the Secretary of War at the time ordered officers to provide protection to slaves, some refused them sanctuary.", "At about the same time, escaped slaves from Maryland (a border state) and unionists living in Virginia (a Southern state) were coming into the District of Columbia. Historian Edna Greene Medford wrote that Lincoln advised local authorities to allow Virginia owners to reclaim their slaves. The marshal for the district, Ward Lamon, a close friend and Lincoln appointee, supported the policy, arguing that the Fugitive Slave Act required it.", "University of Massachusetts historian Manisha Sinha, who appeared alongside Stewart and Napolitano on The Daily Show, told us that Lincoln balanced a desire to end slavery with his desire to win the war.", "\"In the first two years of the war he was willing to respect the rights of slaveholders in the border slave states simply to prevent them from seceding,\" Sinha said.", "In July 1862, Congress passed the Second Confiscation Act, which was a broader statute and allowed Union forces to shelter escaped slaves from owners in any of the Confederate states. That still left slaves in Union states at legal risk if they got away from their owners.", "Lincoln’s Emancipation Proclamation ended slavery in the Confederate states in January 1863, but it wasn’t until passage of the 13th Amendment in January 1865 that the United States abolished slavery everywhere within its borders. In June 1864, Congress repealed the Fugitive Slave Act.", "The Civil War ended a year later, in spring 1865.", "Our ruling", "Napolitano said Lincoln, his marshals and his judges enforced the Fugitive Slave Act until the war was over. The record is much more complicated. Lincoln and other federal officials did enforce the law in some instances in the Union states in the early part of the war but not in every state and not consistently. The policy was quite different for the Confederate states. In that same period, Lincoln’s military and Congress moved to protect slaves who escaped from Confederate owners.", "Lincoln issued the Emancipation Proclamation mid-way through the war, freeing all slaves in Confederate states.", "Napolitano repeated the word \"enforced\" three times for emphasis. The record is much more mixed and certainly, Napolitano gets his dates wrong. Congress repealed the Fugitive Slave Act in 1864, a year before the war ended.", "The judge’s words have a sliver of accuracy but overall, we rate his claim Mostly False.", "Comedy Central, The Daily Show, March 11, 2014", "Virginia Foundation for the Humanities, Encyclopedia Virginia: The Fugitive Slave Act of 1850", "Dickinson College, House Divided Project: Congressional confiscation acts, July 14, 2012", "USHistory.org, The south secedes", "Marquette Law Review, Colonel Utley's Empancipation--or, How Lincoln Offered to Buy a Slave, Summer 2010", "National Archives, Preliminary Emancipation Proclamation, Sept. 22, 1862", "Reddit, Multiple claims about slavery and the Civil War - responses", "Encyclopedia Britannica, Fugitive Slave Acts", "The Emancipation Proclamation: Three Views (Conflicting Worlds), Harold Holzer, Edna Greene Medford and Frank J. Williams, May 2006", "Email interview, Manisha Sinha, adjunct professor of history, University of Massachusetts - Amherst, March 17, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]