["About this rating", "On 10 March 2016, the web site DailyNewsBin published an article claiming that Bernie Sanders \"gave a speech to Bank of America\" and asked when he would \"release the transcripts\", referencing a campaign controversy about fellow Democratic presidential candidate Hillary Clinton, who (according to public disclosures) earned millions in paid speeches to the financial industry.", "DailyNewsBin maintained that Sanders, who has repeatedly called for Clinton to release the transcripts from her speeches, hypocritically gave similar speeches without doing the same:", "Bernie Sanders, sinking in the democratic primary race and now 1.7 million popular votes behind rival Hillary Clinton, has settled on his last ditch effort at getting back into the game. He’s insinuating that Clinton can’t be trusted and has something to hide because she gave speeches sponsored by Wall Street entities like Goldman Sachs. “Release the transcripts,” he now routinely demands. One little problem: Sanders just gave a speech sponsored by Bank of America and Liberty Mutual. Will he release his transcripts?", "The Bernie Sanders speech took place on Friday, February 5th of this year in New Hampshire. The “Program Sponsors” for the event, which is fancy way of listing the corporate entities that forked over money, includes no less than five of the multibillion dollar corporate entities that Sanders routinely blames for all the nation’s ills while insisting he hasn’t taken any money from.", "The list includes Bank of America, Comcast, Fidelity Investments, Liberty Mutual, and Lincoln Financial Group. It’s a who’s who of the Wall Street entities that Bernie routinely professes to hate.", "The Clinton speeches were controversial before Sanders announced his intent to enter the presidential race on 26 May 2015. On 22 May 2015, NPR reported:", "Clinton also gave speeches at four financial institutions that netted the foundation somewhere between $1 million and $2 million. The revelation that Clinton's foundation was paid hundreds of thousands of dollars by organizations like Goldman Sachs and Citigroup could help to muddy the populist image she has been trying to strike on the campaign trail. Most recently, she has hurled barbs at Wall Street hedge fund managers as she advocates for a fairer tax code.", "By 19 February 2016, Clinton's speeches became a frequent point of campaign debate. Clinton said that she would release the transcripts for those speeches when all other candidates did the same, and the Sanders campaign subsequently issued the following statement:", "Sen. Sanders accepts Clinton’s challenge. He will release all of the transcripts of all of his Wall Street speeches. That’s easy. The fact is, there weren’t any. Bernie gave no speeches to Wall Street firms. He wasn’t paid anything while Secretary Clinton made millions, including $675,000 for three paid speeches to Goldman Sachs.", "DailyNewsBin's report omitted any details about the speech (or speeches) Sanders purportedly gave on 5 February 2016 to big banks; no context or identifying information was supplied to enable readers to learn more about the claim. We found two speeches made by Sanders on 5 February 2016. Neither was shielded from public view. One was a 27-minute long appearance at a fundraiser in New Hampshire, freely available in full online:", "The second clip was an event at which both Sanders and Clinton appeared:", "That event, \"Politics & Eggs,\" is sponsored by the New England Council (described on its web site as \"a non-partisan alliance of businesses, academic and health institutions, and public and private organizations throughout New England formed to promote economic growth and a high quality of life in the New England region\"). The site provided a lengthy history and context for \"Politics & Eggs\" events:", "Taking advantage of New England’s unique position as home to the nation’s first presidential primary in New Hampshire, the Politics & Eggs series was launched in 1996 as a forum for local business leaders to hear from presidential candidates in an intimate setting as they visit the Granite State to campaign and build early support.", "Since its inception, the breakfast series has played host to nearly every major party presidential candidate and is today considered a “must-stop” on the presidential campaign trail.” In fact, Politics & Eggs made a cameo appearance in NBC’s hit show “The West Wing,” with candidates autographing the series’ signature wooden eggs.", "In recent years, the series has expanded to include issues forums held in the years between presidential election cycles. These events feature nationally known political figures, analysts, and respected journalists.", "Politics & Eggs is a partnership between The New England Council and the New Hampshire Institute of Politics & Political Library at Saint Anselm College. Events held either on the campus of Saint Anselm College in Manchester, NH, or at the Bedford Village Inn in Bedford, New Hampshire, both just an hour’s drive from Boston and easily accessible from all parts of New England.", "Politics & Eggs relies on the generosity of our sponsors to offer this program at no cost to our guests. See the full list of current series sponsors below.", "\"Politics & Eggs\" was described as \"a forum for local business leaders to hear from presidential candidates.\" Both Sanders and Clinton spoke to locals attending the event on 5 February 2016, not private corporations.", "DailyNewsBin called upon Sanders to \"release\" the \"transcripts\" of the event, but both candidates' \"Politics & Eggs\" appearances were widely covered in the news, including a full transcript of Sanders' speech.  Transcripts for both Clinton and Sanders' \"Politics & Eggs\" speeches were available alongside full video on C-SPAN's website, negating the need for a release of such material.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]