["About this rating", "Jane Sanders and then-Mayor Bernie Sanders traveled to the Soviet Union shortly after their wedding as part of a government trip to establish a sister-city relationship between Burlington, Vermont, and Yaroslavl. Sanders has previously joked that this trip was a \"strange honeymoon.\"", "This trip was not a \"honeymoon\" in the traditional sense and did not occur during the \"height of the cold war.\" The purpose of this trip was to establish a sister city in Russia, not for the newlyweds to enjoy a romantic getaway. Bernie and Jane Sanders took their real honeymoon in St. Lucia in the Caribbean the following year.", "In February 2020, news reports broke that Russia was once again working to meddle in the United States presidential election. These reports renewed concerns about U.S. President Donald Trump's connections to Russia, but also about alleged ties of his Democratic opponents, chiefly U.S. Sen. Bernie Sanders.", "Critics of Sanders were quick to claim that he had \"honeymooned\" in the Soviet Union, implying that the 2020 Democratic presidential candidate may have some sort of nefarious ties to, or at the very least a soft spot for, Russia.", "Former Wisconsin Gov. Scott Walker, for instance, posted on Twitter:", "Likewise, former New York Mayor Rudy Giuliani claimed that Sanders \"liked Communism so much\" that he \"honeymooned\" in the Soviet Union:", "Fox News anchor Sean Hannity went so far as to claim that Sanders honeymooned in the Soviet Union during the \"height of the Cold War.\"", "A bit of truth exists to this claim. Sanders did travel to the Soviet Union shortly after his wedding in 1988, and Sanders himself has described this trip as a \"very strange honeymoon.\" However, a romantic getaway was not the main focus of this trip. Sanders, who was the mayor of Burlington, Vermont, at the time, took a 12-person delegation of city representatives and officials, including his new wife Jane Sanders, the director of the Mayor's Youth Office, on a trip to the Soviet Union to establish a sister city relationship with Yaroslavl.", "Furthermore, this trip occurred in June 1988. This was not the \"height of the Cold War,\" as Hannity claimed. This trip occurred during the final years of the Cold War (which ended roughly in 1991) while tensions were de-escalating.", "Sanders explained the purpose of this trip in a November 1987 news article published in the Burlington Free Press:", "\"The concept of the sister-city program is very simple but very profound,\" Sanders said at a news conference. \"The Goal is that by encouraging citizen-to-citizen exchange ... we can break down the barriers and stereotypes which exist between the Soviet Union and the United States.\"", "The mayor acknowledged that the idea may draw some opposition, but said he hoped that most people in Burlington would support the concept, regardless of their political affiliation.", "\"Ultimately in my view, peace is going to come about when human beings start talking to human beings and this is a part of that process.\"", "Wed, Nov 4, 1987 – Page 1 · The Burlington Free Press (Burlington, Vermont) · Newspapers.com", "On May 31, 1988, a few days after Sanders' wedding and the day the Burlington delegation was set to leave for the Soviet Union, The Associated Press reported that this trip wasn't exactly a honeymoon:", "The mayor of Burlington and his new bride leave Tuesday for a 10-day trip to the Soviet Union, three days after exchanging vows at a civil ceremony in Vermont's largest city [...]", "The Soviet excursion is not exactly a honeymoon. Sanders is leading a delegation that will try to establish a sister-city relationship with the Soviet city of Yaroslavl, population 500,000.", "Tues, May 31, 1988 – 3 · Bennington Banner (Bennington, Vermont) · Newspapers.com", "Critics of Sanders were not the first to claim that the Democratic presidential candidate had \"honeymooned\" in Russia. In fact, Sanders himself described this trip as a \"romantic honeymoon\" in his 2015 book \"Outsider in the White House.\" However, this appears to be a bit of a tongue-in-cheek reference as he describes the trip a few sentences later as a \"very strange honeymoon.\"", "On May 1988, Jane and I were married. The marriage ceremony was held - where else? - in North Beach, a public park on Burlington's waterfront. A lot of people attended.", "On the next day we began a quiet, romantic honeymoon. We went to Yaroslavl, in the Soviet Union, along with ten other Burlingtonians, to finalize our sister-city relationship with that city. Trust me. It was a very strange honeymoon.", "A spokesperson for Sanders' campaign told us that the senator has \"joked for years,\" including in the above-quoted passage, that this trip was a \"strange honeymoon.\" Furthermore, the spokesperson told us that this trip was pre-scheduled before Sanders' marriage proposal, and that the wedding date was set to \"coincide with that trip because they didn't want to take more time off.\"", "Bernie and Jane Sanders took their real honeymoon the following year in St. Lucia in the Caribbean. The New York Times reported in December 2015 (emphasis ours):", "The couple married in 1988, squeezing their wedding in before a trip to Yaroslavl, in the Soviet Union, Burlington’s sister city. The trip — which the couple jokingly referred to as a honeymoon — has become something of a punch line for Republican candidates who accuse Mr. Sanders of Bolshevism. Ms. Sanders has also seemed to have fun with the idea. In August 1988, she jokingly responded to an inquiry to her office about Russian-language courses, beginning “Dear Fellow Traveler.”", "The couple had a more traditional honeymoon a year later, in St. Lucia in the Caribbean.", "It should also be noted that the suggestion for Yarsovl to become Burlington's sister city did not originate with Sanders. An April 1988 article from the Burlington Free Press reported that Robert Daniels, a University of Vermont history professor, suggested Yaroslavl to be Burlington's sister city, noting that the two cities share similar \"forest and dairy\" environments, and that Yaroslavl's university was comparable to the University of Vermont.", "In summation:", "A spokesperson for Sanders told us: \"St Lucia was the real honeymoon, Yaroslav was a pre-scheduled trip the day after they were married. It was a fun joke to call it a honeymoon, but not a real one.\"", "Horowitz, Jason.   \"Jane Sanders Knows Politics, and How to Soften Husband’s Image.\"\r\n    New York Times.   28 December 2015.", "Warzel, Charlie.   \"Russia Wants to Meddle in Our Election. We’re Helping.\"     New York Times.   25 February 2020.", "Walsh, Molly.   \"Teen Center: Not All Wall Murals Are Created Equal.\"\r\n    Burlington Free Press.   30 July 1988.", "Corredera, Enrique.   \"City Seeks Sister in Soviet Union.\"\r\n    Burlington Free Press.   4 November 1987.", "Sanders, Bernard.   \"Outsider in the White House.\"\r\n    Verso Books.   2015.", "Associated Press.   \"Burlington Mayor Weds.\"\r\n    31 May 1988.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]