["About this rating", "In April 2017, an image was circulated by click bait web sites that they claimed is a photograph of the ghost of actor Paul Walker on the set of The Fate of the Furious, the eighth movie in the \"Fast and the Furious\" franchise (alternately called The Fast and the Furious 8):", "Paul Walkers Ghost Appears in The Fast & Furious 8 (Incredible)", "[...]", "And very recently many people say they have seen his ghost prowling the set of the latest movie of \"Fast & Furious\" movie which the authors was released in April 14, 2017.", "Walker was one of the central figures of the series until he and friend Roger Rodas died in a November 2013 car crash in Santa Clarita during the filming of Furious 7.  In order to finish the movie, producers brought in Walker's brothers, Caleb and Cody Walker, to stand in for the deceased actor in a few scenes:", "Paul Walker's brothers are helping \"fill in small gaps\" in \"Fast & Furious 7\" action sequences not finished before the actor's death, producers said Tuesday.", "Walker died in a fiery car crash during a Thanksgiving break in filming last November, forcing a halt to production.", "Here is a comparison of the real image taken in May 2014 in Malibu, California (left) and the fake ghost image (right):", "The \"ghost\" image was taken on the set of Furious 7 and shows one of Walker's brothers, who was then partially erased to give him a ghostly appearance.", "Duke, Alan.   \"Paul Walker's brothers help finish 'Fast & Furious 7' action scenes.\"\r\n    CNN.   16 April 2014.", "Just Jared.   \"Paul Walker's Brothers Hang with 'Fast & Furious 7' Cast On Set.\"\r\n    20 May 2014.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]