["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Soon after an article was published about a new study claiming New Jersey had the lowest risk of corruption in the nation, the state’s Republican Party told its Twitter followers the first-place finish was the result of the \"comeback\" led by Gov. Chris Christie.\n\n\"And the #jerseycomeback keeps rolling! Thanks to @GovChristie NJ now has lowest corruption risk of any state,\" according to the March 19 tweet from the New Jersey Republican State Committee.\n\nBut PolitiFact New Jersey found that the regulations behind New Jersey’s highest scores were put in place before Christie became governor. Christie, a Republican, has proposed a series of ethics reforms, but they’ve been stalled by the Democrat-controlled Legislature.\n\nLet’s explain the corruption risk investigation.\n\nThe State Integrity Investigation was undertaken by journalists in every state, who analyzed 330 so-called \"corruption risk indicators\" across 14 categories. The analyses focused, in part, on the existence of certain laws and their effectiveness.\n\nOn its report card, New Jersey received A grades in six categories, including State Pension Fund Management and Ethics Enforcement -- two categories where New Jersey ranked first. To analyze the Republicans’ tweet, we researched the origins of regulations cited within five of those categories. No laws were cited in the sixth category.\n\nBased on our review, all of those regulations were put into effect before Christie took office.\n\nHere’s a few examples:\n\nThe report card points to various regulations governing lobbying activities, which Gov. Jim McGreevey updated with a series of laws enacted in June 2004.\n\nThe New Jersey Conflicts of Interest Law, which covers various ethics rules, has been in effect since 1972. In January 2006, Gov. Richard Codey approved a bill to strengthen those regulations.\n\nCodey also signed a \"pay-to-play\" reform bill in March 2005, prohibiting state contracts of more than $17,500 for certain political donors. Gov. Jon Corzine expanded on those pay-to-play rules through an executive order in September 2008.\n\nThe report card notes how Christie issued an executive order in April 2010 to specify who must file financial disclosure statements, but previous governors have taken similar actions.\n\nThrough a spokesman, we asked journalist Colleen O’Dea, an editor-at-large at NJSpotlight, who conducted the investigation in New Jersey, about whether Christie’s reforms contributed to the state’s score. Here’s what she said:\n\n\"I really have to tell you that there have been virtually none. Christie came in and has called for numerous reforms but has put through few, if any of those things our survey asked about.\"\n\nBut Doug Mayer, spokesman for the New Jersey Republican State Committee, argued that Christie’s work as U.S. Attorney in prosecuting corruption cases led to an overall change in New Jersey’s political culture.\n\n\"You would be hard pressed to find anyone in New Jersey, or the entire country for that matter, who doubts Governor Christie’s commitment or actual record on prosecuting political corruption. Some people don’t like to admit it, but the Governor’s record as a U.S. Attorney is impeccable and led directly to New Jersey’s overall change in political culture,\" Mayer said in an e-mail. \"It is a fight he continues to this day with a substantial portion of his agenda dedicated to strengthening New Jersey’s ethics laws.\"\n\nHowever, such prosecutions did not factor into New Jersey’s score in the corruption risk investigation, according to Randy Barrett, spokesman for the Center for Public Integrity, one of the collaborators behind the project.\n\n\"We weren’t looking at people, just the structures to deliver (or not) transparency and accountability,\" Barrett told us in an e-mail.\n\nOur ruling\n\nReferring to a nationwide investigation comparing states for their risk of corruption, New Jersey’s Republican Party claimed in a March 19 tweet: \"Thanks to @GovChristie NJ now has lowest corruption risk of any state.\"\n\nBut the regulations behind New Jersey’s highest scores were put in place before Christie became governor. As governor, Christie’s proposed ethics reforms have stalled in the Democrat-controlled Legislature.\n\nWe rate the statement False.", "To comment on this ruling, go to NJ.com.", "Tweet sent by New Jersey Republican State Committee, March 19, 2012\n\nThe Star-Ledger, Report: N.J. has lowest corruption risk of any state, March 19, 2012\n\nState Integrity Investigation, New Jersey: The story behind the score, accessed March 19, 2012\n\nState Integrity Investigation, How did New Jersey finish first?, March 19, 2012\n\nState Integrity Investigation, New Jersey: Corruption Risk Report Card, accessed March 19-22, 2012\n\nE-mail interview with Randy Barrett, spokesman for the Center for Public Integrity, March 20-22 and 29, 2012\n\nExecutive Order No. 8, Orders and Directs the Department of the Treasury publish quarterly      reports on all State expenditures, signed by Gov. Chris Christie on Jan. 20, 2010\n\nPolitiFact New Jersey, Jim McGreevey claims he prohibited pay-to-play for state, county contractors, Oct. 30, 2011\n\nExecutive Order No. 24, Orders and directs that every public employee and public officer shall file a sworn and duly notarized Financial Disclosure statement, signed by Gov. Chris Christie on April 27, 2010\n\nNew Jersey Permanent Statutes, accessed March 22-30, 2012\n\nNew Jersey Administrative Code, accessed March 22-30, 2012\n\nNew Jersey Conflicts of Interest Law, accessed March 23-30, 2012\n\nSenate Bill S-2335, Revises membership of Executive Commission on Ethical Standards; renames commission; makes various other changes concerning ethics, signed into law on Jan. 14, 2006\n\nSenate Bill S-4, Extends certain financial disclosure requirements to lobbying conducted through advertisements and direct mail to general public, signed into law on June 16, 2004\n\nPhone and e-mail interview with Doug Mayer, spokesman for the New Jersey Republican State Committee, March 28-29, 2012\n\nNew Jersey State Ethics Commission, Frequently Asked Questions, accessed March 29, 2012\n\nNew Jersey Department of the Treasury, Political Contributions Compliance: Public Law 2005, Chapter 51 & Executive Order 117 (2008), accessed March 29, 2012", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]