["Illinois Gov. J.B. Pritzker (Paul Natkin/Getty Images)", "In 2018, the U.S. Census Bureau released figures showing the population of Illinois had declined for a fifth year in a row. The year before, it fell behind Pennsylvania as the nation’s fifth-largest state.", "The string of recent declines has generated considerable debate, with politicians frequently spinning it to buttress their own policy arguments. This summer, we rated False a claim in which a Republican state lawmaker said Illinois lost middle-class families after the state instituted its last income tax hike. And in years past, Democrats attacked former Gov. Bruce Rauner over the population loss that occurred under his watch.", "During a sit-down interview at FIA’s annual futures and options expo in Chicago, Democratic Gov. J.B. Pritzker brought up the downward trend while highlighting the work his administration is doing to make higher education more affordable.", "\"People talk about the exodus from Illinois and they’ve blamed it on a lot of things, because we’ve lost population,\" Pritzker said. \"Illinois lost population in 94 out of the last 95 years, so it’s not like it’s a new thing that we have a slight out-trickle of people leaving the state. Nevertheless, I’d like to reverse it. And so, the best way to do that is actually to keep our students here and attract students to our universities.\"", "Has Illinois, which is still the nation’s sixth-largest state, lost population almost every year for most of the past century? And what, exactly, does Pritzker mean by \"lost population?\"", "The first and most specific part of Pritzker’s claim is contradicted by annual population estimates maintained by the federal government.", "Illinois’ overall population has grown — not declined — in all but 15 of the past 95 years for which the U.S. Census Bureau has data. In 1924, Illinois’ population was 7.2 million, while in 2018, 12.7 million resided in the state. Figures for 2019 have not yet been released.", "So if population has gone up for most of the past century, what was Pritzker talking about?", "We asked his spokeswoman Jordan Abudayyeh, who told us the governor wasn’t referring to total population but \"net domestic migration,\" which is a subset of overall population that measures the difference between the number of people who move into Illinois from another state versus those who move out of Illinois to other states.", "If more people leave Illinois than arrive from other states, it’s considered net domestic out-migration, a definition that jibes with the second half of Pritzker’s comment about a \"slight out-trickle\" of Illinois residents. And a 2016 report authored by some of the state’s most prominent tax policy experts suggest he’s correct that net domestic out-migration isn’t a new phenomenon.", "Aside from a small increase in 1947, the last time more people moved from other states into Illinois than out of it was 1920, according to the report, which drew on estimates compiled from multiple federal sources by migration expert Lyman Stone.", "\"Illinois has reliably had negative net domestic migration for a century,\" Stone told us in an email.", "That also tracks with an analysis of census population estimates conducted by Brookings Institution demographer William Frey in response to our inquiry. He found Illinois has experienced net domestic out-migration annually since 2000, the earliest year for which he had comparable data.", "While domestic out-migration has driven Illinois’ recent decline, however, Frey cautioned it’s still just one piece of the puzzle when looking at changes in population over time.", "It’s a metric that does not account for international migration, which Illinois and other large states such as New York and California have relied on for population gains. Nor does it include increases from the number of births that occur in a state.", "Pritzker said \"Illinois lost population in 94 out of the last 95 years, so it’s not like it’s a new thing that we have a slight out-trickle of people leaving the state.\"", "The state saw declines in its overall population in just 15 of the last 95 years for which the federal government has released estimates, which contradicts part of the governor’s claim on its face.", "His office said he was only referencing domestic migration — the number of people moving to and from Illinois within the United States — and estimates compiled by migration experts suggest he’s on more solid ground there.", "But domestic migration is just one metric of population change, something Pritzker’s muddled remark about the state’s decline obscures. We rate his claim Half True.", "HALF TRUE – The statement is partially accurate but leaves out important details or takes things out of context.", "Click here for more on the six PolitiFact ratings and how we select facts to check.", "Video, Pritzker interview at FIA’s annual expo, Illinois Central Management Services, Oct. 31, 2019", "Annual population estimates for Illinois from 1923-2018, U.S. Census Bureau, accessed Nov. 1, 2019", "Email, Mike Friedrich, spokesperson for the U.S. Census Bureau, Nov. 5 - 6, 2019", "Email, Jordan Abudayyeh, spokesperson for Gov. Pritzker, Nov. 4, 2019", "Review of Illinois migration patterns, KDM Consulting, March 1, 2016", "Email, migration expert Lyman Stone, Nov. 8, 2019", "Phone interview and emails, William Frey, senior fellow at the Brookings Institution’s Metropolitan Policy Program, Nov. 1 - Nov. 6, 2019", "Analysis of U.S. Census population estimates conducted by William Frey", "Medium post, Center for Tax and Budget Accountability, Sept. 7, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]