["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Republican Presidential Candidate Donald Trump, speaks during the final day of the Republican National Convention in Cleveland, July 21, 2016. (AP)", "Donald Trump tapped into a deep well of bitterness over jobs and trade to win the Republican nomination and in his acceptance speech, he placed the blame squarely on the shoulders of his Democratic opponent.", "\"America has lost nearly one third of its manufacturing jobs since 1997, following the enactment of disastrous trade deals supported by Bill and Hillary Clinton,\" Trump told a roaring crowd.", "Trump offered the same statistic when he laid out his economic policies at a speech in Pennsylvania in June. That speech went into more detail, and best of all for fact-checkers, his campaign footnoted his sources in the transcript.", "As he did at the convention, in that policy speech, Trump faulted the Clintons.", "\"At the center of this catastrophe are two trade deals pushed by Bill and Hillary Clinton,\" he said in Pennsylvania. \"First, the North American Free Trade Agreement, or NAFTA. Second, China's entry into the World Trade Organization.\"", "As we looked into Trump’s words, we found that his numbers are fine. The impact of the trade deals on manufacturing, and his singling out of the Clintons, are more problematic.", "By the way, while Hillary Clinton played no official role in either deal, in the past, she came down in favor of both them, even if she noted their failings.", "The numbers", "Bureau of Labor Statistics data show that manufacturing jobs dropped by about 30 percent between 1997 and 2016. About 17.4 million people worked in manufacturing at the start of the period. Today, their ranks have fallen to about 12.3 million.", "Trump has his numbers right.", "Impact of the trade deals", "The North American Free Trade Agreement dates to 1994 and created an open trade zone across Mexico, the United States and Canada. The deal with China wasn’t a trade agreement in the same way. Instead, in 2001, Congress cleared the path for China to become part of the World Trade Organization. That locked in lower tariffs, spurred investment in China and produced a lot more movement of goods.", "While Trump regularly says that NAFTA sent jobs to Mexico, the net effect on all jobs, including manufacturing, is hard to pin down. In contrast, there’s broad agreement that the change with China did cost America millions of jobs.", "The Congressional Research Service, the nonpartisan think tank of Congress, concluded in 2015 that NAFTA likely had little impact on jobs one way or the other. That’s generally the consensus view, although some economists think NAFTA did hurt American jobs.", "On China, research by economists Justin Pierce at the Federal Reserve and Peter Schott at Yale University, suggests over 1 million jobs have been lost due to trade with China.", "Trump has relied heavily on the research of Robert Scott, director of trade and manufacturing policy research at the Economic Policy Institute, to make his point. The institute isn’t the sort of source traditionally used by Republicans. It supports a hefty increase in the minimum wage and higher taxes on the wealthy and corporations.", "Scott estimates that America lost over 700,000 jobs to Mexico and about 2 million manufacturing jobs due to a rising trade deficit with China.", "But Scott takes exception to Trump’s use of his work.", "\"The story is complex, and certainly neither the Clinton’s, nor trade deals alone, explain the loss of 5.3 million manufacturing jobs since 1998 when manufacturing employment peaked,\" Scott told us. \"No one has adequately teased apart all of the causes.\"", "In an op-ed, Scott listed several other factors that have hurt American workers, including the policies of the Federal Reserve, a stagnant minimum wage and a lack of public investment in infrastructure.", "Martin Baily, a trade economist at the Brookings Institution, an academic center in Washington, puts even less stock in the impact of the two trade deals. He points to longer term trends.", "\"The share of manufacturing employment in total U.S. employment has been declining for at least 50 years and the rate of decline in that share did not accelerate either because of NAFTA or China,\" Baily said.", "He told us that as much as Americans like their flat-screen TV and other goods, our demand for services like health care has grown faster. That has cut into manufacturing employment. And then, there’s the impact of technology in factories.", "\"Productivity growth has meant that it takes fewer people to make the goods,\" Baily said.", "So it’s fair to say that NAFTA may or may not have reduced American manufacturing jobs (with the consensus falling on the side that it didn’t), and that the China deal probably did.", "But in no case do economists put the entire number of jobs lost on either of the trade deals.", "Blaming the Clintons", "The third part of Trump’s claim is that the trade deals and their alleged failures are the fault of the Clintons.", "This is another shaky part of Trump’s claim. Scott at the Economic Policy Institute noted that \"most of the votes needed to pass NAFTA in 1993 were provided by members of Trump’s own party.\"", "President Bill Clinton was certainly a supporter, but he had plenty of Republican help.", "Susan Houseman, senior economist at the Upjohn Institute for Employment Research, a labor policy center in Michigan, said that manufacturing jobs grew in the years immediately following passage of NAFTA. It wasn’t until the China deal that they fell rapidly. Houseman told us the details of that were worked out under President George W. Bush.", "\"The sharp drop in manufacturing jobs coincided with China's accession to the WTO in 2001, which in any event was supported by both Democratic and Republican administrations,\" Houseman said.", "Our ruling", "Trump said that America has lost about a third of its manufacturing jobs since 1997 after enactment of two trade deals supported by Bill and Hillary Clinton. Government figures show about a 30 percent decline in manufacturing jobs. Bill Clinton advocated for both deals. And while Hillary Clinton played no official role, she has spoken in favor of trade agreements.", "But Trump’s statement overlooks that manufacturing employment climbed after passage of NAFTA. The general consensus among economists is that overall, NAFTA has neither helped nor hurt American workers. There’s broad agreement that China’s entry to the WTO has come at the price of many American manufacturing jobs, with estimates ranging from about a million to over 2 million.", "But that would be less than half of the manufacturing jobs lost that Trump talked about. Trump’s focus on the Clintons also overlooks the key role played by Republicans. In naming the Clintons, he leaves out at least half of the picture.", "There’s a measure of truth in Trump’s words, but he omits a lot of important information. We rate this claim Half True.", "https://www.sharethefacts.co/share/874386ed-8192-432c-b8c0-2e23b3e98f4f", "Republican National Convention, Donald Trump acceptance speech, July 21, 2016", "PolitiFact, A distinction without a difference, April 21, 2008", "Donald Trump for President, Declaring American Economic Independence, June 26, 2016", "USA Today, Robert Scott: Hey Donald, you have my research all wrong, July 12, 2016", "Journal of Economic Perspectives, US Manufacturing: Understanding Its Past and Its Potential Future, Winter 2014", "Congressional Research Service, NAFTA at 20: Overview and Trade Effects , April 28, 2014", "Congressional Research Service, The North American Free Trade Agreement, April 16, 2015", "Justin Pierce and Peter Schott, The surprisingly swift decline of U.S. manufacturing employment, April 2015", "Bloomberg News, After Doubts, Economists Find China Kills U.S. Factory Jobs, June 18, 2015", "Email interview, Martin Neil Baily, senior fellow, Brookings Institution, July 21, 2016", "Email interview, Robert Scott, director of trade and manufacturing policy research, Economic Policy Institute, July 21, 2016", "Email interview, Susan Houseman, senior economist, Upjohn Institute for Employment Research, July 21, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]