["By Eugene Kiely", "Posted on April 2, 2019", "At a town hall meeting on the Green New Deal, Rep. Alexandria Ocasio-Cortez got her history wrong when she was asked what lessons she learned from President Franklin D. Roosevelt’s New Deal.", "The freshman Democrat, who sponsored the Green New Deal in the House, said the New Deal was so popular that Republicans “had to amend the Constitution of the United States to make sure Roosevelt did not get reelected.” In fact, the GOP-controlled Congress introduced and passed a constitutional amendment limiting presidents to two terms in 1947 — two years after Roosevelt died in office.", "The Green New Deal is a nonbinding resolution that provides a broad blueprint for how the U.S. might address climate change over the next 10 years, while creating well-paying jobs and protecting vulnerable communities. It has been criticized by Republicans as too expensive, and even some within the Democratic Party find the plan too ambitious.", "At the March 29 town hall meeting, which was hosted by MSNBC, Ocasio-Cortez pushed back at the notion that her plan is too bold. When asked by an audience member (at about 15 minutes into the video) about the lessons of Roosevelt’s New Deal in the 1930s, the New York congresswoman talked about the need to overcome “fear within our own party” about being “too bold.”", "Roosevelt’s New Deal, which was in response to the Great Depression, was an ambitious legislative agenda that changed banking laws, created work relief programs and introduced new agricultural programs, among other things.", "“I think there’s a couple of lessons. One is that when we look into our history, when our party was boldest, time of the New Deal, the Great Society, the Civil Rights Act and so on. We had and carried super majorities in the House, in the Senate. We carried the presidency,” she said. “They had to amend the Constitution of the United States to make sure Roosevelt did not get reelected.”", "Ocasio-Cortez has a point that Roosevelt’s unprecedented time in office — he won a fourth term in 1944 — was the impetus for the 22nd Amendment. In fact, Roosevelt’s 1944 Republican opponent, Thomas Dewey, embraced such an amendment near the end of that election.", "According to the book “FDR, Dewey and the Election of 1944,” Dewey gave a speech on Oct. 31, 1943, in Buffalo, where he came out “in favor of a constitutional amendment limiting future presidents to two terms in office, since, as he said, ‘four terms or sixteen years, is the most dangerous threat to our freedom ever proposed.'” (See page 290.)", "But the amendment wasn’t introduced and passed until after the Republicans took control of the House and Senate in the 1946 elections. It was introduced in February 1947 and passed the following month.", "Roosevelt died of a massive stroke two years earlier on April 12, 1945.", "The 22nd Amendment was finally ratified on Feb. 27, 1951, and was certified as part of the Constitution on March 1, 1951.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]