["The 39-second video was published in this Facebook post on October 12, 2019, where it has been viewed more than 54,000 times.", "The clip shows a truck being blown over by a powerful storm.", "The video’s Thai language caption translates to English as: “Typhoon Hagibis tripped over a truck in a blink of an eye.”", "Below is a screenshot of the misleading post:", "Typhoon Hagibis, Japan’s most powerful storm in decades, hit Japan on Saturday night, triggering landslides and floods. At least 74 people have died and dozens remain missing, according to this AFP report published on October 16, 2019.", "The same video was also published here, here, here and here on Facebook; here on Twitter and here on YouTube with a similar claim in Thai language.", "The video was also published here, here and here in posts on Facebook and Twitter with a similar claim in Chinese and English. The video was also viewed more than 4.9 million times in this Japanese-language Twitter post with a similar claim.", "The claim is false; a reverse image search on Google for a screenshot of the video found that the footage has actually circulated online since September 2018, when Typhoon Jebi hit Japan.", "A subsequent keyword search found the video in the misleading posts was previously published in this Twitter post on September 4, 2018. The 15-second clip has been viewed more than 1.8 million times.", "大日のイオンいってて外みたら\n\t\tトラック倒れてんけどやばすぎ? pic.twitter.com/5sB3u4BwxX", "The post’s caption states: \"I went to Aeon, Dainichi branch, looked outside and then a truck fell. It was really awesome.\"", "Below is a screenshot comparison of the video in the misleading posts (L) and the video published on Twitter (R):", "The same video was also published on YouTube here on September 4, 2018.", "The YouTube video’s Japanese-language title translates to English as: \"The moment the typhoon turned over a truck. Osaka City, September 5 2018.”", "The caption states: \"I witnessed the moment a truck turned over from pedestrian bridge\".", "The September 2018 Twitter video was also published in this article by local news site Go-Guy NET on September 4, 2018.", "The Japanese-language headline translates to English as: “[Moriguchi / Kadoma] Follow-up report of typhoon damage! You can watch the video of the decisive moment of a large truck rollover at Dainichi Aeon! It seems that there was a fire nearby.”", "The video was filmed from a footbridge at the Aeon Mall Dainichi in Osaka as seen here on Google Street View.", "Typhoon Jebi made landfall in Japan on September 4, 2018, according to this AFP report.", "It smashed through the major manufacturing area around Osaka -- Japan's second city -- wrecking infrastructure and destroying homes.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]