["The video was published in this Facebook post on December 28, 2019.", "The post’s caption states: “Muslims are in gulags (detention camps) in Assam. May Allah protect all of them - Ameen Ya Rab.”", "Below is a screenshot of the misleading post:", "Assam is a state in northeast India. It is the first Indian state to have introduced a new National Register of Citizens (NRC).", "Some two million people in Assam were left off the new register after they were deemed unable to prove their Indian citizenship, prompting criticism from the United Nations. Here is an AFP report about the issue.", "India’s Prime Minister Narendra Modi has denied there are any plans to detain people over the new citizenship law.", "But local media reports and opposition politicians including Congress’ Rahul Gandhi, have said the move unfairly targets Assam’s Muslim population and that people left off the register might be held in detention camps.", "Gandhi tweeted a BBC video report about the issue on December 26 alongside a Hindi-language caption that translates to English as: \"RSS’ prime minister is lying to mother India.\" His tweet has been embedded below.", "RSS का प्रधानमंत्री भारत माता से झूठ बोलता हैं ।#JhootJhootJhoot pic.twitter.com/XLne46INzH", "The six-minute and 14-second long video has been also shared here, here, here and here on Facebook and here, here and here on YouTube alongside a similar claim.", "The claim is false; the video has circulated online for months prior to Assam releasing the final NRC lists and has been widely used in reports about abuse at a prison in the southern Sri Lankan town of Angunakolapelessa.", "A time and date stamp is visible on the top-left corner of the video and a red logo with ‘TRUTHLANKA.COM’ written on it can be seen on the top-right corner of the video screen.", "Below is a screenshot of the footage, with the stamp and logo highlighted in yellow by AFP:", "An online search found this Facebook page with the same name and logo.", "The same video was published here in a post on the Truth Lanka Facebook page on January 16, 2019.", "The Sinhala-language caption translates to English as: “CCTV footage of inhuman assault on Angunakolapelessa prison inmates.”", "A longer version of the video was published here on YouTube by a local news website on the same day.", "The video’s description states: “Footage found in several security cameras have now been released to the media. This assault occurred on November 22, 2018. However, issuing a special statement on the matter, the Justice and Prisons Reforms Ministry points out that a three member committee has been appointed to inquire into the assault and the committee report has been made a top priority by the Justice Minister. She has also noted that any action in the future on the matter will be decided upon studying the committee findings.”", "Below is a screenshot comparison from the video posted in the misleading Facebook post (L) and YouTube video (R):", "Screenshots from the video were included in multiple Sri Lankan media reports on the prison abuse at the time, including this report published by Sri Lanka's Daily Mirror newspaper on January 16, 2019 and this report published by Sri Lanka's Sunday Observer on January 20, 2019.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]