["“Is it possible Wayfair involved in Human trafficking with their WFX Utility collection? Or are these just extremely overpriced cabinets?” asked Reddit user PrincessPeach1987 on the discussion website’s section dedicated to conspiracy theories, r/conspiracy, on July 9, 2020.", "“Note the names of the cabinets,” the user added in the post, which features a screenshot of the online retailer’s website showing four storage cabinets priced between $12,699 and $14,499. The cupboards are named Neriah, Yaritza, Samiyah and Alyvia.", "Despite the absence of any evidence, social media users quickly appropriated and added to the conspiracy theory, claiming on Facebook, Twitter, Instagram and TikTok that specific children were being sold online under the guise of overpriced household items.", "However, the claim is nothing more than a hoax.", "“There is, of course, no truth to these claims,” Jane Carpenter, a Wayfair spokeswoman, told AFP by email.", "“The products in question are industrial grade cabinets that are accurately priced,” she explained, adding that they have been temporarily removed from the site to rename them and clarify the reason for the high pricing.", "Carpenter told AFP that an algorithm names the products available on the website.", "“That algorithm uses first names, geographic locations, and common words for naming purposes, which is why some of the products in question are named with human first names,” she said, adding that the practice is common in retail.", "After the claim was posted on Reddit, other social media users tied various products available on Wayfair to the names of children who have allegedly disappeared in the US. But many of them are not currently missing.", "Samiyah Mumin, a 17-year-old from Columbus, Ohio who was falsely reported missing in May 2019, saw her name tied to the claim.", "She debunked the claim herself in a long Facebook live video on July 10, 2020, complaining about the unwanted attention to which she had been subjected.", "Columbus police also told AFP by email that, “We were unable to find any missing reports on her.”", "Tori Dunning, whose last name is the same as a pillow sold on Wayfair, was also said to have been one of the trafficked children, but she too is not currently missing.", "“It’s a hoax,” Detective-Sergeant Marty Doss of North Carolina’s Surry County Sheriff’s Office told AFP by phone.", "“That girl is now 24 years old. It’s an old post that someone is circulating and she is aware of it. She is perfectly fine,” Doss said, adding that Dunning did run away as a teenager, and the old missing status is circulating again.", "Samara Duplessis, a Michigan teenager reported missing on May 7, also had her name used to support the conspiracy theory. However, she had been found before it emerged, her mother announced in a Facebook post on May 10.", "Others mentioned in the claims include Maryland’s Cameron James Dziedzic, reported missing on March 10. He was later found, the Calvert County Sheriff’s office reported on April 2.", "The conspiracy theory also included a Texas child missing and later found in 2017.", "Several children were reported missing but have not yet been found, local police told AFP. These included Connecticut’s Yaritza Castro, and Anabel Wilson from Kansas.", "Officer Thomas Tomasic of the Kansas City, Kansas, Police Department told AFP by phone that Wilson was a “runaway.”", "Tomasic said Wilson had been found on July 9, 2020 but escaped as she was being taken to a shelter, and is now missing again.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]