["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Donald Trump’s resurgent campaign has narrowed the polling gap between himself and Democratic nominee Hillary Clinton. In the toss-up state of Florida, Trump said people of all stripes appreciate what he has to offer. And he mentioned one group in particular.", "\"I think I have tremendous support from women,\" Trump said in a Nov. 3, 2016, speech in Jacksonville, Fla. \"Tremendous support.\"", "We wondered what the polls tell us about female sentiment toward the Republican candidate. Trump has garnered headlines for video of him boasting about groping women, and more than 10 women have said Trump forced himself on them.", "Here’s a scan of the latest polling results.", "The CBS News/New York Times poll from Nov. 3, 2016 found 50 percent of women back Clinton and 36 percent support Trump.", "In a new poll from ABC News/Washington Post, Clinton gets 52 percent of the women compared to 41 percent for Trump.", "The Los Angeles Times/USC poll finds women favor Clinton by an 8-point margin, 49 percent to 41 percent.", "The Investor’s Business Daily/TIPP election tracker also gives Clinton an edge among women by 51 percent to 38 percent. The Trump campaign cited this survey, saying it shows Trump gaining support from women. A few days earlier, Trump enjoyed the backing of 34 percent of women.", "The Los Angeles Times/USC poll also shows Clinton’s numbers among women slipping by a few points in recent days. However, the average across the four most recent polls shows women choosing Clinton over Trump by an 11-point margin.", "This is consistent with the gap pollsters have seen going back several months.", "How do Trump’s numbers compare to past Republican nominees? Not so well, said Christina Wolbrecht, a political scientist at the University of Notre Dame.", "\"The exact figure depends on your data source, but the reliable sources all put the percent of women voting for GOP nominees at the low to upper 40s since 2000,\" Wolbrecht said.", "An American National Election Studies survey found women backing the Republican candidate by 44 percent in 2000 (George W. Bush), 47 percent in 2004 (Bush re-election) and 43 percent in 2008 (John McCain). According to Gallup, Mitt Romney also garnered 43 percent of the woman vote in 2012.", "Trump’s best number in the recent polls is 41 percent and two put him below that, at 36 and 38 percent. His average across four polls is 39 percent.", "Political science professor Kathleen Dolan at the University of Wisconsin-Milwaukee said one sub-group of women leans toward Trump -- white women without college degrees.  And he does lead among Republican women. But Dolan said that comes with a caveat.", "\"Even among Republican women, a group he should be carrying, he only has about 79 percent of them,\" Dolan said. \"This is compared to the 92 percent of Republican women who voted for Romney in 2012.\"", "Susan Carroll, a senior scholar at the Center for Women and Politics at Rutgers University, said, \" ‘Tremendous’ is a clear exaggeration if compared with how Republican nominees have fared in the exit poll results in previous elections.\"", "Our ruling", "Trump said that he has \"tremendous support from women.\" His campaign pointed to a poll that shows him gaining ground with women, but on average, he lags behind Clinton by 11 percentage points. And even the poll cited by his campaign finds he still faces a 13-point gap. His best performance shows that 41 percent of women support him, but his polling average is 39 percent, appreciably lower than the fraction that have backed previous Republican candidates.", "That doesn’t seem to meet the common definition of \"tremendous.\" We rate this claim False.", "https://www.sharethefacts.co/share/ff7283d3-87b1-41e0-ba0c-9b417b759980", "C-SPAN, Donald Trump Campaign Rally in Jacksonville, Florida, Nov. 3, 2016", "CBS News/New York Times, Five days to go: The presidential race tightens, Nov. 3, 2016", "ABC News/Washington Post, Beneath a Close Election Contest Lie Deep Rifts among Groups, Nov. 3, 2016", "Los Angeles Times/USC, Presidential election daybreak poll, Nov. 3, 2016", "Investor’s Business Daily/TIPP, Clinton Vs. Trump: IBD/TIPP Presidential Election Tracking Poll, Nov. 3, 2016", "Email interview, Steven Cheung, spokesman, Trump for President, Nov. 3, 2016", "Email interview, Susan Carroll,senior scholar, Center for Women and Politics, Rutgers University, Nov. 4, 2016", "Email interview, Christina Wolbrecht, associate professor, Department of Political Science, University of Notre Dame, Nov. 3, 2016", "Email interview, Kathleen Dolan, professor, Department of Political Science, University of Wisconsin - Milwaukee, Nov. 3, 2016", "Email interview, Kathleen Weldon, communications director, Roper Center for Public Opinion Research, Nov. 3, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]