["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "In this Jan. 27, 2021 file photo, President Joe Biden speaks in the State Dining Room of the White House in Washington. (AP)", "During the 2020 campaign, President Joe Biden promised to make federal student loan payments more affordable for Americans, including by forgiving debt for some borrowers who attended public colleges and universities.", "Neither Biden nor Congress has taken action so far to cancel student loan debt.", "Facebook has some good news for anyone with student loans: President Joe Biden has already canceled them. Or did he?", "In a Feb. 2 post, one user wrote that her student loan debt had mysteriously vanished.", "\"Wow, just checked my Credit Karma and Biden really did wipe away my student loans $20k worth of debt,\" the user wrote. \"God is good!\"", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.) A few other Facebook users shared in the celebration, so we wanted to check this post out.", "(Screenshot from Facebook)", "During his presidential campaign, Biden promised to make federal student loan payments more affordable for Americans — particularly people with low incomes and public servants. But those plans have not yet come to fruition, and Biden hasn’t said he’d cancel student loans for everyone.", "Here’s what Biden promised:", "\"Forgive all undergraduate tuition-related federal student debt from two- and four-year public colleges and universities and private HBCUs (historically Black colleges and universities) and MSIs (minority-serving institutions) for debt-holders earning up to $125,000.\"", "\"Include in the COVID-19 response an immediate cancellation of a minimum of $10,000 of federal student loan debt.\"", "Forgive \"$10,000 of undergraduate or graduate student debt for every year of national or community service, up to five years.\"", "\"More than halve payments on undergraduate federal student loans by simplifying and increasing the generosity of today’s income-based repayment program.\"", "Biden has extended a pause on federal student loan payments, but none of the executive orders he has signed so far follow through on his campaign promises. In December, he said it’s \"pretty questionable\" whether he’d have the power to forgive up to $50,000 of debt via executive order.", "Congress has not passed legislation canceling student loan debt, either.", "On Jan. 20, the day of Biden’s inauguration, the president introduced a $1.9 trillion coronavirus relief package. Among its provisions are $1,400 stimulus checks for most Americans, an unemployment insurance supplement of $400 per week and an increase in the federal minimum wage.", "Student loan debt forgiveness is not mentioned in the plan. Neither loan forgiveness nor a payment pause were included in the December relief package.", "We can’t speak to what may have happened to the Facebook user’s student loan debt, but the post that credits Biden for wiping it away is inaccurate. We rate it False.", "CNBC, \"New coronavirus stimulus bill does not include student loan relief—mandatory payments are set to resume in February 2021,\" Dec. 21, 2020", "Congress.gov", "Facebook post, Feb. 2, 2021", "Federal Register, 2021 Joe Biden Executive Orders", "Forbes, \"What The New Stimulus Package Means For Student Loan Cancellation,\" Feb. 1, 2021", "JoeBiden.com, THE BIDEN PLAN TO BUILD BACK BETTER BY ADVANCING RACIAL EQUITY ACROSS THE AMERICAN ECONOMY", "The New York Times, \"A Look at What’s in Biden’s $1.9 Trillion Stimulus Plan,\" Jan. 14, 2021", "The Washington Post, \"Opinion: Trump is trashing the government on his way out. Biden is confident he can fix it.\" Dec. 23, 2020", "The White House, \"President Biden Announces American Rescue Plan,\" Jan. 20, 2021", "The White House, Presidential Actions", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]