["A website misleadingly claimed that the Sunshine State has pushed for a recount of presidential election results, citing widespread voter fraud.", "\"Florida Moves For FULL RECOUNT Of State Over Massive Voter Fraud,\" read the headline of a Dec. 6, 2016, post on BipartisanReport.com.", "While the post itself recounts a real news story about a lawsuit claiming voter fraud in Florida, the headline is inaccurate enough to give people the wrong impression that a potential recount is underway.", "The Tallahassee Democrat reported on Dec. 5 that three Florida residents had filed a lawsuit against President-elect Donald Trump, Vice President-elect Mike Pence, Florida Gov. Rick Scott and the state Cabinet and Florida’s 29 Republican electors. The website also cites the same story in the Detroit Free Press.", "The filing alleges that the state’s election results were invalid, contending that voting machines malfunctioned or were hacked, many votes went uncounted and mail-in ballots weren’t included, among other problems. The suit aims to force a recount of votes by insisting Hillary Clinton would have won the election had there been no alleged impropriety.", "Trump won Florida by almost 113,000 votes, and there has been no proof of \"massive voter fraud.\" The election results were certified on Nov. 22, with only \"minor problems\" reported by election officials.", "Despite what the headline implies, state officials have not pushed for a recount. Under Florida law, a recount is triggered if a candidate wins by 0.5 percent or less. Trump’s margin of victory over Clinton was about 1.4 percent.", "A voter may file a lawsuit to contest the results within 10 days of the results being certified. The results can be contested if there’s a suspicion of fraud or corruption, a candidate being ineligible, a dispute over vote totals or bribery.", "With the assistance of a left-leaning Washington-based group called Protect Our Elections, the trio of plaintiffs filed their lawsuit on Dec. 2, the final eligible day to contest the results.", "The Facebook post of the report did mention the lawsuit, also noting \"Trump is NOT happy.\" But there’s a good chance he won’t say anything about the lawsuit at all. Even Orlando attorney Clint Curtis, representing the plaintiffs in the recount lawsuit, acknowledged the action may produce zero results before the Electoral College votes on Dec. 19.", "\"They can ignore it entirely,\" Curtis told the Tallahassee Democrat.", "Our ruling", "Bipartisan Report’s headline read, \"Florida Moves For FULL RECOUNT Of State Over Massive Voter Fraud.\"", "A trio of Florida voters contested the results, not state officials. Their lawsuit cited potential problems like uncounted or improperly tallied votes and voting machines that didn’t work or were hacked. The lawsuit likely won’t bring a recount — or any action at all — before the Electoral College votes.", "The headline confounds readers by misrepresenting what the story actually says. We rate it False.", "BipartisanReport.com, \"BREAKING: Florida Moves For FULL RECOUNT Of State Over Massive Voter Fraud (DETAILS),\" Dec. 6, 2016", "News 13, \"What are the rules for election recounts in Florida?,\" Aug. 20, 2016", "Orlando Sentinel, \"Trump takes Florida over Clinton,\" Nov. 9, 2016", "Protect Our Elections, Complaint to contest election, Dec. 2, 2016", "Tallahassee Democrat, \"Plaintiffs want presidential recount in Florida,\" Dec. 5, 2016", "Miami New Times, \"Group Sues to Demand Florida Election Recount,\" Dec. 5, 2016", "The 2016 Florida Statutes, \"Chapter 102: Conducting elections and ascertaining the results,\" accessed Dec. 15, 2016", "Florida Division of Elections, \"Timeline for Reporting and Certification of Election Results,\" accessed Dec. 15, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]