["About this rating", "A photo purportedly showing a copperhead snake inside the mouth of a fish is frequently circulated online along with the claim that several anglers have been bitten in similar situations. One popular version was posted to Facebook in September 2015:", "Fellow Anglers beware. Several snake bites this season have came from baby copperheads found alive inside of feeding fish. With the top water bite happening now the snakes get more oxygen to prolong there life inside the fish while the fish continues to feed. Makes the want to have bass thumb a little less desirable. Lol", "The above-displayed photo, however, does not show a copperhead. This particular has been circulating since at least 2009, when it was shared in a gallery on the web site Outdoor Life, identifying the snake as a garter snake, the fish as a largemouth bass, and the angler as Ricky Stephens:", "Okay, we’re half completely grossed out and half fascinated by Ricky Stephens photos of a largemouth bass he caught that swallowed—or rather half-swallowed—a garter snake.", "The warning displayed in the meme originated on Facebook and not with an official wildlife organization, and was made up by a Facebook user in order to give an interesting photo a viral lift:", "Copperhead snakes are very common in North America, and are the most likely to bite (although their bites are venomous but rarely fatal).  They live in a wide variety of environments, but do not hunt in the water — unlike the semiaquatic and far more poisonous water moccasins, with which copperheads are often confused.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]