["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "New York State Attorney General Eric Schneiderman claimed some states have more opioid prescriptions than residents. (Courtesy: Schneidermans' Flickr page)", "New York State Attorney General Eric Schneiderman said prescribers in some states have been so lenient that they have given out more prescriptions than there are residents in those states.", "With 33,091 opioid-related deaths in 2015 across the country, the ease in getting prescriptions for the painkillers has become an issue attracting attention from state officials.", "\"Some states hardest hit by the crisis have more opioid prescriptions than residents,\" Schneiderman said at a press conference.", "Twenty-three states have a higher rate of opioid overdose deaths than New York state. But is Schneiderman right that some of those states have more opioid prescriptions than residents?", "National numbers", "Eight states reported more opioid prescriptions than residents in 2015, according to the Centers for Disease Control.", "The states are Alabama, Arkansas, Tennessee, West Virginia, Mississippi, Oklahoma, Kentucky, and Louisiana.", "Alabama recorded the highest rate, with 125 opioid prescriptions for every 100 people in the state. Even so,  Alabama had a lower rate of opioid-related deaths than most other states, according to Centers for Disease Control data analyzed by the Kaiser Family Foundation, a health policy research organization.", "Two other top prescribing states — West Virginia and Kentucky — had some of the highest rates of opioid related deaths.", "West Virginia had the highest rate in the country, with 36 opioid deaths for every 100,000 residents. The state reported 111 opioid prescriptions for every 100 residents.", "Kentucky,  ranking sixth with 21 deaths for every 100,000 residents, had 102 prescriptions for every 100 residents in 2015.", "West Virginia’s rate decreased in 2016 to 96 prescriptions for every 100 people. Kentucky’s went down to 97 opioid prescriptions for every 100 people. Alabama remained highest with 121 prescriptions for every 100 people.", "New York state numbers", "New York state had 42 prescriptions for every 100 residents in 2016.", "There were no counties in New York with more opioid prescriptions than residents, according to the state Department of Health.", "Montgomery County had the highest rate in the state with 82 opioid prescriptions for every 100 residents in the county. The county had two opioid deaths for one of the lowest opioid-related death rates in the state.", "Our ruling", "Schneiderman said some states hit hardest by the opioid crisis \"have more opioid prescriptions than residents.\"", "West Virginia and Kentucky — two states with the highest rates of opioid deaths in the country — reported more opioid prescriptions than their respective population, according to CDC data. Six other states had more prescriptions than residents, too.", "We rate his claim True.", "A.G. Schneiderman, Bipartisan Coalition Of AGs Expand Multistate Investigation Into Opioid Crisis, YouTube", "Email conversation with Amy Spitalnick, spokesperson for Attorney General Eric Schneiderman", "Opioid Overdose Death Rates and All Drug Overdose Death Rates per 100,000 Population (Age-Adjusted), Kaiser Family Foundation, Accessed Sept. 25, 2017", "2015 Opioid Prescription Rates by State, CDC", "2016 Opioid Prescription Rates by State, CDC", "2016 Opioid Deaths by County in New York, New York State Department of Health", "2016 Opioid Prescription Rates by County, New York State Department of Health", "Data on New York City Opioid Deaths obtained from New York City Health Department Press Office Staff", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]