["A news clip of Russian television RT is viral on social media with the claim that Muslim parties in Belgium are demanding to establish the country as an Islamic state after winning elections. Founder of fake news website Postcard News Mahesh Vikram Hegde tweeted the video writing, “After winning elections, Muslim parties demanding to declare Belgium as Islamic country. Huge protests have already started. This is what going to happen soon in india also. All the best to my beloved so called “SECULAR” brothers and sisters.”", "After winning elections,", "Muslim parties demanding to declare Belgium as Islamic country.", "Huge protests have already started", "This is what going to happen soon in india also All the best to my beloved so called “SECULAR” brothers and sisters pic.twitter.com/6CQZgP1FYh", "— Mahesh Vikram Hegde (@mvmeet) November 2, 2019", "In the news clip, RT anchor can be heard saying, “A Muslim party in Belgium says it is preparing to campaign for setting up an Islamic state there. Two candidates from the newly-established Islam party won seats in recent municipal elections.” Subsequently in the show, a Belgian Euro MP says, “It’s very worrying to see what’s happening now. We see people from Islamic backgrounds forming their own political parties and demanding the introduction of Sharia law and Islamic state in Belgium.”", "The video has also been tweeted by several other handles, including @AjitKDoval_FAN and one Vinay Kabadi with mere 55 followers on Twitter, among them the office of railway minister Piyush Goyal.", "After winning elections, Muslim parties demanding to declare Belgium as Islamic country. Huge protests have already started. This is what going to happen soon in UK also. All the best to my beloved so called “SECULAR” brothers and sisters.👆🏼 pic.twitter.com/kwnoMfjf9U", "— Vinay Kabadi (@kabadi_vinay) November 4, 2019", "A user @KalpanaSubrama5, followed by PM Modi, had tweeted the video in April.", "The claim has been widely circulating on Facebook since March.", "The news ticker on the bottom of the broadcast reads, “Deadly superstorm Sandy forces Obama and Romeny to suspend election campaigns.”", "Superstorm Sandy or Hurricane Sandy devastated the United States, Canada and neighbouring regions in 2012. More than 200 people had lost their lives. The news ticker talks about the suspension of election campaignings by presidential candidates Barack Obama and Mitt Romney due to the calamity.", "The RT video was uploaded on YouTube On October 30, 2012.", "A newly-established ‘Islam Party’ in 2012 had won two seats in the municipal elections in Belgium and vowed to implement Sharia law, according to a 2012 report by RT. The party had won two seats in the capital Brussels – Molenbeek and Anderlecht.", "However, it lost both the seats in 2018.", "Social media claims are thus false. A 2012 news clip about Islam party campaigning for local elections was shared with the false claim that Muslim parties are now seeking to establish an Islamic state in the country after recent elections.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]