["Bernie Sanders defended his vote supporting the 1994 crime bill during an interview on Meet the Press.", "Both he and Hillary Clinton have been criticized for their support of the legislation, which some say helped usher in the era of mass incarceration and decimate black communities. Sanders has pushed back, saying he only voted for the bill because of key safety provisions.", "The Sanders campaign offered the defense when we asked about it in September and in a recent press release. But that doesn’t add up, Meet the Press’ Chuck Todd pointed out on Feb. 28.", "\"You said you supported the House version of crime bill because it had an assault weapons ban in it. But that turned out not to be the case,\" Todd said. \"So why did you put out a statement that was misleading?\"", "\"Woah, woah, woah,\" Sanders responded. \"No, that’s not my understanding. My understanding is there is a ban on assault weapons in that bill.\"", "\"It was not in the House bill that you voted. It was in a Senate bill, but not the House bill,\" Todd countered.", "\"Hold it. To the best of my knowledge, there were two important provisions, and that is the Violence Against Women Act,\" Sanders said. \"And my understanding is there is a ban on assault weapons.\"", "So who’s right here?", "The answer is complicated.", "Sanders did vote in favor of a House conference report that included the aforementioned ban and protections for women. He also voted for a separate House bill specifically prohibiting assault weapons that was meant to be folded into the omnibus legislation.", "But it’s a stretch to say that Sanders supported the crime bill because of the assault weapons ban, so Todd is right that Sanders also okayed versions without the prohibitions.", "Sanders and the crime bill", "The crime bill underwent many iterations before it became law in August 1994. So it’s not entirely clear if Sanders and Todd are talking about the same version.", "But here’s the bottom line. Sanders voted for at least one version of the bill that didn’t include the assault weapons ban -- undercutting his core claim.", "The crime bill had a circuitous path.", "In 1991, Sanders opposed the Violent Crime Control and Law Enforcement Act of 1991 — an early version of the 1994 bill put forth by Jack Brooks, a Democrat from Texas and the chairman of the House Judiciary Committee. Though the bill passed in the House, it ultimately failed in the Senate.", "In October 1993, Brooks tried again and introduced the original Violent Crime and Control Law Enforcement Act of 1994. This version didn’t include an assault weapons ban nor protections for women.", "It passed in the House by a voice vote on Nov. 3, 1993, so it’s unclear whether Sanders voted in favor. We found no evidence Sanders opposed the bill, and in three roll call votes, Sanders, along with most Democrats, said \"aye\" to amendments that didn’t include a ban.", "When the bill reached the Senate, it added provisions to ban assault weapons and protect women from crimes such as sexual assault and domestic violence. This version passed in the Senate and returned to the House.", "At that point, two things happened.", "First, Sanders criticized the crime bill for its lack of attention to root causes. \"We can either educate or electrocute. We can create meaningful jobs, rebuilding our society, or we can build more jails. Mr. Speaker, let us create a society of hope and compassion, not one of hate and vengeance,\" he said on the House floor on April 13.", "Second, Brooks amended the bill again, this time stripping the legislation of the assault weapons ban but keeping the violence against women provisions.", "Sanders voted for the bill without the gun ban.", "In place of the ban, Brooks offered to create a commission to \"examine the extent to which assault weapons and high power firearms have contributed to violence and murder in the United States.\"", "Then the bill went back and forth between the two chambers for a few months, as a conference committee attempted to hash out the differences. Meanwhile, the assault weapons ban became a hot topic in the national debate, with three former presidents — Gerald Ford, Jimmy Carter and Ronald Reagan — writing a letter urging Congress to pass it.", "In May, Sanders voted for a separate bill put forth by New York Sen. Chuck Schumer to ban 19 semi-automatic assault weapons, including AK-47s and Uzis as well as weapons with more than one assault feature. According to news reports from the time, passing this legislation paved the way for the compromise bill to encompass the ban.", "Brooks, the Texas Democrat described by the Washington Post as \"wily and contrary,\" attempted to keep the prohibitions out of the bill but to no avail. The House released its conference report in August 1994 with the ban in place. Sanders voted in agreement.", "Sanders on banning assault weapons", "Outside of the omnibus crime bill, the record shows that Sanders supported prohibiting assault weapons since his early days in office.", "In 1990, the Miami Herald noted that Sanders had earned the backing of the gun community in his congressional bid over Republican Peter Smith, even though \"Sanders also supports federal limits on assault weapons.\"", "But in 1994, his vote on the Schumer bill roused the ire of Vermont gun owners. Here’s a passage from the Boston Globe to that point:", "\"Sanders, who always supported an assault weapons ban, joined Swett and Andrews in the 216-214 House majority to ban 19 types of semiautomatic guns — which require the trigger to be pulled each time the gun is fired but have high rates of fire and magazines that hold more than 10 cartridges.", "‘We're going to put our complete and entire effort to unseat him,’ said Douglas Hoffman, president of a pro-gun group, the Sportsman's Alliance for Vermont's Environment, of Sanders.\"", "In 1996, Sanders reconfirmed his support of the ban, voting to reject its appeal.", "Our ruling", "Sanders says he voted for the 1994 crime bill because \"there is a ban on assault weapons in that bill.\"", "There were many votes surrounding the crime bill. The trouble with Sanders’ claim is that his contention that he voted for the crime bill because of the assault weapons ban is at odds with votes for the bill that include no such ban.", "As often with congressional votes, there is a lot of gray area to determining a legislator’s motivations.", "We rate Sanders’ claim Half True.", "Says he supported the 1994 crime bill because \"there is a ban on assault weapons in that bill.\"", "NBC, Meet the Press, Feb. 28, 2016", "Email interview with Warren Gunnels, policy director for Bernie Sanders, Feb. 28, 2016", "PolitiFact, \"Black Lives Matter activist says 'the Clintons' passed policy that led to mass incarceration,\" Aug. 25, 2015", "PolitiFact, \"Where do Hillary Clinton and Bernie Sanders stand on the death penalty?,\" Sept. 2, 2015", "Bernie Sanders, \"Sanders Voted for 1994 Crime Bill to Support Assault Weapons Ban, Violence Against Women Provisions,\" Feb. 25, 2016", "Congress.gov, \"H.R.3371 - Violent Crime Control and Law Enforcement Act of 1991,\" accessed Feb. 28, 2016", "Congress.gov, \"H.R.3355 - Violent Crime Control and Law Enforcement Act of 1994,\" accessed Feb. 28, 2016", "Office of the Clerk of the House of Representatives, Roll Call votes on HR 3555, accessed Feb. 28, 2016", "Government Publishing Office, \"H. R. 3355,\" Oct. 26, 1993", "Youtube, \"Bernie Sanders on Crime, Punishment, and Poverty,\" Oct. 22, 1991", "New York Times, \"Assault Weapons Ban Allowed To Stay in Anti-crime Measure,\" July 28, 1994", "Vox, \"Bernie Sanders voted for the 1994 tough-on-crime law. But it's complicated.,\" Feb. 26, 2016", "CQ search", "Nexis search", "Los Angeles Times, \"Feinstein set to push for weapons ban,\" Oct. 26, 1993", "Los Angeles Times. \"Assault weapon ban added onto Senate crime bill,\"\" Nov. 18, 1993", "Washington Post, \"Senate bans assault gun production; waiting period stalls final action on bill,\" Nov. 18, 1993", "Miami Herald, \"Vermont Senator has shot at Congress,\" Oct. 7, 1990", "Boston Globe, \"Gun-control battle grows hotter still,\" May 15, 1994", "Washington Post, \"House Backs Ban On Assault Guns,\" May 6, 1994", "Washington Post, \"Obstacle Still Stands in the Path Of the Ban on Assault Weapons; Texas Democrat Jack Brooks Likely to Play Hardball in Conference,\" May 7, 1994", "Boston Globe, \"Texan vows fight over crime bill ; House panel chief wants weapon ban weakened,\" July 22, 1994", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]