["The claim was published here on Facebook on August 28, 2020. It has since been shared more than 170 times.", "The post features an image that appears to show several men sleeping by leaning on a rope while standing.", "The text overlay above this image reads: “The lowest form of accommodation in Victorian England was access to bend over a rope for the night at the price of a penny. Usually used by drunken sailors who had spent all their money drinking. It’s said to be the origin of the term hungover.”", "The post’s caption reads: “I never knew this! Did you?”", "Identical claims have also been shared thousands of times on Facebook after being published here, here, here and here.", "However, the claim is false.", "Daniel Van Olmen, an associate professor of historical linguistics at the UK’s University of Lancaster, told AFP the claim is “nonsense”.", "In an email dated September 10, 2020, he quoted the Oxford English Dictionary, saying: “The alcohol-related meaning of hang-over is an extension of an earlier meaning ‘a thing or person remaining or left over; a remainder or survival, an after-effect’ (Oxford English Dictionary:OED).", "“[This] example (also from the OED) [‘that easily inspired hatred of Germany remained as a hang-over in America long after it had been thrown over by the British’] illustrates this earlier sense of hang-over, which also still exists in Present-day English of course.", "“It is not hard to see how hang-over acquired its alcohol-related sense, given that a hang-over is the after-effect of drinking too much.”", "Below is a screenshot of the English Oxford Dictionary entry for hangover, with the entry referenced by Van Olmen highlighted in yellow.", "Misleading Image", "A reverse image search of the image in the Facebook post found the original published here on Getty Images, with the title: “Actors ‘Sleeping’ Draped Over Ropes”. The image shows a re-enactment of the practice for the movie The Great Train Robbery.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]