["About this rating", "The number of gun deaths in the U.S. since 1968 exceeds even relatively high estimates of the number of deaths in all wars in American history and among U.S. military personnel in conflicts abroad.", "The gap between the two totals may be significantly smaller than stated in some versions of this claim.", "In the aftermath of the 1 October 2017 mass shooting in Las Vegas, the American public attempted to come to grips with the scale of gun violence in the United States. One oft-cited statistic posted in social media by \"The Other 98%\" maintained that 1.3 million Americans had been killed in all the wars in U.S. history, while 1.5 million Americans had been killed by firearms (in non-military use) since 1968 alone:", "NBC News reported similar figures:", "More Americans have died from gunshots in the last 50 years than in all of the wars in American history. Since 1968, more than 1.5 million Americans have died in gun-related incidents, according to data from the U.S. Centers for Disease Control and Prevention. By comparison, approximately 1.2 million service members have been killed in every war in U.S. history, according to estimates from the Department of Veterans Affairs and iCasualties.org, a website that maintains an ongoing database of casualties from the wars in Iraq and Afghanistan.", "Different versions of this claim have been prominently offered in recent years by sources such as New York Times columnist Nicolas Kristof in 2015, and PBS Newshour contributor and commentator Mark Shields in 2012.", "All these claims contain casual uses of the qualifier \"Americans\" in reference to gun deaths, which is somewhat confusing because not everyone who has been killed by firearms in the United States was an American citizen, and official sources for gun death statistics do not offer breakdowns by nationality. Therefore, we assume that \"Americans\" is used here for rhetorical effect, rather than as a functional statistical category, and deal with the total number of gun deaths occurring in the United States since 1968.  Similarly, according to the historian Don H. Doyle, the U.S. Civil War saw around 543,000 foreign-born (i.e., immigrant) soldiers fighting on the Union side alone, so a significant number of Civil War deaths might have involved non-American citizen combatants, but we'll count them all as \"Americans.\"  (Indeed, non-U.S. citizens have likely served and died fighting for the U.S. side in every American military conflict since the Revolutionary War, but probably in much greater numbers during the Civil War than any other.)", "Support for this claim often uses sources that relate only to combatant deaths in wars and do not include civilian or other non-combatant deaths (the latter being figures which might also include non-U.S. citizens). One could argue that civilian deaths in wars should be included (although estimates of these deaths are much less reliable than for fatalities among military personnel), but we are limiting our analysis to include only combatant deaths in military conflicts.", "We'll break this analysis into two parts: the total number of deaths in the United States involving firearms since 1968, and the number of deaths in  the U.S. and among American combatants across all wars in American history.", "Gun deaths", "The estimated total number of firearms-related deaths from 1968-2016 is 1.58 million. The official number for 1968-2015 is 1.55 million, and we have assumed the number of deaths in 2016 as being the mid-point between the two previous years (2014 and 2015).", "In most cases, the source of these figures is the Centers for Disease Control's (CDC) Web-based Injury Statistics Query and Reporting System (WISQARS). For figures from 1968 to 1991, we consulted the CDC directly", "Deaths in wars", "For combatant fatalities, our main source is an April 2017 summary published by the Department of Veterans Affairs, which lists the following figures:", "The Civil War Trust, a non-profit organisation primarily dedicated to preserving American battlefields, estimates that around 6,800 people died in battle during the Revolutionary War, with an additional 17,000 deaths caused by disease, and between 8,000 and 12,000 more deaths occurring among those held as prisoners of war. The upper end of this estimate range, then, would put the total number of deaths associated with the American Revolutionary War at 26,800.", "Similarly, the Civil War Trust estimates that around 15,000 Americans died during the War of 1812, a significantly higher number than the 2,260 battle deaths estimated by the Department of Veterans Affairs.", "The Civil War is an interesting case. Based on from the work of two late 19th and early 20th century historians, the widely accepted figure for deaths in this conflict was reckoned as 618,222 for about a century. In 2011, however, J. David Hacker ( then of Binghamton University) published a significant upwards revision of that total, estimating that the likely death toll was between 650,000 and 851,000. Taking the mid-point in this estimate range assumes about 750,000 combatant deaths for the Civil War.  Because of the enhanced statistical sophistication involved in Hacker's research, and what appears to be acceptance and support of his estimate among historians, we are going to use 750,000 as the estimated death toll among combatants in the Civil War.", "Figures for the Global War on Terror are taken from the Department of Defense's Defense Casualty Analysis System and are valid as of October 2017.", "Afghanistan war:", "Iraq war:", "If we rely on the Department of Veterans Affairs summary, while accepting J. David Hacker's 750,000 estimate for the Civil War, the total number of deaths among American combatants in all U.S. military conflicts, using high estimates for each, is thus 1,481,862 — about 100,000 less than the total number of firearms-related fatalities in the U.S. between 1968 and 2016.", "So even using the higher end of available estimates for war deaths throughout American history, the grand total of those deaths is still lower than the total of firearms-related fatalities since 1968, a period of just 49 years. Although this disparity between war deaths and gun deaths is smaller than the gap claimed by the Other 98% (200,000) or NBC News (300,000), the imprecision of casualty estimates (especially for the Civil War era) allows for a considerable margin of error.", "Bailey, Chelsea.   \"More Americans Killed by Guns Since 1968 Than in All U.S. Wars — Combined.\"\r\n    NBC News.   4 October 2017.", "Doyle, Don H.   \"The Civil War Was Won by Immigrant Soldiers.\"\r\n    Time.   29 June 2015.", "U.S. Department of Veterans Affairs.   \"America's Wars.\"\r\n    April 2017.", "Fox, William F.   \"Regimental Losses in the American Civil War, 1861-1865.\"\r\n    Hathi Trust, 1898.", "Livermore, Thomas L.   \"Numbers and Losses in the Civil War in America, 1861-1865.\"\r\n    Retrieved from Archive.org, dated 1900.", "Hacker, J. David.   \"Recounting the Dead.\"\r\n    The New York Times.   20 September 2011.", "Gugliotta, Guy.   \"New Estimate Raises Civil War Death Toll.\"\r\n    The New York Times.   2 April 2012.", "McPherson, James.   Battle Cry of Freedom: The Civil War Era.\r\n    Oxford University Press, 1988.   ISBN 0-195-03863-0.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]