["About this rating", "Since as early as August 2012, increasing numbers of the infamously invasive New Guinea Flatworm have appeared in Florida. These animals can theoretically transmit the rat lungworm parasite to humans.", "The primary risks posed by the New Guinea flatworm are to the ecosystem it invades and not to human health. As such, the Florida Fish and Wildlife Conservation Commission does not recommend calling 911 to report their sightings. The New Guinea Flatworm does not (and can not) eat rats or mice, despite claims to the contrary.", "On 21 March 2017, a viral post from a web site called Goodfullness.com (titled \"If You See One of These Slugs Inside Your House, Dial 911 Immediately!\"), argued that the invasion of the New Guinea Flatworm in Florida poses a acute risk to human health that necessitates calling 911. While this post (and many others like it) frames their invasion as a new event, it is not. This non-native species, also called Platydemus manokwari, was first spotted in August 2012 and confirmed by a team of researchers in 2015 in a scientific report that made significant news at the time:", "In the USA, the accidental introduction of P. manokwari through human agency to Florida is probably recent, with our first specimens found in August 2012. The species is apparently now well established, with several different locations found in 2014 in Miami Dade County.", "While viral posts implied that the discovery of a New Guinea Flatworm in one's home necessitates a police response, authorities suggest otherwise. We reached out to the Florida Fish and Wildlife Conservation Commission to ask if their department recommended reporting sightings of the New Guinea Flatworm to 911. They told us, via e-mail, that it is not necessary:", "The FWC is aware that New Guinea flatworms have spread to many parts of Florida, and people do not need to report sightings.", "Indeed, the primary danger of the New Guinea Flatworm is to the ecosystem rather than to human health. The pest has an infamous track record of damaging the ecosystems to which they have been introduced, as discussed in a 2014 study on their occurrence in France:", "Examined from an environmental perspective, P. manokwari has demonstrably had a serious negative impact on the biodiversity of native snail populations in the Pacific region [...] and wherever it is deliberately or accidentally introduced it will continue to pose a threat not only to native molluscs, but possibly to other slow-moving soil invertebrates [...] It may also indirectly have a negative impact on vertebrate species dependent upon these soil invertebrates.", "From a human health standpoint, the Goodfullness.com post makes a number of assertions about the risks P. manokwari presents to humans and other, larger creatures:", "These worms have the ability to consume rats and mice and when they dine on these animals, they pass on lungworm infections. From there, the infections are then transmitted to humans who are exposed to any air particles that have been contaminated by the rodent droppings.", "According to Florida International University professor of biology Timothy Collins, who actively studies their occurrence in Florida, the New Guinea Flatworm does not prey on rats, and typically eats \"snails, earthworms, [and] slow-moving arthropods\".", "The New Guinea Flatworm is, however, a possible carrier of a parasite that passes through the feces of rats — the rat lungworm (Angiostrongylus cantonensis). This parasite generally causes mild symptoms that generally resolve without treatment, but is capable of a more serious infection called eosinophilic meningitis, according to the CDC:", "Some infected people don't have any symptoms — or have only mild symptoms that don't last very long. Sometimes the infection causes a rare type of meningitis (eosinophilic meningitis). The symptoms can include headache, stiff neck, tingling or painful feelings in the skin, low-grade fever, nausea, and vomiting.", "The rat lungworm, as it turns out, utilizes a complex life cycle which requires three hosts, one of which can be a flatworm or snail, as described in a 2012 review of the parasite:", "When rats eat infected slugs or snails, they ingest third stage larvae which eventually grow to sexual maturity and reproduce in the heart. Single-celled eggs hatch in the lung, and first stage larvae migrate up the bronchial tree, are swallowed, and 6–8 weeks after infection are excreted with feces.", "Slugs or snails then eat rat feces and acquire the first stage larvae. Slugs and snails are obligatory intermediate hosts which support parasite development from the first to the third larval stage.", "If one’s food were to accidentally come in contact with the mucus of an infected flatworm, or if one were to directly consume the animal itself, you could potentially contract a rat lungworm infection, Collins told us via email:", "Angiostrongylus cantonensis, or rat lungworm, is carried by many animals, including Platydemus. For example, it has been reported in the Giant African Land Snail in Florida. There are published medical cases of people becoming infected with Angiostrongylus after eating lettuce over which snails infected with Angiostrongylyus have crawled.", "He tempered this analysis, however, with the caveat that there have yet to be any confirmed cases of the New Guinea Flatworm carrying the rat ringworm in Florida, and provided us with this simple advice:", "The average person can avoid risk by not handling the flatworms, or if they do, by not putting their hands near their eyes or nose before cleaning them carefully. In addition to the health risk, Platydemus have been reported by some brave soul to taste terrible, so eating them is a bad idea all around.", "This advice is in line with the CDC’s position as well:", "Don't eat raw or undercooked snails or slugs, frogs or shrimp/prawns. If you handle snails or slugs, wear gloves and wash your hands. Always remember to thoroughly wash fresh produce. When travelling in areas where the parasite is common, avoid eating uncooked vegetables.", "This invasive creature is a big problem for local ecosystems, and it is an issue that Collins and other scientists are actively researching. However, while there are indirect potential risks to humans from the New Guinea Flatworm in Florida, these risks in no way necessitate calling 911.", "Goodfullness.   \"If You See One of These Slugs Inside Your House, Dial 911 Immediately!\"\r\n    21 March 2017.", "DavidWolfe.com.   \"Experts Warn Americans About New Deadly And Invasive Worm!\"\r\n    14 August 2016.", "Justine, Jean-Luo, et al.   \"The Invasive Land Planarian Platydemus Manokwari (platyhelminthes, Geoplanidae): Records from Six New Localities, Including the First in The USA.\"\r\n    PeerJ.   23 June 2015.", "IFL Science.   \"New Guinea Flatworm, one of the Worst Known Invasive Species, Found in US.\"\r\n    23 June 2015.", "Justine, Jean-Luo, et al.   “The Invasive New Guinea Flatworm Platydemus Manokwari in France, the First Record for Europe: Time for Action Is Now.\"\r\n    PeerJ.   4 March 2014.", "Centers for Disease Control and Prevention.   \"Angiostrongylus cantonensis FAQs.\"", "Jarvo, Susan I., et al.   “Quantitative Pcr Estimates Angiostrongylus Cantonensis (rat Lungworm) Infection Levels in Semi-slugs (Parmarion martensi).\"\r\n    Molecular and Biochemical Parasitology.   16 August 2012.", "Updated [20 September 2018]: Updated with a clarified statement from the FWC.", "Kim LaCapria is a former writer for Snopes.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]