["About this rating", "Nine states in the 2020 presidential election sent eligible voters mail-in ballots totaling in the millions without requiring applications first. Additionally, Montana allowed counties to decide whether it would send ballots that way, no request necessary.", "It is false to imply that millions of ballots were improperly mailed in the 2020 election, or suggest that the system was a nefarious scheme. The mailing was in accordance with the states' laws. A handful of states send eligible voters ballots without applications in every election — not just in 2020.", "Voting in the 2020 U.S. Election may be over, but the misinformation keeps on ticking. Never stop fact-checking. Follow our post-election coverage here.", "In mid-November 2020, an email from U.S. President Donald Trump's reelection campaign alleged millions of mail-in ballots were erroneously sent to people who did not request them. (Read more fact checks like this one here.)", "\"Millions of mail-in ballots were sent to people who never asked for them,\" claimed a Nov. 16 email obtained by Snopes.", "The claim implied people \"who never asked\" for mail-in ballots wrongfully received them, and, because of that, the election was tainted with fraud and Americans should reject the results of the popular vote.", "Firstly, let this fact be clear: Americans have been voting by mail since the Civil War in the 1860s. In the modern era, the majority of states for years have allowed anyone to request an absentee ballot and submit it via mail — while others only allowed people to vote absentee if they provided a qualifying reason for why they can’t make it to a designated polling station on Election Day, such as illness, physical disabilities, travel, or work.", "Meanwhile, five states allowed all eligible voters in all elections to submit ballots entirely by mail — Colorado, Hawaii, Oregon, Washington, and Utah — while other states permitted local jurisdictions to run elections by mail under certain circumstances.", "The COVID-19 pandemic, however, put new pressure on the country to expand existing vote-by-mail systems to avoid spreading the virus at polls.", "Several states passed new laws to allow all eligible residents to vote by mail, per the National League of State Legislature's compilation of state laws governing mail-in voting in 2020, or added \"COVID-19\" to their list of reasonable excuses to request an absentee ballot.", "But at the core of Trump's allegation about \"millions of mail-in ballots\" being sent to people who didn't want them were states' varying rules regarding ballot applications.", "Most states — but not all of them — require voters to submit an application that expresses their desire to vote by mail in order to receive the official ballot paperwork to cast a vote. Additionally, some states permit voters to apply for \"permanent absentee ballot status\" so they automatically receive ballots via mail each election and do not need to submit applications for each one. The NLSL stated:", "The ways in which voters may request a ballot vary, as do the deadlines for submitting the application to the local election official. Some states regulate who can distribute or collect applications for delivered ballots as well.", "Once the application is received, states have a process for verifying that the application did indeed come from the intended voter before sending a ballot to that voter.", "That said, the handful of states that have for years conducted elections entirely by mail — Colorado, Hawaii, Oregon, Washington, and Utah — send ballots to every person listed in their respective databases of eligible voters, no application necessary.", "With COVID-19, California, Nevada, New Jersey, and Vermont also conducted the 2020 presidential election that way — every eligible resident received a ballot in the mail to vote for Trump or Biden, per NLSL. Additionally, Montana allowed counties to decide whether they would conduct the election that way, no requests for mail-in ballots necessary.", "So, considering the number of registered voters in those 10 states (there are more than 4.2 million in Colorado alone) there's some truth to the claim \"millions of mail-in ballots were sent to people who never asked for them\" in the Trump-Biden race, if you consider the application process the step in which people \"ask for\" ballots.", "However, that argument is flawed by the fact that recipients of those ballots at one point registered to vote. And, in at least a handful of the 10 states, by registering to vote, they were joining a vote-by-mail system that sends ballots without applications first.", "In short, it is false to imply that millions of ballots were improperly or erroneously mailed in the 2020 election, or suggest that the system was a nefarious scheme to undermine Trump.", "We should note here: The emails from Trump's campaign attempting to sound the alarm on a fictional election conspiracy asked supporters to chip in to a so-called \"Official Election Defense Fund\" or \"Election Defense Task Force,\" both of which the campaign framed as costly initiatives involving ballot recounts or various lawsuits to challenge Biden's win.", "But according to Brendan Fischer, director of the federal reform program at Campaign Legal Center, the average donor's money was not covering those expenses. \"Small donors who give to Trump thinking they are financing an 'official election defense fund' are in fact helping pay down the Trump campaign’s debt or funding his post-presidential political operation,\" Fischer tweeted.", "In sum, while it was true millions of mail-in ballots were sent to people who did not submit applications for them in the 2020 presidential election, it was a mischaracterization of states' election laws to frame that fact as evidence of impropriety or fraud. Rather, the ballots were sent to registered voters in accordance with state laws. For those reasons, we rate this claim \"Mostly False.\"", "Jessica Lee is Snopes' Senior Assignments Editor with expertise in investigative storytelling, media literacy advocacy and digital audience engagement.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]