["By Robert Farley", "Posted on February 19, 2021", "President Joe Biden this week boasted on Twitter about his promise to administer 100 million vaccine doses in his first 100 days in office, “With the progress we’re making I believe we’ll not only reach that, we’ll break it.” But as some critics have noted, it was a pretty low bar to begin with.", "On the day Biden was inaugurated, the U.S. administered nearly 1.5 million shots, according to the Centers for Disease Control and Prevention’s COVID Data Tracker. On that day, the seven-day average for the previous week was about 966,000 shots a day. In other words, the U.S. was already virtually at the pace Biden set as his goal before he took any action as president.", "By Biden’s second day in office, the seven-day average was at the 1 million doses per day average needed to meet his 100-day goal.", "Before I took office, I set a big goal of administering 100 million shots in the first 100 days. With the progress we’re making I believe we’ll not only reach that, we’ll break it.", "— President Biden (@POTUS) February 16, 2021", "The goal seemed more ambitious when Biden first announced his “100 million shots in the first 100 day” goal in a Dec. 8 speech in Wilmington, Delaware, as president-elect. At that point, vaccinations hadn’t even begun yet.", "A New York Times story that day called it an “ambitious” goal and said “fulfilling it will require no hiccups in manufacturing or distributing the vaccine and a willingness by Americans to be vaccinated.” The reporters said the experts they spoke to found Biden’s timeline to be “achievable” but “optimistic.”", "It still seemed like an “incredible goal,” as Biden put it, when he talked about the promise on Dec. 29, less than two weeks after the first vaccine doses were administered.", "“It would take ramping up five to six times the current pace to 1 million shots a day, but even with that improvement, even if we boost the speed of vaccinations to 1 million shots a day, it will still take months to have a majority of the United States population vaccinated,” Biden said.", "The day before he made that speech, Dec. 28, two weeks into distribution, the U.S. had administered a total of 3.5 million doses of vaccine. So measuring from Day One, the daily average was about 250,000 — and it would take four times that rate to get to Biden’s goal of 1 million a day.", "But even then, Biden was misleadingly ignoring the upward trend. On Dec. 29, the day of Biden’s speech, the CDC reported that 686,411 vaccines were administered — or roughly two-thirds of what would be needed to meet Biden’s daily goal. The seven-day average that day was 317,766.", "To be sure, the vaccine rollout was slower than expected at the beginning. Although then-President Donald Trump had promised to vaccinate 20 million Americans by the end of 2020, the total at year’s end was just 5.4 million.", "But the number of doses administered continued to trend upward during the final weeks of the Trump presidency. On Jan. 7, a little more than a million doses were administered, and the seven-day average was up to 542,000, according to the CDC. By Jan. 14, the seven-day average was up to 918,000 doses per day.", "Despite the upward trend, an article in USA Today on Jan. 14 continued to call Biden’s 100-shots-in-100-days promise “a lofty goal to reverse a slow start to the nation’s vaccine rollout.”", "That same day, Michael Osterholm, a member of Biden’s COVID-19 task force, called Biden’s goal “aspirational … but doable’’ and warned that the “first days of that 100 days may be substantially slower than it will be towards the end.”", "“It’s not going to occur quickly … you’re going to see the ramp-up occurring only when the resources really begin to flow,” Osterholm, the director of the Center for Infectious Disease Research and Policy at the University of Minnesota, told STAT news.", "But by that time, the average number of daily doses was already nearing the 1 million shots a day threshold needed to meet Biden’s promise. And by Jan. 20, the day of Biden’s inauguration — a day that saw nearly 1.5 million vaccines administered — the seven-day average was about 966,000.", "The following day, Jan. 21, another roughly 1.5 million doses were administered, bringing the seven-day average to over 1 million per day. After Biden gave a speech on the COVID-19 response, a reporter asked if — given the pace of vaccination he inherited — Biden shouldn’t have set his bar higher.", "“When I announced it, you all said, ‘It’s not possible.’ Come on, give me a break man,” Biden responded.", "At a press briefing later that day, White House Press Secretary Jen Psaki was also asked why Biden wasn’t “shooting just a little bit higher.”", "“Well, none of us are mathematicians, myself included, so I asked our team to do a little math on this,” Psaki responded. “So, the Trump administration was given 36 million doses when they were in office for 38 days. They administered a total of about 17 million shots.  That’s about less than 500,000 shots a day. What we’re proposing is to double that to about 1 million shots per day. And we have outlined this goal and objective in coordination and consultation with our health and medical experts. So it is ambitious. It’s something that we feel is bold and was called that certainly at the time, and we’re working overtime to help to achieve it — try to achieve it.”", "Psaki’s math is roughly accurate, but again, it misleadingly ignores the trend line, and the fact that the U.S. had virtually reached the 1 million doses per day average in the week before Biden took office.", "Indeed, many experts were underwhelmed by Biden’s goal.", "“I think we probably need to be a bit more audacious in these goals,” CNN chief medical correspondent Sanjay Gupta said on air shortly after Biden bristled at the reporter who asked if the goal shouldn’t be higher.", "Gupta praised the Biden administration’s vaccination plans, particularly for expanding the role of the federal government in helping states to administer the vaccinations.", "But given the number of vaccinations occurring by the time Biden took office, Gupta said the administration may be “under promising and with the hope of over delivering.”", "In remarks on Jan. 25, Biden seemed to acknowledge the low bar, suggesting the U.S. might beat his goal by 50%.", "“I think, with the grace of God, and the goodwill of the neighbor, and the creek not rising, as the old saying goes, I think we may be able to get that to … 1.5 million a day, rather than 1 million a day,” Biden said.", "But by the following day, he had retreated back to his original “ambitious goal of 100 million shots in 100 days.” He added that was “not the endpoint; it’s just the start.”", "By Feb. 9, the seven-day average had already moved beyond 1.5 million doses per day. According to an NBC News tracker of Biden’s vaccination goal, the U.S. is on pace to reach 150 million doses in Biden’s first 100 days, which ends April 29.", "In a press briefing on Feb. 17, a reporter asked Psaki about Vice President Kamala Harris’ comment in an interview that aired Feb. 14, “In many ways, we [the Biden administration] are starting from scratch on something that’s been raging for almost an entire year.” Was that appropriate, the reporter asked, given that the U.S. was administering nearly a million shots a day in the week before Biden took office?", "“When the president came in and the vice president came in, there were not enough vaccines, there were not enough vaccinators, there were not enough vaccination locations,” Psaki said. “They’ve taken significant steps to address all of those issues. Yes, in the week prior to the president taking office, there were about 800- to 900,000, as you said, doses doing — being given a day. The average was about 400- to 500,000 prior to that. Last week, the average was 1.7 million a day. So there are significant steps that have been taken.”", "The Biden administration is free to boast about its efforts to ramp up vaccinations, which experts have also praised. But Biden and Psaki are spinning the facts. Although the initial rollout was slow under Trump and many first viewed Biden’s goal as ambitious, vaccinations steadily increased each week, nearly reaching 1 million doses a day when Biden took office.", "At the current rate, there’s no reason to think the U.S. won’t “break” Biden’s goal of 100 million shots in 100 days, as he boasted on Twitter.", "Editor’s note: FactCheck.org does not accept advertising. We rely on grants and individual donations from people like you. Please consider a donation. Credit card donations may be made through our “Donate” page. If you prefer to give by check, send to: FactCheck.org, Annenberg Public Policy Center, 202 S. 36th St., Philadelphia, PA 19104.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]