["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "An Internet post that said Fox News host Sandra Smith accused a man kicked off a United Airlines flight of not being a \"genuine American\" is a fake story from a parody site.", "An April 14, 2017, post on known fake news site USPOLN.com ran under the headline, \"Fox News Sandra Smith: ‘Everybody could see from the United Airlines passenger’s behavior that he was not a genuine American.’\" The story referred to United’s April 10 forcible removal of David Dao off a flight from Chicago to Louisville, Ky.", "The article was flagged by Facebook users as possibly being fabricated, as part of the social media site’s efforts to winnow fake stories from news feeds.", "Smith and Geraldo Rivera did discuss the issue during a panel on Fox News on April 12. But beyond the initial quotes about Rivera hating airlines and Smith suggesting United faced too much regulation, the story is completely made up.", "According to the story, Smith began ranting about how airlines were over-regulated and how Dao’s East Asian racial background rightfully made other passengers nervous in a post-Sept. 11 world.", "\"That goes especially in a situation in which the passenger in question was not a genuine American,\" Smith was falsely quoted as saying. \"As a matter of fact, if you take a look at the video of what happened on the plane, it’s obvious that his behavior suggests that he’s from another part of the world, and that’s that.\"", "There’s more to the story, but it’s so ridiculous we’ll stop there. The privately registered USPOLN.com (short for U.S. Political News) said in its About Us link that it is a \"hybrid News/Satire platform to provide the latest and breaking news for for Political, Government, Cultural, and Religion news.\"", "Not only that, but the post links to the original source of the article, a website called Politicass.com, which posted the story on April 12.", "Politicass.com is part of the Newslo.com family of parody sites. Newslo.com, and refers to itself in a disclaimer as \"the first hybrid News/Satire platform on the web.\" The Newslo.com site is registered to an administrator named Eli Sompo, at an address in Greece, while Politicass.com is registered in Israel.", "What makes Newslo.com-related stories especially confusing is that they use a small piece of real news or quotes by real people and build fake stories around them. They feature a pair of buttons that allow readers to highlight the true parts of their stories, so readers can conceivably know the difference. But on other sites without the buttons, there’s no way to know.", "USPOLN.com used an already fake story from Politicass.com and removed the only indication the post was fake. A reader on the site would not know it was bogus without doing some digging.", "We rate the statement Pants On Fire!", "USPOLN.com, \"Fox News Sandra Smith: ‘Everybody Could See From The United Airlines Passenger’s Behavior That He Was Not A Genuine American’,\" April 14, 2017", "Politicass.com, \"Fox News Sandra Smith: ‘Everybody Could See From The United Airlines Passenger’s Behavior That He Was Not A Genuine American’,\" April 12, 2017", "PolitiFact, \"Did the United Airlines passenger have 'every right' to stay on the plane?,\" April 14, 2017", "RawStory.com, \"‘There’s another side to this story’: Fox host blames bloody United passenger on ‘overregulation’,\" April 12, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]