["About this rating", "Voting in the 2020 U.S. Election may be over, but the misinformation keeps on ticking. Never stop fact-checking. Follow our post-election coverage here.", "The internet was flooded with false claims about voter fraud in the days following the 2020 U.S. presidential election on Nov. 3, 2020. Many of these rumors centered around a piece of software from Dominion Voting Systems. We've addressed a few of these rumors in a previous article, but the most prevalent claim, and one that was spread by U.S. President Donald Trump himself on Nov. 12, 2020, was that Dominion software had deleted 2.7 million votes that had been cast for the incumbent:", "There is no truth to this claim.", "On Nov. 12, 2020, a coalition of federal and state officials, including members of the U.S. Cybersecurity and Infrastructure Security Agency (CISA) and the National Association of State Election Directors (NASED), released a statement calling the 2020 election the \"most secure in American history.\" The statement went on to specifically address Trump's false claim about votes being deleted, writing that \"there is no evidence that any voting system deleted or lost votes, changed votes, or was in any way compromised.\"", "Here is the statement in full:", "The November 3rd election was the most secure in American history. Right now, across the country, election officials are reviewing and double checking the entire election process prior to finalizing the result.", "When states have close elections, many will recount ballots. All of the states with close results in the 2020 presidential race have paper records of each vote, allowing the ability to go back and count each ballot if necessary. This is an added benefit for security and resilience. This process allows for the identification and correction of any mistakes or errors. There is no evidence that any voting system deleted or lost votes, changed votes, or was in any way compromised.", "Other security measures like pre-election testing, state certification of voting equipment, and the U.S. Election Assistance Commission's (EAC) certification of voting equipment help to build additional confidence in the voting systems used in 2020.", "While we know there are many unfounded claims and opportunities for misinformation about the process of our elections, we can assure you we have the utmost confidence in the security and integrity of our elections, and you should too. When you have questions, turn to elections officials as trusted voices as they administer elections.", "Trump did not provide any evidence to support his false claim that 2.7 million votes were deleted by Dominion Software, but he did tag Channel Rion and One American News Network (OAN), a far-right web publisher that recently reported on these unsubstantiated claims.", "The OAN segment (which was archived by Mediate) claimed that an \"unaudited analysis of data obtained from Edison Research\" found that Dominion Voting Systems \"switched as many as 435,000 votes from President Trump to Joe Biden\" and that \"another 2.7 million Trump votes appear to have been deleted by Dominion.\"", "Edison Research President Larry Rosin, however, disputed these claims. In a statement to the The Dispatch Fact Check, Rosin said: \"Edison Research created no such report and we are not aware of any voter fraud.\"", "A spokesperson for Dominion Voting Systems issued a similar statement to the Denver Post: \"Dominion Voting Systems categorically denies any claims about any vote switching or alleged software issues with our voting systems. Our systems continue to reliably and accurately count ballots, and state and local election authorities have publicly confirmed the integrity of the process.\"", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]