["State Rep. Doug Miller declared that very few legislators, who are paid $7,200 a year plus expenses, have qualified to draw pension benefits based on the much greater salary of a state district judge.", "During Texas House debate May 21, 2013, the New Braunfels Republican pointed out that a legislator has to serve eight years to qualify for the pension if he or she retires at age 60, or 10 years \"if you retired at age 50.\" (Actually, a legislator needs to serve 12 years to retire with the benefits at age 50, according to a booklet from the Employees Retirement System of Texas.)", "Miller further declared that it takes 43 years and six months of service to qualify for 100 percent of the pension, which is equal to the salary of a state district judge. For each year of service, a legislator qualifies for a pension equal to 2.3 percent of the judicial salary, which has been $125,000 since 2005, Austin American-Statesman commentator Ken Herman reported in a column posted online May 30, 2013.", "Miller wasn’t done. After noting the average tenures of current lawmakers, he said, \"Less than half a percent of the people that ever served, and there have been over 5,000 people (who) served in this House, less than half a percent ever receive a benefit under this (pension) plan.\"", "We took that as Miller saying that less than half of 1 percent of House and Texas Senate members ever drew a pension benefit, an interpretation Miller confirmed by telephone.", "Is that right?", "To our request for backup information, Miller’s office sent us a document indicating that 63 of the 181 current members of the House and Senate, 35 percent, will have served 10 years or more through 2013. This was accompanied by a 27-page document, dated May 21, 2013, and attributed to the Legislative Reference Library, listing legislators since statehood who have served 10 years or more.", "According to news accounts, lawmakers tied legislator pensions to the salary of a state district judge in 1975. By telephone, Mary Jane Wardlow, a spokeswoman for the Employees Retirement System of Texas, said that a 1969 law previously allowed legislators to contribute a portion of their pay check to the retirement system, which would potentially have qualified them for pensions tied to their own salaries.", "Unsaid: The 1975 law set in motion better long-term rewards.", "And according to a May 17, 2013, Texas Tribune news article, lawmakers this year were poised to increase the base salary of state district judges by 12 percent, to $140,000, which would increase the legislative pension benefit by at least $2,760 a year.", "\"Actual benefits vary depending on choices lawmakers make in their plans (they can opt out, though few do so), on other pensions, and non-legislative government service and so on,\" the story said, with eligible members qualifying for annual pensions of $27,760 to $140,000. The story said that former House Speaker Tom Craddick, a House member since the late 1960s, would be subject to a cap of $140,000 \"since the benefit can't exceed the amount of the judicial salary it's based on.\" Also, the story said, retired lawmakers would draw the increases in pension payments, too. \"The retired elected officials class currently includes 513 former legislators, district attorneys and others,\" the Tribune said, \"as well as 137 survivor beneficiaries, each of whom collects an average of $44,196 in annual benefits.\"", "Miller did not specify how he determined the number of legislators who have drawn a benefit from the pension. But by email, his chief of staff, Fritz Reinig, pointed out the reference library’s online database listing every legislator since 1846. Texas joined the United States in late 1845.", "Working from the library’s lists, we estimated the number of legislators who at least became eligible for the pension, conservatively sticking with Miller's formulation tied to 10 years of service rather than the minimum of 8 years needed to qualify. By our count, about 380 legislators served 10 years or more from 1969 through the 2013 regular session. Over those years, reference librarian Catherine Wusterhausen told us by email, 971 individuals served as legislators. Put another way, then, approximately 39 percent of legislators would have qualified for the pension benefit, though this is not to say that each one signed up for it; that’s not public information, Wardlow said.", "Yet Miller’s claim referred to all legislators since statehood. Our search of the library’s database for every legislator since 1846 delivered 5,515 names, which was probably too high. Wusterhausen told us by email that, like her 971 count, this figure would include temporary acting representatives and those later removed following an election contest plus individuals elected but not sworn in.", "Conservatively speaking, still, our estimated 380 legislators who could have qualified for the pension comprise 7 percent of all Texas legislators through history.", "What gives?", "Miller, apprised of our analysis, said his intent was to show that few legislators serve long enough to qualify for the potential pensions. From his list, for instance, it appears that nine of the House’s 150 members will have served 21 years or more through 2013. That's how long a member would have to serve to potentially draw a pension equal to half a district judge’s salary.", "Miller agreed his \"half of 1 percent\" claim did not come out as intended. \"It’s the heat of the debate,\" he said.", "Our ruling", "Miller said that \"less than half of 1 percent\" of Texas legislators through history have drawn a benefit from the pension tied to the salary of a state district judge.", "Granted, the state cannot reveal which legislators have qualified or chosen to take the pension. But by our reckoning based on legislative rosters, more than 7 percent of legislators through history could have qualified for the pension benefit. That’s misleading in itself, though, because only about 1,000 legislators have served since the benefit was put into law. We estimate that 39 percent of actual potential beneficiaries have served 10 years or more, meaning they could have qualified for the pension.", "Either percentage is considerably more than \"less than half of 1 percent,\" leaving this claim as False.", "Telephone interviews, Doug Miller, New Braunfels, June 5 and 12, 2013", "Booklet, \"Retirement Benefits for Elected State Officials,\" Employees Retirement System of Texas, January 2013 (downloaded June 7, 2013)", "Documents, Texas House and Senate members, years as legislators and Legislators who served 10 years or more, 1846 to present, (received by email from Fritz Reinig, chief of staff to Rep. Miller, June 6, 2013)", "News article, \"How Lawmakers' Pensions Would Grow Under Budget,\" the Texas Tribune, May 17, 2013", "Database, \"Texas Legislators: Past & Present,\" Legislative Reference Library (accessed June 11, 2013)", "Telephone interview, Mary Jane Wardlow, spokeswoman, Employees Retirement System of Texas, June 12, 2013", "Email, Catherine Wusterhausen, assistant director, Legislative Reference Library, June 12, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]