["A political action committee supporting Marco Rubio portrays Donald Trump as not being in the Israel fan club.", "In a TV ad running in Florida, a screen shot shows a man wearing a bandana featuring what appears to be Arabic letters holding a rocket-propelled grenade.", "Trump \"says he would be neutral between Israel and its enemies,\" says the Conservative Solutions PAC ad.", "Is that accurate?", "Trump did make a statement about being \"neutral\" in negotiations between Israel and Palestinians, but the ad omits other statements Trump made in support of Israel.", "Trump’s position on Israel at a town hall and debate", "The ad cites the MSNBC town hall with Trump in South Carolina on Feb. 17. (A spokesman for the super PAC cited Trump’s comments at the town hall and at a subsequent debate.)", "MSNBC’s Joe Scarborough asked Trump whether Israelis or Palestinians were at fault for a lack of an agreement. So far, efforts have failed to work out a lasting comprehensive agreement on issues such as security, land claims, whether Israel can build settlements and recognizing each other’s right to exist.", "Trump refused to pick a side, saying that would hurt his ability to serve as a negotiator.", "\"Let me be sort of a neutral guy .... I don't want to say whose fault is it. I don't think it helps.\"", "About two weeks later at the debate in Houston, Wolf Blitzer asked Trump: \"How do you remain neutral when the U.S. considers Israel to be America's closest ally in the Middle East?\"", "Trump defended his record by saying that he had been grand marshall of the Israeli Day parade a few years ago and received awards from Israel.", "But he said when negotiating a deal, it wouldn’t help to pick a good guy and a bad guy:", "\"It doesn't help if I start saying, 'I am very pro-Israel, very pro, more than anybody on this stage,' \" Trump said, adding that he can’t negotiate as well if he takes sides. \"With that being said, I am totally pro-Israel.\"", "Trump’s additional comments about Israel", "In December, Trump told the Associated Press that he doubted the commitment of Israelis and Palestinians to the peace process. But he suggested the big lift may have to come from Israel.", "\"A lot will have to do with Israel and whether or not Israel wants to make the deal, whether or not Israel's willing to sacrifice certain things,\" Trump said. \"They may not be, and I understand that, and I'm okay with that. But then you're just not going to have a deal.\"", "Trump evaded specific questions about whether Palestinian demands are legitimate but said that Israeli housing projects were a \"huge sticking point\" in talks.", "The same week, when he spoke to the Republican Jewish Coalition, Trump praised Israel by saying that the country has already \"given a lot\" but doesn’t get credit for it.", "He explained his strategy if elected:", "\"I don’t like to as a deal maker give away a lot of cards by talking about how I feel about this or that. I’d rather save it for that moment when you walk into the room,\" he said. \"I don’t want one side or the other saying ... I think people know where I stand, okay?\"", "He said he would want to enter negotiations with a \"clean slate\" and the attitude of \"everybody is even, we love everybody, let’s see if we can do something.\"", "Trump also reminded Jewish Republicans that he endorsed Israeli Prime Minister Benjamin Netanyahu in 2013.", "\"I am a big fan of Israel,\" Trump said in the video endorsement. \"And frankly a strong prime minister is a strong Israel.\"", "During his own campaign, Trump had planned on meeting with Netanyahu in Israel but canceled the trip after Netanyahu faced backlash after Trump’s comments about Muslims.", "When asked at the Republican Jewish Coalition if he had relationships with any Arab leaders, Trump said, \"I haven’t been working too much with the Arab leaders.\"", "Trump’s rhetoric is notable on Israel because it is \"cooler and more detached\" than his GOP rivals, wrote Aaron David Miller, a former adviser to Republican and Democratic secretaries of state on Arab-Israeli negotiations who now works for the Woodrow Wilson Center.", "But while Trump has said he can be a better negotiator if he appears neutral, he has made several comments that suggest he has closer ties to Israelis than Palestinians.", "Trump’s spokespersons did not respond for this fact-check.", "Our ruling", "A PAC that supports Rubio says Trump \"says he would be neutral between Israel and its enemies.\"", "Trump has said that in order to negotiate between Israelis and Palestinians he can’t take sides.", "\"Let me be sort of a neutral guy,\" he said at a town hall.", "But the ad omits that Trump has had ties to Israel for years -- he has called himself \"pro-Israel\" and endorsed Netanyahu’s re-election in 2013. That is a good indication Trump isn’t neutral.", "We rate this claim Half True.", "Says Donald Trump has said \"he would be neutral between Israel and its enemies.\"", "Political Ad Archive, Conservative Solutions PAC TV ad, Feb. 26, 2016", "MSNBC, Town hall transcript, Feb. 17, 2016", "Donald Trump, Endorsement of Israeli Prime Minister Benjamin Netanyahu, 2013", "New York Times First Draft blog, \"Donald Trump puts off Israel trip and meeting with Benjamin Netanyahu,\" Dec. 10, 2015", "US News, \"Kerry: peace between Israelis, Palestinians still possible,\" Dec. 7, 2014", "Politico, \"Trump defies GOP litmus test on Israel,\" Feb. 27, 2016", "Wall Street Journal op-ed by Aaron David Miller, \"Donald Trump and the Art of the Mideast Peace Deal,\" Feb. 22, 2016", "Jerusalem Post, \"Israeli Right rallies around Marco Rubio,\" Feb. 8, 2016", "Haaretz, \"8 facts U.S. Jews might want to know about Marco Rubio,\" Feb. 2, 2016", "Miami Herald, \"Donald Trump stereotypes Jews in speech to Republican Jewish Coalition,\" Dec. 3, 2015", "PolitiFact, \"Trump says Iran deal forces U.S. to defend Iran if it's attacked by Israel,\" Sept. 4, 2015", "PolitiFact, \"Donald Trump is right about Putin's popularity in Russia,\" Dec. 20, 2015", "PolitiFact, Statements about Israel, Accessed Feb. 29, 2016", "Interview, Jeff Sadosky, Conservative Solutions PAC spokesman, Feb. 29, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]