["A video of a man praising PM Narendra Modi for supposedly cracking down on corruption at multiple levels is circulating online. The video has been shared with the claim, “Congress MLA Anil Upadhyay unknowingly spoke the truth.” (कोंग्रेस विधायक अनिल* *उपाध्याय अनजाने में कह गया पर सही बोल दिया.)", "*कोंग्रेस विधायक अनिल* *उपाध्याय अनजाने में कह गया पर सही बोल दिया* *इस video को इतना वायरल करो की ये पूरा हिन्दुस्तान देख सके..*👆🏿👆🏿👆🏿👆🏿👌🏼👌🏼", "Posted by Rajveer achhwan Gurjar on Saturday, 6 February 2021", "The clip is also circulating on Twitter.", "*कोंग्रेस विधायक अनिल* *उपाध्याय अनजाने में कह गया पर सही बोल दिया* *👆🏿👆🏿👌🏼👌🏼 pic.twitter.com/6AVbufnL5T", "— Ksingh@561 (@Ksingh561) February 8, 2021", "On November 29, 2019, Twitter users Neha Singh had shared the video.", "It was also widespread on Facebook and Twitter.", "This video has been viral since April 2019. Alt News’s report, ‘Republic TV falsely portrays man praising PM Modi as a Congress MLA‘, verified that the person in the video is not ‘Anil Upadhyay’, and he is not a Congress MLA. In fact, his real name is Munna Pandey.", "In order to identify the person, Alt News had searched ‘Anil Upadhyay’ in MyNeta database. The search threw up two results – a BSP leader from Jodhpur who contested the Rajasthan polls in 2018, and an independent candidate from Lucknow who contested the Uttar Pradesh assembly elections in 2007 and 2012. There is no Congress leader with the name Anil Upadhyay.", "There are several viral videos of the same man, each one with a different claim. In December 2018 a video of this person praising Prime Minister Narendra Modi was viral on social media with claims suggesting that he is Rajasthan Deputy CM Sachin Pilot’s father-in-law. Several videos of him have been shared by verified Twitter user Tanmay Shankar. In all these videos, he is seen making a very spirited and emotional case for supporting PM Modi.", "मोदी रहा तो भारत जल्द अमेरिका जैसा देश होगा। Views of Munna Pandey ji on @narendramodi governance model … pic.twitter.com/rQ5oPfpvYe", "— Tanmay Shankar (@Shanktan) April 10, 2019", "Speaking to The Quint, Shankar confirmed that the person is Mohan Pandey (Munna) and that he knows him personally.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]