["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "An infant surrounded by malaria bed net in Ghana. (World Bank)", "A grim statistic is circulating this World Malaria Day. USAID’s Tina Dooley-Jones, deputy mission director in Kenya, marked the occasion in Nairobi saying that \"globally, malaria kills a child every two minutes.\"", "Dooley-Jones is far from the only one with that message. It plays large among malaria advocacy groups like Nothing But Nets.", "So it was curious to see a post in January on Medium from the head of the President’s Malaria Initiative, rear admiral Tim Ziemer, with the statement that \"in Africa, a child dies every minute because of the disease.\" The initiative is one of the government’s largest global health efforts. It began under President George W. Bush and has been carried forward by President Barack Obama.", "Malaria’s toll among African children is a touchstone for many health activists, but the numbers can vary. Our colleagues at Africa Check spotted a range of statements. One organization claimed a child died every 30 seconds, another said once every two minutes, and in between was Ziemer’s figure.", "In this fact-check, we affirm that the correct number is closer to once every two minutes.", "USAID spokesman Ryan Essman told us that until fairly recently, his agency would talk about a death every one to two minutes, but now uses the two-minute time frame.", "\"Admiral Ziemer has been working with malaria for a decade,\" Essman said. \"He had it when he was child. Usually he uses the right number, but he might have slipped in the previous one.\"", "As a humanitarian matter, the exact death toll makes little difference. This table from the Kaiser Family Foundation, using World Health Organization data, clearly shows that Africa bears the greatest burden of malaria.", "WHO Region", "Number of countries with ongoing transmission", "Estimated cases (1,000s)", "Percentage", "Estimated deaths (in 1,000s)", "Percentage", "Global total", "96", "214,000", "100%", "438", "100%", "Africa", "44", "188,000", "88%", "395", "90%", "Americas", "21", "660", "<1%", "0.5", "<1%", "Eastern Mediterranean", "8", "3,900", "2%", "6.8", "2%", "Europe", "3", "0", "0%", "0", "0%", "South-East Asia", "10", "20,000", "9%", "32", "7%", "Western Pacific", "10", "1,500", "<1%", "3.2", "<1%", "Africa wrestles with 90 percent of all deaths by the disease worldwide, and almost as large a percentage of active cases. Malaria is particularly lethal for pregnant women and their babies. The federal government estimates that it kills about 10,000 expectant mothers each year in Sub-Saharan Africa. Another 200,000 children will die prematurely from complications due to their mothers having bouts of malaria during pregnancy.", "Malaria’s death toll", "Our colleagues at Africa Check turned to the World Health Organization data for 2015. With huge gaps in the health care systems in many African nations, all experts agree that a precise count of malaria death is impossible. The WHO provides a range of estimates.", "Number of malaria deaths in children under 5 in Africa", "Middle estimate", "292,000", "Lowest estimate", "212,000", "Highest estimate", "384,000", "From that, the middle estimate shows one child dies every 1 minute 48 seconds, or close to once every two minutes.", "Middle estimate", "1 min 48 sec", "Lowest estimate", "2 min 28 sec", "Highest estimate", "1 min 22 sec", "The U.S. government spent about $860 million this fiscal year to fight malaria. The money went for a drug that can help pregnant women and their children, but many dollars also went to insecticide-treated nets and indoor spraying to prevent people from catching the disease in the first place. Obama seeks to raise the total by about another $70 million in the last budget of his administration.", "There is a strong global push to eradicate malaria, and gains have been made. In the past decade and a half, the rate of new cases has fallen by about a third in Sub-Saharan Africa. Going forward, many hurdles remain. Mosquitoes can become resistant to the most common insecticides, weak health care systems in many countries make it difficult to sustain antimalaria programs, and counterfeit drugs can be as fatal as the disease itself.", "Our ruling", "Ziemer wrote that malaria kills a child in Africa each minute. His staff at USAID said that figure is off. A better estimate is that a child dies every 1 minute 48 seconds. But even that figure comes with a measure of uncertainty. The actual death rate could be higher or lower.", "By any estimate, malaria remains a serious threat to children in Africa.", "We rate this claim Mostly True.", "Medium, \"Rallying the World\" to Defeat Malaria, Jan. 20, 2016", "USAID, Remarks Tina Dooley-Jones on world malaria day breakfast meeting, April 21, 2016", "USAID, As the World Focuses on Zika, Malaria Continues its Deadly Toll, April 22, 2016", "USAID/CDC, President’s Malaria  Initiative Strategy, April 2015", "Africa Check, Does an African child die from malaria every 30 seconds?, April 21, 2016", "Kaiser Family Foundation, The U.S. Government and Global Malaria Efforts, April 21, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]