["An image of Delhi Health Minister Satyendar Jain talking to three men inside a medical facility has gone viral with the claim that Jain is interacting with Maulana Saad. It is noteworthy that everyone in the image has masks on their faces.", "Twitter user @sapnarat posted the image and wrote in Hindi, “Delhi’s Health Minister Satyendar Jain is with the one who is responsible for Nizamuddin Markaz and one of the world’s richest Hazrat, Maulana Saad who is donating plasma. And the media says Maulana Saad Saab is absconding. The media can’t show this because this won’t spread hate, right? (दिल्ली हेल्थ मिनिस्टर #सत्येन्द्र_जैन के साथ #निजामुद्दीन_मरकज़ के जिम्मेदार और पूरे दुनिया के अमीर हज़रत #मौलाना_साद_साहब अपना #प्लाज़्मा_डोनेट करते हुवे और मिडिया बता रही है कहा फरार है मौलाना साद साहब. अब ये मीडिया नहीं बता सकती, क्योंकि इससे नफरत नहीं पैदा होगी न). The tweet has been retweeted over 500 times. (archive link)", "Maulana Saad is the chief of Tablighi Jamaat’s Nizamuddin Markaz which was identified as a COVID-19 hotspot on March 31. The Delhi police had filed an FIR against Saad for holding a religious congregation at the Markaz in mid-March.", "Twitter user @pokershash, co-founder of Fact Hunt, shared the image with the caption, “Either Delhi Police was lying or Media was lying that Maulana Saad was absconding. @CPDelhi”", "Similarly, Facebook user Maheboob Bagwan posted the viral image along with the identical Hindi text. This post has been shared over 300 times (archive link).", "In order to authenticate the social media claim, Alt News looked for pictures on social media accounts of Jain. On April 27, the Twitter account of Satyendar Jain Office posted the same image.", "Delhi Health Minister @SatyendarJain visited Narela plasma donation center. Where many corona recovered persons are donating there plasma for humanity pic.twitter.com/3r3crx9PDB", "— Satyendar Jain Office (@SaJa_Office) April 27, 2020", "Alt News reached out Jain who clarified, “Maulana Saad isn’t present in the image. This image was clicked on April 27 at Narela plasma donation centre.” According to Jain (in blue shirt), the three men standing opposite to him in the picture are — Dr Pradeep Agarwal (left), Haji Mohammed Azad (centre) and Dr Sarfraz (right). Blood plasma is in the trial stage in many countries, including India. Patients recovered from coronavirus infection are being encouraged to donate their blood plasma as it may contain antibodies that fought off the virus.", "Alt News spoke with Azad who confirmed it was him talking to Jain. We also have a photograph of Azad which we compared with Saad’s image. The same hasn’t been added to the report for the sake of privacy.", "According to media reports, Maulana Saad is yet to be arrested by the police. While Delhi police has issued a fourth notice asking him to get tested for coronavirus in a government laboratory, his lawyer said that Saad has tested negative in a test done in a private lab. The lawyer also said that Saad is not absconding as they have responded to all notices issued by the police.", "A photograph of Delhi Health Minister Satyendar Jain interacting with people in a plasma donation centre has been shared with the false claim that he was speaking to Maulana Saad.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]