["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "The state gave Boone County $21.2 million in CARES Act funds in May. As of Sept. 11, that money had not yet been sent to applicants.", "Rowden referred in his statement to a portal for funding requests that the Boone County Commission had not yet opened. It opened five days later.", "State Sen. Caleb Rowden is disappointed with how Boone County has handled $21.2 million in federal COVID-19 relief funds.", "\"Boone County’s online CARES relief portal has fallen behind,\" he wrote Sept. 4 on Medium.com. \"Over three months after receiving CARES Act relief funds from the State, the county has still not made those dollars available to help struggling Mid-Missourians.\"", "County Commissioner Janet Thompson took issue with his statement. She said over $2 million was sent to two organizations: the Boone County Department of Health and Columbia Public Schools.", "\"Perhaps Sen. Rowden should actually contact the Boone County Commission to find out exactly what we’re doing,\" she said.", "A dispute over facts? That’s our specialty.", "After digging into the question, we found that the county had not actually given out any CARES funds by Sept. 4, although some of the money has been promised. So when did Boone County receive the money, and what happened to it?", "When reached for comment, Rowden pointed to a variety of sources to back his claim, including news articles published by the Columbia Missourian, a press release issued by the Missouri Governor’s office, and a summary of House bill 2014, which Rowden voted for in the Missouri Senate.", "Congress passed the Coronavirus Aid, Relief, and Economic Security Act on March 27. It gave money to states and Missouri, in turn, gave some of those funds to every county plus St. Louis City to help offset economic damage from the coronavirus pandemic. The state bill that authorized disbursement of CARES money, HB 2014, was signed into law by Gov. Mike Parson on April 10. Boone County received $21.2 million, which must be completely spent by Dec. 31 or the entire amount will be returned to the state.", "Parson announced May 4 that the money had been sent. Two days later, Boone County received the money.", "On July 16, Boone County commissioners said they were looking at buying software to build a portal for relief applications from organizations and the general public. The commissioners said it would likely be ready within a month, according to reporting in the Columbia Missourian.", "On Aug. 28, the Missourian reported Thompson’s announcement that the online portal would be ready for applications within a few weeks.", "At the time that state Sen. Rowden made his statement on Sept. 4, the portal was not online. By Sept. 9, the portal had been made available.", "In an email, Thompson said the commission had spent $2.1 million on requests from the Boone County Department of Health, and to Columbia Public Schools as a proxy to the other five school districts in Boone County.", "What did Thompson mean by spent? \"If by ‘spent,’ you mean out the door/in another entity’s hands, that is what was ‘spent’ as of September 6, 2020,\" Thompson wrote.", "But was it? Not according to the Boone County Department of Health and county records.", "On Aug. 11, The Columbia/Boone County Department of Health and Human Services was approved to receive $1.8 million to hire 40 full-time employees through December. These employees included disease investigators, contact tracers, health educators, data analysts, and communicable disease specialists. The money was also to pay for additional COVID-19 testing, especially for uninsured and under-insured individuals.", "Health Department Assistant Director Scott Clardy said in a Sept. 11 interview that money had not yet been received from the county, as the Health Department had to submit an invoice to the county and later get reimbursed.", "Meanwhile, all six Boone County school districts requested $322,800 for 1,345 Wi-Fi hotspots. The county commission approved the request on Aug. 20. The $322,800 was to be pre-paid by CPS and reimbursed by the county.", "According to district spokesperson Michelle Baumstark, the Board of Education approved the purchase agreement for the hotspots, using CARES funding, on Sept. 14.", "The CARES Act money is designated to be sent out as reimbursements, upon \"provision…. of adequate documentation showing appropriately incurred expenses,\" according to the county orders that approved the money to both Columbia Public Schools and the Department of Health.", "Thompson said there were \"at least three requests in the works\" that, if fully funded, would exceed $11 million. But, that’s anticipated money — not money spent, which was the basis of Rowden’s complaint.", "Caleb Rowden said: \"Over three months after receiving CARES Act relief funds from the state, the county has still not made those dollars available to help struggling Mid-Missourians.\"", "Evidence from the Boone County Department of Health and county records back that up.", "We found that $2.1 million had been approved for two organizations that requested CARES Act funds. But that money had not been sent by the Boone County Commission at the time of Rowden’s post. Although it was promised, the money had not hit the bank accounts of either organization.", "We rate this claim True.", "Medium, Caleb Rowden Calls on Boone County to Expedite CARES Funds Distribution, accessed Sept. 7, 2020", "Columbia Missourian, Rowden says county leaders must distribute COVID-19 relief funds immediately, Sept. 4, 2020", "Columbia Missourian, Boone County launches application portal for COVID-related grants, Sept. 8, 2020", "Missouri Governor’s Office, Governor Parson Announces Distribution of Federal CARES Act Funds to Local Governments, May 4, 2020", "Email interview, Boone County Commissioner Janet Thompson, accessed Sept. 8, 2020", "Email correspondence from Missouri State Senator Caleb Rowden, accessed Sept. 8, 2020", "Columbia Missourian, County to buy software to handle CARES applications | COVID-19, July 16, 2020", "Columbia Missourian, Boone County commissioner announces CARES Act funding portal, bicentennial celebration, August 28, 2020", "Records request, Boone County Counselor CJ Dykhouse, Sept. 9, 2020", "County Commission Order 352-2020, authorizing the transfer of funds to the Columbia/Boone County Department of Health and Human Services, dated Aug. 11, 2020", "County Commission Order 371-2020, authorizing the transfer of funds to Columbia Public Schools, dated Aug. 20, 2020", "House Bill 2014 – The bill that was passed by the Missouri legislature and signed by Gov. Parson", "Columbia Missourian, Local governments to receive CARES money Wednesday,  May 4, 2020", "Interview, Boone County Treasurer Tom Darrough, Sept. 10, 2020", "Email, Michelle Baumstark, spokesperson for Columbia Public Schools", "Interview, Scott Clardy, assistant Director for the Columbia/Boone County Department of Health. Interview conducted by Cianna Morales, reporter with the Columbia Missourian on Sept. 11, 2020", "Columbia Public Schools Board of Education, Agenda for September 14, 2020 meeting, Sept. 14, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]