["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Power lines in Sacramento County, Calif. Andrew Nixon / CapRadio", "President Donald Trump claimed “In California, Democrats have intentionally implemented rolling blackouts.”", "The state is in the middle of a prolonged heat wave. Blackouts took place on Friday and Saturday.", "Officials at the state’s power grid operator rejected Trump’s claim that politics was at play.", "They said their call for rolling blackouts was made to ensure the state’s power grid did not collapse.", "They added the decision was made by the power grid’s shift manager, not by a political body.", "President Trump claimed in a tweet on Tuesday, without evidence, that \"In California, Democrats have intentionally implemented rolling blackouts.\"", "The state and much of the Western United States is in the middle of a searing heat wave. California’s grid operator called for utilities to initiate temporary blackouts on Friday and Saturday as the high demand for electricity outstripped supply. Additional blackouts are possible.", "We set out to fact check the president’s questionable claim that politics was at play in deciding to call for the blackouts.", "California Power Grid Operator Rejects Trump’s Claim", "The state’s power grid is managed by the California Independent System Operator, or CAISO. It is a nonprofit public benefit corporation. Democratic Gov. Gavin Newsom nominates members to the organization’s board of governors.", "But the decision to call for blackouts was made by a shift manager at CAISO’s control room, not by the board or the organization’s CEO, officials said on Tuesday.", "\"There wasn’t any party affiliation or other kind of input into the decisions to shed load on Friday and Saturday night,\" Steve Berberich, the system operator’s CEO, told the media, as reported by the San Francisco Chronicle.", "On Saturday evening, PG&E, which provides power to much of Northern and Central California, said 220,000 customers lost electricity. Outages were mostly in portions of the Central Coast and Central Valley, including Monterey, Santa Cruz and San Joaquin counties. Approximately the same number of customers lost power on Friday evening.", "Severin Borenstein, who sits on CAISO’s board of governors, said calling for rolling blackouts is a last resort measure to avoid having \"the entire grid go down.\" Politics, he said, had nothing to do with it.", "\"I don't understand what the political motivation would be to have rolling blackouts,\" Borenstein told PolitiFact California. \"If anything it seems that this just gives Trump an opening to rail against renewable energy.  But in any case, there is no political link to the decision to implement rolling blackouts.\"", "In his tweet on Tuesday, Trump not only charged Democrats in California for implementing the blackouts, he also alleged that \"Democrats are unable to keep up with energy demand … Meanwhile, I gave America energy independence in fact, so much energy we could never use it all. The Bernie/Biden/AOC Green New Deal plan would take California’s failed policies to every American!\"", "Why Was The Decision Made To Call For Blackouts In California?", "On Monday, CAISO officials blamed a combination of factors for the rolling blackouts: Several days of triple digit temperatures across California and much of the West, lower output from renewable energy sources and a gas-powered plant going offline unexpectedly.", "Borenstein, who directs the Energy Institute at UC Berkeley’s Haas School of Business, said CAISO warned the state’s utility regulator in January that greater energy capacity was needed.", "California added large amounts of renewable energy through solar and wind in recent decades. But those options, particularly solar, haven’t been enough to meet demand at night during this heat wave, Borenstein explained.", "That’s because solar energy shuts off at night when many Californians are continuing to run air conditioning.", "\"We have not built enough capacity,\" Borenstein said, adding that solar storage options are needed.", "In a letter sent Monday to three independent agencies that oversee the state’s electrical grid and utility companies, Newsom said residents and officials did not receive proper warning of impending blackouts.", "The governor called the sudden shut-offs — the first rolling blackouts since 2001, which, in part, led to the recall of then-Gov. Gray Davis — \"unacceptable and unbefitting of the nation’s largest and most innovative state.\"", "At a press briefing later that day, Newsom took responsibility for the hasty blackouts, but made no suggestion that politics was at play in triggering them.", "\"We failed to predict and plan, and that’s simply unacceptable,\" he said. \"I am the governor. I am ultimately accountable and will ultimately take responsibility to … ensure this simply never happens again in the state of California.\"", "Officials on Tuesday urged Californians to continue to conserve electricity to avoid additional rolling blackouts.", "Our rating", "President Trump claimed \"In California, Democrats have intentionally implemented rolling blackouts.\"", "The state is in the middle of a prolonged and scorching heat wave. Its power grid operator, California Independent System Operator, called for private utilities to initiate temporary blackouts on Friday and Saturday when electricity demand outpaced supply.", "Officials at CAISO said the motivation for the blackouts was to ensure California’s power grid didn’t collapse, and that politics was not a factor.", "Officials said neither the CEO nor board members, who are appointed by Democratic Gov. Gavin Newsom, called for the blackouts. Instead, the decision was made by a power grid shift manager.", "In the end, Trump offered no evidence to back up his provocative and questionable claim.", "We rated it False.", "FALSE – The statement is not accurate.", "President Trump, tweet, Aug. 18, 2020", "Severin Borenstein, board member, California Independent System Operator, video interview Aug. 18, 2020", "San Francisco Chronicle, Trump falsely accuses California Democrats of implementing rolling blackouts, Aug. 18, 2020", "Los Angeles Times, California blackouts are Public Utilities Commission’s fault, grid operator says, Aug. 17, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]