["A video clip showing an elderly man in a Gandhi cap, performing dandiya– the Gujarati folk dance, has gone viral on social media with the claim that the gentleman is former Prime Minister Morarji Desai. The accompanying message reads, “MR. Morarji Desai..former Prime Minister of India played garba at Bhadeli-Valsad in year 1962.”", "Ex. Prime Minister of India played garba at Bhadeli valsad in year 1962 MR. Morarji Desai", "Posted by Kirti Jobanputra on Monday, October 22, 2018", "The above post is of October 2018, and has been shared over 8400 times so far. The 3:05 minute video clip was circulated at around this time last year, coinciding with Navratri, as is the case now. Several individual users have posted the video on Facebook with identical text.", "The video has also been shared on Twitter and YouTube.", "Morarji Desai playing dandiya! Love the energy! #Navratri2019 #dandiyanight pic.twitter.com/JPugXI4QpJ", "— Vibhinna Ideas (@Vibhinnaideas) October 3, 2019", "The same has been circulating with Gujarati text as well. The text reads, “સ્વ.વડાપ્રધાન મોરારજી દેસાઈ પોતાના વતનમાં નવરાત્રીના ગરબામાં રાસ રમતાં નજરે પડે છે” (“Former PM Morarji Desai playing garba at his native place”). A Facebook post with this text was viewed over 63000 times and shared over 1200 times, before it was deleted.", "In October 2018, Zee 24 Kalak had posted a link to this video on Twitter with the same narrative.", "Viral video of Morarji desai that playing garba in 1962 in Valsad | Zee24Kalak: https://t.co/yoBGxOoz3o via @YouTube", "— Zee 24 Kalak (@Zee24Kalak) October 21, 2018", "The claim is false. Alt News searched Google with the key words ‘Morarji Desai dandiya’, and found a report by the Gujarati daily Divya Bhaskar. The report is of October 2018, and states that the person in the video is NOT former PM Morarji Desai.", "The report is titled, ‘Viral video: Garba player not Morarji Desai but Kunwarji Narsinh Lodaya‘ (translated). It states, “This video was viral a few days back. It is said that India’s first Gujarati PM Morarji Desai is playing garba. The truth is something else. The person wearing the cap and playing garba is not Morarji Desai but Kunwarji Narsinh Lodaya who is playing garba with his brother Mulji Narsinh Lodaya. Kunwarji Lodaya is no more. This video is said to have been taken at a wedding ceremony in Mumbai in 1994.” (translated).", "The portal DeshGujarat also states that the person wearing the cap and performing the garba is indeed Kunwarji Lodaya, and that the video was taken at a personal wedding ceremony in Mumbai in 1994. DeshGujarat had contacted the late PM’s family to confirm that the person in the video is not Morarji Desai. The report states, “DeshGujarat contacted Morarji Desai’s great grandson Madhukeshwar Desai, who after watching this video confirmed this is not Morarji Desai. Apart from other things, he observed that Morarjibhai would always wear Chudidar. And it’s not just about dress. Height, body structure, complexion everything is different than how Morarji Desai looked.”", "In conclusion, a video showing a dandiya performance by an elderly gentleman wearing a Gandhi cap has been falsely shared as footage of former PM Morarji Desai doing garba.", "Donate Now", "Arjun Sidharth is a writer with Alt News. He has previously worked in the television news industry, where he managed news bulletins and breaking news scenarios, apart from scripting numerous prime time television stories. He has also been actively involved with various freelance projects. Sidharth has studied economics, political science, international relations and journalism. He has a keen interest in books, movies, music, sports, politics, foreign policy, history and economics. His hobbies include reading, watching movies and indoor gaming.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]