["By Robert Farley", "Posted on February 19, 2018", "Contrary to spin from White House Principal Deputy Press Secretary Raj Shah, the indictments handed down last week against 13 Russians for meddling in U.S. elections show they clearly supported one candidate over another in the 2016 presidential general election. And that candidate was Donald Trump.", "Shah muddied that point in an interview with Fox News when he claimed the indictment shows the Russian efforts “were about sowing confusion in the electoral process and undermining the next president, not about supporting one candidate over the other.”", "Shah, Feb. 16:  There’s three main points that we see from these indictments. One, as you mentioned, they started — this plot started in 2014 before the president jumped in the race. And what we also saw is that they proved that there’s no collusion. The biggest point that the president has been making since before this investigation even began. And the last point that this investigation – or rather, these indictments make clear, is that all these efforts were about sowing confusion in the electoral process and undermining the next president, not about supporting one candidate over the other. And so, really, when you see these efforts by Democrats, they’re pushing this collusion conspiracy, what they are doing is doing the dirty work for the Russians, for them. The media and the Democrats, making false claims, are really pushing what the Russians want them to push.", "As we have written, the indictment did not clear Trump or his campaign of colluding with the Russians. It said that no American was a knowing participant in the illegal activity outlined in the indictment, but the investigation is continuing into other activities allegedly carried out by the Russians.", "Shah is partially correct that the indictment says the Russian efforts “were about sowing confusion in the electoral process.” As the indictment put it, the Russian co-defendants “had a strategic goal to sow discord in the U.S. political system.” But Shah goes too far in saying the Russians efforts were “not about supporting one candidate over the other.”", "According to the indictment, the Russian organization’s efforts to interfere in the American political process began in 2014. The group employed hundreds of people and spent millions of dollars from its hub in St. Petersburg, Russia to conduct what the group called “information warfare against the United States of America” by exploiting “divisive U.S. political and social issues.” The defendants used stolen identities and fake personas to pose as legitimate U.S. activists and set up social media accounts to engage in illegal political activity.", "In May 2014, the Russian group had the stated goal of “spread[ing] distrust towards the candidates and the political system in general.” (The emphasis is ours.)", "In a tweet on Feb. 17, Trump accused the “Fake News Media” of ignoring that the origin of the group dated back to 2014, which Trump sarcastically noted  was before he had even decided to run for president.", "Funny how the Fake News Media doesn’t want to say that the Russian group was formed in 2014, long before my run for President. Maybe they knew I was going to run even though I didn’t know!", "— Donald J. Trump (@realDonaldTrump) February 17, 2018", "That’s not accurate. News outlets such CNN, Washington Post and the New York Times all noted that the group was formed in 2014.", "By 2016, the indictment states, the Russian group had turned its full attention to the presidential candidates. “They engaged in operations primarily intended to communicate derogatory information about Hillary Clinton, to denigrate other candidates such as Ted Cruz and Marco Rubio, and to support Bernie Sanders and then-candidate Donald Trump,” the indictment states on page 17. The indictment says that on Feb. 10, 2016, the Internet Research Agency, a Russian online propaganda operation, circulated among its employees “an outline of themes for future content to be posted to organization-controlled social media accounts.” Those responsible for posting content to social media accounts were told to “use any opportunity to criticize Hillary and the rest (except Sanders and Trump – we support them).”", "On NBC’s “Meet the Press” on Feb. 18, Sanders — who lost to Clinton in the Democratic presidential primary — said the Russians efforts on his behalf were intended to hurt Clinton.", "Sanders, Feb. 18: At the end of my campaign when it appeared that Clinton was going to win, and certainly after she won the nomination, what the Russians were doing was flocking to Bernie Sanders Facebook sites, and they were saying to Bernie Sanders supporters, as they were by the way to Black Lives Matter supporters, people who were fighting for social justice. As they were saying to the Muslim community, if you voted for Sanders, you have to understand Hillary Clinton is crazy, she’s a murderer, she is terrible, all kinds of horrible, horrible things, about Hillary Clinton.", "By the general election, the group’s efforts were clear and focused: to support Trump and oppose Clinton. According to the indictment, “by early to mid-2016, Defendants’ operations included supporting the presidential campaign of then-candidate Donald J. Trump (“Trump Campaign”) and disparaging Hillary Clinton.”", "A sampling of election-related hashtags produced by the group illustrates its rooting interest: #Trump2016, #TrumpTrain, #MAGA, #IWontProtectHillary, and #Hillary4Prison. The group also created social media accounts that included “March for Trump” on Twitter and “Clinton FRAUDation” and “Trumpsters United” on Facebook.", "According to the indictment, the Russian defendants “used false U.S. personas to communicate with unwitting members, volunteers, and supporters of the Trump Campaign involved in local community outreach, as well as grassroots groups that supported then-candidate Trump.”", "In the latter half of 2016, well into the general election season, the Russians “began to encourage U.S. minority groups not to vote in the 2016 U.S. presidential election or to vote for a third-party U.S. presidential candidate.” For example, just a few days before the election, the group purchased an Instagram ad that read, in part, “Choose peace and vote for [Green Party candidate] Jill Stein. Trust me, it’s not a wasted vote.”", "A sampling of political ads purchased by the group between April 6, 2016 and Oct. 19 of 2016 also shows one-sided support for Trump/opposition to Clinton. Among them: “I say no to Hillary Clinton / I say no to manipulation”; “Donald wants to defeat terrorism . . . Hillary wants to sponsor it”; “We cannot trust Hillary to take care of our veterans!”; and “Among all the candidates Donald Trump is the one and only who can defend the police from terrorists.” (See examples on page 20 of the indictment.)", "During the general election, the indictment alleges, the Russian group also organized rallies in support of Trump and against Clinton.", "After the election, the Russian group went back to sowing discord on both sides of the political aisle.", "“After the election, the defendants allegedly staged rallies to support the president-elect, while simultaneously staging rallies to protest his election,” Deputy Attorney General Rod Rosenstein said in a Feb. 16 press conference announcing the indictment. “For example, the defendants organized one rally to support the president-elect and another rally to oppose him, both in New York, on the same day.”", "Held on Nov. 12, 2016, the pro-Trump rally organized by the Russians was designed to “show your support for President-Elect Donald Trump,” while the anti-Trump rally was to show “Trump is NOT my President,” the indictment states. The group organized another rally entitled “Charlotte Against Trump” in Charlotte, North Carolina, on Nov. 19.", "In other words, the Russians’ efforts after the election were aimed, in part, at undermining the next president. Similarly, prior to the 2016 election, the indictment says the Russian organization’s aim was to “spread distrust towards the candidates and the political system in general.”", "But during the 2016 campaign itself, the indictment says the pattern was clear: an organized effort to oppose Clinton and to support Trump.", "FactCheck.org Rating:", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]