["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A Biden campaign sign in front of a suburban home in Dublin, Ohio, on Sept. 18, 2020. (AP)", "• Studies show that suburbs today are, on the broadest level, significantly more integrated than they were in previous decades, thanks to both legal changes and shifts in public attitudes.", "• At the same time, more than two-thirds of Americans, and three-quarters of whites, do not live in substantially integrated neighborhoods.", "Ever since the racial justice protests this summer, President Donald Trump has painted a near-apocalyptic picture of the threat facing the nation’s suburbs, suggesting that their once-peaceful existence is now under violent siege.", "\"The ‘suburban housewife’ will be voting for me,\" Trump tweeted in August, explaining that \"they want safety.\"", "The “suburban housewife” will be voting for me. They want safety & are thrilled that I ended the long running program where low income housing would invade their neighborhood. Biden would reinstall it, in a bigger form, with Corey Booker in charge! @foxandfriends @MariaBartiromo", "This theme cropped up again during the first debate between Trump and Democratic presidential nominee Joe Biden.", "Trump charged that if Biden \"ever got to run this country … our suburbs would be gone. And you would see problems like you’ve never seen before.\"", "Biden fired back, saying, \"I was raised in the suburbs. This is not 1950. All these dog whistles and racism don’t work anymore. Suburbs are by and large integrated. There’s many people today driving their kids to soccer practice … Black and white and Hispanic in the same car as there have been any time in the past.\"", "Studies suggest that there’s a lot of truth to the notion that today’s suburbs \"are by and large integrated\" compared with how they were in previous decades. Still, experts told PolitiFact that this is a topic that defies easy characterizations. Biden’s assertion leaves out some significant nuances.", "\"Biden is right in the broadest sense that ‘the suburbs’ collectively are much more diverse than in 1950,\" said Jenny Schuetz, a fellow at the Metropolitan Policy Program at the Brookings Institution. However, she added, \"individual suburban jurisdictions are still relatively segregated, and there's a ton of variation across metro areas that's hard to summarize neatly.\"", "In the 1950s, the suburbs collectively were mostly non-Hispanic white, with a big gap in the racial makeup between suburbs and central cities, Schuetz said. That changed both for legal reasons, such as the end of restrictive covenants that barred minority homebuyers, as well as changing social attitudes.", "A 2017 analysis by Harvard University’s Joint Center for Housing Studies used two metrics to gauge how integrated American neighborhoods have become.", "The first approach defined integrated neighborhoods as ones in which no racial or ethnic group accounted for 50% of the population. The number of these \"no-majority neighborhoods\" rose by 54% between 2000 and 2011-15, and the share of the U.S. population residing within these neighborhoods increased from 8% to 12%.", "The second measurement considers a neighborhood integrated if it meets both of the following benchmarks: if any community of color accounts for at least 20% of the population, and if the population is at least 20% white. (Unlike the first method, this one would count a neighborhood that is, say, 51% white and 49% black as integrated.)", "The number of these \"shared neighborhoods\" increased by 25% between 2000 and 2011-15, and the share of the U.S. population residing in these neighborhoods rose from 23.9% to 30.3% over that period.", "These numbers account for cities, not just suburbs, and some of this growing integration is occurring in big cities, partly due to gentrification.", "Still, experts say, a lot is happening in the suburbs.", "\"Most immigrants who arrive in the U.S. today, most of whom are either Latinx or Asian, settle in metropolitan-area suburbs rather than the city proper, making for a more diverse mix in those areas,\" said Meghan Ashlin Rich, a sociologist at the University of Scranton.", "Erica Frankenberg, a professor of education and demography at Penn State, cited research that suburban schools \"serve incredibly diverse students by race and class, which is much different than it was in the 1950s or even the 1990s.\"", "\"The suburbs do a good job of providing services and low taxes,\" said Myron Orfield, director of the University of Minnesota’s Institute on Metropolitan Opportunity. A big share of students of color who go on to attend college come from suburban schools, he said.", "Diverse suburbs \"are pretty happy places,\" Orfield said. \"They are the places where white and non-white people tend to get along the best.\"", "Yet while the suburbs broadly are much more ethnically and racially diverse than they were decades ago, the data points to a few important asterisks.", "One is that whites remain less likely to live in integrated neighborhoods than minorities are.", "The Harvard study found that while 30.3% of the U.S. population lives in a \"no-majority\" tract, only 22.9% of white Americans do. That’s well below the percentages for minority groups: 43% for Blacks, 42.8% for non-white Hispanics and 44.8% for Asian Americans.", "Another issue is that the minorities who move to the suburbs tend to be those who are better-off financially. This has left cities with predominantly minority neighborhoods that are disproportionately lower-income (and that are more at risk of having residents displaced by gentrifying whites).", "And a third issue is that whites can leave increasingly diverse suburbs, Orfield said. \"Suburbs don’t necessarily stay integrated,\" because some whites are choosing to move to further-out exurbs that are less diverse, he said.", "Biden said that the suburbs \"are by and large integrated.\"", "Studies show that suburbs today are, on the broadest level, significantly more integrated today than they were in previous decades. However, more than two-thirds of Americans, and three-quarters of whites, still do not live in substantially integrated neighborhoods.", "Biden’s statement goes somewhat further than the data indicates, so we rate it Half True.", "Joe Biden, remarks during the first presidential debate, Sept. 29, 2020", "Donald Trump, tweet, Aug. 12, 2020", "Jonathan Spader and Shannon Rieger, \"Are Integrated Neighborhoods Becoming More Common in the United States?\" Sept. 19, 2017", "Jenny Schuetz, \"Metro areas are still racially segregated. But it’s more complicated than 'chocolate city, vanilla suburbs,'\" Dec. 8, 2017", "Jennifer B. Ayscue, Jongyeon Ee, Erica Frankenberg, and Gary Orfield, \"Harming our Common Future: America's Segregated Schools 65 Years after Brown,\" May 10, 2019", "Myron Orfield and Thomas Luce, \"America's Racially Diverse Suburbs: Opportunities and Challenges,\" 2012", "Email interview with Erica Frankenberg, professor of education and demography at Penn State, Sept. 30, 2020", "Email interview with Meghan Ashlin Rich, sociologist at the University of Scranton, Sept. 30, 2020", "Email interview with Jenny Schuetz, fellow at the Metropolitan Policy Program at the Brookings Institution, Sept. 30, 2020", "Interview with Myron Orfield, director of the University of Minnesota’s Institute on Metropolitan Opportunity, Sept. 30, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]