["About this rating", "A picture showed a man bowing to a gold-colored Trump statue at CPAC in late February 2021.", "However, a different photograph that showed evangelical leaders (not just one man) praying over a gold-colored Trump statue had been Photoshopped.", "On Feb. 28, 2021, former U.S. President Donald Trump spoke at the Conservative Political Action Conference (CPAC). We previously reported it was true that a gold-colored statue of Trump was displayed at the same convention. In the aftermath of the event, pictures of people praying to and bowing before the Trump statue were virally shared on social media.", "This photograph purported to show evangelical leaders praying over the statue:", "However, this picture was doctored. The statue covered up a real person they were praying over: Trump.", "The majority of the doctored photograph came from an Associated Press photograph. The caption read: \"Pastor Paula White-Cain and US President Donald J. Trump remark at the 'Evangelicals for Trump' coalition launch Miami at The King Jesus International Ministry on January 3, 2020, in Miami, Florida (Credit: MPI04 / MediaPunch /IPX).\"", "The Jan. 3, 2020, prayer was led by televangelist and White House spiritual adviser Paula White. She later came under fire after remarks she made about \"satanic pregnancies\" and miscarriages. Her words were: \"We command all satanic pregnancies to miscarry right now.\"", "The New York Times reported White claimed she had been \"taken out of context by critics\":", "Paula White, a Florida televangelist and religious adviser to President Trump, defended herself Sunday after a video circulated online of her calling for the miscarriage of “satanic pregnancies,” language that she said was taken out of context by critics.", "The clip, which is about a minute and 30 seconds long, was brought to light on Twitter on Friday by Right Wing Watch, which scrutinizes the speech of many conservative activists and politicians.", "The video shows part of a nearly three-hour-long service at the City of Destiny church in Apopka, Fla., on Jan. 5. In it, Ms. White can be seen talking about fighting witchcraft and demonic manipulation.", "We also previously published a fact check on the matter. It's true that she spoke the words. However, she may have meant them figuratively.", "Readers also inquired about another picture from CPAC that showed a man bowing before the Trump statue:", "The picture of the man in the red shirt bowing to the statue appeared to be a genuine photograph. A video of a man with similar features kneeling before the statue was also broadcast on MSNBC.", "\"Weekends With Alex Witt\" | Feb. 27, 2021 (MSNBC)", "In sum, a picture of evangelical leaders praying on a golden Trump statue was doctored. However, another photograph that showed a man bowing with his hands raised over the statue appeared to be real.", "March 1, 2021: This story's claim was updated to reflect the fact that two pictures were analyzed, not just one.", "Jordan Liles is a Senior Reporter who has been with Snopes since 2016.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]