["About this rating", "On 18 November 2015, the entertainment web site Real News Right Now published a fake news article claiming that a Saudi billionaire had purchased Buford, Wyoming and was planning on building \"the Mecca of the west\":", "When Sheikh Mohammed Kamel Alsaud purchased the small town of Buford, Wyoming from a Vietnamese entrepreneur last year for $1.8 million, his lifelong dream of bringing Islam to America was one step closer to becoming a reality.", "“I have fond memories of spending summers on the Mediterranean aboard my father’s yacht. On occasion we’d visit the Gulf [of Mexico] to entertain his American clients,” Alsaud told Forbes magazine. “Even as a child, I was always struck by the distinct lack of mosques in the U.S., but they say what America lacks in mosques, it makes up tenfold in prisons.”", "The above-quoted story didn't gain much traction when it was first published, but on 25 January 2016, web sites such as Liveleak and TapWires republished the dubious article with the addition of unrelated photos, managing to convince Twitter users that the plans to build a \"Mecca of the West\" were real. A video purportedly showing the construction site was also published to YouTube.", "These claims, however, are completely fabricated. The story about the Saudi billionaire purchasing Buford, Wyoming originated on a fake news web site. While Real News Right Now does not specifically label itself as a satire publication, its \"About\" section is full of lies and exaggerations about its (likely completely fictional) fictional founder, R. Hobbus J.D.", "The clearest nod to the site's humorous intent is the claim that Hobbus was awarded the \"prestigious Stephen Glass Distinction in Journalistic Integrity,\" a non-existent award named after a journalist best known for completely making up news stories.", "However, the reality does mirror the fake story to a certain degree. While Buford, Wyoming (population: 1) will not be turned into the \"Mecca of the West,\" the town actually was purchased by Pham Dinh Nguyen in 2013 for $900,000, and then renamed PhinDeli Town Buford.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]