["On 21st March, in a brutally violent incident in West Bengal’s Birbhum district, eight houses were attacked and set on fire, killing eight people, including women and children. This was in response to the murder of Bhadu Sheikh, a local panchayat representative. Videos and photos of the charred bodies of the victims were widely shared on social media after which the Kolkata High Court took suo moto cognizance of the violence and ordered a CBI probe into the matter.", "In the backdrop of this, a video has emerged on social media where a group of men can be seen vandalising cars that are parked on an empty road. It is claimed that this video is from Kolkata and the people seen in the videos are Muslims.", "This video has been widely shared on Twitter.", "This slideshow requires JavaScript.", "Alt News has also received multiple requests on its WhatsApp helpline number to verify the authenticity of this video.", "This slideshow requires JavaScript.", "Previously viral as video from Sweden", "This video was shared in 2020 by Twitter user @cbpunjabi, claiming it to be from Sweden. The clip had drawn 2,700 retweets and close to 50,000 views at that time. The video also carried an emoji of a pig as a derogatory expression used for the Muslim community.", "ये स्वीडन ही है, कोई फ़िल्म नहीं! pic.twitter.com/UH3oJVnlyV", "— सी बी पंजाबी (@cbpunjabi) September 1, 2020", "The end of August witnessed violent protests in Sweden after a copy of the Quran, the holy book of Islam, was burned in Malmo by members of the far-right Danish party Stram Kurs (Hard Line). Party leader Rasmus Paludan was earlier denied permission to attend a Quran-burning rally where he would hold a meeting on “Islamization in the Nordic countries”. Paludan is a hardliner who has also been convicted of promoting racism on YouTube, including videos where he wrapped the Quran in bacon and burned the holy book of Islam.", "In the backdrop of anti-Islam protests in Sweden, the viral video was shared to portray members of the Muslim community vandalising cars passing on the road.", "This video was debunked by Alt News four years ago when it was shared with the false claim of rioting by Muslims during Ramzan in Birmingham, UK. We had found that the incident in question occurred not in the U.K but in Basel, Switzerland. Also, it has nothing to do with Islam or Muslims.", "The vandalism on display was in relation to a football match between Basel and Lucerne football clubs and the violence took place on May 19, 2018, at Birsstrasse, Basel. According to reports, about 90 persons were involved in rioting and the police had arrested two people. Two others were injured in the clashes that took place. The incident was reported extensively by the media in Switzerland.", "The same video was also shared with false claims of hooliganism in Brazil.", "Thus, a four-year-old video was revived with the false claim of vandalism by Muslims in Kolkata. The clip actually shows violence by football enthusiasts in Switzerland.", "Donate Now", "A purported video of a Muslim man beating a temple priest with a bat is…", "A picture depicting the Pakistani flag apparently bigger in size and apparently placed higher than…", "Amid the ongoing war between Israel and Hamas, a video of a fleet of cars…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "A clip featuring Pakistan men’s Cricket team captain Babar Azam is viral on social media…"]