["By Angelo Fichera", "Posted on September 14, 2020", "A viral Facebook post wrongly suggests that if Joe Biden were to become president and later step down, Nancy Pelosi would become vice president. The Constitution says the vice president would become president and nominate a replacement; Congress must confirm or deny that pick.", "The 25th Amendment to the U.S. Constitution lays out the political ascension that occurs if a president steps down or is removed from office, in which the vice president assumes the presidency.", "But a Facebook post — circulating ahead of the Sept. 17 Constitution Day, no less — is distorting the facts about what a vice presidential vacancy would mean if Democratic presidential candidate Joe Biden became president and later stepped down.", "“Biden steps down, Harris becomes president ! Makes Pelosi vice president. Think about That one,” the text post, shared by more than 8,000 users, reads.", "While it’s true that Biden’s running mate, Sen. Kamala Harris, would become president in that hypothetical scenario, it’s false to suggest that Nancy Pelosi — assuming she is still House speaker — would automatically become vice president.", "The 25th Amendment says that: “In case of the removal of the President from office or of his death or resignation, the Vice President shall become President.”", "Its next section reads: “Whenever there is a vacancy in the office of the Vice President, the President shall nominate a Vice President who shall take office upon confirmation by a majority vote of both Houses of Congress.”", "So if Biden and Harris won the 2020 election and Biden stepped down after taking office, as the post hypothesizes, Harris would become president and then nominate a new vice president. And Congress would have the final say on confirming that nominee.", "The 25th Amendment was approved by Congress in 1965 — not long after Vice President Lyndon Johnson became president following the assassination of President John F. Kennedy — and was ratified by three-quarters of the states in 1967, according to the U.S. National Archives.", "When President Richard Nixon’s vice president, Spiro Agnew, resigned in 1973, Nixon nominated House Minority Leader Gerald Ford to become vice president.", "And when Nixon resigned the following year, Ford became president and nominated Nelson Rockefeller, the former governor of New York, to become vice president.", "It is true, however, that under current law, if there is no president or vice president, the House speaker would be next in line for the presidency.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "“25th Amendment.” Legal Information Institute, Cornell Law School. Accessed 14 Sep 2020.", "Kilpatrick, Carroll. “Nixon Resigns.” Washington Post. 9 Aug 1974.", "“Nelson Aldrich Rockefeller, 41st Vice President (1974-1977).” U.S. Senate. Accessed 14 Sep 2020.", "“Presidential Succession Act.” U.S. Senate. Accessed 14 Sep 2020.", "“The 25th Amendment: Succession of the Presidency.” Pieces of History. U.S. National Archives. 10 Feb 2017.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]