["A video that shows a U.S. soldier at the Bagram Airfield in Afghanistan talking about distributing Bibles to local residents as gifts stirred a great deal of controversy when shown recently as part of a news report by the Arab network Al Jazeera.", "It rankled a number of Afghan officials in this deeply conservative Islamic community where many already view U.S. forces as Christian crusaders.", "But it also irked some evangelical Christians in the United States who thought the U.S. military's response unfairly stepped on the religious rights of a Christian soldier. Of particular concern was the fate of the Bibles.", "Gordon James Klingenschmitt of the Pray in Jesus' Name Project, a former U.S. Navy chaplain, took out an advertisement in\n\nHuman Events\n\n, a conservative publication, with the headline, \"BREAKING NEWS: Pentagon Burns Soldiers Bibles - Military Chaplains Attacked.\"", "The story begins, \"The Pentagon under the Obama administration has just acknowledged seizing and burning the privately owned Bibles of American soldiers serving in Afghanistan.\"", "Although the story contains several claims, this is the main one, and the one we are fact-checking here.", "So let's back up to the beginning.", "The video in question, shot a year ago by an independent filmmaker, shows a small group of uniformed U.S. soldiers at a prayer service on the base in Bagram. A soldier explains that his local church in the United States collected money and sent him a package of Bibles (which are seen stacked on the floor) printed in the country's main Pashto and Dari languages. The base chaplain quickly notes in the video that the U.S. military policy, U.S. Central Command's General Order No. 1, specifically prohibits active duty troops from \"proselytizing any religion, faith, or practice.\" The soldier then mentions the possibility of distributing the Bibles to locals as gifts.", "A year later, the video became the centerpiece of a controversial May 4, 2009, story on Al Jazeera that questioned whether some U.S. military had crossed the line into evangelism and proselytizing.", "The U.S. military claimed the story was misleading.", "The full edit of the video, said U.S. Defense Department spokesman Lt. Col. Mark Wright, would have shown the chaplain explaining to the soldier that passing out the Bibles to locals was forbidden.", "\"Of course that violates General Order No.1,\" Wright said.", "Trying to convert Muslims to another faith is a crime in Afghanistan.", "So there's the significant matter of the soldier's safety, Wright said. It's also what the military calls a \"force protection threat.\"", "\"There is a very real possibility it could cause a violent backlash,\" Wright explained.", "Many in Afghanistan might perceive a soldier handing out Bibles as an organized effort of the U.S. military to try to convert them to Christianity, which would deeply offend the local Muslim people, he said. \"It would be a threat to our soldiers and service members' lives. That's the most important reason why proselytizing is forbidden. It's simply too dangerous to our forces.\"", "Wright said the Bibles were confiscated and thrown away. And every day, as a matter of course, the garbage on the base is burned. So that's what became of the Bibles. Any impression that there was some sort of formal book-burning is false, he said.", "Only one copy got out of the room, he said, one given to the independent film crew.", "\"Not one of the Bibles made it off base,\" Wright said.", "Asked about the Al Jazeera report in a May 4 Pentagon briefing, Chairman of the Joint Chiefs of Staff Navy Adm. Mike Mullen said, \"It certainly is — from the United States military's perspective — not our position to ever push any specific kind of religion. Period.\"", "In his advertisement, Klingenschmitt claimed that statement appeared to \"defend the destruction of the soldiers' privately owned Bibles. ... He did not address the possibility that by seizing and burning privately owned Bibles, the Obama administration is now enforcing state atheism upon our troops.\"", "We find that last suggestion absurd. Nothing about this episode can be equated to \"enforcing\" atheism upon our troops. Soldiers are free to practice their religion of choice. And while privately owned, we think it's a stretch to suggest the Bibles were for American troops. They were written in Pashto and Dari languages. And the soldier who received them talked about giving them out in Afghanistan as gifts.", "But again, we are fact-checking the statement, \"The Pentagon under the Obama administration has just acknowledged seizing and burning the privately owned Bibles of American soldiers serving in Afghanistan.\"", "The Pentagon under the Obama administration did \"just acknowledge\" that the Bibles were confiscated. But it's important to note that the prayer meeting video was shot a year ago, and so the Bibles were confiscated and destroyed under the Bush administration. The clear implication of this advertisement is that soldiers aren't allowed to have their own Bibles, but that's not true. The incident in question involved one soldier, not soldiers. The only real issue is when a soldier intends to use his or her Bible to evangalize about Christianity to the local population, a practice that violates a military policy unrelated to who is president. While much of this sentence is technically correct, it clearly is intended to distort. We rate it Half True.", "Red Room\n\n\"Pentagon Burns Soldiers' Bibles,\"\n\nby Chaplain Gordon James Klingenschmitt", "YouTube, Al Jazeera English,\n\n\"US troops urged to share faith in Afghanistan\"\n\nMay 3, 2009", "Al Jazeera.net,\n\n\"US army 'does not promote religion'\"\n\nMay 6,2009", "Al Jazeera.net,\n\n\"'Witness for Jesus' in Afghanistan,\"\n\nMay 4, 2009", "Department of Defense,\n\n\"DoD News Briefing with Adm. Mullen from the Pentagon Briefing Room, Arlington, Va.,\"\n\nMay 4, 2009", "Reuters,\n\n\"U.S. military says Afghan bibles have been destroyed,\"\n\nby Peter Graff, May 5, 2009", "Reuters,\n\n\"U.S. denies letting troops convert Afghans,\"\n\nby Peter Graff, May 4, 2009", "American Forces Press Service, \"Officials reject allegations of proselytizing in Afghanistan,\" by Jim Garamone , May 5, 2009", "CNN.com, \"U.S. military says video does not show attempt to convert Afghans,\" by Mike Mount, May 4, 2009", "Interview with U.S. Department of Defense spokesman Lt. Col. Mark Wright, May 18, 2009", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]