["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "President Donald Trump speaks during a campaign rally in Tulsa, Okla., on June 20, 2020. (AP)", "• Deaths from the coronavirus have fallen consistently since their peak in late April, and have continued to fall in June even as the number of cases has risen.", "• Experts say deaths lag behind the number of cases. So the trend may reverse.", "With an increasing number of coronavirus cases across the country, President Donald Trump pointed to a metric that reflects more favorably on his administration’s pandemic response.", "On June 23, Trump tweeted, \"Cases up only because of our big number testing. Mortality rate way down!!!\"", "Cases up only because of our big number testing. Mortality rate way down!!! https://t.co/bKFmgOLEGZ", "His argument that tests are the only reason for rising cases is not accurate. But on the trend for mortality, Trump has a point.", "Epidemiologists told PolitiFact that due to wide variations in testing patterns, the data doesn’t offer a clear look at how likely someone is to die from the virus if they are infected with it. Gaps in testing leave too many undiagnosed cases to reliably determine a person’s likelihood of dying from the coronavirus, much less whether the likelihood of dying has risen or fallen over time.", "Instead, researchers say, the most solid metric for assessing Trump’s statement is the number of new coronavirus deaths reported per day.", "The number of daily deaths from coronavirus has been falling consistently since peaking in late April. In fact, even as infections have risen since early June, deaths have not. (The orange line in the following chart shows the seven-day rolling average of coronavirus deaths, which smooths out data variations.)", "At the peak in late April, more than 2,000 were dying from coronavirus on a typical day. In late June, it’s less than 600. That’s still a large number of deaths every day. All told, roughly 115,000 have died from COVID-19 to date.", "The White House told PolitiFact that the per-capita number of deaths in the United States is also lower than it is in several advanced industrialized countries in Europe that were hard hit by the virus. According to Johns Hopkins University, the number of coronavirus deaths per 100,000 population is about 37 for the United States, compared with 65 in the United Kingdom, 61 in Spain, and 57 in Italy.", "But other European countries have lower death rates for COVID-19 than the United States does, including the Netherlands, Ireland, Germany, Switzerland and Denmark.", "So why are deaths falling? There may be several reasons, and for now, they’re somewhat speculative.", "One possibility is that the initial wave of infections disproportionately reached more patients with weaker immune systems, including those in nursing homes, or more vulnerable Americans who hadn’t yet taken up effective social distancing. By contrast, more recent waves of infections may be reaching younger and healthier people who are better able to survive an infection.", "Another possibility is that we’re \"getting better at treatment and keeping people alive,\" said Tara Smith, an epidemiologist at Kent State University’s College of Public Health.", "Still, epidemiologists caution that deaths are a lagging indicator. The disease often takes two to three weeks to run its course, meaning that one day’s crop of new infections tends to drive the deaths that occur two to three weeks later.", "\"We might not expect an increase in the death rate until approximately 21 days from when we started to see an increase in cases,\" said Brooke Nichols, an infectious disease modeler at the Boston University School of Public Health.", "So far, the age breakdown for deaths has been fairly consistent — people older than 65 accounted for 81% of coronavirus deaths at the mortality peak in mid-April, and that age group still accounted for 82% of in mid-July, a time when the total number of deaths had fallen significantly, according to the Centers for Disease Control and Prevention.", "Since we’re about two weeks into the national rise in infections, scientists will be watching to see if deaths start increasing a week from now.", "Trump said that mortality from coronavirus is \"way down.\"", "This is one of the few coronavirus measurements that Trump can point to with optimism. The number of deaths has remained substantial, at a bit below 600 per day by mid-to-late June, but that’s more than two-thirds lower than the peak of about 2,000 daily deaths in late April. The number of coronavirus deaths per day has continued to fall in June even as the number of cases has risen.", "Trump’s statement is accurate for now, though it’s too soon to know whether the recent rise in new cases will produce an uptick in deaths by early July. We rate his statement Mostly True.", "Donald Trump, tweet, June 23, 2020", "COVID Tracking Project, data, accessed June 24, 2020", "Centers for Disease Control and Prevention, \"Weekly Updates by Select Demographic and Geographic Characteristics,\" accessed June 24, 2020", "Johns Hopkins University, \"Mortality Analyses,\" accessed June 24, 2020", "Email interview with Brooke Nichols, infectious disease modeler at the Boston University School of Public Health, June 24, 2020", "Email interview with Tara Smith, an epidemiologist at Kent State University’s College of Public Health, June 24, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]