["About this rating", "On 2 June 2019, the Christian Post reported that President Donald Trump had made an impromptu visit to the McLean Bible Church just outside Washington, D.C., before departing on a visit to the United Kingdom. There, Pastor David Platt supposedly prayed for Trump in front of his gathered flock.", "Readers questioned whether the report could be believed, perhaps because Platt has distinguished himself from other mega-church pastors who have endorsed Trump by remaining nonpartisan himself. The event did take place, though, with video of Platt's praying for Trump being posted on social media by Bloomberg:", "WATCH: Trump prays at the McLean Bible Church with Pastor David Platt in the wake of the Virginia Beach mass shooting pic.twitter.com/cpqs7efVYg", "— TicToc by Bloomberg (@tictoc) June 2, 2019", "Pastor Platt wrote a lengthy explanation for why he agreed to pray for the president in front of his congregation. In short, he said, he was caught off guard by Trump's visit and his request, and he relied on his best interpretation of Biblical text to make a split-second decision about what to do. He acknowledged that some in his congregation had been \"hurt\" by his choice:", "I wanted to share all of this with you in part because I know that some within our church, for a variety of valid reasons, are hurt that I made this decision. This weighs heavy on my heart. I love every member of this church, and I only want to lead us with God’s Word in a way that transcends political party and position, heals the hurts of racial division and injustice, and honors every man and woman made in the image of God. So while I am thankful that we had an opportunity to obey 1 Timothy 2 in a unique way today, I don’t want to purposely ever do anything that undermines the unity we have in Christ.", "The prayer did bring a backlash Platt's way. Jonathan Merritt, an author and journalist who writes about religion, took to Twitter to criticize Platt for, as he saw it, providing a cynical photo-op for an irreligious politician in a way that alienated many Christians.", "\"I’m sure David Platt was only thinking about the content of the prayer too,\" Merritt wrote. \"But in that situation, a pastor must consider the optics and how they may be being used. Did you hear the rapid fire clicks of cameras? This was a photo op for a politician who isn’t remotely religious\":", "The look on that woman’s face resembles the way many people of color feel watching white conservative Christian leaders use their platforms to prop up this president https://t.co/DUEgzGZLev", "— Jonathan Merritt (@JonathanMerritt) June 3, 2019", "According to a March 2019 analysis of survey data collected by the Pew Research Center, 69 per cent of white evangelical protestants \"say they approve of the way Trump is handling his job as president.\"", "Chiu, Allyson.   \"'My Aim Was in No Way to Endorse the President'\" Pastor Explains Why He Prayed for Trump.\"\r\n    The Washington Post.   4 June 2019.", "Nazworth, Napp.   \"David Platt Prays for President Trump After He Unexpectedly Shows Up at Church Service.\"\r\n    Christian Post.   2 June 2019.", "Schwadel, Philip, and Gregory A Smith.   \"Evangelical Approval of Trump Remains High, But Other Religious Groups Are Less Supportive.\"\r\n    Pew Research Center.   18 March 2019.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]