["The two photos were published here in a blog post on August 10, 2017.", "Below is the screenshot of the misleading post:", "The post’s Indonesian-language headline translates to English as: “Stealing Corn Because of Hunger, a Grandmother Beaten to Pulp.”", "The report's first three paragraphs translate to English as: “A sad story happens again in our beloved country Indonesia. A 68-year-old grandmother named Jumiyem had to endure pain and she has bruises on her face because she was beaten after getting caught stealing two corns in a farm near the hut where Jumiyem lived.", "“The reason Jumiyem stole two corns because she has not eaten for nearly four days and unable to find food as she was ill.", "“‘I haven’t eaten for almost four days, because I was sick, I can’t walk and can’t find food, when I get out from my hut, I see there are corns in the next farm and I take two to be cooked and eaten,’ Jumiyem said.”", "The same photo was also published in other blog posts here, here and here, with a similar claim.", "The blog posts were also shared in Facebook posts here in 2018 and here in 2017. The posts have been shared thousands of times.", "The claim is false; the photos have previously circulated in local media reports about a woman who was the victim of a robbery in Malaysia in 2015.", "A reverse image search on Google found the photos were published in this April 8, 2015, blog post. The blog post's headline states: “Elderly grandmother’s face bruised after being injured by robbers in Johor… What a jerk!!!”", "Below is a screenshot of the blog post:", "According to the blog post, the robbery took place in Bandar Baru Kangkar Pulai, in Johor, a state in southern Malaysia.", "Bandar Baru Kangkar Pulai is a housing area within the town of Kangkar Pulai in Malaysia’s Johor state. Here is its location on Google Maps.", "The incident was also reported by Malaysian news site Perak Today on April 10, 2015, here.", "The report's Malaysian-language headline translates to English as: “Two Robbers Assaulting a Grandmother Arrested”.", "The report's first three paragraphs translate to English as: “Two suspects allegedly involved in a robbery and injured a senior citizen, Zainun Baharon, 77, on Monday were successfully arrested by the police.", "“Two of them were arrested separately around Bandar Baru Kangkar Pulai area between 7:15 pm the day before yesterday and 2:30 am to yesterday help the investigation.", "“Nusajaya District Police Superintendent Noor Hashim Mohamad said the 55-year-old and 37-year-old suspects were residents of the area near the victim's home.”", "The Perak Today report also includes a photo of police officers with Zainun.", "Below is a screenshot comparison of the images in the misleading blog post (L) and the image published by Perak Today (R):", "Malaysian news site The Star also published this article on April 9, 2015, about the alleged robbery. The report’s headline states: “Woman left unconscious in kitchen as thieves take off with jewellery.”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]