["A purported incident that went down during farmers’ tractor rally in Delhi on January 26 was surprising experienced by several Twitter and Facebook users. “I have never seen such chaos by farmers in my journalistic career. They tried running a tractor over me and attacked with swords. They also behaved indecently. Tried to snatch the mic and break it. Is this farmers’ protest or something else?” – reads the exact story shared by multiple people.", "(Translated from Hindi text: आज रिपोर्टिंग करते समय इन तथाकथित किसानों का जो तांडव देखा वो अपने पत्रकारिता करियर में कभी नहीं देखा। आज इन्होंने ने मुझपर भी ट्रैक्टर चढ़ाने और तलवार से हमले की कोशिश की। अश्लील हरकतें और बदसलूकी की गयी । माईक को छीनकर तोङने कि कोशिश की। ये किसान संगठन है या कोई और संगठन ??)", "This slideshow requires JavaScript.", "Among those who shared the alleged story was @NehakiNews who identifies as a former employee of ABP News and Zee News in her bio. Similarly, @Pujapandey_ tweeted the identical text. Her bio also states that she is a journalist. Both their tweets gained close to 5,000 retweets each.", "This slideshow requires JavaScript.", "Using advanced search on Twitter, Alt News found that @NehakiNews was the first handle to tweet the story. Prior to 8:11:42 PM, no one else had shared the account. Readers should note that timestamps mentioned in this report are based on the Indian Standard Time (IST) whereas the time that appears on archived links may be based on different time zones.", "Alt News found an archived link of @NehakiNews’s from January 28 around 8 PM where the profile picture is not the same as the current one and the username is @News4India_.", "A reverse image search on the older profile picture shows the woman whose image is used is Pakistan-based journalist Qurat Ul Ain Iqrar. Iqrar had clarified on Twitter that the account is fake.", "Fake ID Alert !! This is how fake accounts being used against protesting farmers… https://t.co/OcYotr4RPf", "— qurat ul ain iqrar (@ain_iqrar) January 28, 2021", "Alt News rummaged @NehakiNews’s profile and based on replies to old tweets, found that the imposter account has previously held the following handles – @IASUrmila, @News4India_, and @Nehajoshinews. (1, 2, 3)", "This slideshow requires JavaScript.", "The next tweet that copy-pasted the viral story was Twitter user @Pujapande at 8:50:24 PM. Subsequent tweets weren’t made until 11:59 AM on January 27. The story then went viral.", "An imposter account @NehakiNews tweeted a fake story that farmers tried to run her over with a tractor. This was then picked up by multiple handles that attempted to pass off the story as their own.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "Amid the ongoing Israel-Palestine conflict, media outlet Times Now put out a report claiming that…", "A 45-second video clip is being shared widely on social media where a group of…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…"]