["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Austin mayoral candidates Clay Dafoe, Brigid Shea and Lee Leffingwell debate April 16, 2012. Jay Janner photo/Austin American-Statesman", "Two days before city staffers discussed raising Austin’s property tax levy, Mayor Lee Leffingwell touted the city’s rate in a televised debate.\n\nFacing off against mayoral opponents Brigid Shea and Clay Dafoe in an April 16, 2012, forum on KXAN-TV, Channel 36, Leffingwell said, \"The City of Austin has the lowest property tax rate by far of the five major cities in Texas, including Fort Worth, Houston, Dallas and San Antonio.\"\n\nDoes that add up?\n\nBy email, Leffingwell campaign consultant Mark Littlefield and city spokesman Reyne Telles told us that Leffingwell used data from a chart prepared by city staff for its annual five-year financial forecast. Littlefield sent us that chart plus a second one showing estimated tax bills in each city.\n\nEd Van Eenoo, Austin’s city budget officer, told us by email that his office created the charts with 2011 tax rates, home values and sales price information from county appraisal districts and the Real Estate Center at Texas A&M University.\n\nWe checked the numbers with the districts and center, and found Austin’s property tax rate was the lowest, considerably, of Texas’ five biggest cities, as Leffingwell said. The full list: Fort Worth, 85.5 cents per $100 of appraised value; Dallas, 79.7 cents; Houston, 63.875 cents; San Antonio, 56.5569 cents, Austin, 48.11 cents.\n\nBut tax rates are only part of the equation when it comes to figuring out how hard a homeowner’s pocketbook gets hit.\n\nHere, in fact, is the equation, from Austin’s budget office: Take your house’s dollar value; subtract any homestead or other exemptions; divide by 100; then multiply by the tax rate -- with the tax rate expressed in dollars; for example, 0.4811 rather than \"48.11 cents.\"\n\nWe calculated how much typical homeowners had to pay in 2011 using two different measures: average appraised values from each county tax appraisal districts, and median sales price from the center, which gets data from real estate professionals across the state.", "Although exemptions affect many tax bills, we excluded them here because they vary with each homeowner and each city, county and taxing jurisdiction.", "In 2011, Austin had both the highest median sale price and the highest average appraised value among the five cities. But because of the city’s low tax rate, Austin’s tax bill (excluding exemptions) on an average-value home was second-highest, and its tax bill on a median sales-price home came in fourth.\n\nCalculated using 2011 median sales price and 2011 city tax rate, Dallas had the highest bill -- $1,262 on a $158,400 house -- followed by Houston’s $982 on a $153,700 house, Fort Worth’s $946 bill on a $110,600 house, Austin’s $918 on a $190,900 house and San Antonio’s $856 on a $151,300 house.\n\nUsing the same tax rates and 2011’s average appraised values, Dallas was first again, with a $1,441 bill on a $180,847 house, followed by Austin’s $1,224 bill on a $254,328 house, Houston’s $1,057 on a $165,535 house, Fort Worth’s $968 on a $113,247 house and San Antonio’s $725 on a $128,151 house.", "Because averages can be skewed by a few very high or low values, taking the median value offers a way to dampen the effect of those extremes. Medians represent a \"middle\" value -- median sales price would be the dollar amount at which half a city's homes sold for more and half sold for less.\n\nThe city's tax bill chart used median sales prices, except for Austin, where the median appraised home value was available, and factored in homestead exemptions. Reckoned that way, Austin’s tax bill again came out second-highest.\n\nOf course, cities are only one of the entities taking a chomp out of your property taxes. Depending on where your house is, county government, school districts, community colleges and possibly many others get a bite.\n\nThe Austin owner of a $190,900 home in 2011, for example, paid $2,371 to the Austin school district; $927 to Travis County; $181 to Austin Community College; and $151 to Central Health (Travis County’s healthcare district) on top of the $918 city tax bill.\n\nAlso, Austinites recently learned that 2013 might bring an increase in the city’s rate. The Austin American-Statesman reported April 18 that the owner of a median-value home would pay $33 more under a tax rate of 49.95 cents per $100 of property -- the rate city staffers said Austin would need to cover its costs next year.\n\nLeffingwell responded to the news with a statement that he would look for ways to cut spending rather than raise the property tax rate.\n\nThat 49.95-cent rate for 2012 is still lower than the other cities’ 2011 rates, but it’s too early to know what all the 2012 rates -- and home values -- will be.\n\nOur ruling\n\nLeffingwell’s right on the rates. Austin had the lowest 2011 city property tax rate among Texas’ five biggest cities.\n\nYet rates alone are not the only, or even best, indicator of how much residents have been socked by property taxes. Comparing each city’s average-value home in 2011, for instance, Austin would have extracted the second-highest tax payment.\n\nWithout this context, Leffingwell’s rate comparison misrepresents this pocketbook issue. His claim rates Half True.", "Austin American-Statesman news story, \"To keep up with rising costs, Austin may raise property taxes for coming year,\" April 18, 2012\n\nAustin mayoral candidates’ debate, KXAN-TV, video, April 16, 2012\n\nEmail interviews with Mark Littlefield, media contact with Lee Leffingwell campaign, April 18-22, 2012\n\nEmail interviews with Reyne Telles, City of Austin media relations manager, April 20, 2012\n\nEmail interviews with Ed Van Eenoo, chief budget officer, City of Austin, April 25-30, 2012\n\nTelephone and email interviews with Marya Crigler, Travis County chief appraiser, April 26, 2012\n\nTelephone and email interviews with George Scott, media contact with Harris County Appraisal District, April 25-26, 2012\n\nTelephone interviews with Mary Kieke, Bexar County deputy chief appraiser, April 25, 2012\n\nTravis County Appraisal District website, jurisdiction tax rates for 2011, accessed April 30, 2012\n\nDallas County Appraisal District website, jurisdiction tax rates and average value of home in city for 2011, accessed April 30, 2012\n\nHarris County Appraisal District website, jurisdiction tax rates for 2011, accessed April 30, 2012\n\nBexar Travis County Appraisal District website, jurisdiction tax rates for 2011, accessed April 30, 2012\n\nTarrant County Appraisal District website, jurisdiction tax rates and average value of home in city for 2011, accessed April 30, 2012", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]