["About this rating", "In a primary debate in March 2020, Biden appeared to suggest he was in favor of ending fracking.", "Biden's campaign quickly clarified that he was referring to his already repeatedly stated policy on fracking, which is to end new gas and oil production on federal lands, but not ban fracking outright.", "Voting in the 2020 U.S. Election may be over, but the misinformation keeps on ticking. Never stop fact-checking. Follow our post-election coverage here.", "On the morning after the Oct. 8, 2020, vice presidential debate between Republican U.S. Vice President Mike Pence and Democratic U.S. Sen. Kamala Harris of California, Snopes readers asked us to look into one of the debate's flashpoints — the Democratic ticket's stance on hydraulic fracturing, commonly known as fracking, a controversial method of accessing fossil fuel deposits, typically natural gas.", "In particular, readers asked Snopes whether Democratic presidential candidate Joe Biden was proposing a ban on fracking. At one point in the Oct. 8 debate, which took place at the University of Utah in Salt Lake City, Pence told Harris:", "\"I know Joe Biden says otherwise now, as you do, but the both of you repeatedly committed to abolishing fossil fuel and banning of fracking.\"", "A week earlier, the reelection campaign of U.S. President Donald Trump published an ad that claimed Biden \"will end fracking\" and contained a brief clip of Biden saying \"no more — no new fracking.\"", "On Oct. 7, shortly before the vice presidential debate, Trump himself tweeted that \"Joe Biden and Kamala Harris BOTH want to BAN FRACKING.\"", "This fact check will focus on the claim that Biden's policy on fracking was to ban it, because that's the specific question raised by Snopes readers in the hours after Pence and Harris' debate. However, it's worth briefly addressing the other components of the blanket claims made by both Pence in the Oct. 8 debate and Trump in his Oct. 7 tweet, and that analysis is available later in this article.", "The official Biden-Harris clean energy policy proposes \"banning new oil and gas permitting on public lands and waters.\" It does not propose an outright ban on fracking. In recent years, federal lands have accounted for around 10% of U.S. oil and gas production, so Biden's policy would allow the vast majority of fracking to continue, especially at first, since it would only stop new leases.", "As the Washington Post has reported, Biden has repeatedly emphasized on the campaign trail that he would not ban fracking, but would instead seek to end new leases on federal lands. On one occasion, during a primary debate in March 2020, Biden caused confusion about his policy on fracking. He had the following exchange with U.S. Sen. Bernie Sanders of Vermont:", "Sanders: I'm talking about stopping fracking as soon as we possibly can. I'm talking about telling the fossil fuel industry that they are going to stop destroying this planet — no ifs, buts and maybes about it.\nBiden: So am I.\nSanders: Well I'm not sure your proposal does that ...", "Later in the debate, Sanders pointed to the absence of a complete ban on fracking from Biden's platform, saying: \"You cannot continue, as I understand Joe believes, to continue fracking. Correct me if I'm wrong.\" Biden responded: \"No more — no new fracking ...,\" the soundbite later included in the Trump campaign's October 2020 ad.", "Biden's campaign quickly clarified that when he said \"No more — no new fracking,\" Biden was referring to his already repeatedly stated policy of stopping new oil and gas exploration on federal lands, but not banning fracking outright. This crucial context also demonstrates that when Biden told Sanders \"So am I,\" he was referring to the second of Sanders' pronouncements (\"I'm talking about telling the fossil fuel industry that they are going to stop destroying this planet\") rather than the first (\"I'm talking about stopping fracking as soon as we possibly can.\")", "Notwithstanding Biden's single indication to the contrary (which was quickly corrected by his campaign), the former vice president has been consistent in stating that he proposes ending new oil and gas exploration on federal lands, but does not favor an outright ban on fracking. This core claim is therefore \"Mostly False.\"", "In October 2020, Trump shared a clip of Harris saying she was in favor of banning fracking. That clip was authentic, and although it was edited down to a few seconds, the Trump campaign did not misrepresent what Harris said:", "During a climate-themed CNN town hall on Sept. 4, 2019, climate activist Jessie Bluedorn asked then-Democratic presidential primary contestant Harris whether she would \"commit to implementing a federal ban on fracking, your first day in office.\" Harris replied: \"There's no question I'm in favor of banning fracking. So, yes.\" She did not express any ambiguity, or subsequently back-track during the debate, so it's accurate to state, as the Trump campaign has, that Harris has supported a ban on fracking.", "Snopes asked the Biden-Harris campaign whether Harris still held the view she expressed in the September 2019 town hall, but we did not receive a response in time for publication. During the primaries, her climate change platform did not mention fracking, but did propose an end to the extraction of fossil fuels from publicly owned lands.", "So it's true to say that, when asked about it, Harris has in the past articulated unambiguous support for a ban on fracking, but it must also be noted that her official policy platform during the primaries did not call for such a ban, and she has also since signed on to the Biden plan, which proposes an end to new oil and gas drilling on federal lands, but does not call for an outright ban on fracking.", "During the Oct. 8 vice presidential debate, Pence said:", "\"I know Joe Biden says otherwise now, as you do, but the both of you repeatedly committed to abolishing fossil fuel and [the] banning of fracking.\"", "The official Biden-Harris platform proposes to end fossil fuel subsidies, and to encourage a worldwide ban on fossil fuel subsidies. During a campaign event in Somersworth, New Hampshire, in February 2020, Biden told hecklers (9:45), \"We are going to get rid of fossil fuels,\" but then he added, \"We're going to phase out fossil fuels.\"", "At a town hall event in New Castle, New Hampshire, in September 2019, Biden told an audience member (25:17), \"I guarantee you we're going to end fossil fuel.\" This prompted an attack by Pence during the October 2020 debate. The vice president said: \"Joe Biden looked a supporter in the eye and pointed and said, 'I guarantee, I guarantee that we will abolish fossil fuels.'\"", "However, what Pence failed to mention was what Biden said next: \"Before 2050, God willing. No, it can't be done by 2030. No. There is not one single person that's argued it can be done by then. But it can be done by 2050, it may be 2045.\"", "During the primaries, Harris' platform called for \"replacing dirty fossil fuels with clean renewable energy,\" proposed to \"phase out all fossil fuel development on public lands\" and stated: \"We must begin intentionally and deliberately transitioning away from fossil fuels, shifting from being an exporter of fossil fuels to an exporter of clean energy technology.\"", "There's no doubt that both Biden and Harris, like many others, are proposing a broad, long-term transition away from fossil fuels to what is known as \"clean energy.\" In their platforms, both have emphasized new employment opportunities and protections for workers whose jobs and livelihoods are affected by that transition, which they say will take decades. As we've shown, Biden has explicitly stated that the phasing out of fossil fuels cannot be completed until 2045 at the earliest — a 25-year transition.", "The Trump-Pence rhetorical strategy has been to falsely present that movement as a sudden halt or overnight legal prohibition on fossil fuel production that would prove catastrophic to employment prospects in the United States. In reality, the Biden-Harris platform is much more nuanced.", "Biden, Joe.   \"The Biden Plan for a Clean Energy Revolution and Environmental Justice.\"\r\n    Accessed 9 October 2020.", "MacGregor, Katharine S.   \"Statement of Katharine S. MacGregor, Acting Assistant Secretary Land and Minerals Management.\"\r\n    U.S. Department of Interior/U.S. House Committee on Natural Resources.  29 June 2017.", "Kessler, Glenn.   \"Trump Campaign Promotes False Claim That Biden Would End Fracking.\"\r\n    The Washington Post.  7 October 2020.", "Parti, Tarini.   \"Biden Aims for Tricky Balance on Fracking.\"\r\n    The Wall Street Journal.  16 March 2020.", "Harris, Kamala.  \"A Climate Plan for the People.\"\r\n    4 September 2019.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]