["About this rating", "In December 2016, an old video resurfaced, purportedly showing an \"alien\" creature that had been caught near the shared border of the southern Indian states of Kerala and Karnataka:", "This video has been circulating since at least 2015, and has been associated with a wide range of claims. MySanAntonio.com, for instance, reported in January 2016 that social media users were sharing the video along with the claim that it showed a mythical \"chupacabra\" caught in the Philippines.", "However, there is nothing mysterious or otherworldly about the creature in the video, as it is not an alien or a chupacabra or any heretofore unknown species, but instead, an ordinary (if sick and hairless) member of the species Helarctos malayanus, also known colloquially as a sun bear.", "The saga of this particular sun bear started in January 2015, when footage of the \"strange creature\" was captured near an oil palm plantation near the Malaysian town Bintangor (not in India):", "The sun bear was eventually captured and was taken to the Matang Wildlife Centre in Kuching for rehabilitation. According to the Borneo Post, the animal died in May 2015 after suffering from cancer for some time:", "“The animal had not been eating well and vomiting. Worrying for its health, emergency medical intervention was performed under sedation. It was also fed with fluids through IV and food through a stomach tube,” ( Sarawak Forestry Corporation) said in a press statement.", "“Unfortunately, it succumbed to late-stage cancer with metastatis in the lymph nodes and adjacent organs as well as obstruction in the stomach due to primary tumour with origin in the stomach or pancreas.”", "SFC added, “A detailed examination of the bear also revealed that it was in fact a very old bear and not just a full adult as previously thought.", "“Cancer aside, the bear had probably reached the end of its natural life span.”", "Sun bears are reclusive animals (also known as \"dog bears\" or \"honey bears\") that are, despite their name, nocturnal. Their name comes from a light patch of fur on their chest that bears a similarity to the sun.", "White, Tyler.   \"Did Someone Catch the Chupacabra in the Philippines?\"\r\n    My San Antonio.   27 January 2016.", "Borneo Post.   \"Hairless Sun Bear Dies of Cancer.\"\r\n    20 May 2015.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]