["“The newly renovated airport Enugu after today's rain (sic),” reads the caption on this post by a Facebook user called Diamond Child. It has been shared more than 600 times since it was published on September 1, 2020.", "The post was shared alongside four images, including two showing people alighting from local airline Med-View and walking through a flooded path.", "It surfaced online a day after Nigeria reopened the runway of the Akanu Ibiam International Airport, Enugu, in the country’s southeastern region. The runway had been closed for more than a year ago “for major repairs and works on the airfield”, according to the airport authority.", "Work on the runway and other parts of the airport started after its closure on August 17, 2019, according to Aviation Minister Hadi Sirika.", "To God be all the glory! Despite 6 months delay due to COVID, today I had the honour of reopening the Akanu Ibiam International Airport, Enugu. The rehabilitation includes runway, taxi way, perimeter road, fence, night landing equipment, ILS, emergency center, Pilot lounge etc?? pic.twitter.com/PPIx5WR07d", "While the runway works have since been completed and the facility reopened on August 30, 2020, some other parts of the airport still remain under construction.", "The viral images also appear in other Facebook posts alongside the same claim. We’ve archived some here and here.", "But the four photos do not show the current state of the airport, which is seen in the photo below after the recent renovation.", "In fact, there is no official evidence to show that the airport was flooded since it was reopened. AFP Fact Check did not find any reports in credible news media on the purported flooding.", "Using the Advanced Twitter Search tool, AFP Fact Check found that two of the images were published on Twitter on August 20, 2015. According to a Twitter user called @ONAmaycroft, the photo shows flooding at Enugu airport in an area passengers were expected to walk through after landing.", "@Gidi_Traffic : just landed in Enugu Int'l Airport and we're expected to swim through this flood. Where's the bus? pic.twitter.com/GiWVFUl1WI", "A search through @ONAmaycroft’s tweets found another image published the following day. “I still can't believe I experienced this crap on Weds at Enugu Int'l Airport,” ONAmaycroft’s tweet reads.  “Int'l Airport my foot!”", "@Gidi_Traffic : I still can't believe I experienced this crap on Weds at Enugu Int'l Airport. Int'l Airport my foot! pic.twitter.com/BrtzWPuK7K", "With the help of social media monitoring tool CrowdTangle, AFP Fact Check traced the images to an Instagram post published by popular Nigerian journalist Dele Momodu on August 21, 2014.", "A post shared by CHIEF DR DELE MOMODU (@delemomoduovation) on Aug 21, 2014 at 10:22am PDT", "According to Momodu, the photos show the newly built international terminal of the Akanu Ibiam Airport, which is among the five new international terminal projects that were initiated in 2012. AFP Fact Check has contacted Momodu but has not received a response at the time of writing.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]