["This tweet written in traditional Chinese claims Derulo fell after he “delivered the Bible that would be used when Biden was sworn in as the 46th President of the United States.”", "The accompanying photo shows a man in a white suit falling head over heels down a flight of red-carpeted stairs, as onlookers scramble to catch him.", "Similar posts circulated widely online after Joe Biden was sworn in as US president on January 20, 2021 in a ceremony snubbed by outgoing president Donald Trump.", "“JUST IN: Jason Derulo has fallen down the United States Capitol’s steps #Inauguration,” reads a tweet by Washingtonian Problems, which regularly posts memes about US politics.", "“Is that real??” one Twitter user commented. Another Twitter user asked if the pop star was “doing summersaults”.", "“Jason Derulo just fell down at The Inauguration,” reads a tweet with more than 2,500 shares and 200,000 likes.", "The photo, however, was not taken at Biden’s inauguration and the man in the photo is not Jason Derulo.", "A reverse image search on Google found the same photo featured in this post published on entertainment blog Celebrity Gossip on May 20, 2011.", "The blog features multiple photos of the same incident. They clearly show the man in the white suit is not Jason Derulo.", "The blog post does not give the name of the man falling. It states the incident happened at the Cannes Film Festival in France. The word \"Cannes\" can be seen in the top-left corner of some of the photos featured.", "This AFP photo taken on May 22, 2011, shows the same staircase at Cannes.", "Claims that the photo shows Jason Derulo falling down the stairs have circulated online for years, regularly emerging during high-profile events.", "Social media users have previously joked that the picture showed the singer at the Met Gala in May 2019 and at the Golden Globes in January 2020.", "The trend was covered in an article by Cosmopolitan magazine, which pointed to a post by Derulo denying that it was him in the photo.", "“This joke first started in 2015 when someone on the internet randomly decided that this mystery man in a white suit looked like Jason Derulo,” it said. “When it first surfaced, Jason himself tweeted that he wasn't there and he was actually in LA at a rehearsal. ‘Lmao I'm at rehearsal in LA. Fuq ya'll! Lol,’ he said on Instagram at the time.”", "On January 20, 2021, Derulo, who posts regular updates on social media, posted about his new single Lifestyle and having water poured over his head by a magician. He did not mention the inauguration.", "Some social media users combined the image with a viral picture of US politician Bernie Sanders, who graced the ceremony wearing mittens and a winter coat.", "Bernie Sanders watches as Jason Derulo falls down the stairs at the inauguration! pic.twitter.com/CaMkvx1eCr", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]