["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "The claims keep rolling in after the historic midterm election came to a close across the United States.", "On Facebook, one in particular targets President Obama, questioning his help – or lack thereof – stumping for Democratic candidates.", "The Nov. 7 post has been shared more than 2,500 times and claims that \"every single candidate\" the former president campaigned for lost their races in the election.", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "While we found that several candidates Obama supported on the campaign trail did indeed lose, it certainly wasn’t all of them.", "Obama endorsed more than 300 Democratic candidates in federal and state races across the country, according to National Public Radio.", "Because the Facebook post specifically says \"campaigned,\" those are the races we will focus on.", "From what we could find, the former president traveled around the U.S. and campaigned for dozens of candidates.", "While some experienced losses, many also experienced wins; such as Jacky Rosen, who won a Senate seat in Nevada; Tony Evers, who won the governorship in Wisconsin and Sen. Tim Kaine, who won re-election in Virginia.", "The post cites and quotes an opinion story from the Washington Examiner. However, nowhere in that story does it say that \"all\" the candidates Obama stumped for lost.", "But it did highlight three: Andrew Gillum, Sen. Bill Nelson and Stacey Abrams.", "But even those losses are far from set in stone. We'll explain.", "In Florida, a state known for razor-thin election margins, several recounts are underway including for Gillum and Nelson.", "On election night, Gillum was trailing Republican Ron DeSantis in the race for governor by 77,377 votes when he called DeSantis to congratulate him. But the votes were still being counted. Similarly, Nelson, the Democratic incumbent, was trailing Republican Gov. Rick Scott by a small margin when Scott declared victory just after midnight. Again, the votes were still being counted.", "By Friday, Nov. 10, with unofficial election results finally in from every Florida county, the Democratic candidates in both races were behind by very small counts: DeSantis was leading Gillum by 0.41 percent, or 33,684 votes; and Scott was leading Nelson in the Senate race by 0.15 percent, or 12,562 votes.", "That’s when Florida Secretary of State Ken Detzner ordered a statewide machine recount of over 8.2 million ballots in races for three races, including U.S. Senate and governor.", "Florida law requires an automatic machine recount in any race where the margin of victory is within one half of one percentage point.", "In Georgia, it’s not quite as close, but Democratic gubernatorial candidate Stacey Abrams is not conceding. Republican challenger Brian Kemp, who had been the Georgia’s Secretary of State for eight years leading up through last week’s election, resigned his position overseeing the state’s elections on Nov. 8, two days after Election Day, when it became clear his margin of victory could be small enough as to force a runoff.", "By Monday night, unofficial returns showed that Kemp was leading by about 58,000 votes.", "But questions about the state’s handling of provisional ballots and voter registration system led a federal judge to order a delay in certifying the results until officials conduct a formal review of those issues.", "A Facebook post claims that every candidate Obama hit the campaign trail for lost in Tuesday’s election.", "That’s just plain wrong.", "Obama did rally for Democratic candidates who ended up losing, but the same goes for several others he supported who won their races.", "We rate this claim False.", "Facebook post, Nov. 8, 2018", "NPR, \"Obama Endorses More Democratic Midterm Candidates — From Congress To State Houses,\" Oct. 1, 2018", "Washington Examiner, Obama loses again,\" Nov. 7, 2018", "Tampa Bay Times, \"Gillum-DeSantis race now in recount range,\" Nov. 8, 2018", "Tampa Bay Times, \"How Bill Nelson could ultimately win the recount in Florida’s Senate race,\" Nov. 8, 2018", "New York Times, \"2018 Midterm Election Results: Live,\" Nov. 8, 2018", "USA Today, \"Barack Obama seems to denounce President Trump: 'Unlike some, I actually try to state facts,' accessed Nov. 12, 2018", "Vox, \"Democrat Jacky Rosen beats endangered Republican Sen. Dean Heller in Nevada,\" accessed Nov. 12, 2018", "WSAW 7, \"Former President Obama campaigns for Sen. Baldwin, Tony Evers in Milwaukee,\" Accessed Nov. 12, 2018", "Tampa Bay Times, \"Florida Recount Timeline: How did we get here?\" Nov. 13, 2018", "New York Times, \"Wisconsin Governor Election Results,\" accessed Nov. 12, 2018", "C-SPAN \"Former President Obama Campaign Remarks in Fairfax, Virginia,\" accessed Nov. 12, 2018", "WJLA 7 \"Virginia Senator Tim Kaine wins re-election, beating Republican Corey Stewart,\" accessed Nov. 12, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]