["About this rating", "In May 2016, syndicated talk radio host Sean Hannity aired an item claiming that Donald Trump had sent a plane to give 200 stranded U.S. marines a much-needed ride home after Operation Desert Storm in 1991:", "When Corporal Ryan Stickney and 200 of his fellow Marines prepared to return to their families after Operation Desert Storm in 1991, a logistics error forced them to turn to a surprising source for a ride home: Donald J. Trump.", "Today, Stickney would like to say \"thank you.\"", "Stickney (left), was a squad leader in a TOW company of a Marine reserve unit based in Miami, FL and spent approximately six months in Saudi Arabia during the Gulf War between 1990 and 1991.", "Upon his unit’s return to the United States, the former Marine says the group spent several weeks decompressing at Camp Lejeune in North Carolina before heading back to Miami.", "Stickney recalls being told that a mistake had been made within the logistics unit and that an aircraft wasn’t available to take the Marines home on their scheduled departure date.", "This — according to Stickney — is where Donald Trump comes in.", "\"The way the story was told to us was that Mr. Trump found out about it and sent the airline down to take care of us. And that’s all we knew ... I remember asking 'Who is Donald Trump?' I truly didn't know anything about him,\" the former Marine said.", "Corporal Stickney snapped a photo to remember the day by:", "The story came up several times during the course of the 2016 presidential campaign (Cpl. Stickney even told it in person at a Trump rally), but skeptics questioned its validity despite a statement from the Trump campaign allegedly confirming it: \"The Trump campaign has confirmed to Hannity.com that Mr. Trump did indeed send his plane to make two trips from North Carolina to Miami, Florida to transport over 200 Gulf War Marines back home. No further details were provided.\"", "The few details we do have about Trump's alleged participation don't, in fact, add up.", "We can confirm, based on military records, that the 209-member Anti-Tank (TOW) Company, part of the 8th Tank Battalion for Operation Desert Shield, deployed to Camp LeJeune, North Carolina, from their home base in Miami on 26 November 1990. And we can confirm that the company deployed from Camp LeJeune to Saudi Arabia on 22 December, served throughout the combat phase of Operation Desert Storm (from 17 January to 28 February 1991), and returned to North Carolina in April. A command chronology of the deployment notes that a \"Cpl. Stickey\" was among those receiving certificates of commendation.", "We can also confirm, via a 23 April 1991 article from the Sun-Sentinel, that a series of flight delays stalled the company's homecoming to Miami on 22 April, but that they finally did arrive home after split across two separate flights. Stickney's photograph shows that he arrived on a plane marked \"Trump,\" but it also proves something else: that even if Trump did send the plane, it wasn't his private jet.", "That Trump didn't send the pictured plane at all was something noted by a sharp-eyed reader, who wrote to us to note:", "First, that’s not Trump’s private 727 jet; it’s one of the jets in the Trump Shuttle fleet. I wondered if maybe Trump’s jet back in those days was painted differently, so I researched his private jet as of April 1991. I found that Trump was deep in the red, financially, and having to liquidate assets, one of which was his personal 727. The sale of that jet was finalized in the first week of May 1991, making it highly unlikely he was also flying reservists around while discussing the sale at the end of April.", "The markings of the plane in Stickney's photo match those of the Trump Shuttle fleet, so the question becomes: Did Trump himself send a Trump Shuttle to retrieve the stranded Marines, or was it procured some other way?", "To arrive at an answer, it's necessary to go into a bit of the history of Trump Shuttle. A July 2015 article in NYC Aviation detailed Trump's short-lived airline industry involvement, beginning with an entirely separate carrier, Eastern Air Shuttle, which he immediately rebranded with his own name:", "CEO Frank Lorenzo ... began selling off assets including the prized Shuttle operation. Donald Trump placed a winning bid for the Shuttle, its aircraft and landing slots at LaGuardia and National for $380 million dollars that was financed through no less than 22 banks. The newly branded Trump Shuttle took the skies on June 7, 1989.", "Timing is everything in business, and unfortunately for Trump he entered the airline game at the wrong time. The US entered an economic recession in the late-‘80’s leading many corporations to cut back on business travel. In addition, tensions in the Middle East leading up to the first Gulf war caused oil prices to spike. This 1-2 punch was devastating for the airline industry and led to the demise of a number of airlines including Eastern and Pan Am. Given these circumstances, the Trump Shuttle lost money, and with Trump continuing to accumulate debt in his other ventures it was becoming increasingly difficult to pay back the loans taken to purchase the airline. In September of 1990 Trump defaulted on his loan and control of the airline went back to the banks led by Citibank.", "Given that the bankers, not Donald Trump, owned Trump Shuttle from September 1990 until it was sold to U.S. Air in 1996, Trump wasn't in a position to send the planes anywhere, much less on a spur-of-the-moment Marine transport mission. So who did? As it turns out, the U.S. military itself chartered the flights -- a common practice in the day, according to an 11 August 2016 report by The Washington Post:", "Lt. Gen. Vernon J. Kondra, now retired, was in charge of all military airlift operations. He said that relying on commercial carriers freed up the military cargo aircraft for equipment transport.", "Kondra's notes on the flight are declassified and available online and show a contract for Trump Shuttle to \"move troops in [the] continental United States\" during the 1990-91 timeframe:", "There are several references to a 1990-91 contract for Trump Shuttle to carry personnel across the United States, between the East and West Coasts, on a standard LaGuardia-Dover-Charleston-Travis-Chord-Kelly-Dover-LaGuardia run.", "\"It worked very well, and the crews loved it, and really thought that we'd done something special for them,\" Kondra recalled in the oral history. \"It was a helluva lot better than using 141s [cargo craft], which we could use for something else.\"", "But Kondra said that the notion that Trump personally arranged to help the stranded soldiers made little sense. \"I certainly was not aware of that. It does not sound reasonable that it would happen like that. It would not fit in with how we did business. I don't even know of how he would have known there was a need.\"", "So the real story underlying the claim that Donald Trump personally sent his jet to pick up stranded soldiers and return them to the U.S. is that the military paid to charter a plane from an airline Trump no longer owned in order to bring those service personnel home.", "Kessler, Glenn.   \"Too Good to Check: Sean Hannity’s Tale of a Trump Rescue.\"\r\n    The Washington Post.   11 August 2016.", "Reed, Ted.   \"Trump: I Ran a Great Airline.\"\r\n    The Globe and Mail.   26 September 2011.", "Rodriguez-Florido, Lourdes.   \"Grand Homecoming Welcomes War-Weary Marine Reservists Company Looks Forward to Settling Into Life's Regular Routines.\"\r\n    Sun-Sentinel.   23 April 1991.", "CNN.   \"Inside Donald Trump's Private Jet.\"\r\n    10 November 2009.", "GulfLINK.   \"8th Tank BN Command Chronology 8th Nov 90 to March 91.\"\r\n    12 April 1991.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]