["The candidates repeated talking points from the stump and added some new twists on the facts.", "By Eugene Kiely, Robert Farley, Brooks Jackson, Lori Robertson, D'Angelo Gore, Jessica McDonald, Angelo Fichera, Saranac Hale Spencer and Rem Rieder", "Posted on October 23, 2020", "President Donald Trump and former Vice President Joe Biden faced off in the final presidential debate of the campaign. We found:", "And there were more repeated claims on the border wall, wind energy, face masks, North Korea and the Green New Deal.", "The final debate was held in Nashville, Tennessee, on Oct. 22 and was moderated by NBC News’ Kristen Welker.", "The president baselessly accused Biden of receiving “$3.5 million from Russia and it came through Putin.”", "Trump: Joe got $3.5 million from Russia and it came through Putin because he was very friendly with the former mayor of Moscow. And it was the mayor Moscow’s wife. And you got $3.5 million. Your family got $3.5 million. And, you know, some day you’re going to have to explain why you got $3.5 [million].", "The president is distorting the facts of a disputed account in a partisan report from a Republican-controlled Senate committee about Biden’s son, Hunter.", "That report claimed that “an investment firm co-founded by Hunter Biden” received $3.5 million from Russian businesswoman Elena Baturina in 2014. Baturina was the wife of the former mayor of Moscow, Yuri Luzhkov, who was removed as mayor in 2010 by then-Russian President Dmitry Medvedev. At the time of the alleged payment, Baturina was living in London and Austria.", "The report says nothing about Joe Biden receiving any money from that transaction, and it is not clear that Hunter Biden did, either. George Mesires, a lawyer for Hunter Biden, told the Washington Post that the allegation is false. Mesires said Hunter Biden was “not a co-founder of” the company, Rosemont Seneca Thornton LLC, that is named in the report as receiving the payment from Baturina.", "Both Trump and Biden erred on the likely effects of increasing the federal minimum wage to $15 an hour.", "Biden went too far when he said there is “no evidence” that raising the minimum wage causes businesses to go bankrupt.", "Biden: And there is no evidence that when you raise the minimum wage, businesses go out of business. That is simply not true.", "He would have been correct to say the evidence is scanty.", "It’s true that last year a Seattle-based restaurant chain, Restaurants Unlimited Inc., filed for Chapter 11 bankruptcy protection claiming that minimum-wage increases in Seattle, San Francisco and Portland, Oregon, had pushed up its wage costs significantly. But the company also admitted that its troubles included opening two new restaurants where the expected number of customers failed to materialize — an unfortunate management decision.", "Looking more broadly, three political scientists found, in a 1998 study published by the Journal of Economic Issues, that on average 48.4 businesses out of 10,000 failed in the year following an increase in the minimum wage. But that was not much different from the 47.6 failure rate in all other years.", "Biden was responding to Trump’s claim that an increase in the minimum wage leads to firing employees.", "Trump: What’s been proven to happen, is when you do that, these small businesses fire many of their employees.", "Some research does support that claim — but it’s far from “proven.”", "In 2019 the nonpartisan Congressional Budget Office — after surveying scores of published economic research papers — concluded that raising the federal minimum wage to $15 an hour would boost the wages of 17 million workers and lift 1.3 million out of poverty — but at a cost of around 1.3 million low-wage jobs.", "And that was a highly uncertain figure. CBO calculated that the odds are 2 in 3 that the loss of jobs would be somewhere between “about zero” and 3.7 million.", "Twice, Trump falsely claimed that he hasn’t received money from Wall Street.", "“You’re the one that takes all the money from Wall Street. I don’t take it,” Trump said to Biden. “You’re the one who takes the money from Wall Street, not me,” he said again moments later.", "According to the Center for Responsive Politics, Biden’s campaign committee has so far received about $8 million from PACs and individuals working in the securities and investments industry — the most of any presidential candidate during the 2020 campaign cycle. But Trump’s campaign committee has received about $2.3 million from that industry — the second highest total of any candidate for president.", "The securities and investments industry includes hedge funds, private equity firms and venture-capital firms.", "Furthermore, when contributions to outside groups supporting their campaigns, such as super PACs, are factored in, Biden has received $57.7 million from that industry and Trump has received $13.8 million.", "Biden said of Trump, “This is the guy that the actuary of … Social Security [said] if in fact he continues his plan to withhold the tax on Social Security, Social Security will be bankrupt by 2023, with no way to make up for it.” Not so.", "As we’ve written before, the Social Security Administration’s chief actuary analyzed “hypothetical legislation” that would eliminate the payroll tax that funds Social Security — not a plan from Trump.", "On multiple occasions in August, the president did say if he wins reelection he would look at “ending” or “terminating the payroll tax.” But White House and Trump campaign officials said the president only wants Congress to forgive a four-month Social Security payroll tax holiday for employees that he authorized that month. Trump said Congress could transfer money from the government’s general fund to replace the lost tax revenue.", "In an Aug. 24 letter, Stephen Goss, the Social Security Administration’s chief actuary, responded to a request from four senators to analyze a hypothetical proposal to reduce the Social Security payroll tax rate to 0% without providing an alternative source of funding. Goss said that would deplete the trust fund for retirement benefits by 2023, “with no ability to pay” benefits after that year.", "But that’s not what Trump has proposed. Even when Trump said he was “going to terminate the payroll tax,” as he did in an Aug. 12 press conference, he said the money to pay benefits would instead come from general revenues. In his letter, Goss said enacting legislation with that stipulation would leave the Social Security’s finances and benefits “essentially unaffected.”", "Trump, who attacked Biden for his son’s business dealings in China, inaccurately described his own business activity in that country.", "The New York Times on Oct. 20 disclosed for the first time that Trump had a bank account in China that he used to pursue real estate deals in that country. When the moderator asked about the report, Trump falsely claimed that “everybody knows about it, it’s listed.” It had not been previously disclosed.", "The Times reported that the account was held by Trump International Hotels Management. That firm is listed on the president’s most recent federal financial disclosure report, but the bank account is not. “The foreign accounts do not show up on Mr. Trump’s public financial disclosures, where he must list personal assets, because they are held under corporate names,” the Times wrote.", "Also, Trump said the bank account “was closed in 2015, I believe.” That’s wrong, too.", "Alan Garten, a lawyer for the Trump Organization, told the paper that the company opened an office in China “to explore the potential for hotel deals in Asia.” He added that “since 2015, the office has remained inactive,” but “the bank account remains open.”", "Trump referred to the New York Times’ reporting that he paid $750 in federal income taxes for both 2016 and 2017, claiming he “prepaid tens of millions of dollars.”", "“I called my accountants,” he said. “People were saying, ‘$750,’ I asked them a week ago, I said, ‘what did I pay?’ They said, ‘sir, you prepaid tens of millions of dollars.’ I prepaid my tax. … Over the last number of years, tens of millions of dollars I prepaid.”", "It’s unclear what exactly Trump meant. His campaign didn’t respond to our request for comment.", "But the claim is similar to one that was made on the conservative website Newsmax a day after the Times posted its story online in late September.", "Dick Morris, a former aide to Bill Clinton turned foe, wrote a 450-word story on the site under this headline: “Trump Didn’t Avoid Taxes, He Prepaid Them.”", "Morris pointed out that the Times‘ story explained Trump had gotten an extension for filing his taxes in 2016 and 2017.", "In both of those years, according to the Times, Trump paid the IRS for income taxes that he might owe. For 2016, he paid $1 million. For 2017, he paid $4.2 million.", "“But virtually all of that liability was washed away when he eventually filed, and most of the payments were rolled forward to cover potential taxes in future years,” according to the Times.", "Morris, though, appears to have confused the timing. He claimed that that money would account for why the actual taxes Trump paid in 2016 and 2017 were so low.", "Morris wrote: “So — when he only paid $750 in taxes for the first two years of his presidency it was because he had already overpaid during the two previous years and just reduced his payment by that amount.”", "But that’s not what the Times story says.", "For 2015, Trump made his first payment of any federal income tax since 2010, according to the Times. He paid $641,931 that year. He didn’t pay the larger sums until later.", "So, without further explanation from Trump about his tax history, it’s hard to tell what he’s talking about.", "Trump also suggested during the debate that the $750 he paid was a “filing fee.”", "Again, we don’t know what he meant.", "As Richard Rubin, who covers tax policy for the Wall Street Journal, pointed out, there is no such filing fee in the tax code.", "Also, the Times story reported that the $750 figure was on line 56 of the Form 1040, which is for the amount of income tax that’s due.", "Trump hasn’t released his tax returns, but in the debate he again claimed that he intends, at some point, to do so.", "In defending his administration’s response to the COVID-19 pandemic, which has now claimed more than 220,000 American lives, Trump trotted out many go-to lines that are either incorrect or misleading.", "Lives saved. He started out by claiming that 2.2 million Americans “were expected to die.” But that misconstrues a projection, made in March by Imperial College London, for the number of lives that could be lost if absolutely no action was taken.", "Far from being a realistic estimate of the number of U.S. lives that would be lost, the report said the 2.2 million figure reflects “the (unlikely) absence of any control measures or spontaneous changes in individual behaviour.”", "Excess mortality. Trump also touted the U.S.’s excess mortality rate, falsely claiming that it is “much lower than almost any other country.” As we explained last week after Trump’s NBC town hall, America’s excess mortality figures, which refer to the number of people who died from any cause, relative to a “normal” or expected number of deaths, are not particularly good.", "A Journal of the American Medical Association analysis found that relative to 14 other countries, the U.S. had a higher per capita excess mortality rate than all but two countries since the start of the pandemic through late July.", "Our analysis of figures from the Human Mortality Database similarly showed that the U.S.’s excess mortality rate is higher than 30 out of the 34 other countries included in the database.", "A ‘cure.’ The president also referenced Regeneron’s antibody cocktail that he received to treat COVID-19, and suggested, as he has before, that the experimental treatment is a cure.", "“I had something that they gave me, a therapeutic, I guess they would call it — some people could say it was a cure — but I was in for a short period of time,” he said. “And I got better very fast or I wouldn’t be here tonight.”", "As we’ve written, it’s impossible to know whether Trump benefited from the drug, but in any case, the therapy is still being tested in clinical trials. Although early results are promising, it’s still unknown whether the cocktail is safe and effective for COVID-19.", "‘Rounding the turn.’ Trump also once again claimed that “we’re rounding the turn” on the pandemic. Data, however, show that COVID-19 cases, hospitalizations and deaths are increasing — and experts, such as National Institute of Allergy and Infectious Diseases Director Dr. Anthony Fauci, have warned that the pandemic is far from over.", "Numbers from the COVID Tracking Project show that as of Oct. 22, more than 61,000 new cases are being reported each day, on average for the past seven days. That’s up from a mid-September lull of 34,000 cases per day — and is approaching the earlier peak in mid-July.", "While more tests are being done now than earlier in the summer, the percentage of tests that are coming back positive is now increasing, which is indicative of outbreaks worsening. And not only are cases up, but as the COVID Tracking Project’s weekly update from Oct. 22 notes, so too are hospitalizations and deaths.", "Those lines of evidence refute Trump’s claim that testing — which he called “the best testing in the world by far” — is “why we have so many cases.” Extensive testing will identify more cases, but only if those infections exist. Trump made the same false argument over the summer.", "H1N1. Trump made a misleading comparison to 2009’s H1N1 influenza pandemic, claiming Biden’s handling of the situation was a “total disaster” and if the flu strain had been as lethal as the coronavirus, “700,000 people would be dead right now.”", "It’s unclear how Trump arrived at his figure, but Vice President Mike Pence made a similar claim in his debate last month with VP contender and California Sen. Kamala Harris, when he used 2 million deaths.", "As we noted then, it’s precisely because the influenza pandemic was not especially lethal that fewer precautions were taken to prevent infections, so it’s misleading to calculate what the deaths would have been had the virus been more deadly. In the end, the Centers for Disease Control and Prevention estimated that over a full year, fewer than 13,000 Americans died from the virus.", "In making his case about H1N1, Trump also reprised a past claim about Ron Klain, Biden’s former chief of staff. “Look, his own person who ran that for him, who, as you know, was his chief of staff said, ‘It was catastrophic. It was horrible. We didn’t know what we were doing,’” Trump said. “Now he comes up and he tells us how to do this.”", "That mischaracterizes Klain’s comments, made during a 2019 policy summit, which included the phrase “we did every possible thing wrong” — but which Klain later said referred to vaccine production delays, not the Obama administration’s overall response.", "‘Closed’ states. Trump falsely claimed that Democratic states are still in lockdown, and said that spikes were occurring in places “where they’ve had it closed.” We’ve explained before that no state is under a highly restrictive stay-at-home order — and most of those have been lifted for months.", "“His Democrat Governors, Cuomo in New York, you look at what’s going on in California, you look at Pennsylvania, North Carolina, Democrats, Democrats all, they’re shut down so tight and they’re dying,” Trump said.", "Later, Trump doubled down on the claim. “When you say spike, take a look at what’s happening in Pennsylvania where they’ve had it closed. Take a look at what’s happening with your friend in Michigan, where her husband’s the only one allowed to do anything. It’s been like a prison,” he said, referring to Gov. Gretchen Whitmer. “Take a look at North Carolina, they’re having spikes and they’ve been closed, and they’re getting killed financially.”", "Pennsylvania has been largely open since July 3; Michigan’s stay-at-home order ended on June 1; and North Carolina is in phase 3 of reopening.", "Trump’s comment about Whitmer’s husband, Marc Mallory, distorts an event in which Mallory attempted to retrieve his boat by Memorial Day weekend and asked if being married to the governor would speed things up. Mallory later said he had been joking. Regardless, there was no restriction on boating at the time and he did not receive special treatment.", "Although Biden claimed Trump’s travel restrictions on China were imposed “late, after 40 countries had already done that,” most of those countries did it around the same time as Trump.", "Trump and Biden went back and forth on Trump’s decision in late January to restrict travel from China due to the coronavirus.", "Trump: When I closed and banned China from coming in heavily infected and then ultimately Europe, but China was in January. Months later, he [Biden] was saying I was xenophobic. I did it too soon. Now he’s saying, “Oh, I should have moved quicker,” but he didn’t move quicker. He was months behind me, many months behind me.", "Biden: My response is he is xenophobic, but not because he shutdown access from China. And he did it late, after 40 countries had already done that.", "A day after the World Health Organization on Jan. 30 declared the coronavirus outbreak a public health emergency of international concern, Health and Human Services Secretary Alex Azar declared a public health emergency for the U.S. and announced travel restrictions to and from China, effective Feb. 2. The policy prohibited non-U.S. citizens, other than permanent residents and the immediate family of both U.S. citizens and permanent residents, who have traveled to China within the last two weeks from entering the U.S.", "As we have written, Trump was wrong to say, as he did in the debate, travel from China was “closed and banned.” There were exceptions, and tens of thousands of people flew directly from China to the U.S. in the months after the restrictions were enacted.", "But Trump’s announcement wasn’t “late” compared with other countries, as Biden claimed. Nor was it “very early,” as Trump has claimed in the past. In the days after the WHO made its announcement about the virus being a public health emergency of international concern, 36 countries imposed travel restrictions, including the U.S., by Feb. 2, according to Think Global Health, a project of the Council on Foreign Relations that tracked the travel restrictions on China due to COVID-19.", "“What this data shows is that the United States was neither behind nor ahead of the curve in terms of imposing travel restrictions against China,” a co-author of the tracker, Samantha Kiernan, a research associate on global health, economics, and development at the Council on Foreign Relations, told us via email back in April.", "Later in the debate, Trump again claimed Biden called him xenophobic and racist “because I was closing it to China. Now he says I should have closed it earlier.”", "“I didn’t say either of those things,” Biden responded.", "“You certainly did,” Trump said. “You certainly did.”", "Said Biden: “I talked about his xenophobia in a different context. It wasn’t about closing the border to Chinese coming to the United States.”", "On the day the White House announced the restrictions, Biden said at a campaign event in Iowa that as the pandemic unfolds, Americans “need to have a president who they can trust what he says about it, that he is going to act rationally about it.” He added, “This is no time for Donald Trump’s record of hysteria and xenophobia – hysterical xenophobia – and fearmongering to lead the way instead of science.” His campaign later said he wasn’t talking about the travel restrictions.", "In their discussion of the travel restrictions, Trump made two other dubious claims we have fact-checked before.", "He dusted off his jab at House Speaker Nancy Pelosi for “dancing on the streets in Chinatown, in San Francisco” as the COVID-19 pandemic developed. As we have written, Pelosi traveled to Chinatown on Feb. 24 in an effort to bolster the neighborhood’s restaurants and shops. Their business had fallen sharply in the wake of the onset of the novel coronavirus pandemic, which originated in Wuhan, China, late last year. The visit came three weeks before six Bay Area counties implemented shelter-in-place restrictions. On the day of Pelosi’s visit, Trump tweeted this about the virus: “The Coronavirus is very much under control in the USA.” As for the claim about Pelosi “dancing on the streets,” she didn’t.", "Trump also suggested China may have intentionally spread the virus, stating, “They [China] kept it [coronavirus] from going into the rest of China for the most part, but they didn’t keep it from coming out to the world, including Europe and ourselves.” But as we have written, China did not stop the coronavirus from spreading from Wuhan, where it originated, to other parts of China. The number of reported cases and deaths in China’s major cities outside Wuhan have been far lower than the numbers in many European and American cities, but China also took extreme measures to slow the spread of the disease that the U.S. did not.", "Biden claimed that “38,000 prisoners were released from federal prison” during the Obama administration. That’s misleading.", "When Biden made a similar claim in a speech in January 2019, before he was even a candidate for president, a Biden spokesman told us Biden got the figure from a December 2018 letter the American Civil Liberties Union addressed to Senate leaders. The letter said, “The federal prison population has fallen by over 38,000 since 2013 thanks in large part to retroactive application of sentencing guidelines approved by the U.S. Sentencing Commission.”", "A footnote indicated that figure was based on federal data as of Dec. 13, 2018. So, the ACLU was looking at statistics from about halfway through the Obama administration through nearly two years into the Trump administration.", "But when measuring from December 31, 2008 — less than a month before Barack Obama and Biden took office — to December 31, 2016 — less than a month before Obama and Biden left office — the number of prisoners in federal custody declined by about 12,000, according to data from the Bureau of Justice Statistics. (From 201,280 at the end of 2008 to 189,192 at the end of 2016.)", "Discussing the Trump administration’s “zero tolerance” border policy that led to the separation of immigrant children from their parents, Biden condemned the move saying that it “makes us a laughing stock and violates every notion of who we are as a nation.”", "Trump misleadingly claimed in response, “Kristen, they did it. We changed the policy.”", "In fact, it was not until the Trump administration that the U.S. began referring all illegal border-crossers for criminal prosecution — forcing separations, since children couldn’t be held in detention facilities for adults.", "Experts say there were some separations under previous administrations — for example, in cases where the family relationship could not be established or child trafficking was suspected — but there was no blanket policy like the one the Trump administration implemented, as we’ve covered before.", "Trump went on to say that “they built the cages” — referring, correctly, to the fact that chain-link fences in detention facilities that have been described as “cages” were installed under the Obama administration.", "Trump claimed that Biden has “no understanding of immigration, of the laws,” but then went on to make false claims about immigration laws.", "Specifically, the president got the facts wrong about foreign nationals who are apprehended crossing the border and released pending immigration hearings — which he refers to as “catch and release.”", "Trump: Catch and release is a disaster. A murderer would come in. A rapist would come in. A very bad person would come in. We would take their name. We have to release them into our country. And then you say they come back [for immigration hearings]. Less than 1% of the people come back.", "Trump is wrong on two counts, beginning with his false claim about murderers and rapists being released. In fact, U.S. Immigration and Customs Enforcement is required under the Immigration Nationality Act, Section 236 (c) to hold certain criminals, including those who have been convicted of an aggravated felony and those who have served more than a year in jail for a criminal offense.", "He’s also wrong about the percentage of people who failed to appear for immigration hearings after being released. The Department of Justice’s Executive Office for Immigration Review, which conducts removal proceedings in immigration courts, reported that in the second quarter of this year 53% of removal orders were issued “in absentia” — meaning when a foreign national fails to appear — in initial case completions.", "Immigration experts told us last year, when we wrote about a similar claim by the president, that the percentage of those who show up for immigration hearings is even higher than the EOIR statistics indicate. In any event, Trump is wrong when he says it is “less than 1%.”", "When the debate shifted to a discussion about China, Biden said of Trump: “He has caused the deficit with China to go up, not down. With China, up, not down.” That’s no longer the case.", "The U.S. trade deficit with China in goods and services was a record $380 billion in nominal dollars in 2018, according to the Bureau of Economic Analysis. The high before that was $337.3 billion in 2017 — which was about the same as it was in 2015 during the Obama-Biden administration.", "But, in 2019, the trade deficit fell to $308 billion — which was just below the $310 billion trade deficit in 2016, Biden’s last year as vice president.", "And the deficit with China continues to fall. Through the first six months of 2020, it was about $130 billion. That’s lower than it was at that point in 2019 ($165 billion) and every other year since Trump has been president.", "Trump referenced a talking point he has used repeatedly in campaign rallies, saying that families were making “more money than they’ve ever made,” mentioning racial groups and saying, “it’s nine times greater the percentage gain … in three years than it was under eight years of the two of them.” On the campaign trail, he has said: “African American income grew nine times more than it did under the last administration.” But the comparison relies on 2019 Census Bureau figures collected this March, during coronavirus pandemic shutdowns, that suffer from a higher-than-normal no-response rate, with higher-income households more likely to respond than those with lower incomes.", "As we’ve explained, Census said an apparent 6.8% increase in 2019 median household income for all races, compared with the year before, was actually about 4.1% higher after adjusting for the nonresponse bias. Census didn’t give such an adjustment for income by race. But the raw figures show the vast majority of the increase in inflation-adjusted median Black household income under Trump would have come in 2019. It went up by $3,328 from 2018 to 2019 but only $39 from 2016, the year before Trump took office, to 2018. (See Table H-5.)", "Trump’s statistic comes from his Council of Economic Advisers, which made adjustments to Census figures for changes to the survey in 2013 and 2017 but not for the lower response issue in 2019 that may have skewed the numbers.", "Trump made three false or misleading statements about Dr. Anthony Fauci.", "Trump: He did say, don’t wear masks. He did say, as you know, this [the coronavirus] is not going to be a problem. I think he’s a Democrat, but that’s OK. He said, “This is not going to be a problem. We are not going to have a problem at all.”", "Anthony said don’t wear masks. Now he wants to wear masks. Anthony also said, if you look back, exact words, here’s his exact words, “This is no problem. This is going to go away soon.” So he’s allowed to make mistakes.", "As we have written, Fauci and other federal public health professionals were, in the early months of 2020, telling the general public not to wear face masks.", "“We were told in our task force meetings that we have a serious problem with the lack of PPEs and masks for the health providers who are putting themselves in harm’s way every day to take care of sick people,” Fauci explained in July.", "However, as health officials learned more about the virus, and how often it was being transmitted by asymptomatic carriers, Fauci and the Centers for Disease Control and Prevention reversed course on April 3 and recommended that people begin “wearing cloth face coverings in public settings where other social distancing measures are difficult to maintain.”", "Since that time, Fauci has consistently advocated mask-use, even as Trump has continued to send mixed messages about it.", "Trump flat-out misquoted Fauci allegedly saying that the coronavirus is “not going to be a problem.” As we have written, Fauci said in a Feb. 29 interview on NBC’s “Today” show that “right now at this moment” the risk was “low” and there was “no need” for people “to change anything that you’re doing on a day-by-day basis.” But he added that “this could change,” that people needed to be wary of “community spread,” and that it could develop into a “major outbreak.”", "Trump also wrongly suggested Fauci is a Democrat. We confirmed through District of Columbia voter registration records that Fauci is registered as an independent. And he has served under Democratic and Republican presidents dating back to Ronald Reagan.", "Pointing at his opponent, Trump wrongly claimed that Biden “wants to raise everybody’s taxes.” Biden has vowed that he will not raise taxes on anyone making under $400,000 a year.", "Biden’s proposal includes three main changes: imposing a payroll tax on earnings over $400,000; restoring a top income tax rate of 39.6% for income above $400,000; and increasing the top corporate tax rate from 21% to 28%.", "The most recent estimate by the Urban-Brookings Tax Policy Center on Oct. 15 calculates that the net result of all of Biden’s tax proposals in 2022 would be, on average, an increase in after-tax income (in effect, a tax cut) for the bottom 80% of households, with the top one-tenth of 1% of earners bearing 70% of Biden’s proposed tax increases.", "After he mentioned Senate Republicans not voting on the House-passed coronavirus relief bill known as the HEROES Act, Biden again misquoted Senate Majority Leader Mitch McConnell’s response about providing aid to cities and states affected by the pandemic.", "“Mitch McConnell said, ‘Let them go bankrupt,’” Biden claimed. “‘Let them go bankrupt.’ Come on.”", "As we’ve written, McConnell said bankruptcy should be a legal option for states facing money issues unrelated to the coronavirus, such as debt due to pension programs.", "When asked in an April 22 interview about states with budgetary woes predating the pandemic, McConnell said: “I would certainly be in favor of allowing states to use the bankruptcy route.” In subsequent interviews, the Republican senator made clear that he was saying bankruptcy should be “an option” to “fix age-old problems” in states “wholly unrelated” to the coronavirus pandemic. “I wasn’t saying they had to take bankruptcy,” he said in an April 27 Fox News Radio interview. “I think it’s just an option to be looked at, that unfortunately states don’t have that option now, cities do.”", "Affordable Care Act premiums. In talking about the Affordable Care Act, Trump claimed, “Premiums are down.” Premiums for plans purchased on the Affordable Care Act exchanges have gone down in 2020 (by 3.5% for the lowest-cost “silver” level premium) and 2019 (by 0.4%), but that was after a double-digit increase for 2018 plans (up 29.7%).", "The large increase then was driven by the Trump administration’s elimination of cost-sharing subsidies on the marketplaces and insurer uncertainty over the ACA’s future. So, when insurers set marketplace premiums for 2019, the Urban Institute wrote in a January report, “it became clear that many of them had overreacted to the tumult and uncertainty” in pricing 2018 plans.", "We don’t yet have complete information on premiums for plans for 2021, but based on the insurer filings so far, most of the premium changes are “moderate, with increases or decrease of a few percentage points,” an Oct. 19 Kaiser Family Foundation report said. As is typical, rate changes vary widely among plans “from a -42.0% decrease to a 25.6% increase,” KFF said, “though half fall between a 3.5% decrease and 4.6% increase.”", "Private insurance. Trump continued to falsely claim Biden supported getting rid of private insurance, as the Medicare for All plan proposed by Sen. Bernie Sanders would do in favor of a Medicare system for everyone. Trump claimed Biden wanted to “terminate all of those policies” for 180 million people on private plans. That’s not Biden’s plan.", "The former vice president has proposed a Medicare-style public option as a choice, but also backs increased tax credits for individuals purchasing their own insurance. “Instead of starting from scratch and getting rid of private insurance, he has a plan to build on the Affordable Care Act by giving Americans more choice, reducing health care costs, and making our health care system less complex to navigate,” the plan says.", "Preexisting conditions. In talking about Trump’s desire to get rid of the ACA, Biden said that “over 110 million people with preexisting conditions, and all the people from COVID are going to have preexisting conditions, what are they going to do?” A health care consulting firm did estimate in 2018 that 102 million people, not including those on Medicare and Medicaid, have preexisting conditions. And the ACA expanded preexisting condition protections, prohibiting insurers in all markets from denying coverage or charging more based on health status. But many of those with health conditions wouldn’t be in a dire situation if the ACA were eliminated.", "Those seeking coverage on the individual or nongroup market would be at risk of being denied insurance or charged higher premiums, but employer-based plans had some protections before the ACA. New workers couldn’t be denied a policy pre-ACA; they could be denied coverage for some preexisting conditions for a limited period if they had a lapse in coverage.", "As he did in the first debate, Trump wrongly attributed to Biden the use of the word “super-predators” to refer to Black Americans when the then-senator was working on the 1994 crime bill. Actually, that was a phrase famously uttered by Hillary Clinton about some “gangs of kids.”", "Trump repeatedly referred to the 1994 crime bill spearheaded by Biden, saying it “did such harm to the Black community” and “put tens of thousands of mostly Black young men in prison.”", "“And he called them super-predators,” Trump said, as Biden mouthed, “Not true.”", "“I never, ever said what he accused me of saying,” Biden later responded. “The fact of the matter is, in 2000, though, after the crime bill had been in the law for a while, this is the guy who said the problem with the crime bill, there’s not enough people in jail.”", "As then-chairman of the Senate Judiciary Committee, Biden did shepherd the Violent Crime Control and Law Enforcement Act of 1994 through the legislative process. Although the bill received bipartisan support at the time, it has been criticized for some of its provisions, such as mandatory minimum sentencing, and its impact on mass incarceration, particularly of Black men. As we have written, the trend of increasing imprisonment began well before 1994, but experts told us the 1994 law exacerbated the issue.", "As we have written, it was actually Hillary Clinton who used the phrase “super-predator” in a 1996 speech at New Hampshire’s Keene State College in support of the 1994 crime bill, which was signed by her husband, then-President Bill Clinton.", "“They are not just gangs of kids anymore,” Clinton said. “They are often the kinds of kids that are called ‘superpredators.’ No conscience, no empathy. We can talk about why they ended up that way, but first we have to bring them to heel.”", "Interestingly, Trump often criticized Clinton during her 2016 presidential bid for using that term, and Clinton has since acknowledged, “Looking back, I shouldn’t have used those words, and I wouldn’t use them today.”", "Speaking in favor of the crime bill in an impassioned speech from the floor of the Senate in 1993, Biden used the term “predator” in much the same context that Clinton used the term “super-predator.”", "“We have predators on our streets that society has in fact, in part because of its neglect, created,” Biden said, adding that many of them are “beyond the pale,” and that “we have an obligation to cordon them off from the rest of society.”", "But Biden is also correct that in Trump’s 2000 book, “The America We Deserve,” Trump warned of a coming crime wave and commented, “No, the problem isn’t that we have too many people locked up. It’s that we don’t have enough criminals locked up.”", "Meeting with Kim Jong Un. Trump repeated his unsubstantiated claim that the Obama administration “tried to meet with” North Korea’s Kim Jong Un but “he wouldn’t do it. He didn’t like Obama.” There is no evidence that Obama ever made an effort to seek a face-to-face meeting with the North Korean leader or his father, Kim Jong Il, while in office.", "Border wall. The president said about his long-promised border wall: “We’re over 400 miles of brand new wall.” U.S. Customs and Border Protection reports that 371 miles of barriers have been erected as of Oct. 19, but according to the latest data provided to us by CBP, only 15 miles of that is new primary fencing where none previously existed.", "Biden’s mask claim. Biden incorrectly attributed an estimate for the number of lives that could be saved with the use of masks to people in the administration. “If we just wore these masks, the president’s own advisers have told him, we can save a 100,000 lives,” the former vice president said, echoing an earlier claim in which he ascribed the figure to the CDC director. The projection, however, is from the University of Washington’s Institute for Health Metrics and Evaluation as of early September. IHME’s model now projects around 34,000 lives could be saved by the end of the year with near-universal masking.", "Birds and wind power. Trump told Biden, “I know more about wind than you do, it’s extremely expensive — kills all the birds.” As we’ve written, it’s true that wind turbines do kill some birds: The U.S. Fish & Wildlife Service estimates that 140,438 to 327,586 birds die every year from collisions with land-based wind turbines. But turbines do relatively little damage compared with other sources. More than a billion birds are estimated to be killed by cats every year, and millions more are lost to vehicles, electric lines and buildings.", "Green New Deal. Trump claimed that Biden’s “real plan” on the environment “costs $100 trillion.” That figure is a reference not to Biden’s plan but to the Green New Deal — which Biden’s website calls a “crucial framework.” And the estimate comes from a right-leaning think tank and has important caveats; as we’ve explained, experts told us the Green New Deal, which is a nonbinding resolution, is too vague to try to estimate its cost. (Trump also claimed that Biden wants to “take buildings down because they want to make bigger windows into smaller windows” or even remove all windows — which has been previously debunked by PolitiFact.)", "Editor’s Note: Please consider a donation to FactCheck.org. We do not accept advertising. We rely on grants and individual donations from people like you. Credit card donations may be made through our “Donate” page. If you prefer to give by check, send to: FactCheck.org, Annenberg Public Policy Center, 202 S. 36th St., Philadelphia, PA 19104.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here for more.", "McIntire, Mike et al. “Trump Records Shed New Light on Chinese Business Pursuits.” New York Times. 20 Oct 2020.", "“READ: Trump’s financial disclosure report for 2019.” CNN. 31 Jul 2020.", "“Immigration Detention: A Legal Overview.” Congressional Research Service. 16 Sep 2019.", "“Adjudication Statistics. Comparison of In Absentia Rates.” Executive Office for Immigration Review. 15 Apr 2020.", "Kiely, Eugene. “Trump’s Bogus ‘Catch and Release’ Statistic.” FactCheck.org. 23 Jan 2019.", "“Hunter Biden, Burisma, and Corruption: The Impact on U.S. Government Policy and Related Concerns.” Senate Committee on Homeland Security and Governmental Affairs, and Senate Committee on Finance. 23 Sep 2020.", "“Moscow Mayor Yuri Luzhkov sacked by President Medvedev.” BBC. 28 Sep 2010.", "Childs, Kevin. “Yelena Baturina is Changing the World Through Design, Apparently.” HuffPost. 16 Jan 2014.", "Demirjian, Karoun et al. “GOP senators’ report calls Hunter Biden’s board position with Ukraine firm ‘problematic’ but doesn’t show it changed U.S. policy.” Washington Post. 23 Sep 2020.", "COVID-19 Dashboard. Center for Systems Science and Engineering at Johns Hopkins University. Accessed 23 Oct 2020.", "Ferguson, Neil M. “Report 9: Impact of non-pharmaceutical interventions (NPIs) to reduce COVID-19 mortality and healthcare demand.” Imperial College COVID-19 Response Team. 16 Mar 2020.", "Jackson, Brooks et al. “FactChecking Trump’s Town Hall.” FactCheck.org. 16 Oct 2020.", "McDonald, Jessica. “Trump Overstates Status of COVID-19 Antibody Drugs.” FactCheck.org. 8 Oct 2020.", "Farley, Robert et al. “Trump on the Stump.” FactCheck.org. 22 Oct 2020.", "McDonnell Nieto del Rio, Giulia et al. “The U.S. has passed the 8-million mark for known infections.” New York Times. Updated 20 Oct 2020.", "Howard, Jacqueline. “Covid-19 in the US is ‘on a trajectory of getting worse,’ Fauci warns.” CNN. 12 Oct 2020.", "COVID Tracking Project. Accessed 23 Oct 2020.", "Johns Hopkins University & Medicine Coronavirus Resource Center. “Daily State-by-State Testing Trends.” Updated 22 Oct 2020.", "COVID Tracking Project. “This Week in COVID-19 Data, Oct 22.” Blog post. 22 Oct 2020.", "McDonald, Jessica. “Trump Falsely Says COVID-19 Surge ‘Only’ Due to Testing, Misleads on Deaths.” FactCheck.org. 25 Jun 2020.", "“2009 H1N1 Pandemic (H1N1pdm09 virus).” CDC. Accessed 23 Oct 2020.", "Korecki, Natasha. “Biden has fought a pandemic before. It did not go smoothly.” Politico. 4 May 2020.", "McDonald, Jessica. “Trump Distorts WHO’s Lockdown Comments.” FactCheck.org. 14 Oct 2020.", "“See How All 50 States Are Reopening (and Closing Again).” New York Times. Updated 22 Oct 2020.", "“State Data and Policy Actions to Address Coronavirus.” KFF. 22 Oct 2020.", "“Responding to COVID-19 in Pennsylvania.” PA.gov. Updated 9 Oct 2020.", "Rieder, Rem. “Trump’s False Claim That Michigan Is ‘Closed’.” FactCheck.org. 12 Oct 2020.", "“Staying Ahead of the Curve.” NC.gov. Accessed 23 Oct 2020.", "Bradner, Eric. “Whitmer faces backlash over husband’s ‘failed attempt at humor’ about their boat.” CNN. 27 May 2020.", "Robertson, Lori et al. “FactChecking Biden’s Town Hall.” FactCheck.org. 18 Sep 2020.", "Institute for Health Metrics and Evaluation. “COVID-19 Results Briefing: United States of America.” Healthdata.org. 3 Sep 2020.", "Institute for Health Metrics and Evaluation. COVID-19 Projections for the United States of America. Accessed 23 Oct 2020.", "Farley, Robert. “No Evidence Kim Jong Un Rebuffed Obama’s ‘Begging.’” FactCheck.org. 2 Jul 2019.", "“Border Wall System.” U.S. Customs and Border Protection. Updated 19 Oct 2020.", "“Border Wall Status – October 9, 2020.” U.S. Customs and Border Protection. 9 Oct 2020.", "McDonald, Jessica. “Trump’s Faulty Wind Power Claims.” FactCheck.org. 4 Apr 2019.", "McDonald, Jessica. “How Much Will the ‘Green New Deal’ Cost?” FactCheck.org. 14 Mar 2019.", "“Threats to Birds.” U.S. Fish and Wildlife Service. Updated 14 Sep 2018.", "“The Biden Plan for a Clean Energy Revolution and Environmental Justice.” JoeBiden.com. Accessed 22 Oct 2020.", "Austin, Sophie. “Trump said Biden wants to mandate net-zero emission buildings and get rid of windows. He’s wrong.” PolitiFact. 17 Jul 2020.", "“Attorney General Announces Zero-Tolerance Policy for Criminal Illegal Entry.” Press release, U.S. Department of Justice. 6 Apr 2018.", "“Attorney General Sessions Delivers Remarks Discussing the Immigration Enforcement Actions of the Trump Administration.” U.S. Department of Justice. 7 May 2018.", "Robertson, Lori. “Did the Obama Administration Separate Families?” FactCheck.org. 20 Jun 2018.", "Kiefer, Michael. “First peek: Immigrant children flood detention center.” AZCentral.com. 18 Jun 2014.", "“Children in Cages are Not New.” Aspen Institute. YouTube. 29 Jun 2019.", "Center for Responsive Politics. Industry Totals: Securities & Investment. Opensecrets.org. Accessed 22 Oct 2020.", "Office of the Chief Actuary. Social Security Administration. Letter to Senators Van Hollen, Sanders, Wyden, and Schumer. 24 Aug 2020.", "Gore, D’Angelo. “Biden’s False Attacks on Trump’s Social Security ‘Plan.’” FactCheck.org. 11 Sep 2020.", "U.S. Bureau of Economic Analysis. “Table 3. U.S. International Trade by Selected Countries and Areas – Balance on Goods and Services.” 3 Sep 2020, accessed 23 Oct 2020.", "Thorn, Brett. “Restaurants Unlimited files for Chapter 11 bankruptcy.” Nation’s Restaurant News. 8 Jul 2019", "Waltman, Jerold and Allan McBride and Nicole Camhout. “Minimum Wage Increases and the Business Failure Rate.” Journal of Economic Issues. Volume 32, Issue #1 Mar 1998.", "U.S. Congressional Budget Office. “The Effects on Employment and Family Income of Increasing the Federal Minimum Wage.” Jul 2019.", "McDermott, Daniel, et. al. “2021 Premium Changes on ACA Exchanges and the Impact of COVID-19 on Rates.” Kaiser Family Foundation. 19 Oct 2020.", "Holahan, John, et. al. “Marketplace Premiums and Insurer Participation: 2017-2020.” Urban Institute. Jan 2020.", "Biden, Joe. Health Care. joebiden.com. accessed 23 Oct 2020.", "Mendelson, Dan, et. al. “Repeal of ACA’s Pre-Existing Condition Protections Could Affect Health Security of Over 100 Million People.” Avalere. 23 Oct 2018.", "Rothbaum, Jonathan and Bee, Adam. “Coronavirus Infects Surveys, Too: Nonresponse Bias During the Pandemic in the CPS ASEC.” Census Bureau. 15 Sep 2020.", "Rothbaum, Jonathan. “Census Bureau Still Studying Full Impact of Pandemic on Income Data.” Census Bureau. 15 Sep 2020.", "Census Bureau. Historical Income Tables: Households. Table H-5. Race and Hispanic Origin of Householder — Households by Median and Mean Income. accessed 23 Oct 2020.", "@WhiteHouseCEA. “Real income for the typical Black American family is now at an all-time high after increasing $4,300 under President Trump – 9 times the total gains under 8 years of the Obama administration (after adjusting for the Census Bureau’s survey redesigns in 2013 and 2017).” Twitter. 14 Oct 2020.", "World Health Organization. “Statement on the second meeting of the International Health Regulations (2005) Emergency Committee regarding the outbreak of novel coronavirus (2019-nCoV).” 30 Jan 2020.", "Health and Human Services. “Secretary Azar Declares Public Health Emergency for United States for 2019 Novel Coronavirus.” 31 Jan 2020.", "White House website. “Proclamation on Suspension of Entry as Immigrants and Nonimmigrants of Persons who Pose a Risk of Transmitting 2019 Novel Coronavirus.” 31 Jan 2020.", "Farley, Robert. “The Facts on Trump’s Travel Restrictions.” FactCheck.org. 06 Mar 2020.", "Farley, Robert. “Trump, Biden Spin China Travel Restrictions.” FactCheck.org. 06 Apr 2020.", "Kiernan, Samantha, and DeVita, Madeleine. “Travel Restrictions on China due to COVID-19.” Think Global Health. 06 Apr 2020.", "Rieder, Rem. “Trump’s False Claims about Pelosi and Chinatown.” FactCheck.org. 16 Apr 2020.", "Allday, Erin. “Bay Area orders ‘shelter in place,’ only essential businesses open in 6 counties.” San Francisco Chronicle. 16 Mar 2020.", "Farley, Robert. “China Didn’t Stop Virus ‘Cold’ Outside Wuhan.” FactCheck.org. 09 Jun 2020.", "FactCheck.org. “FactChecking the First Trump-Biden Debate.” 30 Sep 2020.", "Congress.gov. H.R.3355 – Violent Crime Control and Law Enforcement Act of 1994.", "Farley, Robert. “Bill Clinton and the 1994 Crime Bill.” FactCheck.org. 12 Apr 2016.", "Rieder, Rem, “FactChecking Trump’s Fox News Interview.” FactCheck.org. 02 Sep 2020.", "Capehart, Jonathan. “Hillary Clinton on ‘superpredator’ remarks: ‘I shouldn’t have used those words.‘” Washington Post. 25 Feb 2016.", "Kaczynsk, Andrew and Steck, Em. “Trump warned of ‘wolf packs’ of adolescent criminals, undercutting his recent criticism of Biden.” CNN. 31 May 2019.", "Brown, Frederic. “The US Surgeon General once warned against wearing face masks for the coronavirus but the CDC now recommends it.” Business Insider. 13 Apr 2020.", "O’Donnell, Norah. “Dr. Fauci Says, ‘With All Due Modesty, I Think I’m Pretty Effective.’” InStyle. 15 Jul 2020.", "Centers for Disease Control and Prevention. “Recommendation Regarding the Use of Cloth Face Coverings, Especially in Areas of Significant Community-Based Transmission.” 03 Apr 2020.", "Farley, Robert. “Trump Has Not Been ‘Clear’ in Support of Masks.” FactCheck.org. 25 Sep 2020.", "Farley, Robert. “Trump Misquotes Fauci on Coronavirus Threat.” FactCheck.org. 29 Apr 2020.", "Mermin, Gordon. “An Updated Analysis of Former Vice President Biden’s Tax Proposals.” Tax Policy Center. 15 Oct 2020.", "Buettner, Russ, Susanne Craig, and Mike McIntire. “The President’s Taxes — Long-Concealed Records Show Trump’s Chronic Losses and Years of Tax Avoidance.” New York Times. 27 Sep 2020.", "Morris, Dick. “Trump Didn’t Avoid Taxes, He Prepaid Them.” Newsmax.com. 28 Sep 2020.", "Rubin, Richard. “What Did Trump Mean When He Said He ‘Prepaid’ His Taxes?” Wall Street Journal. 22 Oct 2020.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]