["About this rating", "In these days of heightened patriotism and concern among Americans for their military troops, any rumor about a corporate giant's snubbing those who are putting their lives on the line overseas is bound to make a number of folks hot under the collar, which is what a message originally circulated via e-mail back in 2004 did. That viral missive proclaimed that Starbucks had not only refused a request for free product from some U.S. Marines serving in Iraq, but had retorted that \"they don't support the war [in Iraq] and anyone in it\":", "I have indeed confirmed the fact that Starbucks charged rescue workers $130.00 for 3 cases of bottled water on September 11, 2001, so the following info that was passed on to me would not be surprising to me at all!!", "Dear everyone: Please pass this along to anyone you know, this needs to get out in the open. Recently Marines over in Iraq supporting this country in OIF wrote to Starbucks because they wanted to let them know how much they liked their coffee and try to score some free coffee grounds. Starbucks wrote back telling the Marines thanks for their support in their business, but that they don't support the War and anyone in it and that they won't send them the Coffee. So as not to offend them we should not support in buying any Starbucks products. As a War vet and writing to you patriots I feel we should get this out in the open. I know this War might not be very popular with some folks, but that doesn't mean we don't support the boys on the ground fighting street to street and house to house for what they and I believe is right. If you feel the same as I do then pass this along, or you can discard it and I'll never know. Thanks very much for your support to me, and I know you'll all be there again here soon when I deploy once more.", "Semper Fidelis,\nSgt Howard C. Wright\n1st Force Recon Co\n1st Plt PLT RTO", "A September 2008 version changed \"marines\" to \"Royal Marines,\" thereby altering the group of soldiers being slighted from American to British. We first encountered the Starbucks story in late April 2004 when it turned up in our inbox.", "We got in touch with the e-mail's writer and asked him about the events that led to his penning the note about Starbucks' response to Marines who had come to them looking for a donation of coffee. Sgt. Wright heard the story from a friend, who had gotten it from someone else. He talked things over with the Marine who had supposedly contacted Starbucks, and that, coupled with that night's televised news about the goings on in Iraq, made his blood boil. He pounded out his thoughts into the form of an e-mail, which he mailed to ten of his friends.", "It is that e-mail which continues to circulate to this day. Sgt. Wright has since learned that what he heard was in error, and he has subsequently tried to set things right by issuing the following retraction:", "Dear Readers,", "Almost 5 months ago I sent an email to you my faithful friends. I did a wrong though that needs to be cleared up. I heard from word of mouth about how Starbucks said they didn't support the war and all. I was having enough of that kind of talk and didn't do my research properly like I should have. This is not true. Starbucks supports the men and women in uniform. They have personally contacted me and I have been sent many of their Company's policy on this issue. So I apologize for this quick wrong letter I sent out to you. Now I ask that you all pass this email around to everyone you passed the last one to. Thank you very much for understanding about this.", "Howard C. Wright\nSgt USMC", "Sgt. Wright has been unable to produce the reply his buddy supposedly received from Starbucks, and the folks at Starbucks deny engaging in any correspondence on such matter prior to this rumor coming along. Given that no copy of the letter appears to exist, neither one resting in the hands of the Sergeant's comrade, nor one residing in Starbucks' files, the rumor about the java vendor's harsh response to a coffee-hunting Marine should be dismissed.", "As for what Starbucks has to say about the matter, they have long since refuted the rumor on their website, stating:", "On behalf of Starbucks' more than 140,000 dedicated partners (employees), we want to set the record straight on an old rumor concerning Starbucks lack of support for the military and our troops. This rumor, dating back to 2004, claims a lack of Starbucks support for the U.S. Marines, and has evolved to include a lack of support for the British Royal Marines. In both instances, the rumor is not, and has never been, true.", "When Starbucks learned of the original email, we immediately contacted the author, a Marine Sergeant, who subsequently sent an e-mail to his original distribution list correcting the mistake. Unfortunately, rumors have a way of continuing even after the truth has been revealed.", "At Starbucks, we respect the efforts of the men and women who serve their country in the military, including our fellow partners who serve during this time of war. In fact, Starbucks has partnered with the American Red Cross and the United Service Organizations (USO) to provide coffee to relief efforts during times of conflict, donating more than 141,000 lbs of coffee and over one million 3-packs of Starbucks VIA®. Additionally, troops all over the world are enjoying Starbucks VIA® Ready Brew in care packages they receive not only from Starbucks, but from their family and friends as well. In 2011, Starbucks provided over 220,000 3-packs of Starbucks VIA® to the USO for their care package program.", "Although Starbucks does not themselves directly donate to military personnel, they do get their coffee into the hands of those serving in the U.S. armed forces through their partnership with the USO.", "Under the terms of the Starbucks' corporate giving policy, had such a request as presented in the much-circulated e-mail been made, the coffee giant would have had to say no to it. Such a refusal would have been in keeping with the corporation's donations policy, in that Starbucks chooses to direct their charitable resources within the global community through grants from The Starbucks Foundation programs and to communities where its stores are located through local involvement. According to the guidelines in place at the time, a request for coffee from soldiers serving overseas would have been turned down.", "However, while it is true Starbucks as a corporate entity could not have donated coffee to java-seeking Marines, it would have passed along such a request to any number of its employees looking for military mailing addresses to send product to, as they have already done on many occasions. Starbucks partners receive one pound of free coffee each week as an employee benefit (known as \"partner mark-out\"). Many of them have elected to send their weekly mark-out to members of the military or military families, and related organizations.", "The claim that Starbucks would ever have said \"they don't support the War and anyone in it\" is false, in light of what various news accounts show us about the coffee retailer's attitude towards those who serve in the armed forces. In addition to what Starbucks themselves say of their beneficences to soldiers, we know from different newspaper articles of other instances of glad-hearted support. In July 2004, a Starbucks in Cincinnati was reported to have been practically overflowing with people making yellow ribbons in support of Keith \"Matt\" Maupin, a soldier whose fate was then uncertain (it has subsequently been reported that his remains have been found and positively identified), along with red, white, and blue ones to show support for American troops in Iraq. In June 2004 in Cleveland, when the mother of one serviceman called her local Starbucks to arrange for the shipping of some java to her son, the employees at that store insisted on paying for 30 pounds of coffee as their gift.", "As to another of the claims made in the e-mail, while it is true someone working at a New York City Starbucks did indeed charge ambulance workers $130 for three cases of water on September 11, 2001, it would not be quite fair to say Starbucks did this. However, act of a single, misguided employee or not, the corporation alone bears responsibility for afterwards spurning a number of opportunities to offer the rescue workers their money back or apologize to them — though the coffee giant finally took both those actions, they did so only after the story attracted online and print media attention.", "In addition to the \"rescue workers charged for water\" and the \"spurned servicemen\" story that is the focus of this piece, Starbucks has been the butt of a number of other unsavory rumors and mistaken beliefs just in the past few years, including:", "Starbucks, like any other successful corporation that has a strong public presence, is fated to operate with the Damocles sword of public opinion hanging above its head. No corporation can fund everyone who comes to it looking for assistance, which means some deserving groups will always be refused. In less emotionally-charged times, the logic of such a policy is better understood, but the current climate makes it a dicey public relations proposition at best to say no to anything having to do with soldiers.", "Variations:   An April 2007 version of this rumor changed Starbucks to Oscar Mayer and coffee to hot dogs. In response, Oscar Mayer posted a denial on its web site:", "False Rumor: Oscar Mayer doesn't support the troops.", "The email hoax above is currently in circulation but completely false. We do support the troops, in fact, Kraft Foods/Oscar Mayer has donated products to the U.S. troops in Iraq. We work with the military to ensure favorite Kraft products are available where our troops are stationed. Due to security and logistic concerns, the military requests that all product go through previously established channels. This ensures our donations are safely delivered where needed.", "Then what is that internet statement and how did it get started?", "We don't know how the internet statement originated as we work through approved channels to accommodate military requests as appropriate.", "Crump, Sarah.   \"Reality Series Turns Mentor Native into Latino Pop Star.\"\r\n    [Cleveland] Plain Dealer.   22 June 2004   (p. E2).", "Hussain, Mohammad.   \"Web Site, Ribbons Stir Hope for Missing Reservist.\"\r\n    Dayton Daily News.   4 July 2004   (p. B3).", "CNN.   \"Body Found of Ohio Soldier Missing in Iraq.\"\r\n    30 March 2008.", "Starbucks.   \"Corporate Statement: Military Donations.\"\r\n    8 August 2004.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]