["“Now Hiring,” says a post shared more than 2,800 times on Facebook since April 9, 2020 which includes multiple toll-free phone numbers for corporations ranging from delivery giant FedEx to the office supply store Staples.", "“You may not need it, but REPOST for someone who does. This could be someone’s blessing today,” a similar post, liked more than 1,100 times since March 29, 2020 on Instagram, encourages readers.", "The posts were shared across social media as millions of Americans filed for unemployment benefits after “stay at home” orders shuttered businesses across the country.", "AFP Fact Check dialed the listed numbers. None connect job seekers with hiring information. Here is what the companies mentioned said about finding current openings.", "The 877 number listed for FedEx is a general number for the company, not one associated with hiring.", "“As FedEx continues to power e-commerce and deliver critical supplies to the communities that need them most, we continue to hire and encourage anyone interested in a career at FedEx to visit careers.fedex.com for available positions in their area,” the company said in a statement provided to AFP by email.", "The 877 listing for Home Depot is “not an accurate phone number,” Christina Cornell of the building supply company told AFP.", "It answers with an offer of a “special promotion” and goes on to promise “free roadside assistance.”", "“People interested in finding a job with The Home Depot can visit www.careers.homedepot.com,” Cornell said in an email.", "The 888 number listed for UPS is not affiliated with the delivery company. When contacted, it answers by asking callers if they or someone in their home is “50 years of age or older.”", "“If people are looking for employment with UPS, they should visit the UPS Jobs website at www.upsjobs.com where they can search for open positions in their local area as well as apply online for available jobs,” the company recommended in a statement.", "The 800 number listed for Verizon answers with a recording telling callers to visit a website that is not an official company site.", "“This number is not associated with Verizon,” according to Kimberly Ancin, Director of Corporate Communications for Verizon.", "The Verizon career website is available here.", "The 800 number listed for Staples is a number to place, track or return orders. It is not a hiring hotline.", "Job openings at Staples can be found online here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]