["By Robert Farley", "Posted on May 10, 2019", "After the Colorado school shooting, Democratic presidential candidate Beto O’Rourke advocated universal background checks for gun purchases, claiming that state laws mandating universal checks “have been shown to reduce gun violence by 50 percent.”", "But academic research doesn’t support that.", "O’Rourke’s campaign said the statistic came from Everytown for Gun Safety, but the gun-control group told us it has updated its background material on the issue in light of “rigorous” new research that has “improved our understanding of this.”", "A study published in the Journal of General Internal Medicine in March found that universal background checks are associated with about a 15 percent reduction in firearm homicide. But the study stopped short of concluding that the decline was caused by those laws.", "Federal law requires background checks on those who buy guns from federally licensed firearm dealers. There have been attempts in Congress to require universal background checks — which would cover private sales by unlicensed individuals, including some sales at gun shows and over the internet — but the policy has failed to gain enough support to pass.", "The Manchin-Toomey amendment, proposed in 2013 after the Sandy Hook Elementary School shooting, came close in a 54-46 procedural vote in the Senate. But the sponsors, Sen. Joe Manchin, a Democrat, and Sen. Pat Toomey, a Republican, needed 60 votes for the bill to advance for a final Senate vote.", "Responding to the recent school shooting in Colorado, O’Rourke said he supports universal background checks, but overstated the effectiveness of such laws in states that have adopted them. An O’Rourke campaign aide tweeted about O’Rourke’s remarks on gun violence in Fayette, Iowa.", "O’Rourke, May 7: Those students who walked out of their schools to protest this gun violence, who led the Marches for Our Lives, those moms who demand action, are forcing the conversation that this country needs to have, are ensuring that the silence, the complicity purchased by the NRA, the gun lobby, the political action committees, is defeated and that we finally get action on universal background checks, which in those states that have adopted them, have been shown to reduce gun violence by 50 percent, ensuring that we no longer sell weapons designed and engineered and sold to the United States military for the express purpose of killing people effectively, efficiently and in as great a number as possible, because that’s exactly what they do.", "It is a statistic that O’Rourke has cited repeatedly in the past.", "O’Rourke’s statistic comes from research released by Everytown for Gun Safety in 2015 that found “nearly 50 percent fewer police murdered with guns, women shot to death by intimate partners in states with background checks.”", "Everytown compared the number of law enforcement officers killed with handguns over a 12-year period in 13 states that require universal background checks and 36 states that do not.", "“Law enforcement officers are 48 percent less likely to be killed with handguns in states that require background checks for unlicensed, ‘private’ handgun sales than in states that do not,” a press release on the study states.", "Everytown did a similar comparison for the number of women killed with guns by current or former male partners over a five-year period.", "“Controlling for population, there are 46 percent fewer intimate partner gun homicides of women in states that require background checks for private handgun sales than in states that do not,” the group concluded.", "But determining that states with universal background checks have lower rates of certain types of violence is not the same as proving that universal background checks have been “shown to reduce gun violence by 50 percent” — the phrase used by O’Rourke.", "More recent research looked at the change in gun violence rates after states passed (or got rid of) universal background checks.", "A study led by Boston University Community Health Sciences Professor Michael Siegel and published in March in the Journal of General Internal Medicine looked at homicide and suicide rates in all 50 states over a 26-year period and analyzed the relationship between various firearm laws, including universal background checks. The research found that universal background checks are associated with about a 15 percent reduction in firearm homicide.", "“After reviewing the overall literature, I would estimate that the association is somewhere between a 10% and 15% reduction,” Siegel told us via email. “So the 50% claim sounds exaggerated. I’m not sure what data would support that.”", "Siegel, who has extensively studied gun violence, noted that his research found an “association” between universal background checks and reduced homicide rates, “but did not definitively conclude causality.”", "“I think that we are not quite at the level of research when we can conclude there is a causal relationship, but we’re probably close,” he said. “If there are a few more studies confirming this relationship, then I think the results will be robust enough to conclude causality with a reasonable degree of confidence. But I don’t think we’re quite there yet.”", "Siegel said states that have lower firearm violence rates to begin with are the ones that tend to pass laws requiring universal background checks. He and the other researchers who participated in the study “tried to account for that by looking at CHANGES in homicide rates over time from before to after these laws, while comparing the changes with those in other states during the same time period,” he said.", "Siegel said he’d like to see another study or two confirm their research using similar methods before concluding causality.", "In 2018, the RAND Corporation released several reports as part of its Gun Policy in America initiative, including one on the “Effects of Background Checks on Violent Crime.” The review identified eight studies since 2003 that examined the relationship between background checks and violent crime, and that met its research criteria. The report concluded, “Evidence that background checks may reduce violent crime and total homicides is limited, and studies provide moderate evidence that dealer background checks reduce firearm homicides. Evidence of the effect of private-seller background checks on firearm homicides is inconclusive.”", "A spokesman for Everytown for Gun Safety told us it has updated its information page about universal background checks as a result of new research.", "“The rigorous research that’s come out since that release has improved our understanding of this, and we replaced the statistics from that (2015) release in more recent materials, including the background checks page,” Adam Sege, a spokesman for Everytown for Gun Safety, told us. “Given that the 2015 release is still being cited when newer research is available, we’re in the process of updating that release page to direct visitors to our current background checks page.”", "David Hemenway, director of the Harvard Injury Control Research Center and the Harvard Youth Violence Prevention Center, told us it is notoriously difficult for researchers to tease out the effects of various gun policies in states that often have a combination of policies. Results are further complicated because some states with strong gun policies are bordered by states with, say, universal background checks, while others are not.", "“It’s just so hard to control for everything,” Hemenway said.", "A 2017 paper he co-authored that reviewed the available peer-reviewed research on gun control laws from 1970 to 2016 “found evidence that stronger firearm laws are associated with reductions in firearm homicide rates” and the “strongest evidence is for laws that strengthen background checks and that require a permit to purchase a firearm.” But a reduction in violence of 50 percent “seems much, much too high to me,” he said.", "Hemenway noted that one study published in 2016 in The Lancet concluded that “federal-level implementation of universal background checks for firearm purchase could reduce national firearm mortality from 10.35 to 4.46 deaths per 100,000 people.” But Hemenway cautioned to “take that [study] with a grain of salt,” adding that he doesn’t buy its conclusion.", "Siegel also cautioned that because of the study’s single-year, cross-sectional design, “it is actually impossible to tell whether states with lower homicide rates were more likely to enact universal background check laws or whether the laws resulted in the lower homicide rates.” (Cross-sectional studies are a one-time measure of exposure and outcome in a population, and can be used to form a hypothesis about causality, but cannot prove causality.)", "In general, Hemenway said, academic research shows that states that have stronger gun laws tend to do better on gun violence. And the recent study authored by Siegel suggests federal universal background checks might (though the authors can’t say for sure) help reduce gun crime.", "But there’s no academic research supporting the idea that state universal background checks have cut gun violence in half in those states.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]