["About this rating", "Nickelodeon has produced news segments on political events, including the impeachment of Trump.", "These were not real images showing Nickelodeon's coverage of Trump's second impeachment trial, however. They were created as a joke.", "On Feb. 10, 2021, as U.S. Rep. Jamie Haskin and the other House impeachment managers laid out their case in an effort to show that U.S. President Donald Trump had incited an insurrection at the Capitol on Jan. 6, a photograph started to circulate online that supposedly showed Nickelodeon's coverage of the historic event:", "This is not a genuine screenshot of Nickelodeon's impeachment coverage.", "While this may have raised a few skeptical eyebrows for some (for others it was likely an obvious joke from the start), the second picture posted by comedian Jesse McClaren made it clear that these images were created in jest. The second photo (which can be seen here) shows Trump's lawyer Bruce Castor covered in green slime.", "To our knowledge, no one was slimed during the impeachment trial.", "These images did not come from Nickelodeon's coverage of the impeachment trial.", "However, the children's network has covered political events in the past. For more than two decades starting in 1992, Nickelodeon aired a program called \"Nick News with Linda Ellerbee\" that covered a wide range of topics, including sexism, global warming, hate crimes, and presidential elections. Although this show went off the air in 2015, Nickelodeon still produces \"news\" segments on social media.", "In January 2021, the children's network produced two segments related to Trump's second impeachment. The first covered the riots at the U.S. Capitol on Jan. 6:", "The second covered Trump's impeachment:", "Nickelodeon is not providing live coverage of Trump's second impeachment trial, the network did not digitally edit Sponge Bob Square Pants into the Senate chamber, and they did not release any of their signature green slime on any politicians. However, while Nickelodeon is not known as a news network, they do occasionally produce segments related to current events.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]