["The online report contains a video which it claims shows Coco Martin, the lead actor who plays a cop on the primetime TV program “Ang Probinsyano” (called “Brothers” on Netflix) being arrested by the Philippine Drug Enforcement Agency (PDEA).", "“Ang Probinsiyano” was criticized by the leadership of the Philippine National Police (PNP) in November 2018, according to local media reports here, for supposedly giving a “bad impression” of cops as it also portrays the police chief as a villain.", "The PNP also reportedly issued a memorandum ordering police personnel to withdraw their support for their program by not providing equipment, such as police cars and firearms, to help with filming.", "The misleading online report has been shared on Facebook here. Below is a screenshot of the Facebook post dated June 14:", "The text in the screengrab, when translated to English, says: THE ACTOR OF THE TV PROGRAM \"THE MAN FROM THE PROVINCE\" COCO MARTIN WAS ONE OF THOSE ARRESTED BY PDEA", "PDEA is the lead government agency which investigates offenses related to the use and sale of illegal drugs.", "A reverse image search using Bing traced the photo of the man in the upper right portion of the post to this article on PEP.ph, a local entertainment site.", "The article is about Martin’s program and its guests. Below is a screenshot of the report:", "The actual online report contains a video, which when clicked plays only for 12 seconds. An ad prompt like the one below then appears:", "AFP extracted the hyperlink of the video, which leads to this news report by local broadcast organization GMA News uploaded on April 3, 2019.", "The news report is about the arrest of two women suspected of selling Methamphetamine HCL or what is more commonly known as shabu in the Philippines.", "Below is a screengrab of the original news report:", "The spokesman of PDEA said Martin has not been arrested for any drug-related offense.", "“Checked our reports. Negative so far,” PDEA spokesman Derrick Arnold Carreon said in a text message to AFP on June 19.", "The misleading online report can also be seen here.", "It has been shared 217 times on different Facebook accounts.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]