["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "• This 2017 quote is being shared out of context.", "• Lemonis was talking about people “in favor of what has been said in the last couple days,” referring to Trump’s comments in the aftermath of the Charlottesville white supremacy clases.", "• He did not tell Trump supporters not to shop from Camping World.", "Camping World CEO Marcus Lemonis apologized back in 2017 for telling people who agreed with President Donald Trump’s remarks in Charlottesville, Va., \"don’t shop at my business.\"", "But the internet never forgets.", "Even now, more than two and a half years after white supremacy groups protested the removal of a Robert E. Lee statue, supporters of Trump are sharing a familiar image created after Lemonis’ August 2017 interview on CNBC with #boycottCampingWorld.", "The post shows Lemonis’ face next to the Camping World logo with text that says the following:", "To President Donald Trump Supporters:", "\"Frankly, don’t shop at my business.\"", "-Marcus Lemonis CEO", "This is an exaggeration of what Lemonis said in a CNBC interview. The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "At the time, CEOs were leaving White House advisory councils in protest of Trump’s response to the situation. (Trump quickly dissolved the councils.) Trump said of the white supremacists and counterdemonstrators in Charlottesville, \"You had some very bad people in that group, but you also had people that were very fine people, on both sides.\"", "Trump’s comment came Aug. 15, 2017, three days after a man from Unite the Right rammed his car into a crowd after the rally, killing Heather Heyer and injuring 19 others.", "RELATED: In Context: Donald Trump’s ‘very fine people on both sides’ remarks (transcript)", "The day after Trump’s press conference, Lemonis went on familiar territory at CNBC, where he anchored \"The Profit\" on the same cable channel.", "Lemonis, who was not a member of a White House advisory council, told the CNBC host he was \"horrified\" by the administration’s response and was concerned about some CEOs \"dancing on the fence\" out of fear. Then the host asked how he would weigh the fear of customer retaliation for criticizing Trump.", "\"There’s no doubt that there is probably not many consumers in this country today that are in favor of what has been said in the last couple days and if they are, quite frankly, don’t shop at my business,\" he said. \"And I think that the reality of it is that there is a fear, a fear of retribution.\"", "The CNBC headline was born: \"Marcus Lemonis: If you’re OK with what Trump said, don’t shop at my business\"", "Reading his comments in context, Lemonis was not telling all Trump supporters not to shop at his store. He was talking about consumers who agreed with what \"has been said in the last couple of days,\" with a focus on Trump’s comments.", "A few days later, Lemonis made a live video to defend himself from the blowback, though he made a revision to what he actually said. \"What I said is that if you were okay with what happened at Charlottesville, with what was said and what was done, I am not OK with it,\" he said. He added he would not change his position no matter how much it hurt him.", "On Aug. 25, 2017, CNBC reported on Lemonis’ apology for the mistake of \"not being clear.\"", "\"As the CEO of a business, I am responsible to take care of the people that work there. I opened my mouth and put them in harm’s way. While I know, that (sic) the headline published was taken out of context and I have to live with that. There should have never been a headline and (sic) I gave a chance to live.\"", "But #BoycottCampingWorld lives on, boosted by this misleading image.", "The claim that Lemonis told Trump supporters broadly not to shop at his store has an element of truth, but it ignores critical facts that would give a different impression. We rate it Mostly False.", "Facebook post, Feb. 1", "CNBC, \"Marcus Lemonis: If you’re OK with what Trump said, don’t shop at my business,\" Aug. 16, 2017", "CNBC, \"Camping World CEO Marcus Lemonis apologizes for making Charlottesville remarks,\" Aug. 25, 2017", "Twitter, #BoycottCampingWorld", "PolitiFact, \"In context: Donald Trump’s ‘very fine people on both sides’ remarks,\" April 26, 2019", "Snopes, \"Did the CEO of Camping World Tell Trump Supporters Not to Shop at His Stores?\" Aug. 23, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]