["A collage of two photographs is currently viral on social media. The photographs were taken during the violence that followed the recent Bharat Bandh called by Dalit organizations to protest Supreme Court’s dilution of the provisions of the SC/ST (Prevention of Atrocities) Act. Both photographs show the same man with a gun but his beard is longer in the image from Zee TV as compared to the image of NDTV. Many social media users have suggested that the image has been photoshopped to show a visibly Muslim looking man holding a gun. What is the truth behind these images? Let us find out….", "तेल देखिये और तेल की धार देखिये…. @ndtv से @ZeeNews के स्टूडियो में ख़बर पहुंचते पहुंचते इस व्यक्ति की दाढ़ी इतनी बढ़ गयी कि आप मुस्लिम बोलकर गाली दे सकें…बाकी सब खैरियत है….!!pic.twitter.com/OlPmJyIKyM", "— काकावाणी (@AliSohrab007) April 6, 2018", "Alt News accessed the footage from various channels to uncover the truth behind the images.", "Zee used the video of the same person multiple times across different shows. In all of these broadcasts, the person is circled and his picture is zoomed in. From one of the videos, we took a screen-grab which can be seen below. The timestamp on the top left has been added programmatically and isn’t present in the original footage.", "In case of NDTV and ABP, they have also used the same base video as Zee News did. However, the moment the clip is frozen and zoomed in, the longer beard as it could be seen in the Zee News video cannot be seen here.", "In case of CNN-IBN, atleast in the tweet that they posted online, they do not freeze the video. This person who is being zoomed-in in the above channels namely NDTV, Zee and ABP is visible in the first 2 seconds of the video below. Also, in the CNN IBN footage, immediately after this person who’s the focus of the story is seen, Raja Singh Chauhan who allegedly fire shots in Gwalior can be seen.", "#BREAKING — #DalitProtests takes an ugly turn in Gwalior, Madhya Pradesh; Man fires gunshots amid protests #BharatBandh", "LIVE UPDATES: https://t.co/3vTX82rHsN pic.twitter.com/CybwgmpXxG", "— News18 (@CNNnews18) April 2, 2018", "https://platform.twitter.com/widgets.js", "Since CNN-IBN’s video was closest to the original without any special effects, we used this to analyze the issue by splitting the video into multiple frames (60 frames per second). What we found was that in case of the CNN-IBN video, the person in various frames seemed to have beards of varying lengths. As can be seen in the below collage, in the 1st, 2nd, 3rd and 6th frame, the person’s beard doesn’t appear to be long. However, in the 4th and 5th frame, the person’s beard appears to be much longer.", "In the base video used by CNN-IBN, possibly because of a glitch in videography and because of camera’s shutter speed, there are a few frames wherein the person appears to have a longer beard than he actually does. However, in rest of the frames, the person’s actual size of the beard can be clearly seen.", "When we converted Zee News’s videos into individual frames (15 frames per second), we saw that the frames in which this person’s beard appears normal are absent in their video. Instead, they have chosen the frame where the person appears to have a longer beard and zoomed into that particular frame.", "So does the man have a short beard as shown by NDTV or a longer beard as shown by Zee News? Has the image been photoshopped by one of the channels? The answer is that Zee News hasn’t manipulated the image as alleged. All the channels including Zee News have used the same base video. However, Zee News chose to freeze their video on the frame when a distorted image of the person with a longer beard can be seen.", "In conclusion, Zee News did not photoshop/manipulate/morph the footage. The image with the longer beard is part of the base video. However, the reason as to why they chose to freeze the video and focus on a distorted version of the image cannot be ascertained. It is impossible to tell whether this was deliberate or simply a case of poor editing.", "Donate Now", "Follow @free_thinker", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]