["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "U.S. President Donald Trump and Russian President Vladimir Putin shake hands during their meeting in the Presidential Palace in Helsinki on July 16, 2018. (AP)", "Russian President Vladimir Putin claimed Russia has never interfered in American politics during a joint press conference with President Donald Trump, despite all evidence to the contrary.", "Putin’s assertion came on July 16, just days after Special Counsel Robert Mueller indicted a dozen Russian intelligence officials for meddling in the 2016 U.S. election.", "\"The Russian state has never interfered and is not going to interfere into internal American affairs including election process,\" Putin said following a one-on-one meeting with Trump in Helsinki, Finland.", "Trump, for his part, appeared to take his Russian counterpart at his word.", "\"President Putin says it's not Russia,\" Trump said. \"I don't see any reason why it would be.\"", "But the U.S. intelligence community, House and Senate panels led by Republicans, the special counsel’s team and members of Trump’s own administration have endorsed the view that Russia has interfered in American politics, in a practice that dates as far back as the Soviet era.", "As we wrote in our story naming the 2017 Lie of the Year — Trump’s claim that Russian election interference is a \"made-up story\" — a mountain of evidence points to the fact that Russia meddled in the 2016 U.S. presidential election.", "In a January 2017 assessment, the CIA, FBI, NSA and Director of National Intelligence — referred to as the the intelligence community — concluded that Russia intervened to help Trump’s election chances while hurting those of Hillary Clinton.", "Intelligence agencies have said the Kremlin directed the cyber-theft of private data, the placement of propaganda against particular candidates, and an overall effort to undermine public faith in the U.S. democratic process.", "A Senate panel that independently reviewed the intelligence community’s assessment backed up its findings, concluding July 3 that the agencies’ joint assessment was a \"sound intelligence product.\" The House Permanent Select Committee on Intelligence also said Russia conducted cyberattacks on U.S. political institutions during the 2016 campaign.", "Fresh evidence of Moscow’s election interference emerged in indictments stemming from the special counsel’s investigation.", "On July 13, Mueller charged 12 Russian intelligence officers for their role in the hacking of the Democratic National Committee, the Democratic Congressional Campaign Committee and the Clinton campaign, and subsequently leaking stolen emails and documents.", "In this latest indictment, the special counsel alleged that units operating under Moscow’s military intelligence agency conducted cyber operations that involved \"the staged releases of documents\" obtained through targeted computer hacking.", "\"These units conducted large-scale cyber operations to interfere with the 2016 U.S. presidential election,\" the indictment states.", "Previously, the special counsel charged 13 Russians and three Russian entities with conspiring to defraud the United States and interfere with the 2016 presidential election.", "Members of Trump’s own administration have endorsed a view at odds with the president.", "Then-CIA director Mike Pompeo — now secretary of state — said in November 2017 that he stands by the intelligence community’s January 2017 findings that Russian cyber-meddling sought to help Trump and hurt Clinton.", "Following Mueller’s first indictment against Russian hackers in February, Trump’s then-national security adviser H.R. McMaster called the evidence of Russia’s interference in the 2016 presidential election \"incontrovertible.\"", "Dan Coats, Trump’s top intelligence official, told lawmakers in February, \"There should be no doubt that (Putin) views the past effort as successful.\"", "Coats, the director of National Intelligence, also issued a stern warning days before Trump’s meeting with Putin in Helsinki. He compared the current threat of more Russian cyberattacks to warning signs before the September 11 attacks that killed nearly 3,000.", "\"It was in the months prior to September 2001 when, according to then-CIA Director George Tenet, the system is blinking red,\" Coats said. \"And here we are nearly two decades later, and I'm here to say, the warning lights are blinking red again.\"", "In light of Putin’s blanket denial, we took a fresh look at Russia’s election-meddling past.", "Historians said the 2016 election was the first known example of a Russian attempt to sway a U.S. election in favor of a specific candidate, though there could have been additional attempts that remain classified or undiscovered.", "\"If by ‘Russia’ one means post-1991 Russia, that statement (from Putin) appears to be correct based on publicly available information,\" said Lucan Way, a University of Toronto professor specializing in democratization and authoritarianism in the former Soviet Union.", "But that does not mean the 2016 meddling was unprecedented. Way noted that Russia has frequently interfered in the elections of post-Soviet countries since the fall of the Soviet Union.", "Further, the Soviet Union worked in secret to help or hurt U.S. candidates at least four times during the Cold War era.", "\"What we are seeing with Russia's active measures today are ‘unprecedented’ in that they use new tools and technologies … but the ends are very much older, and are straight from the KGB playbook,\" said Calder Walton, an expert in intelligence history and international relations at Harvard University’s Kennedy School of Government. \"One can't understand Russian active measures to interfere in the 2016 election without understanding the long KGB history.\"", "In 1960, for example, Soviet Premier Nikita Khrushchev offered Adlai Stevenson assistance from a secret propaganda campaign. Stevenson declined the offer and ultimately lost in the Democratic primary to John F. Kennedy.", "In 1968, Anatoly Dobrynin, the Soviet ambassador to the United States, offered to secretly fund for Hubert Humphrey’s campaign against Richard Nixon, but Humphrey rejected the bribe.", "In 1976, the KGB opened a smear campaign against anti-communist Democrat Henry \"Scoop\" Jackson, forging FBI paperwork to make it seem that Jackson was gay and distributing the fake reports to U.S. newspapers both during and after the election.", "But Walton said Soviet interference efforts became most active in the 1980s against Ronald Reagan, pointing to a now-public cache of top-secret KGB records called the Mitrokhin Archive.", "The KGB sought compromising material on Reagan in 1976 and planted some anti-Reagan articles in foreign newspapers. Ahead of the 1984 election, the KGB also worked to discredit Reagan’s policies and popularize the slogan \"Reagan Means War\" around the world.", "\"There is a long history of the Kremlin interfering in internal U.S. affairs, including elections,\" Walton said. \"This included gathering compromising material on U.S. politicians, supporting Kremlin-favored candidates in U.S. elections, spreading forgeries and disinformation campaigns to inculcate distrust among the U.S. population in their government and Western allies.\"", "Walton added that Putin’s claim is \"nonsense.\" We've reached out to the Russian embassy and will update the fact-check if we hear back.", "Putin said, \"The Russian state has never interfered ... into internal American affairs including election process.\"", "A mountain of evidence testifies to the fact that Russia meddled in the 2016 U.S. presidential election. The U.S. intelligence community and a Republican-led Senate panel concluded independently of each other that Kremlin-directed operatives stole private data, used propaganda against particular candidates, and engaged in an overall effort to undermine public faith in the U.S. democratic process. A Republican-led House panel found in its own investigation that Russia conducted cyberattacks during the 2016 campaign.", "These findings are supported by indictments stemming from the special counsel’s investigation.", "There is no public evidence to suggest that the post-Cold War Russian government had previously interfered in a U.S. election at levels near the 2016 meddling, but the Soviet Union made several attempts to do so prior to its collapse in 1991.", "We rate this Pants on Fire.", "PolitiFact, \"2017 Lie of the Year: Russian election interference is a 'made-up story,'\" December 12, 2017", "Prospect Magazine, \"Active measures\": a history of Russian interference in US elections,\" December 23, 2016", "The Washington Post, \"Russia has been meddling in foreign elections for decades. Has it made a difference?\" January 8, 2018", "PolitiFact, \"Here's every time Russian or Soviet spies tried to interfere in US elections. How does 2016 compare?\" June 20, 2017", "The Hill, \"CIA: Director 'stands by' Russian interference assessment,\" Nov. 11, 2017", "Politico, \"McMaster: ‘Incontrovertible’ evidence of Russian interference in election,\" Feb. 17, 2018", "USA Today, \"'The United States is under attack': Intelligence chief Dan Coats says Putin targeting 2018 elections,\" Feb. 13, 2018", "Email interview with Calder Walton, Ernest May Fellow in History and Policy at Harvard University’s Kennedy School of Government, July 16, 2018", "Email interview with Lucan Way, professor of political science and co-director of the Petro Jacyk Program for the Study of Ukraine at the University of Toronto’s Centre for European, Russian and Eurasian Studies, July 16, 2018", "Email interview with Nicole Hemmer, expert on the history of American politics and media and assistant professor in presidential studies at the University of Virginia’s Miller Center, July 16, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]