["About this rating", "On March 3, 2021, a left-leaning Twitter account posted the below-displayed image that alleged the Georgia House of Representatives approved legislation that would allow law enforcement officers to criminalize volunteers who give free food or water to voters standing in line at polling sites on Election Day.", "The claim was true.", "Before we address the bill directly, some context: Because some people in the state's urban areas must often wait in long lines to cast ballots, voting rights groups and other volunteers have served pizza, chips, hot chocolate, and other food to keep people comfortable and prevent them from leaving before they vote. However, according to Secretary of State Brad Raffensperger, the so-called \"line warming\" violates existing Georgia law governing governing voter intimidation at polls.", "He wrote in a news release sent around the 2020 presidential election:", "Political organizations or advocacy groups will use the giveaways or gifts, known as “line warming,” to inappropriately influence voters in the crucial final moments before they cast their ballots. Such efforts violate the protections Georgia law has placed on campaigning near a polling location or voting line and the prohibitions on providing rewards to voters that were enacted to stop pay-for-vote schemes.", "Raffensperger, a Republican, said he sent reminders to poll workers to watch for any groups campaigning or trying to get people to vote against their preferences -- with or without food -- near polling sites.", "So, considering the fact that existing Georgia law prohibits people from attempting to pressure in-line voters to cast ballots against their preferences, a spokesperson for Raffensperger told Snopes that the 2021 bill about food-giving appeared to address this loop hole in the existing law: voting-rights groups could legally supply free food or water to voters if they made the amenities available to everyone, including election judges and passerby.", "\"The language in the bill is targeting people who try to take advantage of that loop hole,\" he wrote. \"But any effort to provide gifts of any kind to voters particularly is already against Georgia law.\"", "(We reached out to multiple authors of the legislation, but no one responded to our inquiries.)", "Cue the Georgia General Assembly's actions in March 2021. Two days before @ReallyAmerican1 posted the above-displayed tweet, the Republican-led House voted 97-72 to approve a policy package to overhaul election and voting laws in the state (HB 531), according to legislative records.", "All said, the measure was designed to update existing state provisions to include the following underlined language, among other changes, according to a copy of the bill obtained by Snopes:", "In other words, the legislation updates existing provisions to explicitly give officials legal authority to penalize people with misdemeanors if they are caught, for whatever reason, providing free food or water to voters within 150 feet of a building where people are casting ballots.", "The measure eventually became law. On March 25, Georgia Gov. Brian Kemp signed the wide-sweeping policy package that included the above-displayed language. (Here's the full text of the law.)", "In addition to barring outside groups from giving out food and water to voters waiting in line, the law requires a photo ID in order to vote absentee by mail and shortens the time people have to request an absentee ballot, among other changes.", "Voting rights groups and Democrats protested the changes, framing them as restrictive measures to discourage Georgia residents of color from voting after Donald Trump's 2020 election loss to Joe Biden.", "\"Clearly, the attack is based on when it is and how it is that they know Black voters are being mobilized to turn out,\" said Cliff Albright, co-founder of the Atlanta-based Black Voters Matter, to CNN, in early March. \"They know that they can't win elections if we actually expand access to voting or even if we just maintain it.\"", "In sum, considering the fact the Georgia House on March 1, 2021, approved a bill to update misdemeanor offenses at polls to include \"the giving of any money or gifts, including but not limited to, food and drink,\" based on legislative records, we rate this claim \"true.\"", "This report was updated to include information from a spokesman for the Georgia Secretary of State, which clarified the intention and potential impact of the legislation.", "This report was updated after Georgia Gov. Brian Kemp signed the measure into law.", "Jessica Lee is Snopes' Senior Assignments Editor with expertise in investigative storytelling, media literacy advocacy and digital audience engagement.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]