["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "The nomination of U.S. District Court Judge Brett Kavanaugh to the U.S. Supreme Court has set off a scramble to define where he stands on key issues. Fox News legal pundit Judge Andrew Napolitano gave his take the morning after President Donald Trump announced his pick.", "\"He’s pro-life,\" Napolitano said on Fox News’ Fox and Friends on July 10. \"He’s pro-gun. He’s pro-police, which rankles civil libertarians. He’s also pro-Obamacare.\"", "Napolitano’s last point sounded like a break from the other conservative credentials: Does Kavanaugh really support the health care law that Trump and Republicans have vowed to repeal?", "Napolitano told us that Kavanaugh revealed his position in a 2011 case that challenged a key piece of the Affordable Care Act: the individual mandate and the penalty that came with it.", "But conservatives split on the implications of Kavanaugh’s opinion in that case, and the legal scholars we reached said they don’t discern overall leanings one way or the other.", "In the case of Seven-Sky vs. Holder, a group of taxpayers argued that the health care law’s requirement to buy health insurance went beyond the legitimate power of Congress.", "\"In a 2011 published opinion on the Affordable Care Act, Judge Kavanaugh declined a reasonable opportunity to invalidate it and voted to dismiss the challenge,\" Napolitano told PolitiFact.", "Two out of the three appellate judges rejected the challenge outright, saying that the mandate was allowed under the Constitution’s Commerce Clause.", "In his dissent, Kavanaugh shot down the challenge but pointedly avoided ruling on the plaintiffs’ big issue.", "\"I do not take a position here on whether the statute as currently written is justifiable under the Taxing Clause or the Commerce Clause,\" he wrote.", "Instead, he rejected the claim based on tax law.", "He said the suit itself was flawed because an 1867 law — the Anti-Injunction Act — blocks courts from ruling on tax laws before they take effect. It was 2011, and the mandate didn’t come into force until 2014, so \"a suit challenging the individual mandate cannot be entertained until 2015.\"", "Bottom line: He said the circuit court should issue no ruling at all.", "Kavanaugh spent many pages explaining why the mandate and the penalty to back it up amounted to a tax and therefore fell under the 1867 law.", "But the real grist for conservative concern came near the end of his long dissent.", "Since the mandate was a tax, he wrote, \"the only potential Taxing Clause shortcoming in the current individual mandate provision appears to be relatively slight.\"", "Kavanaugh said \"a minor tweak would establish the law’s constitutionality,\" and offered three legislative fixes.", "For conservatives like Christopher Jacobs, a former analyst at the Heritage Foundation, this was too much.", "\"Conservatives might argue amongst themselves about which is worse,\" Jacobs wrote in The Federalist on July 2. \"An unelected judge opining on how a mandate to purchase a product could meet constitutional muster, or that same unelected judge giving Congress instructions on how to ensure it will.\"", "Kavanaugh’s thinking mattered, because when the issue went to the U.S. Supreme Court, the majority led by Chief Justice John Roberts said that, indeed, the mandate was a tax (although the legal reasons differed from Kavanaugh’s).", "That 2011 opinion is a legal Rorschach test for conservatives. Also writing in The Federalist, former Kavanaugh clerk Justin Walker said that Kavanaugh’s dissent showed \"that the individual mandate is unconstitutional under the Taxing Clause.\"", "If nothing else, Kavanaugh’s opinion is subject to interpretation.", "Several health care law professors  told us they can’t see any particular leaning on Obamacare, based on that 2011 case or a second one that came in 2015.", "The more recent case challenged the Affordable Care Act on the grounds that it was a revenue bill that should have started in the House of Representatives, but hadn’t. Kavanaugh found that in fact, \"The Affordable Care Act originated in the House and thereby complied with the Origination Clause.\"", "Based just on the Kavanaugh’s words, Indiana University law professor David Gamage finds no particular attitude toward the law as a whole.", "\"His decisions involved narrow, technical issues and didn’t involve any assessment of the larger framework of the Affordable Care Act,\" Gamage said. \"It is misleading and inaccurate to describe Kavanaugh as pro-Obamacare.\"", "Kavanaugh’s reasoning on the origins of the original health care bill was by the book, \"with no additional teeth being added,\" said James Blumstein, a Vanderbilt University law professor.", "In the 2011 case, Blumstein said Kavanaugh showed \"a traditional norm of judicial restraint.\"", "Mark Hall at Wake Forest University echoed that point. He sees Kavanaugh’s opinions as focused on legal fundamentals.", "\"In both cases, he took pains to write a separate opinion stating alternative grounds for rejecting the challenge,\" Hall said. \"To that extent, he appears to me to be more concerned about precision of legal analysis than reaching a particular outcome.\"", "Allison Hoffman at the University of Pennsylvania told us \"both of these opinions were procedural and offer no insight into how Kavanaugh would have come down substantively on the Affordable Care Act.\"", "Napolitano said that Kavanaugh is pro-Obamacare.", "Kavanaugh wrote opinions in two cases involving the legality of the Affordable Care Act. In both, he rejected the claims from opponents of the law based on narrow, more technical grounds. Some but not all conservatives see an openness to Obamacare in those writings.", "Legal scholars said they saw no preference either way in Kavanaugh’s opinions. In one case, he pointedly said that he wasn’t making a sweeping finding. Rather, he argued that under an old law, the court should wait before weighing in.", "There is room for people to interpret the meaning of Kavanaugh’s opinions, but on the surface, his words say little about his overall position on Obamacare.", "We rate this claim Mostly False.", "Fox News, Fox and Friends, July 10, 2018", "United States Court of Appeals for the District of Columbia Circuit,  Seven-Sky v. Holder, Nov. 8, 2011", "United States Court of Appeals for the District of Columbia Circuit, Sissel v. U.S. Dept. of Health and Human Services, Aug. 7, 2015", "The Federalist, How Potential SCOTUS Pick Brett Kavanaugh Wrote A Roadmap For Saving Obamacare, July 2, 2018", "The Federalist, Brett Kavanaugh Said Obamacare Was Unprecedented And Unlawful, July 3, 2018", "Washington Post, D.C. Circuit splits on Origination Clause in latest Obamacare challenge, Aug. 7, 2015", "National Review, Judge Brett Kavanaugh’s Impeccable Record of Constitutional Conservatism,  July 3, 2018", "Forbes, Supreme Court Nominee Brett Kavanaugh Penned Healthcare Dissent Focused On Tax, July 10, 2018", "Washington Post, The Health 202: Kavanaugh pick worries Obamacare and abortion-rights advocates, July 10, 2018", "Politico, Anti-abortion groups rally around Trump’s SCOTUS pick, July 9, 2018", "Email interview, Caley Cronin, vice president for media relations, Fox News, July 10, 2018", "Email interview, Mark Hall, professor of law, Wake Forest University School of Law, July 10, 2018", "Email interview, David Gamage, professor of law, Indiana University Maurer School of Law, July 10, 2018", "Email interview, James Blumstein, professor of law, Vanderbilt Law School, July 10, 2018", "Email interview, Allison Hoffman, professor of law, University of Pennsylvania Law School, July 10, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]