["In this Dec. 19, 2016, file photo, women wearing masks to protect themselves from air pollution walk through Ritan Park shrouded by dense smog in Beijing. (AP)", "An image on Facebook overstates the amount of pollution produced by China.", "\"China produces 90% of the world’s carbon emissions pollution!,\" states a Facebook post.", "We saw the post on Lexit, a movement to convince Latinos to embrace conservatism. The same image has been posted by other conservative groups on Facebook, too.", "#LEXIT is a grassroots effort to help Latinos exit the liberal left and embrace conservatism.", "The Facebook post was flagged as part of the company’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The Emissions Database for Global Atmospheric Research (EDGAR) shows that while China is the leading producer of CO2 emissions, it’s far below 90%.", "EDGAR, a joint project of the European Commissionand the Netherlands Environmental Assessment Agency, has compiled the percent of emissions by each country for many years.", "For 2018, it found that China was responsible for about 30% of the total emissions, putting China at the top. The United States produced about 14% of the emissions, the European Union produced about 9%, and India 7%. The vast majority of countries produced less than 1%.", "If we examine the same countries by per capita emissions, then China’s production share drops to about 8%.", "RELATED FACT-CHECK: Does China burn seven to eight times as much coal as the U.S.?", "The Facebook post shows Greta Thunberg, the Swedish teenager and climate change activist, stating \"why are we not going to China?\" It then shows billionaire George Soros saying \"shut up and stick to the script!\" We found no evidence that either made those statements.", "Thunberg and Soros have been used in multiple false posts. We debunked this one that said Thunberg posed with Soros and ISIS.", "AFP Fact-Check rated the same claim about China and found it false.", "We found no evidence that China produces 90% of the world’s carbon emissions. This statement rates False.", "LEXIT Movement, Facebook post, Dec. 26, 2019", "Emissions Database for Global Atmospheric Research, 2019 report", "AFP Fact-Check, China responsible for 90 percent of the world's carbon emissions? No, it's closer to 30 percent, Dec. 13, 2019", "Carbon Brief, Guest post: China’s CO2 emissions grew slower than expected in 2018, March 5, 2019", "PolitiFact, Greta Thunberg did not pose with ISIS or George Soros, Sept. 27, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]