["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Democratic presidential candidate and former Vice President Joe Biden speaks at the Constitution Center in Philadelphia on Sept. 20, 2020, about the Supreme Court. (AP/Kaster)", "President Donald Trump’s campaign repeatedly challenged Joe Biden to release a list of potential Supreme Court nominees before Justice Ruth Bader Ginsburg died, including when it put out Trump’s own list in early September.", "Biden said releasing such a list would distort the Senate’s role in the nomination process and subject his potential nominees to outside influence and attacks.", "As Republicans look to fill the Supreme Court vacancy left by Justice Ruth Bader Ginsburg’s death, President Donald Trump’s campaign has elevated its calls for Democratic presidential nominee Joe Biden to release a list of candidates he would consider for the bench.", "Trump and his campaign have challenged Biden to match the list of 20 potential nominees Trump rolled out Sept. 9, which included several federal appeals court judges and Republican senators such as Sen. Ted Cruz of Texas.", "Biden has dismissed those requests. Speaking in Philadelphia two days after Ginsburg’s death, the former vice president rejected the call again, while urging the Republican-led Senate to let the winner of the presidential election pick Ginsburg’s replacement.", "In doing so, Biden wrongly claimed the Trump campaign asked for his list only after Ginsburg died. (He also claimed, falsely, that \"there's no court session between now and the end of this election.\")", "\"After Ruth Bader Ginsburg passed away, they said ‘Biden should release his list,’\" Biden said in the Sept. 20 address. \"It’s no wonder the Trump campaign asked that I release the list only after she passed away. It’s a game for them. It’s a play to gin up emotions and anger.\"", "The Biden campaign noted that the claim came as Biden diverged slightly from his prepared remarks, which the campaign provided to PolitiFact. His prepared line was: \"It’s no wonder the Trump campaign asked that I release a list only hours after Justice Ginsburg passed away.\"", "Both Trump and his campaign called several times for Biden to put out a list of prospective nominees before Ginsburg’s death on Sept. 18. When the campaign unveiled the 20 additions to Trump’s list in a Sept. 9 press release, it wrote, \"Biden must do the same.\"", "Hey @JoeBiden,Trump Campaign here!We asked for your prospective SCOTUS nominee list on September 9th, 2020.https://t.co/d5Xo94EGab", "Trump’s campaign staff cited that announcement and other examples disproving Biden’s claim on Twitter and on its website, and the campaign flagged a few more in response to an inquiry:", "On Sept. 17, the Trump campaign released a statement saying \"it’s time for Joe Biden to release a list of his own potential Supreme Court nominees.\"", "On Sept. 12, Trump said at a campaign rally in Minden, Nev., \"I put out a list of an additional number of very conservative, highly thought of, highly respected judges ... They are the only people that I will consider for the Supreme Court of the United States. And I'm asking Joe Biden to do the same thing.\"", "On Sept. 9, Trump said at the White House, \"Joe Biden has refused to release his list, perhaps because he knows the names are so extremely far left that they could never withstand public scrutiny or receive acceptance.\"", "On Aug. 24, Trump said in an Aug. 24 Republican National Convention speech, \"I'm demanding, actually, a list. Let Biden put up a list of the judges he's going to appoint.\"", "Trump made similar statements during a  June 22 interview with the Christian Broadcasting Network and a June 20 campaign rally in Tulsa, Okla.", "The Trump campaign has ramped up its calls for a Biden list since Ginsburg’s death. But in Philadelphia, Biden gave three reasons why he didn’t want to publish the names of his potential nominees — and why he thought Trump’s decision to do so was unconventional.", "Biden argued that putting judges’ names on such a list could influence their decisions in courts where they currently serve, subject them to \"unrelenting political attacks\" without an immediate hearing at which to defend themselves, and upend the traditional process of consulting with the Senate on nominees.", "Trump put out a similar list as a candidate in 2016. In June, Biden told reporters he was thinking about qualified African American women with \"the experience to be on the court.\"", "Biden said, \"The Trump campaign asked that I release the list (of potential Supreme Court nominees) only after (Ginsburg) passed away.\"", "Trump and his campaign challenged Biden to release such a list on multiple occasions in advance of Ginsburg’s death.", "We rate this statement False.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here for more.", "NBC News on YouTube, \"Watch: Biden Delivers Remarks In Philadelphia | NBC News,\" Sept. 20, 2020", "CNN, \"Fact check: Biden falsely claims Trump campaign only asked him for Supreme Court list after Ruth Bader Ginsburg died,\" Sept. 20, 2020", "Donald J. Trump for President, \"Correct the record: Fact-checking Biden’s Philadelphia speech,\" Sept. 20, 2020", "Team Trump on Twitter, Sept. 20, 2020", "Tim Murtaugh on Twitter, Sept. 20, 2020", "Andrew Clark on Twitter, Sept. 20, 2020", "Abigail Marone on Twitter, Sept. 20, 2020", "Arnie Seipel, NPR on Twitter, Sept. 20, 2020", "Will Steakin on Twitter, Sept. 20, 2020", "Donald J. Trump for President, \"Who would Joe Biden put on the Supreme Court? He won’t say,\" Sept. 17, 2020", "Factbase Videos on YouTube, \"Speech: Donald Trump Holds a Campaign Rally in Minden, Nevada,\" Sept. 12, 2020", "The White House, \"Remarks by President Trump on Judicial Appointments,\" Sept. 9, 2020", "Donald J. Trump for President, \"President Trump releases list of prospective Supreme Court nominees,\" Sept. 9, 2020", "Factbase Videos on YouTube, \"Speech: Donald Trump Addresses the Republican National Convention in Charlotte,\" Aug. 24, 2020", "Trump War Room on Twitter, July 1, 2020", "Politico, \"Biden says he’ll release list of Black women as potential SCOTUS nominees,\" June 30, 2020", "Factbase Videos on YouTube, \"Interview: David Brody of CBN News Interviews Donald Trump at The White House,\" June 22, 2020", "NBC News on YouTube, \"Trump Holds Rally in Tulsa, Oklahoma | NBC News,\" June 20, 2020", "The New York Times, \"Donald Trump Releases List of Possible Supreme Court Picks,\" May 18, 2016", "Statement from the Biden campaign, Sept. 21, 2020", "Statement from the Trump campaign, Sept. 21, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]