["A horrific video showing a young man electrocuted on top of a train, has been circulated on social media. Owing to the nature of the video, Alt News is not posting it in this article.", "As can be seen from the above post, the video has been shared with the narrative that the incident occurred at the Secunderabad railway station. In the video, the man standing atop the train touches an overhead wire, following which he is instantly electrocuted. The video is 25 seconds long, and has been shared by several Facebook users.", "The video has been posted on Twitter with the same narrative. Alt News also received requests for verification on the official android app.", "Alt News found that the incident is recent, but it did not take place in Secunderabad, as claimed by social media users. The video is from Malda, West Bengal.", "There is a clue in the video itself- the word MTLD can be seen at the top left corner of the video. MLTD refers to Malda railway station.", "With the use of relevant key words and date filter, Alt News found a report of November 18, 2019 on Asianet Bangla. The report contains the video clip which has gone viral, and is titled, ‘ট্রেনের ছাদে উঠে ঝলসে গেলেন যুবক, ভয়াবহ দৃশ্যের সাক্ষী মালদহ স্টেশন, দেখুন ভিডিও’ (Translation: Malda station witnesses horror scene).", "The report states according to the railway police, the man had tried to commit suicide. Alt News found more news reports on the incident.", "It may be noted the video in question is from Malda, West Bengal and not Secunderabad, Telangana. The story was earlier fact-checked by Boom.", "Donate Now", "Arjun Sidharth is a writer with Alt News. He has previously worked in the television news industry, where he managed news bulletins and breaking news scenarios, apart from scripting numerous prime time television stories. He has also been actively involved with various freelance projects. Sidharth has studied economics, political science, international relations and journalism. He has a keen interest in books, movies, music, sports, politics, foreign policy, history and economics. His hobbies include reading, watching movies and indoor gaming.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]