["The online report, published here on August 13, 2019, claims that a Philippine House of Representatives committee has rejected a bill renewing the franchise of Alto Broadcasting System-Chronicle Broadcasting Network (ABS-CBN), the biggest media network in the country.", "Below is a screenshot of the online report:", "The headline, when translated to English, says: “CONFIRMED: CONGRESS ALREADY GAVE ITS VERDICT! ABS-CBN WILL CLOSE DOWN ON MARCH 30,2020! WATCH”", "Translated to English, the article says: “THE LOWER HOUSE WHICH HAS THE MANDATE TO PASS THE BILL RELATED TO THE REQUEST OF ABS-CBN TO HAVE ITS FRANCHISE RENEWED HAS ALREADY REACHED A DECISION AND THE COMMITTEE HAS JUNKED THE REQUEST OF ABS-CBN TO HAVE ITS FRANCHISE RENEWED.”", "“IT CAN BE RECALLED THAT RODRIGO DUTERTE HAS FIRMLY SAID THAT HE WILL NEVER ALLOW ABS-CBN TO DECEIVE HIM AGAIN LIKE THE WAY IT DID IN THE PAST ELECTIONS AND THAT HE WANTED ABS-CBN TO BE CLOSED DOWN.”", "“THE KAPAMILYA NETWORK ABS-CBN HAS SPOKEN ABOUT THE NEWS ON THE CONGRESS' FAILURE TO APPROVE THE REQUEST OF ABS-CBN TO HAVE THEIR FRANCHISE RENEWED FOR ANOTHER 25 YEARS.”", "A video accompanying the report repeats the claim that the broadcaster will shut down.", "The report was shared on Facebook here, here and here.", "As part of licensing requirements, a broadcasting network in the Philippines must obtain a congressional franchise as well as a certificate of public convenience from the National Telecommunications Commission, the regulatory body for the telecommunications sector.  The congressional franchise comes in the form of a law.", "In the Philippines, a bill is passed by both houses of Congress, the House of Representatives and the Senate. It is then submitted to the president, who can either sign it into law or veto it. A bill passes into law if the president has not acted on it after 30 days.", "President Rodrigo Duterte has threatened to object to the renewal of ABS-CBN’s franchise following the network’s alleged refusal to air his campaign ad during the 2016 presidential elections.", "The House of Representatives did not act on a November 2018 bill which sought the renewal of ABS-CBN’s franchise.", "However, a search of the legislative documents in the official website of the House of Representatives showed that four bills for the renewal of ABS-CBN’s franchise were filed during the current congressional session, which runs until 2022.", "These include House bills no. 676, 3064, 3521 and 3713.", "All four bills are still pending.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]