["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Protesters take a knee in front of New York City police officers during a rally for George Floyd on June 4, 2020, in Brooklyn, N.Y. (AP)", "Elder spoke broadly about police killings but pulled his numbers from the Washington Post’s more narrow tally of fatal shootings by on-duty police officers.", "Not all police killings occur when officers are in the line of duty or firing their guns. Some people die from police use of tasers or physical restraint, for example.", "Black people are disproportionately shot and killed by police in the U.S.", "As the U.S. entered a second week of protests after the death of George Floyd, conservative radio host Larry Elder argued that \"cops rarely kill anybody, let alone an unarmed black person.\"", "\"Last year, there were nine unarmed black people killed. Nineteen unarmed white people,\" Elder said June 2 on Fox News host Sean Hannity’s TV show.", "A reader asked us about Elder’s numbers, which he repeated on Twitter, so we decided to put them to the Truth-O-Meter.", "How many unarmed blacks were killed by cops last year? 9. How many unarmed whites were killed by cops last year? 19. More officers are killed every year than are unarmed blacks. When do the #BlueLivesMatter protests begin?#GeorgeFloyd", "We found that Elder was speaking broadly about police killings but pulling his numbers from the Washington Post’s more narrow tally of fatal shootings by police officers in the line of duty.", "The Washington Post’s tally doesn’t account for off-duty police or the use by on-duty officers of other force that can be lethal, such as tasers or physical restraint.", "That means the number of unarmed people killed in encounters with law enforcement in 2019 is higher for both races than Elder claimed. How much higher is not clear.", "What is clear, experts told us, is that despite what Elder’s absolute numbers may suggest, black people in the U.S. have died from fatal encounters with police at a disproportionate rate.", "RELATED: TikTok video misleads on police shooting data", "The Centers for Disease Control and Prevention and FBI keep tabs on deaths resulting from interactions with police, but both sources provide incomplete data that takes years to record.", "More reliable data comes from the Washington Post and projects such as Mapping Police Violence and Fatal Encounters.", "In emails to PolitiFact, Elder cited a tweet and a Wall Street Journal op-ed that pulled numbers from the Washington Post’s database.", "According to the Washington Post data through June 3, police in the line of duty fatally shot 10 unarmed black people and 20 unarmed white people in 2019. (The data is updated as new facts emerge, and by June 5 the numbers jumped to 15 unarmed blacks and 25 unarmed whites.)", "But Elder incorrectly claimed that his statistics represented the numbers of all black and white Americans who were killed by police, not the number of \"shootings in which a police officer, in the line of duty, shoots and kills a civilian,\" as the Washington Post describes its data.", "The Washington Post doesn’t account for deaths like Floyd’s, for example. Floyd died in police custody May 25 after an officer in Minneapolis kneeled on his neck.", "When we asked about this incongruity, Elder told us that the majority of police killings involve firearms, \"so the number is not likely much bigger.\"", "It’s hard to say how much bigger it is.", "As of June 3, Mapping Police Violence had counted 28 unarmed blacks and 51 unarmed whites who died at the hands of police in 2019.", "Those numbers are higher than the Washington Post’s in part because Mapping Police Violence tracks police killings more broadly and includes officers who are off duty.", "In 2019, among those who were unarmed when they encountered police, there were five black people and 12 white people who died from tasers, beatings or other uses of force by police, according to Mapping Police Violence’s data. Off-duty officers killed four unarmed blacks and five unarmed whites. Those deaths won’t show up in the Washington Post data.", "Another reason Mapping Police Violence counted more unarmed people killed by police is that it considered victims in possession of toy guns, BB guns, airsoft guns or rocks to be unarmed. The Washington Post’s database doesn’t include those people in its unarmed tallies.", "In 2019, at least eight black people and 16 white people were killed by police while in possession of a toy weapon or something similar, according to Mapping Police Violence.", "There are also numerous 2019 cases, in both data sets, where the victim’s armed status remains unknown or the victim was considered armed with a vehicle.", "Overall, the data on whether police-killing victims were armed or unarmed is \"messy,\" said Frank Edwards, an assistant professor at Rutgers University’s School of Criminal Justice who co-authored a study on police killings.", "Because groups that track the data often cite news reports that rely only on the word of police to establish whether a person was armed or unarmed, \"the data likely over-report the armed status of victims and the danger faced by police,\" Edwards said.", "\"Police have been known to misrepresent the danger presented by suspects,\" he said.", "The data we have is also limited to deaths, said Lorie Fridell, professor of criminology at the University of South Florida. Ideally, she said, we would be able track police use of force more broadly, including force that could be deadly but doesn’t turn out to be fatal.", "Elder’s claim also ignores the fact that the same Washington Post data shows black people are disproportionately shot and killed by police, experts said.", "\"There may be more unarmed whites than unarmed blacks killed each year, but the rate of shooting unarmed blacks is much larger,\" Fridell said, citing a report from the Washington Post that summarized years of findings from its database.", "Black Americans represent 13% of the U.S. population, the report said, but they accounted for about a quarter of police shooting victims over four and a half years of data collection.", "\"They're over-represented in the data,\" said Brian Burghart, the founder of Fatal Encounters.", "Elder said: \"Last year, there were nine unarmed black people killed (by law enforcement). Nineteen unarmed white people.\"", "Those numbers matched the Washington Post’s tally of fatal shootings by police in the line of duty, although the Washington Post’s figures have increased since Elder made his claim.", "But not all police killings happen when officers are on duty, and not all involve a gunshot. The Washington Post’s data doesn’t include deaths like Floyd’s, for example.", "Elder’s claim also omitted important context: that black people in the U.S. are disproportionately killed by police relative to their share of the population.", "Overall, Elder’s statement contained elements of truth, but it left out important context that would give a different impression.", "We rate it Mostly False.", "Fox News, \"Hannity,\" June 2, 2020", "Larry Elder on Twitter, June 2, 2020", "The Washington Post, \"Fatal Force,\" accessed June 3, 2020", "Mapping Police Violence, \"National Trends,\" accessed June 3, 2020", "Fatal Encounters, \"Database and Name Check,\" accessed June 3, 2020", "Centers for Disease Control and Prevention, \"National Violent Death Reporting System (NVDRS),\" accessed June 3, 2020", "The Wall Street Journal, \"The Myth of Systemic Police Racism,\" June 2, 2020", "Michael Tracey on Twitter, May 31, 2020", "City Lab, \"The Problem With Research on Racial Bias and Police Shootings,\" Feb. 6, 2020", "Medium, \"Justin Nix and Jason Lozada are wrong about Mapping Police Violence. Here’s why,\" Jan. 4, 2020", "SocArXiv Papers, \"Do police killings of unarmed persons really have spillover effects? Reanalyzing Bor et al. (2018),\" Dec. 30, 2019", "Nature, \"What the data say about police shootings,\" Sept. 4, 2019", "Proceedings of the National Academy of Sciences, \"Risk of being killed by police use of force in the United States by age, race–ethnicity, and sex,\" Aug. 20, 2019", "The Washington Post, \"What we’ve learned about police shootings 5 years after Ferguson,\" Aug. 9, 2019", "The Washington Post, \"How The Washington Post is examining police shootings in the United States,\" July 7, 2016", "PolitiFact, \"TikTok video misleads on police shooting data,\" June 3, 2020", "PolitiFact, \"What are the facts on police shootings following death of Stephon Clark?\" March 29, 2018", "PolitiFact, \"Bill O'Reilly cites faulty data for claim about shooting deaths of blacks, whites by police,\" Dec. 4, 2014", "PolitiFact, \"Talk show host: Police kill more whites than blacks,\" Aug. 21, 2014", "Email interview with Larry Elder, commentator and radio host, June 3, 2020", "Email interview with Lorie Fridell, professor of criminology at the University of South Florida, June 3, 2020", "Email interview with Brian Burghart, journalist and founder and executive director of Fatal Encounters, June 3, 2020", "Email interview with Frank Edwards, assistant professor at the Rutgers School of Criminal Justice, June 3, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]