["About this rating", "A purported x-ray image supposedly showing a long slender creature inside of a person's stomach has been attached to a wide variety of stories over the years:", "This x-ray shows the case of an unfortunate woman who happened to have a snake crawl into her vagina, slither through the fallopian tube, and out past the ovary into her body cavity. It survived unknown for three days until the snake started eating her appendix.", "In addition to the aforementioned tale of a snake crawling into a woman's vagina and eating her appendix, this image has also been accompanied by stories about tapeworms, eels, and anal insertions, and is frequently included in galleries exhibiting examples of the \"weirdest things found inside the human body.\"", "For example, the website Bold Sky used this image in March 2016 to illustrate a story about a man who inserted an eel into his anus:", "Lolz! This is the funniest of all. A man from China admitted himself to a hospital when he accidentally got a live eel stuck inside his anus. He said that he was inspired by the porno world so much that he wanted to try something unique. Doctors claim that the eel was alive when the man was being operated, but it died shortly after it was removed.", "Although some news stories have chronicled tales (accurate or not) of people eating tapeworms to lose weight and inserting eels or snakes into their anuses in pursuit of sexual thrills, the above-displayed image did not stem from any such activities.", "This image originally appeared on Cyberium.net, a web site dedicated to strange and manipulated digital artwork, circa 2002. The artwork on the web site was divided into punny categories, such as HumAnimals, WoManipulations, and surRealities: \"The images you find here are the result of digital manipulation of photos that try to capture the reality of the world in which we live, my purpose consists in recycling their meaning to explore a different hidden reality, my mind ...\"", "The artist behind this picture, who identified himself only as \"Guido\" on the web site, initially posted the artwork under the title \"Original Sin\":", "While Guido didn't provide additional information about this particular image, he did explain in the web site's FAQ section how he created most of his work:", "Q: Which graphic tools you use?", "Always ...", "PaintShop Pro (by Jasc) is my preferred tool to draw and manipulate ,", "easy and fast and powerful … i like it ... sometimes...", "sometimes...PhotoShop is the tool i use to put various effects on images.", "PhotoShop is the tool i use to put various effects on images ,", "Eye-Candy filters are my preferred .Morpher2 is a simple shareware program to do Morphing .", "Morpher2 is a simple shareware program to do Morphing .PowerGoo is a simple and funny program for picture deformation .", "PowerGoo is a simple and funny program for picture deformation .Normally an image is the result of work with 2 or more different tools", "Normally an image is the result of work with 2 or more different tools. These programs run under Microsoft Windows operating systems .", "We also located the snake x-ray that Guido used in his digitally manipulated creation, showing that the reptile was not inhabiting anyone's innards at the time it was scanned:", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]