["About this rating", "In October 2020, readers asked Snopes to examine the accuracy of news reports and social media posts that claimed a West Virginia nurse who spoke at that year's Republican National Convention named Amy Thorn — also known as Amy Johnson Ford — had been charged with shooting another woman in the stomach.", "On Oct. 10, gun control activist Shannon Watts posted a widely-shared tweet that read:", "Amy Thorn, the registered nurse from West Virginia who recently spoke at the Republican National Convention to defend Donald Trump’s response to the COVID crisis, has been arrested for shooting a woman in the stomach during an argument.", "In her tweet, Watts linked to an article from WCHS, a local Charleston, West Virginia TV station, that reported:", "A Williamson woman who made headlines after she traveled to New York to help treat COVID-19 patients has been charged after court records said she shot another woman. Amy Jolene Thorn, 39, of Williamson is charged with malicious or unlawful assault, according to a criminal complaint from Mingo County Magistrate Court. The complaint said Thorn shot another woman on Thursday, Oct. 8, near the 800 block of Vinson Street in Williamson.", "The New York Post also reported on the arrest.", "Those reports and descriptions were accurate. A criminal complaint provided to Snopes from Mingo County Magistrate Court shows that Amy Jolene Thorn, 39, had been arrested and charged with malicious wounding after she \"did shoot [another woman] with a firearm [on] Vinson St of Williamson, West Virginia, with intent to maim, disable, disfigure or kill.\"", "The criminal complaint against Thorn can be read here. Snopes is withholding the alleged victim's name due to the political associations with this case, and because she has not chosen to speak out yet. We have also redacted Thorn's home address, driver's license number, and the exact address at which the shooting allegedly took place.", "Thorn has been charged under Section 61-2-9(a) of the West Virginia code, which prohibits \"malicious or unlawful assault,\" a felony. Based on the complaint's allegation that she acted \"with intent to maim, disable, disfigure or kill\" — as opposed to acting \"unlawfully but not maliciously\" — Thorn could face a sentence of between two and 10 years in prison, if convicted.", "In an interview with WCHS, Williamson Police Chief Grady Dotson confirmed that Thorn is the same woman who praised President Donald Trump's response to the COVID-19 coronavirus pandemic during her speech at the Republican National Convention on Aug. 24, 2020, appearing there under the name Amy Johnson Ford. Dotson said:", "...Two females got into a verbal argument, it turned into one of the females getting a gun. She did shoot the victim one time in the abdomen area... Amy is well known around the area for her participation in going over to the RNC committee — a nurse that was helping out with the coronavirus and was on the front line.", "West Virginia Board of Registered Nurses records show an \"Amy Jolene Johnson\" has been an active, licensed registered nurse in the state since July 2003.", "WCHS also reported that Thorn had told police she was acting in self-defense, and that she has been released on bond. A staff member in the clerk's office at Mingo County Magistrate's Court told Snopes that Thorn had not entered a plea yet, but a preliminary hearing was scheduled for Oct. 27, 2020.", "Moore, Anna; Conn, Anthony.  \"Records: Williamson Nurse Charged After Shooting Woman in Abdomen.\"\r\n  WCHS.  9 October 2020.", "Connelly, Eileen AJ.  \"Nurse Who Spoke at 2020 RNC Busted for Shooting Woman After Argument.\"\r\n  The New York Post.  10 October 2020.", "Mingo County Magistrate Court.  \"West Virginia v. Amy Jolene Thorn — Criminal Complaint.\"\r\n  8 October 2020.", "West Virginia Legislature.  \"West Virginia Code, Chapter 61-2-9(a) — Malicious or Unlawful Assault.\"\r\n  Accessed 13 October 2020.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]