["The video was uploaded here to a Facebook group with more than 8,000 members on May 9, 2020.", "The five-minute, 23-second footage shows a man beaten by several men wielding baseball bats in a room. Conversations in Mandarin about money issues can be heard throughout the video.", "Translated to English, a warning banner, written in traditional Chinese characters, at the bottom of the video explains due to its graphic nature, “this footage has been covered so you can decide if you want to see it.”", "The caption, written in colloquial Cantonese, translates to English as: “Aren’t our sau zuks who escaped to Taiwan taken care of by like-minded people? Why even…”", "“Sau zuk”, literally translates as “hands and feet”, is a Cantonese slang term widely used to describe pro-democracy protesters who participated in the 2019 Hong Kong protests, as reported by local newspaper South China Morning Post here, and here by online news site Quartz.", "Hong Kong’s political unrest has prompted more of its residents to consider moving to nearby democractic Taiwan since 2019, according to this AFP report.", "The video was also shared alongside a similar claim here and here on Facebook.", "The claim, however, is misleading.", "A reverse image search using keyframes from the video in the misleading post found this May 5, 2020, report published by the Taiwanese branch of Hong Kong newspaper Apple Daily.", "The report, which is titled “[Torture footage leaked] Man stole $200,000 from collected debt / beaten to death by seven gang members,” states that on April 29, 2020, a 21-year-old man was beaten to death in a flat in Taipei, Taiwan, over an alleged accusation that he had stolen $200,000.", "Below is a screenshot of the Apple Daily article:", "The article also contains several screenshots that correspond with the video in the misleading posts.", "Below is a screenshot comparison of the video in the misleading post (L) and one of the images published by Apple Daily (R):", "Similar screenshots from the assault footage were also published in other Taiwanese news reports, including here by broadcaster TVBS News and here by news website ETtoday.", "Hong Kong Economic, Trade and Cultural Office, the city’s representative office in Taiwan, told AFP in an email on May 12, 2020, that it had not received any reports of a recent incident in which a Hong Kong resident was beaten to death.", "“From 1 April to today (12 May), the Hong Kong Economic, Trade and Cultural Office has not been informed by the local authorities of any death cases concerning Hong Kong residents due to assault,” the email reads.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]