["A video has been shared in multiple Facebook posts alongside claims that it was taken during an air show in Sri Lanka to celebrate the country’s Air Force’s  70th anniversary. The claim, however, is false; the footage in fact shows an air show in Saudi Arabia that was held in 2020 to celebrate the Kingdom’s 90th national day.", "The 15-second video was published on Facebook here on March 3, 2021.", "The post’s Sinhala-language caption translates to English as: \"SLAF 70th anniversary. The warrior. \"", "SLAF is an acronym for the Sri Lanka Air Force. The post circulated just after the first day of the three-day air show held in the capital of Colombo to commemorate the 70th anniversary of the SLAF.", "The clip was also shared alongside similar claims about it showing the SLAF air show on Facebook here and here.", "The claim, however, is false.", "A reverse Google image search with video keyframes found that the video in fact shows an air show in Saudi Arabia in 2020.", "The footage, as well as video screenshots, were published on photography news webiste Petapixel here on September 24, 2020. The article is titled: “Watch a Photographer Direct Fighter Planes During a Midair Shoot”.", "The article reads in part: “The Royal Saudi Air Force organized a photo shoot during air show rehearsals in preparation for the 90th National Day of Saudi Arabia yesterday. Saudi journalist Enad al-Otaibi Tweeted a couple of amazing behind-the-scenes videos showing well-known Saudi aviation photographer Ahmed Hader directing and photographing fighter jets.”", "The same video was also published on Indian media outlet Asianet Newsable's YouTube channel here on September 26, 2020.", "“The Royal Saudi Air Force recently organized a photoshoot of its fighter airplanes,” the video’s description reads. “Saudi journalist Enad al-Otaibi Tweeted a couple of amazing behind-the-scenes videos showing well-known Saudi aviation photographer Ahmed Hader directing and photographing fighter jets.”", "The clip shared in the misleading posts corresponds to the YouTube video’s 33-second to 48-second mark.", "Below is a screenshot of the video shared in the misleading posts (L) and the YouTube video (R):", "The air show marking Saudi Arabia’s 90th National Day in September 2020 was reported on here by the state-run Saudi Press Agency.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]