["The video was published here on Facebook on July 26, 2020. It has been viewed more than 37,000 times.", "Sporadic chants in Mandarin can be heard throughout the 36-second video: “Protect Qianjiang! Restore peace!”", "The Facebook post’s traditional Chinese-language caption translates to English as: “During the Dongguan Umbrella Movement, a large number of unemployed people took to the street, demanding the CCP to give them their jobs back. Will these people who are struggling to put bread on the table raid the homes of corrupt officials? Let’s wait and see?”", "The term \"Umbrella Movement\" refers to large pro-democracy protests which called for universal suffrage in Hong Kong in 2014, as reported here by AFP.", "Some Facebook users appeared to be misled by the claim, as seen in comments on the post: “Liberate Dongguan??”, “mainland China’s Umbrella Movement!”; and “haha, if the laymen are out marching, they will start chanting slogans tomorrow and promote the downfall of the CCP the day after. After that, they will plot to kill the CCP (members)”.", "The video was also shared here, here and here on Facebook and here and here on Twitter alongside a similar claim.", "The video, however, has been shared in a misleading context.", "A frame-by-frame analysis of the video in the misleading post found a banner that translates as “pesticide factory” at the 19-second mark.", "A keyword search found a similar video published here on YouTube on June 27, 2016. The footage in the misleading post corresponds to the YouTube video between the 11-second and 22-second marks.", "The traditional Chinese-language caption of the YouTube video translates as: “Tens of thousands of angry people took to the street in Hubei, prompting the suspension of a proposed project for a pesticide factory in Qianjiang”.", "The protest site can be seen here in the Baidu Maps imagery of Qianjiang, a city in the central Chinese province of Hubei.", "Similar scenes of demonstrators holding umbrellas were featured in reports by US broadcasters Radio Free Asia and New Tang Dynasty Television here and here in June 2016. The reports state that protesters were marching against a proposed pesticide plant in the city of Qianjiang.", "Later in June 2016, the Qianjiang government announced the termination of the pesticide factory project, Chinese state media People’s Daily reported here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]