["About this rating", "The tribulations of an affable Spix’s macaw (Cyanopsitta spixii) named “Blu” are the focus of the \"Rio\" franchise of movies. Blu in the movie is the last known male of his species, and he must travel to Rio de Janeiro from his captivity in Minnesota to meet the last remaining female of his species to save their kind from extinction.", "Back in the real world, scientists in September 2018 recommended that the Spix’s macaw, also known as the “little blue macaw,” be reclassified from “critically endangered” to “extinct in the wild.”", "This recommendation has not yet been formalized by the International Union for Conservation of Nature (IUCN), which maintains a “red list” of endangered species. The organization last assessed the Spix’s macaw on Aug. 7, 2018, prior to the aforementioned study first published online on Sept. 1, 2018. In their paper, the scientists described the last known sightings of Spix’s macaw in the wild:", "Last known from near the rio São Francisco in north Bahia, Brazil, where only three birds remained in 1985–1986, and these were captured for trade in 1987 and 1988. However, a single male, paired with a female Blue-winged Macaw (Propyrrhura maracana), was discovered at the site in July 1990, and survived until the end of 2000. There have been no subsequent records of wild birds, despite searches and fieldworker presence in the area. An observation in 2016 in the Curaca area is believed to relate to a release from captivity. Loss of gallery woodland and trapping for the cagebird trade likely drove declines.", "While wild individuals have likely not been seen since 2000, a captive population of about 60 or 70 species in the hands of both breeding programs and private owners still exists. In 2018, the Brazilian government announced that a population of around 50 Spix’s macaws from Europe would be transferred to a reintroduction facility in Brazil:", "The current batch of survivors being repatriated from Europe will initially stay in a special center due to open in Berlin next Thursday, where they will be prepared for the transition. They will then move to a 72-acre reintroduction center in a conservation area of Brazil's north-eastern state of Bahia, with the first being released into the wild in 2021. Brazil's environment ministry said that international breeding programs for the birds in captivity have seen the population grow from 79 in 2012 to 158 this year.", "The number of blue-named and/or blue-colored macaws has created some internet confusion about what birds are — and are not —endangered or extinct. A viral meme from the French Facebook page Jadore Les Animaux, for example, shared a picture of a blue-colored macaw with the text: \"The world is in mourning. The blue macaw has been declared extinct.”", "First, while there are multiple species of blue macaws, “blue macaw” is not the common or informal name for any of them. The closest match to that name would be the blue-and-yellow macaw (Ara ararauna), whose population is not threatened.", "Secondly, as Agence France-Presse noted in a fact check of that viral post, the species shown in the photo was actually a different species of macaw known as the hyacinth macaw (Anodorhynchus hyacinthinus). This species is classified as “vulnerable” by the IUCN.", "But because scientists have determined the wild population of Spix’s macaw to be likely extinct in the wild, we rate the claim about the bird species fictionalized in the \"Rio\" movies as \"True.\"", "Butchart, Stuart H.M., et al.   “Which Bird Species Have Gone Extinct? a Novel Quantitative Classification Approach.”\r\n    Biological Conservation.   1 September 2018.", "IUCN Red List.   “Cyanopsitta spixii.”\r\n    Accessed 27 August 2019.", "Phys.org.   “Dozens of Last Blue Macaws to Be Reintroduced to Brazil.”\r\n    24 June 2018.", "IUCN Red List.   “Ara ararauna.”\r\n    Accessed 27 August 2019.", "Butchart, Stuart H.M., et al.   “Non, Cette Espèce De Perroquet N'est Pas Éteinte.”\r\n    L’Agence France-Presse.   24 January 2019.", "IUCN Red List.   “Anodorhynchus hyacinthinus.”\r\n    Accessed 27 August 2019.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]