["About this rating", "On 1 March 2017, Harper’s magazine published a translation of a letter written by President Donald Trump’s grandfather, Friedrich Trump, to Prince Luitpold of Bavaria, in which he pled (unsuccessfully) for the Prince regent to reconsider his family’s deportation.", "The letter was found in a local German archive and was first published in the German newspaper Bild on 21 November 2016. The Associated Press confirmed the story in a bulletin posted that same day:", "Bild newspaper printed the 1905 letter located by an historian, in which Friedrich Trump wrote Bavarian Prince Luitpold begging the \"well-loved, noble, wise and just\" leader not to deport him. Luitpold rejected the \"most subservient request.\"", "Trump's grandfather was born in Kallstadt, then part of Bavaria, and immigrated to the U.S. as a teenager without performing his military service. It was after he'd made his fortune there and tried to resettle in Germany that he was ordered expelled, and returned to the U.S.", "Many news outlets have suggested that Friedrich's arguments appear similar to contemporary ones raised by those who fear deportation under President Trump's orders or oppose his immigration policies, including this passage:", "We were confronted all at once, as if by a lightning strike from fair skies, with the news that the High Royal State Ministry had decided that we must leave our residence in the Kingdom of Bavaria. We were paralyzed with fright; our happy family life was tarnished. My wife has been overcome by anxiety, and my lovely child has become sick.", "Why should we be deported? This is very, very hard for a family. What will our fellow citizens think if honest subjects are faced with such a decree — not to mention the great material losses it would incur. I would like to become a Bavarian citizen again.", "The back story to this letter (and Trump’s ultimate deportation from Bavaria) began when Friedrich first arrived in America as a 16-year-old barber's apprentice in 1886. He bounced around a variety of apartments and jobs in New York before moving to Washington state in 1891 and finding financial success even further north in Canada during the Gold Rush, as discussed in a New Yorker profile of him:", "Suddenly, in 1891, Friedrich was off to Washington State before going to the Klondike regions, where he pursued a colorful career providing food, liquor, and women to miners He came back to New York enriched, a decade later, and continued to move around, trying the Bronx before settling in the Woodhaven section of Queens, where the Trump empire put down deeper roots than it had in Manhattan, and where his grandson [President Trump] was raised.", "In 1902, during a trip back to his hometown of Kallstadt, Frederick Trump married a local woman named Elizabeth Christ and brought her home with him to New York:", "On one of his trips home to Kallstadt, Friedrich married the girl next door, Elizabeth, and took her to New York. Elizabeth, however, was homesick, and in 1904 the family returned to Kallstadt. Friedrich “worked, for a year, to get his citizenship back” from the German authorities, according to John Walter, Donald’s first cousin, who works for the Trump Organization and serves as the family historian.  To no avail: Friedrich had failed to fulfill his compulsory military duty, and as a result he was expelled. “So they left,” Walter says. “And they went back to America, and that’s why Donald and I are here.”", "This was the context within which Friedrich pleaded Prince Luitpold for citizenship in 1905:", "Most Serene, Most Powerful Prince Regent! Most Gracious Regent and Lord!", "I was born in Kallstadt on March 14, 1869. My parents were honest, plain, pious vineyard workers. They strictly held me to everything good — to diligence and piety, to regular attendance in school and church, to absolute obedience toward the high authority.", "After my confirmation, in 1882, I apprenticed to become a barber. I emigrated in 1885, in my sixteenth year. In America I carried on my business with diligence, discretion, and prudence. God’s blessing was with me, and I became rich. I obtained American citizenship in 1892. In 1902 I met my current wife. Sadly, she could not tolerate the climate in New York, and I went with my dear family back to Kallstadt.", "This request was ultimately denied because Trump had avoided his compulsory military service and because he had never removed himself from the registry of the town of Kallstadt as required of an emigrant, as reported by German public media outlet Deutsche Welle:", "The authorities soon discovered that Friedrich Trump had never performed the mandatory military service before leaving Germany. Another problem, according to local historian Roland Paul, was that Trump never officially unregistered from his hometown.", "The official notice of Trump's deportation read: \"The American citizen and pensioner Friedrich Trump, currently residing in Kallstadt, is hereby informed that he is to depart the state of Bavaria, or face deportation.\"", "Friedrich and Elisabeth returned to New York in July 1905 during Elizabeth’s pregnancy with Fred Trump, Donald Trump’s father.", "Trump, Friedrich.   \"The Emigrants.\"\r\n    Harper’s.   1 March 2017.", "Bild.   \"Mit Diesem Brief Schob Deutschland Trumps Opa Ab.\"\r\n    21 November 2016.", "Associated Press.   Report: Trump's Grandfather Pleaded to Stay in Germany.\"\r\n    21 November 2016.", "Widmer, Ted.   \"An Immigrant Named Trump.\"\r\n    The New Yorker.   1 October 2016.", "McGrane, Sally.   \"The Ancestral German Home of the Trumps.\"\r\n    The New Yorker.   29 April 2016.", "Deutsche Welle.   \"Report: Trump's Grandfather Pleaded to Stay in Germany\"\r\n    21 November 2016.", "Tharoor, Ishaan.   \"Newly Unearthed Letter Shows How Trump’s Grandfather Begged to Stay in Germany.\"\r\n    The Washington Post.   21 November 2016.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]