["A video is widely circulating on social media where two men can be seen attempting to take a girl hostage while an elderly woman tries to stop the duo. Both the women are beaten and pushed around by the men. On December 8, Bhagat Singh Chauhan tweeted the video with the claim that these are men from Rajasthan who lift women from lower economic communities and rape them while the police remain tight-lipped. “ये वीडियो राजस्थान का है ये लोग गरीबो की ओरतों को सबके सामने उठाते है और बलात्कार करते है और उस जगह की पुलिस भी कुछ नही बोलती । इस वीडियो को इतना फैलाओ की वहाँ की पुलिस मजबूर हो जाये इनको गिरफ्तार करने के लिए (This video is from Rajasthan. These people lift poor women in the public eye and police also doesn’t say anything. Spread this video to such an extent that the police is compelled to arrest them -translated)”. The tweet has amassed close to 400 retweets so far.", "👆👆ये वीडियो राजस्थान का है ये लोग गरीबो की ओरतों को सबके सामने उठाते है और बलात्कार करते है और उस जगह की पुलिस भी कुछ नही बोलती । इस वीडियो को इतना फैलाओ की वहाँ की पुलिस मजबूर हो जाये इनको गिरफ्तार करने के लिए pic.twitter.com/tWakHAHKZJ", "— Bhagat Singh Chauhan AAP,s maflarman FB💯% (@bmahabharat2) December 8, 2019", "Several individuals on Facebook and Twitter shared the video with the identical narrative. It has been circulating with similar claims at least since November 2017.", "Alt News found that a version of the same video was posted by Rajasthan Patrika on September 24, 2017. Thus, the video is at least two years old.", "One of the men in the video is the husband of the girl they try to abduct. The elderly woman is the mother of the girl. According to a September 27, 2017 report in Dainik Bhaskar, the husband’s name is Shaukat who was married to Nemat and Aamad Khan’s daughter. “As per the police, Aamad Khan, a resident of Kalu Khan ki Dhani village, had married his daughter to Shaukat at a very young age several years back. Shaukat had asked his in-laws several times to send his wife. However, Shaukat’s mother-in-law Nemat insisted on doing the ‘Gauna’ when her daughter turns 18. -translated)”, states the report. Shaukat, along with an accomplice Ilyas, came with a tractor and forcefully took his minor wife after beating his resistant mother-in-law.", "Child marriage in India is illegal yet prevalent in various parts of the country. Some communities marry their girls at a very young age however the bride stays at her father’s house till the time she attains adulthood. The girl starts living with her husband after a post-marriage ceremony called “Gauna”.", "This incident reportedly took place on the afternoon of September 12, 2017. According to media reports, the duo was arrested after the police took cognizance of the matter on September 17, 2017.", "In 2018, fact-checking outlet Boomlive spoke to inspector Kishore Singh from Bap Tehsil police station where the case against these two men was registered. He said that these men were arrested and charged with “several sections of kidnapping, wrongful restraint and using criminal force on a woman with an intent to outrage her modesty”. However, they were later released on bail while the minor girl was living in the same village with her mother.", "In conclusion, a video of a man beating his mother-in-law for not allowing him to take his minor wife home is being shared with the false claim that women from lower economic backgrounds were lifted in the public view to be raped by men in Rajasthan.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]