["About this rating", "On Jan. 6, 2021, supporters of outgoing U.S. President Donald Trump violently converged on the U.S. Capitol in Washington, D.C. in support of Trump's false claims that the November 2020 presidential election was beset by massive scale voter fraud that led to his loss.", "Trump supporters at the Capitol brawled with police and broke through barricades, eventually breaking into the building while Congress was in the process of counting electoral college votes and confirming President-elect Joe Biden's win.", "Some on social media started spreading unfounded rumors that the violent chaos was being instigated not by Trump supporters, but by anti-fascist activists, colloquially known by the portmanteau antifa.", "There is no evidence that the mob storming Capitol grounds and violently engaging police are antifa — in fact the social media accounts spreading the rumor are followers of the QAnon conspiracy theory. Here is one example of one such tweet, which reads, \"BREAKING: PATRIOTS ARE NOT STORMING ANYTHING!! PAID FOR ANTIFA DOES, PERIOD!!\":", "It was Trump himself who encouraged his supporters to march to the Capitol, as CNN White House reporter Kevin Liptak reported:", "Shortly after, his supporters took him at his word and marched to the Capitol, breached the building, and as of this writing, were inside.", "Members of the right wing extremist group Proud Boys, which is known for provoking violence and brawling, have also boasted in discussions leading up to the attack on the Capitol that they would forego their \"uniform\" — which consists of black and yellow — in favor of all-black garb. When they do show up at protests, antifa activists typically wear all black.", "Qanon followers have been deemed a potential violent threat by the FBI. Here is how we previously reported on the Qanon belief system:", "In general, QAnon believes Trump is in the middle of a biblical war against a \"deep state,\" satanic cabal of baby-eating, child sex-traffickers led by prominent members of the Democratic party, entertainers who espouse liberal opinions, anybody who mentions \"pizza,\" and authoritative sources who relay credible information that may cast a negative light on the president. Proponents of this theory believe that one day soon the \"storm\" will come and Trump, with the help of an anonymous high-ranking military official known as \"Q,\" will round up members of the deep state, arrest them, and possibly have them executed.", "Based on the fact that the sources of this rumor are unreliable, and the fact that Trump urged his supporters to do exactly what they're doing now, and that an extremist group known for provoking violence stated that it had planned to dress in black to \"blend in,\" we rate this rumor \"False.\"", "In the days following the attack on the Capitol, wrenching scenes of police officers battered by the mob drew public outrage. Right wing figures on social media continued to push the baseless narrative in an attempt to blame left wing activists associated with antifa and the Black Lives Matter civil rights movement for the violence. Five people were killed, including a Capitol police officer, and dozens of outnumbered police were injured, many of whom fought hand-to-hand with rioters in an effort to prevent them from breaching the building.", "Some right wing figures pointed to John Sullivan, an accused agent provocateur who filmed the death of Ashli Babbitt, an Air Force veteran and Trump supporter who was shot by police when she tried to break through a barricaded door as rioters broke into the building. Sullivan was arrested in Utah on Jan. 14, 2021, on charges related to the riot.", "For example, right wing junk site Gateway Pundit's headline reported, \"BREAKING: FBI Arrests Antifa Leader John Sullivan in Utah After Storming US Capitol …Update: With FBI Affidavit.\" The story was tweeted by \"Happy Days\" actor and Trump supporter Scott Baio. The unfounded claim has even been embraced by some members of Congress, including U.S. Rep. Mo Brooks, R-Alabama, who has come under fire for an incendiary speech at a rally that preceded the mob attack on the Capitol.", "But Sullivan, a Utah resident, isn't an \"antifa leader,\" and the idea that he's part of the Black Lives Matter movement was rejected by the local chapter in his home state, as The Intercept's Robert Mackey noted in a detailed analysis:", "\"In fact, Sullivan is a curious figure who is treated with suspicion or outright hostility by a number of left-wing organizers associated with Black Lives Matter and antifascism in Utah, California and the Pacific Northwest.\"", "Mackey went on to report that left wing activists in various cities have warned against associating with Sullivan, accusing him of harmful actions and exploiting protests movements for personal gain.", "The FBI said during a Jan. 8, 2021, news conference that there was \"no indication\" that anyone from the antifa movement was involved in the attack. House Minority Leader Kevin McCarthy, a California Republican who has been an outspoken Trump supporter, bluntly rejected the claim that the riot was instigated by left wing activists, stating, \"Some say the riots were caused by antifa. There is absolutely no evidence of that. And conservatives should be the first to say so.\"", "Updated to include information from FBI news conference that there was \"no indication\" of antifa involvement.", "Updated to note that there is no evidence John Sullivan is associated with antifa or the Black Lives Matter movement.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]