["Facebook page Viral in India shared a post on December 22, claiming – “संबित पत्र को बीजेपी प्रवक्ता पद से हटाया गया| अब मंदिर कौन बनाएगा? बफसोस| (Sambit Patra was removed from the post of BJP spokesperson. Now who will get the temple made? Disappointed (translated).” At the time of writing this article, the post attracted over 3,500 shares and 4,000 likes.", "A website India Time 24 published an article along similar lines. It was titled – “संबित पात्रा की छुट्टी, अब इस पूर्व मंत्री को बनाया भाजपा का राष्ट्रीय प्रवक्ता (Sambit Patra was let go, now this former minister is made the national spokesperson for BJP).” The article claimed that the decision was taken after BJP’s loss in the recent assembly elections and the person chosen for the position was BJP MP Rajeev Pratap Rudy.", "A correspondent of Go News 24X7 also made a similar claim, suggesting that Patra will not be addressing BJP press briefings. His tweet attracted over 400 likes and 1,000 retweets.", "The claims floating on social media about Samit Patra’s dismissal are false. The Bharatiya Janata Party (BJP) website lists his name as one of the 10 official spokespersons for the party.", "Rajeev Pratap Rudy, a former union minister, has been appointed as a new spokesperson for the BJP and has no consequence to Patra’s position in the party.", "Alt News also spoke with Patra who confirmed to us that he continues to work with the BJP in the same capacity.", "Samit Patra has often found himself in the crosshairs of misinformation, both being a target and a purveyor.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]