["After virtually ignoring millionaire Rick Scott and his unconventional campaign for governor, Attorney General Bill McCollum launched a full attack on May 18, 2010, criticizing Scott for his role as a former CEO of a national hospital chain that bilked state and federal health care programs.Scott, 57, has been running an unorthodox campaign, spending millions of dollars in television advertising three months before the Republican primary. He's casting himself as an outsider and a reformer.The descriptions get a chuckle from McCollum's campaign.\"The fact that Rick Scott is running for governor as a 'reformer' would be funny if it wasn't so outrageous,\" McCollum campaign manager Matt Williams said. \"This is a man who barely escaped imprisonment, whose failure in business has been portrayed on national news and around the world. He is an embarrassment.\"Democratic frontrunner Alex Sink issued a similar critique saying that Scott's company -- Columbia/HCA -- had pleaded guilty to 14 felonies as part of a federal fraud investigation and was forced to pay a record $1.7 billion in fines. You can see that analysis here.In this item, we wanted to see if the McCollum campaign is right to say Scott \"barely escaped imprisonment.\"First, some background about the Columbia/HCA saga.Scott started what was first Columbia in the spring of 1987, purchasing two El Paso, Texas, hospitals with a plan to brand hospitals -- like soft drinks or a clothes line -- through aggressive growth. The chain quickly grew, and in 1994, purchased the 100-hospital HCA chain. Over time, the publicly traded company swelled to become the nation's largest hospital chain, growing to more than 340 hospitals, 135 surgery centers and 550 home health locations in 37 states and two foreign countries.That's the good news.Now for the bad.In 1997, federal authorities went public with a massive multipronged investigation into Columbia/HCA and whether it was bilking state and federal health care programs, including Medicare and Medicaid.Specifically, authorities were investigating whether the hospital chain ordered unnecessary lab work and billed Medicare and Medicaid for the cost, whether it attached false diagnosis codes to patient records in order to increase reimbursement to the hospitals and whether it billed the government for home health care visits for patients who did not qualify to receive them.Scott resigned as Columbia/HCA's CEO in the middle of the investigation in July 1997.The fraud cases ultimately were resolved as part of two federal settlements -- one in 2000 and another in 2002 -- where Columbia/HCA agreed to pay a record $1.7 billion in fines and also agreed to plead guilty to 14 felonies in five states. The U.S. Justice Department called the Columbia/HCA deal the largest government fraud settlement in U.S. history.How close was Scott to going to prison for his part in the fraud case?Not at all.Four Florida based Columbia/HCA excutives ultimately were indicted as part of the fraud investigation, but not Scott.Two executives, Jay Jarrell and Robert Whiteside, were convicted of defrauding Medicare in 1999 and were sentenced to prison. Jarrell was sentenced to 33 months in prison; Whiteside got 24 months. Those convictions, however, were overturned on appeal.Two other executives also were prosecuted in the case. A Tampa federal jury acquitted Michael Neeb and failed to reach a verdict on Carl Lynn Dick.\"With the reversal of the Whiteside and Jarrell convictions, not a single individual has been convicted as a result of this seemingly limitless cost-report investigation,'' Columbia/HCA's lawyers wrote in a March 2002 court filing.Walter P. Loughlin, HCA's lawyer during the investigation, said Whiteside and Jarrell were the only two executives ever convicted. And while Columbia/HCA did plead guilty to 14 felonies, those were corporate convictions -- meaning no one served prison time.", "We did find an ABC News transcript from August 1997 in which reporter Brian Ross said Scott was a target of federal investigators. On World News Tonight, Ross said: \"Columbia has denied the fraud allegations. But its chairman -- Rick Scott -- and five other top corporate executives have resigned. And federal investigators told ABC News today that Scott is now considered a prime target of the investigation.\"", "But Scott campaign spokeswoman Jennifer Baker said Scott was never even interviewed as part of the case. She pointed us to a 2009 Fortune article. \"Scott's not Bernie Madoff or Leona Helmsley,\" the article said. \"He has never been charged with wrongdoing. He was never even personally contacted by investigators.\"", "McCollum's statement was that Scott \"barely escaped imprisonment,\" but the fact is he was never indicted, and the only individuals convicted of wrongdoing associated with the Columbia/HCA ultimately had those convictions tossed out. The corporate convictions aren't tied to any individual and carry only fines, not prison time. While one ABC News report does say he was a target of an investigation, that doesn't translate to barely escaping a prison sentence. We rate McCollum's claim False.", "Alex Sink campaign, Rick Scott can't talk about accountability, May 18, 2010Alex Sink campaign, e-mail interview with Kyra Jennings, May 18, 2010Bill McCollum campaign, A Fraud Florida Can't Afford, May 18, 2010Rick Scott campaign, FAQs, accessed May 19, 2010Miami Herald, Columbia/HCA downplays probe at annual meeting, Scott defends company's record, May 16, 1997, accessed via Nexis", "Modern Healthcare, Federal agents strike at Columbia's Roots, March 24, 1997, accessed via Nexis", "Modern Healthcare, Columbia's storm builds: Company honchos try to calm workers as troubles swirl, April 07, 1997, accessed via NexisModern Healthcare, Columbia probe widens: Federal raid in 7 states targets lab, home-care records, July 21, 1997, accessed via NexisUSA TODAY, Columbia's new caretaker Physician heal thy firm: Tall task ahead of CEO, July 28, 1997, accessed via NexisSt. Petersburg Times, Top Columbia / HCA officials quit, July 26, 1997, accessed via NexisNew York Times, HCA Is Said To Reach Deal On Settlement Of Fraud Case, Dec. 18, 2002, accessed via NexisU.S. Justice Department, HCA to pay $840 million in criminal fines and civil damages, Dec. 14, 2000U.S. Justice Department, Press statement RE: HCA, Dec. 18, 2002", "The Tennessean, Investors yawn over settlement, Dec. 15, 2000, accessed via NexisInterview with HCA attorney Walter P. Loughlin, May 20, 2010", "Rick Scott campaign, interview with Jennifer Baker, May 20, 2010", "Fortune, What is Rick Scott trying to heal, April 27, 2009, accessed via Nexis", "ABC news, World News Tonight transcript, Aug. 18, 1997, accessed via Nexis", "Bill McCollum campaign, interview with Kristy Campbell, May 21, 2010", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]