["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "The debate between two professors – David Brat and Jack Trammell – vying for the 7th District Congressional seat would of course include points about education.", "\"In K-12 education, our kids are scoring at the bottom of science and mathematics right now in the industrialized world -- at the bottom,\" Brat said during the Oct. 28 debate at Randolph-Macon College, where both he and Trammell teach.", "We asked Brat’s campaign where he got those figures. His spokesman, Brian Gottstein, sent us a column by Stanford University mathematician Keith Devlin that examines the Programme for International Student Assessment, tests in reading, science and math given to 15-year-olds every three years beginning in 2000.", "Most of the 34 member nations belonging to the Organization for Economic Cooperation and Development -- an industrialized group of mostly Western European and North American countries -- participate now. A smattering of other countries, such as Russia, Indonesia and Brazil, and regional educational systems in China also take part. In 2000, 32 countries participated. That grew to 65 nations in 2012, the most recent test year with published results.", "Gottstein referred to a particular quote from Devlin’s column: \"In 2006, American students ranked dead last, 25th out of 25, in math and 21st out of 30 in science. The U.S. also scored worse than ranked countries outside the OECD (considered to be developing nations) like Russia, Azerbaijan, Slovenia and Estonia. Only 1 percent of American 15-year-olds could perform at the highest level, and 27 countries had a higher percentage of 15-year-olds who performed at level 6. And 28 percent of U.S. students appear to have essentially no math skills at all.\"", "We remember from a past fact-check that American students have typically been middle-of-the-pack performers on international tests. But let’s dig a little deeper into the statistics from this column.", "First, let’s look at the United States’ rankings, as reported by the National Center for Educational Statistics:", "Science", "2000: the U.S. scores ranked 14th among the 28 OECD countries and 14th of 32 total nations.", "2003: 19th among 30 OECD countries and 22nd among 41 overall.", "2006: 21st among 30 OECD countries and 27th among 57 overall.", "2009: 17th among 34 OECD countries and 23rd among 65 overall.", "2012: 20th among 34 OECD countries and 28th among 65 overall.", "Math", "2000: the U.S was 18th among 28 OECD countries and 19th of 32 total nations.", "2003: 24th among 30 OECD countries and 27th among 41 overall.", "2006: 25th among 30 OECD countries and 35th among 57 overall.", "2009: 25th among 34 OECD countries and 31st among 65 overall.", "2012: 27th among 34 OECD countries and 36th among 65 overall.", "So, Devlin was correct on the science rank in 2006, but he underplays where the U.S. ranked among its peers on the math score. The U.S. wasn’t \"dead last\" in its math score that year and in fact hasn’t ranked \"dead last\" in any PISA test.", "Also, Brat and Devlin are referring to outdated results.", "We know from the 2012 results that among the 34 industrialized countries in the OECD, the U.S. ranked 27th on the math tests and 20th on the science tests. So the U.S. position among its peers on math and science tests has edged up slightly.", "In summarizing the U.S. results in the latest tests, the OECD said the U.S. math scores were \"below average\" among the industrialized countries in that organization. The U.S. science scores, the group said, were \"close to the OECD average.\"", "Our ruling", "Brat said U.S. students rank \"at the bottom\" in math and science scores among industrialized nations.", "U.S. students have not fallen quite to the very bottom of the stack. The latest testing shows U.S. students rank near the middle of the pack among industrialized nations for science scores and in the bottom tier for math scores.", "The performance is nothing to celebrate, but Brat is wrong when he says twice in his statement that U.S. students rank \"at the bottom\" of developed nations in math and science scores.", "We rate his claim False.", "Dave Brat’s comments at the Ashland debate, Oct. 28, 2014.", "Email from Brian Gottstein, Brat campaign manager, Oct. 30, 2014.", "Mathematical Association of America blog by Keith Devlin, \"Wanted: Innovative Thinking,\" July 2010.", "PolitiFact Virginia, \"McDonnell says U.S. education is ‘slipping’ behind other nations,\" Feb. 8, 2013.", "National Center for Education Statistics, \"Highlights from PISA 2009: performance of U.S. 15-Year-Old Students in Reading, Mathematics, and Science Literacy in an International Context,\" December 2010.", "NCES, \"Highlights from PISA 2006: Performance of U.S. 15-Year-Old Students in Science and Mathematics Literacy in an International Context,\" December 2007.", "NCES, \"International Outcomes of Learning in Mathematics Literacy and Problem Solving: PISA 2003 Results from the U.S. Perspective,\" December 2004.", "NCES, \"Outcomes of Learning: Results from the 2000 program for International Student Assessment of 15-Year-Olds in Reading, Mathematics, and Science Literacy,\" December 2001.", "NCES, \"Highlights from PISA 2012: performance of U.S. 15-Year-Old Students in Reading, Mathematics, and Science Literacy in an International Context,\" April 2014.", "The Organization of Economic Development, \"Program for International Student Assessment (PISA): Results from PISA 2012\" accessed Oct. 30, 2014.", "OECD, PISA 2006 results, Chapter 6 Tables for specifics on mathematics scores.", "OECD, PISA 2012 results, Download Tables for Chapter 2 math performance.", "K-12 Blueprint, \"U.S. Students receive average scores on international PISA assesments,\" Dec. 5, 2013.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]