["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "In this Aug. 2, 2018, file photo, David Reinert holding a Q sign waits in line with others to enter a campaign rally with President Donald Trump in Wilkes-Barre, Pa. (AP)", "Rep. Brian Fitzpatrick, R-Penn., voted against impeaching Trump. But Fitzpatrick rejected the falsehood of a stolen election, and co-wrote a resolution to censure Trump for inciting violence at the Capitol.", "Fitzpatrick in September co-sponsored a resolution condemning QAnon and its conspiracy theories.", "House Democrats are trying to hang the QAnon label around the necks of as many Republicans as possible.", "Rep. Marjorie Taylor Greene gave Democrats their moment. The Georgia Republican has praised QAnon and its baseless premise that former President Donald Trump was secretly battling a global cabal of Satan-worshiping pedophiles.", "As House Republicans tangled over how to deal with Greene, Democratic leaders kept QAnon front and center.", "House Speaker Nancy Pelosi referred to Minority Leader Kevin McCarthy in a press release as \"Q-Calif.,\" in place of the conventional \"R-Calif.\"", "When Republicans declined to strip Greene of her committee assignments, Democrats (along with 11 Republicans) broke with precedent and voted to remove her themselves.", "The Democratic Congressional Campaign Committee unveiled what it called the first ads in the 2022 midterm elections. It targeted seven Republicans, along with McCarthy, as \"too weak to stand up to President Trump and the QAnon mob.\"", "Rep. Brian Fitzpatrick, R-Pa., was on the DCCC’s list. The ad featured shots of the mob, many under the QAnon banner, attacking the Capitol.", "\"Republicans like Brian Fitzpatrick voted to protect Trump letting the QAnon mob win,\" the Feb. 2 ad said. \"Congressman Brian Fitzpatrick should have stood with us, but he was a coward. He stood with Trump and the lies. Congressman Brian Fitzpatrick. He stood with Q, not you.\"", "Fitzpatrick won reelection easily in a largely suburban district outside Philadelphia. But Joe Biden carried it with 53% of the vote, a possible reason for Democrats to target the seat.", "The ad’s core accuracy problem is that while Fitzpatrick in January voted against impeaching Trump, he introduced a resolution to censure the then-president. Months prior, he condemned the QAnon theory in a resolution that won bipartisan support.", "In September 2020, Fitzpatrick joined two Democrats and two Republicans to cosponsor a House resolution that rejected QAnon and all it stood for. It condemned QAnon for spreading its unfounded belief in a pedophilia ring, and for how it \"expanded to embrace virtually every popular conspiracy theory of the last several decades, from questioning the truth about the September 11th terrorist attacks, to believing in alien landings, to denying the safety of vaccines.\"", "The resolution noted that the FBI had determined that QAnon likely motivated domestic terrorists. It said QAnon beliefs \"undermine trust in America’s democratic institutions, encourage rejection of objective reality, and deepen our Nation’s political polarization.\"", "The measure passed Oct. 2 on a 371-18 vote.", "Fitzpatrick did not support impeaching Trump for inciting the attack on the Capitol. He said impeachment would throttle any hope of unity to help the nation deal with its problem.", "But he did press for a resolution that would put Congress on record as condemning \"his reprehensible conduct which led to the riots at our nation’s Capitol.\"", "The resolution blamed Trump for his false claim that ‘‘we won this election, and we won it by a landslide.\" It said Trump’s words \"encouraged — and foreseeably resulted in — lawless action at the Capitol.\" It said Trump had betrayed his trust as president, and \"threatened the integrity of the democratic system, interfered with the peaceful transition of power, and imperiled a coequal branch of Government.\"", "Fitzpatrick offered the resolution along with six other Republican members, but the measure went no further.", "Fitzpatrick voted against impeachment. Whatever his reason, the vote strengthened Trump’s hand. For the DCCC, this vote was telling.", "\"Congressman Fitzpatrick had an opportunity to join 10 of his Republican colleagues and vote for the bipartisan articles of impeachment that held President Trump accountable,\" said DCCC communications director Cole Leitner. \"Instead he caved to his president, and now he owns that vote.\"", "Leiter argued that Fitzpatrick’s actions calling for opposition to QAnon and censure of Trump don’t carry the same weight as impeachment. The condemnation of QAnon was non-binding, and the censure of Trump was stillborn, he said. By contrast, the impeachment vote was a binding resolution of constitutional importance.", "We reached out to Fitzpatrick’s office and did not hear back.", "A Democratic ad said Fitzpatrick \"stood with Trump and the lies… He stood with QAnon, not you.\"", "Fitzpatrick’s vote against impeachment carried the most legal heft of any of his actions. Regardless of whether Fitzpatrick saw it as supporting Trump, his vote fell on the plus side of the ledger for Trump.", "But Fitzpatrick publicly criticized Trump. He spoke against the lies of election fraud. He also publicly condemned QAnon.", "The claim has an element of truth, but mistates other facts. We rate it Mostly False.", "Democratic Congressional Campaign Committee, Fitzpatrick stood with Q, not you, Feb. 2, 2021", "Democratic Congressional Campaign Committee, DCCC Targets Vulnerable Republicans Over QAnon Ties in First TV Ads of 2022, Feb. 2, 2021", "U.S. Congress, H.Res.1154 - Condemning QAnon, Oct. 2, 2021", "Brian Fitzpatrick, Fitzpatrick Statement on Impeachment, Jan. 13, 2021", "U.S. Congress, Censuring and condemning President Donald J. Trump, Jan. 12, 2021", "Office of the Clerk of the U.S. House of Representatives, H.Res. 24 Resolution of impeachment, Jan. 13, 2021", "Washington Post, Democratic attack ads misleadingly link swing-district Republicans to QAnon, Feb. 4, 2021", "PolitiFact, What Rep. Marjorie Taylor Greene has said about election fraud, QAnon and other conspiracy theories, Feb. 2, 2021", "Interview, Cole Leitner, communications director, Democratic Congressional Campaign Committee, Feb. 5, 2021", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]