["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A protester holds a sign in front of Planned Parenthood of Kansas and Mid-Missouri in Columbia, Mo., on July 28, 2015. (Don Shrubshell/Columbia Daily Tribune via AP)", "Republican presidential candidate Mike Huckabee supports the federal government cutting off more than $500 million to Planned Parenthood, calling the organization \"an industry of abortion\" in a recent Fox Business Channel interview.", "His interviewer, Fox Business reporter Sandra Smith, did not disagree — and she offered numbers to back up her point.", "\"Almost 95 percent of all their pregnancy services were abortions,\" Smith said as she guest-hosted Mornings with Maria on July 28, 2015.", "We wanted to know if the percentage of abortions was really that high.", "We reached out to Smith for comment but did not hear back.", "'Pregnancy services'", "Viewers may miss that Smith’s statement refers only to \"pregnancy services.\" By choosing those words, she is likely referencing a fact sheet by the Susan B. Anthony List, a political action committee that opposes abortion and supports anti-abortion candidates.", "The Susan B. Anthony List’s numbers derive from Planned Parenthood’s 2013-14 annual report.", "The first caveat to know is that Planned Parenthood does not have a category for \"pregnancy services.\" That’s a category the Susan B. Anthony List created, and the background reasoning has been the same as similarly misleading claims over the years.", "On the fact sheet, \"pregnancy services\" are broken down into three categories: abortions, prenatal care and adoption referrals. Susan B. Anthony List spokeswoman Mallory Quigley said these are the three ways a woman can respond to a pregnancy.", "With that in mind, here’s the section from Planned Parenthood’s annual report that contains those categories.", "To arrive at the Susan B. Anthony List figure, you have to tease out specific elements from the chart: prenatal services (18,684), adoption referrals (1,880) and abortions (327,653). Abortions account for 94 percent of the sum of these subcategories.", "For several reasons, that’s a misleading way to analyze the data.", "Referrals for prenatal care not in equation", "Not all of Planned Parenthood approximately 700 clinics offer prenatal services because prenatal care is not Planned Parenthood's focus. As a result, many pregnant women are referred to outside obstetricians or other health providers for prenatal care.", "How many? It's impossible to know.", "Planned Parenthood does not record how many pregnant patients are referred to outside health care providers, said Elizabeth Clark, a Planned Parenthood spokeswoman.", "If referrals were included, the 95 percent figure would likely change, though we can't say by how much — and neither can Smith nor the Susan B. Anthony List.", "The rest of the story", "Planned Parenthood does not specifically track of the number of pregnant women who come into clinics for other reasons. And many of Planned Parenthood's services are not related to prenatal care, abortion or adoption.", "Testing and treatment for sexually transmitted disease and infection, both for men and women, accounts for the largest share of services provided by Planned Parenthood at more than 4.47 million.", "Contraception, which includes birth control, emergency contraception kits, and sterilization and vasectomy procedures, accounts for more than 3.58 million services. Different types of cancer screening and prevention, including breast exams, account for 935,573 services.", "As show on the chart above, there were also more than 1.1 million pregnancy tests, 47,2000 urinary tract infection treatments, or 65,500 \"family practice services.\"", "Over the course of 2013-14, Planned Parenthood performed more than 10.5 million services. Sometimes patients are double-counted because they receive multiple services. Put another way. Planned Parenthood clinics saw 2.7 million individual patients that year.", "Of all services, abortions account for 3 percent of services performed, said Erica Sackin, a Planned Parenthood spokeswoman, pointing to page 18 of the report.", "But looking at the share of abortions per patient (and assuming one procedure per patient), the figure rises to 12 percent.", "Some critics have taken issue with Planned Parenthood’s measurement of \"services.\" Performing an abortion is more involved than administering pregnancy tests or giving someone a contraception kit, for example. The share of abortions might be different if cost or hours of services were used. (However, that information is not in the 2013-14 annual report.)", "Our ruling", "Smith said, \"Almost 95 percent of all (Planned Parenthood's) pregnancy services were abortions.\"", "An anti-abortion group puts the figure at 94 percent using a cherry-picked method that ignores the majority of Planned Parenthood's services, which aim to prevent pregnancies. The group describes \"pregnancy services\" as counting what Planned Parenthood does for women once they are already pregnant.", "But Planned Parenthood does not fully track this number, making the claim a leap of logic based on insufficient information. What's most noticeably missing among the number of Planned Parenthood services used by pregnant women are the number of pregnancy referrals.", "Planned Parenthood says it doesn't keep records of how many pregnant women are referred to outside healthcare providers. Without that information, we don't know an accurate percentage of \"pregnancy services\" that were abortions. Neither, however, does Smith.", "We rate the claim False.", "UPDATE: After this fact-check published, an official with Planned Parenthood contacted us and said that she was not authorized to speak on the record. A spokeswoman who is authorized to speak on the record, Elizabeth Clark, then provided us the same information. We've updated this fact-check to include her comments.", "Mornings with Maria transcript, July 28, 2015, accessed via Nexis", "PolitiFact Rhode Island, \"R.I. Bishop Thomas Tobin says abortions make up 94% of Planned Parent services for pregnant women,\" March 2, 2015", "PolitiFact Ohio, \"Rep. Jean Schmidt says 32 of every 33 pregnant women who visit Planned Parenthood get abortions,\" April 21, 2011", "Susan B. Anthony List, \"Fact Sheet: Planned Parenthood’s 2013-2014 Annual Report,\" accessed July 30, 2015", "Issuu.com, \"Planned Parenthood 2013-2014 Annual Report,\" accessed July 30, 2015", "Phone interview with Erica Sackin, Planned Parenthood spokeswoman, July 29, 2015", "Phone interview with Catherine Lozada, Planned Parenthood press officer, July 30, 2015", "Email interview with Elizabeth Clark, Planned Parenthood spokeswoman, Aug. 5, 2015", "Email interview with Mallory Quigley, spokeswoman for Susan B. Anthony List, July 30, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]