["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Michigan Gov. Gretchen Whitmer did not vow to meddle in the presidential election if Democratic nominee Joe Biden doesn’t win. But a recent quote that social media users have attributed to the Democrat suggests otherwise.", "\"I will not certify the vote in my state for Donald Trump, no matter the outcome,\" the statement says.", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Chelsea Lewis, a spokesperson for Whitmer, told us the governor didn’t say this.", "We also couldn’t find any evidence that she did.", "Searching for the quote online resulted in only three hits, two of which led to the fact-checking site Lead Stories, which concluded that Whitmer did not say this. The third site that turned up in the search results linked to that fact-check.", "In October, President Donald Trump warned his supporters that they should be careful of Whitmer and Michigan’s attorney general, Dana Nessel, who is also a Democrat.", "\"Because you know they’re like in charge of the ballot stuff,\" Trump said at a rally on Oct. 17. \"How the hell do I put my political and our country’s political life in the hands of a pure partisan like that?\"", "Nessel responded to the president’s claim on Twitter later that day.", "\"In nearly every state of the union, including Michigan, the Secretary of State is ‘like in charge of the ballot stuff,’\" she tweeted. \"I AM law enforcement. And you can bet our election will be safe and the vote will be protected.\"", "The Michigan secretary of state website explains the election process. After residents vote, the site says, the results are reviewed by the Board of Canvassers in each city, township and county. The canvassers certify the election results from their jurisdictions and a four-member Board of State Canvassers certifies the results of all statewide offices, district offices that cross county lines and statewide ballot proposals.", "Each Board of Canvassers includes two Republicans and two Democrats. Once all the canvassers have met, the results are considered final.", "We rate the claim that Whitmer said she wouldn’t certify the state’s election results False.", "This fact check is available at IFCN’s 2020 US Elections #Chatbot on WhatsApp. Click here, for more.", "Facebook post, Nov. 3, 2020", "USA Today, Trump rally crowd chants ‘lock her up’ about Michigan Gov. Whitmer, target of alleged kidnapping plot, Oct. 17, 2020", "Dana Nessel tweet, Oct. 17, 2020", "Michigan Secretary of State, Get to know your election officials, visited Nov. 4, 2020", "Email interview with Chelsea Lewis, deputy press secretary, Gov. Gretchen Whitmer, Nov. 4, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]