["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "• There is no evidence President Ronald Reagan said this.", "• The Ronald Reagan Presidential Foundation and Institute confirmed the quote was false on its official Facebook page.", "Just because you were president years before the rise of social media doesn’t mean you won’t be the subject of online misinformation.", "One recent social media post invokes President Ronald Reagan and credits him with what appears to be a fabricated quote.", "\"Boy, Ol’ Ronnie nailed this one,\" the image shared on Facebook says, just above a picture of Reagan smiling. Beneath the photo, the alleged Reagan quote follows:", "\"Keep voting Democrat ... One day they will restrict your freedoms, restrict your history and restrict your safety. All in the name of professional victims that don't understand the consequences of their ignorance.\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Reagan did not say this about Democrats.", "In a July 22 post, the official Ronald Reagan Presidential Foundation and Institute Facebook page confirmed that the quote was not accurate.", "\"It has come to our attention that there is a photo of President Reagan circling around that contains the following quote,\" the post says, before showing the misattributed quote. \"We would like to assure you that this quote is indeed false and President Reagan never said those words.\"", "Melissa Giller, the Ronald Reagan Presidential Foundation’s chief marketing officer, said their search also did not reveal any indication that Reagan ever made these remarks.", "\"We have searched all of President Reagan's public papers and cannot find any mention of the quote,\" Giller said in an email.", "Jennifer Newby, an archivist at the Ronald Reagan Presidential Library and Museum, also said there was no evidence Reagan ever said this.", "\"We have searched his official speeches from 1981-1987,\" she said in an email. \"We are unable (to) find this quote in any of his speeches given in official capacity.\"", "After conducting searches for the full quote and for various portions of the quote — including \"restrict your freedoms,\" \"restrict your safety,\" \"professional victims\" and more — PolitiFact found no evidence that Reagan said this quote on the National Archives or the Ronald Reagan Presidential Library archives.", "Despite the fact that this quote was debunked by other fact-checking organizations in July, the claim has continued to spread online.", "We rate this claim False.", "Facebook post, July 30, 2020", "Snopes.com, \"Did Ronald Reagan Say ‘Keep Voting Democrat’ If You Want Freedoms Restricted?\" July 20, 2020", "USA Today, \"Fact check: Ronald Reagan didn’t say Democrats would restrict freedoms,\" July 21, 2020", "Check Your Fact, \"Fact Check: ‘They Will Restrict Your Freedoms’ – Did Ronald Reagan Say This Quote About Democrats?\" July 30, 2020", "Facebook, \"The Ronald Reagan Presidential Foundation and Institute,\" July 22, 2020", "The National Archives, Search for the phrase \"professional victims\" and others, accessed Sept. 23, 2020", "Ronald Reagan Presidential Library and Museum, Search for the phrase, \"restrict your freedoms\" and others, accessed Sept. 23, 2020", "Email interview with Jennifer Newby, archivist at the Ronald Reagan Presidential Library and Museum, Sept. 23, 2020", "Email interview with Melissa Giller, chief marketing officer at The Ronald Reagan Presidential Foundation, Sept. 23, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]