["About this rating", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "In December 2020, one year after the COVID-19 disease was first detected in Wuhan, China, pharmaceutical companies Pfizer and Moderna both rolled out vaccines for what has become a global pandemic. Both vaccines have been approved for emergency use in the U.S.", "And the Vatican assured observant Catholics in a page-long statement released on Dec. 21, 2020, that even though the vaccines were developed with the use of cells derived from fetuses aborted decades ago, it is \"morally acceptable\" for Catholics to receive one.", "The Vatican stated that in the absence of other options, the role of vaccine recipients in an abortion that \"occurred in the last century\" is \"remote,\" and in the face of the \"grave danger\" posed by the ongoing pandemic virus, Catholics have the moral duty to protect their own health.", "But Catholics also should act in the interest of the common good, and in this case that means protecting the health of those most vulnerable to the virus and preventing its further spread, according to the Vatican's Congregation for the Doctrine of Faith, the office tasked with defending Catholic doctrine.", "Even so, the Vatican also stated that \"use of such vaccines does not and should not in any way imply that there is a moral endorsement of the use of cell lines proceeding from aborted fetuses.\"", "The statement from the Vatican comes after two U.S. bishops. one in California and one in Texas, stated publicly that they wouldn't take the vaccines, denouncing them as immoral because of the use of research on aborted fetal cells in their development.", "Although the cells used to produce the vaccines had their origins in two aborted fetuses in procedures that happened decades ago, the cells themselves have been self-replicating in laboratories for years, meaning that scientists don't rely on continuous abortions to obtain them.", "\"They’re relying on self-replicating cells that have been around for decades in test tubes, from one abortion that took place in about 1972 and another in the mid-80s,” Dr. Meredith Wadman, an author and science journalist, explained to Utah-based television news station KSL-TV.", "Wadman added, \"The manufacturing of these new COVID vaccines that rely on fetal cells and of standard childhood vaccines do not require ongoing abortions, do not require any kind of women on an ongoing basis handing over their aborted fetuses to science. That’s just not true.”", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]