["The posts generally begin in the same way, with an introduction in uppercase letters that reads: “TRUMP HAS SPOKEN AGAIN. JUST THE TRUTH. DONALD TRUMP’S SPEECH ON ‘RISE UP AFRICANS’.”", "Archived examples can be seen here, here and here.", "The “speech” contains offensive comments about Africans and claims the continent is “on the verge of collapse”, with Trump’s name included at the end.", "Data from CrowdTangle, a social media analysis tool, shows how this version of the claim has seen more reposts with each spike in activity since August 2019 when it seemed first to gain traction. This November 2019 post, for example, has been shared more than 12,000 times.", "By searching selected paragraphs, AFP Fact Check found a previous version, beginning with another introduction in uppercase letters that reads: “DONALD TRUMP'S SPEECH ON WHY HE HATES AFRICANS & ARABS”.", "Most of these posts -- like this one shared more than 6,200 times -- were published in 2017 and 2018.", "The content of the two texts is strikingly similar, although the earlier version is longer, opens differently and disparages Arabs as well as blacks. Again, Trump is identified as the author at the end.", "None of the hundreds of posts say where or when either of the “speeches” was supposedly delivered or published.", "AFP Fact Check searched an online archive of Trump’s tweets and could find no mention of the “speeches” or extracts from them.", "The older claim, which targets Arabs as well, was also shown to be false by two US fact-checking organisations here and here in 2015 when social media first began linking Trump actively to the text.", "Further evidence against the claim can be found in 2014, when a spate of posts, like these here and here, passed off the same “blacks and Arabs speech” as the work of Israeli Prime Minister Benjamin Netanyahu. It was the same year that Israel launched Operation Protective Edge in Gaza.", "A closer reading reveals that certain words, names and locations were changed or added to give it an Israeli context.", "AFP Fact Check found an online reference to an email from 2009 that was circulating in South Africa and claiming to share a reprinted speech given by former apartheid president PW Botha in 1985 in the coastal city of Durban. The email further claimed, without specifying a date, that this speech was published in the country’s flagship weekend newspaper, the Sunday Times.", "The wording of the text in that email (since reproduced in Facebook posts here and here) bears an almost perfect resemblance to the claim doing the rounds on Facebook more than a decade later in Trump’s name.", "But neither claim is true -- Botha’s actual speech, known as the Rubicon address, is different. While it certainly caused shockwaves at the time for keeping South Africa on the apartheid trajectory, it was not the one found in the hoax email.", "Secondly, the fabrication was never published in the Sunday Times. The newspaper has issued denials at least twice over the years, according to an exchange of correspondence between editors and the country’s Press Ombudsman.", "The first of these occasions saw a printed denial in the paper’s Hogarth column in 2004. The second denial, on the advice of the ombudsman’s office, was published online in 2010 after the hoax had begun resurfacing and the title was asked to put up a fresh denial on its website.", "The evidence, therefore, shows that this earliest fabrication was more than likely the precursor to all the other versions of the claim.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]