["On June 19, several media outlets reported that the Indian Air Force (IAF) deployed Apache helicopters in Ladakh in the wake of the border dispute with China. Soon after, a 12-second video of helicopters flying close to a water body went viral. As per social media claims, the video shows Indian Apache helicopters patrolling over Pangong Tso in Ladakh. It’s been widely shared on Twitter, YouTube and WhatsApp. Even a couple of media outlets have shared the video or its stills. On June 23, Nation Next, a verified digital news platform on YouTube, posted the video (archive link).", "Maj Gen Brajesh Kr (@bkum2000) tweeted the viral video and wrote, “Superb…Our Apache attack helicopters patrol over Pangong Tso in Ladakh Appreciate”. This was viewed over 2.5 lakh times.", "Superb…Our Apache attack helicopters patrol over Pangong Tso in Ladakh 👏🏼👏🏼 Appreciate pic.twitter.com/D20wwDsRdg", "— Maj Gen Brajesh Kr (@bkum2000) June 24, 2020", "On June 25, Amar Ujala uploaded five screenshots from the video along with the viral claim (archive link).", "A keyword search on Facebook led us to the same video uploaded on the page of California-based Hangar 24 Craft Brewing. The caption of the video read, “Hangar 24 Lake Havasu City Hangar 24 Orange County Hangar 24 Redlands.” Lake Havasu is located in Arizona, California.", "Going through the comments section we found several replies by ‘Ron Warren’ who shared other visuals from the day.", "In fact, Warren seemed to be one of the pilots. He wrote that the flight in Lake Havasu was “one of the finest of his career”.", "A quick scroll through Warren’s Facebook profile reveals that he served in the US military. Warren had uploaded a picture where a similar Apache helicopter can be seen in the background.", "A video of Apache helicopters flying over Lake Havasu in the US is thus being falsely shared as Indian choppers patrolling over Pangong Lake in Ladakh.", "Alt News spoke with a defence journalist and sources in the armed forces (identities concealed at request) who said that the colour of the helicopters in the video does not match the colour of Indian choppers.", "The key differences in the make of the helicopters in the video and Indian choppers are jotted below.", "1) Colour IAF helicopters are grey in colour, unlike the ones seen in the video.", "2) Roundel and fin flash The tricolour roundel and fin flash are not present on the helicopters in the viral video. According to IAF PRO, both markings are identifiers of Indian military aircraft.", "The images of Apache helicopters below were posted by Boeing (top) and ANI (bottom). In both the images, the roundel and fin flash are visible.", "In May 2019, India acquired its first Apache Guardian helicopter when the IAF had tweeted, “#ApacheInduction: First AH-64E (I) Apache Guardian helicopter was formally handed over to the IAF at Boeing production facility in Mesa, Arizona, USA on 10 May 19. Air Mshl AS Butola, represented the IAF & accepted the first Apache in a ceremony at Boeing production facility.” To view other images and videos of the IAF Apache helicopters click on this link.", "#ApacheInduction: First AH-64E (I) Apache Guardian helicopter was formally handed over to the IAF at Boeing production facility in Mesa, Arizona, USA on 10 May 19. Air Mshl AS Butola, represented the IAF & accepted the first Apache in a ceremony at Boeing production facility. pic.twitter.com/FzA0IfRine", "— Indian Air Force (@IAF_MCC) May 11, 2019", "As per a joint statement by Press Information Bureau, Government of India and Ministry of Defence on May 11, “The helicopter has been customized to suit IAF’s future requirements and would have significant capability in mountainous terrain. The helicopter has the capability to carry out precision attacks at standoff ranges and operate in hostile airspace with threats from the ground.”", "The video was initially shared without any claim. From the Twitter handle @Rotarywings1, the clip gained 5.6 lakh views after it was posted on June 23 (archive link).", "Apaches in low flying (getting wet) pic.twitter.com/ZBWuLW0kCm", "— Rotarywing (@Rotarywings1) June 23, 2020", "@Rotarywings1‘s tweet was shared by Twitter user Aviator Anil Chopra who wrote, “Apaches. Looks so much like the #PangongTso Lake And why not.” It’s important to note that Chopra’s Twitter bio states that he is a former Air Marshall in the Indian Air Force. His tweet was retweeted over 1500 times (archive link).", "Similarly, another Twitter user Mihir Shah (@elmihiro) shared @Rotarywings1’s tweet and claimed that the helicopter in the viral video is the Indian Navy’s Sea King which is conducting anti-submarine operations at Pangong Tso. This was retweeted over 400 times (archive link).", "The Indian Navy’s Sea King helicopters with mast-mounted sonars conducting anti-submarine operations at Pangong Tso. pic.twitter.com/bpVcuoeoCG", "— Mihir Shah (@elmihiro) June 23, 2020", "Mihir Shah, who is an aviation writer and a contributor to Livefist, clarified that his post was sarcastic. However, since it was one of the earliest tweets mentioning Pangong Tso, it led to false claims.", "[Update: A clarification was added to the report on July 2, 2020, that Mihir Shah’s tweet was sarcastic in nature. The roundel was identified as Indian Air Force insignia. This has been rectified to insignia used on Indian military aircraft.]", "Donate Now", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]