["The 25-second clip was filmed at night and shows people fleeing through smoke while sirens sound and a voice calls for help.", "The video was published in multiple Facebook posts, including this one published on June 26, 2019, which has been viewed more than 300,000 times and shared more than 5,600 times.", "The Arabic-language caption translates to English as: “Just in: The halal nightclub in Saudi Arabia explodes and news of the death of dozens. Reminder the nightclub was opened only about 20 days ago”.", "Below is a screenshot of the misleading Facebook post:", "This BBC article dated June 12, 2019 reports on the opening of a temporary nightclub in the Saudi capital Jeddah – a branch of the international White nightclub chain billed as a “halal disco” or “high-end cafe”, where alcohol is not allowed.", "The video in the misleading Facebook post contains an Arabic language voiceover which translates to English as:  “Please report this to senior officials in the kingdom, the bombing (on us) has not stopped for four hours.. I swear to God more than 20 houses were attacked, there are victims… I don’t know if they are taking over the area, please make our voices heard, take this to the senior officials in the Kingdom”.", "The video has also been shared with a similar claim on Facebook here and here, while this YouTube video, also published June 26, 2019, contains parts of the clip alongside a similar claim.", "The claim is false; the clip has been circulating online since 2014 in reports about security forces dispersing a protest in Kuwait.", "The same video was published here on July 7, 2014 on the verified Youtube account of Kuwaiti news blog Alziadiq8.", "The video's Arabic caption translates to English as: “A Kuwaiti child tries to escape from gas bombs fired by special forces on the 8th Dignity of a Nation march”.", "This voiceover heard in the videos in the misleading posts cannot be heard in the AlziadiQ8 video.", "Below is a screenshot comparison from the AlziadiQ8 video (L) and the video in the misleading Facebook post (R):", "The July 2014 Kuwait protests were also covered by international media outlets in reports including similar imagery, such as Al Jazeera here and in this AFP report dated July 7, 2014.", "This is not the first time that the video has been shared in a misleading context. In June 2019, it began circulating alongside claims that it depicted Yemeni rebels taking control of some areas in Saudi Arabia.  AFP’s Arabic-language fact-checking team published this report on June 14, 2019, debunking that false claim.", "Since the appointment of Prince Mohammed bin Salman as crown prince in 2017, Saudi Arabia has been trying to present a more open and liberal image of the conservative kingdom.", "It has made important social changes and economic reforms, such as allowing women to drive, reopening cinemas and receive concerts by Arab and foreign artists.", "The White nightclub in Jeddah was temporarily closed down by the authorities on its opening night on June 13, 2019, according to reports in Gulf News here and Euronews here.", "Serge Dagher, the White group's public relations officer, told AFP last month that the cafe's last activity would be on July 18.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]