["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "President Trump appears at John Murtha Johnstown-Cambria County Airport in Johnstown Oct. 13, 2020, for his first rally in Pennsylvania since his COVID diagnosis. TOM GRALISH / Inquirer Staff Photographer", "President Donald Trump returned to Pennsylvania on Tuesday for the first time since his COVID-19 hospitalization and told supporters at a rally in Johnstown that he’d revived the nation’s struggling coal mining industry.", "\"We’re putting our great coal miners back to work,\" Trump said.", "We wondered whether the president fulfilled a campaign promise he made four years ago to bring back coal.", "He may have stopped the bleeding, but he hasn’t revived the industry.", "Before the pandemic, there were about as many coal miners in the U.S. as there were when Trump took office, roughly 50,000. Stasis was a big improvement compared to the heavy losses the industry suffered under President Barack Obama, when the workforce shrunk by 40 percent. Still, the revival Trump promised never materialized. There are 6,400 fewer miners today than when he took office.", "So, what happened?", "One of Trump’s first executive orders ended a ban on coal mining on federal lands and scrapped Obama’s plan to reduce greenhouse gas emissions.", "\"Come on, fellas,\" Trump told the miners who had assembled for the signing ceremony in March 2017. \"Basically, you know what this is? You know what it says, right? You’re going back to work.\"", "The Trump administration rolled back a slew of environmental rules that had harmed the industry and tried to stop coal-fired power plants from closing. It even spent $1 billion in taxpayer money on coal, including the development of smaller coal plants that could be fired up more quickly than larger facilities to better meet the fluctuating needs of the electrical grid.", "But coal production has declined 31% since Trump took office, and by some estimates, more than five dozen coal-fired power plants have closed.", "\"The fall of coal is first and foremost a market story,\" University of Colorado economist Daniel Kaffine told The Guardian last month. \"The days of coal supplying the majority of U.S. electricity production are not coming back.\" And while some coal is still needed to make steel, the practice of burning coal for energy is in a \"death spiral,\" he said.", "Utilities continue to shun coal in favor of far less expensive natural gas, and there’s little Trump — or any president — can do about it.", "Two dozen U.S. power companies, including Duke Energy Corp. and Southern Co., have pledged net-zero emissions by mid-century, and no new coal plants are planned for construction, according to E&E News.", "And because these changes require utilities to make sizable capital investments, they are not easy to reverse.", "\"Loosening environmental regulations hasn't really helped much, as switching away from coal is driven by market rather than regulatory factors,\" said Anna Mikulska, a fellow at Rice University's Center for Energy Studies. \"The cost of natural gas and renewable power has declined steadily, and coal cannot compete.\"", "Coal once accounted for more than half of all U.S. electricity generation, but this year, the U.S. Energy Information Administration expects coal to account for just 18%, a smaller share than renewable energy sources for the first time.", "Pennsylvania’s mining industry is hurting, too.", "In April, Pittsburgh area mining giant Consol slowed production at its Enlow Fork mine in Washington County, citing low demand. And just over the border in West Virginia, Longview Power, the nation’s most efficient coal-fired power plant, filed for bankruptcy that same month, citing the pandemic.", "Trump said he put coal miners back to work. He stabilized the industry after years of losses under Obama, but then the pandemic began, and the subsequent recession turbocharged the hobbled industry’s decline. The 6,400 job losses the mining industry has suffered in recent months tracks with utility companies’ waning demand for coal. We rate Trump’s statement Mostly False.", "PolitiFact, \"Trump policies have slowed coal’s decline, but strong comeback not evident,\" July 15, 2020", "U.S. Bureau of Labor Statistics, \"Coal mining employees,\" accessed Oct. 14, 2020", "The White House, \"Remarks by President Trump at Signing of Executive Order to Create Energy Independence,\" March 28, 2017", "The New York Times, \"E.P.A. Relaxes Rules Limiting Toxic Waste From Coal Plants,\" Aug. 31, 2020", "The New York Times, \"‘The Coal Industry Is Back,’ Trump Proclaimed. It Wasn’t,\" Oct. 5, 2020", "Kallanish Energy, \"Trump administration invests in ‘new future’ for coal,\" July 20, 2020", "Bloomberg Green, \"Trump Made a Promise to Save Coal in 2016. He Couldn’t Keep It,\" Sept. 3, 2020", "The Guardian, \"'My friends were lied to': will coalminers stand by Trump as jobs disappear?\" Sept. 24, 2020", "OilPrice.com, \"Cheap Natural Gas To Remain Fuel Of Choice For Decades To Come,\" July 22, 2020", "E&E News, \"More coal has retired under Trump than in Obama's 2nd term,\" June 22, 2020", "State Impact Pennsylvania, \"The coal industry was already struggling. Now it’s getting hammered by coronavirus,\" April 27, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]