["Nairobi governor Mike Sonko shared the video in this post on Facebook with the caption “Somali President exchanges blows with his Deputy”. Since August 14, 2020, it has had more than 150,000 views, 2,000 shares and more than 1,500 comments.", "Several other Facebook posts (here, here, here and here) made the same claims.", "Articles published in Zimbabwe here and Nigeria here purported that the fight was between Somalia’s President Mohamed Abdullahi Farmajo and the country’s acting prime minister, Mahdi Mohamed Guled.", "According to the reports, “the Somalia president suddenly stood up during a press conference and started punching his deputy”.", "“It is not yet understood what led to the altercation because the two were holding hands and the next thing, fists were flying,” one of the articles reads.", "Meanwhile, Facebook posts in French (here, here and here) claimed that the clash involved Somalia’s president and the speaker of the country’s national assembly.", "However, all of these claims are false.", "Video from Somaliland, not Somalia", "A close look at the video reveals the words “shirgudoonka golaha wakiilada” written on a sign in front of one of the men’s seats. This is written in Somali -- a language that is spoken in both Somalia and Somaliland -- and translates to “the speaker of the House of Representatives”.", "The flag that appears behind the two men is not Somalia’s, which features a white star on a blue background. It corresponds to the flag of Somaliland, a self-proclaimed state on the edge of the Horn of Africa, which gained independence from Somalia in 1991. Somaliland is not recognised by the international community.", "A search using the video verification tool WeVerify revealed that the clip is not recent. AFP Fact Check found stills from the video used in an article published in 2015 on the Aftahan News site, which covers news from Somaliland.", "The article, written in Somali and published on September 12, 2015, described the video as showing “clashes (...) between the speaker and the deputy speaker of the House of Representatives of Somaliland Abdirahman Mohamed Abdillahi (Cirro) and Bashe Mohamed Farah”.", "Disagreement over fuel tanks", "Farah (in a black shirt with short sleeves) succeeded Abdillahi in 2017.", "“The altercation took place after an argument over a motion concerning the management of fuel tanks in the port of Berbera in Somaliland,” Mustafa Haji Abdinur, AFP’s correspondent in Somalia, told AFP Fact Check.", "The president of the separatist state had initially hired a company to manage the fuel tanks, but parliament subsequently revoked his decision. Thirty-three lawmakers tabled a motion to reverse parliament’s decision, but Abdillahi, as the speaker of the house, ruled that the debate was closed.", "Farah then took the microphone to announce that discussions could continue. From there, the fight broke out, according to Abdinur from AFP.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]