["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "The Guantanamo Bay prison in Cuba, June 9, 2010. (New York Times file photo)", "It’s not entirely clear whether terrorists really care about the Guantanamo Bay Detention Center.", "Despite President Barack Obama’s new plan to close the facility, Republicans are promising to block the move under the rationale that none of the 91 detainees should be moved to the United States.", "But Nevada Rep. Joe Heck, a U.S. Senate candidate, went further than most and said terrorist groups don’t use Guantanamo at all in recruitment efforts.", "\"There is no evidence to support the claim that Guantanamo is used as a recruiting tool or affecting relations with allies, both of which are being used to advance the president’s flawed foreign policy goals,\" Heck said in a statement.", "Heck saying there’s \"no evidence\" that terrorist groups use the site as a \"recruiting tool\" directly contradicts one of the president’s core arguments for closing the detention center, which made us wonder — do groups like ISIS and al-Qaeda use Guantanamo in any fashion to draw in potential terrorists?", "Terrorist groups often mention Guantanamo in their propaganda and publications, but it’s less clear whether or not the site is used as a \"recruiting tool\" for potential jihadists.", "U.S. defense officials believe it’s \"no coincidence\" that ISIS forced hostages featured in brutal execution videos wear orange jumpsuits, which defense official Brian McKeon says is \"believed by many to be the symbol of the Guantanamo detention facility.\"", "And U.S. journalist Steven Sotloff, who was murdered by ISIS in September 2014, mentioned Obama’s failure to close the site in seemingly prepared remarks in his execution video.", "Guantanamo mentions aren’t limited to video. Al-Qaeda’s English-language magazine \"Inspire\" contains a handful of references to the detention center, according to Foundation for the Defense of Democracies senior fellow Thomas Joscelyn.", "But Joscelyn said Guantanamo tends to be referenced only in passing, like in a 2010 article by Osama bin Laden that’s mostly critical of climate change and capitalism.", "\"I'm finding, once again, that it is infrequently mentioned (especially when compared to other themes) and the regular recruiting messages I've catalogued have nothing to do with Guantanamo,\" he said in an email.", "Researchers question the importance that terrorist groups like ISIS place on Guantanamo, especially since the facility stopped taking in new detainees in 2008. Rather, the site tends to be lumped in with prisoner torture controversies at the Abu Ghraib and Bagram detention centers, which fades in prominence given new issues and a complex, evolving situation in the Middle East.", "Brookings Institution researchers reviewed English-language publications from al-Qaeda affiliates and ISIS and found that terrorist groups mention the detention center much less frequently than in the throes of the Iraq War, and call Guantanamo at most a \"supporting argument\" to an overarching narrative.", "\"And, while Guantanamo at times provides another instance of this crusade or serves as a counterpoint to U.S. claims of benevolence, the narrative of jihadi propaganda operates at a level far higher than that of any single facility in Cuba,\" the authors wrote in a post on the Lawfare blog.", "Author and nonresident Brookings fellow J.M. Berger said that things like expanded use of drones loom much larger than continuing operations at Guantanamo.", "\"U.S. counterterrorism action, particularly drone strikes, are arguably much more important to recruitment and definitely more important to propaganda, but no one talks about shutting those down,\" he said in an email.", "A 2010 United States Institute of Peace report found that young men who are drawn to groups like ISIS and al-Qaeda join more because it \"removes the doubt that young men feel about their place in the world, replacing it with purpose and direction.\"", "Berger said recruiters can use Guantanamo as a \"wedge issue\" to further radicalize potential members, but there’s no hard evidence that it’s used as a primary recruiting tool.", "Joscelyn, who tracks mentions of Guantanamo in English-language al-Qaeda publications, says there’s a key difference between references and recruitment of future terrorists.", "\"It is possible that some jihadist somewhere was influenced in some way by Guantanamo,\" he said in an email. \"But the people who are arguing that it is being used as a recruiting tool, mainly President Obama and his administration, have not provided any evidence that it is explicitly being used as a recruiting tool (as opposed to passing mentions in propaganda).\"", "Again, time dilutes the potency of Guantanamo as a rallying cry against American foreign policy, especially given Obama’s opposition to the site over the past seven years.", "\"It’s not that great of an anti-U.S. message when our own president campaigned on closing it down,\" Northeastern University political science professor Max Abrahms said.", "Our ruling", "Heck said that there’s \"no evidence\" that terrorists use Guantanamo as a \"recruiting tool.\"", "Terrorist groups routinely mention the detention site in both written and videotaped propaganda, but the argument is much murkier when it comes to the site’s effectiveness as a \"recruiting tool.\" However, Heck saying blankly that there’s \"no evidence\" the site is used by terrorist groups isn’t entirely accurate.", "We rate the claim as Half True.", "Phone interview, Northeastern political science professor Max Abrahms, Feb. 24, 2016", "Email interview, Brookings nonresident fellow J.M. Berger, Feb. 24, 2016", "Email interview, Foundation for the Defense of Democracies senior fellow Thomas Joscelyn, Feb. 24, 2016", "Email interview, Congressman Joe Heck spokesman Greg Lemon, Feb. 23, 2016", "PunditFact, \"Is Guantanamo a 'key component' of terrorist propaganda?\", Dec. 30, 2015", "Lawfare, \"Is Guantanamo Really a Major Recruiting Tool for Jihadists?\" June 3, 2015", "Human Rights First, \"Al Qaeda and ISIL Use of Guantanamo Bay Prison in Propaganda and Materials,\" May 2015", "Reuters, \"U.S. official: \"No coincidence\" Islamic State victims in Guantanamo-like jumpsuits,\" Feb. 5, 2015", "Washington Post, \"Here’s the transcript of the video showing Steven Sotloff’s reported execution,\" Sept. 2, 2014", "United States Institute of Peace, \"Why Youth Join al-Qaeda\", May 2010", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]