["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "In a TV ad that started airing Oct. 4, small-business owners applaud U.S. Rep. Lloyd Doggett, D-Austin, who boasts about his vote against the bank bailout package that has haunted some incumbents seeking re-election. When the U.S. House passed the legislation Oct. 3, 2008, most Democrats voted for it while a majority of Republicans said no.", "In the ad, Doggett says: \"I said no to these big bank bailouts. We need to focus our resources on helping Central Texas, not Wall Street.\"", "We ran his claim through the Truth-O-Meter after a reader urged us to check it out.", "First, the big picture: In 2008, after a housing boom, the bubble burst when securities backed by risky mortgages contaminated the greater financial system. The markets tanked and the government scrambled to pick up the pieces.", "In September of that year, the government seized control of mortgage companies Fannie Mae and Freddie Mac, which had funded more than two-thirds of recent home loans, investment bank Lehman Brothers went under, and the government swooped in to rescue insurance company American International Group.", "Amid uncertainty, and with the stock markets nosediving, U.S. Treasury Secretary Henry Paulson and Federal Reserve chairman Ben Bernanke proposed a sweeping $700 billion plan to bailout financial institutions. President George W. Bush and presidential candidates Barack Obama and John McCain supported Paulson's proposal, which called for the launch of the Troubled Asset Relief Program, or TARP, described as an effort to stabilize the economy by authorizing the treasury secretary to buy toxic assets, largely comprised of shaky mortgage-backed securities — essentially bad debts.", "Over the next three months, Paulson bolstered banks with $350 billion, according to an evolving summary of the credit crisis by The New York Times.", "Last month, the Times reported that the TARP bailout \"could conceivably earn taxpayers a profit.\" However, \"a final accounting of the government's full range of interventions in the economy, including the bailouts of the mortgage financial giants Fannie Mae and Freddie Mac, is years off and will most likely remain controversial and potentially costly.\"", "At the time, constituents weren't keen on bailing out big banks and other financial institutions. \"For most voters, TARP remains a four-letter word,\" according to the Times.", "Distrust was also simmering in Congress. On Sept. 30, 2008, the Austin American-Statesman reported that the day before, \"three of the four U.S. House members from the Austin area broke with their party leaders Monday and voted against the rescue plan for the financial markets.\" Doggett joined Reps. Michael McCaul, R-Austin, and John Carter, R-Round Rock, in voting to defeat the rescue plan. San Antonio Rep. Lamar Smith, a Republican who represents part of Travis County, voted for the legislation.", "\"In a sign of just how little weight President Bush carries in even his home state these days, just four of the 19 Texas Republicans in the House voted for his bailout plan,\" the Statesman reported. \"Five of the 13 Texas Democrats voted for it. The local lawmakers voting no all said they wanted Congress to spend more time looking at different solutions to the financial crisis.\"", "Doggett had been meeting with William Isaac, who was chairman of the Federal Deposit Insurance Corp. under President Ronald Reagan, according to the Statesman. Isaac had suggested that the administration could mollify the markets by raising the limit on the amount of deposits insured by the FDIC, among other measures.", "Doggett said: \"It strikes me that these are sensible steps that would address market concerns without such a huge cost to the taxpayer.\"", "A Statesman editorial published the same day observed that \"you know a bill is in trouble when conservative Republican John Carter of Round Rock and liberal Democrat Lloyd Doggett of Austin both vote against it.\"", "The House killed that measure, 228-205, and the stock market further spiraled. Then, two days later, the Senate voted 74-25 in favor of a modified $700 billion bailout plan. The crux of the legislation was intended to stabilize the economy and prevent further disruption to the economic system by giving the government authority to purchase and insure certain types of troubled assets.", "At the time, House Minority Leader John Boehner, R-Ohio, said on Fox News that the Senate bill had a \"much better chance\" of making it through the House, according to an Oct. 2, 2008, Los Angeles Times news story. \"I do think that the big (stock market) drop on Monday really had a chilling effect on a lot of our members and a lot of our constituents,\" he said. The Dow had plunged 800 points, according to a timeline of the crisis by The Washington Post.", "Doggett wasn't won over. \"The Senate measure has changed my position from 'no' to 'heck no,'\" he said, according to the Times.", "On the floor of the House Oct. 3, Doggett suggested the bailout was a rash, irresponsible use of taxpayer dollars. \"What Bush demands on this subrprime lending debacle is for taxpayers to reward Wall Street with what is essentially the biggest subprime loan in American history,\" he said. \"We cannot afford to give almost unlimited discretion to one man to determine what toxic securities to buy and on what terms. We should not bail out the entire world.\"", "The Senate approach cleared the House Oct. 3, 2008 by 263-171.", "In the Texas delegation, nine Democrats and six Republicans voted yes, while four Democrats and 13 Republicans voted no. The Texas delegates who switched votes between versions of the bailout — going from \"no\" to \"yes\" — were Al Green, D-Houston, Mike Conaway, R-Midland, Mac Thornberry, R-Clarendon, Sheila Jackson Lee, D-Houston, Solomon Ortiz, D-Corpus Christi, and Henry Cuellar, D-Laredo.", "Doggett was quoted in the Oct. 3 American-Statesman saying: \"When markets are poisoned, you demand the best antidote to that poison ... not yield to President Bush's take-it-or-leave-it demand.\"", "So, Doggett twice voted against the TARP measure, the plan since widely called a \"bailout.\"", "We rate his statement as True.", "\"No bailout\" ad, posted on YouTube, Oct. 1, 2010", "Austin American-Statesman, Most area legislators oppose bailout, want more ideas, Sept. 30, 2008", "Austin American-Statesman, Editorial: House snips economic lifeline, Sept. 30, 2010", "The Los Angeles Times, Senate OKs bailout plan; 74-25 vote comes after tax breaks, other 'sweeteners' added; Despite new provisions, House concurrence still not assured, Oct. 2, 2008", "The New York Times, TARP bailout to cost less than once anticipated, Sept. 30, 2010", "The New York Times, Credit crisis bailout plan, updated July 12, 2010", "The Washington Post, U.S. seizes control of mortgage giants; takeover of Fannie and Freddie aims to revive housing, financial markets, Sept. 8, 2008", "The Washington Post, Timeline: Crisis on Wall Street, accessed Oct. 7, 2010", "GovTrack.us, Congress, Roll call votes, 110th Congress, House Vote #674, Sept. 29, 2008", "GovTrack.us, Congress, Roll call votes, 110th Congress, House Vote #681, Oct. 3, 2008", "GovTrack.us, Rep. Lloyd A. Doggett (TX), accessed Oct. 7, 2010", "Doggett speaking on the floor Oct. 3, 2008", "Congressional Research Service summary of H.R.1424: Emergency Economic Stabilization Act of 2008, enacted Oct. 3, 2008", "The Associated Press, Switch in votes buoys bailout, House may take up revised rescue plan as 'nos' turn to 'yes,' Oct. 3, 2008", "E-mail interview with Sarah Dohl, communications director for Rep. Lloyd Doggett, Oct. 7, 2010", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]