["Six months into his presidency, Donald Trump is putting a positive spin on the latest round of public polling on his job performance.", "\"The ABC/Washington Post Poll, even though almost 40% is not bad at this time, was just about the most inaccurate poll around election time!\" Trump tweeted Sunday morning, July 16.", "The ABC News/Washington Post poll actually showed Trump’s approval rating at 36 percent — not almost 40 percent, as the president stated.", "We decided to fact-check Trump’s claim that his approval rating is \"not bad at this time\" by comparing his numbers to those of other presidents at the six-month mark.", "Since the middle of the 20th century, pollsters have been systematically tracking responses to the question: \"Do you approve or disapprove of the way (president’s name) is handling his job as president?\"", "As a result, a modern-day president’s performance can be tracked against that of historical predecessors as far back as Harry Truman.", "So what to make Trump’s claim that his six-month approval rating is \"not bad\"?", "Before turning to that question, an important caveat is that a widely cited average of Trump approval rating polls by Real Clear Politics does show Trump’s rating hovering around 40 percent. But the focus of this fact-check is on the ABC News/Washington Post poll, because that’s the one Trump singled out in his tweet.", "According to Gallup and ABC News/Washington Post polling data, the average six-month presidential approval rating is around 62 percent — well above Trump’s approval rating of 36 percent.", "The results look even bleaker when Trump’s numbers are placed side-by-side with other presidents.", "According to data compiled by ABC News, Trump has the worst approval rating in the last seven decades compared to other presidents at roughly the same period in their presidency.", "The second worst approval rating is that of President Gerald Ford, at 39 percent.", "Trump’s net approval rating (percent approval minus disapproval) of -22 percent is also a historic low since presidential polling of this kind began.", "Only two other presidents — Bill Clinton and Ford — had negative net approval ratings at this point in their tenure.", "\"Politicians always want to claim they are doing well in the polls,\" said Karlyn Bowman, a polling expert at the American Enterprise Institute. \"But Donald Trump’s claim that his ratings are ‘not bad’ compared to other president’s doesn’t square with available historical data, which shows his approval rating below all presidents for whom we have data at this point in their presidencies.\"", "Trump said his six-month approval poll numbers are \"not bad\" relative to other presidents at this point in his presidency.", "Not bad isn’t a scientific term, but by any sober measure Trump is performing relatively worse compared to his contemporaries, as well as any president since World War II.", "We rate his claim False.", "Tweet by Donald Trump, July 16, 2016", "ABC News, \"6 months in, a record low for Trump, with troubles from Russia to health care,\" July 16, 2017", "Princeton Survey Research Associates International, \"Presidential Approval Ratings in Perspective,\" May 2004", "Real Clear Politics, \"President Trump Job Approval,\" July 17, 2017", "Email interview with Karlyn Bowman, a polling expert at the American Enterprise Institute, July 17, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]