["About this rating", "This article addresses the narrow claim that the U.S. House of Representatives ordered an investigation into whether the Department of Defense experimented with ticks or insects as biological weapons. This claim is true: As first reported by Roll Call on July 15, 2019, the stipulation was added in an amendment to the 2020 Defense Authorization Act and approved with a voice vote on July 11:", "The amendment is an attempt to confirm or deny reports that Pentagon researchers — at places such as Fort Detrick in Maryland and Plum Island in New York — implanted diseases into insects to learn about the effects of biological weapons and also looked into using such insects to disseminate biological agents.", "To understand the rationale for such a move, a brief history of U.S. biological weapons research (and its associated controversies) is required.", "The United States began biological weapons testing during World War I, when the U.S. investigated — but did not use — ricin as a potential weapon. Though President Richard Nixon banned offensive biological weapons research and development in 1969, the period following World War II saw significant experimentation with the use of germs in warfare, primarily as a way to potentially disrupt enemy agriculture, as described by the non-partisan Nuclear Threat Initiative:", "A September 1945 memo to the Secretary of War detailed the program's accomplishments: the United States had used pilot plants to mass produce, among other pathogens, Bacillus anthracis (anthrax) and Brucella melitensis (brucellosis); had developed and field tested a new cluster bomb; and had constructed facilities for the large-scale production of several pathogens, including anti-crop agents. [Biological Warfare]-related R&D largely took place at Camp (later Fort) Detrick in Maryland.", "Plum Island, also mentioned in Smith’s amendment, played a role in the U.S. biological weapons research as well. An island off the eastern end of the coast of Long Island fully owned by the U.S. government, Plum Island has been under civilian control as a Department of Agriculture research station since 1954. In 1993, reports surfaced that some biological weapons research had occurred on Plum Island in the past, as reported in a 1998 New York Times story:", "For decades, officials denied rumors of biological warfare experiments. But in 1993, Newsday unearthed previously classified documents on plans to disrupt the Soviet economy by spreading diseases to kill its pigs, cattle and horses. Most of the diseases studied, like African swine fever and rinderpest, affect only livestock. But one, Rift Valley fever, also occurs in humans. The warfare plans ended long ago, officials say, and now the laboratory focuses exclusively on preventing diseases. To satisfy their own concerns, Russian scientists inspected the center in 1994.", "Among the most extreme claims related to U.S. biological weapons research are those that suggest that outbreaks of the tick-borne Lyme disease in the late 60s and early 70s — the first widespread appearances of the condition — and its subsequent spread across much of the nation were the result of the United States government, either intentionally or accidentally. Lyme disease is caused by a bacterium that can live inside ticks and spread to animals and humans.", "This argument was most recently made in the book \"Bitten: The Secret History of Lyme Disease and Biological Weapons\" by science writer Kris Newby. Though the idea predates this book, U.S. Rep. Chris Smith (R-N.J.) has cited \"Bitten\" as a significant inspiration for the amendment. What that book says it “brings to light is that the U.S. military has conducted thousands of experiments exploring the use of ticks and tick-borne diseases as biological weapons, and in some cases, these agents escaped into the environment.” The book also suggests “there was a deliberate release or an accident” involving biological weapons experimentation with “unintended consequences to the environment.”", "Newby suggests a “release” of ticks with a transmittable disease in them could have introduced Lyme disease into America. She also suggests that the medically controversial condition of chronic or persistent Lyme disease could be elucidated by records exposing what kind of testing may have been conducted on this bacterial agent.", "Ultimately, \"Bitten\" rests on three assertions. First, that U.S. researchers injected transmittable diseases into ticks and other insects. Second, that the first major outbreak of what we now call Lyme Disease in the late '60s and '70s happened after the release of infected ticks into the general population. And third, that the agent being experimented with was — or was related to — the bacterial agent now known to cause Lyme Disease: Borrelia burgdorferi. Evidence for each of these pillars comes for the most part from a single source — the U.S. National Institutes of Health scientist for whom that bacterial species is named: William Burgdorfer.", "Interpreting a video recording of a 2013 interview made of Burgdorfer for a film, Newby writes:", "[Burgdorfer] seemed to be saying that Lyme wasn't a naturally occurring germ, one that may have gotten loose and been spread by global warming, an explosion of deer, and other environmental changes. It had been created in a military bioweapons lab for the specific purpose of harming human beings. And somehow it had gotten out.", "These claims are controversial, and the testimony of Burgdorfer collected by Newby — at the end of his life as he was suffering from Parkinson's and diabetes — is inconclusive, as conceded by Newby herself in the book’s epilogue:", "After five years of research, I wasn't able to find verifiable documents confirming [an alleged release of deer ticks in Long Island]. I'm not sure why Willy [Burgdorfer] refused to fully disclose the details before his death. With his passing, the only way to know the truth is for a whistle-blower to step forward or for a classified report to be released.", "The primary problem with the notion that Lyme disease was not “a naturally occurring germ” is that the occurrence of Borrelia bacteria living inside ticks goes back to a time at least millions of years before humans existed to insert the bacteria into ticks. In 2014, for example, scientists found a 15-million-year-old tick fossil found in a chunk of amber from the Dominican Republic that showed evidence of being infected with Borrelia bacteria.", "The existence of Borrelia bacteria in the northeast United States, similarly, predates the U.S. biological weapons program. A study conducted by Yale researchers, who compared B. burgdorferi genomes from different areas collected over a 30-year period, calculated that the bacterium has been in North America longer than humans — at least 60,000 years.", "This lends support to the more scientifically accepted view about the emergence of Lyme disease: that it had long been dormant in the United States until ecological and economic changes produced conditions that allowed its spread to flourish, as explained in a Yale School of Public Health report on that research effort:", "[These] findings clarify that the bacterium is not a recent invader. Diverse lineages of B. burgdorferi have long existed in North America and the current Lyme disease epidemic is the result of ecological changes that have allowed deer, ticks and, finally, bacterium to invade.", "The explosion of deer in the twentieth century into suburban landscapes, free of wolf predators and with strict hunting restrictions, allowed deer ticks to rapidly invade throughout much of New England and the Midwest. Climate change has also contributed. Warmer winters accelerate ticks’ life cycles and allow them to survive an estimated 28 miles further north each year.", "Ticks expanded into suburbanized landscapes—full of animals like white-footed mice and robins, excellent hosts for B. burgdorferi. The expansion of ticks into habitats with ideal hosts allowed the bacterium to spread.", "The broader question of whether the United States ever “experimented” on ticks in general, however, has independent support outside of Burgdorfer’s vague claims. In a 2016 interview with the academic journal American Entomologist, Georgia State University entomologist James H. Oliver, who served at Fort Detrick in the '50s working on biological weapons, stated:", "They put me in the entomology branch [...] so that’s where I started working on ticks and mosquitoes — how to produce a lot of them. Drop them out of airplanes. Everything was very hushhush, very secret. I’m still leery talking about it, because I think they might put me in jail because I’m delivering secrets. It was a crazy time. ...", "We would run all kinds of distribution tests on where these things go when you release them and what were the factors that would cause the migration. Can we drop them out of airplanes and how do we get the bugs to the enemy?", "As reported in Roll Call, Smith’s amendment would require a report on this topic from the Department of Defense Inspector General:", "The amendment ... says the inspector general “shall conduct a review of whether the Department of Defense experimented with ticks and other insects regarding use as a biological weapon between the years of 1950 and 1975.” If the answer is yes, then the IG must provide the House and Senate Armed Services committees with a report on the experiments’ scope and “whether any ticks or insects used in such experiments were released outside of any laboratory by accident or experiment design.”", "The next step for Smith’s initiative is to reconcile the House version of the 2020 Defense Authorization with the Senate version, which does not presently contain such an amendment.", "Donnelly, John M.   “House Orders Pentagon to Say If it Weaponized Ticks and Released Them.”\r\n    Roll Call.   15 July 2019.", "Nuclear Threat Initiative.   “United States: Biological.”\r\n    Accessed 19 July 2019.", "Lambert, Bruce.   “Closely Guarded Secrets: Some Islands You Can't Get to Visit.”\r\n    New York Times.   17 May 1998.", "Newby, Kris.   Bitten: The Secret History of Lyme Disease and Biological Weapons.\r\n    Harper Collins, 2019.   0062896296.", "Cervenka, Susanne.   “Lyme Disease as War Weapon? Rep. Chris Smith's Push for Probe Advances After Call for Trump to Investigate.”\r\n    Asbury Park Press.   16 July 2019.", "Olivier, Jonathan.   “'Bitten' Explores a Lyme Disease Conspiracy.”\r\n    Outside Magazine.   29 May 2019.", "Poinar Jr., George.   “'Spirochete-like cells in a Dominican amber Ambylomma tick (Arachnida: Ixodidae).”\r\n    Historical Biology.   22 April 2014.", "Caccone, Adalgisa.   “'Ancient History of Lyme Disease in North America Revealed with Bacterial Genomes.”\r\n    Yale School of Public Health.   28 August 2017.", "Rice, Marlin E.   “James H. Oliver, Jr.: Ticks, Lyme Disease, and a Golden Gloves Champion.”\r\n    American Entomologist.   6 December 2016.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]