["About this rating", "“Clean coal, ”a broad term for technology that can reduce the environmental impact of burning coal, has become a popular political buzzword in the past two U.S. presidential campaigns. To those who promote it, clean coal is a “third way” that will allow humans to continue to mine and burn that form of fossil fuel in a more responsible way, obviating the need for regulations on the coal industry or heavy investment in green energy. To detractors, it is an expensive marketing ploy selling an unrealized and unrealistic fantasy.", "Humans have used coal as fuel for at least 4000 years. A combustible rock formed from the chemical transformation of organic plant matter over hundreds of millions of years of burial, coal is a relatively cheap and easy source of energy. Its widespread use powered the industrial revolution, and coal-burning power plants currently provide 33% of all household energy in the States.", "But for as long as coal has been an energy source, it has been plagued by environmental issues. Burning coal produces hazardous acid rain and irritating particulate matter, and it releases climate-warming greenhouse gases into the atmosphere.", "From a global warming standpoint, burning coal is significantly worse than burning other fossil fuels, as its chemistry allows for the production of more CO2 per reaction, as discussed in a December 2010 Atlantic article about clean coal technology:", "Compared with most other fossil-fuel sources of energy, coal is inherently worse from a carbon-footprint perspective, since its hydrogen atoms come bound with more carbon atoms, meaning that coal starts with a higher carbon-to-hydrogen ratio than oil, natural gas, or other hydrocarbons.", "This situation is especially unfortunate for the United States, since the country has large domestic reserves of cheap coal, and because many local economies depend on coal mining jobs that could be lost if regulations were to make coal economically unfeasible. The intersection of these environmental and economic concerns has made coal mining and energy a polarizing political issue in the United States.", "“Clean coal” is not a special type of coal, nor is it a new technology that reduces the environmental impact of coal mining. Instead, it refers to technology used to clean up the emissions from burning coal after it has already been burned for energy, or technology used to treat coal just prior to being burned. In the context of global warming, the main technology that is cited is “carbon capture, utilization and sequestration”, defined on the U.S. Department of Energy web site thusly:", "Carbon capture, utilization and storage (CCUS), also referred to as carbon capture, utilization and sequestration, is a process that captures carbon dioxide emissions from sources like coal-fired power plants and either reuses or stores it so it will not enter the atmosphere. Carbon dioxide storage in geologic formations includes oil and gas reservoirs, unmineable coal seams and deep saline reservoirs -- structures that have stored crude oil, natural gas, brine and carbon dioxide over millions of years.", "The term “clean coal” was first used by the US Department of Energy (DOE) in 1980s during an initiative they sponsored to demonstrate the commercial viability of technology that could scrub acid-rain creating toxins from the emissions of coal burning. At the time of the initiative, acid rain was the primary environmental concern, and greenhouse gases were an afterthought:", "The early program, however, was focused on the environmental challenges of the time — primarily concerns over the impact of acid rain on forests and watersheds. In the 21st century, additional environmental concerns have emerged — the potential health impacts of trace emissions of mercury, the effects of microscopic particles on people with respiratory problems, and the potential global climate-altering impact of greenhouse gases.", "The term was, in effect, rebranded in 2007 by an industry-funded group called the American Coalition for Clean Coal Electricity, who were concerned about the prospect of increased coal regulations under an Obama presidency. They made the term “clean coal” a household name through a 30 million dollar public relations campaign touting the benefits of clean coal technology.", "The problem, though, is that from the standpoint of reducing greenhouse gas emissions, the technology (for all practical purposes) does not yet exist on a scale that could be considered at all meaningful. In terms of carbon capture, utilization and sequestration technology, the only projects underway in the United States are pilot studies. These are not viable on larger scale, as the DOE admits:", "Today, there are commercially available First Generation CO2 capture technologies that are being used in various small-scale industrial applications. At their current state of development these technologies are not ready for widespread deployment on fossil fuel based power plants [...].", "Furthermore, there are a number of barriers to the successful implementation of carbon capture technology at coal-burning power plants, as discussed in a report by the British humanitarian think tank the Overseas Development Institute. First, the pace and scale of carbon capture technology is unlikely to overcome its limitations in a time period that would have any relevance to reducing atmospheric CO2:", "Essentially, coal-powered CCS has yet to be technologically proven as planned even at a quarter-scale. With per-plant investments running to the billions, this stepping-stone from laboratory to full commercial rollout of just the first phase of coal-powered CCS plants is incredibly important and getting past it is going to take years. Although the industry might argue that it is close, it has clearly not yet refined an ‘off-the-shelf’ product. The investment and time needed to build, test, and learn from projects to reduce costs means that CCS for coal power will not be ready to be commercially deployed at scale for at least a decade.", "Second, implementation of CCS makes the cost of coal too high to be competitive, and it reduces its output by consuming energy from the power plant trying to sell that energy:", "To capture CO2 at a power station requires adding a large separation unit, which also requires a significant amount of power to run. Adding the extra process currently doubles the capital costs of a plant, while running the separation process effectively decreases the overall efficiency of the plant by around a quarter. This efficiency penalty means that only the most efficient coal plant (‘advanced coal’) can feasibly be used with CCS. Together these mean that adding CCS to a coal-fired plant will make the electricity it produces substantially more expensive than both conventional and advanced current coal plants.", "These problems were made plainly visible by a recent pilot study of a coal-burning power plant in Canada’s Saskatchewan province that used a nearby hydroelectric dam to power the separation of CO2 from its exhaust. Though early reports painted a rosy picture, a March 2016 New York Times article suggested that the system was affected by a number of critical problems:", "Known as SaskPower’s Boundary Dam 3, the project has been plagued by multiple shutdowns, has fallen way short of its emissions targets, and faces an unresolved problem with its core technology. The costs, too, have soared, requiring tens of millions of dollars in new equipment and repairs.", "“At the outset, its economics were dubious,” said Cathy Sproule, a member of Saskatchewan’s legislature who released confidential internal documents about the project. “Now they’re a disaster.”", "This is not to say that research into minimizing the effect of the emissions from coal burning is necessarily futile. As discussed in a 2010 Atlantic article, there are two arguments to be made in favor of funding clean coal technology:", "One is that coal can be used in less damaging, more sustainable ways than it is now. The other is that it must be used in those ways, because there is no plausible other way to meet what will be, absent an economic or social cataclysm, the world’s unavoidable energy demands.", "The latler argument is a staple of the pro-coal camp, who argue that, like it or not, we are going to have to use coal in the future to supply energy for our country. So why not try to make it cleaner in the process?", "The push against that argument is well summarized by a comment made by Mary Finley-Brook, a professor of geography, environmental studies and international studies at the University of Richmond in Virginia, to the science news website Live Science:", "\"Clean coal does not currently exist,\" Finley-Brook wrote in an email. \"It will be expensive to develop and is uncertain (unlikely) to work, depending on what technology is selected. This is moving in the wrong direction from a climate change mitigation perspective. We need energy transition away from fossil fuels, not nice-sounding names to confuse people who don't know better.\"", "Regardless of one’s view on the philosophical debate about spending money to clean a technology we may begrudgingly have to use for years to come, the fact is that currently, so-called \"clean coal\" technology can for now do nothing to reduce carbon emissions on any appreciable or significant scale.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]