["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Carly Fiorina, former Hewlett-Packard chief executive and now campaign adviser to Sen. John McCain, grabbed news headlines July 7, 2008, when she said: \"There are many health insurance plans that will cover Viagra but won't cover birth-control medication. Those women would like a choice.\"", "Her comments came during a discussion of consumer-driven health plans in a breakfast meeting with reporters in Washington, D.C.\nProblem is, she's wrong to say that's the case with \"many\" plans.", "A study by the Guttmacher Institute in 2002 found that 86 percent of employer-purchased insurance plans covered a full range of contraceptive methods, up dramatically over the previous decade. One reason is that 27 states have passed laws requiring fully-insured employer health insurance plans that cover prescription drugs to provide \"equitable\" coverage for contraceptives. In short, if an employer is going to offer prescription drugs, contraceptives have to be among the options.", "A spokesman for America's Health Insurance Plans, a trade group that represents 1,300 health insurance companies, had no specific data but said both birth control and Viagra tend to be covered by its members' plans. Aetna, one of the nation's largest commercial insurers, said even its most restrictive drug plan includes generic oral contraceptives. Viagra, meanwhile, is only available from Aetna if an employer buys a separate rider for the company's policy.", "The wild cards here — and the reason Fiorina is right in some cases — are large companies that are self-insured, paying claims directly. These employers define their own benefit plans and are regulated by federal, not state laws.", "One such employer is Union Pacific Railroad, based in Omaha, Neb., which was sued for denying coverage for contraceptives while providing drugs to treat male erectile dysfunction. Last year, the 8th U.S. Circuit Court of Appeals overturned a lower court's ruling and determined that the railroad's policy did not discriminate against female employees.", "Abortion rights groups have been working since 1997 on passage of federal legislation to expand equity for contraceptives to all employers' plans. McCain voted against such legislation in 2003 and again in 2005. According to NARAL, the abortion-rights advocacy group, McCain has voted against family planning 22 times. McCain has opposed insurance mandates on the grounds that they make health plans more expensive.", "Two days after Fiorina made her statement, McCain ducked the issue in comments to reporters aboard his campaign bus in Portsmouth, Ohio. \"I certainly don't want to discuss that issue,'' he said.", "Planned Parenthood is using McCain's response with the Viagra vs. birth control issue, as\n\ncaptured on a YouTube video,\n\nin ads now running in six states.\n\nSee it here.", "Back to Fiorina's statement that \"there are many health insurance plans that will cover Viagra but won't cover birth-control medication.\" Efforts to force employers to cover birth control have failed in Congress, but state mandates and employee pressure force most companies to make such coverage available. We rule this Barely True.", "Guttmacher Institute,\n\nState contraceptive-equity laws", "Guttmacher Institute,\n\nU.S. Insurance Coverage of Contraceptives and the Impact of Contraceptive Coverage Mandates,\n\n2002", "NARAL,\n\nSen. John McCain Fact Sheet", "U.S. Senate,\n\nClinton/Reid amendment to FY'06 Budget Resolution, S.Con.Res.18\n\n, March 17, 2005", "U.S. Senate,\n\nMurray motion to waive Budget Act to allow vote on Murray/Reid prevention-package amendment to \"Partial-Birth\" Abortion Ban Act, S.3\n\n, March 11, 2003", "U.S. Court of Appeals 8th Circuit,\n\nRe: Union Pacific Railroad Employment Practices Litigation,\n\nMarch 15, 2007", "Interview with Robert Zirkelbach, America's Health Insurance Plans spokesman, July 11, 2008", "Interview with Walt Cherniak, Aetna spokesman, July 11, 2008", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]