["A video is being circulated on social media as seen in the screenshot below. The text claims that the man who is brutally thrashing the children in the video is a teacher at RM VM School at Valsad in Gujarat. It has a request for its readers to share the video and make it viral as stated in the message, “If a video goes viral it makes a lot of difference and instant action is taken”.", "Message: “आप के जितने भी ग्रुप हैं एक भी छूटने नही चाहिए, ये वीडियो सबको भेजिए ये वलसाड के RMVMSCHOOL का टीचर है इसको इतना शेयर करो की ये टीचर और स्कूल दोनों बंद हो जाए । वीडियो वायरल होने से काफी फ़र्क पड़ता है ओर कार्यवाही होती है जिसे दया न आये वो अपना मुंह (टाइपिंग) बंद रखे । You shouldn’t miss a single group, send this video to everyone, He is a teacher at Valsad’s RM VM School. So, share this so that both the teacher and school shut down. If a video goes viral it makes a lot of difference and instant action is taken, those who don’t sympathize can keep their mouth shut(typing) -translated)", "The video shared on Facebook and Twitter has attributed the horrific images to a school in Valsad named R.M & V.M Desai Vidhyadham.", "Alt News used Invid to a do a reverse image search on Google of the keyframes in the video and found a Daily Mail article published on August 5, 2014, titled, “Wife films secret footage of orphanage manager beating children with a stick and kicking them until they burst into tears in case that has shocked Egypt“. The article states, “The video shows Osama Mohamed Othman hitting the children before kicking them as they run away, screaming in pain. State-run Al-Ahram newspaper said Othman’s estranged wife filmed the video two months ago at Dar Mecca Al-Mokarama Orphanage in Giza”. It may be noted that the video belongs to an orphanage in Egypt and not R.M & V.M Desai Vidyadham School of Valsad as claimed on social media. According to a 2014 BBC report, Osama Mohammed Othman, the head of a Cairo orphanage was sentenced with three years imprisonment for assaulting seven children in his care and endangering their lives. The sentence included two year’s hard labour while the third was suspended pending the payment of $110 (£87) bail.", "Moreover, Alt News found a statement on the homepage of R.M. & V.M. Desai Vidyadham’s website which clarified, “There are a number of videos being uploaded under the R.M. & V.M. School name. These videos are 100% spurious and have been collected from different incidents which are unrelated to the School. Below is a video from ABP News that proves the illegitimacy of these videos”.", "As said in the statement, many videos have been shared on Facebook and Twitter with the same claim about a teacher at RM VM school using the text “RM VM School“.", "Misinformation degrading the reputation of a political party, public figure or historical figure has been a regular trend on social media. But this time, a school’s reputation has been besmirched with a barrage of videos depicting violence against children. Despite the video having been debunked several times, it continues to be shared extensively on social media.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "Trigger Warning: Sexual Violence A distressing video of a girl forced to take her clothes…", "A clip featuring Pakistan men’s Cricket team captain Babar Azam is viral on social media…", "A 13-second clip featuring Bollywood actor Shah Rukh Khan is being shared on social media…", "Union minister of information and broadcasting Anurag Thakur on September 26 announced Waheeda Rehman as…"]