["About this rating", "In 2016, Chelsey Marie Smith signed an affidavit in which she described witnessing Broward County, Florida, elections officials filling out blank absentee ballots. The affidavit was an exhibit in a November 2018 election-related lawsuit.", "The ballots Broward County officials were filling out were duplicates for members of the military serving overseas who had faxed in absentee ballots, and an investigation by the State Attorney's Office in Broward County found no evidence of criminal wrongdoing.", "In 2018 Florida once again became the epicenter of controversy in close-call elections, and the related recounts and lawsuits caused social media users to unleash more election fraud conspiracy theories", "On 10 November 2018, the conspiratorial web site Gateway Pundit added to the confusion by falsely reporting that election workers in Broward County had twice witnessed officials filling out blank absentee ballots. The information Gateway Pundit published was based on a tweet posted by Jeff Kottkamp, a former lieutenant governor of Florida:", "Affidavit filed by Broward Election’s employee in support of Caldwell lawsuit provides eye witness account of Elections staff filling in blank ballots. When this was reported the employee was fired and told not to come back. #sayfie", "— Jeff Kottkamp (@JeffKottkamp) November 10, 2018", "Although the information Kottkamp posted was accurate, there was much more to the story. For starters, the event took place in 2016; and contrary to what Gateway Pundit reported, only one such incident occurred. But by 13 November 2018, amid simmering controversy over Florida election recounts, butchered, confusing versions of the story went viral and led anxious readers to believe it referred to current events.", "In November 2016, Chelsey Marie Smith, a temp worker at the Supervisor of Elections Office (SOE) in Broward County, filed an affidavit reporting that she saw election officials filling out blank absentee ballots, believing she was seeing evidence of voter fraud in action. Smith stated she was then abruptly terminated. After investigating, however, the Florida State Attorney's Office in Broward County found no evidence of criminal wrongdoing.", "In the affidavit, Smith stated that she was sent to deliver a stack of absentee ballot requests to a room in the office known as Pitney-Bowers. When she got the door, she noted it was locked and a key code was needed to get inside. When she was let through the door, Smith witnessed several election officials filling out blank absentee ballots.", "If Smith had witnessed voter fraud in action, it would have been a crime. Upon investigation, however, Timothy Donnelly, assistant state attorney in charge of the public corruption unit in Broward County found no evidence of wrongdoing. Instead, he wrote in a 15 May 2017 memo that elections officials were creating duplicate ballots for soldiers stationed overseas who had faxed in absentee ballots:", "Dr. Snipes explained that military personnel who are stationed overseas fax their ballots to the Elections Office. Since the ballots are on fax paper and not the same size as the ballots that are tabulated by the machines, the statute allows a duplicate ballot to be made so that it can be tabulated by the automated machines. Federal law allows military personnel overseas to fax their ballots to the Election Offices. Ms. Hall demonstrated how the employees she supervises duplicate the faxed ballots. We inspected several faxed ballots which are preserved and kept available for inspection.", "After inspecting the absentee ballot-counting operation in the Pitney Bowers room, meeting with Dr. Snipes, Judge Frey, and Ms. Hall, we were satisfied that there, currently, was no ballot stuffing occurring at the Supervisor of Elections Office that could call into question the integrity of the election. It appeared, preliminarily, that Ms. Smith accurately reported the conduct that she observed at the Elections Office, but that there was nothing illegal or improper about the conduct. We immediately issued a Preliminary Report of our findings on Friday, November 5, 2016.", "Smith's affidavit was filed with the 17th Judicial Circuit court as an exhibit in a 11 November 2018 lawsuit resulting from one of the state's narrow elections. Filed by agriculture commission candidate Matthew Caldwell, the suit alleged that ballots were illegally counted after polls closed on election day. The affidavit, signed by Smith on 3 November 2016, was submitted to support Caldwell's accusations of misconduct against Dr. Brenda Snipes, Broward County's elections supervisor.", "Caldwell, a Republican, filed suit after eking out what he expected to be a victory against challenger Nikki Fried, only to have his 40,000-point lead flip to a very narrow margin of a few thousand votes favoring Fried. Despite an ongoing recount, Fried declared victory and announced a transition team.", "In a phone interview on 13 November 2018, Kottkamp criticized Broward County election officials for what he called a lack of transparency that has fueled conspiracy theories and panic. For instance, he said, SOE officials failed to disclose how many votes were left to count. Had they done so, he told us, \"people would know the universe of ballots out there and they could have all done the math. But because they weren’t willing to say how many votes were still out there to be counted, people were freaking out. You can understand why people were coming a little unglued about that.\"", "Kottkamp stated that he felt his tweet was pertinent because the affidavit was brought up in an ongoing November 2018 election-related lawsuit. He also said he did not think the 2016 duplicate ballots should have been filled out behind closed doors and pointed out the Broward County SOE has been beset by controversy and accusations of mismanagement. Her office mistakenly mixed more than a dozen rejected ballots with valid ones.", "Meanwhile, without offering evidence, President Donald Trump and other Republicans levied accusations of fraud in Florida while current governor and Republican U.S. Senate candidate Rick Scott fired off a flurry of lawsuits as the recount is underway, also accusing Snipes and other elections officials of counting ballots after the deadline. Scott has himself been sued by voter advocates demanding he recuse himself from overseeing the election in which he has a stake.", "Despite the chaos, Kottkamp expressed optimism that the \"mess\" in Florida would be sorted out fairly, saying, \"We'll get there.\"", "Abramson, Andrew.   \"Broward County Elections Office Invites More Skepticism - Opinion.\"\r\n    Sun Sentinel.   4 November 2018.", "Seitz-Wald, Alex.   \"Embattled Broward Election Supervisor Fires Back at Trump Over Fraud Allegations.\"\r\n     NBC News.   13 November 2018.", "Man, Anthony et al.   \"Turmoil in Another Florida Election: Slow Counts, Ballot Design Questions and Conspiracy Theories.\"\r\n    Sun Sentinel.   8 November 2018.", "Jarvis, Sarah and Thyrie Bland.   \"Caldwell Files Lawsuit Against Broward Elections Chief as Fried's Lead Grows in Ag Commissioner Race.\"\r\n    News-Press.   9 November 2018.", "Harris, Alex.   \"Whoops! Brenda Snipes’ Office Mixed Bad Provisional Ballots With Good Ones.\"\r\n    Miami Herald.   9 November 2018.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]