["“Why Every Judge On Shark Tank Backed This Product!” says a March 10, 2021 Facebook ad for One Shot Keto effervescent tablets, which supposedly features Shark Tank panelist Lori Greiner holding a bottle of the product.", "Similar ads referring to One Shot Keto can also be found on Facebook here and here while others, including here and here, make similar claims about Shark Tank endorsement without naming diet product in the video.", "Keto is a high-fat, low-carb diet that has been used for weight loss, but carries various risks. Additional information about it is available here and here.", "The tablets shown in the Facebook ads have no affiliation with any of the “Shark Tank” panelists.", "“The Keto diet pill ads are totally fictitious and so many good people are falling for them,” said Barbara Corcoran, one of the “sharks,” or tycoons, who serve as judges and investors on the show.", "“Not one of my fellow Sharks endorse Keto. We never heard of them until they used our faces in their fake ads online. The attorneys for ‘Shark Tank’ vigilantly pursued them but they constantly change their urls and identities making them very difficult to catch,” Corcoran said in a statement emailed to AFP by her executive assistant Emily Burke.", "A search of Facebook’s Ad Library for the headline, “why every judge on shark tank backed this product” shows several ads -- including some for One Shot Keto -- that Facebook said were taken down for not carrying a required disclaimer label.", "ABC’s Emmy award-winning “Shark Tank” has been on air since 2009. It features aspiring entrepreneurs trying to convince the sharks to provide funds in hopes of backing a successful idea.", "The show’s website provides a list of products that have appeared on the program, as of March 12, 2020. One Shot Keto is not among them, nor is any product containing the name “keto.”", "The list does, however, include nui, a cookie related to the keto diet that was featured in season 10 episode six.", "A blog post published March 13, 2021 on the show’s website warns that:", "“The Internet has become overrun with advertisements featuring products allegedly endorsed by ‘Shark Tank’ or the Sharks... While many products claim to have been on ‘Shark Tank,’ that is not always the case.”", "An attached video includes an “example scam ad” in which the show’s judges are pictured in a digitally altered image with bottles of Super Keto Booster and the words, “as seen on Shark Tank.”", "The images in the Facebook ads purporting to show Greiner holding a bottle of One Shot Keto have also been manipulated.", "AFP Fact Check performed a reverse image search to obtain the original, unaltered photo. It was tweeted by Greiner April 14, 2019 after she invested in Pricetitution, a card game.", "“I do not promote any keto, weight loss or diet products, it’s a scam,” she said on Twitter in November 2019.", "“They take our images and they Photoshop their product into our hands, and they make it like we are endorsing or are behind these products. We are not,” Greiner added in a video attached to the tweet.", "Her current Twitter profile carries a similar advisory.", "Another of the show’s “sharks,” Mark Cuban -- billionaire owner of the NBA’s Dallas Mavericks -- also drew attention to keto-linked scams in 2019 and called for law enforcement action.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]