["The post was published here on Facebook on March 8, 2019. It has been shared more than 11,000 times.", "Part of the Thai-language caption translates as: “Statistics data from the Bank of Thailand, so frightened after I read it…", "“1. How do people in Thai live after retirement?", "\"1% - wealthy, millionaire", "\"4% - comfortable", "\"7% - enough to live by", "\"40% - need to rely on their children and retiring home", "\"48% - struggling, work hard even old", "“2. Thai people’s living expenses / Meal price for 1 person", "\"1 day - 3 meals", "\"1 year - 3*365 = 1,095 meals", "\"30 years - 30*1,095 = 32,740 meals", "“If you eat a meal of 30 Thai Baht, you will need to use = 985,500 THB / If you eat a meal of 50 Thai Baht, you will need to use = 1,642,500 THB”.", "An identical post was also shared here and here on Facebook; here on Twitter; here on Instagram; and on this Thai-based website.", "The claim is false.", "Sureeratana Luckananit, senior director of the BOT’s corporate communications department, told AFP via email on May 26, 2020, that the bank is not the source of the purported data.", "She said: “The statistics posted on social media that claims to be from the Bank of Thailand is not correct, we have never conducted these statistics.”", "A keyword search on the BOT website’s statistics section also found no results relating to living expenses in retirement.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]