["About this rating", "On 31 January 2017, after President Donald Trump tapped Neil Gorsuch to fill a long-vacant seat in the Supreme Court, the Internet erupted with with praise and criticism. A post circulating on Twitter attributes a pro-segregation quote, allegedly delivered in 2012, to Gorsuch:", "Our clear goal must be the advancement of the white race and separation of the white and black races. This goal must include freeing of the American media and government from subservient Jewish interests.", "In reality, the statement came from former Ku Klux Klan Imperial Wizard David Duke. According to the Anti-Defamation League, the remark was published by the Knights of the KKK in November 1978 in an op-ed by Duke.", "In 2015, the Southern Poverty Law Center reported that Duke made the statement in 1998 and featured the same excerpt, though the SPLC did not specify whether it came from the same op-ed or from a different written piece or speech. The group did, however, quote Duke as saying, \"The Jews are trying to destroy all other cultures…as a survival mechanism…the only Nazi country in the world is Israel.\"", "Duke has been an ardent supporter of President Donald Trump, who nominated Gorsuch to the high court. There is no record of Gorsuch supporting segregation, but he has faced criticism for his own views regarding racial issues. Civil rights attorney Jordan Kushner, who attended Columbia University with Gorsuch, told Fusion:", "He had something against every progressive cause. He criticized divestment movements, he criticized the protest against gentrification…he was hostile toward issues involving racism, back when he wasn’t trying to lay the groundwork to try and become a federal judge.", "In an 8 April 1987 op-ed for the school newspaper, the Columbia Spectator, he criticized a protest march spurred by an alleged attack against black students and security guards at the hands of 20 white students. Gorsuch wrote:", "Last Saturday's march was more a demand for the overthrow of American society than a forum for the peaceable and rational discussion of these people and events. Those who addressed the march argued not for a change within the system, but for a radical change of the system.", "However, nowhere did he argue that various ethnicities should be kept separate.", "Anti-Defamation League.   \"David Duke: In His Own Words\". \r\n     May 2000.", "Arturo Garcia is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]