["About this rating", "In May 2020, a video supposedly showing a line of fire burning across a field was widely shared on social media. On the Nature is Fucking Lit section of Reddit, this video was shared with the caption: \"Poplar fluff burning in Spain.\"", "The visuals in this video are unusual, to say the least, and left some viewers wondering if the attached caption was accurate. Is this a real video or a digital edit? Was this video really taken in Spain? What's poplar fluff?", "The earliest version of this video that we could find was posted to the Club De Montaña Calahorra Facebook page on the afternoon of May 6. This Facebook page posted two videos of the incident, one of which was accompanied by a simple caption warning viewers to \"cuidado con las pelusas\" or \"watch out for lint.\"", "The video was quickly picked up by Spanish news outlets, such as Cope, which reported that the video was filmed at a park (Parque del Cidacos) in Calahorra, a municipality in La Rioja, Spain. The local news outlet La Rioja reported that a \"white cloak\" had covered Parque del Cidacos for the last few days, but that this fire suddenly turned everything green (translated via Google):", "During the last days, everyone who walked through the Cidacos de Calahorra park did so surrounded by a white cloak. It had not snowed, no. It was the color that the poplar fluff left on the green areas.", "Well, all that white color has been removed in one fell swoop. It has burned and the moment has been captured by a reader who has passed the video to us. As if it were a choreography, the fire has eliminated the lint, revealing the green color of the lawn before the gaze and surprise of those who have been caught that moment in the park of the town of La Rioja.", "The \"fluff\" in the above-displayed video is actually seeds from the poplar tree. The city of Calgary provided the following information about \"fluff\" on a web page dedicated to the \"problems with polar trees\":", "This \"fluff\" is actually poplar seeds that are produced by the female trees of the species, but it’s not the fluff or the seeds that are making you sneeze. Most allergists agree that the real culprits are native grasses and other plants that are flowering just as the poplars are seeding. Poplar trees do create pollen, but it is produced by the male tree in early spring, long before fluff season. Cutting down the female trees won't cure your pollen allergy.", "In addition to creating literal headaches for those with allergies, this fluff is also flammable and can contribute to the spread of wildfires. In June 2019, the City of Winnipeg told CTV News that an unusually large amount of poplar fluff likely worsened a fire in Assiniboine Forest:", "\"The heavy seed load within Assiniboine Forest may have had an influence on the ease of ignition and speed which the fire was able to move,” said the city in a statement to CTV News.", "The city said the seeds did not cause the fire and would have been only one factor in the spread of flames. The cause is believed to have been careless human activity, such as a bonfire or a cigarette.", "Coun. Janice Lukes said after speaking with fire crews, she learned poplar fluff also played a role in a large grass and brush fire in Bridgwater Forest on June 1.", "“I’ve never seen so much fluff. It’s shocking,” she said Friday.", "It's not clear if the above-displayed fire was set intentionally as a controlled burn to clear the area, or if this fire was started on accident. According to Cope, this fire left no injuries or property damage.", "The Wall Street Journal.   \"Beijing’s April ‘Snow’: Pretty, but Also Flammable.\"\r\n    16 April 2014.", "Macdonell, Beth.   \"Fluffy, Cloud-Like Poplar Seeds Adding to Wildfire Hazard in Manitoba.\"\r\n    CTV News.   14 June 2019.", "Cope.es.   \"El Impactante Incendio de Pelusas De Chopo en Calahorra Que Se Ha Viralizado.\"\r\n    7 May 2020.", "La Rioja.   \"Vídeo: Así Arden Las Pelusas De Los Chopos en El Parque del Cidacos de Calahorra.\"\r\n    6 May 2020.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]