["About this rating", "Rumors that some restaurant was shut down for serving human meat have been circulating online for years and flare up again from time to time, as in one report published by the web site news.states-tv.com in 2017 that claimed one such restaurant was called \"Rose Kitchen\" and was located in a hotel in Pretoria, South Africa:", "A hotel restaurant in pretoria, south africa has been shuttered by authorities for serving human flesh. According to our local correspondent, suspicious residents told police of rumors that the restaurant was cooking human meat for customers. Police then raided the restaurant, where they discovered fresh human heads that were still bleeding. The blood was in the process of being drained into a plastic bag.", "The restaurant, named Rose Kitchen, is a popular eating place in Sunnyside Pretoria.", "However, news.states-tv.com and other web sitea, such as Meganews360 and CNN Channel, published near-verbatim  versions of the very same story, with the setting of the \"human flesh\" restaurant changed to Valletta, Malta, or Nairobi, Kenya, or Port of Spain, Trinidad and Tobago.", "Although this text has made frequent appearances on disreputable web sites, these stories were all based on an errant and error-filled article published by BBC Swahili in May 2015. The BBC eventually removed the article, then released a statement saying that there was absolutely no truth to the story:", "The story about the Nigerian restaurant which we published here was a mistake and we apologise. It was incorrect and published without the proper BBC checks. We have removed the story and have launched an urgent investigation into how this happened.", "The BBC Swahili service’s reputation for accuracy and balance remains of paramount importance to us and we are taking the appropriate steps to insure that mistakes like this do not happen again.", "It is likely that the BBC conflated a genuine report from 2013 about two skulls being discovered in a Nigerian hotel room and a poorly sourced tabloid story about a restaurant serving human meat, the combination which created a rumor that then took on a life of its own.", "Despite the BBC's retraction, uncorrected versions of this story are still available on news sites such as MSN and the UK's Express as of this writing. Disreputable web sites have also managed to keep this rumor in circulation by reposting the above-displayed text (occasionally changing the location) along with gruesome photographs of the alleged precooked cadavers:", "Neither of these images show actual human meat — they are both props originally created to promote the zombie video game Resident Evil 6.", "Another version of the hoax promotes the claim that restaurants in Tokyo serving human meat had opened; reporter Benjamin Fulford posted one such story, discussing a \"noodle shop featuring broth made from human bones and flesh,\" on 1 April 2016. However, Fulford made it clear that the piece was meant as an April Fool's joke by identifying himself as a reporter from \"CNN\" -- Cannibal News Network.", "In July 2016 the Spanish-language \"satirical daily\" web site La Voz Popular published a spoof about \"Edible Brother,\" a human flesh restaurant in Tokyo, that was picked up by other sites in November 2017 and run as if it were legitimate news.", "The Telegraph.   \"Nigerian 'Human Flesh' Restaurant: A Correction.\"\r\n    21 May 2015.", "BBC Swahili.   \"Nigeria: Taarifa ya mgahawa sio za kweli.\"\r\n    19 May 2015.", "BBC Swahili.   \"Mgahawa wauza nyama ya binaadamu Nigeria.\"\r\n    13 May 2015.", "news.state.tv. — \"Pretoria Restaurant Shut Down for Serving Human Flesh.\"\r\n— — Retrieved 15 March 2017.", "Fulford, Benjamin.  \"Japanese Government Approves First 'Ethical' Human Flesh Noodle Shop.\"\r\n1 April 2016.", "Coppel, Eugenia.  \"Ningún Restaurante De Tokio Sirve Carne Humana Ni El Canibalismo Es Legal En Japón.\"\r\nVerne.  29 November 2017.", "Added information on fake stories promoting the opening of a restaurant serving human flesh in Tokyo.", "Dan Evon is a former writer for Snopes.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]