["State Rep. David Crowley, D-Milwaukee speaks to the audience at the launch of Unlock The Vote in Milwaukee, Wis. on Wednesday, September 4, 2019. Colin Boyle/Milwaukee Journal Sentinel", "Crowley uses a narrow definition of bill authorship to say he has passed one bill and Larson none.", "But his claim didn’t specify such a strict criteria, and the state already has an official standard for who is considered an author.", "Under the state definition, both Democratic lawmakers have passed three bills", "The coronavirus is affecting nearly all aspects of our lives, but the wheels of democracy grind  on.", "Milwaukee County voters will still (at this point) be tasked April 7, 2020 with choosing a new county executive — and state Rep. David Crowley says voters should factor in how effective he and state Sen. Chris Larson have been as lawmakers.", "In a March 11, 2020, debate on WISN-TV, both Milwaukee Democrats were asked what sets them apart from their opponent. Crowley said this:", "\"The biggest difference is that I’ve actually been able to be effective in the state Legislature,\" he said. \"I’ve passed more bills than Sen. Larson has, because if I’m not mistaken he hasn’t passed any.\"", "Is he right?", "It turns out that – just like deciding whether Minnesota or Wisconsin has the most lakes — it’s all about how you define the term.", "Bills passed is an interesting place for Crowley to plant his political flag, given that neither he nor Larson has been exactly prolific.", "Larson has been in office since 2011, and Crowley since 2017. Both the Assembly and Senate have been under Republican control since 2011, meaning slim odds for bills from Crowley, Larson or any other Democrat.", "Spokesman Garren Randolph said Crowley’s claim referred to bills signed into law on which the legislators were the \"lead author.\"", "Bills can originate in either the Assembly or the Senate, and they must have at least one author or sponsor in each chamber. Other lawmakers in favor of the legislation can also sign on as coauthors or cosponsors.", "Crowley here is referring to only the first author in the originating house.", "By that tally, Crowley comes out ahead: 1-0.", "He was the lead sponsor on a bill enacted in April 2018 that provided a $210,000 grant for a nonprofit organization to set up a website and phone system to provide referrals for community-based services and crisis intervention. It passed unanimously in both chambers.", "The grant continued an existing program administered by 2-1-1 Wisconsin.", "So it didn’t create anything new — but it was a bill, and it was authored by Crowley, and it passed.", "Larson, indeed, has not been the lead author on any bills passed into law.", "But Crowley’s definition is narrower than the authorship criteria used by the state.", "The nonpartisan Legislative Reference Bureau maintains an \"author index\" of all legislation. The bureau’s requirement for authorship is established by a Joint Rule of the Legislature. It says lawmakers are listed as the author if they are one of the first two authors in the originating house or the first cosponsor in the other house.", "By that criteria, both Crowley and Larson have passed three bills into law, according to the author indexes from the 2019, 2017, 2015, 2013 and 2011 sessions. Here those bills are with their official description:", "Crowley", "AB779 — the referral grant referenced above (2017 session)", "AB780 — Relating to notice to a school of a permanency review or hearing, notice to a school district of a foster home or group home license or out-of-home care placement, and transfer of pupil records (2017)", "SB99— Relating to venue requirements for domestic abuse, child abuse, and harassment cases (2017)", "Larson", "SB700 — Relating to creating a fee schedule for certain laboratories (2019)", "SB99 — Relating to designating and marking the Richard A. Grobschmidt Memorial Bridge (2017)", "SB512 — Relating to deposits on the sale of certain lead acid batteries (2013)", "Crowley claimed he has \"passed more bills than Sen. Larson has, because ... he hasn’t passed any.\"", "Crowley’ staff leaned on a narrow definition of authorship — only the first author in the chamber where the bill originated. If we consider authorship as being the person primarily responsible for a bill, Crowley has a point.", "But his claim didn’t specify such a strict definition, and he’s referring to a subject where the state already has an official definition. Under the state standard, both Crowley and Larson have passed three bills.", "We define Mostly False as having an element of truth but ignoring critical facts that would give a different impression.", "And that’s how we rate Crowley’s claim.", "Email exchange with Sonja Chojnacki, spokeswoman for Chris Larson, March 13-17, 2020", "Email exchange with Garren Randolph, spokesman for David Crowley, March 13-16, 2020", "Wisconsin State Legislature, Author Index, 2019", "Wisconsin State Legislature, Author Index, 2017", "Wisconsin State Legislature, Author Index, 2015", "Wisconsin State Legislature, Author Index, 2013", "Wisconsin State Legislature, Author Index, 2011", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]