["The first debate between incumbent Republican Sen. Rob Portman and former Democratic Gov. Ted Strickland got a little chippy over the future of entitlements like Social Security and Medicare.", "Responding to a question about the threat of Social Security funds being depleted by the year 2034, Portman said that he was in favor of \"means testing,\" a method of adjusting benefits according to a taxpayer’s wealth.", "\"And that’s part of the answer,\" Portman said. \"I have supported that also, with Medicare.\"", "The question then went to Strickland, who leapt at the chance to repeat a talking point he’s used before in his campaign.", "\"Since Sen. Portman brought up Medicare,\" Strickland said, \"on the Neil Cavuto show, he said that it would be irresponsible not to cut Medicare. Those are his words.\"", "Portman interrupted, \"Irresponsible not to save it.\"", "\"Senator,\" Strickland said, \"your words were it would be irresponsible not to cut it.\"", "Portman shook his head in disagreement.", "We decided to go to the tape — and Portman’s YouTube channel took us right to it.", "Here’s the exchange from June 2011 in which Portman, on Fox News, criticized Obama’s \"Summer of Recovery,\" and discussed methods of addressing the national debt and deficit (emphasis ours):", "Cavuto: \"So what are some of the things you want to cut, right now?\"", "Portman: \"Everything has to be on the table. So we have to deal with the entitlement programs, because they’re not sustainable in their current form -- they’re not going to be there for future generations.\"", "Cavuto: \"So when Chuck Schumer and Harry Reid say, ‘not Medicare,’ what do you say?\"", "Portman: \"That they’re being irresponsible and they know it. They’re playing politics. If we don’t deal with these programs that are now 60 percent of our budget, think about that. When you add up interest on the debt and the mandatory spending, and the entitlement programs -- very important programs --  that’s 60 percent of the budget now, it’s the fastest-growing part of the budget. For them to take that off the table means they’re not serious about dealing with our deficit and debt.\"", "We see from this exchange that Portman didn’t talk about saving Medicare, as he stated in the debate, but proposed that all entitlements including Medicare needed to be considered in terms of cost-cutting.", "However, Portman’s statement was a hypothetical one, part of a discussion about Portman’s disagreement with his colleagues in the Senate about managing entitlements. It was not an official policy statement or part of proposed legislation on Portman’s part, as Strickland’s debate statement suggested.", "Our ruling", "Strickland said Portman went on television and said \"it would be irresponsible not to cut Medicare. Those are his words.\"", "Those were not Portman's exact words on Cavuto's show. Portman said it would be irresponsible of any fellow senators to argue that Medicare would be off the table when discussing cutting entitlements. Strickland made it sound as if Portman was singling out Medicare by itself.", "Strickland's statement is partially accurate but imprecise, so we it Half True.", "https://www.sharethefacts.co/share/439c351d-8c4c-468f-95c4-6399df46f007", "Interview, Michawn Rich, Spokesperson, Rob Portman for Senate, Oct. 19, 2016", "YouTube.com, \"Portman Discusses Obama's 1 year Anniversary of the Failed ‘Summer of Recovery’ with Neil Cavuto,\" Jun. 16, 2011", "TedStrickland.com, \"What Ohio Voters Need to Know,\" accessed Oct. 18, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]