["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Xavier Becerra testifies during a Senate Finance Committee hearing on his nomination to be secretary of health and human services on Feb. 24, 2021. (AP)", "A digital ad running in Georgia and New Hampshire says that Xavier Becerra, President Joe Biden’s nominee for Health and Human Services secretary, supports \"Medicare for All.\"", "\"Becerra supports Bernie’s government takeover of your health care, eliminating your employer provided coverage,\" the narrator says.", "The ad, funded by the campaign PAC of Sen. Tom Cotton (R-Ark.), is part of a blitz from conservative groups against Becerra’s confirmation. It first aired this week and will continue until the Senate’s confirmation vote. The gritty, foreboding ad includes a range of other attacks, including criticisms of California’s Covid-19 response and Becerra’s role in legal cases on reproductive rights.", "Another ad, this one funded by Heritage Action for America and airing in the Washington, D.C., market, uses similar talking points, including Becerra’s support for \"government-run health care.\"", "Becerra underwent two Senate hearings this week in which he faced questions about his support for Medicare for All.", "\"Your long-standing support for single-payer, government-run health care seems hostile to our current system from my perspective,\" Sen. Mike Crapo (R-Idaho) said during Wednesday’s Senate Finance Committee hearing. \"What assurances can you give to Americans who currently have private insurance, including through Medicare Advantage, and are satisfied with their insurance provider that they will not lose their coverage in the future to some sort of Medicare for All approach or federal takeover of health care?\"", "Becerra responded that he was asked to serve at the pleasure of Biden, who has made it clear he wants to build on the Affordable Care Act. \"That will be my mission,\" he said.", "Since a vote on Becerra’s nomination could happen next week, we thought it was important to check the claim from this ad and give context to what power HHS secretaries actually have.", "We reached out to Cotton’s press team to ask for evidence to support the ad but didn’t hear back. The ad does cite a December New York Times article with the headline \"Becerra Supports ‘Medicare for All’ and Could Help States Get There\" to back up the claim.", "Noah Weinrich, press secretary for Heritage Action for America, did provide evidence of Becerra’s support for Medicare for All. Weinrich sent clips of press interviews, as well as links to House of Representatives Medicare for All bills that Becerra co-sponsored over his years in Congress.", "Xavier Becerra was elected as a Democrat to represent a Los Angeles district in the U.S. House in 1993. He stayed in Congress 24 years. He resigned in 2017 to accept the position of attorney general of California, which was offered to him by then-Gov. Jerry Brown.", "As attorney general, Becerra brought more than 100 legal challenges against the Trump administration for various health, environmental and immigration issues. One of his best-known lawsuits was in support of the Affordable Care Act. California took the lead with 18 other states in arguing against overturning the law before the U.S. Supreme Court. That decision is expected by the end of June.", "Since Becerra was first elected to Congress, he has been an advocate for single-payer, or universal, health coverage. This type of coverage can take many forms, but by most definitions, it means the federal government would have some role in funding and administering health insurance for the public.", "\"I do, as I said before, join my colleagues who support the single-payer plan,\" Becerra said during a congressional hearing in 1994. \"For me, meaningful health care reform means that we must have universal coverage. We must have portability. We must have choice of provider.\"", "More recently, this approach took on the moniker of Medicare for All, in reference to Sen. Bernie Sanders’ (I-Vt.) health care bill with the same name. Sanders’ bill, first introduced in 2017, was designed to eliminate private health insurance after phasing in government-run health care, funded by raising taxes.", "In 2017, Becerra said he would \"absolutely\" support Sanders’ bill. \"I've been a supporter of Medicare for All for the 24 years that I was in Congress,\" Becerra said during a Fox News interview. \"This year, as attorney general, I would fight for that if we had an opportunity to put that forward in the state of California, because I think what we do is we give people that certainty that they're going to be able to access a doctor or a hospital.\"", "And in 2019, Becerra told KHN’s Samantha Young he’s \"been a single-payer advocate all my life.\"", "Reviewing Becerra’s statements, it’s clear he does support Medicare for All or similar plans.", "But, if confirmed as head of the Department of Health and Human Services, Becerra will be a member of Biden’s Cabinet, and the president dictates policy priorities. During the Democratic presidential primaries, Biden was unwavering in his opposition to Medicare for All, instead throwing his support behind implementing a public option health plan and expanding the ACA.  A public option is a government-run health insurance plan that would exist beside private health insurance coverage as a choice in the ACA marketplace.", "It’s also important to note that while the ad says Becerra supports Medicare for All, thus \"eliminating your employer-provided coverage,\" that doesn’t mean your health insurance would be eliminated. Rather, it would be replaced by government-run health insurance.", "\"The notion that by having Medicare for All you’re going to lose insurance coverage is bizarre,\" said Mark A. Peterson, a professor of public policy, political science and law at UCLA. \"The whole point of Medicare for All is that everyone has health insurance.\"", "Since Biden doesn’t support Medicare for All, would Becerra’s stance really matter?", "No, said Joseph Antos, a health care scholar at the right-leaning American Enterprise Institute.", "\"He will not be able to, in this role, push the executive branch or the Congress in this direction in any perceptible way,\" said Antos. \"About all he could really do is use the waiver process and loosen up the various restrictions that the Trump administration tried to impose on states in the Medicaid programs. But that’s not the same thing as single-payer.\"", "Antos was referring to waivers that states can ask for in order to change how they administer the ACA exchanges or Medicaid.", "Larry Levitt, executive vice president for health policy at KFF, said it certainly is possible Becerra could be called upon to consider state waiver proposals to implement single-payer systems. (KHN is an editorially independent program of KFF.)", "\"He would likely look more favorably on waivers like that than the Trump administration, which was quite clear they wouldn’t consider them. He might also view such waivers more positively than an HHS secretary that has not supported Medicare for All,\" Levitt wrote in an email. \"However, Becerra would not be making decisions on state waivers of such consequence unilaterally. He would certainly consult with the White House.\"", "Levitt added that it seems unlikely at this point any state could implement a single-payer system. Vermont dropped its efforts to do so after it became clear how much taxes would increase. California does have significant support for single-payer but, at this point, it seems unlikely to be realized in that state.", "Plus, establishing a national single-payer system would require the support of both the president and Congress — and neither is ideologically there.", "The White House maintains Becerra would be focused solely on Biden’s priorities and not Medicare for All.", "Andrew Bates, a transition spokesperson for Biden, said in a statement that \"Xavier Becerra will support and work to enact President Biden's health care agenda — building on the ACA with a public option — as was made clear immediately after he was selected.\"", "But Heritage Action’s Weinrich took a different view: \"The HHS secretary holds considerable policy-making and rule-making power, and Becerra's long record indicates he would use that power to expand government's role in health care in any way he can, with the ultimate goal of a single-payer option.\"", "In the 2018 and 2020 elections, it was common for Republicans to paint Democrats as \"socialists.\" Sometimes this was illustrated through their support for Medicare for All or simply being from California.", "The same rhetoric is being employed here, said Peterson.", "\"That Biden, by bringing in these officials from California, and the fact that Nancy Pelosi is speaker of the House, they’re arguing it’s just showing the infiltration of the radical socialist California state into the federal government,\" he said. \"But this is ridiculous, because there are not socialist politics, per se, happening in California, and often the California Democrats in Washington are moderate.\"", "Ultimately though, the goal of an ad like this is to lay the groundwork for future campaigns.", "\"In a Senate that is split 50-50 and that 50th Democrat is a conservative Democrat, there is opportunity and leverage for Republicans to try and stand in the way,\" said Peterson. \"The less effective the Biden administration can be, the more effective campaigning will be for Republicans.\"", "The ad states, \"Becerra supports Bernie’s government takeover of your health care, eliminating your employer-provided coverage.\"", "Becerra’s past remarks illustrate he does support Medicare for All or other programs in which the government would run and fund health insurance.", "We rate this claim True.", "California Healthline, \"With Becerra as HHS Pick, California Plots More Progressive Health Care Agenda,\" Dec. 10, 2020", "CNBC, \"Biden Suggests He Would Veto ‘Medicare for All’ Over Its Price Tag,\" March 10, 2020", "CNS News, \"California AG Would 'Absolutely' Support Medicare for All Plan,\" Oct. 23, 2017", "Congress.gov, S.1804 — Medicare for All Act of 2017, accessed Feb. 24, 2021", "C-SPAN, HHS Secretary Nominee Xavier Becerra Testifies Before Senate Finance Committee, Feb. 24, 2021", "Email interview with Larry Levitt, executive vice president for health policy at KFF, Feb. 23, 2021", "Email statement from Andrew Bates, transition spokesperson for Joe Biden, Feb. 23, 2021", "JoeBiden.com, Health Care, accessed Feb. 24, 2021", "KHN, \"Xavier Becerra in His Own Words: ‘Health Care Is a Right,’\" Dec. 7, 2020", "KHN, \"For California Attorney General Xavier Becerra, Resistance Is Personal,\" Feb. 4, 2019", "KHN, \"What to Know as ACA Heads to Supreme Court — Again,\" Nov. 9, 2020", "KHN, \"Politicians Hop Aboard ‘Medicare-for-All’ Train, Destination Unknown,\" Oct. 22, 2018", "The New York Times, \"Biden Picks Xavier Becerra to Lead Health and Human Services,\" Dec. 6, 2020", "The New York Times, \"Becerra Supports ‘Medicare for All,’ and Could Help States Get There,\" Dec. 10, 2020", "Office of Attorney General of California, Attorney General Xavier Becerra, accessed Feb. 24, 2021", "Phone interview with Anthony Wright, executive director of Health Access, Feb. 23 and 24, 2021", "Phone interview with Mark A. Peterson, professor of public policy, political science and law at UCLA, Feb. 24, 2021", "Phone interview with Joseph Antos, Wilson H. Taylor Scholar in Health Care and Retirement Policy, American Enterprise Institute, Feb. 24, 2021", "Politico, \"A Trio of Conservative Groups Tries to Torpedo Two Top Biden Nominees,\" Feb. 18, 2021", "Twitter, @ddiamond tweet, Dec. 6, 2020", "TomCotton.com, \"Senator Cotton Launches Ads in Georgia and New Hampshire Targeting Xavier Becerra,\" Feb. 22, 2021", "U.S. House of Representatives History, Art & Archives, Becerra, Xavier, accessed Feb. 24, 2021", "YouTube, \"Becerra Can’t Be Trusted — New Hampshire,\" accessed Feb. 24, 2021", "YouTube, \"Becerra — Not the Right Choice,\" accessed Feb. 24, 2021", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]