["About this rating", "In April 2018, a meme featuring a toppled statue was posted to the Facebook page \"The Voice of the People\" with the claim that it was knocked over by vandals near the Tomb of the Unknown Soldier:", "This is a genuine photograph of an overturned statue, but the accompanying text is inaccurate. The information contained in this meme was taken directly from a 1 May 2017 (not 2018) Facebook post:", "One of the statues guarding the Tomb of the Unknown Soldier monument has been pushed over by vandals at the Veterans Plaza in Longview! Was not young children who did this!", "This text claims that this photograph was taken at the \"Tomb of the Unknown Soldier\" at the Veterans Plaza in Longview, Texas. The Tomb of the Unknown Soldier, however, is located at the Arlington National Cemetery in Virginia. There is a Veterans Plaza in Longview, Texas, but none of the monuments at this memorial carry that name.", "The Longview Journal, one of the first outlets to report on the statue's fate, noted the mistake in Applewhite's post:", "Officials with the group who oversees the plaza later said the destroyed statue is not that of the Unknown Soldier, but that it represents every service member.", "The claim that this statue was \"pushed over by vandals\" and that those alleged vandals were \"not young children\" is also unverified. Local police officers were reportedly investigating the incident as an act of vandalism, but we have encountered no reports about an arrest related to this statue's destruction, nor any photographs or video showing the alleged vandals knocking the statue over.", "It also appears that the claim that this was an act of vandalism was merely an unverified assumption. We reached out to the Longview Police Department and were told that the investigation was ended due to a lack of evidence:", "We did investigate but had no information or leads and so at this point the case has been suspended.", "Sergeant R. Shane McCarter confirmed to us that a suspect was never identified but added that the police department believed the statue was intentionally toppled:", "The statue was replaced by the Veterans Recognition Foundation. The suspect was not identified nor have there been any witnesses to identify the suspect. We did take the report as a criminal mischief and do believe it was an intentional act.", "Although this statue may have truly been vandalized, it's also possible that it was an accident or the inevitable result of a structural weakness:", "Unfortunately, there doesn’t seem to be any news on who could have ruined the statue, nor if this was definitely an act of vandalism. Some are speculating that it could have been the result of a structural failure in a weak part of the sculpture.", "Regardless of how this statue met its demise, it was replaced within a few months:", "It troubled Tim Hood when he read reports of a statue destroyed by vandals at an entrance to the Veterans Plaza at Longview's Teague Park.", "The grand vice chancellor of the Longview lodge of the Knights of Pythias is not a veteran, but like many in his shoes, he respects the Americans who defended his freedom and are honored in the walk-through memorial.", "\"We had a meeting that night, so I took it to the lodge,\" Hood said Friday morning after handing the fruits of that discussion — a $1,000 check — to Veterans Recognition Foundation leaders Billy Clay and Gail Jurkowski.", "Richard Jurkowski, Executive Director of the Veterans Recognition Foundation, told us in an email that the viral meme was spreading misinformation but insisted that the statue was destroyed in an act of vandalism:", "Whoever made the initial posting did not have al the information correct.", "The statue was of a soldier on guard - he was not guarding the tomb of the unknown soldier. There is a monument nearby with the poem \"Because of You, Unknown Soldier\" By Courtney Tanabe and that might be where the person got the idea.", "The toppling and destruction of the statue was absolutely vandalism. It would have taken a truck and a chain to topple it and break it in pieces the way it was.", "Longview Journal.   \"Veterans Plaza Statue Destroyed at Teague Park in Longview.\"\r\n    2 May 2017.", "Texas Hill Country.   \"Statue of the Unknown Soldier Possibly Pushed Down in Park in Longview.\"\r\n    4 May 2017.", "Hardy, Tristan.   \"Veteran Monument Found Vandalized in Longview.\"\r\n    CBS 19.   3 May 2017.", "Updated [22 May 2018]: Added a statement from Veterans Recognition Foundation.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]