["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Amid fallout from the IRS’s admission that it improperly targeted conservative groups, Democratic-leaning Progress Texas suggested the agency’s net was cast wider, tweeting that \"2/3 of groups scrutinized were not conservatives.\"", "That May 31, 2013, statement wasn’t the first time the nonprofit advocacy group made such a claim; a May 17 post on its website said, \"Two-thirds of those groups that received extra scrutiny from the IRS were not conservative.\"", "Context: The IRS apologized May 10, 2013, for singling out tax-exemption applications from groups whose names included \"tea party,\" \"patriot\" or \"9/12.\" The organizations were seeking exemption from federal taxes either as charitable groups with IRS designation 501(c)3 or as social welfare groups, which are allowed to engage in limited political activity without disclosing donors, under IRS designation 501(c)4.", "Since then, groups of varied political stripes including Progress Texas have spoken up to say their own applications drew extra scrutiny.", "We asked how Progress Texas concluded that most of the groups were not conservative. Political director Phillip Martin told us by email that the statement was based on a May 12, 2013, Washington Post news story about a leaked report from the U.S. Treasury inspector general that the government released two days later.", "The Post story said that according to the report, \"Of the 298 groups selected for special scrutiny ... 72 had ‘tea party’ in their title, 13 had ‘patriot’ and 11 had ‘9/12.’ \" That equaled 96 groups, Martin said, or 32.2 percent of the declared 298.", "Were the other 202 groups nonconservative? Neither the report nor the story described those groups, and Progress Texas did not reply to our follow-up requests for relevant information.", "The IRS said in a May 15, 2013, press release that the groups without \"tea party\" in their names \"included organizations of all political views.\"", "Precisely what happened from May 2010 through May 2012 at the agency’s Cincinnati, Ohio, office, where all such tax-exemption applications are processed, has not become clear.", "But according to the inspector general’s report, IRS workers were instructed to look for indications of applicants’ political views and activities, including some broad descriptions but also others aimed at conservatives.", "For instance, the report says staffers were asked to flag groups educating Americans about the Constitution, which is a stated goal of the 9/12 Project, an activist organization founded by conservative broadcaster Glenn Beck.", "According to the report, the IRS criteria included:", "In U.S. House hearings May 17 and 22, 2013, lawmakers questioned acting IRS commissioner Steven Miller and the Treasury’s inspector general, J. Russell George, about the 202 unlabeled groups.", "On May 22, Miller said that \"202 non-Tea Party cases... were reviewed for indications of significant political campaign intervention, which was our key criteria,\" helping to determine whether a group’s activities affected its eligibility for the 501(c)(3) or 501(c)(4) designations. \"We did not evaluate whether or not they were conservative groups, or -- or progressive groups, or liberal groups, or whatever term you want to use,\" Miller said.", "Asked May 17 whether liberal buzz words such as \"progressive\" or \"organizing\" also were used to identify groups for scrutiny, Miller said they were not.", "IRS employees, Miller said May 17, were grouping similar applications together for efficiency. The method they used, he said, \"while intolerable, was a mistake and not an act of partisanship.\"", "George said his report did not break out the political makeup of the 202 groups because it looked only at the names of the organizations: \"Certain names were so generic that we were unable to determine whether or not they had a particular point of view.\"", "A full breakdown of the scrutinized groups, or even types of groups, might not surface. On May 20, 2013, Senate Finance Committee leaders asked the IRS for information including the names of the 298 targeted groups; they had not received the names as of June 6, 2013, committee spokeswoman Julia Lawless told us via email.", "Our ruling", "Progress Texas has twice said that two-thirds of the groups whose applications for tax-exempt status were scrutinized by the IRS were not conservative.", "The group’s fraction appears to be an unsupported assumption tied to a government report saying that 96 of 298 IRS-scrutinized organizations, or about a third, had \"tea party,\" \"patriot\" or \"9/12\" in their names. The report listed other criteria the IRS used, some of which appeared to be aimed at conservatives.", "But the report has no information on the political makeup of the other groups, and we see no other indications that their political leanings have been authoritatively summed up or individually revealed, though the IRS has said the scrutinized groups without \"tea party\" in their names reflected \"all political views,\" which presumably would fold in liberals to moderates to conservatives.", "Progress Texas’ claim shakes out as incorrect and, given the lack of backup documentation, ridiculous. Pants on Fire!", "Email interview, excerpted, with Phillip Martin, political director, Progress Texas, May 17, 2013", "Progress Texas tweet, May 31, 2013", "Progress Texas web post, \"Tea Party Not Singled Out by IRS,\" May 17, 2013", "Washington Post news story, \"IRS targeted groups critical of government, documents from agency probe show,\" May 12, 2013", "U.S. Treasury inspector general report, \"Inappropriate Criteria Were Used to Identify Tax-Exempt Applications for Review,\" May 14, 2013", "Progress Texas press release, May 15, 2013", "Internal Revenue Service press release, May 15, 2013", "U.S. House Committee on Ways and Means, \"Hearing on the IRS and Conservative Groups,\" via Lexis/CQ Transcriptions, May 17, 2013", "U.S. House Committee on Oversight and Government Reform, \"Hearing on Internal Revenue Service Tax-Exempt Investigation,\" via Lexis/CQ Transcriptions, May 22, 2013", "U.S. Sen. Orrin Hatch, R-Utah, and U.S. Sen. Max Baucus, D-Montana, U.S. Senate Finance Committee letter to acting IRS commissioner Steven Miller, May 20, 2013", "Email interview, excerpted, with Julia Lawless, press secretary, minority staff, Senate Finance Committee, June 6, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]