["About this rating", "During the 10th and final early-voting state Democratic primary debate, held in South Carolina on Feb. 25, 2020, candidate and former U.S. Vice President Joe Biden made a remark that raised eyebrows and received widespread media scrutiny. Readers turned to Snopes to verify whether Biden shared a statistic that would have meant roughly half of the American population had been killed since 2007 by guns.", "Biden did indeed make the comment. Below is a transcript of the remark, which can also be heard in the video that follows:", "In addition to that, I passed the Brady Bill with waiting periods. I led that fight. But my friend to my right and others have in fact also given to the gun manufacturers absolute immunity. Imagine if I stood here and said we'd give immunity to drug companies. We would give immunity to tobacco companies. That has caused carnage on our streets. 150 million people have been killed since 2007 when Bernie voted to exempt the gun manufacturers from liability. More than all the wars, including Vietnam, from that point on.", "Biden's comments were a criticism of his rival Bernie Sanders. Biden chastised Sanders, a U.S. senator from Vermont, for voting to approve a 2005 law that gave gun manufacturers immunity in wrongful death lawsuits. Sanders acknowledged that it was a \"bad vote\" and pledged to help overturn the law.", "There are roughly 330 million Americans, according to U.S. Census figures. Biden's campaign acknowledged that he had misspoke.", "The New York Times reported that more than 33,000 people die in firearm-related deaths in the U.S. every year, which is an annual average compiled from Centers for Disease Control and Prevention data. That would mean that an estimated 429,000 people were killed on average since the start of 2007 to the end of 2019.", "CBS News. \"Watch full South Carolina Democratic debate | CBS News.\"\r\n    YouTube. 25 February 2020.", "Hauser, Christine. \"Gun Death Rate Rose Again in 2016, C.D.C. Says.'\"\r\n  The New York Times 4 November 2017.", "Updated to clarify that the Democratic primary debate held in South Carolina on Feb. 25, 2020 was the final debate held in early-voting states.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]