["The photo was published here on Facebook on August 21, 2020. It has been shared more than 600 times.", "Part of the post’s Burmese caption translates to English as: “Jack Ma a long time ago…How do we answer when someone asks: ‘Is it possible for the poor boy in the picture to be the richest man in Asia in the future?’ / Now everybody knows that he is the richest man in Southeast Asia.”", "Jack Ma is the founder and former executive chairman of Alibaba Group, one of the world's largest e-commerce businesses. US business magazine Forbes names him the richest person in China, with a net worth of over $52billion.", "He was born on September 10, 1964.", "The photo was also shared here, here, here and here on Facebook, alongside a similar claim.", "The claim, however, is false.", "A reverse image search on Google found the same photo published here in a November 14, 2016, report by China Daily, an English-language state-owned newspaper in China.", "The report’s headline reads: “Alibaba's founder to support 'mini Jack Ma' until university graduation”.", "It reads, in part: “A young Jack Ma look-alike has won the heart of the founder of Alibaba Group, the real Jack Ma.", "“Fan Xiaoqin or ‘mini Jack Ma’ is 8 years old and lives in Yongfeng County, east China's Jiangxi Province. His family circumstances are unfortunate as his mother has poliomyelitis, his father a missing leg and his grandma, Alzheimer's disease, reported jxnews.com.cn on November 13.", "“Mini Jack Ma’ came to fame after a villager posted a video of him online in 2015. The internet exploded in remarks over how similar the boy looked to Jack Ma.”", "Below is a screenshot comparison of the photo in the misleading post (L) and the photo in the China Daily report (R):", "The photo was also published by other international media in 2016, including the Singapore-based The Straits Times here and India’s The Hindu here, in reports about Ma’s intentions to provide financial support to the child.", "In this BBC report published in November 2016, however, it states that Alibaba Group denied the claim about Ma's donation to the child's education. It states : \"All the news about Mini Jack Ma shouldn't be treated as a joke...To fund one child's education is easy, but in order to help millions of poor children, more resources need to be used.\"", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]