["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Mike Gallagher", "The ideological split on in-person schooling during the pandemic was pretty predictable through most of 2020.", "Those who generally favored lockdowns and other strong mitigation measures opposed in-person schooling, while those who derided lockdowns, mask orders and the like typically supported it.", "Like much related to COVID-19, however, positions have shifted on this issue as more data and studies have emerged.", "One prominent Wisconsin Republican says that research now supports a more widescale return to the classroom.", "\"It's time to get kids back in school,\" U.S. Rep. Mike Gallagher, R-Green Bay, said in a Dec. 7, 2020, tweet. \"New data shows in-person learning isn't driving spikes in cases, and school closures leave us with the worst of both worlds: students falling further behind without a significant impact on slowing the spread.\"", "Is Gallagher right that in-person learning isn’t driving a spike in cases?", "In a word: Yes.", "The push against virtual schooling — embraced by most school districts starting in March — has strengthened as a growing body of research shows the toll being out of the classroom takes on learning.", "In fall 2020 assessments, students in grades 3 to 8 performed similarly to same-grade students last year in reading, but 5 to 10 percentage points lower in math, according to a November report from NWEA, a research-based nonprofit group that assessed 4.4 million students.", "A November report from Renaissance Learning Inc. similarly found students falling behind in math, with some grades 12 weeks or more behind.", "The move online has in many cases worsened existing socioeconomic achievement gaps as well, since online learning works only when students have consistent internet access and home support, according to research compiled by the Economic Policy Institute and others.", "Meanwhile, the science shows school doesn’t present the risk many experts expected.", "As with many other pandemic response measures, the diversity of local guidelines governing schools has created a natural experiment.", "\"Children and schools are not the main drivers of the epidemic across countries,\" said a UNICEF report published in November. \"Evidence shows that the net benefits of keeping schools open outweigh the costs of closing them. Data from 191 countries show no consistent association between school reopening status and COVID-19 infection rates.\"", "An international research report out of Spain found a similar lack of correlation, as did a study by Insights for Education that said there is \"no consistent pattern between school status and infection levels.\"", "Even Dr. Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases, is now advocating for a measured return to in-class instruction.", "\"The default position should be to try as best as possible within reason to keep the children in school, or to get them back to school,\" he said on ABC’s \"This Week\" on Nov. 29, 2020. \"If you look at the data, the spread among children and from children is not really very big at all, not like one would have suspected. So, let's try to get the kids back, but let's try to mitigate the things that maintain and just push … community spread\" like capacity seating indoors at restaurants and bars.", "One project run by Emily Oster, an economist at Brown University, has gathered data from 13 million in-person students (some multiple times) since September, in partnership with schools around the U.S. That data showed an infection rate of 2.2 students per 1,000 over a two-week period. The staff infection rate over that span was 4.2 per 1,000.", "(Wisconsin was notably worse in both categories, averaging 7 infections per 1,000 students and 19 per 1,000 staff members)", "\"The numbers are small — smaller than what many had forecasted,\" Oster wrote in an Atlantic article detailing her early findings in October.", "CDC data shows children under age 18 make up about 10% of cases in the U.S., though they comprise 22% of the total population. (Children account for just 0.1% of deaths.)", "The key asterisk is that in-person instruction is safest when mitigation measures remain in place in both schools and the community.", "The CDC recommends use of masks and following other guidelines such as social distancing, washing hands, and regularly cleaning and disinfecting frequently touched surfaces in schools and buses. PolitiFact Missouri noted this in rating Mostly True a claim that schools using these strategies \"remain among the safest places for our students.\"", "Jordan Dunn, press secretary for Gallagher, cited this research and Fauci’s comments in defending Gallagher’s statement.", "\"That’s not to say there isn’t transmission in schools and schools should re-open without common sense safety measures,\" Dunn said in an email. \"But the data that has been collected suggests, as Rep. Gallagher states, that in-person learning is not driving spikes in cases and schools are not super-spreaders.\"", "Gallagher said, \"New data shows in-person learning isn't driving spikes in cases.\"", "Indeed, research from an array of sources in October and November show in-person instruction has not been tied to increased cases in those areas.", "Key leaders including Fauci have acknowledged classroom instruction caused fewer issues than expected, leading him to support a shift away from virtual learning.", "We rate this claim True.", "Mike Gallagher, tweet, Dec. 7, 2020", "ABC News, 'This Week' Transcript 11-29-20: Dr. Anthony Fauci and Adm. William McRaven, Nov. 29, 2020", "NWEA, Learning during COVID-19: Initial findings on students’ reading and math achievement and growth, November 2020", "Economic Policy Institute, COVID-19 and student performance, equity, and U.S. education policy, Sept. 10, 2020", "Renaissance Learning, How Kids Are Performing, Fall 2020", "UNICEF, Averting a lost COVID generation, November 2020", "Universitat Poleitecnica De Catalunya, et al, Analysis and prediction of COVID-19 for", "EU-EFTA-UK and other countries, Oct. 2, 2020", "Insights for Education, COVID-19 and Schools: What We Can Learn From Six Months of Closures and Reopening, Oct. 1, 2020", "Qualtrics and partners, COVID-19 School Response v2, accessed Dec. 18, 2020", "The Atlantic, Schools Aren’t Super-Spreaders, Oct. 9, 2020", "Wisconsin State Journal, Dr. Anthony Fauci sends a message to Wisconsin schools, Dec. 5, 2020", "PolitiFact Missouri, How safe are schools with COVID-19 mitigation strategies?, Dec. 17, 2020", "CDC, CDC COVID Data Tracker, accessed Dec. 18, 2020", "Email exchange with Jordan Dunn, press secretary for Mike Gallagher, Dec. 17-18, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]