["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Family Forward Oregon and other advocates of paid leave descended on the state Capitol this month with a Mother’s Day message for legislators: Want to be really mom-friendly? Skip the nosegays and pass legislation mandating paid maternity leave.", "\"Mothers' work opportunities, health, and bonds with their children and partners are affected by the lack of paid family leave -- a program that is standard in all but five nations around the world,\" read a section of the flier distributed to lawmakers.", "We’ll be upfront. PolitiFact Oregon found it hard to believe developing nations could offer a work-related benefit that the United States does not. We were eager to truth squad this claim.", "Lisa Frack, spokeswoman for Family Forward Oregon, shared two sources: An infographic at the Huffington Post website and a New York Times article. Both remarked on our nation’s poor showing on paid leave for moms. We also did some online searching of our own and found that, apparently, it’s well known that the United States is out-of-step with developed nations when it comes to federal law mandating paid maternity leave.", "Private companies set their own policies, and employers such as Google offer generous leave programs to retain new mothers. States can also set their own rules. California and New Jersey require paid leave for new moms. Washington approved a paid leave requirement, but has yet to find a way to pay for it.", "But the default is the federal Family and Medical Leave Act, which calls for larger employers and government to allow a qualifying worker to take up to 12 weeks of unpaid leave to have a baby or to care for a sick family member. Oregon law broadens the unpaid leave mandate to more employers and for more purposes, but there remain employees who don’t qualify or who can’t afford to take time off.", "Now, what about those other countries? The Central Intelligence Agency world fact book indicates there are about 267 \"world entities,\" and of those, 193 are United Nations member states. The World Policy Analysis Center, housed in UCLA’s Fielding School of Public Health, confirmed policies for 188 of those countries.", "\"Only the U.S., Papua New Guinea, Suriname, and 4 small Pacific islands (Nauru, Palau, Samoa, and Tonga) don’t guarantee mothers paid leave from work to care for their infant,\" wrote Amy Raub, principal research analyst with the World Policy Analysis Center, in an email to PolitiFact Oregon.", "Earlier news reports say the United States is one in three that lacks paid leave for new mothers. Family Forward has stated in a separate press release that we are one of four nations, not five. We’re not going to focus on the exact number -- except to remind speakers that sometimes, a general figure is better than a specific -- because it’s enough to say we are in the minority. Like, really in the minority.", "According to the center, even North Korea, which is ruled by a dictator, offers 11 weeks of paid maternity leave. Iraq, which was ruled by a dictator until 2003, offers nine weeks of paid leave. Bangladesh, where garment workers receive a minimum wage of $38 a month, offers 16 weeks of paid leave. Afghanistan requires 13 weeks, Pakistan 12 weeks.", "Which raises this question: How can working conditions for women -- in this respect -- be considered better in those countries than in the United States?", "We combed through an exhaustive 2010 report issued by the International Labour Organization, which reviewed maternity legislation for 167 countries.", "Again, the report confirms our outlier status. But the analysis also shows that not all women in countries where paid maternity leave is the standard are guaranteed full payment for the recommended length of time off, which is 14 weeks.", "For example, Japan requires 14 weeks of paid leave, but at a portion of regular pay and only if the employee is full-time and covered by health insurance, according to the ILO report.", "In other words, the ILO analysis shows that 59 percent of countries surveyed provided maternity leave that is \"unpaid, paid at less than two-thirds of previous earnings, or paid for a period of less than 14 weeks.\" The United States is among those countries.", "We reached out to business representatives who might take issue with the statistic, but they couldn’t shed any light on how these policies really play out in other countries. Frack, the spokeswoman for Family Forward Oregon, said we asked good questions, but didn’t know either.", "Our ruling:", "The United States is rare in that the vast majority of countries surveyed have a government policy mandating paid maternity leave. The United States is really rare when compared to countries that are wealthy, developed. And again, we’re not going to quibble over the number of countries, because what we’re talking about is magnitude.", "We find the statement is accurate, but needs additional information. We’d caution readers to read the fine print. We rule the statement Mostly True.", "(Want to comment on this fact check? Go to the story at OregonLive.com at http://www.oregonlive.com/politics/index.ssf/2013/05/is_paid_family_leave_the_norm.html#incart_river)", "Interview with and email from Lisa Frack, spokeswoman Family Forward Oregon May 10, 14, 2013", "Emails from Amy Raub, principal research analyst, World Policy Analysis Center, UCLA Fielding School of Public Health, May 13, 2013", "International Labour Organization, \"Maternity at work: A review of national legislation,\" 2010  Huffington Post, \"Still No Paid Leave For New Parents On Mother's Day (infographic),\" May 10, 2013", "New York Times, \"In Paid Family Leave, U.S. Trails Most of the Globe,\" Feb. 22, 2013", "Jody Heymann and Kristen McNeill, Changing Children’s Chances, New Findings on Child Policy Worldwide, Harvard University Press, 2013", "Christian Science Monitor, \"Parental leave global comparison: U.S. still among least generous,\" Dec. 26, 2012", "National Public Radio, \"Time With A Newborn: Maternity Leave Policies Around The World,\" Aug. 8, 2011", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]