["About this rating", "Some of the familial links documented in this list exist.", "Some of the familial links documented in this list no longer exist, and such links don't in themselves demonstrate bias in news reporting.", "The list widely reproduced via social media and email in 2016 purportedly documented several prominent media figures who had familial ties to the Obama administration. Although the list may have been mostly accurate at the time it first appeared, many of the persons identified in it have changed job positions since then:", "YOU HAD A HUNCH THE NEWS SYSTEM WAS RIGGED AND YOU COULDN'T PUT YOUR FINGER ON IT, HUH?", "THIS MIGHT SOLVE THE PUZZLE:", "And now you know why it is no surprise the media is in Obama's pocket. Think there might be a little bias in the news? This may also explain the cover up of Hillary's private server and emails,", "Benghazi, Obamacare's soaring costs, $20 trillion U.S. debt. etc., etc., etc., etc., etc., etc., etc., etc., etc.", "Isn't it interesting that every place you look in Obama's administration people fill positions because of who they know, not what they know or how competent they are — and you wonder why our country has so many problems.", "OUTDATED: Ian Cameron (ABC News) and Susan Rice (National Security Advisor).", "Ian Cameron and Susan Rice were married in 1992. Although Rice (a former U.S. ambassador to the United Nations) is still the U.S. National Security Advisor for the Obama administration, Cameron stepped down from his position with ABC News in 2010.", "TRUE: David Rhodes (CBS President) and Ben Rhodes (National Security Adviser for Strategic Communications).", "David Rhodes became the youngest network news president in history when he was tapped to head CBS News in 2011, having previously served as Vice President of News at Fox News and the head of television operations for Bloomberg. His brother, Ben Rhodes, started working as a speech writer for Barack Obama in 2007 and is currently Deputy National Security Advisor for Strategic Communications and Speechwriting.", "OUTDATED: Claire Shipman (ABC News correspondent) married to Jay Carney (White House Press Secretary).", "Claire Shipman is a correspondent for the ABC program Good Morning America.  Jay Carney took over from Robert Gibbs as White House Press Secretary for the Obama administration in 2011, but he resigned from that position in June 2014 and now works for online retailer Amazon as the senior vice president of Worldwide Corporate Affairs.", "OUTDATED: Matthew Jaffe (ABC News and Univision) married to Katie Hogan (Obama's Deputy Press Secretary).", "Matthew Jaffe worked as a reporter for ABC News and the Spanish language broadcast television network Univision during the 2012 presidential campaign, but he has since moved on and is currently the Director of Communications at the University of Chicago Institute of Politics.  Katie Hogan joined Barack Obama's political operation in February 2007 (the week before the official kick-off of his first campaign for the White House), serving as a traveling press assistant, a White House press wrangler, and deputy press secretary.  But she, too, has since left her position in the Obama administation, stepping down in 2016 to become the new chief of Organizing for Action, a non-profit group that grew out of Barack Obama's reelection campaign.", "TRUE: Ben Sherwood (ABC President) and Elizabeth Sherwood (Obama's Special Adviser)", "Ben Sherwood has been affiliated with network news for nearly three decades, serving as a producer of ABC News' Primetime, a producer of NBC's Nightly News with Tom Brokaw, executive producer of ABC's Good Morning America, and President of ABC News in New York.  Sherwood no longer holds that last position, having moved up in January 2015 to become the President of Disney-ABC Television Group and Co-Chairman of Disney Media Networks.  Ben Sherwood's sister, Elizabeth Sherwood-Randall, has served as the Special Assistant to the President and Senior Director for European Affairs, as the Coordinator for Defense Policy, Countering Weapons of Mass Destruction, and Arms Control, and (currently) as the United States Deputy Secretary of Energy for the Obama administration.", "OUTDATED: Virginia Moseley (CNN President) married to Tom Nides (Hillary Clinton’s Deputy Secretary).", "Virginia Moseley holds a prominent position at CNN, but she is not the network's president: she is currently the cable news network's Washington Deputy Bureau Chief and Vice President. Thomas Nides was one of two U.S. Deputy Secretaries of State (for Management and Resources) under Secretary of State Hillary Clinton from 2011 to 2013, but he has since rejoined the Morgan Stanley Global financial services firm as a Vice Chairman.", "Although items such as this one have criticized the Obama administration for having an \"incestuous\" relationship with the media, they do not necessarily prove that the \"media is in Obama's pocket.\" In June 2013, the Washington Post  published an article defending how news media operate honestly even when its members have ties to politicians:", "Conservatives have suggested that these relationships may play a role in how the media cover Obama, specifically in their supposedly timid approach to reporting on the White House’s handling of the terrorist attacks last year on American facilities in Benghazi, Libya. The National Review Online recently claimed that such ties amount to professional incest: “The inbreeding among Obama’s court and its press corps is more like one of those ‘I’m my own grandpaw’ deals,” wrote NRO’s Mark Steyn in a posting titled “Band of Brothers.”", "Such insinuations make media types bristle. They take exception to the notion that complicated judgments about the news — often made by others within an organization — have anything to do with personal favoritism or familial relationships. The critics, they say, can’t point to any direct evidence that such relationships have affected the amount or tone of their news coverage.", "“There is zero evidence, zero, that [Ben Sherwood’s relationship] has had any impact on our coverage,” says Jeffrey Schneider, ABC News’s chief spokesman. Schneider points out that ABC was the first mainstream news organization to report that administration officials had altered the White House’s talking points about Benghazi 12 times after the attack.", "The Post article also highlighted that news outlets are aware of these potential conflicts and employ several methods for mitigating them:", "ABC, for example, says that Sherwood doesn’t get involved with any stories dealing with arms control, his sister’s specialty. NPR said Shapiro avoids any story in which a member of the White House counsel’s office participates, such as a recent background briefing on Benghazi. And CNN said Moseley, who formerly was with ABC News, recuses herself from working on any story about the Benghazi investigation, even though her husband left the State Department in February. (Nides, a Clinton confidant, was in charge of the State Department’s internal operations until February.)", "ABC says Shipman, a former White House reporter, stopped covering politics in late 2008 after her husband, Carney, left Time magazine to become press secretary for Vice President-elect Joe Biden. She’s now the senior national correspondent for “Good Morning, America.” Shipman primarily covers softer topics for “GMA,” such as diet and fitness. But the ban on politics isn’t total; in April, Shipman filed a report on the “buzz” about former secretary of state Clinton’s 2016 presidential ambitions.", "Farhi, Paul.   \"Media, Administration Deal with Conflicts.\"\r\n    The Washington Post.   12 June 2013.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]