["About this rating", "A poem inspired by Donald Trump's inauguration described Barack Obama as a tyrant.", "This poem was not commissioned by Donald Trump nor intended to be the official poem of his 2017 inauguration.", "On 17 January 2017, the web site The Independent published an article about a poem written by Joseph Charles McKenzie which praised President-elect Donald Trump, described the future First Lady as \"Melania the Fair,\" and described Trump's predecessor (Barack Obama) as a tyrant:", "Come out for the Domhnall, ye brave men and proud,\nThe scion of Torquil and best of MacLeod!\nWith purpose and strength he came down from his tower\nTo snatch from a tyrant his ill-gotten power.\nNow the cry has gone up with a cheer from the crowd:\n“Come out for the Domhnall, the best of MacLeod!”", "When freedom is threatened by slavery’s chains\nAnd voices are silenced as misery reigns,\nWe’ll come out for a leader whose courage is true\nWhose virtues are solid and long overdue.\nFor, he’ll never forget us, we men of the crowd\nWho elected the Domhnall, the best of MacLeod!", "When crippling corruption polluted our nation\nAnd plunged our economy into stagnation,\nAs self-righteous rogues took the opulent office\nAnd plump politicians reneged on their promise,\nThe forgotten continued to form a great crowd\nThat defended the Domhnall, the best of MacLeod!", "The Domhnall’s a giver whilst others just take,\nNe’er gaining from that which his hands did not make.\nA builder of buildings, employing good men,\nHe’s enriched many cities by factors of ten.\nThe honest and true gladly march with the crowd\nStanding up for the Domhnall, the best of MacLeod!", "True friend of the migrant from both far and near,\nHe welcomes the worthy, but guards our frontier,\nLest a murderous horde, for whom hell is the norm,\nShould threaten our lives and our nation deform.\nWe immigrants hasten to swell the great crowd\nComing out for the Domhnall, the best of MacLeod!", "Academe now lies dead, the old order rots,\nNo longer policing our words and our thoughts;\nIts ignorant hirelings pretending to teach\nAre backward in vision, sophomoric in speech.\nNow we learnèd of mind add ourselves to the crowd\nThat cheers on the Domhnall, the best of MacLeod!", "The black man, forgotten, in poverty dying,\nThe poor man, the sick man, with young children crying,\nThe soldier abroad and the mother who waits,\nThe young without work or behind prison gates,\nThe veterans, wounded, all welcome the crowd\nThat fights for the Domhnall, the best of MacLeod!", "Whilst hapless old harridans flapping their traps\nTeach women to look and behave like us chaps,\nThe Domhnall defends the defenseless forlorn;\nFor, a woman’s first right is the right to be born.\nNow the bonnie young lassies that fly to the crowd\nHave a champion in Domhnall, the best of MacLeod!", "But for all his great wisdom, the braw gallant man\nIs matched by his children, the handsome Trump clan,\nAnd the flower of Europe, Melania the fair,\nAdds a luster and grace with her long flowing hair.\nMay they flourish and prosper to form a great crowd\nAround the good Domhnall, the best of MacLeod!", "Is there man left in Scotland, without base alloy,\nWho remembers the Wallace, the Bruce, or Rob Roy?\nOr have five hundred years of a blasphemous lie\nRobbed your manhood of might that you lay down and die?\nGet up and walk free, all ye brave men and proud!\nLong life to the Domhnall, the best of MacLeod!", "Although this article was published under the headline \"Poem celebrating Donald Trump inauguration describes Barack Obama as a 'tyrant,'\" The Independent used a more sensational (and less factual) title when they shared this item on social media — \"Donald Trump to pay tribute to British heritage at inauguration with poem about Scotland\":", "L", "Several other publications also shared this poem in articles claiming that it was \"Donald Trump's inauguration poem,\" misleading readers into believing that this poem would actually be read at the inaugural event. Paper Magazine, for instance, reported that this was the \"official poem for President-elect Trump's inauguration:\"", "The official poem for President-elect Trump's inauguration celebrates the Trump clan's Scottish roots (his mother, Mary Anne Macleod was born and raised in Scotland till she was 18) while taking time to exalt Trump to Christ status, and call President Obama a \"tyrant.\"", "However, this poem is not an \"official\" selection for Trump's inauguration, nor was it commissioned by the president-elect. The text of the The Independent's article explained that this poem was merely inspired by Trump's election:", "The poem, which was not commissioned by Mr Trump or his transition team, refers to snatching power from “a tyrant” who has “ill-gotten power”.", "It was written by celebrated American poet Joseph Charles McKenzie of the Society of Classical Poets.", "The group said the inspiration behind the poem is “to touch on the classical poetry existing throughout American history, and the inauguration poem marks important moments in US political history\".", "This \"inauguration\" poem was first published by the web site ClassicPoets.org on 15 January 2017. The group did not claim that the poem would be read at the inauguration, but their version of the poem was accompanied by instructions for how the it would theoretically be presented if it were used at the inauguration:", "§ The refrains at the end of each stanza are to be recited by the Inaugural crowd.\n§ A Pibroch is a rallying bagpipe tune and is pronounced like “PEA-brohgh.”\n§ Domhnall, the Scottish form of the name Donald, is pronounced like “TONE-all”\n§ Torquil was the royal progenitor of the MacLeods of Lewis, the outer hebridean island and birthplace of President Trump’s immigrant mother, Mary Anne MacLeod.", "When the group shared the poem on Facebook, the lyric was accompanied by a message imploring Trump to include the poem, making it clear that this poem had not been selected for this purpose in the first place:", "No Republican has had an inaugural poem. Trump should be the first...", "This poem is not listed in the schedule of events planned for the inauguration.", "When reached for comment, the Society of Classical Poets confirmed that this poem had not been chosen as the official poem of Donald Trump's inauguration:", "Right. Not official. We are just recommending it for the event.", "MacKenzie, Joseph.   \"Inaugural Poem for Donald J. Trump.\"\r\n    Classical Poets.   15 January 2017.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]