["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "If you’re wondering whether you should confirm that a company actually said something before you share it on the internet, please — just do it.", "A recent Facebook post recycles an old, already-debunked claim that Nike said, \"We’re a $76 Billion dollar company that can afford to let go of all ‘Make America Great Again’ customers.\"", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "First, Nike’s market capitalization as of Sept. 8 is about $176 billion, not $76 billion.", "Searching online and in the Nexis news archive we found no evidence that Nike ever made such a statement. We reached out to Nike about the claim and didn’t immediately hear back, but a spokesperson for the company told the Associated Press that the quote is fake.", "This fabricated statement has been online since at least 2018, when Nike named former San Francisco 49ers quarterback Colin Kaepernick as the face of its new \"Just Do It\" campaign. The decision drew anger from some who disapproved of Kaepernick kneeling during the national anthem before football games as a means of protest against police brutality and racial inequality.", "Snopes reported at the time that the earliest reference to the statement that appears in the Facebook post may have been on Sept. 4, 2018, when someone tweeted that \"on NPR this morning, NIKE stated, ‘We did all the math. We’re a $76 billion dollar company that can afford to let go of all ‘Make America Great Again’ customers. We would rather be on the right side of history.\"", "During an interview with NPR that morning, Justin Tinsley, a writer for the publication The Undefeated, said that though some social media posts showed people burning their Nike shoes, Nike wants \"to be on the right side of history.\"", "\"They’re not going to take a drastic hit from the bottom line,\" Tinsley said. \"And at the end of the day, Nike — again, this is an internationally known, multibillion-dollar company. They’ve done the math. They’ve done the bottom line probably hundreds of times over. And they know the benefit that can come from this.\"", "We rate this Facebook post False.", "Facebook post, Sept. 7, 2020", "Yahoo! Finance, Nike, visited Sept. 8, 2020", "Snopes, Did Nike say they can afford to ‘Let go of all Make America Great Again’ customers\"? Sept. 8, 2018", "Associated Press, Nike didn’t say it could afford to lose MAGA customers, Sept. 8, 2020", "Vox, Nike reignited the Kaepernick controversy in naming him the face of \"Just Do It,\" Sept. 4, 2018", "NPR, Colin Kaepernick is picked for Nike’s anniversary ‘Just Do It’ campaign, Sept. 4, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]