["The video, which we've archived here, is headlined, \"Victoria Falls Are Almost Bone Dry\". It was published on September 26, 2019 and features an unknown woman who claims to be on the Livingstone, Zambia side of Victoria Falls. She refers to the UNESCO World Heritage site as \"the Victoria Rocks\" and asks people to \"pray for rain\".", "“Oh my goodness, I’m in Livingstone by the Victoria Falls, well now I call it the Victoria Rocks, this is what is remaining. We definitely don’t have enough water,” she says.", "It led to some social media users responding with various pictures and explanations as evidence that the situation, while troubling, had been exaggerated and offered an incomplete picture. See posts here and here.", "One of the worst droughts in decades", "Southern Africa is grappling with one of its worst droughts in decades, as described by AFP in reports on food insecurity in Zambia and Zimbabwe from October and November, 2019.", "The Zambian side of Victoria Falls has borne the brunt, as the country's President Edgar Lungu said in a tweet on October 1.", "These pictures of the Victoris Falls are a stark reminder of what climate change is doing to our environment and our livelihood.\n\t\tIt is with no doubt that developing countries like #Zambia are the most impacted by climate change and the least able to afford its consequences. pic.twitter.com/a6X0V2TrEQ", "However, water volumes in the world’s largest waterfall are typically affected by seasonal rainfall. Tourism website Go2Africa says, “the best time to visit the spectacular Victoria Falls is from February to May, directly after the region’s summer rains”.", "In light of the intial claims, local tourism bodies took to social media with the hashtag #VictoriaFallsIsNotDry.", "Signs of improvement are already evident. The Zambezi River Authority (ZRA) shares data on the flow measurements carried out daily at eight out of eleven stations in the Kariba reservoir. This includes Victoria Falls as one of the key stations on the river -- and according to their measurements, the lowest flows recorded were during the 1995/96 season.", "The line graph shows that the water flow in November 2019 did reach low levels not seen since 1995.", "However, the ZRA also said the last flow measurement recorded at Victoria Falls on December 2 had increased during the week under review before closing at 227 cubic meters per second. For comparison, the reading on the same date in 2018 was 220 cubic meters per second.", "These data hinted at what local authorities, especially those in Zimbabwe, had been saying all along -- Victoria Falls would start seeing improved water flow in due course.", "This is not the first time tourism authorities have tried to disprove claims that the falls were drying up, as seen in this 2015 video from a tourism operator.", "On December 4, 2019, Shelley Cox, co-founder of sustainable travel agency Africa Conservation Travel gave AFP a live tour of Victoria Falls using WhatsApp video call to show that water was flowing.", "\"Some of the reports or the majority of images and videos have only showcased the Eastern Cataracts section closest to Zambia. It's given the perception that that is what the entire stretch of the Victoria Falls looks like,\" she told AFP.", "At that stage already, the section depicted on social media as being dry -- which represents about a third of Victoria Falls in size -- was seeing water start to flow. According to Cox, who has worked at the Falls for three years, this will increase as the region gets deeper into the rainfall season.", "\"The challenge when it's been framed in such a [narrow] way is that people who have been considering travelling, start to question whether or not they want to spend money to come and see a cliff,\" she said.", "In this statement from December 10, the African Travel and Tourism Authority says it acknowledges the impact climate change is having on a global scale, but adds that in the case of Victoria Falls seasonal weather patterns and the resultant water flow were being ignored.", "The tourism authority goes on to explain why Zambia sees less water flowing in the dry season, mainly owing to the variance in topography across the span of Victoria Falls, which is lower on the Zimbabwean side.", "\"Historical data provided by the Zambezi River Authority, who monitors the water level flows in the region daily, provide evidence that the annual mean water levels of the river have in fact been lower in at least six prior examples of a period spanning 1914 to the current date period,\" the statement said.", "\"For those who have been alarmed by the recent reports and somewhat sensationalised headlines, the good news is that the current records from the Zambezi River Authority are showing that water levels are once again on a consistent rise.\"", "Is climate change affecting Victoria Falls?", "The impact of climate change on the Victoria Falls remains unclear.", "However, this academic study, which looked at 40 years' worth of data from the Zambia Meteorological Department, noted that there had been \"a statistical significant change in temperature\" in Livingstone, although \"no statistically significant change in annual average rainfall\" in the town.", "The study recommended that tourism authorities plan actively for the impact of climate change on the Falls, while urging further research.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]