["About this rating", "In late November and early December 2015, rumors in Missouri held that the concurrent thefts of propane tanks and purchases of large quantities of prepaid cell phones indicated that a terrorist attack in the area was imminent.", "The interlinked rumors began with a 30 November 2015 incident at a Walmart in Lebanon, Missouri, where police were summoned to investigate a report of unusual purchase activity involving electronics. Eleven days later, the local sheriff's office advised residents that the purchases in question were definitively unrelated to terrorism and simply involved the bulk buying and reselling of cell phones.", "At the same time the cell phone rumor was circulating, many local residents and bloggers speculated that the purchases were somehow linked to the near-concurrent thefts of propane tanks from several nearby retail outlets. Due in part to fears exacerbated by the November 2015 terrorist attacks in Paris, people surmised that an apparent pattern of unusual acquisitions was clear evidence that a similar terror incident was afoot.", "An earlier article published on this site included a comment made by a retired FBI agent who maintained that propane tank theft was almost certainly unrelated to terrorist activity for many reasons:", "Retired FBI agent Michael Tabman says it is up to law enforcement to investigate and try to connect the dots.", "\"Certainly, we hear something about gas being stolen we worry about a potential bomb. The good news is this is probably not part of terrorist planning for a number of reasons,\" Tabman said.", "\"One is they wouldn't steal these items because they know that would attract law enforcement's attention. Also this would not be a tool of choice,\" he continued.", "Concerns about the cell phone purchases were put to bed by law enforcement on 11 December 2015, but a few days later the above-reproduced screenshot began circulating via Facebook:", "Candace I can't post this, my brother is with the Sheriff's Department and they were unofficially warned by an FBI field agent to advise every body that can to arm themselves and their families carry open if you don't have a CCW and be prepared for these propane tank bombs to be used against dams, bridges, and power distribution centers across the state. Expected target time is Christmas.", "The warning bore many elements of contemporaneous rumors of similar nature, primarily ones holding that an anonymous individual from a local or federal law enforcement agency had quietly attempted to warn citizens of an upcoming attack by a spreading a rumor (rather than by formally warning residents through credible means). A post-Paris warning regarding New York City held that the city's subway system was similarly at risk but the FBI didn't want to cause panic by warning riders, a rumor localized to San Bernardino claimed that after a mass shooting there local sheriffs anticipated (but did not warn) residents of potential attacks at malls and movie theaters, and another asserted that authorities had suppressed warnings about an impending attack on a mall in Illinois.", "We contacted the Bates County Sheriff's Department in Bates County, Missouri, to ask whether any warnings (official or unofficial) had been passed on by FBI agents to local law enforcement about the possible use of propane bombs \"across the state.\" The individual to whom we spoke said the claim was unequivocally false and reiterated that law enforcement believed the tank thefts were unrelated to terrorism.", "A common thread of these rumors involved law enforcement both knowing of imminent danger yet refusing to minimize potential casualties by broadcasting alerts.", "Rumors of this type serve an important function for both the teller and the listener, which is to provide anxious citizens with a means of regain a sense of control in times of heightened anxiety and uncertainty. We may not be able to do anything for the victims of past attacks, but we can feel like we're proactively doing something about terrorism now by spreading information that may help save other lives.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]