["Cynthia Nixon, a Democrat, attacked Gov. Andrew M. Cuomo's record on tax breaks for corporations and wealthy New Yorkers in a speech announcing her run for governor. (Getty images)", "Actress Cynthia Nixon quickly went on the attack against Gov. Andrew M. Cuomo when she announced she would run against him in a primary for governor.", "Nixon, a Democrat, portrayed the incumbent as a career politician who has spent his time in office pandering to corporations and the wealthy and passing legislation for their benefit, Nixon said.", "\"Since taking office, Andrew Cuomo has given massive tax breaks to corporations and the super rich,\" Nixon said.", "Nixon’s campaign staff said she was talking about cuts to the state’s corporate tax rate and changes to the state’s tax code that favored wealthy filers.", "Cuomo and state lawmakers have reduced income tax rates for middle-class earners. PolitiFact New York checked Cuomo's claim that middle-class New York State residents will have the \"lowest tax rate in 70 years\" and found his statement to be Mostly True.", "Cuomo has also said \"taxes for every New Yorker are lower today than when I started.\" PolitiFact New York ruled that it’s true income taxes for individuals, corporations, and manufacturers are lower than when he took office in 2011. But it ruled that statement Half True because property taxes are higher.", "But has he given \"massive tax breaks\" to corporations and high-income earners?", "Corporate taxes", "The state tax rate on corporations when Cuomo took office was 7.1 percent.", "State lawmakers struck a deal with Cuomo during the 2014 state budget that cut the rate to 6.5 percent, the lowest in almost half a century. The corporate tax rate for manufacturers was eliminated altogether.", "The deal also affected the estate tax -- a tax on one’s property and assets after death before inheritance. The tax applied to anyone with an estate worth more than $1 million before the deal. The state now only taxes estates worth more than about $5.2 million.", "The 'super rich’", "Cutting corporate tax rates can help wealthy earners. As we have reported before, lower corporate taxes benefit wealthy shareholders of those companies.", "But aside from the higher estate tax threshold, Cuomo has not provided any \"massive tax breaks\" to super-rich earners. Even the estate tax benefit is questionable, said E.J. McMahon, research director at the Empire Center, a state fiscal watchdog group.", "\"The estate tax reform did not save a penny for the super-rich,\" McMahon said. \"The rate and scope of the tax on the largest estates is unchanged from before 2014.\"", "In 2011, Cuomo wanted to let the state’s so-called \"millionaires tax\" expire. Filers who reported more than $500,000 in state income would have seen their state tax rate fall from 8.97 percent to 6.85 percent if the tax expired.", "Democrats in the Assembly wanted to keep the \"millionaires tax.\"", "In the end, Cuomo agreed to keep the tax but lowered the rate from 8.97 percent to 8.82 percent for the state’s highest earners.", "\"By no stretch of the imagination is this a massive tax break for the super-rich,\" McMahon said. \"In fact, in the dictionary definition of the term, there hasn’t been a ‘massive’ tax cut for anyone.\"", "One group did see a tax cut. The millionaires tax now only applies to single filers who earn more than about $1 million and married couples whose combined income exceeds about $2 million. The previous law imposed the millionaires tax on couples when their income was more than $500,000.", "Other tax cuts", "Nixon’s campaign also pointed to tax breaks for banks and real estate developers.", "Lawmakers repealed part of the tax law that determined how much state tax banks had to pay in 2014. Banks were instead added to the corporate tax code, which changed how much of their income was subject to state tax. That meant lower taxes for banks headquartered in New York state.", "Cuomo also approved legislation that gave tax breaks to five major real estate developers in New York City. A provision to waive property taxes for five projects over a decade was tucked into an omnibus housing bill in 2012. One developer was expected to save $35 million on a luxury apartment tower in Manhattan, for example.", "Cuomo was criticized for accepting campaign donations from the developers shortly before the bill was signed.", "Our ruling", "\"Since taking office, Andrew Cuomo has given massive tax breaks to corporations and the super rich,\" Nixon said in a speech announcing her candidacy.", "Cuomo has approved a tax cut for corporations since taking office, and the new rates will be the lowest in decades. Some wealthy earners also have lower state income tax rates today than when Cuomo took office.", "But the tax breaks hven't been huge and, with one exception, hven't been for the \"super rich.\"", "A higher tax rate for the wealthiest earners has continued under Cuomo and no other major tax breaks for those filers are apparent.", "We rate her claim Mostly False.", "Cynthia Nixon’s Announcement Speech, ABC News", "Email conversation with press staff from Nixon’s campaign", "Email interview with E.J. McMahon from the Empire Center", "NYS 2018 Tax Rates", "NYS 2010 Tax Rates", "NYS 2012 Tax Rates", "State Individual Income Tax Rates, 2000-2014, Tax Foundation", "State Corporate Income Tax Rates, 2000-2014, Tax Foundation", "\"New York Corporate Tax Overhaul Broadens Bases, Lowers Rates, and Reduces Complexity,\" April 14, 2014, Tax Foundation", "\"State budget ends corporate income tax for manufacturers,\" Newsday, April 1, 2014", "PolitiFact New York: New tax rates will be the lowest in 70 years, July 15, 2016", "PolitiFact New York: Wealthy would do well under tax plan, contrary to Tenney's claim, Dec. 21, 2017", "\"Tax-deal slap at millionaires,\" New York Post, Dec. 7, 2011", "\"Cuomo’s Tax Overhaul Plan Distresses Some Who See a Windfall for Banks\", NY Times, Feb. 2014", "\"Another Developer Set To Receive Lucrative Tax Breaks Gave Big Donations To Gov. Cuomo,\" NY Daily News, Aug. 15, 2013", "\"Luxury developers find ‘affordable’ way to dodge property taxes,\" New York Post, Nov. 16, 2013", "\"Gov. Cuomo got $100,000 from developer, then signed law giving it big tax breaks,\" New York Daily News, Aug. 9, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]