["About this rating", "On 28 August 2017, the fake \"antifa\" Twitter account @CambridgeAntifa posted a meme purportedly quoting House Speaker Paul Ryan as endorsing the anti-fascist group. The quote gained a wider audience the following day when actor James Woods shared it with his 800,000 followers:", "Do I agree with all of Antifa's tactics? No. Of course not. But I agree with their core values. Antifa stands for the greater global good. And so do I.", "The quote isn't real.", "Ryan has become somewhat of an enemy in \"alt-right\" circles, in part because he contradicted President Trump's assertion after a white nationalist rally in Charlottesville left a woman dead that there had been \"violence on many sides.\" Ryan denounced this sentiment:", "There are no sides. There is no other argument. We will not tolerate this hateful ideology in our society.", "Ryan's statement meant war for some of President Trump's supporters, who started to paint the House Speaker as an antifa supporter:", "How's it feel to be bought and paid for by Soros and the Clinton's?!! Sell out traitor!!!", "— ??@covfefeToni?? (@maga_Texas) August 21, 2017", "Ryan has not voiced support for antifa. We found no record of the quote included in this meme and Ryan's press secretary, Ashlee Strong, confirmed that it was fake.", "@CambridgeAntifa is not associated with an official antifa group. Dozens of fake antifa Twitter accounts have been created in recent months in an attempt to discredit the anti-fascist organization. AntifaChecker, a web site dedicated to rooting out fake antifa accounts, said that \"Cambridge Antifa is indeed 100% fake.\"", "The meme also includes at least one image that is unrelated to U.S. politics. The top left image featuring a group dressed in black and carrying red flags, was taken in London in 2011.", "Masked protesters on the streets of London during a day of protests across the city. The Home Secretary, Theresa May, is looking at giving police extra powers to force protesters to remove face coverings. Credit should read \"Joel Goodman/London News Pictures\".", "Silverman, Craig.   \"Fake Antifa Twitter Accounts Are Trolling People And Spreading Misinformation.\"\r\nBuzzfeed.   30 May 2017.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]