["Shortly after it was projected that Joe Biden would become the next president of the United States, Rudy Giuliani, President Donald Trump’s attorney, held a press conference in Philadelphia, where he made unfounded claims about voter fraud with no evidence.", "Among those claims was that American boxer Joe Frazier, who died in 2011, still votes..", "“I know this city has a sad history of voter fraud. After all, Joe Frazier is still voting here, kind of hard since he died five years ago. But, Joe continues to vote,” Giuliani said. “If I recall correctly, Joe was a Republican. So maybe I shouldn’t complain. But we should go see if Joe is voting Republican or Democrat, now from the grave.”", "Guiliani also tweeted the claim about Frazier, saying he voted in 2018, adding that actor Will Smith's grandfather also voted from the grave in 2017 and 2018.", "The Frazier claim made its way to social media and conservative news outlets.", "“World Champion Boxer Joe Frazier Voted this Year in Pennsylvania — But He Skipped Campaigning for Joe Biden Because He’s Been Dead Since 2011,” reads the headline of a story from The Gateway Pundit, which has been posted as a screenshot to social media several times.", "Other Facebook users shared a photo of the former heavyweight champion with the text, “Joe Frazier voted for Biden 2020 in PA He was unable to campaign because he died in 2011.”", "USA TODAY reached out to the Facebook users and The Gateway Pundit for comment.", "Fact check: North Carolina vote total for governor didn't exceed ballots cast", "Frazier was born on Jan. 12, 1944, in Beaufort, South Carolina, retired from boxing in 1976 and later began operating a gym in Philadelphia, according to his biography on Britannica.", "He died on Nov. 7, 2011, after a brief battle with liver cancer at the age of 67, ESPN reported.", "According to the New York Times, \"Frazier voiced no political views, but he was nonetheless depicted, to his consternation, as the favorite of the establishment.”", "PSA: Get these in your inbox: We're fact checking the news and sending it to your inbox. Sign up here to start receiving our newsletter.", "The Pennsylvania Office of Attorney Generaltold the Associated Pressin a statement this week that, “The court found no deficiency in how PA maintains its voter rolls, and there is currently no proof provided that any deceased person has voted in the 2020 election.”", "Jason Roberts, a professor of political science at the University of North Carolina at Chapel Hill, also told the Associated Press that some states have a default \"year of birth\" that is entered for registrations that lacked a birthdate on paper forms when voter registration was moved to computer.", "“Those never get updated and as time goes on the voters with this issue look ‘older’ whether they are or not,” Roberts said.", "Kevin Feeley, a spokesman for the Board of Elections, told Snopes via email that voter records in Philadelphia are updated upon receiving word of a voter’s death and that, regarding Frazier, “The Board has no evidence to support this allegation.”", "More:No recount coming in Pennsylvania as ballot counting nears completion", "In an interview with CNN, Philadelphia City Commissioner Al Schmidt confirmed there is no evidence that dead people voted in the city.", "\"I have seen the most fantastical things on social media, making completely ridiculous allegations that have no basis in fact at all and see them spread,\" Schmidt said.", "He added that his office looked into a list of dead people who purportedly voted in Philadelphia and found “not a single one of them voted in Philadelphia after they died.”", "USA TODAY has also previously debunked the claim that dead people receiving ballots and are still eligible to vote. Several experts stated that these cases are possible, but rare and the claim that these cases lead to voter fraud is unproven.", "Fact check: No one was allowed to vote after Nov. 3", "The claim that Joe Frazier voted in the 2020 election is FALSE, based on our research. There is no evidence to support this, and numerous election and county officials have confirmed that there is no evidence that dead people voted in Philadelphia.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more."]