["About this rating", "The fire at Notre Dame Cathedral in Paris on 15 April 2019 produced numerous hauntingly beautiful images of that tragedy. One such image, which received more than a million likes after it was shared on Instagram by reality star Kris Jenner, so encapsulated the moment that many viewers questioned its authenticity:", "This is just so devastating. My heart goes out to Paris. We grieve for you and pray that in time you can rebuild. Thanks to the brave firefighters who have worked so hard, risking their lives, to save the cathedral. ? #Paris #NotreDame", "A post shared by  Kris Jenner (@krisjenner) on Apr 15, 2019 at 3:58pm PDT", "The website meaww.com, for instance, claimed that the image was \"geographically impossible,\" writing that \"This particular angle of the picture is geographically impossible as the two popular landmarks are located far from each other and cannot be captured in the same shot in that angle.\"", "Regardless of the skepticism, this image was indeed a genuine photograph showing the Eiffel Tower directly in the background of the burning Notre Dame Cathedral. The image was snapped by photographer \"A.G. Photographe\" on the day of the fire.", "A.G. Photographe explained on Facebook that the image was taken from Vincennes with a Nikon D850 and a 600mm Sigma telephoto lens:", "One of my favorite points of view where I had to go tonight, but without ever thinking about this ?", "Photo taken at the moment the arrow of Notre-Dame begins to collapse ?", "D850 Nikon + 150-600 Sigma @ 600 mm / photo taken from the door of Vincennes", "One of the reasons viewers were skeptical about this image is that it appeared to show the Eiffel Tower and the Notre Dame Cathedral too close together. After all, these two architectural achievements sit approximately 2.5 miles apart, but in the photograph they appear to be nearly next to one another. This is due to A.G. Photographe's use of a rather large telephoto lens, which compresses distances so that background and foreground elements seem much closer together than they actually are.", "The website Shutterbug provided an explanation on how a telephoto lens can alter a scene: \"They compress the elements that make up the composition. This means that they make the foreground seem like it is closer to the background than it really is. The longer the lens, the more compressed the image is.\"", "This viral image wasn't the only one that A.G. Photographe took of the Notre Dame fire. Here's another one showing the Eiffel Tower in the background of the fire that was posted to Facebook:", "A number of similar photographs taken long before the fire can be found on A.G. Photographe's social media profiles. In other words, this image was not a fluke: The photographer was well-practiced at capturing the Paris skyline before setting out to shoot the Notre Dame fire and knew the best way to capture an arresting image.", "Here's another image from A.G. Photographe snapped a few days before the fire:", "? Les vieilles dames & madame la lune ? --- #toureiffel #eiffeltower #eiffelofficielle #notredame #_loves_paris #igersparis #igparis #pariscartepostale #superfrance #thisisparis #paris_focus_on #love_france_ #beautiful_destinations #Loves_france_ #super_france #hello_rooftops #pariscityvision #parismonamour #geo_plc #iloveparis #parisjetaime #cityoflove #parismovablefeast", "A post shared by  AG photographe (@ag_photographe) on Apr 9, 2019 at 10:06am PDT", "Zuckerman, Jim.   \"Telephoto Lenses: Up Close and Personal.\"\r\n    Shutterbug.   15 December 2011.", "Ghose, Ishani.   \"Kris Jenner Posts 'Impossible' Photo of Notre Dame Fire with Eiffel Tower in Background, Confuses Fans.\"\r\n    Meaww.com.   16 April 2019.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]