["The photo was published on Facebook here on February 12, 2021. It has been shared more than 1,500 times.", "\"Myanmar nationals lie on the street to protest the coup d'etat by the military,” the Thai-language caption reads.", "The photo circulated online as the Myanmar junta intensified a crackdown on protesters after a bloodless coup on February 1, 2021.", "There has been unrest in the country since soldiers detained de facto leader Aung San Suu Kyi and her top political allies, ending a decade-old fledgling democracy after generations of junta rule.", "An internet blackout last weekend failed to quell resistance that has seen huge crowds throng in big urban centres and isolated frontier villages alike.", "The same photo has been shared alongside a similar claim here, here, and here.", "The claim, however, is false.", "A Google reverse image search found the same photo published here in a report by the Washington Post on June 17, 2020.", "The photo’s caption reads: “People stage a lie-in outside the Allegheny County Jail on June 4 in downtown Pittsburgh”. The photo is credited to “Matt Freed/Pittsburgh Post-Gazette/AP”.", "A keyword search in the online image archives of AP news agency confirmed the original photo was taken on June 4, 2020.", "Below is a screenshot comparison between the image in the misleading Facebook post (L) and the image in the Washington Post’s report (R):", "Black Lives Matter demonstrations swept the United States last summer following the killing of George Floyd, an African-American man, on May 25, 2020. Floyd died after a white police officer knelt on his neck for eight minutes.", "His death -- captured on video by a bystander -- outraged Americans and many across the world, leading to millions taking to the streets to demand police reform.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]