["NC Senate leader Phil Berger on Dec. 19, 2018 made a claim about the NC elections board and referenced an investigation into Sen. Ralph Hise, shown here during a 2014 committee meeting. (courtesy of The News & Observer)", "The Republican-led North Carolina legislature has been grappling with Democratic Gov. Roy Cooper over the structure of the state elections board.", "Cooper threatened to veto the GOP’s proposal for restructuring the elections board and, in response, Republican state Senate leader Phil Berger accused Cooper of trying to weaponize the board’s \"investigatory power.\"", "Berger offered an example of how, he suggests, a Democratic elections board member wrongfully tried to influence the board’s investigation of a Republican legislator.", "\"Cooper’s now-disgraced hand-picked chairman, Andy Penry, tried to drag a cancer-stricken woman out of her hospital bed to testify at her son’s hearing on the first day of early voting over a bogus complaint that the Board hadn’t even fully investigated,\" Berger’s office said in a press release to media outlets on Dec. 19.", "(Cooper followed through on his threat to veto the bill, and legislators later overrode his veto.)", "Berger’s statement references the case of state Sen. Ralph Hise, a Republican from Mitchell County, who earlier this year faced questions from the N.C. State Board of Elections and Ethics Enforcement over his campaign finances.", "The complaints were filed in 2017 and the elections board scheduled a hearing for Oct. 17, 2018. A week prior to the hearing date, Hise sought to delay the hearing because his mother — who acted as his campaign treasurer — couldn’t testify. Hise said she was in the hospital battling cancer.", "That’s where Penry’s comments come in to play. So let’s go through Berger’s statement, claim-by-claim.", "Doctor’s note requested", "Did Penry try to \"drag a cancer-stricken woman out of her hospital bed to testify at her son’s Board of Elections hearing?\" No.", "In an Oct. 5 letter to the board that WSOC posted online, Hise’s attorney Steven Long wrote that Hise’s campaign couldn’t \"properly\" respond to questions without Hise’s mother, Shirley. Long noted that Shirley Hise was the person responsible for calculating the senator’s mileage reimbursement payments, \"which are the center of the board’s inquiry.\"", "But Shirley Hise, Long wrote, was unable to walk while undergoing cancer treatments at a hospital in Asheville. He said more information about her health would be available \"in a couple of weeks\" and offered to provide more details if needed.", "Penry, a Democrat appointed to the elections board by Cooper, replied in an Oct. 8 letter that he’d relay Ralph Hise’s request for a delay to the board. However, Penry noted that state law requires that \"matters such as this be resolved expeditiously.\"", "Penry told Long to bring a doctor’s note confirming Shirley Hise’s condition along with information about when she’d be able to testify. \"You should be prepared to proceed with all portions of your presentation other than the testimony of Ms. Hise ... as chair, I am not inclined to delay the entire matter to an unknown date.\"", "In an interview with PolitiFact, Penry said the goal of his letter was to verify Shirley Hise’s condition, find out if she could participate through other means, and determine whether Ralph Hise could proceed without her.", "\"At no time did I demand that Mrs. Hise show up,\" Penry told PolitiFact.", "Contacted by PolitiFact, Berger spokesman Pat Ryan said Shirley Hise’s doctors were \"forced\" to substantiate her condition. \"That is tantamount to trying to drag her out of her hospital bed to testify,\" Ryan said. PolitiFact disagrees.", "Hise paid settlement", "Next: was the complaint about Hise bogus? He certainly didn’t get off scot-free.", "In March 2017, Hise was accused of illegally taking money from his campaign account and violating laws requiring full disclosure of campaign contributors, the N&O reported in May 2017. The two complaints were filed by Greg Flynn of Raleigh, a Democrat who serves on the Wake County Board of Elections.", "The complaints allege Hise:", "Hise reached a settlement with the elections board in November. The settlement can be found on the elections board website.", "In the deal announced Nov. 27, Hise agreed to pay the board $4,000 to reimburse the cost of investigating the allegations and another $500 into a civil penalty and forfeiture fund, The News & Observer reported that day.", "Ryan, Berger’s spokesman, said the word \"bogus\" was used because the complaint was filed by a long-time Democratic operative and used by Sen. Hise’s opponent. The complaint, Ryan added, \"was based on relatively common campaign report mistakes that any volunteer treasurer could make.\"", "But the fact that \"mistakes\" were made and Hise was fined invalidates the argument that the complaints were meritless.", "Legal limbo", "What about the claim that the state elections board \"hadn’t fully investigated\" the complaint for which it was scheduling a hearing? That appears to be true.", "That comes from an email from the NC elections board staff to John Lewis, a Republican member of the elections board. WBTV published excerpts of the email in an Oct. 14 story.", "\"Staff does not consider the investigation to be complete. Three team members, including Director Strach, spent Wednesday in Spruce Pine (Mitchell County) interviewing two CPAs who worked with Ms. Hise on the campaign reports,\" a staff attorney wrote to Lewis in response to his inquiry, according to WBTV. The email continued: \"Staff believes that a continuance of the matter would allow for an orderly conclusion of the investigation. There is no evidence that any wrongdoing is presently ongoing, so this is a historical investigation.\"", "PolitiFact doesn’t know whether it’s common for the state elections board to schedule hearings before it completes campaign finance investigations.", "Penry, for his part, told PolitiFact that he was unaware the investigation wasn’t complete when he scheduled the Oct. 17 hearing.", "Our ruling", "Berger said Penry \"tried to drag a cancer-stricken woman out of her hospital bed to testify at her son’s hearing on the first day of early voting over a bogus complaint that the Board hadn’t even fully investigated.\"", "He appears to have a point about the hearing being scheduled before the investigation was complete. However, Berger grossly exaggerates Penry’s request of Hise’s mother (the \"cancer-stricken woman\") and downplays Hise’s violations. We rate this Mostly False.", "This story was produced by the North Carolina Fact-Checking Project, a partnership of McClatchy Carolinas, the Duke University Reporters’ Lab and PolitiFact. The NC Local News Lab Fund and the International Center for Journalists provide support for the project, which shares fact-checks with newsrooms statewide.", "A Dec. 19 press release by the office of North Carolina Senate Majority leader Phil Berger, a Republican from Rockingham County.", "Email correspondence with Pat Ryan, spokesman for state Sen. Phil Berger.", "Telephone interview with Andy Penry, former chairman of the N.C. elections board.", "Documents related to the N.C. State Board of Elections and Ethics Enforcement investigation into state Sen. Ralph Hise, a Republican from Mitchell County, and posted on the elections board’s website.", "Story by WBTV, \"Elections chairman ordered hearing on candidate complaint before investigation complete,\" published Oct. 14, 2018.", "Story by WSOC, \"NC Board of Elections 'not inclined' to delay hearing over senator's ailing mother,\" published Oct. 12, 2018.", "Letter from Steven Long, the attorney for state Sen. Ralph Hise, to Andy Penry, then-chairman of the NC elections board, dated Oct. 5, 2018 and posted online by WBTV.", "Letter from Andy Penry, then-chairman of the NC elections board, to Steven Long, attorney for state Sen. Ralph Hise, dated Oct. 8, 018 and posted online by WSOC.", "Stories by the News & Observer, \"NC lawmakers override veto of bill that makes allegations of campaign finance violations secret,\" published Dec. 27, 2018; \"NC senator settles investigation into his campaign loan,\" published Nov. 27, 2018; and \"Watchdog group calls on Sen. Hise to recuse himself over campaign finance accusations,\" May 9, 2017.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]