["Former Texas Gov. Rick Perry, who plans to say this spring if he’ll again seek the Republican presidential nomination, questioned the validity of federal unemployment statistics as he otherwise extolled the boom in his home state, according to a reporter in attendance.", "In a tweet, Dave Weigel of Bloomberg Politics quoted Perry saying during a Jan. 26, 2015, breakfast event with Jewish voters in Des Moines that the official unemployment rate is unreliable: \"It’s been massaged, it’s been doctored,\" Weigel quoted Perry saying.", "By phone, Weigel told us Perry made his remark while celebrating his state’s economy and did not take reporter questions.", "At our request, Weigel later emailed us his fuller transcript showing Perry said: \"We've got the lowest participation rate since the late 1970s when Jimmy Carter was president. I'm talking about participation in the work force. That's of really great concern for me.\"", "Perry continued: \"I mean, who is it standing up for these people that I call the uncounted? They've lost hope that they can even get a job, so they're not even counted. When you look at the unemployment rate today, that's not the true unemployment rate, it's been massaged, it's been doctored,\" Perry said.", "The U.S. unemployment rate was 5.6 percent in December 2014, down from as much as 10 percent in 2009, Democrat Barack Obama’s first year as president. The Texas jobless rate was 4.6 percent, the state’s lowest since May 2008. Indeed, on Jan. 15, 2015, in his last speech to Texas legislators as governor, Perry saluted the state’s job gains, also noting the Texas jobless rate was \"significantly below the national average.\"", "So we were curious what he meant about the rate being doctored and asked Perry aides to elaborate--without success.", "Jobless rate an imperfect indicator", "Nationally, the persistence of discouraged workers and declining workforce participation often come up as criticisms of the jobless rate.", "Perry’s mention of the official jobless rate leaving out discouraged workers was accurate.", "After Obama’s latest State of the Union address, PolitiFact rated Mostly True the Democratic leader’s declaration the unemployment rate was the lowest it had been since before the financial crisis that blew up around the time of his 2008 election.", "Still, that fact check noted Obama was citing the most basic version of the unemployment rate, which draws on regular surveys of households that originated in 1940. Another version of the rate, known as U-6, tries to capture a broader picture of labor-market weaknesses by accounting for people who are unemployed plus people working part-time who would rather have full-time work -- and people who have stopped looking for work but would begin to look again if labor-market conditions improved. By rolling in these additional factors, the U-6 rate tends to track the official unemployment rate but is usually a few points higher.", "And as it happens, the U-6 rate -- unlike the official unemployment rate -- hasn’t returned to its pre-financial-crisis level. The national December 2014 U-6 rate was 11.2 percent, higher than the 11 percent rate in September 2008.", "This gets us to Perry’s mention of labor force participation, which gauges the number of people in the labor force compared to the civilian, noninstitutionalized population. The labor force shrinks whenever someone retires, voluntarily gives up working (such as when they become a full-time parent or go back to school full-time) or because they simply give up on finding a job.", "Historically, workforce participation was down in the national recession at the end of Carter’s tenure and through the start of Ronald Reagan’s presidency, PolitiFact noted in 2012.", "More recently, the labor force participation rate has markedly decreased since 2008. In September 2008, it stood at 66 percent; it was nearly 63 percent as of December 2014, the most recent month of available data. So, the participation rate is lately at its lowest point since the late 1970s, which also was a time when fewer women had jobs outside the home. This decrease has partly been influenced by the aging of the workforce (as in Baby Boomer retirements).", "No signs of doctoring", "These wrinkles noted, is there evidence the jobless rate has been massaged and doctored, as Perry put it?", "We found none.", "In November 2013, after a manipulation charge bubbled up involving the Philadelphia region, the U.S. Census Bureau -- which conducts the Current Population Survey that gathers information from households later converted by the government to the unemployment rate -- posted a statement saying: \"We have no reason to believe that there was a systematic manipulation of the data described in media reports. As a statistical agency, the Census Bureau is very conscientious about our responsibility to produce accurate Current Population Survey data for the Bureau of Labor Statistics and all other surveys we conduct.\"", "The bureau referred the matter to the U.S. Department of Commerce’s Office of the Inspector General, which said in May 2014 it had found \"no evidence\" unemployment data had been manipulated in the months leading up to the November 2012 national election. That report also recommended some bureau reforms.", "None of several experts responding to our inquiries said the unemployment rate has been massaged or doctored.", "Among them, Andrew Biggs of the American Enterprise Institute told us the fact the regular jobless rate doesn’t reflect discouraged job-seekers or part-timers wishing for full-time jobs isn’t a deliberate government misrepresentation. Still, Biggs emailed, it means the unemployment rate doesn’t deliver an accurate picture of the labor market’s health. \"If labor force participation were the same today as prior to the recession, I believe the unemployment rate would be around 8.3%. So the idea that the labor market is really healthy today just isn’t that true,\" he said.", "In 2013, economists told PolitiFact it would be extremely difficult to alter the unemployment rate.", "William Shobe, director of the Center for Economic and Policy Studies at the University of Virginia, said it’s important to remember there are many measures of unemployment, including privately produced surveys. \"And they all agree, within the margins of error,\" Shobe said. \"The immediate conclusion that you can draw from that is that no rogue interviewer or group of rogue interviewers have managed to budge the unemployment far (or at all, mind you) from the value it would have had otherwise.\"", "Shobe added that any effort to fudge the national numbers would require the participation of interviewers across the country. \"Otherwise you would see only a localized move which would wash out as noise in the national stats,\" he said.", "Shobe, reached afresh for this story, said he was unaware of developments that would support the former governor’s claim. \"The whole idea that you could get a group of these statisticians to lie about these survey results they’re collecting and have that stick, that’s just crazy,\" Shobe said.\"These are career civil servants. Their incentives are to get the best possible numbers.\"", "Shobe suggested we query University of Wisconsin economist Menzie Chinn who told us by email that he considers such critiques of the rate to be \"specious;\" Chinn pointed us to his October 2012 blog post taking to task a similar statement by business executive Jack Welch.", "Asked to assess Perry’s comment in full, Chinn said: \"It’s true that had the labor force participation rate not declined, and we used the number of employed actually observed to calculate a rate, then mechanically the unemployment rate would have to be higher.\" Regardless, he said, it’s not so that government statisticians changed the procedure for calculations in order to change the reported unemployment number – which Chinn said is how he would define \"doctored.\"", "By phone, Tara Sinclair, a George Washington University economist, said nothing notable has occurred to demonstrate the unemployment rate has been doctored or massaged, though in August 2014, Princeton University economist Alan Krueger and others wrote a paper pointing out fewer people are responding to the survey that feeds the rate. A New York Times columnist, David Leonhardt, summarized the upshot as being a seeming \"increase in the number of people who once would have qualified as officially unemployed and today are considered out of the labor force, neither working nor looking for work.\"", "Sinclair speculated by email that Perry’s reference to discouraged workers being left out of the rate means he’d prefer to see the rate calculated with the workers counted. But the words \"massaged\" and \"doctored,\" Sinclair said, each carries a charge, implying the rate is nefariously manipulated. \"We have no evidence of that,\" Sinclair said.", "Our ruling", "Addressing Iowans, Perry said the official U.S. jobless rate \"has been doctored, it’s been massaged.\"", "There’s legitimate debate about what statistic best measures the state of the workforce and even agreement that the widely quoted unemployment rate (which Perry stressed as meaningful about a week before this Iowa stop) doesn’t provide the fullest picture of the labor force. But that's a far cry from showing the government is massaging or doctoring numbers, which implies organized underhanded wrongdoing.", "Perry may yet elaborate. We find this claim factually unsupported and ridiculous. Pants on Fire!", "PANTS ON FIRE – The statement is not accurate and makes a ridiculous claim.", "Click here for more on the six PolitiFact ratings and how we select facts to check.", "Truth-O-Meter articles, \"Ad says workforce smaller under Barack Obama than any time since Jimmy Carter,\" PolitiFact, Oct. 8, 2012; \"Elisabeth Hasselbeck suggests Census worker admitted to 2012 jobs conspiracy,\" PunditFact, Nov. 20, 2013; \"Barack Obama says unemployment rate now lower than before the financial crisis of 2008,\" PolitiFact, Jan. 21, 2015", "Statement, \"Census Bureau Statement on Collection of Survey Data,\" U.S. Census Bureau, Nov. 19, 2013 (accessed Jan. 26, 2015)", "Report, \"Unsubstantiated Allegations that the Philadelphia Regional Office Manipulated the Unemployment Survey Leading up to the 2012 Presidential Election to Cause a Decrease in the National Unemployment Rate,\" Office of the Inspector General, U.S. Department of Commerce, May 1, 2014", "Telephone interview, William M. Shobe, director, Center for Economic and Policy Studies, Weldon Cooper Center for Public Service, professor of Public Policy, Frank Batten School of Leadership and Public Policy, University of Virginia, Charlottesville, Jan. 26, 2015", "Telephone interview and emails (excerpted), Tara M. Sinclair, associate professor of Economics, Columbian College of Arts & Sciences, George Washington University, Washington, D.C., Jan. 26, 2015", "Email (excerpted), Menzie D. Chinn, professor of Public Affairs and Economics, Robert M. La Follette School of Public Affairs, University of Wisconsin, Jan. 26, 2015", "Email, Andrew Biggs, resident scholar, American Enterprise Institute, Jan. 26, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]