["The image was posted to a public Facebook group with more than 450,000 members and shared more than 15,000 times. It shows a distressed woman holding a baby with an enlarged head in one hand and dabbing her eye with the other.", "“Please don't pass me by,” reads the caption. “My baby is very sick. Please share this post to 5 groups so he can get enough prayers, please do it for my baby. He is going through a lot.”", "The post also features a purported link to a musician or band called “Sharing for God”, but the URL merely opens another page containing more religious posts.", "This method of gaining followers by linking to a page that appears to promote music is a growing trend, as seen in this AFP Fact Check.", "A reverse image search of the picture leads to articles from June 2019 about a baby who was born with a birth defect in South Africa’s Western Cape province,", "According to the Daily Voice newspaper, Lemicah Arendze was born with hydrocephalus, a condition where excess fluid builds up in the brain.", "A few months after her birth, she underwent surgery so doctors could insert a device to help relieve pressure on her brain and drain excess fluid.", "However, it had to be removed in July 2019 after causing an infection in the baby's spine. She died later that month.", "Her mother, Roxanne Arendze, told AFP Fact Check that she had seen many pictures of her daughter misused on social media up to this day.", "“No words can describe how I feel,” she said in a WhatsApp message.", "\"[I] just hope they can stop with this because it makes me sick.”", "In May 2020, the Daily Voice had already run a story about fraudsters using the photograph, with Arendze describing how it had been “exploited” in two Facebook posts.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]