["About this rating", "Drone footage showed people in hazmat suits digging trenches and burying coffins on New York’s Hart Island. At the start of April 2020, Hart Island saw burials increase from about 25 a week to 25 a day.", "Not all local people who die from COVID-19 are automatically buried at this site. For more than 150 years Hart Island has been used as a burial site for deceased people with no next of kin to claim them.", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "In April 2020, images supposedly showing mass graves being dug in New York to bury those who died during the COVID-19 coronavirus disease pandemic started to circulate on social media:", "A drone video supposedly showing these mass graves was also passed around social media:", "While the above-displayed media is genuine — large trenches are being dug on Hart Island in order to accommodate an influx of deceased individuals during the COVID-19 pandemic — there were some misconceptions on social media about these “mass graves.”", "For starters, some readers seemed to be under the impression that all people who died of COVID-19 in New York would be buried in these graves. But that’s not the case. New York City Mayor Press Secretary Freddi Goldstein told CNN that this burial site, as it has been for the last 150 years, will be used to bury the deceased who have not been claimed by their next of kin.", "CNN reports:", "Only people who have not been claimed by relatives or a loved will be buried there, Goldstein highlighted. Despite the new rule from the medical examiner, Goldstein said as long as morgue officials make contact with a relative within 14 days, they will not be moved to Hart Island.", "\"These are people who, for two weeks, we have not been able to find anyone who says 'I know that person I love that person I will handle the burial,'\" Goldstein said. \"These are people who we have made zero contact with the family.\"", "Goldstein said that the city morgue typically sends bodies to Hart Island if they go unclaimed for 30 to 60 days. As of this writing, because New York has seen an increase in deaths as a result of the COVID-19 pandemic, the medical examiner's office said that they will send bodies to Hart Island after two weeks.", "Goldstein said:", "For decades, Hart Island has been used to lay to rest decedents who have not been claimed by family members. We will continue using the Island in that fashion during this crisis and it is likely that people who have passed away from COVID-19 who fit this description will be buried on the Island in the coming days.", "Hart Island has also seen an increase in burials. According to Jason Kersten, a spokesman for the Department of Corrections, which typically oversees the burials, said that prison inmates typically bury about 25 bodies on Hart Island each week. Kersten, who said that inmates are not currently working to bury the deceased due to social distancing rules, said that Hart Island is now seeing about two dozen bodies a day:", "Reuters reported:", "Typically, some 25 bodies are interred each week by low-paid jail inmates working on the island, which sits off the east shore of the city’s Bronx borough and is accessible only by boat. That number began increasing in March as the new coronavirus spread rapidly, making New York the epicenter of the global pandemic.", "There are about two dozen bodies a day, five days a week buried on the island, said Jason Kersten, a spokesman for the Department of Correction, which oversees the burials.", "Before burial, the dead are wrapped in body bags and placed inside pine caskets. The deceased’s name is scrawled in large letters on each casket, which helps should a body need to be disinterred later. They are buried in long narrow trenches excavated by digging machines.", "City officials hope that all of the burials on Hart Island are temporary interments. All caskets are marked with the hope that individuals will eventually be claimed for proper burial.", "To sum up: New York’s Hart Island has been used as a burial site for unclaimed persons for more than 150 years. In April 2020, additional trenches were dug on the island to accommodate for an increase in unclaimed burials during the COVID-19 pandemic. While it’s unclear how many of the recently deceased died from the disease, the number of burials on Hart Island increased from about 25 a week to 25 a day.", "Robbins, Christopher; Pereira, Sydney; Hogan, Gwynne.   \"Mass Burials On Hart Island Increase Fivefold As COVID-19 Death Toll Skyrockets.\"\r\n    Gothamist.   10 April 2020", "BBC News.     \"Coronavirus: New York Ramps Up Mass Burials Amid Outbreak.\"\r\n    10 April 2020", "Jackson, Lucas; McDermid, Brendan.   \"New York City Hires Laborers to Bury Dead in Hart Island Potter's Field Amid Coronavirus Surge.\"\r\n    Reuters.   9 April 2020.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]