["About this rating", "The song \"Baby It's Cold Outside\" now strikes a wrong chord for many listeners, as its lyrics are interpreted by modern ears as narrating a predatory event. However, a rumor holding that the TBS cable channel had removed the shower scene from airings of the Christmas film Elf, a scene that features characters played by Will Ferrell and Zooey Deschanel performing a duet of \"Baby It's Cold Outside,\" was concocted merely to stir up outrage:", "TBS has announced that in order to stay in line with the #MeToo movement, they will no longer be showing the shower scene in Elf.", "A spokesperson said, \"Because of the sensitive nature of the \"Baby It's Cold Outside\" song sung during the scene, as well as the fact Buddy the Elf has never indicated that he identifies himself as a female before entering the womans bathroom, we feel its best to cut the scene from future showings of the movie.\"", "TBS did not in fact announce that they were removing the shower scene from Elf due to the controversy over the song \"Baby It's Cold Outside.\" The rumor pushed in this meme was fabricated in an attempt to mock \"politically correct culture.\"", "We searched the TBS web site and the network's social media accounts and found no announcements concerning the removal of the shower scene. In fact, when this meme first started circulating in December 2018, TBS didn't even own the rights to air this holiday movie.", "The AMC Network acquired the exclusive rights to air Elf beginning in November 2018:", "Starting in November, three Warner Bros.–distributed titles — Elf, National Lampoon’s Christmas Vacation, and The Polar Express — will air exclusively on the network of The Walking Dead, Vulture has learned. AMC will use the movies, along with more than four dozen other holiday films and specials, to anchor a new, monthlong marathon of Yuletide programming it’s dubbing “Best Christmas Ever.” Halloween is more than a month away, but the war for Christmas viewers has already started.", "In fact, TBS told us in response to our query that this rumor was \"completely false\" and added that \"the Turner networks have never had the rights to 'Elf' -- the film has previously been with Freeform, USA, and now AMC.\"", "Adalain, Josef.   \"AMC Nabs Christmas Classics as the War for Holiday TV Audiences Heats Up.\"\r\n    Vulture.   26 September 2018.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]