["“The biggest HOAX was saved for last. So was the biggest TRAP to catch them,” claims a November 28, 2020 Facebook post that shares contrasting photos of political events held by Trump, Obama and Biden along with their popular vote totals.", "Other posts sharing the same visual can be found here, and here.", "The numbers accurately correspond to popular votes cast for Obama in 2008, and Trump and Biden in 2020.", "On November 7, Biden was projected as the winner of the presidency. He received a record tally of more than 81 million votes.", "A reverse image search using Google reveals that the photos in the post are authentic, but the comparison is misleading.", "The top left photos show Trump rallies in Arizona in October 2020. One exactly matches a photo tweeted by White House Press Secretary Kayleigh McEnany here and the other is almost identical to these AFP photos here and here.", "In the top right of the post, a photo shows an Obama rally in St Louis, Missouri in October 2008, where the former president, in his final run for the White House, drew a record 100,000-plus crowd. A similar AFP photo of the event can be found here. Another photo of his Democatric nomination acceptance speech in Denver, Colorado that summer can also be seen in the post.", "The bottom part of the image is divided between four socially-distanced events held by Biden during his 2020 campaign.", "The top left photo is a Reuters photo taken by Kevin Lamarque in June, available here. It shows a press conference in Wilmington, Delaware, during which Biden announced he would not hold presidential campaign rallies due to Covid-19.", "The image in the top right corner of the Biden photos is of a meeting with labor leaders in Lancaster, Pennsylvania that took place in September. A very similar AFP photo of the event can be found here.", "The third Biden image -- bottom left corner -- is an exact match of an Associated Press photo, taken by Matt Slocum, in Yeadon, Pennsylvania, during a meeting with small business owners in June.", "The fourth Biden image, in the bottom right corner, is from a rally in Warm Springs, Georgia. It was tweeted by a local reporter, on October 27, 2020. Only that image depicts a Biden rally open to the public.", "Trump decided to continue holding rallies throughout 2020, even as coronavirus outbreaks increased across the US. The president himself was briefly hospitalized after testing positive in October. As shown in the Trump photos, people did not practice social distancing at his rallies.", "Biden changed the organization of his campaign shortly after the start of the pandemic, opting mostly for town halls via Zoom and television appearances, while encouraging social distancing and mask-wearing throughout the pandemic.", "At the end of August, the former vice-president announced a return to in-person campaigning under certain conditions. “I’m a tactile politician. I really miss being able to, you know, grab hands, shake hands,” Biden said. “You can’t do that now. But I can in fact appear beyond virtually, in person, in many of these places,” he added.", "In the last months before the election, Biden organized drive-in rallies and town halls.", "Biden repeatedly slammed Trump’s determination to rally huge crowds during the pandemic and called his attitude toward the virus “reckless,” while the president brushed the concerns aside.", "The pandemic has claimed more than 270,000 deaths in the US, as of December 4.", "AFP Fact Check has debunked dozens of claims about the 2020 presidential election, including another misleading comparison of campaign photos here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]