["About this rating", "On 5 October 2017, a Facebook page called \"Pictures in History\" shared a photograph supposedly depicting an American housewife in the 1930s who was committed to a psychiatric facility for the offense of failing to take \"proper care of her husband\":", "The caption, previously published by a Tumblr user in 2014, claimed that wives could be institutionalized and subjected to shock therapy for failing to smile often enough:", "In the 1930s, if a woman was considered \"depressed\" or if she wasn't \"taking proper care of her husband\" it was legal for her to be sent to a psych ward for a full attitude adjustment. This photo shows a smiling treatment used to condition a woman into always wearing a smile. Experts believed that if a woman saw herself smiling that it would become natural practice and she would be \"cured.\" This often went along with shock therapy.", "The image, mysterious as it is, does not appear to depict a patient in an mental institution. On the contrary, the subject is wearing street clothes, jewelry, styled hair, and makeup. Far from clarifying the mystery, a reverse image search simply led us down a different rabbit hole to a 2014 article recounting a strange urban legend about an attempt to combat a suicide epidemic in 1930s Hungary by creating what was called a \"smile club.\" The photograph was attributed (perhaps accurately, perhaps not) to an issue of a Dutch tabloid magazine called Het Levin published in 1937. We found no evidence suggesting that it was of American origin, or that it depicted a patient undergoing \"smile therapy\" in a mental institution.", "Bonaparte, Margaret.   \"Reexamining the 1950s American Housewife: How Ladies Home Journal Challenged Domestic Expectations During the Postwar Period.\"\r\n    Scripps Senior Theses.   2014.", "Holtzman, Ellen.   \"A Home Away from Home.\"\r\n    American Psychological Association.   March 2012.", "Metzl, Jonathan.   \"Mother's Little Helper: The Crisis Of Psychoanalysis and the Miltown Resolution.\"\r\n    Gender & History.   August 2003.", "Miklós, Vincze.   \"The Creepy Story of How Budapest Became a 'City of Smiles' in the 1930s.\"\r\n    io9.   19 September 2014.", "Myrvang, Christine.   \"How Flappers Rebelled Through Feminism and Consumerism.\"\r\n    Norwegian Business School.   28 April 2015.", "Roth, Robert T. and Judith Lerner.   \"Sex-Based Discrimination in the Mental Institutionalization of Women.\"\r\n    California Law Review.   May 1974.", "Shearn, Amy.   \"The Many Lives of the Angry Housewife.\"\r\n    Ithaka.   15 February 2016.", "Ware, Susan.   \"Women and the Great Depression.\"\r\n    The Gilder Lehrman Institute Of American History.   Accessed 12 October 2017.", "Warner, Judith.   \"Valium Invalidation: What If Mother (And Father) Really Did Need a Little Help?.\"\r\n    TIME.   5 October 2012.", "University of Pennsylvania School of Nursing.   \"History of Psychiatric Hospitals.\"\r\n    Accessed 12 October 2017.", "Retronaut.   \"1937: Smile School, Budapest.\"\r\n    10 April 2014.", "Perth Sunday Times.   \"City of Suicides Becomes City of Smiles.\"\r\n    17 October 1937.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]