["A now-deleted Facebook post shared more than 5,000 times shows a video panning across a large group of people dressed in black.", "It alleged that the footage was taken at the funeral of career diplomat Zindzi Mandela who died on July 13, 2020.", "According to the post, the event was attended by many more mourners than the 50 allowed under novel coronavirus laws.", "“No facemasks ... 100's of people, not only 50... no social distancing,” reads part of the caption.", "Videos shared here, here and here on social media also claimed to show footage from Mandela’s funeral.", "However, the claim is false.", "Mandela, who was South Africa's ambassador to Denmark at the time of her death, was buried in a private ceremony on July 17, 2020, as AFP reported here.", "State broadcaster SABC filmed live for more than two hours outside Mandela’s funeral.", "The live broadcast shows a modest gathering of people all wearing face masks, unlike those amassed in the footage shared in the misleading videos shared on Facebook.", "In South Africa, attendance at a funeral is limited to 50 people, according to pandemic regulations, and a permit must be obtained from a magistrate or police station. Furthermore, wearing masks, sanitising hands and social distancing are mandatory.", "#COVID19 | LOCKDOWN REGULATIONS - Attendance of #Funerals #CoronaVirusSA #Day22ofLockdown pic.twitter.com/NmqZsgVg1P", "Police spokeswoman Mathapelo Peters told AFP Fact Check that the viral videos circulating on social media were not from Mandela's funeral.", "“We picked that up from social media so we can't say for sure where that was, but it was definitely not Zindzi's funeral. That one was widely covered and the police were monitoring so we know exactly what happened there,” she said.", "The footage claimed to be of Mandela’s funeral is now under investigation by the South African Police Service (SAPS), who released a statement referring to multiple social media videos from at least one funeral -- not Mandela's -- that has led to the arrest of two people including a woman.", "\"A number of other video clips related to the same funeral service are circulating on social media and these also confirm that the number of mourners in attendance was by far in excess of the regulated limit of 50 people,\" the statement said.", "Blue flowers were worn on mourners’ lapels in the misleading video on Facebook and another clip. They were not worn by people at Mandela’s funeral.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]