["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "County election workers conduct a testing certification of the counting system at the Clark County Election Department, Wednesday, Nov. 4, 2020, in Las Vegas. (AP)", "The Nevada Elections office tweeted early in the morning of Nov. 4 that it would post its next updated results on Nov. 5. But counting of ballots continued in the counties.", "By state law, Nevada counts ballots postmarked Nov. 3 but received up until seven days later. Voters have until Nov. 12 to “cure” their mail ballots if they forgot to sign them or have signature mismatches.", "Social media posts have twisted an announcement by Nevada election officials to falsely conclude that they stopped counting ballots the day after Election Day because the presidential contest was in a dead heat.", "\"What is up with Nevada?! First they take forever to even start counting, and now that it’s even, Nevada decides to stop counting and is now not going to count anything until TOMORROW! What?!\" said a Nov. 4 Facebook post by Trapt, a band that posted many pro-Trump messages or messages critical of Democrats on social media.", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The Facebook post falsely characterized the status of counting ballots in Nevada as of Nov. 4 when the margin between President Donald Trump and former Vice President Joe Biden was too close to call.", "The Facebook post included a screengrab of a headline from Breitbart: \"Nevada: No more election results expected until Thursday.\"", "In that story, Breitbart cited a tweet by the Elections Division of the Nevada Secretary of State posted 2:45 a.m. PST Nov. 4.", "\"That’s it for election results updates until 9:00 am on Nov. 5,\" the tweet stated.", "That’s it for election results updates until 9:00 am on Nov. 5. Here’s what has been counted so far:All in person early votesAll in person Election Day votesAll mail ballots through Nov. 21/2", "'", "By that point, all in-person ballots had been counted as well as mail ballots received through Nov. 2. However, election officials still had to count mail ballots received on Election Day as well as those received over the next several days and provisional ballots.", "\"Ballots outstanding is difficult to estimate in Nevada because every voter was sent a mail ballot. Obviously, not all will vote,\" the state elections office tweeted.", "While the state elections office announced it would not post another update until Nov. 5, the counting of ballots still continued, said Jennifer Russell, a spokesperson for the Republican Secretary of State Barbara Cegavske. Russell told PolitiFact the afternoon of Nov. 4 that it was possible that the state would post an update on that day.", "The responsibility for processing ballots lies with the counties, so we went in search of a county elections official to explain the status of their count.", "Washoe County, home to Reno and evenly split between Democrats and Republicans, has about 300,000 voters, the second highest in the state. Washoe elections officials stopped counting around 12:30 a.m. Pacific Standard Time Nov. 4. By that point, elections workers had completed counting all of the in person ballots as well as mail ballots received through Nov. 2, said county spokesperson Bethany Drysdale.", "Election workers resumed work at 8 a.m. PST Nov. 4 with processing the mail-in ballots and dropbox ballots from Election Day, which adds up to about 9,000 ballots. The county expects to post results after that process is completed, expected at 10 a.m. Thursday", "\"Processing means sorting, scanning, verifying signatures, and eventually counting. They can't tally the ballots until they've gone through all the prep steps,\" Drysdale said.", "It was never the intention of the state to announce the final result on election night, Russell said. State law says that election officials have until Nov. 10 to receive mail ballots postmarked by Nov. 3. Voters have until Nov. 12 to \"cure\" their ballots if they forgot to sign them or if there was a signature mismatch. Nevada will certify results on Nov. 16.", "Trump lost Nevada in 2016. This fall he lobbed misleading attacks on mail in voting in the battleground state.", "RELATED: Trump’s misleading claim about ballot signatures in Nevada", "A Facebook post on Nov. 4 said \"Now that it’s even, Nevada decides to stop counting and is now not going to count anything until TOMORROW! What?!\"", "The post is wrong. First, elections officials didn’t stop counting ballots, and they didn’t make decisions based on the closeness of the presidential race.", "Early in the morning of Nov. 4, the state elections office tweeted that it would next announce results on the morning of Nov. 5. But a spokesperson for the Secretary of State and in Washoe County told us that the counting of ballots continued on Nov. 4.", "We rate this statement False.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more.", "Facebook post, Nov. 4, 2020", "Breitbart, Nevada: No more election results expected until Thursday, Nov. 4, 2020", "Nevada Independent editor Jon Ralston, Tweet, Nov. 4, 2020", "Nevada Secretary of State, Tweet, Nov. 4, 2020", "Nevada Secretary of State Barbara Cegavske, Voter registration statistics, September 2020", "Nevada State Assembly, AB4, Signed into law Aug. 3, 2020", "Washoe County, Nevada, Registrar of voters, 2020", "Clark County, Results, Posted 3:34 a.m. Nov. 4, 2020", "Nevada Independent, Biden narrowly leads Trump, but major Nevada races too close to call after Election Day Nov. 4, 2020", "Slate, In a Time of Crisis, a Panicked Nation Comes Together to Watch Nu-Metal Band Trapt Melt Down on Twitter, March 18, 2020", "PolitiFact, Trump’s misleading claim about ballot signatures in Nevada, Oct. 28, 2020", "PolitiFact, Trump’s falsehoods about mail voting in Nevada, fact-checked, Aug. 17, 2020", "Telephone interview, Jennifer Russell, spokesperson for Nevada Secretary of State Barbara Cegavske, Nov. 4, 2020", "Telephone interview, Bethany Drysdale, spokesperson for Washoe County, Nov. 4, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]