["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "An obscure website is falsely claiming that Canada is taking applications for a diversity immigration visa lottery — an immigration program that Canada does not have.", "\"Apply and Win the Canada DV-2019 Immigration Visa Lottery - Application is Free | Nigerians Inclusive,\" said an April 15 post on bitcoingrower.life.", "The site inaccurately claims an annual lottery \"known as Green card Lottery\" is offering \"more than 55,000 permanent resident cards each year to every person from ‘underrepresented Countries,’ which has been less represented in employment and in family-based categories in Canada and who meets these two basic eligibility requirements.\"", "The website, bitcoingrower.life, is not an official website for the Canadian government and \"the program mentioned on that site is not a Canadian immigration program,\" said Carl Beauchamp, spokesman for the Immigration, Refugees and Citizenship Canada government agency.", "Beauchamp said the agency encourages individuals to report any suspected fraudulent activities \"so that corrective measures are taken to address them.\"", "Canada’s programs and services are clearly and consistently identified with an official federal government wordmark, Beauchamp said. \"Consumers should exercise caution whenever they provide personal or financial information when applying online,\" Beauchamp added.", "Bitcoingrower.life asks individuals interested in the program to submit photos of themselves, claims that registrations are accepted year-round, and that \"at no additional cost\" winners get interview preparation advice.", "The website appears to base its post on the United States’ diversity visa program, which has been under the spotlight after false and misleading claims about it from President Donald Trump. The Trump administration has said a man accused of a terrorist attack in New York in October 2017 came to the United States through the diversity visa lottery program. (Here’s more information about that U.S. program.)", "Bitcoingrower.life muddles its own information by referencing both the United States and Canada in its post.", "The post about a Canadian diversity immigration visa lottery is bogus. We rate it Pants on Fire!", "Bitcoingrower.life, Apply Now and Win the Canada Diversity Immigration Visa Lottery (DV-2019) Program | Live and Work in Canada, April 15, 2018", "Email interview, press office for Immigration, Refugees and Citizenship Canada, April 23, 2018", "PolitiFact, Donald Trump leaves out the facts in claim about visa lottery, Jan. 30, 2018", "PolitiFact, Pick them from a bin? Donald Trump mischaracterizes diversity visa lottery, Dec. 20, 2017", "PolitiFact, Diversity visa applicants are vetted, despite contrary claim from White House press secretary, Nov. 2, 2017", "PolitiFact, Is diversity visa program a 'Schumer beauty,' as Donald Trump says?, Nov. 1, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]