["About this rating", "Among the many vexing problems with which the world continues to grapple is the issue of child marriage, a matter that predominantly affects girls in less developed countries. As the United Nations Population Fund (UNFPA) notes, 20 percent of girls worldwide are married before reaching the age of 18, and in some parts of the globe the rate is twice as high:", "Child marriage denies girls the right to choose whom and when to marry -- one of life’s most important decisions. Choosing one's partner is a major decision, one that should be made freely and without fear or coercion. On this, virtually all countries agree.", "Child marriage is a human rights violation. Despite laws against it, the practice remains widespread: Globally, one in every five girls is married, or in union, before reaching age 18. In the least developed countries, that number doubles – 40 per cent of girls are married before age 18, and 12 per cent of girls are married before age 15.", "Child marriage directly threatens girls’ health and well-being. Marriage is often followed by pregnancy, even if a girl is not yet physically or mentally ready. In developing countries, nine out of 10 births to adolescent girls occur within a marriage or a union. In these countries, complications from pregnancy and childbirth are the leading cause of death among adolescent girls aged 15 to 19.", "Girls who are married may also be exposed to sexually transmitted infections, including HIV. When girls marry, they are often forced to drop out of school so they can assume household responsibilities. This is a denial of their right to an education. Girls who leave school have worse health and economic outcomes than those who stay in school, and eventually their children fare worse as well.", "Unfortunately, social media platforms are full of inaccurate postings on the subject from persons who are not seeking to raise awareness of the child marriage issue, but simply to demonize other religions and cultures. The following is one such example of this phenomenon:", "“To all you misguided, uninformed liberal ‘women’ demonstrating in favor of embracing Islam, this young lady is being sold into sexual slavery as a child bride. She is a Christian. She watched her father beheaded and her mother raped. Where is her safe place?” the meme asks.", "However, the blonde girl pictured here was not being sold into sexual slavery as a child bride by Muslims (or anyone else), and no credible reports (outside of the inflammatory meme itself) suggested she was a Christian who had seen her \"father beheaded and her mother raped.\"", "The image used in the meme originated with a (no longer available) video from 2013 that captured a 7-year-old girl participating in a Quran recital competition, as noted in a Morocco World News article:", "The picture shows an ISIS member, seemingly in his thirties, with a seven-year-old, crying girl, who had been interpreted as his bride. The photo sparked widespread condemnation on social media before a video on YouTube proved it to be a hoax.", "The picture generated several theories. The most popular theory [was] that the young girl had been converted to Islam before being forced to marry the ISIS member appearing in the picture ..", "The website Arabic Canada solved the mystery surrounding the “outrageous” picture, by sharing a video of what seems to be a Quran recital competition -- from which the picture was taken -- organized by ISIS in Klassa, a neighborhood in Aleppo, in 2013.", "The video shows the ISIS member, who was misleadingly presented as the young girl’s groom, having a small chat with her before she recites verses of the Quran.", "Feeling embarrassed for making several mistakes during her recitation, Ghada, the young girl, starts crying before the man returns. He then clearly tries to comfort her and boost her spirits.", "The referenced Arabic Canada website (now defunct) wrote of this picture as follows (roughly translated from Arabic):", "A seven-year-old girl looks very frightened, while the man standing next to her looks smiling and happy. The text accompanying the photograph claims that the man in the picture forced the girl to marry him. Some versions even went so far as to identify the girl as a Christian who had been forced to convert to Islam and read the Quran. Of course, the picture produced a feeling of disgust in everyone who saw it. Some newspapers wrote articles denouncing the phenomenon of child marriage in Islam. One newspaper of course took the opportunity to refer to the marriage of six-year-old Aisha [the third wife of the prophet Muhammad] and claimed that Islam permitted and encouraged child marriage.", "The photo is actually a screenshot from a video of a children's recitation contest held in Aleppo in September 2013, and although the organizers of the contest certainly belong to ISIS, the video includes no reference to marriage. The dismay on the girl's face was apparently triggered by her having made a mistake in reciting the Quran.", "Other screenshots from the video captured the girl looking considerably less distraught:", "This isn't to say that child marriage isn't a real problem, or that it and other depredations — such as beheadings and rape — haven't been perpetrated by those associated with ISIS, but the image used in this meme isn't representative of any of those issues.", "Morocco World News.   \"Truth Behind Alleged Marriage of ISIS Member with 7-Year-Old Girl.\"\r\n    18 August 2014.", "United Nations Population Fund.   \"Child Marriage.\"\r\n    Accessed 18 March 2019.", "Arabic Canada.   \"بالفيديو : حقيقة زواج داعشي من طفلة عمرها 7 سنوات.\"\r\n    13 August 2014.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]