["The post from October 30, 2018, contains a picture from the opening with Eastern Cape provincial commissioner LtGen Liziwe Ntshinga and uniformed Chinese dignitaries, with a caption saying, “#Chinese are now opening their own Police Stations in South Africa to protect their own people and Businesses. #Ramaphosa and #ANC have sold our country to the highest Bider”.", "The post has to date been shared 2,179 times, has 166 reactions and 46 comments.", "In a similar post shared on Twitter by an account with 468,390 followers, four images from the opening are included in the tweet stating, “Now Chinese are opening their own Police Stations in South Africa, they have already opened 13 & this one was opened yesterday in PE. They even teach police to speak Chinese so that the Chinese people don't struggle to communicate with them.”", "The tweet was also commented on by Julius Malema, president of the Economic Freedom Fighters (EFF) opposition party, receiving over 200 comments and more than 1,100 likes.", "The post has been retweeted 2,962 times, has 2,740 likes and approximately 1,300 comments varying from questions about what legal powers the centre holds to comments about being “colonised” by the Chinese.", "Various versions of this narrative are published on other websites.", "“These Co-operation centres are NOT police stations and are NOT manned by the South African Police Service staff,” said Colonel Priscilla Naidu of the Eastern Cape South African Police Service (SAPS) via email.", "“The SAPS is mandated by the Constitution of this country to serve and protect all citizens in this country and as mandated our powers cannot be conferred upon to any other.”", "Colonel Naidu told AFP that the SAPS were invited to the opening of the centre in Port Elizabeth and this is when they were informed by the CCPCC that 13 centres have been opened across the country.", "The CEO of the CCPCC, Jie Lee Zhang says the first centre was launched in 2005 in Johannesburg and that a centre’s location depends on how big the population of Chinese nationals is in the region.", "To date 14 Chinese centres have been opened in South Africa to accommodate Chinese nationals living in the country. The CCPCC estimates that there are 250-350,000 Chinese nationals living in the country of some 57 million.", "“It’s not a so-called Chinese police station,” said Lee Zhang.", "The main purpose of the centre is to “establish good relationship with SAPS, metro police and the community police. We [are] not an enforcement organisation, we are a non-profit organisation – the catalyst between the two countries and two communities but we do get a lot of support from both governments.”", "He says the CCPCC cannot arrest or detain individuals and that the picture of uniformed Chinese nationals added to confusion about the function of the centre.", "“That’s how people get confused, they see the uniform and they think it’s a real Chinese station being opened. The one is a police counsellor visiting the embassy in Pretoria and his colleague. It’s the protocol and that is their profession, they are the police officials from China so that’s why they wear uniform,” said Zhang.", "The CEO added that the Chinese representatives were there to support a function involving Chinese nationals.", "“They think that this is a Chinese station and that can never be the case, you can’t violate the constitution and South African law”.", "The Chinese are however offering free basic mandarin lessons to members of the SAPS to aid in communication between their community and the SAPS.", "“We wish to set the record straight that the Chinese do NOT have their own police station and should they require any assistance relating to crime or other matters, they must report to their nearest SAPS for assistance,” concluded Colonel Naidu.", "At this stage, Zhang does not foresee any more centres being opened as the Chinese are “covered” throughout the country.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]