["Georgia voters have twice refused to amend the state constitution to allow for an appointed -- rather than elected -- state school superintendent.", "But those votes took place roughly 30 years ago (1984 and 1988), and that old idea could have new legs if state Rep. Mike Dudgeon, a Republican from Johns Creek, has his way.", "On the eve of last month’s general election, Dudgeon announced on Facebook that he would be pushing a similar constitutional amendment in the General Assembly session that starts in January.", "\"This is not about who is or is not elected to the position tomorrow but about governance,\" he wrote on Facebook.", "In 38 states, the state school superintendent is appointed by either the governor or the state school board, Dudgeon said in an interview published Nov. 18.", "It only makes sense that Georgia would follow the other states’ lead, he said.", "PolitiFact decided Dudgeon’s claim merited a closer look.", "First, a little background about the job of state school superintendent.", "In Georgia, it’s an elected position paying $127,000 a year with largely administrative duties -- mainly running the state Department of Education, which has 786 employees and a $9.6 billion annual budget. The superintendent also carries out policies set by lawmakers, the governor and the members of the state Board of Education who are appointed by the governor from the state’s 14 congressional districts.", "Some of the more recent superintendents have made headlines, including Linda Schrenko, who went to prison for stealing federal funds, some of which she spent on a facelift; and Kathy Cox, who proposed striking the word \"evolution\" from the state science curriculum. Cox was back in the headlines in 2008 as a $1 million winner on the popular game show \"Are you Smarter than a 5th Grader?\" She promised her winnings to schools for the disabled, but creditors in a bankruptcy related to her husband’s failed home construction business had other ideas.", "John Barge, the current Republican superintendent, sparred with Gov. Nathan Deal over a constitutional amendment on charter schools, then ran unsuccessfully against him. Barge made a rare cross-party endorsement of Democrat Valarie Wilson, who lost this year’s superintendent’s race to Richard Woods, a Republican and retired South Georgia teacher and school administrator.", "Dudgeon’s proposed constitutional amendment would not affect Woods. It would require approval of two-thirds of the state House and Senate and could not go before voters until 2016, Dudgeon told PolitiFact.", "But do most states really have appointed state superintendents? And is Georgia really in the minority with an elected one?", "We reached out to the Council of Chief State School Officers and the Education Commission of the States, two groups that keep such data.", "Their records show 37 states with appointed superintendents and 13 states with elected superintendents, including Georgia and Wyoming.", "Wyoming was not counted in an ECS PowerPoint that Dudgeon relied on from earlier in the year that’s recently been updated, ECS staff told us.", "Wyoming is currently debating whether to move from an appointed to an elected superintendent.", "The outgoing superintendent there was threatened with impeachment and lawsuits and removed last year, though her duties were later reinstated by the state Supreme Court, according to news accounts.", "Dudgeon said Georgia’s current system, with an elected state superintendent and an appointed state school board, doesn’t make sense.", "\"We are electing an administrator and appointing the people (the state school board) who make the policy,\" he said. That’s opposite the way it normally works, Dudgeon said.", "His constitutional amendment would change the method for selecting state school board members, though the specifics are still being developed.", "\"My preference is that they not all be appointed by the governor,\" Dudgeon said.", "A similar constitutional amendment was filed but not pursued in the General Assembly in 2001 by Phil Gingrey, then a state senator and now a member of the U.S. House.", "Georgia’s local school districts were traditionally run by elected superintendents, but that changed as of 1996.", "The Georgia School Boards Association is on record in support of an appointed state superintendent and nonpartisan state board with one member elected from each of the state’s 14 congressional districts.", "Our ruling: Dudgeon’s on target with his claim that the vast majority of states have an appointed state school superintendent. We rate his statement True.", "\"Is this elected office really necessary,\" by Tom Crawford, Charlton County Herald, Nov. 18, 2014, http://charltoncountyherald.com/articles/2014/11/19/opinion/editorials/doc546b7cf505bf4944229262.txt", "Sen. Phil Gingrey prefiles legislation to change the law in December 2001, http://www.legis.ga.gov/Legislation/en-US/display/20012002/SR/471", "Bio and legislation, state Rep. Mike Dudgeon,www.house.ga.gov/Representatives/en-US/member.aspx?Member=759&Session=23", "\"Cox’s Tenure had Highs and Lows,\" by Laura Diamond, The Atlanta Journal-Constitution, May 18, 2010, http://www.ajc.com/news/news/local-govt-politics/kathy-coxs-tenure-full-of-highs-lows/nQf8K/", "\"Education study points to support for appointed superintendent,\" by Aernin Curtis, Wyoming Tribune Eagle, Nov. 29, 2014 http://trib.com/news/local/education/education-study-points-to-support-for-appointed-superintendent/article_a74ccaa0-3f88-553d-86e1-b7c81dcb50e1.html", "\"School Corruption Sentence Coming to an End,\" The Atlanta Journal-Constitution, Jan. 17, 2012", "http://www.google.com/url?sa=t&rct=j&q=&esrc=s&source=web&cd=14&ved=0CGgQFjAN&url=http%3A%2F%2Fwww.ajc.com%2Fnews%2Fnews%2Flocal%2Fschool-corruption-sentence-coming-to-end%2FnQQQk%2F&ei=GRKCVNP_C8ibNu-agoAD&usg=AFQjCNG_qJazaOpIajwG90saLo4q3OStUQ&sig2=IE1HS2xKbY7RRHrXmp0oHg&bvm=bv.80642063,d.eXY", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]