["About this rating", "In early July 2020, Snopes readers inquired about a meme circulating on social media containing a quote attributed to Congolese gynecologist Denis Mukwege, a renowned surgeon whose work to end sexual violence as a weapon used in war earned him the Nobel Peace Prize in 2018.", "The meme contains the claim that Dr. Mukwege resigned from his position with the Congolese coronavirus task force because he was being offered money to falsify cases.", "On June 18, 2020, the quote attributed to him forced Mukwege to confirm via Twitter that he never made the statement contained in the meme. Nevertheless, the meme circulated amid the ongoing coronavirus pandemic, fueling online conspiracy theories that the pandemic is a hoax, and that case numbers are being artificially inflated by governments.", "It is true that Mukwege resigned from his role as vice chairman of the Multi-Sectoral Coronavirus Response Committee, the task force coordinating the pandemic response in the South Kivu province of the Congo. Mukwege release a statement on June 10 announcing this decision, explaining that it was driven by his frustration over slow testing and subpar preventative measures. The statement from Mukwege makes no mention of any of the factors stated in the meme.", "In short, Mukwege did resign from his post with the coronavirus response team in the Congo, but he never made the comment attributed to him in a widely seen meme, which was being used to circulate online misinformation about the coronavirus pandemic. Therefore, we rate this claim \"False.\"", "Maliro, Al-Hadji Kudra and Krista Larson. \"Congo Doctor Quits COVID-19 Task Force, Notes Testing Delays.\"\r\n  Associated Press. 11 June 2020.", "Panzi Foundation. \"Dr. Mukwege Resigns from the Multi-Sectoral Commission and the Health Commission Set Up as Part of the Response to the COVID-19 Pandemic in the Province of South Kivu.\"\r\n  10 June 2020.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]