["“Royal Palace confirms Queen Elizabeth tests positive for coronavirus,” reads the headline on an article shared more than 1,500 times on Facebook since it was posted on March 28.", "AFP found dozens more reports from news sites, mostly based in Nigeria, that published the claims. We’ve archived some of them here, here and here.", "A report from Nigerian site Bluenews published the claims alongside a doctored picture of the British monarch wearing a face mask.", "“Her Majesty the Queen of England has tested positive to Coronavirus, although she’s show (sic) no symptoms of weakness at the moment as we hear she’s in good Condition!” the article reads.", "AFP ran a reverse image search and traced the original version of the photo to an article by The Daily Mail newspaper on the Queen attending church on Christmas Day in 2017.", "Royal officials announced on March 30 that the Queen’s eldest son and heir, Prince Charles, was no longer in isolation after testing positive for COVID-19.", "Concerns were also raised for the health of the 93-year-old monarch after Britain’s Prime Minister Boris Johnson also tested positive for the disease.", "The Queen held her weekly Audience with the Prime Minister today by telephone. Her Majesty - pictured this evening at Windsor Castle - has held a weekly Audience with her Prime Minister throughout her reign. pic.twitter.com/9rYoLTfkO4", "But Buckingham Palace has made no announcement that the Queen herself has been diagnosed with the disease.", "On March 27, a Palace spokesman said the Queen “remains in good health” and was “following all the appropriate advice with regards to her welfare”.", "The Queen has been staying with her 98-year-old husband Prince Philip at Windsor Castle in southeast England since March 19.", "AFP previously debunked false reports that the Pope tested positive for COVID-19.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]