["About this rating", "In February 2019, former first lady Michelle Obama was set to kick off the second leg of a speaking tour to promote her memoir Becoming in the Pacific Northwest, with engagements scheduled for the Tacoma Dome in Tacoma, WA, on 8 February and at the Moda Center in Portland, OR, the following day.", "Those two engagements were postponed until the following month due to the approach of Winter Storm Maya, which was forecast to drop several inches of snow on the Seattle-Tacoma and Portland areas.  But the notoriously unreliable Mad World News website falsely claimed that the \"real\" and \"secret\" reason for the change was that Michelle Obama was trying to avoid \"pissed off\" stadium workers who planned to protest at her event and was \"forced\" to \"cancel\" it:", "Michelle Obama was scheduled to resume her big book tour today, but on Thursday afternoon, she strangely announced that she was canceling, only hours before the event. The truth is that the former first lady felt forced to cancel the event. Tacoma stadium workers are pissed off with her and were ready to make her appearance extremely difficult, but she doesn’t want anyone to know why. Don’t miss this.", "Well, Michelle couldn’t handle the truth that she really doesn’t care that much about the union workers, so she blamed the weather and canceled the Tacoma appearance, and that’s the “secret” Michelle is hiding — it’s the real reason she canceled her gig. The upset workers were calling on all of their union buddies to show up and protest outside the venue.", "It’s true there is a big storm coming into the Tacoma area, but it won’t hit until late Friday night. And it is forecast to be gone within hours. This storm was also forecast a few days ago, so we aren’t buying that all of sudden Michelle is worried about the weather.", "The funny thing is the 55-year-old former first lady is scheduled to be in Portland, Oregon on Saturday, and the weather there is the same. In fact, Portland is in the line of fire from the same storm. But Michelle has no intention of canceling Portland. And strangely, there are no protests scheduled for that venue.", "It is true that a dispute has been ongoing between a subcontractor that supplies event services to the Tacoma Dome (Rhino Staging Northwest) and the International Alliance of Theatrical Stage Employees (IATSE) union, and that as a result \"Rhino workers have regularly conducted audience outreach and ‘bannering’ outside the Tacoma Dome at recent events.\"", "However, contrary to what Mad World News claimed, the former first lady's speaking event wasn't \"cancelled\"; it was just postponed until an open date the following month when she would be back in the area.  And the reason for the postponement was in fact because of severe weather conditions in the Tacoma area.", "First of all, Michelle Obama's appearance was not cancelled \"only hours before the event.\"  As the tweet from the hosting venue (the Tacoma Dome) included in the Mad World News article documented, the announcement that the event originally scheduled for Friday evening at 8:00 PM had been postponed was issued early Thursday afternoon, more than thirty hours -- well over a day -- in advance:", "? Live Nation and Crown Publishing announce Becoming: An Intimate Conversation with Michelle Obama scheduled for Friday, February 8 will be postponed to Sunday, March 24. ? (1/3) pic.twitter.com/55eKAOVUIE", "— TacomaDome (@TacomaDome) February 7, 2019", "It was also not the case, as Mad World News claimed, that the anticipated snowstorm was not forecast to \"hit until late Friday night.\"  The onset of the snowstorm was expected to -- and did -- hit the Seattle-Tacoma area around mid-day on Friday:", "On Friday morning, well in advance of the scheduled event, motorists on the main Seattle-Tacoma artery (I-5) were being warned of \"heavy snow\" forecast for the \"afternoon commute\":", "Meanwhile, hundreds of flights flying into and out of the Sea-Tac airport had already been delayed or cancelled by early Friday morning, and Washington's governor declared a state of emergency as Seattle reached its average yearly amount of snowfall in a single day.", "Nor, as Mad World News falsely asserted, was the snow \"forecast to be gone within hours.\"  Rather, weather reports indicated that \"temperatures are forecast to get just a handful of degrees above freezing all week.\"  And in fact, well after the original scheduled date of the event, Tacoma neighborhoods and roads were still blanketed under several inches of snow:", "Finally, Mad World News attempted to \"prove\" weather wasn't the real factor by wrongly declaring that \"Portland is in the line of fire from the same storm ... But Michelle has no intention of canceling Portland. And strangely, there are no protests scheduled for that venue.\"  In fact, Michelle Obama's appearance in Portland was postponed as well, as the city prepared for Winter Storm Maya and a snowstorm described as potentially the \"worst of the century\":", "Live Nation and Crown Publishing announce Becoming: An Intimate Conversation with Michelle Obama scheduled for Saturday, February 9 will be postponed to Tuesday, March 19.More info » https://t.co/9CGf2eg5NK pic.twitter.com/naX19sd3bD", "— Moda Center (@ModaCenter) February 8, 2019", "We also note that since Michelle Obama's appearance was merely postponed and not cancelled, any venue workers who were planning to protest at the event will still have full opportunity to do so, and thus she had nothing to gain in that regard by moving her appearance back a month.", "Diserio, Rebecca.   \"Michelle Feels Forced to Cancel Appearance After She Pisses Off Stadium Workers.\"\r\n    Mad World News.   8 February 2019.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]