["Neal Browning receives a shot in the first-stage safety study clinical trial of a potential vaccine for COVID-19, the disease caused by the new coronavirus on March 16, 2020, at the Kaiser Permanente Washington Health Research Institute in Seattle. (AP)", "Trump has not announced a vaccine to prevent COVID-19. As of now, there is no specific treatment for the coronavirus.", "The false claim was spread on spam news websites registered in Ghana and Nigeria. Similar hoaxes have circulated widely abroad.", "Federal agencies are accelerating clinical trials of potential COVID-19 vaccines, but public health officials have said they could take up to a year and a half to finish.", "President Donald Trump has touted how quickly the government is developing potential COVID-19 vaccines. An article circulating on Facebook gives him even more credit.", "The story, which was published March 24 on several spam news websites, claims that Trump is getting ready to announce the name and launch date of a vaccine for the coronavirus.", "\"The president of the United States of America will officially make the announcement about the vaccine to cure the virus on Sunday,\" reads the article, which includes a purported photo of the vaccine. \"Roche medical company will launch the vaccine on Sunday.\"", "The articles were flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "(Screenshot)", "The stories, published on spam websites registered in West Africa, are bogus.", "Trump did not announce a vaccine on Sunday, March 29, and the Centers for Disease Control and Prevention says there is currently no vaccine to prevent coronavirus infections. Several other fact-checkers have debunked the false news articles. While clinical trials have started for some potential vaccines, they are still at least a year away from being completed.", "The image in the article claims to show a COVID-19 vaccine, but it’s actually a testing kit developed by a Korean biotechnology company. Similar out-of-context images have circulated in India and Pakistan.", "Roche, a Swiss pharmaceutical company, has been shipping coronavirus tests to the U.S. and testing a drug used to treat rheumatoid arthritis for potential application in severe COVID-19 cases. The company has not developed a coronavirus vaccine.", "During a March 29 press briefing, Trump said potential COVID-19 vaccines \"are moving along very rapidly.\"", "The first clinical trial of a potential COVID-19 vaccine began in Seattle in mid March. The trial will enroll 45 healthy adult volunteers over about six weeks, according to the National Institutes of Health. The potential vaccine was developed by scientists at the National Institute of Allergy and Infectious Diseases (NIAID) and biotechnology company Moderna, Inc.", "RELATED: 7 ways to avoid misinformation during the coronavirus pandemic", "In a March 30 press release, the Department of Health and Human Services said it is accelerating clinical trials of that vaccine, as well as another potential COVID-19 vaccine from Janssen Research & Development. But the first phase of the latter trial is set to begin \"no later than fall of 2020 with the goal of making COVID-19 vaccine available for emergency use in the United States in early 2021,\" according to HHS.", "During his March 11 testimony to the House Oversight and Reform Committee on the coronavirus outbreak, Dr. Anthony Fauci, director of NIAID, laid out a timeline for developing a COVID-19 vaccine. He said phase one will take about three months to determine if it’s safe, then phase two, during which scientists will test whether the vaccine works, could take another eight months at least.", "He cautioned that any process that moves faster than that could be dangerous.", "\"So when you’ve heard me say we would not have a vaccine that would even be ready to start to deploy for a year to a year and a half, that is the time frame,\" Fauci told representatives. \"Now anyone who thinks that it will go more quickly than that I believe will be cutting corners that would be detrimental.\"", "Public domain records show that some of the websites spreading the bogus articles about a new coronavirus vaccine are registered in Ghana and Nigeria. Both countries have recently been linked to Russian disinformation campaigns, and websites associated with Russia and China have amplified conspiracies about the coronavirus in the past few weeks. Other stories were published by shell websites and promoted on Opera News Hub, a content creation platform that’s popular in Nigeria.", "The articles are inaccurate and make a ridiculous claim. We rate them Pants on Fire!", "Agence France-Presse, \"US President Donald Trump did not announce a coronavirus vaccine was 'ready,’\" March 25, 2020", "Alt News, \"Image of COVID-19 test kit shared as newly developed ‘coronavirus vaccine’ by Roche,\" March 23, 2020", "Associated Press, \"NOT REAL NEWS: Debunking Yet More False Coronavirus Content,\" March 27, 2020", "CNN, \"Russian election meddling is back -- via Ghana and Nigeria -- and in your feeds,\" March 13, 2020", "C-SPAN, \"House Oversight and Reform Committee Hearing on Coronavirus Response, Day 1,\" March 11, 2020", "C-SPAN, \"White House Coronavirus Task Force Briefing,\" March 29, 2020", "India Today, \"Fact Check: Image of Covid-19 testing kit passed off as vaccine on social media,\" March 23, 2020", "Ktkmediagh.com, \"Trump Announce Name Of Vaccine To Cure Corona Virus In Three Hours,\" March 24, 2020", "National Institutes of Health, \"NIH clinical trial of investigational vaccine for COVID-19 begins,\" March 16, 2020", "The New York Times, \"As Virus Spreads, China and Russia See Openings for Disinformation,\" March 28, 2020", "News-af.feednews.com, \"Trump Announce Name Of Vaccine To Cure Corona Virus In Three Hours,\" March 24, 2020", "Newsliteng.com, \"Trump Announce Name Of Vaccine To Cure Corona Virus In Three Hours,\" March 25, 2020", "Opera, \"Opera launches Opera News Hub, a new online media platform where content creators can reach over 350 million people,\" Nov. 12, 2019", "Opr.news, \"Trump Announce Name Of Vaccine To Cure Corona Virus In Three Hours,\" March 24, 2020", "ProPakistani, \"Fact Check: Viral Message About a Coronavirus Vaccine is Fake,\" April 1, 2020", "Roche, \"Roche response to COVID-19 pandemic,\" March 24, 2020", "U.S. Department of Health and Human Services, \"HHS Accelerates Clinical Trials, Prepares for Manufacturing of COVID-19 Vaccines,\" March 30, 2020", "WhoIs, accessed April 1, 2020", "Wired, \"FDA Approves the First Commercial Coronavirus Tests in the US,\" March 16, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]