["In a mailer, Texas Land Commissioner George P. Bush (shown here touring a museum in April 2017) called himself a retired Navy officer. PolitiFact Texas found this claim False (PHOTO: RALPH BARRERA/AUSTIN AMERICAN-STATESMAN).", "George P. Bush, seeking a second term as state land commissioner, touts his time in the Navy in a voter mailer brought to our attention by his predecessor.", "\"Did you know there are 1.7 million veterans in Texas alone?\" Bush’s mailer opens. His message continues: \"Retired U.S. Navy officer George P. Bush is committed to protecting our veterans who have served this great nation.\"", "Hold on. Did Bush, who turns 42 in April 2018, retire from the Navy? Jerry Patterson, the former land commissioner challenging Bush in this year’s Republican primary, questioned that after telling us he’d received Bush’s mailer at his home after hearing about it from other veterans.", "Patterson asserted by phone: \"It takes 20 years to retire from the armed forces.\" He himself, Patterson said, retired from the Marines as a lieutenant colonel after more than 20 years of service. \"If this mailing goes out to military veterans, essentially he’s saying I know what you went through, I served for 20 years--and that’s not true,\" Patterson said.", "We decided to check the facts.", "For starters, Bush was a Navy Reserve officer.", "By email, Navy spokeswoman Katie Suich gave us a document confirming that George Prescott Bush was commissioned as a Navy Reserve officer on May 21, 2007, and left the Navy Reserve as a lieutenant on May 9, 2017.", "Bush's biographical entry on his campaign website says Bush served in \"Operation Enduring Freedom in Afghanistan as an officer in the U.S. Naval Reserve.\" In a 2011 article for USA Today, Bush wrote: \"Earlier this year, I returned to Texas from Afghanistan, where I was deployed as an intelligence officer in the U.S. Navy Reserve.\" Bush noted then that he’d been inspired to enlist in his thirties after a ceremony honoring his grandfather, President George H.W. Bush, who served during World War II.", "Bush campaign spokesman, Lee Spieckerman, told us that Bush was honorably discharged from the Navy in 2017, \"having achieved the rank of Lieutenant.\" Spieckerman also passed along documents and photos including a May 15, 2007, letter congratulating Bush on his selection as an intelligence officer and a certificate showing Bush was honorably discharged as a lieutenant on May 9, 2017.", "Another provided document, dated Feb. 4, 2011, discharges Bush from active duty. The form says Bush served one year, four months and 15 days on active duty from June 8, 2010, through Feb. 4, 2011, following on 26 days of active duty before that. (Spieckerman showed in another document that Bush was assigned to Afghanistan from August 2010 to January 2011.) The discharge form credits Bush with previously racking up two years, 11 months and five days of inactive duty.", "Navy confirmation of service dates, retirement requirements", "We also reached out to the Navy which says on a web page: \"If you decide to pursue your Navy career for at least 20 years, you’ll qualify for generous retirement pay – and even more if you serve longer.\" Another Navy web page says that by serving in the Navy Reserve, a person earns \"points toward retirement benefits every time you drill.\"", "Suich also pointed out a Defense Finance and Accounting Service web page listing types of military retirement, most of them requiring 15 or 20 years of service. According to the page, reservists can retire at age 60 with 20 years of active service.", "For our part, we spotted a Defense Department website devoted to military compensation including this statement: \"Service members who remain on active duty or serve in the Reserves or Guard for a sufficient period of time (usually a minimum of 20 years) may retire and receive retired pay. Members who become disabled while on duty may be medically retired and receive a disability retirement.\"", "Spieckerman says 'retired' used in colloquial sense", "We asked Bush’s campaign if he’s indeed a retired officer given the general requirement that a retiree serve 20 years and be age 60.", "By email, Spieckerman replied that Bush \"was honorably discharged but is not technically ‘retired’ under Department of Defense regulations. I think that the campaign used the term ‘retired’ in campaign materials in the civilian, colloquial sense,\" meaning, Spieckerman wrote, that Bush \"is no longer active in the military. There was no intent to imply that he was receiving retirement pay and benefits, etc.\"", "Our ruling", "In a voter mailer, Bush says he’s a \"retired U.S. Navy officer.\"", "Bush served nearly a decade as an officer in the Navy Reserve. But that doesn’t make him a retired officer, we find. At minimum, Bush would need to have served longer to call himself that.", "We rate this self-description False.", "FALSE – The statement is not accurate. Click here for more on the six PolitiFact ratings and how we select facts to check.", "Phone interview, Jerry Patterson, Feb. 14, 2018", "Web page showing George P. Bush’s biographical entry, George P. Bush campaign, undated (accessed Feb. 14, 2018)", "Story, \"George P. Bush: 'Gampy' inspired me to serve,\" USA Today, Feb. 16, 2011", "Web pages, U.S. Navy, \"Retirement,\" \"Life After the Navy,\"  undated (accessed Feb. 14, 2018)", "Web page, \"Military Compensation,\" Department of Defense, undated (accessed Feb. 14, 2018)", "Email, Katie Suich, public affairs specialist, Navy Personnel Command Communications Office, Feb. 15, 2018", "Document, \"Biographical Data, George Prescott Bush,\" undated (received by email from Katie Suich, Feb. 15, 2018)", "Web page, \"Types of Retirement,\" Defense Finance and Accounting Service, Department of Defense, last updated May 16, 2017 (accessed Feb. 15, 2018)", "Emails, Lee Spieckerman, communications consultant to George P. Bush campaign, Feb. 15, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]