["The meme shows two pictures: in the first, President Mutharika is cutting a ceremonial ribbon tied to a tap, and the second shows him with his hands clasped while an open tap fills a transparent bucket.", "In one misleading Facebook post archived by AFP Fact Check, the meme is captioned: “President Peter Mutharika's official commissioning of a Water tap in Mzimba”.", "Commenters on the post poked fun at the idea of a ceremony being held for a single tap.", "The Mzimba Integrated Urban Water and Sanitation Project was launched on March 5, according to a post on the Malawian government’s Facebook page from the same day. The post included a series of photos credited to Lisa Kadango of the Malawi News Agency.", "The Mzimba project, costing a total 16.7 billion Malawian Kwacha (US$22.85 million), was approved in 2015 and financed by the Opec Fund for International Development (OFID), the African Development Bank (AfDB) and Malawi's government.", "According to this report on the project uploaded to the AfDB's website, the new sanitation infrastructure is intended to provide clean water for between 31,000 and 48,000 people. It includes new water facilities in schools and market places.", "The photos posted on the Malawi government's Facebook page also show that Mutharika inaugurated more than a single tap on the day of the ceremony.", "Here he is unveiling a plaque commemorating the launch:", "As well as cutting a ribbon next to a gazebo which reads “potable water for all”.", "According to the charity WaterAid, one in three Malawians still don't have access to clean water.", "In 2018 AFP reported on a cholera outbreak which affected hundreds of people, killing nine, as a result of unsafe water in the country.", "Malawi's Vice President Saulos Chilima and former president Joyce Banda are both challenging Mutharika for the presidency as the country gears up for national elections on May 21.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]