["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Workers toil on a new home under construction. (AP/David Zalubowski)", "Did West Virginia lead the nation in the growth of construction jobs jobs in 2017? The West Virginia Republican Party says it did.", "On Sept. 14, the party tweeted, \"Did you know West Virginia added the highest percentage of new construction jobs in 2017 in the United States, at 14.4%? This amounted to 4,300 additional jobs! In fact, #WV was the only state with double-digit growth! Read more about the #WVcomeback.\"", "Did you know West Virginia added the highest percentage of new construction jobs in 2017 in the United States, at 14.4%? This amounted to 4,300 additional jobs! In fact, #WV was the only state with double-digit growth! Read more about the #WVcomeback: https://t.co/S6ygb08HxK", "The tweet linked to an article from the Wheeling News-Register citing those numbers. But we wanted to confirm this with original data.", "It turns out that the source of the 50-state comparison is a report by the Associated General Contractors of America, a trade association in the construction industry. The comparison is drawn from data collected from the federal Bureau of Labor Statistics.", "Here are the five states with the biggest percentage increases during 2017.", "State", "Increase in jobs", "Twelve-month percentage increase", "West Virginia", "4,300", "14.4 percent", "California", "75,500", "9.8 percent", "Nevada", "7,800", "9.7 percent", "New Mexico", "4,300", "9.7 percent", "Idaho", "3,800", "8.7 percent", "So the party’s tweet was accurate.", "We also took a longer-term look at construction employment in the state. According to the Bureau of Labor Statistics, construction employment in West Virginia bottomed out in the second half of 2016 and rose consistently through the first quarter of 2018 before stabilizing.", "Still, the current level of construction employment in West Virginia hasn’t returned to its nearly three-decade peak in the period before the onset of the Great Recession.", "It’s worth noting that construction jobs, while important for people within the industry and within adjacent industries, only account for about 4.5 percent of non-agricultural employment in the state -- about 34,000 construction jobs in August 2018 out of 752,000 nonfarm jobs in all.", "\"Total job growth clearly matters more to West Virginia citizens than employment in just one not-so-big industry,\" said Gary Burtless, an economist with the Brookings Institution in Washington, D.C.", "Still, as far as the tweet’s limited claim goes, it is accurate.", "The West Virginia Republican Party tweeted that \"West Virginia added the highest percentage of new construction jobs in 2017 in the United States, at 14.4%? This amounted to 4,300 additional jobs! In fact, #WV was the only state with double-digit growth!\"", "A look at the original data shows that the No. 1 ranking, the percentage increase, and the raw increase in jobs are all correct. So is West Virginia’s distinction as the only state with double-digit growth in 2017. We rate the statement True.", "West Virginia Republican Party, tweet, Sept. 14, 2018", "Federal Reserve Bank of St. Louis, \"All Employees: Construction in West Virginia,\" accessed Oct. 31, 2018", "Wheeling News-Register, \"West Virginia Leads Nation in Construction Job Growth,\" March 23, 2018", "Associated General Contractors of America, \"State Construction Employment (seasonally adjusted), Ranked by Latest 12-month % Change,\" accessed Oct. 31, 2018", "Email interview with Gary Burtless, economist with the Brookings Institution, Nov. 2, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]