["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "U.S. Rep. Connie Mack IV, R-Fort Myers, has been criticized for missing votes while campaigning for U.S. Senate.\n\nA Republican rival, former U.S. Rep. Dave Weldon of Indialantic near Melbourne, aired a robocall recently that picked up that story line:\n\n\"How angry would you be if you hired someone to do a job and they only showed up half the time? You know -- they only cut half the grass, or they charged you for four hours when they really only worked two? Well, that’s what candidate Connie Mack has done. This year in Congress he has missed almost half of his votes, and now he not only wants to be paid for not showing up, he wants to be promoted into the U.S. Senate.\"\n\nWe wanted to check if that number was correct.\n\nGovTrack.us tracks missed votes for members of Congress using voting information from the official websites of the U.S. House of Representatives and Senate. The page on Mack states that throughout his tenure, starting in January 2005 through July 23, 2012, Mack missed 362 of 6190 recorded or roll call votes, which is 6 percent. The median was 2.4 percent.\n\nWe noticed that Mack’s percentage of missed votes started to spike in late 2011, when he missed 10.1 percent of votes. Mack announced he was running for Senate in late October 2011, with the goal of taking on Democratic U.S. Sen. Bill Nelson.\n\nSince the robocall said he missed almost half the votes \"this year,\" we will focus on Mack’s 2012 record. Below are his votes from Jan. 1 to July 23.", "We shared our findings with Weldon and asked how he concluded that Mack missed \"almost half\" of his votes this year.", "\"You know how these things are,\" Weldon said in an interview with PolitiFact. \" I didn’t actually get that. I relied on my staff to research that. It sounds like you did a better job than them.\"\n\nWeldon said that the claim might have been based on previous attacks against Mack by George LeMieux, who dropped his Republican U.S. Senate bid in June.\n\nThe robocall might not have factored in the second quarter and the portion of the third quarter, Weldon said.\n\n\"It sounds like (Mack) is showing up more,\" Weldon said.\n\nCampaign spokesman J.B. Kump said that he didn’t put together the robocall, but it was intended to refer to the first quarter.\n\n\"It was something that will probably be corrected in future robocalls if we use that script again,\" Kump said. \"We will try to be more accurate.\"\n\nBut Kump reiterated the general criticism of Mack saying he has missed too many votes -- in an email he told PolitiFact \"Any discussion of quarters, etc., is just quibbling.\"\n\nKump wouldn’t tell us exactly when or where the robocall aired -- the Tampa Bay Times posted it on its Buzz blog on July 22 and stated that voters heard it in Tampa Bay over the weekend.\n\nAmerican Bridge 21st Century PAC, a Democratic group, said in July that Mack missed about 31 percent of votes based on the first half of 2012. (They arrived at a slightly different figure because they didn’t use the partial data available for the beginning of the third quarter.)", "Mack’s missed votes have made news for several months. The Tampa Bay Times reported in February that Mack missed a series of missed votes, including to repeal part of the health care law. POLITICO noted in April that Mack missed  the high-profile vote on Rep. Paul Ryan’s budget plan.\n\nMack’s response\n\nMack’s campaign spokesman David James did not dispute our numbers.\n\n\"Mack has a lifetime 95 percent voting attendance record affected by missing some votes to make sure Mitt Romney won the Florida presidential primary in January, something Connie's constituents felt very strongly about when it comes to invoking the change we need in Washington,\" James told PolitiFact.\n\nIt’s not unusual for a congressman running for statewide office to miss a high number of votes. The Miami Herald reported in a 2000 story that Nelson missed many votes in 1990 while running for governor.", "Nelson has only missed one vote this year, according to GovTrack, but unlike Mack, he hasn’t faced feisty primary challengers, and the Senate takes fewer votes.", "Our ruling\n\nThe Weldon robocall said that Connie Mack \"missed almost half of his votes\" this year. Actually, Mack missed about 28.6 percent of votes this year, which is significantly less than the robocall claimed. The Weldon campaign conceded that they relied on out-of-date information for their attack.", "However, Mack has missed votes. He's missed more votes than the average member of the U.S. House of Representatives, and he's missed high-profile votes on health care and the budget.", "He hasn't missed \"almost half of his votes,\" though. So we rate this claim Mostly False.", "Tampa Bay Times The Buzz blog, Weldon robocall rips Mack for missing votes, July 22, 2012\n\nTampa Bay Times The Buzz blog, \"Missed votes could be an issue for U.S. Rep. Mack as U.S. Sen. campaign heats up,\" Feb. 3, 2012\n\nTampa Bay Times The Buzz blog, \"Connie Mack competing with Charlie  Rangel for most missed votes,\" July 24,  2012\n\nMiami Herald, \"Campaign pressures McCollum candidate: Senate run restricts voting in House,\" Accessed in Nexis, Oct. 16, 2000\n\nPolitico, \"Connie Mack skips out on big votes, hits trail instead,\" April 17, 2012\n\nGeorge LeMieux for U.S. Senate, Radio ad, March 14, 2012\n\nGovTrack.us, Missed votes for U.S. Rep. Connie Mack (R-Fort Myers), Accessed July 23, 2012\n\nGovTrack.us, Missed votes for U.S. Sen. Bill Nelson (D-Florida), Accessed July 23, 2012\n\nNew York Times Inside Congress, Top house vote missers, Accessed July 23, 2012\n\nDave Weldon U.S. Senate campaign website, Facebook page, Accessed July 23, 2012\n\nInterview, U.S. Senate Republican candidate and former U.S. Rep. Dave Weldon who represented Florida’s Space Coast 1995-2008, July 23, 2012\n\nInterview, J.B. Kump, spokesman for Dave Weldon’s U.S. Senate campaign, July 23, 2012\n\nInterview, Joshua Tauberer, president of Civic Impulse which created the GovTrack.us website, July 23, 2012", "Interview, David James, spokesman for Connie Mack's  U.S. Senate campaign, July 23, 2012\n\nInterview, Matt Thornton, spokesman for American Bridge 21st Century PAC, July 24, 2012", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]