["About this rating", "A photograph purportedly showing an \"eerie and beautiful\" Marilyn Monroe at rest for a final viewing in her funeral casket has been widely circulated online:", "This image is a \"real\" photograph in a sense, but not a photograph of the August 1962 event it's claimed to depict. It actually captures a  sculpture of Monroe created by Italian artist Paolo Schmidlin:", "Even the most photographed woman in the world — such as an icon immortal Marilyn Monroe — there is a final image ending its short earthly parable and that could give meaning to this brief life.", "That's why I wanted to represent it even as she rests in her coffin, in silence, finally at peace. The passions and sorrows of the world already so far away.", "A sleeping beauty contemporary vision that torments and delights at the same time. The enigmatic beauty of permanent abandonment.", "Although these photographs are imagined recreations, they may very well accurately represent how the actress may have looked at the time of her burial. According to the Los Angeles Times, Monroe wore a green dress and scarf as she was laid to rest:", "As beautiful in death as in life, the actress lay in an open bronze casket during the non-denominational rites, wearing a simple green sheath dress and a green scarf around her neck.", "In her hand was a tiny bouquet of baby pink roses put there by (Joe) DiMaggio.", "Kirichi, Serena.   \"Old Age, Death and Decay: Paolo Schmidlin.\"\r\n    Enquire.   18 June 2012.", "Lum, Jessica.   \"Funeral for a Hollywood Legend: The Death of Marilyn Monroe.\"\r\n    Los Angeles Times.   8 August 2011.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]