["A post shared hundreds of times on Facebook, archived here, claims that the picture shows food parcels that Rwandan President Paul Kagame \"is handing over to each family for telling them to stay at home”. The post asks readers to forward the message to Nigerian leader Muhammadu Buhari.", "Similar posts have been shared on Facebook, Instagram and Twitter in Nigeria, as well as in news reports.", "A reverse image search revealed the photo has been circulating online since at least May 2019 -- months before the virus emerged in the Chinese city of Wuhan last December.", "Facebook posts claim the image shows food donations in The Gambia during the holy month of Ramadan. Posts archived here, here, and here show more pictures from the food distribution.", "AFP also found this video from May 2019 showing people walking around the food parcels. A male voice-over in French says a Gambian man named Cheikh Alhadj Ibrahima Silla donated the food to the local Muslim community for the holy month of Ramadan.", "AFP is working to verify the claim that the footage was taken in The Gambia in May 2019.", "A few days after the posts began making the rounds online, Ngozi Okonjo-Iweala, former managing director of the World Bank and two-time finance minister in Nigeria, shared the picture with the caption: “Responsible food distribution with social distancing to assist lower income households in the #COVID19 era! A great example from #Rwanda where community workers also distribute food and other necessities door-to-door”.", "Her posts were shared more than 4,500 times on Facebook and Twitter.", "Hours after posting the misleading tweet, Okonjo-Iweala tweeted that she had been misled by a friend.", "Thanks to those who have drawn my attention to the food distribution picture I tweeted earlier today. A friend sent it to me that it’s from Rwanda. Whether Gambia or Rwanda, the point I want us to focus on is that it is a safe way of handling food distribution.", "Rwanda and Nigeria have recorded hundreds of cases of the novel coronavirus disease, known as COVID-19. While Rwanda has ordered a nationwide lockdown, Nigeria has shut down two major states -- Lagos and Ogun -- and the Federal Capital Territory.", "Rwanda has indeed formulated a social protective plan for the delivery of free food to at least 20,000 households in the capital Kigali.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]