["About this rating", "In February 2017, several reputable news organizations reported on a homily that Pope Francis had delivered in Rome. These stories were published with headlines indicating that the Pope had suggested that it was better to be an atheist than a \"bad Christian\" or \"hypocritical Catholic\":", "As this news filtered down to less reputable web sites, what was previously reported as something the Pope had \"suggested\" was presented as a direct quote:", "The above-quoted statements are all paraphrases of something Pope Francis said during a homily in Rome on 23 February 2017, as he was speaking those who identify as a Christian but don't follow the tenets of their faith:", "“But what is scandal? Scandal is saying one thing and doing another; it is a double life, a double life. A totally double life: ‘I am very Catholic, I always go to Mass, I belong to this association and that one; but my life is not Christian, I don’t pay my workers a just wage, I exploit people, I am dirty in my business, I launder money ...’ A double life. And so many Christians are like this, and these people scandalize others. How many times have we heard — all of us, around the neighborhood and elsewhere — ‘but to be a Catholic like that, it’s better to be an atheist.’ It is that, scandal. You destroy. You beat down. And this happens every day, it’s enough to see the news on TV, or to read the papers. In the papers there are so many scandals, and there is also the great publicity of the scandals. And with the scandals there is destruction.”", "This translation, provided by the Vatican Radio, makes it clear that the Pope didn't directly say that it was better to be an atheist than a \"bad\"  (or \"greedy\" or \"hypocritical\") Catholic or Christian. Rather, the Pope was repeating a common phrase commenting on Catholics who conduct their lives in ways contrary to their faith.", "Vatican Radio also elaborated on the message of the Pope's homily as follows:", "Don’t scandalize “the little ones” with a double life, because scandal destroys. That was the message of Pope Francis in his homily at the morning Mass at the Casa Santa Marta. And so, the Pope said, we should not put off conversion.", "“Cut off your hand,” “Pluck out your eye,” but “don’t scandalize the little ones,” that is, the just, those who confide in the Lord, who believe simply in the Lord. That was the Pope’s exhortation in the homily, based on the day’s Gospel. For the Lord, he said, scandal is destruction", "CNN noted that the Pope's homily came in response to Thursday's mass reading which included the following passage from the Gospel of Mark:", "Whoever causes one of these little ones who believe in me to sin,\nit would be better for him if a great millstone\nwere put around his neck\nand he were thrown into the sea.", "Zauzmer, Julie.    \"Pope Francis Suggests It’s Better to Be an Atheist Than a Hypocritical Catholic.\"\r\n    The Washington Post.    23 February 2017.", "Vatican Radio.    \"Pope: Don't Put Off Conversion, Give Up a Double Life.\"\r\n    23 February 2017.", "Burke, Daniel.    \"Pope Suggests It's Better to Be an Atheist Than a Bad Christian.\"\r\n    CNN.    23 February 2017.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]