["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Johnson got a patent in 1922 for inventing a type of wrench while he was in prison.", "The first-ever wrench was patented in 1835.", "The monkey wrench was patented around 1858, some 20 years before Johnson was born.", "Rapper Snoop Dogg shared a meme about the world’s first African-American heavyweight boxing champion and a claim of racism.", "The meme, which includes an image of boxer Jack Johnson, claims that while in prison, Johnson invented and patented the very first wrench — and that white people insulted him by calling it the monkey wrench.", "The meme is labeled, \"Knowledge is key. This is DEEP.\" It reads:", "\"On February 3, 1903 Jack Johnson became the first ‘negro’ heavy weight title champion. But, did you know he was also an inventor? While in Jail in Kansas, he invented the wrench! In 1922 he received a patent for his invention. In fact, white people still found a way to tarnish this great accomplishment by dubbing it the ‘monkey wrench’. A term many use freely today. Do the math!\"", "The June 15 Instagram post, which gained more than 700,000 likes, was shared during the fourth week of national protests over police brutality following the death of George Floyd. It was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Johnson, the son of former slaves, won the unified heavyweight championship in 1908. The International Boxing Hall of Fame shared this description of him: \"A gaudy, bold character who lived just as he wanted, Johnson enraged the defenders of white supremacy with his refusal to accept anything less than equality. He was beloved by blacks and some whites, but thoroughly hated and eventually conquered by those who saw him as a threat to America's divided society.\"", "In 1913, Johnson was convicted of violating the Mann Act, which made it a felony to transport across state lines \"any woman or girls for the purpose of prostitution or debauchery, or for any other immoral purpose,\" but was used to prosecute people involved in premarital, extramarital and interracial relationships. Johnson was traveling with his white girlfriend who later became his wife. He served a year at Leavenworth federal prison in Kansas.", "President Donald Trump posthumously pardoned Johnson in 2018, saying he had received a request from Sylvester Stallone.", "Johnson was awarded a patent for a wrench that improved gripping and made disassembly easier.", "\"My invention relates to improvements in wrenches and has for its object to provide an improved wrench, which is of simple and durable construction, reliable in operation and easy and inexpensive to manufacture, which may be easily and readily adjusted and which is adapted to exert a powerful gripping action upon the work,\" he wrote in his application, which was filed in March 1921. The patent was awarded in April 1922.", "Johnson had conceptualized and diagrammed a tool to help tighten loosening fastening devices while at Leavenworth, according to the Jim Crow Museum at Ferris State University in Michigan.", "But the first wrench had been patented in 1835, and the first monkey wrench was patented around 1858.", "A monkey wrench, by the way, is a wrench with one fixed and one adjustable jaw at right angles to a straight handle.", "There is some dispute about the origin of the name \"monkey wrench.\" The Jim Crow Museum says that it was named using a purposeful misspelling of the name of the inventor, Charles Moncky. An alternative explanation is that the wrench was invented before Moncky’s wrench and got its name because it was similar to a \"key wrench,\" but was different enough to be called a \"non-key\" wrench.", "Johnson did get a patent for a wrench he invented while in prison.", "But it was not the first wrench ever invented, and the original as well as one that became known as the monkey wrench were patented decades earlier. The origin of the monkey wrench name had nothing to do with Johnson.", "We rate the statement False.", "Instagram, post (archived here), June 15, 2020", "Snopes, \"Did Jack Johnson Invent the Monkey Wrench?\", Dec. 14, 2015", "Ferris State University Jim Crow Museum of Racist Memorabilia, \"Jack Johnson and the Wrench,\" February 2005", "Google Patents, Patent US1413121A, accessed June 17, 2020", "Wisconsin State Journal, \"Curiosities: Why do they call it a monkey wrench?\", Nov 28, 2010", "Africa Check, \"‘Monkey wrench’ dates to 1800s – not name given to boxer Jack Johnson’s invention,\" Aug. 8 2019", "Email, Ferris State University Jim Crow Museum of Racist Memorabilia founder and director David Pilgrim, June 18, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]