["About this rating", "On 20 September 2017, the disreputable web site Neon Nettle published a fake news article claiming that the decapitated corpse of a pedophile named William Smith was found on the doorsteps of a judge in Dallas, Texas:", "The body of the headless man that was discovered outside a judge's home has been identified as a that of a pedophile who walked free from a recent bail hearing.", "William Smith, 28 from Dallas, Texas was discovered in the early hours of Tuesday morning, decapitated and left outside the front door of a judge who had granted him bail in August.", "The web site Your News Wire also published this same story.", "Although the  articles cited \"reports,\" they didn't provide any links or citations indicating where they received their information. Furthermore, the image featured in the articles was taken from a June 2017 WLBT report about the discovery of a headless body in Jackson, Mississippi. An autopsy on the body revealed that it was 30-year-old Jeremy Jerome Jackson:", "Autopsy results show that 30-year-old Jeremy Jerome Jackson's head was severed while he was still alive. He also suffered a non-fatal gunshot wound to the leg.", "Jackson was beheaded and his torso found burned Saturday. Tuesday Jackson police announced a $20,000.00 reward for information that leads to an arrest in the Jeremy Jackson murder.", "Through tears, Johnny Jackson recounted the last time he saw his younger brother Jeremy. It was last Friday. He then got the call Saturday, about his disturbing murder.", "\"From my speculation, it was a message sent from somebody or to the city because you just don't kill somebody in the bushes then take their head and put it on display,\" said Jackson. \"They displayed him and you could ride down the street and see it on the step. To me, it was a message sent to somebody.\"", "The featured image can be seen at the 25-second mark of the video report. Jackson's severed head was left on the porch of a home.", "Genuine news reports about this incident made no mention of the body being found on a judge's doorstep, or that the victim had been a pedophile. These claims are simply the imaginings of a fake news writer.", "McLaughlin, Eliott.   \"Reward Offered for Info on Decapitated Body Found in Mississippi Capital.\"\r\n    CNN.   13 June 2017.", "Kenney, David.   \"AUTOPSY: Jackson Man Was Alive When His Head Was Cut Off.\"\r\n    MS News Now.   13 June 2017.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]