["“Compliments of the UNagenda & the Liberals, Canada will now be eliminating all Security Screening at airports so terrorists & traffickers will have no resistance entering our beautiful nation,” claims a tweet published on March 21, 2019. Screenshots of the tweet were subsequently shared hundreds of times on Facebook.", "The tweet quotes another tweet which links to reporting on the 2019 fiscal budget delivered on March 19 by Canadian Finance Minister Bill Morneau. The reporting correctly states that the new budget calls for the eventual elimination of CATSA, a publicly owned corporation in charge of airport security screenings in Canada which is accountable to the Canadian parliament via Transports Canada.", "Buried in Bill Morneau's 460-page budget that was delivered Tuesday is a clause noting that the government is \"eliminating the Canadian Airport Security Authority (CATSA) which screens traveller baggage & workers”? can Canadians guess why??#CDNpoli https://t.co/ylUkU4C1uq", "In an annex on page 300 of the recently released budget, the section shown below states, “The Government also proposes to provide funding for the Canadian Transportation Agency and Transport Canada in support of transitioning CATSA to an independent, not-for-profit entity.”", "However, CATSA’s replacement by a new entity will not affect the way security checks are conducted in Canada, nor will Canada stop screening air travelers or airport workers, according to Simon Rivet, senior advisor for Transports Canada.", "“There is no plan to eliminate security checks for passengers or for merchandise transported by plane,” he told AFP by email in French. “Transports Canada will continue to play an exclusive role in terms of regulation and surveillance relative to security checks in Canadian airports.”", "Rivet added that safety and security remain priorities for the Canadian government, and that under the new system, “procedures, criteria and training requirements” for airport security workers will remain the same.", "Further, Canada is a signatory of the 1944 Chicago Convention on International Civil Aviation . As such, Canada is bound to the Standards and Recommended Practices (SARPs), general guidelines adopted under the Chicago Convention by the International Civil Aviation Organization (ICAO), a United Nations agency in charge of codifying international air navigation practices.", "Annex 17 of the ICAO’s SARPs, pictured below, stipulates that countries must have measures to prevent weapons, explosives or other dangerous devices from getting on board of aircraft.", "Not enforcing these regulations by foregoing airport security checks would put Canada at odds with international norms and could affect which countries would accept outbound Canadian flights.", "“Canada is still a member of ICAO and is still governed by the requirements to screen every passenger that passes through Canadian airports,” Chris Phelan, vice president for aviation security and industry affairs of the Canadian Airport Council, a division of Airports Council International-North America, told AFP.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]