["About this rating", "In late December 2017, posts appeared on social media reporting that a man had fallen into a three-day coma after discovering that his wife owned the house they had been renting together for 10 years. Most included an image purporting to be a screen capture of a story on CNN headlined, \"Man Wakes Up From 3Day Comma [sic].\"", "One of the earliest instances we found on Twitter was dated 31 December 2017 and included text written in Swahili:", "Man wakes up from a 3 day coma that he suddenly went into after realizing the house they've been renting for 10 yrs is owned by his wife. She's been his Landlady without his knowledge ??????? pic.twitter.com/pXJCU6XSX0", "— Hashi, MD (@SomPundit) December 31, 2017", "Someone loosely translated part of the text into English, and the resulting meme has been circulating ever since, appearing in tweets as recently as June 2019:", "Wait what? pic.twitter.com/G2yPSh6bMw", "— Give Me Internet (@GiveMeInternet) June 17, 2019", "These posts were widely shared and discussed thanks to their comedic value (people never seem to tire of \"battle of the sexes\" tales), but some commenters questioned the story's veracity, and we received requests from readers to authenticate it.", "Starting with the most prominent feature of the meme, the CNN image is clearly fake. It's beyond improbable that a major news outlet would run such a story \"live\" and label it \"breaking news,\" as was done in the image. It's equally improbable that they would run a segment with such an obvious chyron error: the misspelling of \"coma\" as \"comma.\" We found no evidence that CNN or any other legitimate news organization ever covered this story.", "We did find, interestingly enough, that it was covered (in a sense) on a South African junk news website, ABCNews.co.za, in 2018 (roughly nine months after it first took off on social media). But although it was illustrated with the fake CNN graphic, the article repeated a similar-but-different tale (no coma here) that had been making the social media rounds since mid-2016, with at least one variant dating back to 2011:", "A Man rented a house and moved in with his family, After 2 years the rent was increased, he did not complain because he liked the house and environment.", "After another 2 years, typical of landlord in Lagos, the rent was again increased and the man could not come up with the money.", "Pressure from the agent made him miserable and that point the wife offered to help, she decided to go borrow and the husband agreed to pay later. He was happy thanking God for the life of his wife.", "Another 2 years, Another increase on rent, he was so upset that he decided to meet with the landlord for dialogue but the agent prevented him. After doing underground Investigation to uncover who the landlord was, the revelation shocked him: He REALIZED HE HAS BEEN A TENANT IN A HOUSE BUILT AND OWNED BY HIS WIFE. What would you do ?", "We weren't surprised, once we traced the photograph of the gentlemen in the hospital bed to its origin, to find that it has nothing to do with a man recovering from a coma. The subject is actually Cecil Williams, a blind New Yorker who narrowly escaped death after falling off a subway platform in 2013 thanks to his service dog, who alerted bystanders to his plight. Williams' injuries weren't serious, nor was he at any point in a coma.", "We also discovered via a reverse-image search that this wasn't the only time Williams' photo was re-used under false pretenses. For example, it was co-opted for another junk news story about a man recovering from a coma in 2015. World News Daily Report (WNDR), a humor website that describes its content as \"satirical\" and \"fictional,\" published an article reporting that a man woke up from a six-day coma speaking only ancient Hebrew:", "As we noted above, anecdotal reports of a man finding out that his wife owns the house they've been renting were making the rounds in Africa years before a variant emerged claiming that the discovery caused the man to collapse into a coma. A possible point of origin for that variant was this late-December 2017 post by Twitter user @PabloHoggs:", "My uncle has been in a coma for the past two days after realizing the house he had been paying rent for the past 10 years was owned by his wife", "— *Pablo Martini* (@PabloHoggs) December 29, 2017", "The tweet received a lot of attention, garnering thousands of likes and re-tweets, and may well have inspired the creation of the CNN meme. We contacted @PabloHoggs and asked him a few questions via direct message in hopes of establishing whether the story had any basis in fact. Unfortunately, we know little more now than we did before we conversed with him.", "He did insist that the tweet was true. \"Yes, he later discovered the house he's been paying rent for is owned by his legally married wife,\" he wrote. \"The wife and my uncle [have] parted ways and he's doing well now.\"", "He also answered affirmatively when we asked whether his uncle was entirely unconscious for three full days, but when we asked if a doctor had actually diagnosed him as comatose, @PabloHoggs said he didn't know.", "He then asked us if he would be rewarded for the information he was providing, and when we said no he cut off the interview (such as it was).", "The most important thing we learned is that he didn't know if his uncle was clinically diagnosed with a coma. Taking the story at face value, it appears that his uncle may have suffered extreme emotional distress upon learning he had been paying rent to his own wife for years and was bedridden for three days in a condition his relatives described as a \"coma.\" Perhaps something like this happened, but he wasn't literally comatose. Emotional trauma isn't normally listed among the causes of a coma, which is defined as a state of prolonged unconsciousness that can result from a brain injury, seizures, diabetes, a drug overdose, or other physical cause.", "We did find mentions in the medical literature of a psychological condition known as \"psychogenic coma\" (or \"psychogenic unresponsiveness\") — described as a dissociative disorder with coma-like symptoms. But although case studies suggest that severe emotional trauma may be a contributing factor in such a condition, we came across no examples of a subject falling into a prolonged state of unconsciousness due to an instance of spousal deceit.", "In sum, we find the story improbable and redolent of an urban legend that was going around years before it became a meme, but insufficient evidence exists to definitively rule it true or false.", "Baxter, Cynthia and White, William.   \"Psychogenic Coma: Case Report.\"\r\n   The International Journal of Psychiatry in Medicine.   February 2003.", "Blignaut, Maryn.   \"Man Collapses into Coma After Finding Out His Wife Owns the Home They Rented for 10 Years.\"\r\n   Briefly.co.za.   May 2018.", "Cagiado, Silvana; Candido, Luigi; Pennati, Ambrogio.   \"Successful Integrated Hypnotic and Psychopharmacological Treatment of War-Related Post-Traumatic Psychological and Somatoform Dissociative Disorder of Two Years Duration (Psychogenic Coma).\"\r\n   Dissociation.   September 1997.", "Cartlidge, Niall.   \"States Related to or Confused with Coma.\"\r\n   Journal of Neurology, Neurosurgery & Psychiatry.   September 2001.", "Delano, Mojisola.   \"What Will You Do? Man Discovers His Wife Is the Landlady of the House He Has Been Paying Rent for 6 Years.\"\r\n   MojisolaDelano.com.   28 June 2016.", "Ng, Christina.   \"Donors Help Blind Man Keep Hero Dog that Saved Him After Subway Track Fall.\"\r\n   ABC News.   18 December 2013.", "ABCNews.co.za.   \"Man Collapses into Coma After Discovering that the House They Rented for 10 Years Belongs to the Wife.\"\r\n  18 September 2018.", "Africa News Hub.   \"Shocking! Man Discovers He Has Been Paying House Rent to His Own Wife Six Years After Renting Their Home.\"\r\n   28 June 2016.", "Mayo Clinic.   \"Coma: Symptoms & Causes.\"\r\n   Accessed 21 June 2019.", "Mayo Clinic.   \"Dissociative Disorders.\"\r\n   Accessed 21 June 2019.", "Nairaland Forum.   \"Husband Paid His Wife House Rent for Good 10 Years: Unknowingly.\"\r\n   18 October 2011.", "World News Daily Report.   \"Amnesiac Man Wakes from Coma Speaking Only Ancient Hebrew.\"\r\n   July 2015.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]