["By Rem Rieder", "Posted on July 21, 2020", "The Trump campaign has spent at least $20 million in July on advertising promoting the false and repeatedly debunked claim that presumptive Democratic presidential nominee Joe Biden favors defunding the police.", "Biden has said he doesn’t support that. “While I do not believe federal dollars should go to police departments violating people’s rights or turning to violence as the first resort, I do not support defunding police,” the former vice president said in a June 10 op-ed.", "A campaign spokesman also told us Biden supports more funding for police for initiatives to strengthen community relationships and for body-worn cameras.", "The Trump campaign’s latest TV ad debuted on July 20, just one day after a nationally televised interview in which President Donald Trump made the claim — and was instantly corrected by interviewer Chris Wallace, host of “Fox News Sunday.”", "The new commercial, which has aired most heavily in the swing states Florida and Pennsylvania, explicitly says that Biden supports defunding the police. Previous ads on the subject say that his supporters do and suggest that law enforcement spending would plummet during a Biden presidency, leaving Americans at the mercy of criminals. The campaign has spent $461,000 on the new ad in the first two days, according to Advertising Analytics.", "The issue came to the fore when Trump said falsely in his interview with Wallace, which was recorded July 17 and aired two days later, that “Biden wants to defund the police,” citing recommendations put together by allies of Biden and Sen. Bernie Sanders, his defeated rival for the Democratic presidential nomination. Wallace — correctly — immediately challenged the president’s claim.", "Trump: And Biden wants to defund the police.", "Wallace: No he, sir, he does not.", "Trump: Look. He signed a charter with Bernie Sanders; I will get that one just like I was right on the mortality rate. Did you read the charter that he agreed to with …", "Wallace: It says nothing about defunding the police.", "Trump asked for and received a copy of the Biden-Sanders Unity Task Force Recommendations. But there is no reference in it to defunding the police, as Wallace pointed out.", "Wallace: The White House never sent us evidence the Bernie-Biden platform calls for defunding or abolishing police — because there is none. It calls for increased funding for police departments–that meet certain standards. Biden has called for redirecting some police funding for related programs—like mental health counseling.", "Undeterred, after the interview was recorded, Trump on Friday tweeted that Biden favored defunding the police even if Biden used “different words.”", "Corrupt Joe Biden wants to defund our police. He may use different words, but when you look at his pact with Crazy Bernie, and other things, that’s what he wants to do. It would destroy America!", "— Donald J. Trump (@realDonaldTrump) July 18, 2020", "The task force document does not call for defunding or abolishing the police. As we wrote in June in examining another Trump campaign ad, the former vice president has said explicitly that he doesn’t support that.", "There is no agreed upon definition for the term “defund the police.” Some critics of the police, who believe there is systemic racism in law enforcement, really do want to abolish police forces and replace them with other forms of community safety entities. Others advocate shifting some money and functions away from police departments to social service agencies.", "But the Trump ads suggest defunding the police means taking away significant amounts of money, crippling law enforcement.", "In the wake of George Floyd’s death in police custody in Minneapolis on May 25, the Minneapolis City Council approved a proposed ballot measure to abolish the Police Department and instead form a new “Department of Community Safety and Violence Prevention.” The new entity would oversee “public safety services prioritizing a holistic, public health-oriented approach,” the proposal says. There may still be a law enforcement division, and the matter is up to voters to decide in the November election.", "Although we and others have debunked Trump’s assertion that Biden supports defunding the police, the Trump campaign has advertised heavily to suggest that he does and that the United States would be overrun with crime should Biden make it to the White House.", "The new ad, called “Break In,” shows an elderly woman watching TV, while someone is trying to break into her home. In the background, Sean Hannity of Fox News can be heard falsely reporting, “Joe Biden said he’s absolutely on board with defunding the police.” Biden is then heard saying, “Yes. Absolutely.” A clip of Biden making that same statement was used deceptively in a previous Trump campaign ad on the subject. In fact, Biden was responding to a question not about defunding the police but about shifting some funding to social service agencies: “But do we agree that we can redirect some of the funding?” progressive activist Ady Barkan asked in a July 8 interview.", "In a segment of the interview that didn’t appear on YouTube, Biden said he supports reforms, but “that’s not the same as getting rid of or defunding all the police.” (The Washington Post Fact Checker obtained audio of the full conversation.)", "When asked about redirecting some funding, which Biden agrees to, he goes on to say: “And by the way, not just redirect, condition them. If they don’t eliminate chokeholds, they don’t get Byrne grants. If they don’t do the following, they don’t get any help. If they don’t do — because you know as well as I do, the vast majority of all police departments are funded by the locality, funded by the municipality, funded by the state. It’s only the federal government comes in on top of that. And so it says you want help, you have to do the following reforms, you have to make sure you have no-knock warrants eliminated. If you have them, you don’t get Byrne grants.”", "Byrne grants are awarded to local governments by the U.S. Department of Justice.", "In the next part of the TV ad, the woman at home tries to call the police and hears this message “You’ve reached 911. I’m sorry that there is no one here to answer your emergency call. But leave a message and we’ll get back to you as soon as we can.”", "These words flash on the screen: “You won’t be safe in Joe Biden’s America.”", "The ad and similar Trump ads running this month are completely groundless.", "Biden has said in no uncertain terms that he does not endorse defunding the police.", "“No, I don’t support defunding the police,” Biden told “CBS Evening News” anchor Norah O’Donnell on June 8. “I support conditioning federal aid to police, based on whether or not they meet certain basic standards of decency and honorableness. And, in fact, are able to demonstrate they can protect the community and everybody in the community.”", "Biden reiterated that position in an op-ed published in USA Today on June 10.", "Biden, June 10: While I do not believe federal dollars should go to police departments violating people’s rights or turning to violence as the first resort, I do not support defunding police. The better answer is to give police departments the resources they need to implement meaningful reforms, and to condition other federal dollars on completing those reforms.", "So, while the former vice president has rejected the notion of defunding the police, police could lose some federal aid if they refuse to implement what Biden called “meaningful reforms.” Then again, police could also receive more funding to implement changes in policing, under Biden’s approach.", "When we asked the Biden campaign about the issue, spokesman Andrew Bates sent us a statement saying that Biden opposes defunding the police but supports changes. The statement also says Biden supports more money for certain initiatives that would strengthen the relationship between the police and the community and for body-worn cameras.", "The Trump campaign has spent $2.7 million as of July 21, according to Advertising Analytics, on an ad that debuted on July 15 and closes with the words “YOU WON’T BE SAFE IN JOE BIDEN’S AMERICA.” The ad has aired in traditional swing states and newly contested ones, among them Florida, Pennsylvania, Georgia, Arizona and North Carolina.", "The ad, which begins with a ringing but unanswered phone, talks of the “radical left-wing mob’s agenda,” which includes “defund the police.” It then says, “Joe Biden stands with them.”", "It also includes another deceptively edited sequence in which Biden seemed to agree — “Yes. Absolutely.” — to the idea of cutting police funding. In fact, as we said, he was responding to the question about shifting some funding to social service agencies.", "As of July 21, the Trump campaign also has spent $16.5 million, according to Advertising Analytics, on a TV ad called “Abolished.” The ad, which debuted July 2, has aired heavily in Florida, Pennsylvania, and Georgia. The campaign also has spent $357,000 on a Spanish version of the ad, according to Advertising Analytics.", "As the other commercial does, this one ends with these words on the screen: “You won’t be safe in Joe Biden’s America.”", "As images of rioting and mayhem roll across the screen, the ad’s narrator says, “You have reached the 911 police emergency line. Due to defunding of the police department, we’re sorry but no one is here to take your call.” The caller is instructed to press one to report a rape, two to report a murder and three to report a home invasion. All other callers are told to leave a message, and that the current wait time to receive a return call is five days.", "These words appear on the screen: “Joe Biden’s supporters are fighting to defund police departments.”", "All three ads, like the one we wrote about in June, falsely claim or suggest that Biden supports a policy he has explicitly rejected.", "Editor’s note: FactCheck.org does not accept advertising. We rely on grants and individual donations from people like you. Please consider a donation. Credit card donations may be made through our “Donate” page. If you prefer to give by check, send to: FactCheck.org, Annenberg Public Policy Center, 202 S. 36th St., Philadelphia, PA 19104.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]