["The picture was published on February 27, 2021, in a Facebook group with more than 14,000 members.", "The picture shows a document labelled “certificate of Covid-19 vaccination” for a recipient who received the Pfizer-BioNTech vaccine.", "“Effects: may cause prolong erection and increase in size (sic),” reads part of the document circled in red.", "Text on the document suggests it was issued by Jurong Community Hospital in Singapore.", "The picture has also been shared here, here and here on Facebook; here on Twitter; and on a local forum, with a similar claim.", "Singapore started its Covid-19 vaccination drive in December 2020, making it one of the first Asian nations to roll out inoculations.", "However, the picture circulating on social media is not authentic.", "Covid-19 vaccination card", "A reverse image search on Google, followed by a keyword search, found this Facebook post by JurongHealth Campus.", "“FAKE NEWS ALERT,” the post reads. “We are aware of a fake and doctored image of a COVID-19 vaccination certificate issued by our Staff Clinic based at Jurong Community Hospital that is being circulated online. This is misinformation which was not issued by the hospital.”", "AFP found photos of genuine vaccination certificates from Jurong Community Hospital posted online by social media users, including here, here, here and here. The certificates contain no reference to the side effects described in the misleading posts.", "Genuine side effects", "Common side effects of Covid-19 injections can include tenderness, swelling and/or redness at the injection site, headache, muscle ache, fatigue  and fever, according to Singapore’s Ministry of Health, the US Centers for Disease Control and Prevention, Britain’s National Health Service and Harvard Medical School.", "Below is a screenshot of Singapore’s Ministry of Health website on March 5, 2021:", "The US Food and Drug Administration published a memorandum on the authorisation of the Pfizer-BioNTech Covid-19 vaccine, which made no mention of side effects to the male reproductive system.", "AFP Fact Check previously debunked another claim that involved the Covid-19 vaccine and male virility here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]