["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Gov. Terry McAuliffe says there’s not much fraud in Virginia’s Medicaid program. He offered a statistic to prove his point during a recent interview with WRVA radio host Jimmy Barrett.", "McAuliffe: \"Well if you read the Richmond Times-Dispatch, I think it was yesterday, they did the political fact-check, and I give them credit for that. They answered the question. Do you know what the fraud rate is, Jimmy, in Virginia? Do you have any idea?\"", "Barrett: \"No what’s the fraud rate?\"", "McAuliffe: \"Well, you had one delegate going around saying it was 30 percent. It was fact-checked yesterday. Point-four-seven percent, less than half a percent. That’s the facts.\"", "Our ears perked for two reasons: 1) We had never written a fact-check that said the fraud rate of Virginia’s Medicaid program is 0.47 percent, and; 2) We thought it was high time to do that fact-check now.", "Brian Coy, a McAuliffe spokesman, said the governor erred when he cited a March 23 Truth-O-Meter as the source for the 0.47 percent figure. That article examined a claim by Del. Jimmie Massie, R-Henrico, that 30 percent of the state’s Medicaid program was \"lost to waste, fraud and inefficiencies.\" We rated the claim Mostly False, saying that no study has ever quantified the amount of fraud, waste and inefficiency in Virginia’s system.", "Coy said the governor made a simple mistake, conflating our story with a fraud figure his staff had just provided to him.", "So that brings us to the next matter: Is the Medicare fraud rate 0.47 percent in Virginia? It’s an important question because the General Assembly is divided over expanding eligibility for the program to an additional 400,000 low-income and disabled Virginians under provisions of the Affordable Care Act.", "McAuliffe and the Democratic-controlled state Senate support the growth, noting that the federal government will pick up the entire tab for the next three years and 90 percent of the cost down the road. But the Republican-led House has twice rejected the expansion, maintaining, among other things, that Medicaid is rife with waste and should not be expanded before the abuse is curbed.", "The governor sought to refute the GOP argument by offering the 0.47 percent figure. But contrary to his statement, the statistic is not a measurement of Medicaid fraud.", "That figure is part of a \"payment error rate measurement\" compiled by the Centers for Medicare and Medicaid Services. It’s a computation of the percentage of Medicaid bills that were paid for services Virginians were ineligible to receive. Some of the errors result from fraud and some come from simple clerical mistakes. Each state’s error rate is examined every three years.", "\"It is important to note the error rate is not a ‘fraud rate’ but simply a measurement of payments that did not meet statutory, regulatory or administrative requirements,\" the CMS says on its website.", "Matt Salo, executive director of the National Association of Medicaid Directors, sounded the same warning, \"It’s not a very accurate indicator of fraud,\" he told us. \"It’s not really set up to measure fraud.\"", "We should note Virginia, under this measurement, seems to perform well, Nationally, 3.3 percent of Medicaid payments go to services for ineligible people. But CMS discourages such comparisons, saying that the sample of bills reviewed from each state is small.", "There have been studies in recent years estimating as much as 30 percent of all healthcare spending across the nation is lost to waste, fraud and inefficiencies. But the authors of those reports, as we pointed out in our story on Del. Massie’s claim, stress that their estimates don’t carry over to individual states, let alone the Medicaid program in any one state.", "Pinpointing Medicaid fraud rates is all but impossible. \"Some (fraud) is found out eventually, but a lot of it, most of it, is never detected,\" explained Kip Piper, a former senior advisor to the Centers on Medicare and Medicaid Services.", "The Department of Medical Assistance Services, which oversees Virginia’s Medicaid system, does not try to calculate a fraud percentage. \"There is no officially designated term or standardized metric to calculate a ‘fraud rate,’\" Craig Markva, a DMAS spokesman, wrote in an email.", "Our ruling", "McAuliffe said the state has a fraud rate of 0.47 percent and that PolitiFact Virginia had verified that figure. A spokesman for the governor said McAuliffe made an innocent mistake in saying we found the statistic to be correct.", "In fact, we had never looked at the figure until now, and a number of experts told us that the governor erred in interpreting it as a fraud rate. The 0.47 is a computation of the percentage of Medicaid bills that were paid in 2012 for services that Virginians were ineligible to receive. Some of those errors resulted from deceit and some were simply caused by clerical errors.", "Neither the state nor the federal government offer a standard measurement of Medicaid fraud because much of the abuse is undetected. So the governor comes up empty. We rate his statement False.", "Gov. Terry McAuliffe’s comments on WRVA’s Ask the Governor segment, March 27, 2014. (Statement is about 13:30 into recording).", "Interviews with Brian Coy, spokesman for Gov. Terry McAuliffe, March 31 and April 2, 2014.", "E-mail from Brian Coy, March 31, 2014.", "Louis Elie, director of the program integrity division at the Department of Medical Assistance Services, presentation to the Medicaid Innovation and Reform Commission, Dec. 17, 2013.", "Centers for Medicare and Medicaid Services, \"Payment Error Rate Measurement (PERM),\" accessed April 1, 2014.", "Centers for Medicare and Medicaid Services, \"Fiscal years 2009-2011 Medicaid Payment Error Rate Measurement (PERM) Program rates,\" accessed April 2, 2014.", "Centers for Medicare and Medicaid Services, notification of FY 2012 Medicaid error rates for Virginia, Dec. 20, 2013.", "E-mail from Craig Markva, spokesman for the Virginia Department of Medical Assistance Services, April 2, 2014.", "Joint Legislative Audit and Review Commission, \"Interim Report: Fraud and error in Virginia’s Medicaid program,\" Oct. 12, 2010.", "Paymentaccuracy.gov, \"Medicaid,\" accessed April 2, 2014.", "Paymentaccuracy.gov, \"FAQS,\" accessed April 4, 2014.", "Interview with Kip Piper, former senior advisor to the Centers on Medicaid and Medicare Services, April 1, 2014.", "Interview with Kavita Choudry, manager of the Pew Charitable Trust’s Health Care Spending Project, April 2, 2014.", "Kaiser Family Foundation, \"Program integrity in Mediciad, a primer,\" July 2012.", "E-mail from Jeremy Ratner, spokesman for the Pew Charitable Trusts, April 2, 2014.", "Pew Charitable Trusts, \"Combating Medicaid Fraud and Abuse,\" March 2013.", "The Council on State Governments, \"Understanding payment error rates for Medicaid,\" Jan. 26, 2012.", "National Association of Medicaid Directors, \"NAMD issues statement on recent PERM report,\" Jan. 19, 2012.", "National Association of Medicaid Directors, \"Rethinking Medicaid Program Integrity: Eliminating duplication and investing in effective high-value tools,\" March, 2012.", "Government Accounting Office, \"High-risk series an update,\" February, 2013.", "Government Accounting Office, \"Medicaid: Enhancements needed for improper payments reporting and related corrective action monitoring,\" March, 2013.", "PolitiFact Wisconsin, \"On average, 20 to 25 cents of every $1 spent on four government assistance programs is lost to fraud, Sen. Ron Johnson says,\" Jan. 20, 2014.", "Health Affairs, \"Eliminating fraud and abuse,\" July 31, 2012.", "Interview with Matt Salo, executive director of the National Association of Medicaid Directors, April 2, 2014.", "Interview with Bill Hazel, Virginia’s secretary of health, April 3, 2014.", "Department of Health and Human Services,  \"Agency Financial Report,\" 2013 fiscal year.", "Interview with Cindi Jones, director of the Department of Medical Assistance Services, April 3, 2014.", "Interview with Louis Elie, director of the Program Integrity Division at DMAS, April 3, 2014.", "Journal of the American Medical Association, \"Eliminating waste in U.S. Health Care,\" April 11, 2012.", "Centers for Medicare and Medicaid Services, \"Payment error rate measurement manual,\" Oct. 15, 2013.", "PolitiFact Virginia, \"Jimmie Massie says 30 percent of Virginia’s Medicaid spending is lost to fraud,\" March 23, 2014.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]