["Envoy Medical said that the claims about its hearing implant were inaccurate and that its device “cannot secretly and wirelessly transmit conversations.”", "Biden’s medical and surgical history summary does not mention any skull implant. The summary says his hearing is normal.", "Time for another high-stakes political event? Then it must be time for conspiracy theories to flood social media timelines. Watch out.", "No, Democratic presidential nominee Joe Biden does not have a medical device implanted in his skull that he turns on after reaching into his pocket so he can hear someone on the other end give him answers to questions. That’s a bogus claim shared on Facebook ahead of the first presidential election debate between Biden and President Donald Trump.", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "There are a lot of false claims packed into the nearly 1,000-word post claiming to prove how Biden \"is cheating.\" The Sept. 28 post tries to build on Trump’s narrative that Biden is mentally unfit to be president.", "Part of the post said:", "\"This is going to sound like something out of a science fiction movie but bear with me. This is totally real, and I’ll prove it to you.", "\"Joe Biden has a medical device implanted in his skull.", "\"It’s called the Esteem Hearing Implant which you can learn about HERE. It’s an implant that goes into the skull above the ear and it has two micro-wire probes that are injected into the nerves inside the ear canal. It’s FDA-approved and it uses bone conduction to enhance hearing (sound waves vibrate off the bones of the skull, and the wire probes send the signal directly into the ear, basically). It’s wireless and it’s controlled by the push of a button, so the user can turn it on and off with a little device… that fits in your pocket. And that’s how the experts at Bombards Body Language spotted this trick. …", "\"When Joe Biden gets confused, he reaches into his pocket and turns on the implant. Whoever is talking to him on the other end instructs him to smile and then starts relaying answers to him until he gets back on track. Joe hears it because the implant receives a wireless signal and vibrates the bones in his skull.\"", "The post does not offer any link to learn more, despite its suggestion that it has a source.", "Envoy Medical on Twitter Sept. 29 said that the claims about its hearing implant were inaccurate and that its device \"cannot secretly and wirelessly transmit conversations.\" The company said:", "\"There is a false story circulating on the internet and in social media that claims that Envoy Medical’s Esteem Hearing Implant can be used to wirelessly transmit conversations or information into the ear.", "\"The Esteem Hearing Implant is not capable of this type of wireless communication and cannot be used in the manner described. The implant is a completely internal hearing device that improves the hearing of adults diagnosed with moderate to severe sensorineural hearing loss.\"", "Biden’s campaign also refuted Trump campaign claims that Biden won’t agree to an ear inspection and that Biden wanted multiple breaks during the 90-minute debate. \"Of course he’s not wearing an earpiece and we never asked for breaks,\" Kate Bedingfield, Biden’s deputy campaign manager and communications director, told reporters Sept. 29.", "In December 2019, Biden’s primary care physician, at Biden’s request, issued a summary of his medical and surgical history. It did not mention any skull implant or hearing aid and said that his head, ears, eyes, nose and throat \"are normal.\"", "A Facebook post claimed Biden has a medical device implanted in his skull so he can hear someone give him answers to questions.", "That’s a fabricated and baseless claim.", "We rate it Pants on Fire!", "Archive of Sept. 28, 2020 Facebook post", "Email interview, Joe Biden’s press office, Sept. 29, 2020", "JoeBiden.com, Biden’s medical and surgical history", "Twitter, @mviser tweet, Sept. 29, 2020", "Twitter, @EnvoyMedical tweet, Sept. 29, 2020", "Twitter, @TeamTrump tweet, Sept. 29, 2020, @TrumpWarRoom tweet, Sept. 29, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]