["A Facebook user, Bhola Nath Varma posted two videos, supposedly of a Pakistani news channel report saying, “देखिये और सोचिज। (Watch and think- translation)”. The message posted along with the video suggests that social media users should see this on-ground news report after the Balakot air strike in Pakistan to comprehend the reality. In the video, some people can be seen carrying the corpses of those who apparently died in the attack. The post, which has now been deleted, had garnered more than 10,000 shares and close to 9 lakh views.", "One Megha Osheen also tweeted the video with the claim that Pakistani journalists are giving us the evidence of the air strike. It has racked up close to 1300 retweets so far.", "Yeh lo saboot. Pakistani joirnalists de rahe hai saboot. Arrey jaldi leke jao usko. Chupao yaar. Camera band kar yaar. Isko mat dikhao yaar, yeh apni bezzathi ho rahi hai. Pakistan ki bezzathi ho rahi hai yaar. Bhaiyya bhaiyya ek peg banaake lao jaldi se.😂😂😂 HOW IS THE JOSH? pic.twitter.com/A7j2lZZEEe", "— 🇮🇳Megha Osheen🇮🇳 (@Megha94507473) March 7, 2019", "Another Facebook page, 4K Viral Hindustan has also shared the video with the identical text.", "In the comments section of Facebook posts and as responses to the Twitter post, several people expressed their doubts regarding the veracity of the video.", "Although I don't doubt what forces say, but you must check the veracity of this video. The area has trees with short leaves which is typical of desert vegetation, and not of Balakot which doesn't lack moisture. Check before mass sharing otherwise it may backfire.", "— Kaushal Pandey (@kaushalpandey28) March 9, 2019", "Alt News found that the video attempts to portray a Pakistani news channel trying to cover-up the deaths due to the IAF air strike. When we looked at the video frame-by-frame, in one particular frame, we found that the text inscribed on the microphone, held by the reporter reads, “लाईट टीवी (Light TV)“. It is highly improbable that a Pakistani news channel’s mic would have a logo written in Hindi. Moreover, the behaviour of the duo shown as reporters in the video is atypical to reporters covering such a serious incident, involving multiple casualties.", "Even though the attempt is to portray a Pakistani channel,the language spoken in the video doesn’t even remotely sound like Urdu. For instance, the reporter says, “khuda ki daya se”, whereas a person with a basic fluency in Urdu would prefer to say, “khuda ke karam se”. Also, the duo in the video use Hindi words like ‘jyada’, and ‘ nivedan’. Had the correspondents been based in Pakistan, their most common choice of words would have been, ‘zyada’, and, ‘guzaarish‘.", "In conclusion, an staged news report of the Balakot air strike was believed to be a ground report from the bombed site in Pakistan.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "Amid the ongoing Israel-Palestine conflict, media outlet Times Now put out a report claiming that…", "A 45-second video clip is being shared widely on social media where a group of…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…"]