["The photo was published in this Twitter post on December 29, 2019.", "The photo caption states: “Suffragette in prison”.", "Below is a screenshot of the misleading post:", "“Suffragette” refers to women who campaigned for women’s rights, primarily the right to vote in political elections, from the 19th century to the late 20th century in the UK and the US.", "The same photo was also shared here, here and here on Twitter; here on Facebook; and here on Pinterest, with a similar claim.", "The claim is misleading; the photo actually shows a mock prison cell which was by suffragettes at the Women’s Exhibition in London, England in 1909.", "The same photo was published here by the Museum of London.", "Below is a screenshot of the photo:", "The caption states: “Suffragette 'prison' stand at The Women's Exhibition. A mock prison cell was erected at The Women's Exhibition held at Prince's Skating Rink, Knightsbridge, on 13-26 May 1909. At 3.30, 5 and 8pm, the 'female prisoner', played by an actual ex-prisoner, demonstrated the daily duties that suffragette prisoners carried out. These included scouring pots and pans, making beds, scrubbing floors, sewing and making mailbags. Visitors to the exhibition paid 6d (sixpence) for admission and an explanation of prison life.", "“Image Details: Artist/Photographer/Maker Christina Broom, Date 1909 AD - 1909 AD”.", "Here is an article about Broom, who frequently photographed suffragettes, published on the museum’s website on December 14, 2017.", "Other images of suffragettes credited to her can be found here, here and here on the museum’s website.", "MailOnline, the website for UK tabloid The Daily Mail, used the same photo of the mock prison stand in this report published on August 22, 2017.", "The photo caption states: “A mock prison cell for Suffragettes erected at The Women's Exhibition held at Prince's Skating Rink in Knightsbridge, May 1909”.", "Below is a screenshot of the image in the report highlighted in red by AFP:", "The same misleading claim was debunked in this tweet posted by Twitter account Fake History Hunter on December 30, 2019.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]