["Trailing Democratic challenger Mark Kelly in one of the country’s most hotly contested Senate races, Arizona Sen. Martha McSally is seeking to tie herself to an issue with across-the-aisle appeal: insurance protections for people with preexisting health conditions.", "\"Of course I will always protect those with preexisting conditions. Always,\" the Republican said in a TV ad released June 22.", "The ad comes in response to criticisms by Kelly, who has highlighted McSally’s votes to undo the Affordable Care Act. That, he argued, would leave Americans with medical conditions vulnerable to higher-priced insurance.", "The Arizona Senate race has attracted national attention and is considered a toss-up, though Kelly is leading in many polls. McSally’s attempt to present herself as a supporter of protecting people with preexisting conditions — a major component of the 2010 health law — is part of a larger pattern in which vulnerable Republican incumbents stake out positions advocating for this protection while also maintaining the GOP’s strong stance against the ACA.", "McSally, who was appointed by the governor to take over John McCain’s Senate seat in 2019, used similar messaging in her failed 2018 bid for the state’s other Senate position. And President Donald Trump echoed the declaration at a June 23 rally in Phoenix, saying McSally — along with the rest of the Republican Party — \"will always protect people with preexisting conditions.\"", "With that in mind, we decided to take a closer look. We contacted McSally’s campaign, which cited her support of a different piece of legislation, the Protect Act. But independent experts told us that legislation doesn’t satisfy the standard she sets out.", "Only one national law makes sure people with preexisting medical conditions don’t face discrimination or higher prices from insurers. It’s the Affordable Care Act.", "Both as a member of the House of Representatives and as a senator, McSally has supported efforts to undo the health law — voting in 2015 to repeal it and in 2017 to replace it with the Republican-backed American Health Care Act, which would have permitted insurers to charge higher premiums for people with complicated medical histories.", "\"Anyone who voted for that bill was voting to take away the ACA’s preexisting condition protections,\" said Jonathan Oberlander, a health policy professor at the University of North Carolina-Chapel Hill. \"Sen. McSally is trying to erase history for electoral purposes.\"", "Especially as COVID-19 cases climb, health care— and, in particular, the ACA — has emerged as a flashpoint in the Arizona election, said Dr. Daniel Derksen, a professor of public health, medicine and nursing at the University of Arizona.", "\"Martha McSally has in her actions, in her votes, been pretty consistent about cutting back benefits and trying to repeal the ACA without any clear plan in mind that would protect people who gained insurance through the ACA,\" Derksen added. \"Her words on preexisting condition protections don’t align with any votes I’ve seen.\"", "McSally’s campaign argued that the ACA is just one strategy, and a flawed one at that. Dylan Lefler, her campaign manager, instead pointed to her support of the Republican-backed Protect Act as evidence to back up her promise. Specifically, it ostensibly bans insurance plans from \"impos[ing] any preexisting condition exclusion with respect to … coverage,\" per the bill text.", "The problem, though, is that simply banning that exclusion isn’t enough, because the law also has to make sure the health insurance plans that cover pre-existing conditions remain affordable. The bill, sponsored by Sen. Thom Tillis (R-N.C.), does nothing to provide subsidies or cost-sharing mechanisms -- meaning people both with and without pre-existing conditions wouldn’t necessarily be able to afford those plans. Without that framework, the act remains a \"meaningless promise,\" argued Linda Blumberg, a fellow at the Urban Institute, a social policy think tank.", "And it has other holes: for instance, permitting insurers to charge women more than men.", "\"No six-page bill is ever the way of achieving something,\" said Thomas Miller, a scholar at the American Enterprise Institute. \"This is a check-the-box effort to try to say, ‘We’re [moving] in that direction.’\"", "It’s not just legislation. There’s also Texas v. Azar, a pending case in which a group of Republican attorneys general are arguing the Supreme Court should strike the entire health law, including its preexisting condition protections. The Trump administration has sided with the Republican states.", "McSally has consistently declined to comment on the lawsuit, saying she doesn’t want to weigh in on \"a judicial proceeding.\" In reporting this fact check, we asked where she stood on the case. The campaign didn’t specifically answer, but pointed to her general disapproval of the ACA. Meanwhile, Senate Democrats have called on the administration to reverse its stance.", "That context makes McSally’s silence especially relevant, said Sabrina Corlette, a research professor at Georgetown University.", "\"When given the opportunity, she has declined to oppose this lawsuit, which would essentially eliminate the protections that exist,\" Corlette said.", "So — big picture? McSally’s record in Washington hasn’t been one of preserving or building on preexisting condition protections.", "In her new TV ad, McSally claims she will \"always protect those with preexisting conditions.\"", "But nothing in her voting record, which tracks closely with the Republican repeal-and-replace philosophy, supports this claim. And she has continually declined opportunities to oppose a pending legal threat to the ACA, including its provisions related to preexisting conditions, by a group of GOP governors and supported by the Trump administration.", "Meanwhile, the legislation her campaign cited to justify her stance falls short in terms of meaningfully protecting Americans with preexisting medical conditions.", "McSally has not in the past or present taken actions that back up her statement. We rate it False.", "YouTube, \"Shameful,\" Martha McSally, June 22, 2020.", "Bill introduced by U.S. Sen. Thom Tillis, \"Ensuring Coverage for Patients with Pre-Existing Conditions Act,\" on Congress.gov.", "Email interview with McSally for Senate, June 23, 2020.", "Email interview with Jonathan Oberlander, professor and chair of social medicine at University of North Carolina-Chapel Hill, June 23, 2020.", "Telephone interview with Linda Blumberg, fellow at the Urban Institute’s Health Policy Center, June 24, 2020.", "Telephone interview with Sabrina Corlette, professor at Georgetown University's Health Policy Institute, June 23, 2020.", "Telephone interview with Daniel Derksen, professor of public health, medicine and nursing at the University of Arizona, June 23, 2020.", "Telephone interview with Thomas Miller, resident fellow, American Enterprise Institute, June 24, 2020.", "FiveThirtyEight, \"New Polls and New Candidates Are Giving Democrats Some Hope of Flipping the Senate,\" March 30, 2020.", "The Hill, \"Vulnerable Republicans Dodge Questions on Support for Obamacare Lawsuit,\" March 6, 2020.", "The Hill, \"Senate Democrats Pressure Trump to Drop Obamacare Lawsuit,\" Feb. 14, 2020.", "PolitiFact, \"Cunningham Says Tillis Voted to 'Take Away' Coverage for Pre-Existing Conditions,\" March 2, 2020.", "PolitiFact, \"Fact-Checking Martha McSally on Pre-Existing Conditions,\" Oct. 30, 2020.", "PolitiFact, \"Does the GOP's New Health Care Bill Still Cover Pre-Existing Conditions, As Trump Claims?\" May 1, 2017.", "The New York Times, \"G.O.P. Faces Risk From Push to Repeal Health Law During Pandemic,\" June 22, 2020.", "Vox, \"Democrats Are Seeing a Much Better Chance of Retaking the Senate in 2020,\" June 11, 2020.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]