["About this rating", "On 18 August 2016, the U.S. Department of Agriculture and other federal and local agencies hosted an event called The Iowa LGBT Rural Summit, the purpose of which was \"to share information relating to policies, programs, and services that exist to protect, promote and strengthen LGBT rural communities.\" Among the topics discussed at the Des Moines get-together were rural housing loans, community facility grants, and bullying.", "Des Moines' Drake University participated in the event, summarizing its rationale thus:", "Many LGBT people choose to live, work, and raise their families in rural areas. To highlight the unique needs of this community, the U.S. Department of Agriculture has partnered with Drake Law School, One Iowa, the National Center for Lesbian Rights, and True Colors Fund to organize the Iowa LGBT Rural Summit.", "The purpose of the event was described in somewhat different terms by conservative commentators, however. Modern Farmer noted the difference in an article published on 24 August:", "Various right-wing blogs picked up the event, presumably from a Google Alert for “LGBT,” and promptly spun it into something very strange and surreal. “The all-day summit will teach lesbian and transgender hillbillies how to get subsidies from the government like rural housing loans and ‘community facility grants,'” writes Elizabeth Harrington of the right-wing Washington Free Beacon.", "Likewise, radio talk show host Rush Limbaugh spent almost an entire segment of his 17 August program railing against an impending invasion of rural America by lesbian farmers. As you'll see in this transcribed excerpt, Limbaugh's thesis was indeed that Democrats are recruiting lesbians to \"attack\" conservative strongholds:", "Have you heard the latest Democrat scam? Have you heard about the agriculture department's financial grants to lesbian farmers? You think I'm making this up? See, this is how they do it.", "...", "Rural America happens to be largely conservative. Rural America is made up of self-reliant, rugged individualist types. They happen to be big believers in the Second Amendment. So here comes the Obama Regime with a bunch of federal money and they're waving it around, and all you gotta do to get it is be a lesbian and want to be a farmer and they'll set you up. I'm like you; I never before in my life knew that lesbians wanted to be farmers.", "I never knew that lesbians wanted to get behind the horse and the plow and start burrowing. I never knew it. But apparently enough money can make it happen, and the objective here is to attack rural states. They're already attacking suburbs, and that has been made perfectly clear by what happened in Milwaukee. They're going after every geographic region that is known to be largely conservative. They never stop, folks. They are constantly on the march.", "Chait, Jonathan.   \"Mass Lesbian Farm Infiltration Is Obama’s Best Scheme Yet.\"\r\n    New York Magazine.   23 August 2016.", "Nosowitz, Dan.   \"Limbaugh Terrified of Lesbian Farmers for Some Reason.\"\r\n    Modern Farmer.   24 August 2016.", "The Rush Limbaugh Show.   \"Latest Lib Assaults: Lesbian Farmers, Transgender Homeless Shelters, American Flags Ripped from Fire Trucks.\"\r\n    17 August 2016.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]